{
  "url": "https://www.wikihow.com/Get-a-Good-Jazz-Guitar-Tone",
  "title": "How to Get a Good Jazz Guitar Tone",
  "steps": [
    {
      "title": "Turn off your effects, set all your EQ knobs to the middle, and set your amp to a clean channel (if you have one).",
      "content": "Turn off your effects, set all your EQ knobs to the middle, and set your amp to a clean channel (if you have one). Jazz guitar tone is usually very simple and clean, and though some guys like John Scofield might play with distorted tones, most jazz groups will want a sound that blends into the mix better. You aren't playing a lead role like you might in a rock band, so get ready to back down your master volume too."
    },
    {
      "title": "Set your guitar's controls.",
      "content": "Set your guitar's controls. The volume and tone controls on your guitar are there for a reason, and it's not to be rolled all the way up all the time. Set your guitar volume around seven or eight (if you don't have marked knobs, just estimate) and set the tone around halfway. You'll be adjusting as you go but this is a good way to hear the basic sound of your guitar and amp."
    },
    {
      "title": "Play your guitar a bit and listen.",
      "content": "Play your guitar a bit and listen. Play some lead lines and strum some chords. Is your tone too bright? Too distorted? Figure out what you want in a guitar tone and what you don't like about your current sound."
    },
    {
      "title": "If you're too dirty, turn down the gain and low/bass frequencies.",
      "content": "If you're too dirty, turn down the gain and low/bass frequencies. If your amp has a lot of headroom, then you can get away with a higher gain setting, but if your amp distorts quickly, then you'll need to turn that down. Depending on your speaker size, lower notes can make your speaker distort too."
    },
    {
      "title": "If you sound too bright, roll down your guitar's tone and your amps high/treble frequencies.",
      "content": "If you sound too bright, roll down your guitar's tone and your amps high/treble frequencies. Don't go too low, or you will be inaudible during solos, but try out different settings and see what works. Consider playing with your fingers if you're a fan of Wes Montgomery's tone."
    },
    {
      "title": "If it sounds dull or weak, try adding a hint of reverb at the amp or with a pedal.",
      "content": "If it sounds dull or weak, try adding a hint of reverb at the amp or with a pedal. You don't want to sound like a rockabilly player, but a bit of reverb can give you a fuller tone and make you sound better in an acoustically dead room."
    }
  ]
}