{
  "url": "https://www.wikihow.com/Get-a-Personalized-License-Plate-in-Maryland",
  "title": "How to Get a Personalized License Plate in Maryland",
  "steps": [
    {
      "title": "Go to the Maryland MVA's online services website.",
      "content": "Go to the Maryland MVA's online services website. Click on Maryland’s Motor Vehicle Administration (MVA) online services website to start the online application process. If you experience technical difficulties using the website, try updating your browser, using a different browser, or turning off your anti-virus software."
    },
    {
      "title": "Click on “Personalized Plate” in the menu under “Vehicle Services.”",
      "content": "Click on “Personalized Plate” in the menu under “Vehicle Services.” Here you will see additional information on pricing and requirements for obtaining personalized plates in Maryland. You must have the vehicle title number and the current vehicle tag number to order vanity plates in Maryland. The Maryland MVA charges $50.00 per renewal year for personalized plates, and there is a replacement plate fee of $20.00 for vanity plates. There is an added $10.00 per year renewal fee for background scene plates."
    },
    {
      "title": "Enter your email address or phone number, then click “Next.”",
      "content": "Enter your email address or phone number, then click “Next.” An email address and/or phone number is required to continue the online application. The Maryland MVA will use your email for future communications and renewal notices."
    },
    {
      "title": "Select a plate background and personalized text for your plate.",
      "content": "Select a plate background and personalized text for your plate. You may request personalized text with at least 2 and up to 7 characters. Characters can only be numbers, letters, or spaces. Make sure to click “Check Text Availability” to ensure that your text is available and acceptable to the MVA. The Maryland MVA reserves the right to reject plates for any number of reasons, including if they contain curse words, epithets, or obscenities, or if they might be used for fraudulent or deceptive purposes."
    },
    {
      "title": "Click on \"Accept Plate,\" and enter your vehicle data.",
      "content": "Click on \"Accept Plate,\" and enter your vehicle data. Enter your vehicle tag number and vehicle title number. These are required fields."
    },
    {
      "title": "Click “Next” and follow all instructions to complete the application.",
      "content": "Click “Next” and follow all instructions to complete the application. You can pay all required fees online by credit card. If you provided an email address, you will receive an electronic confirmation of your order via email."
    },
    {
      "title": "Print out an application for personalized plates.",
      "content": "Print out an application for personalized plates. Print out form VR-164, which is an Application for Special Registration Plates. Make sure to read both pages of the application before filling it out. You can fill out the form online and print it when it’s completed, or you can print it out first and then write in the required information. Those with disabilities who are applying for disability personalized plates must also include a completed form VR-210, which is an Application for Maryland Parking Placards/License Plates for Individuals with a Disability, and this must be signed by a certified healthcare professional."
    },
    {
      "title": "Fill out the application in its entirety.",
      "content": "Fill out the application in its entirety. Make sure to check “Personalized Registration” for the type of plate desired, and select your vehicle class. Enter the vehicle owner's name, address, and telephone number. If applicable, include co-owner's name. Also supply vehicle information including make, year, Vehicle Identification Number (VIN), title and tag numbers, and sticker number and year. Include name of the applicable insurance company, policy number, and agent name."
    },
    {
      "title": "Write in up to 4 choices for your plate in the character boxes provided.",
      "content": "Write in up to 4 choices for your plate in the character boxes provided. You can use up to 7 characters consisting of letters, numbers, and spaces for each choice. Motorcycle and disability personalized plates can use up to 6 characters only. Enter your first choice for your plates in the “1st” character box. If your first choice is already taken by someone else or rejected by the Maryland MVA, your second choice will be considered, and so on. Make sure that none of your 4 choices include objectionable words, or they will likely be rejected by the Maryland MVA. Entering 4 choices with non-objectionable words will give you the best chance of ensuring that 1 of your choices will be accepted. If none of your choices are accepted by the Maryland MVA, your mailed-in application will be declined, and your check will not be cashed. If you want to know right away whether your choices are available or not, apply for your personalized plate online through Maryland MVA's online services website."
    },
    {
      "title": "Sign and date the application.",
      "content": "Sign and date the application. If a co-owner is included on the application, they must also sign the application. If you have any questions about filling out the form before signing it, call 410-768-7000 to speak with a Maryland MVA customer agent."
    },
    {
      "title": "Mail your application, with a check and copy of your registration card.",
      "content": "Mail your application, with a check and copy of your registration card. Make sure that your vehicle’s registration card is current and that your check is for the correct amount listed on the application. Mail your completed materials to Specialty Tag Unit, Motor Vehicle Administration, 6601 Ritchie Highway, N.E., Glen Burnie, Maryland 21062. Write a check for $50.00 for standard personalized plates, or make your check out for $60.00 if you’re ordering personalized plates with a background scene. If you’re ordering replacement plates, the cost is $20.00. Payments also require that the following information is listed on your check: bank routing number, checking account number, Maryland Driver's License number, and date of birth. Money orders and travelers checks are not accepted."
    },
    {
      "title": "Locate a Maryland MVA branch office near you.",
      "content": "Locate a Maryland MVA branch office near you. Go to http://www.mva.maryland.gov/locations/ and check “MVA Locations” to find the full-service Maryland MVA branch that’s closest to you."
    },
    {
      "title": "Fill out an application for personalized plates.",
      "content": "Fill out an application for personalized plates. Print out an Application for Special Registration Plates. Fill out the application completely, and remember to sign it. If you have any questions about filling out the application, an agent at the full-service Maryland MVA branch can help you."
    },
    {
      "title": "Go to the Maryland MVA branch to submit your application in person.",
      "content": "Go to the Maryland MVA branch to submit your application in person. Bring your Application for Special Registration Plates, a copy of your vehicle’s current registration card, and your checkbook. You will need to show the MVA agent a copy of your vehicle’s current registration card, and you will need to write the Maryland MVA a check for the proper amount before your application will be accepted. Write a check for $50.00 for standard personalized plates or $60.00 for personalized plates with a background scene. The cost is $20.00 to order replacement plates."
    }
  ]
}