{
  "url": "https://www.wikihow.com/Let-Go-of-the-Guy-Who-Left-You-for-Another-Girl",
  "title": "How to Let Go of the Guy Who Left You for Another Girl",
  "steps": [
    {
      "title": "Stay away from him.",
      "content": "Stay away from him. It's easy to keep the fantasy of some kind of relationship alive with the idea of staying friends. You may be able to be friends in the long run, but it's best to focus on yourself for a while and allow your feelings to die down before trying to have any kind of friendship with your ex. Trying to stay in contact can make the breakup worse if you aren't really over him or if he still has residual feelings for you. [1] X Research source It may also be really hard to see him with the new girl. Protect yourself from that emotional pain by keeping your distance, at least for a little while. Avoid interacting or seeing him on social media and avoid texting or calling. You may also want to get rid of anything that reminds you of him such as photos or gifts. If you're having trouble deciding whether to stay connected, check out wikiHow's \"Should you block your ex on social media\" forum ."
    },
    {
      "title": "Resist the urge to get back together.",
      "content": "Resist the urge to get back together. Breakups are painful but sometimes necessary. Trying to get back together will only extend the grieving process, and if he's with someone new, it'll likely just be you trying to repair the relationship, which puts you in a bad position where it's easy to continue getting hurt. [2] X Research source If he tries to keep something going while talking to the new girl, avoid this messy situation. Show him and everyone around you that you have the maturity to maintain a clean break, even if he doesn't."
    },
    {
      "title": "Speak positively about him.",
      "content": "Speak positively about him. Try to take the higher road and avoid gossiping about what he did. You may feel like you need to vent, but this can create problems if you have mutual friends. Framing situations positively is better for your own mental health than venting in a negative way. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Try to understand his position. He may be doing what he thinks is best for his life. If he wasn't interested in trying to salvage your relationship, then either way, it's the best case scenario long-term for you to have broken up. If someone asks about the breakup, you can say \"It's been a difficult experience for me, but I wish him the best regardless.\""
    },
    {
      "title": "Respect his decision.",
      "content": "Respect his decision. You may not like it, and you don't have to, but try to understand that the decision has been made and the best thing for you to do is move on, as painful as that can be. Even if you invested a lot of time and energy into the relationship, if it's over then the best thing you can do is try to move forward. [4] X Research source You can say to him, \"I respect your decision even though I don't like it or agree with it."
    },
    {
      "title": "Keep her out of it.",
      "content": "Keep her out of it. You may be tempted to attack the girl he leaves you for, but it's not her fault, and being rude to her will only make it harder for you to move on. Appreciate the positive side of another person being involved: it will make it easier for a clean break to happen, because you won't keep orbiting each other as each of you tries to cope with the pain of the situation. [5] X Research source If she tries to talk to you or gossips about you to other people, maintain your integrity by not responding to her bitterness. If you do want to respond to something she says, keep it simple and friendly. You can say \"It wasn't meant to be for us, but I hope it works out between the two of you.\" If she's a friend or if you have mutual friends, be extra cautious about not being resentful. You may want to be friends with her again in the future, or you may not want to poison your social circles by disrespecting her. If you need to vent, talk to a friend who isn't close to her (or the guy)."
    },
    {
      "title": "Take care of your body.",
      "content": "Take care of your body. It's important in the aftermath of a romantic breakup to keep up the self-care. You may feel too sad or tired to eat right, sleep well, and exercise, but all of these things will help you to recover as quickly as possible. [6] X Research source Things like exercise will also give your brain the extra positivity it needs to get through this rough patch, since it produces the happiness chemical serotonin. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Enlist the help of friends if you're having a hard time with self-care. Make dinner with people you're close to or go to the gym with someone who is into exercising consistently."
    },
    {
      "title": "Face what you are feeling.",
      "content": "Face what you are feeling. Distracting yourself from your pain may seem like a good idea in the moment, but it will only increase the amount of time it takes you to process the breakup. This can make it more difficult not to bring your residual feelings into new relationships and other areas of your life. [8] X Research source Talking it out with a friend can give you a good way of reflecting on your feelings. Make sure it's someone you trust to be sensitive with your emotions and really listen to what you are saying. Avoid using alcohol or other substances to keep your feelings away. In the long run this will only hurt you."
    },
    {
      "title": "Write about your experience.",
      "content": "Write about your experience. Focus on the positive aspects of the breakup. Writing will help you organize your thoughts and begin to process all of the difficult emotions that go along with a breakup. Specifically writing about what went right in the breakup is better for you than just venting. [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Was he honest and straightforward when he told you he was into someone else? Did he let you know what was going on before it got serious with the new person?"
    },
    {
      "title": "Give yourself time.",
      "content": "Give yourself time. It's important to give yourself time to heal. Straining yourself too hard, like jumping straight into a new relationship, overworking yourself, or just pushing yourself to move on can make the situation worse. Emotional injuries, like physical injuries, require time to fully heal. Give yourself the space to rest and recover. [10] X Research source Don't be afraid to say no if friends want you to go out and you don't feel like it. True friends will understand that you need time before you can return to your normal way of being."
    },
    {
      "title": "Avoid the one true soul-mate myth.",
      "content": "Avoid the one true soul-mate myth. It's easy in our culture to buy into the idea of there being only one person for you, but in reality there are a lot of people in the world that you are compatible with. Avoid telling yourself stories about how this person was the only one for you, or that you'll never find anyone like him. In all likelihood you will find someone else, and he might be even better than this guy. You may eventually find an amazing fit with someone, but when that happens then neither of you will want to break up. [11] X Research source"
    },
    {
      "title": "Love yourself.",
      "content": "Love yourself. Love in this case is a verb or set of actions. It may seem impossible to love yourself after the rejection of being left for someone else, but you can build up to it through small steps in your day to day life. [12] X Research source Praise your strengths. Make a list of things you love about yourself. If you're having a hard time coming up with them because of how you feel, ask people you know love you, such as a parent or best friend. They will be able to point you in the right direction."
    },
    {
      "title": "Practice being kind to the people around you.",
      "content": "Practice being kind to the people around you. A great way to receive love is to give it. If you have a friend in need, helping them will ultimately help you to feel better as well. Even small acts like baking someone a cake for their birthday or giving someone a ride will lift your spirits. People who do good deeds actually live longer and are healthier overall. Being kind reduces your stress and activates chemicals in the brain related to happiness and love. [13] X Research source"
    },
    {
      "title": "Make plans.",
      "content": "Make plans. It can be easy to slide into a pit of sadness and end up avoiding people, but for a speedy recovery it's useful to make plans with people and engage in some level of activity, even if it's not as much as you would normally do. Plan friend-dates and other activities in advance so that you have them to look forward to, rather than relying on spur of the moment plans to emerge, which may just result in not getting anything done. Try to regularly have dinner with a friend during the week, so you'll have something consistent in your life. Even if you aren't feeling up to an activity, you may want to try it anyway. You never know how you'll feel once you're actually out doing things with people you like. Try to find a balance between staying in and going out that feels right to you."
    },
    {
      "title": "Make new friends and visit new places.",
      "content": "Make new friends and visit new places. Trying new things can help you get out of the rut you're in. It's easy to focus on the past and get stuck there when you're dealing with a breakup, so put yourself out into the world and build new memories in order to create a new life for yourself. Even if you have a hard time enjoying the new activities or enjoying meeting new people, it can be better for you than ruminating on the breakup. [14] X Research source Ask your friends to take you with them when they do things they love, like yoga or kayaking. Their enjoyment will be contagious and help you appreciate the moment too."
    },
    {
      "title": "Work on self-improvement.",
      "content": "Work on self-improvement. Use this opportunity, where you have more free time and time to yourself. Join a gym and start a regular exercise program. Focus on making good grades in school. Practice skills that you are interested in, like playing an instrument or photography. This will help you feel better about yourself, and it will also raise your confidence so you'll be prepared to date again when the time comes. It helps to make a list of ways you would like to grow. Try to think of things you've always wanted to do but never had the time for, like learn to be a better writer or take up running."
    },
    {
      "title": "Be wary of rebounding.",
      "content": "Be wary of rebounding. You may be tempted to jump from one relationship to the next, especially since the guy is already with someone else, but you should be careful about distracting yourself from what you're feeling by replacing him with someone else right away. Grieving the old relationship is an important step in your emotional growth, and if you fail to give yourself time you may end up bringing that emotional baggage into the new relationship, which can be a disaster. Not all rebound relationships are bad news, though. It depends on the quality of the match. If you find someone wonderful, there may be nothing wrong with \"rebounding.\" It's only a problem when you don't actually like the person very much and you're only with them to feel less alone or ignore your pain. [15] X Research source"
    }
  ]
}