{
  "url": "https://www.wikihow.com/Juice-a-Potato",
  "title": "How to Juice a Potato",
  "steps": [
    {
      "title": "Cube your potato.",
      "content": "Cube your potato. Cut your potato in half. Then, cut each half into two to three small cubes. There are no precise measurements in terms of the size of cubes, but breaking the potato into smaller pieces can help it juice faster. [1] X Research source"
    },
    {
      "title": "Place a glass below your juicer.",
      "content": "Place a glass below your juicer. Juice will squirt out of a faucet on the bottom of your juicer. Place the glass under the faucet near the bottom of the juicer to collect your potato juice once you turn the juicer on. [2] X Research source"
    },
    {
      "title": "Remove the top of the juicer.",
      "content": "Remove the top of the juicer. Most juicers have a small cylinder compartment covering the opening where you place your fruits and veggies. This can be pulled out easily by hand. [3] X Research source"
    },
    {
      "title": "Turn the juicer on.",
      "content": "Turn the juicer on. After removing the top, figure out how to turn the juicer on. Most juicers have an \"on\" button somewhere near the side. Switch it to the high setting, as this will juice your potato the fastest. [4] X Research source If you're unsure how your juicer works, consult your Instruction Manual. Each juicer is different."
    },
    {
      "title": "Add your potato.",
      "content": "Add your potato. Place your potato into the top compartment of the juicer. If you're adding any additional fruits and veggies to your potato juice, add them now as well. [5] X Research source"
    },
    {
      "title": "Use the lid to push the potato into the juicer.",
      "content": "Use the lid to push the potato into the juicer. Take the cylinder top piece you removed earlier. Use it to gently push down on the potato, squeezing it through the juicer. [6] X Research source"
    },
    {
      "title": "Cut your potato into cubes.",
      "content": "Cut your potato into cubes. Cut your potato in half. Then, cut each half into tiny cubes. The smaller the cubes, the better, as this will make the potato blend quicker."
    },
    {
      "title": "Add your potato to the blender with water.",
      "content": "Add your potato to the blender with water. Place your potato in a blender and add a small amount of water. Amounts will vary depending on the size of the potato, but add just enough that the potato cubes are saturated in water. [7] X Research source"
    },
    {
      "title": "Blend your potato.",
      "content": "Blend your potato. Turn the blender on the highest setting possible. Blend the potato and water until you have a liquid-like, pulpy mixture. Times will vary depending on the strength of your blender. [8] X Research source"
    },
    {
      "title": "Pour the mixture into a strainer.",
      "content": "Pour the mixture into a strainer. Take a mesh strainer and position it over a bowl or glass. This will strain out any excess pulp. [9] X Research source"
    },
    {
      "title": "Use a fork or spoon to get the juice out.",
      "content": "Use a fork or spoon to get the juice out. Take a fork or spoon and stir it on the top of the strainer. Press the back of the fork of spoon against the potato pulp to squeeze out as much juice was you can into your glass. [10] X Research source"
    },
    {
      "title": "Drink the juice on its own.",
      "content": "Drink the juice on its own. Potatoes are full of nutrients like potassium. Potato juice is a healthy choice to drink on its own. You can have a glass of potato juice with a meal instead of water. [11] X Research source"
    },
    {
      "title": "Add the juice to smoothies or other juices.",
      "content": "Add the juice to smoothies or other juices. Potato juice doesn't have the strongest flavor. It can be added to other types of juices or smoothies to add some extra nutrients. [12] X Research source For example, use potato juice as your liquid in a smoothie."
    },
    {
      "title": "Use the juice for skin care.",
      "content": "Use the juice for skin care. Potato juice can be used to treat blemishes or acne. You can spread potato juice on your skin, let it sit for about 20 minutes, and wash it off. This can give your skin a healthy glow and may reduce things like wrinkles, blemishes, and discoloration."
    },
    {
      "title": "Store your potato juice properly.",
      "content": "Store your potato juice properly. Store your juice in an airtight jar or bottle. Screw on the cap completely and don't leave a lot of headspace near the top of the jar. Keep the juice in the refrigerator at all times. Potato juice keeps for a few months when stored properly. [13] X Research source"
    }
  ]
}