{
  "url": "https://www.wikihow.com/Make-a-Good-Tinder-Profile",
  "title": "How to Make a Good Tinder Profile",
  "steps": [
    {
      "title": "Include multiple photos of you to catch people’s attention.",
      "content": "Include multiple photos of you to catch people’s attention. Your photos are the most important part of your profile because people won't swipe right if they don't like your photos. At a minimum, include at least 3-5 photos that show you in a positive light. Choose photos that are well lit and not blurry. For instance, you might include 2 headshots, 2 pictures of you doing activities you enjoy, and 1 photo of you with your pet or a group. Additionally, make sure at least 1 photo shows you dressed up and at least 1 photo shows a casual look. Make sure you’re in every photo. You only have 5 photos to make a good impression, so don’t waste them on pictures of your dog, a sunset, or your favorite food. Do not include mirror selfies and gym pictures, especially if you’re a guy. These are a big turn-off! [1] X Research source"
    },
    {
      "title": "Make an attractive headshot of you in a red top your profile pic.",
      "content": "Make an attractive headshot of you in a red top your profile pic. Pick a photo that clearly shows your face so that people know what you really look like. If possible, choose a headshot that also conveys something about you, like your sense of style or a hobby you enjoy. Additionally, pick a photo where you're wearing a red top because it will signal people to stop on your profile. However, try to avoid using a selfie if you want to get more matches. [2] X Research source Try to use a professional photo for your profile pic. If you don't have professional photos, a good first photo might be a picture your friend took of you standing next to your artwork or a photo your mom took of you posing at the top of a summit. If you have a pet, you might use a photo of you holding your pet. If you need to use a selfie, take it from farther away and don’t use unnatural angles to make your face look different. While it's unfair to you, people can interpret selfies as a sign that you're hiding something about your looks."
    },
    {
      "title": "Stick to photos that aren’t overly made up.",
      "content": "Stick to photos that aren’t overly made up. Unfortunately, many people can perceive someone who wears heavy makeup and appears to dress up often as high maintenance. In fact, most people say they like a natural makeup look. To get more guys to swipe right, choose photos that are more “girl next door” than “it girl.” Choose more day looks than night looks. For instance, skip the club pic and show off your hiking photos instead."
    },
    {
      "title": "Avoid showing off a lot of skin unless you want casual hookups.",
      "content": "Avoid showing off a lot of skin unless you want casual hookups. Including photos of you baring your assets sends the message that you’re looking for sex. This is a common pitfall for all genders, though for different reasons. In heterosexual couples, guys tend to view girls who show off their body as easy and great for casual hook-ups. Alternatively, girls typically find shirtless photos of guys to be a big turn-off if they’re looking for something serious. Keep in mind that your photos will take precedence over whatever you write in your profile. You might write, “I don’t want hookups. I’m here for a serious relationship.” However, people aren’t going to believe that if your photos are sexy."
    },
    {
      "title": "Stick to 1 group photo where you're clearly recognizable.",
      "content": "Stick to 1 group photo where you're clearly recognizable. You might think that group photos make you seem popular and fun, but they’re typically just confusing. Not only will people have trouble telling which person is you, but they may also conclude that you’re the least interesting person in the photo. Include just 1 group photo or none at all. If you do use a group photo, make sure it's clear which person in the photo is you. [3] X Research source For instance, you could include a picture of yourself with your grandparents."
    },
    {
      "title": "Skip images that show off a taste for luxury items.",
      "content": "Skip images that show off a taste for luxury items. Sometimes the things you think will impress someone can be a turnoff. This includes things like jewelry, designer clothes, fancy shoes and handbags, and expensive cars. Luxury items send the message that you are superficial and have expensive tastes. While this might not be true, it can cause people to swipe left. Wait until you’re getting to know someone to show off your prized possessions. For instance, don’t post a photo of you posing next to a Porsche or showing off your Chanel shades."
    },
    {
      "title": "Link your Instagram account so people can see more photos of you.",
      "content": "Link your Instagram account so people can see more photos of you. This will show people your 29 most recent Instagram posts. To link your accounts, open the Tinder app and click on your profile. Next, select \"Edit Profile\" and scroll down until you see \"Connect Instagram.\" After you select \"Connect Instagram,\" it will take you to a page where you'll confirm your Instagram username and password. [4] X Research source Since photos are important for scoring more matches, it can help you get people’s attention. If you’re posting a lot of personal photos, you might not want random strangers seeing your Instagram. Be aware that linking your Instagram account to your Tinder does give people access to your Instagram username. They may try to message you through Instagram."
    },
    {
      "title": "Show off what makes you unique instead of providing basic facts.",
      "content": "Show off what makes you unique instead of providing basic facts. Your profile doesn’t need to specify where you went to school or where you grew up. Save the basics for when you start messaging. Instead, choose details that will set you apart from everyone else and provide a good description of who you are as a person. [5] X Research source For example, everyone likes tacos, so don’t put that in your profile. However, you might write, “I’ve created 10+ taco recipes, and I’m always looking for new suggestions.”"
    },
    {
      "title": "Pick 10 adjectives that describe you to help craft a good bio.",
      "content": "Pick 10 adjectives that describe you to help craft a good bio. If you start to write your bio and completely blank, you aren’t alone. To help yourself get started, choose 10 adjectives you’re proud to embody. Think about what you like most about yourself, how you spend your time, and what people compliment you on. Then, turn those things into adjectives. As an example, you might write, “I’m persistent, creative, intelligent, open-minded, helpful, caring, witty, honest, bubbly, and talkative.” You don’t need to include every adjective in your bio. Just pick the ones that you think will be most appealing and that you feel describe you the best."
    },
    {
      "title": "Explain how you embody each adjective to create your bio.",
      "content": "Explain how you embody each adjective to create your bio. Now turn the best 1-3 adjectives into a short description of yourself. To do this, pick the adjectives that you think are most relevant for your dating profile. Then, write out the ways you show that trait. Revise what you’ve written until you have 2-3 short, engaging sentences. For instance, let’s say that creative and witty are your favorite qualities. You might write down, “I do improv comedy sketches, I produce a zine, my apartment is a hodgepodge of art I’ve collected, and I draw to relax myself.” Your 2-3 sentences might read, “When I’m not working on my zine, I’m at local coffee shops doing comedy sketches. After my performances, I check out the work posted by local artists to see if there’s anything I can add to my collection. If I’m spending the night at home, I’m probably doodling in my sketchbook because it helps me relax.”"
    },
    {
      "title": "Make it clear that you have your life on track.",
      "content": "Make it clear that you have your life on track. You probably feel like you’re a work in progress, which is totally normal! However, most people aren’t looking for a project, and they expect for you to be able to care for yourself. With that in mind, present yourself as someone who has your living arrangements, career, and finances in order. Additionally, make it clear that you have relationship goals. You don’t need to have a perfect life or a lot of money. However, you don’t want people to think your life is a mess."
    },
    {
      "title": "Keep your bio conversational so it’s relatable.",
      "content": "Keep your bio conversational so it’s relatable. Don’t worry about sounding smart, and try not to include too many lists. Instead, write like you’re talking to the person over coffee. To make sure your tone is conversational, read your bio out loud to make sure it sounds natural. Revise it until it sounds like something you’d say in a conversation. You might write, \"I'm like a mischievous pet who's always trying to get into something. When I'm not at work, I'm out exploring the city and looking for things to do. Message me if you want to know what's happening this weekend.\" If you’re in doubt, read your bio to someone else and ask them if it sounds awkward or too academic."
    },
    {
      "title": "Detail what you'll contribute to your relationship.",
      "content": "Detail what you'll contribute to your relationship. Telling people what you have to offer them is a great way to catch their attention. Think about what makes you a great partner, as well as how you typically act in a relationship. Additionally, consider what your prior partners thought were your best qualities. Then, turn these details into things you can offer your potential partners. You could write, \"I'll cook for you every Saturday morning,\" \"I'll give you free back rubs,\" or \"I'll add a bit of spontaneity to your life.\""
    },
    {
      "title": "Cut out self-deprecating jokes about food, alcohol, or messy habits.",
      "content": "Cut out self-deprecating jokes about food, alcohol, or messy habits. You might think these jokes are funny, but it’s easy for people to misread them. It’s best to steer clear of these topics until you’re talking to them in person. That way, they can hear your tone and know that you’re being funny. For instance, don’t write, “My skills include computer programming and eating an entire pizza in one sitting,” “Most people are impressed by my ability to down 3 shots without feeling buzzed,” or “Before I invite you over, I promise to dig out my couch.”"
    },
    {
      "title": "Avoid using cliches and gender-based jokes.",
      "content": "Avoid using cliches and gender-based jokes. These types of statements are easy to write because they don’t require much thought. Plus, you probably think they make you seem funny or edgy. However, most people will assume that you’re being serious, which will make them swipe left. Don’t include cliches or gender-based jokes in your bio for any reason. [6] X Research source For instance, don’t say, “Looking for my trophy wife,” “I’m tired of mowing the grass,” “Looking for my partner in crime,” or “I work hard to play hard.”"
    },
    {
      "title": "Ask your friends what they think about your profile.",
      "content": "Ask your friends what they think about your profile. Show them the photos you’ve chosen and let them read your bio. Get their feedback about how your bio sounds, as well as how well it represents you. Then, ask them if you can make any improvements. It’s also helpful to look at your friends’ profiles, especially if they’re getting lots of good matches."
    },
    {
      "title": "Get your profile reviewed by someone you might date.",
      "content": "Get your profile reviewed by someone you might date. While you know what you mean, it's easy for other people to misinterpret what you're saying. People think differently, so it's important to get feedback from someone you might be interested in dating. Show them your profile and ask them what they think about it. Here are some questions you might ask them: What is your perception of me after reviewing my profile? What do you think I want in a relationship? Would you swipe right? Why or why not? Would you message me first? Why or why not? What type of message would you send? Did anything stand out to you? Are there any changes I could make to get more matches?"
    },
    {
      "title": "Work with a professional dating expert if you still aren’t getting matches.",
      "content": "Work with a professional dating expert if you still aren’t getting matches. Don’t worry if you’re having a hard time getting your profile right. This is a common problem! Fortunately, you can work with a dating expert to write a better profile. Ask for them to give you advice or let them write your profile for you. Either way, you’ll increase your chances of finding a good match. You can find a dating expert by searching online. You might be able to work with a local coach, but there are also companies that operate nationally."
    }
  ]
}