{
  "url": "https://www.wikihow.com/Make-Money-on-Cafepress",
  "title": "How to Make Money on Cafepress",
  "steps": [
    {
      "title": "Visit the CafePress join page to create an account",
      "content": "Visit the CafePress join page to create an account ."
    },
    {
      "title": "Enter your email address (This will be used as your CafePress user ID), create a password, select and answer a password reminder question, and enter your birthdate using the drop down menus.",
      "content": "Enter your email address (This will be used as your CafePress user ID), create a password, select and answer a password reminder question, and enter your birthdate using the drop down menus."
    },
    {
      "title": "Review the Terms of Service and click the checkbox to agree to them.",
      "content": "Review the Terms of Service and click the checkbox to agree to them."
    },
    {
      "title": "Click the “Join Now” button to create your account.",
      "content": "Click the “Join Now” button to create your account."
    },
    {
      "title": "Answer the 8 questions by select the most relevant answer from the drop down menus.",
      "content": "Answer the 8 questions by select the most relevant answer from the drop down menus. (Optional). Answering these questions will help CafePress recommend the best account type for your specific needs."
    },
    {
      "title": "Click the “Open Your Shop!”",
      "content": "Click the “Open Your Shop!” button."
    },
    {
      "title": "Decide what kind of CafePress shop you want to have.",
      "content": "Decide what kind of CafePress shop you want to have. CafePress offers three kinds of shops: Basic, CafePress and Premium. Basic and Premium Shops let you set your own price as a markup over the base price CafePress sets for each item, while CafePress sets the sale price for items you sell in a CafePress shop. Basic Shops are free, and you can set up as many as you want, but you're limited to selling only 1 product in each shop. You can, however, promote your shop in the CafePress Marketplace, and CafePress does provide other promotional tools to help you promote your shop. CafePress Shops are also free, but CafePress determines the retail prices for items in your shop; you get a 10 percent commission on each sale. The range of products you can choose to sell is more limited than in a Basic Shop, and you're not eligible to receive a performance bonus or to be listed in the CafePress Marketplace. (This feature, an adaptation of the CafePress Marketplace, is currently in beta version.) Premium Shops charge a monthly, quarterly or annual fee for the shop; however, you can choose to sell any of the products CafePress offers and different products from the same shop. You also have a choice of pre-made designs for your storefront or the ability to create your own design, as well as the ability to organize your products in categories."
    },
    {
      "title": "Enter a shop ID.",
      "content": "Enter a shop ID. This will used as the ending of your shop’s URL."
    },
    {
      "title": "Enter a shop name.",
      "content": "Enter a shop name. Enter the name exactly as you want it to appear on your shop."
    },
    {
      "title": "Enter a page that users will return to after placing an order.",
      "content": "Enter a page that users will return to after placing an order. By default they will be directed back to the shop front page. (Optional)"
    },
    {
      "title": "Enter your birthdate using the drop down menus.",
      "content": "Enter your birthdate using the drop down menus."
    },
    {
      "title": "Review the CafePress Seller Agreement and click the checkbox to agree to it.",
      "content": "Review the CafePress Seller Agreement and click the checkbox to agree to it."
    },
    {
      "title": "Click the “Submit” button.",
      "content": "Click the “Submit” button."
    },
    {
      "title": "Click the “Build Your Shop” button to complete the process and create your shop.",
      "content": "Click the “Build Your Shop” button to complete the process and create your shop."
    },
    {
      "title": "Choose the product(s) you want to sell in your CafePress shop.",
      "content": "Choose the product(s) you want to sell in your CafePress shop. Available products include clothing items, stationery, bags, calendars, posters, mugs, clocks and mouse-pads. You can also use CafePress to sell books-on-demand and audio CDs. You can click on any product to get information about its size and design options."
    },
    {
      "title": "Upload the artwork for the items you're selling.",
      "content": "Upload the artwork for the items you're selling. Each product has specifications as to the dimensions of the artwork it can support; depending on the product, you may have to adjust its size on your computer before uploading, or you can do so after uploading it to CafePress. Depending on the product, you can adjust the placement of the image and preview how it will appear on the product. Generally, you'll want to avoid having large borders around your images, as this will take away from the space available for the image itself. Also, if you're designing an image to go on a black item, create it with a transparent background so that CafePress will not surround it with white."
    },
    {
      "title": "Set the price(s) for the product(s) you're selling.",
      "content": "Set the price(s) for the product(s) you're selling. If you have either a Basic or Premium Shop, you'll need to set the prices for the items you're selling. CafePress charges a base price for each item; you set a higher retail price (markup) for each item you sell in your shop. When an item sells, CafePress gets the base price, and you get the amount of the markup. Your markup price should take into account any costs incurred in designing the images used on your products as well as time spent in designing them and the costs for any marketing you're doing to promote your CafePress shop. Also, take a look at what similar items are selling for elsewhere online and in brick-and-mortar stores."
    },
    {
      "title": "Write and upload a description of your shop.",
      "content": "Write and upload a description of your shop. This will give customers a short explanation of what your shop sells and invite them to purchase items from you. If you're taking advantage of CafePress' search engine optimization (SEO) features, include several keywords in your shop description to help Internet search engines find your shop."
    },
    {
      "title": "Upload a shop logo.",
      "content": "Upload a shop logo. If you have a business logo, you can upload it to your CafePress shop to display your brand to your customers. If you have a website, you can also set it up so that when customers click on the logo on your CafePress shop, they are taken to it."
    },
    {
      "title": "Write a shopkeeper profile.",
      "content": "Write a shopkeeper profile. Although optional, having a shopkeeper profile tells your customers about you or your organization beyond what you state in your shop description. The profile can also include your picture or a logo of your organization, as opposed to the logo for your shop."
    },
    {
      "title": "Consider being listed in the CafePress Marketplace.",
      "content": "Consider being listed in the CafePress Marketplace. You can choose whether or not to be listed in the CafePress Marketplace. Items sold through the CafePress Marketplace earn you 10 percent commission of the retail price, but CafePress sets the retail price for any item listed and retains the right to enhance the artwork as necessary to improve the product's saleability. Not all products are available for inclusion in the CafePress Marketplace, but products listed there are eligible for affiliate program sales."
    }
  ]
}