{
  "url": "https://www.wikihow.com/Make-Fireworks",
  "title": "3 DIY Guides for Creating Fireworks from Home",
  "steps": [
    {
      "title": "Mix potassium chlorate, aluminum files or shavings, and charcoal in a bowl.",
      "content": "Mix potassium chlorate, aluminum files or shavings , and charcoal in a bowl. Pour your dry ingredients—300 grams (11 oz) of potassium chlorate, 60 grams (2.1 oz) of aluminum files or shavings, and 2 grams (0.071 oz) of charcoal—together in a bowl. Use a spoon to mix the powders until they’re evenly distributed. [1] X Research source Use a digital scale to weigh to get as close to the correct amounts as possible. Break apart clumps that form in the powder so your ingredients mix thoroughly. Note that for some people, potassium chlorate can be hard to track down. Local science shops and pharmacies are a great place to start."
    },
    {
      "title": "Add dextrin and water to the mixture until it becomes a moist slurry.",
      "content": "Add dextrin and water to the mixture until it becomes a moist slurry. Mix 1 teaspoon (4.9 ml) of dextrin with 9 teaspoons (44 ml) of water in a cup. Pour a small amount of your solution into your dry mixture and mix it together. Continue adding the water and dextrin in small increments until the bowl's content's become gooey, like molasses. [2] X Research source"
    },
    {
      "title": "Add strontium nitrate if you want red sparklers.",
      "content": "Add strontium nitrate if you want red sparklers . Without any additional ingredients, the sparklers will burn white. If you’d prefer red sparklers, measure out 500 grams (18 oz) of strontium nitrate by weighing it on your digital scale and then, add it to your mixture. [3] X Research source If adding the strontium nitrate makes the mixture too dry, add a pinch of your water-dextrin solution so that it regains a goopy texture."
    },
    {
      "title": "Put in barium nitrate to create green sparklers.",
      "content": "Put in barium nitrate to create green sparklers. Instead of adding strontium nitrate for red sparklers, you can use a smaller portion of barium nitrate to create green ones. Pour 60 grams (2.1 oz) of barium nitrate into the mixture after weighing it precisely with your scale, then mix it in thoroughly. [4] X Research source Be sure to mix the ingredients well so they are evenly distributed. Again, add more water and dextrin if the mixture gets too dry."
    },
    {
      "title": "Dip wires or sticks into the mixture, leaving room at the end for gripping.",
      "content": "Dip wires or sticks into the mixture, leaving room at the end for gripping. You can use any stiff wire or wooden sticks to make the sparkler handles. Kabob skewers work particularly well. Dip each handle into the mixture and then pull it out slowly, so the top ⅔ of each stick is covered completely by the mixture on all sides. Leave the bottom third uncovered so that you have enough room to hold your stick. [5] X Research source 10 inches (25 cm) is a good length for a stick, and is also the common length for kabob skewers. Make sure to leave at least 4 inches (10 cm) at the bottom for a handle."
    },
    {
      "title": "Wait 24 hours for your sparklers to dry and harden.",
      "content": "Wait 24 hours for your sparklers to dry and harden. Leave the sticks in a safe, dry space that isn’t near any open flames or sparks. If you want, you can poke each stick or wire handle through a shoebox to hold them upright while they dry, but it isn’t required. [6] X Research source Laying the sparklers flat on their side while they dry will work as well. Do not touch the mixture until it’s completely dry or it may come off the handle."
    },
    {
      "title": "Ignite the sparkler by putting the covered end into a flame.",
      "content": "Ignite the sparkler by putting the covered end into a flame. Hold the uncovered end of the stick or wire as the handle. Place the opposite end of the sparkler into an open flame and wait for the mixture to ignite. [7] X Research source Before you begin, remember to check with your local laws first. In some areas, sparklers are illegal. Like with all fire hazards, exercise extreme caution. Hold your sparkler far from your body and face and be sure to extinguish it completely in water before setting it down anywhere."
    },
    {
      "title": "Pour 1.5 grams (0.053 oz) of powdered sugar into a bowl.",
      "content": "Pour 1.5 grams (0.053 oz) of powdered sugar into a bowl. Measure the sugar out into a medium-sized bowl that will be easy for you to stir in. Before you proceed, make sure you're using powdered white sugar (like the kind you'd use for baking). You can grind up table sugar in a coffee grinder if you don’t have any powdered sugar on deck."
    },
    {
      "title": "Add .375 grams (0.0132 oz) of baking soda and mix it with the powdered sugar.",
      "content": "Add .375 grams (0.0132 oz) of baking soda and mix it with the powdered sugar. Use a spoon to make sure the sugar and baking soda are thoroughly mixed together before moving on to the next step."
    },
    {
      "title": "Make a mound of sand on plate and push a depression into the middle.",
      "content": "Make a mound of sand on plate and push a depression into the middle. It doesn’t matter exactly how much sand you use, just pour enough to create a small mound on your plate or baking sheet. Then press your index finger into the top of the mound to create the depression. [8] X Research source Once you’re finished, the mound will look sort of like a donut. The depression should go all the way to the pan or plate in the center of the mound."
    },
    {
      "title": "Wet the sand with high-proof alcohol.",
      "content": "Wet the sand with high-proof alcohol . Pour alcohol onto the sand that is higher than 80 proof. The higher the proof of alcohol you use, the easier it will ignite. For that reason, extremely high-proof alcohols work best. [9] X Research source Pour enough on the sand to make it wet, but not to ruin the shape. This will be roughly 1 tablespoon of alcohol for every 1 cup of sand."
    },
    {
      "title": "Spoon your baking soda and sugar mixture into the sand's depression.",
      "content": "Spoon your baking soda and sugar mixture into the sand's depression. This doesn't require a specific measurement—as long as you fill the hole, you're good to go. [10] X Research source Congratulations, your glow snake is ready to be lit! Once the snake it lit, don't add any more alcohol, as you'll run the risk of igniting the bottle. And on that note, keep flammable goods (like your bottle!) far from your glow snake."
    },
    {
      "title": "Touch the wet sand with a flame to ignite it.",
      "content": "Touch the wet sand with a flame to ignite it. There is no wick on the glow snake. Instead, simply take a match or lighter and touch its flame to the alcohol-soaked sand. The sand will ignite first, and then the snake will start to expand. Step away from the glow snake as soon as its lit. Be careful where you light the glow snake. As it expands, it may grow larger than the plate you put it on! Looking for more firework fun? Check out these exciting guides on making homemade fire crackers and creating flash powder ."
    },
    {
      "title": "Create a mold out of aluminum foil.",
      "content": "Create a mold out of aluminum foil. Wrap the bottom of a soda can in aluminum foil and then remove the soda can. The foil will hold the shape. Shape the aluminum foil so the opening is facing up, then set the mold aside."
    },
    {
      "title": "Pour 128 grams (4.5 oz) of white granulated sugar into a skillet.",
      "content": "Pour 128 grams (4.5 oz) of white granulated sugar into a skillet. Measure the sugar using a dry measuring cup to ensure you have the correct amount. Pour it into a standard sized 12 in (30 cm) skillet but don’t turn the heat on yet. Do not use a measuring cup meant for fluids, as the measurements will be different."
    },
    {
      "title": "Add 192 grams (6.8 oz) of potassium nitrate.",
      "content": "Add 192 grams (6.8 oz) of potassium nitrate . Pour the potassium nitrate into the sugar. Use a wooden spoon to mix the two powders together until they are well blended. [11] X Research source Make sure the ingredients are mixed thoroughly for the best results. Spread the mixture out evenly in the pan once it’s thoroughly mixed."
    },
    {
      "title": "Apply low heat to the pan while you stir the mixture with a spoon.",
      "content": "Apply low heat to the pan while you stir the mixture with a spoon. Place the pan on the stove with the burner set to low and continue mixing the ingredients using long, slow strokes. Eventually, the sugar will begin to melt. Continue stirring the mixture as the sugar melts and mixes with the potassium nitrate. You'll probably notice it caramelize and turn brown."
    },
    {
      "title": "Remove the mixture from the heat when it liquifies.",
      "content": "Remove the mixture from the heat when it liquifies. As the sugar melts and mixes with the potassium nitrate, the two will begin to form a liquid sludge. Once it has become liquid enough to roll around the pan, turn off the burner and remove your pan from the heat source. [12] X Research source Keep stirring the mixture as you remove it from the heat. For this bit, you'll need to move quickly. The mixture will start hardening soon after it is removed from the heat, and you need to get it into your mold before it does."
    },
    {
      "title": "Pour the liquid mixture into the foil mold.",
      "content": "Pour the liquid mixture into the foil mold. Be careful not to spill any of the mixture as you do this. Once there’s a thick layer of the mixture on the bottom of the mold (it can be any depth you choose) set the remaining mixture aside. If there’s enough left over you can always make another smoke bomb. Don't touch the foil once the mixture is inside, because it'll be really hot."
    },
    {
      "title": "Allow the smoke bomb to cool overnight and remove it from the foil.",
      "content": "Allow the smoke bomb to cool overnight and remove it from the foil. Leave the mixture in the foil overnight—then, the next morning, peel it off the smoke bomb. The smoke bomb itself is entirely flammable, so there’s no need for a fuse. Do not ignite the smoke bomb indoors or breathe in the smoke it produces when lit. Be extremely careful when lighting the smoke bomb, as it may produce more smoke than you expected. Give yourself tons of open space!"
    },
    {
      "title": "Ignite the smoke bomb by exposing it to a flame.",
      "content": "Ignite the smoke bomb by exposing it to a flame. There is no fuse on the smoke bomb. To set it off, simply ignite any portion of the mixture using a lighter or match, then set the bomb on the ground or another horizontal surface to burn. The smoke bomb may not burn with a visible flame, but it's still super important that you keep it away from flammable things—just in case. Do not hold the smoke bomb while it burns."
    }
  ]
}