{
  "url": "https://www.wikihow.com/Make-a-Shopping-List",
  "title": "How to Make a Shopping List",
  "steps": [
    {
      "title": "Keep a running \"to-buy\" list.",
      "content": "Keep a running \"to-buy\" list. Throughout your day-to-day living, you should have a \"to-buy\" list tacked someplace central in your home. If you notice you're out of, or running low on something you'll need, make a note of it on the list. Done in this way, you won't have to stress out about remembering all the things you need to buy. Giving yourself the maximum amount of time to plan will give you the highest chance of remembering everything you need. A fridge or bulletin board is a great place to keep it."
    },
    {
      "title": "Figure out everything you need beforehand.",
      "content": "Figure out everything you need beforehand. Improvising your list once you're out shopping will result in hasty buys and unhealthy choices. You should have a well-thought out list before you head out the door. Check the pantry and check what's running low. While keeping a running tally of grocery purchases will help you figure out the less obvious things, you can cover a lot of your bases by taking a quick stock of your inventory. Recipes often require several ingredients. It's a good idea to review your planned recipes thoroughly before heading off to the supermarket."
    },
    {
      "title": "Consider the frequency of your shopping trips.",
      "content": "Consider the frequency of your shopping trips. Before you sit down to compile your list, you should take a second to think about how often you go to the supermarket. The frequency of shopping trips may depend on your location, as well as your mode of transport. For some people, going to the supermarket can mean a big time investment. If your trips are infrequent, it's all the more important to come prepared with a list. On the other hand, if you're going multiple times a week, it won't usually be an issue if you forget an item or two. Unless you live right next door to a supermarket, you should nonetheless see how much mileage you can get out of each trip. Try to minimize one-item trips, as they're big time wasters. It's better to get everything you need at once."
    },
    {
      "title": "Predict when you'll run out of certain supplies.",
      "content": "Predict when you'll run out of certain supplies. If you already have grocery trips as part of your regular routine, you probably schedule your trips based on how often certain items run out of supply at home. Having some idea beforehand of when a certain item will be used up can help you plan your trips more wisely. If you're smart, you'll never run out any supply because you'll be able to gauge when a trip is needed before it runs out. It would be a waste of effort to gauge the restock time of every item in your home. Instead, just focus on a few of the biggest things that run out often. Toilet paper and coffee beans are just two of the items you might gauge."
    },
    {
      "title": "Look up coupons and specials.",
      "content": "Look up coupons and specials. [1] X Research source Before going in for shopping, you might organize some of your shopping items based on what items are discounted on that given week. If there is something you wouldn't normally buy that's currently being sold for a steal, it's sometimes a good idea to switch up your buying habits accordingly. On the other hand, if there's a discount for an item you usually buy, you can take the chance to stock up on more of it than you normally would."
    },
    {
      "title": "Look at pre-made grocery lists for ideas.",
      "content": "Look at pre-made grocery lists for ideas. [2] X Research source There are grocery templates available online. Most people will prefer to buy groceries according to their own preferences. Nonetheless, giving a default grocery list a looking over can be useful when brainstorming for things you might need. You may come across some items you might never have thought of otherwise."
    },
    {
      "title": "Organize your list by aisle-type.",
      "content": "Organize your list by aisle-type. Most supermarkets organize their wares according to type. While you're writing down your shopping list, you should make an effort to join different things into similar group. Put all vegetables in a \"vegetables\" section. Do the same for toiletries and frozen food. If you have items bunched together, it will minimize the running around you would have to do if you scratched off the list in order. Leave a bit of space at the bottom of each category. You will often think of things you need at last minute, and it helps to have a bit of space left over to write them in. If you're going to more than one store, you should organize by store, then by aisle. However, you should see what you can do about packing all of your purchases into one store trip."
    },
    {
      "title": "Specify quantity wherever applicable.",
      "content": "Specify quantity wherever applicable. Quantity is an important part of any shopping list. Although given quantities are sometimes left off a list, it's good to know how much you should get of an item in advance. If you don't have an idea how fast an item runs out at your home, you won't need to be specific. Listing specific quantities is very important if you have a certain recipe in mind."
    },
    {
      "title": "Keep your list balanced.",
      "content": "Keep your list balanced. [3] X Research source Particularly when you're shopping for food, it's a smart idea to keep your grocery purchases as balanced as possible. Even if you're going shopping with one essential thing in mind, a successful trip will try to hit as many bases as possible. Keeping your grocery bag filled with dairy, meats, grains and other items like toiletries will leave you feeling like you accomplished more with your trip than if you simply went for a specialized, one-item run."
    },
    {
      "title": "Emphasize healthy choices.",
      "content": "Emphasize healthy choices. [4] X Research source Part of the charm in making a grocery list beforehand is that it enables you to make the healthiest choices. People who shop without lists are more prone to succumbing to impulse purchases. When you're planning out your list, try to think how each item will affect your life in the long run. Because you won't have the temptation directly in front of you, you'll be able to better judge which options are the best for your life."
    },
    {
      "title": "Compare prices online.",
      "content": "Compare prices online. Depending on where you live, there might be several different options you could go to for your shopping trip. Many of the biggest outlets, like Walmart, list their prices online. If you want to save on some money, you should look up some of the prices online for certain things you're looking to buy. Keep a sharp eye especially out for special deals a given outlet has over its competition. Some prices are controlled by the manufacturer. If this is the case, it won't matter where you buy the product."
    },
    {
      "title": "Use a phone app.",
      "content": "Use a phone app. [5] X Research source There is an app now available for virtually everything, and grocery planning is no exception. Having a shopping list on your phone is a good idea because you're able to add to the list as needed. You won't be under such a risk of losing the list either, and most grocery apps will auto-organize your shopping for you to make it more efficient."
    },
    {
      "title": "Write out a final copy.",
      "content": "Write out a final copy. All of the information you'll have for your shopping list may be disorganized in its pure note form. Depending on the size of your grocery trip, it may be worth the extra time it takes to write up a \"final draft\" of your list. Write out the items more neatly, and group them out according to their type. It may feel like extra work, but you'll be saved time in the supermarket if your list is legible and properly outlined. The process of organizing is simplified if you're using an app to help you with your shopping plans."
    },
    {
      "title": "Plan out your trip by aisle-type.",
      "content": "Plan out your trip by aisle-type. [6] X Research source Provided your shopping list is well-organized, you should be able to tell at a glance which items may be found in which aisles. Do a methodical sweep of the store. Go through the most important aisles first, and make sure you have all of the things you need before you move on. Try to cross off your shopping list categories (i.e.: fresh vegetables) at a time."
    },
    {
      "title": "Go shopping during off-peak hours.",
      "content": "Go shopping during off-peak hours. [7] X Research source Shopping are made easier if you go at times when the supermarket isn't as crowded. Late nights before closing are perfect for this, as well as weekday mornings when most people are busy working. In contrast, it's not recommended you go shopping during the weekend or in the early evening if you can help it. The supermarket will be busier and you'll spend more time wading through the foot traffic."
    },
    {
      "title": "Use cloth grocery bags.",
      "content": "Use cloth grocery bags. [8] X Research source Cloth grocery bags are a useful touch if you want the best shopping experience. You will save on the added fees for plastic bags, and cloth bags are more durable. Using cloth bags to shop with is also environmentally friendly, so you can feel good about yourself while you shop."
    },
    {
      "title": "Check the expiry date.",
      "content": "Check the expiry date. When you're buying food items, it's a smart idea to make a habit of checking the expiry date. This is especially important for things with a short shelf life such as milk. If there are multiple copies of an item available for purchase, check a few of them and pick whichever one has the latest expiry date."
    },
    {
      "title": "Keep an eye out for in-store specials.",
      "content": "Keep an eye out for in-store specials. [9] X Research source You should leave room on your shopping list for improvisation. In-store specials are worth exploiting if it's something you would have wanted anyway. Although your shopping trip shouldn't be dictated by what's on special, taking advantage of these opportunities is a great way to make the most of the money you spend."
    },
    {
      "title": "Get frozen foods last.",
      "content": "Get frozen foods last. If your shopping trip is going to be fairly in-depth, you'll want to count for the time the frozen grocery items will be out with you. Frozen products like ice cream shouldn't be kept out of frozen storage for too long unless you want a mess on your hands. If you think the shopping trip is going to take a while, aim to have these frozen foods picked up last."
    }
  ]
}