{
  "url": "https://www.wikihow.com/Go-to-Sleep-when-Scared",
  "title": "How to Go to Sleep when Scared",
  "steps": [
    {
      "title": "Fight the nightmares.",
      "content": "Fight the nightmares. While nightmares are common in childhood, adults experience them as well. If looking to rid yourself of nightmares, distract yourself with what you enjoy. [2] X Research source Provide yourself with sources of positive emotions to diminish the chances fear seeps into your thoughts while you sleep. After around 6:00 PM, only expose yourself to things that make you happy and comfortable."
    },
    {
      "title": "Try a mindfulness exercise.",
      "content": "Try a mindfulness exercise. One of the old standbys is counting backward from one hundred. Keep your eyes closed. See how low you can get. [3] X Research source Picture a beautiful outdoor vista you’ve seen or would like to see someday. Imagine the associated sounds and smells. Feel the breeze on your skin. Imagine yourself sitting calmly in your favorite fantasy realm. Try softly playing the audio of the setting you're envisioning. Avoid audio with words or other distractions elements. Look for an ambient, calming sound, like waves on the shore or rain falling. Soft, zen music is great too. An extra benefit of noise is the distraction it provides from frightening thoughts. Write in a journal before you go to bed. Writing can help you clear your mind by organizing your thoughts and expressing what your feeling externally."
    },
    {
      "title": "Practice mindfulness as you lie in bed.",
      "content": "Practice mindfulness as you lie in bed. If you’re dealing with a constant source of anxiety in your life, your mind may be translating an inability to relax into a fear of going to bed or falling asleep. Close your eyes and breathe deeply. Taking deep breaths will help calm and center your mind, driving away fear and anxiety. Remind yourself that it’s normal and okay to be uncertain, even fearful from time to time, and to have nights where you might not sleep as well as others. If you expect or worry about disruption during the night, prepare yourself for it mentally by counting on it occurring. As you’re falling asleep, visualize yourself, being woken up, rolling over, and falling back asleep."
    },
    {
      "title": "Avoid frightening or intense movies, stories, or TV shows before bed.",
      "content": "Avoid frightening or intense movies, stories, or TV shows before bed. Whether you love them or hate them, don’t watch horrific video entertainment before bed. This has less to do with fear in particular than it does with excitability in general. [4] X Research source [5] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019. Intense movies up your heart rate, blood pressure, and respiration whether they spook you or not. This is partly driven by the novelty of the experience; our minds are interested by (and linger on) things we’re not used to seeing. Even for movie-watching stoics, psychological arousal lingers in your brain following and intense movie. Even if you don’t feel frightened, your emotional and energy levels are perked by intense entertainment. And, of course, if you are frightened, it’ll be all the more challenging to fall asleep! See the wikiHow on how to get a scary movie off your mind ."
    },
    {
      "title": "Address any anxieties you have about sleep.",
      "content": "Address any anxieties you have about sleep. One source of anxiety that might translate into fear that keeps you up at night are persistent thoughts about how much sleep you’re getting. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Believe it or not, anxiety and fear associated with sleep is a form of performance anxiety. Don’t allow yourself to continue thinking about what time it is, what time you have to wake up, or anything related to the quality of the rest you’ve been getting. When these thoughts arise, push them away by thinking about someone or something you enjoy. Recognize that the fear of sleep, like most anxieties, is based on your perspective."
    },
    {
      "title": "Calm down children who suffer from frequent nightmares.",
      "content": "Calm down children who suffer from frequent nightmares. The increase in imagination during preschool, coupled with the recognition that bad things sometimes happen to people lead to nighttime distress for many children. [7] X Research source There are several helpful steps you can take to prepare a child for more restful sleep. Give the child a comfort object, such as a stuffed animal or blanket. Read a positive, cheerful book to the child before bed, maybe even one you know the child enjoys. [8] X Research source When your child wakes up from a nightmare, assure them immediately that they are safe. Talk about fun things the shadows in the child’s room looks like. This will increase their comfort with the space in which they sleep. If a child brings up disturbing thoughts after a nightmare, speak about them specifically during the day. Avoid consistently allowing your child to sleep in your bed, as this may lead to a dependence on doing so. For more specific tips, see the wikiHow on how to help children who suffer from frequent nightmares."
    },
    {
      "title": "Get professional help.",
      "content": "Get professional help. Both children and adults should see a healthcare professional if trouble sleeping because of fear does not subside. There are doctors who specialize in sleep, and many hospitals even have labs dedicated to treating sleep issues! [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Mental health professionals in particular can help tailor a plan specific to your needs. Fear and sadness are quite similar. Talking about both with someone may not only help you sleep better, but feel better during the day as well! It may purely be a physical ailment that’s leading you to feel uncomfortable (and maybe fear the way you’re feeling). In this case, a doctor may be able to quickly get you back to sleeping comfortably."
    },
    {
      "title": "Establish a bedtime ritual.",
      "content": "Establish a bedtime ritual. Commit to a regular, relaxing routine just before you get in bed. This will send a cue to your body that it’s time to rest. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [11] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019. For instance, first take a shower, then dim the lights before getting in bed, then read for 20 minutes. Choose an order of operations that you prefer; it’s the consistency that matters. Turn the temperature down in your bedroom. This will be especially helpful in convincing your body to go to sleep if you take a warm shower before getting in bed."
    },
    {
      "title": "Ensure a comfortable sleeping environment.",
      "content": "Ensure a comfortable sleeping environment. Adjust temperature and lighting to help with this. Keep the lights dim in the evening hours, and make your bedroom dark, cool, and quiet. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [13] X Expert Source Alex Dimitriu, MD Sleep Specialist Expert Interview. 16 October 2019. Keep a dim light on. If the dark discomforts you, dispel this uneasiness by keeping a light on. Make sure it isn’t too bright, and is positioned well away from your face. Try a blue or green tinted cover on a small nightlight plugged into the wall across the room from where you sleep. Keep it as dark as is comfortable. Light is a natural signal to your body to be awake, so you only want to have the minimum amount of light to prevent feeling frightened. [14] X Research source Instead of keeping a light on, simply keep a flashlight by the side of your bed and know that you can quickly grab it if need be."
    },
    {
      "title": "Avoid screens right before bed.",
      "content": "Avoid screens right before bed. Turn off all of the screens in your room. Shut down TVs, video games, computers, and even cell phones an hour before you want to be asleep. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Aside from the light that screens emit, the operation of a screen keeps you subconsciously engaged with the world outside your bedroom. [16] X Research source"
    },
    {
      "title": "Go to bed earlier.",
      "content": "Go to bed earlier. Going to bed earlier may seem like it will make it harder to fall asleep, but you will likely not experience as much fear. For one, fear about how much sleep you’re getting will be eliminated. Further, fear felt from sleeping alone is less likely if you’re still hearing everyday noises from outside. Try getting up earlier too. Getting up before sunrise is incredibly rewarding, and you may even find comfort as the pre-dawn darkness gives way to sunshine. Don’t take a nap during the day. Napping during the day may contribute to a sleep cycle that makes it hard to sleep at night, which in turns leads to anxiety about getting the proper amount of sleep."
    },
    {
      "title": "Exercise lightly right before bed.",
      "content": "Exercise lightly right before bed. Gentle, restorative yoga or stretching can calm you down and prepare your body for rest. Sign up for a weekly yoga class, or watch yoga videos to learn some poses. Poses where you fold forward, either upright or on the ground, can be particularly helpful in calming you down. [17] X Trustworthy Source TeensHealth Website run by Nemours, a nonprofit children's healthcare system, for the purpose of providing teens and young adults with specific health resources Go to source Breathe with purpose. Whatever the pose, breathing is an important aspect of yoga. A 1:2 pattern is great for relaxation; exhale for 2x the count of your inhale, in whatever increment feels most natural. For instance, if your natural inhale is 3 counts, exhale for six counts. Increase these numbers as you relax. Even without doing a pose, this simple breathing exercise will calm you down. [18] X Research source Try a forward fold. From an upright, standing position, fold forward as far as it is comfortable to do so, exhaling and extending your spine. Slide your hands down and around to the back of your legs. As you inhale, straighten your back to a horizontal position, sliding your hands towards the back of your knees. Push your chest gently down through your arms. Exhale and bend back down, hands on the back of your legs all the while. Keeping the knees slightly bent throughout the routine, and allow the head to hang loosely when you’re folded forward. After six folds, hold a forward fold pose for ten breaths. [19] X Research source During the day, go for a jog, play a recreational sport, or hit the gym – working out will help you fall asleep later on. Avoid strenuous activity in the few hours prior to going to bed."
    },
    {
      "title": "Watch what you eat and drink.",
      "content": "Watch what you eat and drink. A proper diet is vital to healthy living, as well as healthy sleeping. Do not eat a large meal within two hours of bedtime, as this can decrease your comfort and interrupt your sleep. [20] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Eat breakfast. Fruit and whole grains are great options. Start your day with energy, and prevent the urge to overeat later in the day. Cut the evening caffeine. Don’t drink or eat sources of caffeine (including coffee, tea, or chocolate) after 4:00 pm. Don’t provide caffeine to children (including soda) after 3:00 in the afternoon. [21] X Research source"
    },
    {
      "title": "Have a bedtime snack.",
      "content": "Have a bedtime snack. Keep it light, but a snack before bed may help you fall asleep more easily. Try a glass of milk, a small bowl of whole-grain cereal or rice, or a handful of nuts. [22] X Research source Caffeine-free tea can also be especially effective in preparing your mind and body for rest, without the extra calories before bed."
    },
    {
      "title": "Consider the pet.",
      "content": "Consider the pet. If you think a pet will decrease the fear you feel while falling asleep, consider getting one. On the other hand, if you already sleep with a pet but wake up frequently during the night, consider relegating them to their own resting spot. [23] X Research source Even if you don’t think your pet is waking you up at night, they may be diminishing the quality of the rest you’re getting. Try sleeping on your own for a few nights and see if it helps. Dogs not only comfort their owners, they even add a bit of security to your home. You can train a dog to sleep wherever is most comfortable for you, such as at the foot of your bed."
    },
    {
      "title": "Consider installing an alarm in your home.",
      "content": "Consider installing an alarm in your home. Not only will this add security to your home, the knowledge of that security may reduce any nighttime fears for you or your family members."
    },
    {
      "title": "Listen to the news.",
      "content": "Listen to the news. If there’s something happening in your area and you can’t go anywhere to ensure your safety, monitor the news to stay aware. Both natural disasters and conflict can develop rapidly, and being aware will increase your safety. [24] X Research source Hearing that a storm has passed or that a civil scenario has been resolved can reassure you that you’re safe for the night too. In the event a dangerous scenario is ongoing, be aware of the additional precautions that may be worth taking to keep yourself safe during the night. If you’re unsure of the safety of the building in which you’re sleeping during inclement weather, go somewhere else or shelter yourself in an especially sturdy room, such as a basement. Leave a flashlight or other light source near you while you sleep."
    },
    {
      "title": "Check all access points to the room or building.",
      "content": "Check all access points to the room or building. Ensure that the doors are locked and the windows are secured as best as possible. During extreme weather, you may want to cover or remove glass from your vicinity. [25] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Have someone keep a lookout. Take turns and sleep and monitoring the situation. A lookout can wake everyone up should something disturb the peace and need attending to."
    },
    {
      "title": "Check that everyone is sleeping safely and comfortably.",
      "content": "Check that everyone is sleeping safely and comfortably. Knowing that everyone else is safely sleep can be a source of reassurance as you know that everyone will be able to better handle whatever the following day may hold. If people are still awake, reassure one other. Tell stories and reminisce. Talking will help calm any nerves, and diminish any fear. Snuggle up. Keep warm, stay together and feel the reassurance of being close to others."
    }
  ]
}