{
  "url": "https://www.wikihow.com/Legendary-Sword-Dealer",
  "title": "Complete Guide to Finding the Blox Fruits Legendary Sword Dealer",
  "steps": [
    {
      "title": "Meet the requirements (optional).",
      "content": "Meet the requirements (optional). In order to easily find the Legendary Sword Dealer, you must be over level 850 and you must have completed Bartilo's quest. If you don't meet these requirements, you won't be able to get help from the Manager to know when the Legendary Sword Dealer has spawned. [1] X Research source You don't need to meet these requirements to buy from the Legendary Sword Dealer, however it's highly recommended due to how difficult it can be to find this NPC."
    },
    {
      "title": "Join a server.",
      "content": "Join a server. You can join either a public or private server, but there are two things to note when you first join a server: You must wait at least 10 minutes after joining either a public or private server to get help from the Manager. This is to prevent server hopping. If you join a brand new private server, the Legendary Sword Dealer won't spawn until the server is at least 4 hours and 15 minutes old."
    },
    {
      "title": "Set your home point to the Kingdom of Rose docks.",
      "content": "Set your home point to the Kingdom of Rose docks. All of the potential spawn locations are in or around the Kingdom of Rose, so setting your spawn point to the Kingdom of Rose docks will help save time."
    },
    {
      "title": "Check all the possible spawn locations.",
      "content": "Check all the possible spawn locations. There are 7 possible spawn locations, but two are located in the green zone. Check the section below for more details about each spawn location, but the most efficient route is: Factory > Colosseum > Waterway > Green Zone > Graveyard > Remote Island"
    },
    {
      "title": "Talk to the Manager in the Cafe.",
      "content": "Talk to the Manager in the Cafe. The Cafe is also located in the Kingdom of Rose. The Manager is an NPC wearing a black shirt, black pants, and a green apron. The Manager's only purpose is letting the player know the status of the Legendary Sword Dealer. He will say different lines depending on the sword dealer's status: [2] X Research source \"Are you new to this island?\" - The user hasn't completed Bartilo's Quest yet \"It's still too early for you to be here.\" - You joined the server in the last 10 minutes and need to wait longer \"Some pirates said they ran into him on a nearby island last week. Check back later and I'll let you know what I hear.\" - The Legendary Sword Dealer will spawn in about 4 hours If the Manager says this line, it's recommended to move to another server. If you decide to server hop, repeat this step until the Manager says a different line. \"A man in here earlier claimed to see his ship nearby today. Check back with me later.\" - The Legendary Sword Dealer will spawn in about 1 hour 15 minutes If the Manager says this line, it's not recommended to server hop. Wait around the Cafe area until the line changes. \"I think he should be getting here soon, it's all anyone in here has been talking about.\" - The Legendary Sword Dealer will spawn in about 15 minutes If the Manager says this line, you should not server hop. Keep checking with the Manager until he says the next line. \"Hey! I just saw him! He told me he would be in the area for 15 minutes. Good luck!\" - The Legendary Sword Dealer has spawned, and will be available for 15 minutes If the Manager says this line, move to the next step. \"Meh, he left not too long ago.\" - The Legendary Sword Dealer has despawned, and will return in about 3 to 4 hours"
    },
    {
      "title": "Check all the spawn locations again.",
      "content": "Check all the spawn locations again. Once the Manager says \"Hey! I just saw him! He told me he would be in the area for 15 minutes. Good luck!\" , you have 15 minutes to find the Legendary Sword Dealer before any other players do. Check all the spawn locations again in this order: Factory > Colosseum > Waterway > Green Zone > Graveyard > Remote Island If you can't find the Legendary Sword Dealer after checking all the locations, speak to the Manager again. If he says that the sword dealer is still here, check all the spawn locations again. If he says that the sword dealer has left, that means someone else got to him before you did. Server hop to a new server until you find the Legendary Sword Dealer."
    },
    {
      "title": "Purchase a sword from the Legendary Sword Dealer.",
      "content": "Purchase a sword from the Legendary Sword Dealer. Once you find the Legendary Sword Dealer, you can purchase one of three legendary swords: Saddi, Shisui, and Wando. The sword dealer will stock one of these swords at random. If you already own the sword the Legendary Sword Dealer is selling, you can't buy another one. Only one player can buy a sword from the Legendary Sword Dealer before he despawns. If another player finds him first and buys a sword, he will despawn, and you'll have to try again. If you own all three swords the Legendary Sword Dealer sells, the Manager will always say \"Meh, he left not too long ago.\" and you won't be able to buy anything else from the sword dealer."
    },
    {
      "title": "The Legendary Sword Dealer has 7 possible spawn locations.",
      "content": "The Legendary Sword Dealer has 7 possible spawn locations. These locations are all in or near the Kingdom of Rose in the Second Sea. Inside the arches on the north-east side of the Colosseum In the waterway under the Kingdom of Rose Atop a leaf attached to the center beanstalk in the Green Zone Behind a rock formation in the Green Zone, near Fajita Behind a plateau near the factory, close to Jeremy Inside the center house on Usoapp's Island"
    },
    {
      "title": "The Legendary Sword Dealer sells Saddi, Shisui, and Wando.",
      "content": "The Legendary Sword Dealer sells Saddi, Shisui, and Wando. Each of these legendary swords costs $2,000,000. Once you have obtained all three swords, there's nothing more you can purchase from the Legendary Sword Dealer. These three swords are needed to get the True Triple Katana ."
    }
  ]
}