{
  "url": "https://www.wikihow.com/Make-Slime-with-Shampoo",
  "title": "How to Make Slime With Shampoo (& Without Glue)",
  "steps": [
    {
      "title": "Pour some shampoo into a small container and stir.",
      "content": "Pour some shampoo into a small container and stir. Use a small spoon or stirring stick and stir the shampoo vigorously for about 2–4 minutes. Keep stirring until the shampoo is filled with tiny air bubbles and feels thick. [1] X Research source You don’t need a particular type of shampoo for this, but you’ll probably get a thicker slime if you use a thicker shampoo."
    },
    {
      "title": "Place the slime in the fridge for 2–3 hours, stirring every 30 minutes.",
      "content": "Place the slime in the fridge for 2–3 hours, stirring every 30 minutes. Cover the container and place it in your fridge. After 30 minutes, stir the slime vigorously for about 30 seconds, then cover it again and put it back in the fridge. Keep stirring every 30 minutes until the mixture has a slime-like texture. [2] X Research source Once the slime has set, take the container out of the fridge. Keep stirring and kneading it until it starts to get stretchy and holds its shape. This slime is a little runny and sticky, but it’s fun to play with, and you only need one ingredient!"
    },
    {
      "title": "Pour 1/2 cup (120 milliliters) of shampoo into a bowl.",
      "content": "Pour 1/2 cup (120 milliliters) of shampoo into a bowl. Thicker shampoos will give you better results. Choose a color and a fragrance that you like. [3] X Research source If you want to change the color of your slime, add a few drops of liquid food coloring into the bowl. If you want glittery slime, add some glitter. Stir everything together with a spoon. [4] X Research source"
    },
    {
      "title": "Add 2 1/4 cups (280 grams) of cornstarch.",
      "content": "Add 2 1/4 cups (280 grams) of cornstarch. Stir the mixture with your spoon until the ingredients are completely combined. [5] X Research source If you want a thicker slime, you can stop here. If you want a runnier, gooier slime, keep going to the next step. If you don't have cornstarch where you live, look for corn flour instead."
    },
    {
      "title": "Add 1 US tbsp (15 ml) of water at a time.",
      "content": "Add 1 US tbsp (15 ml) of water at a time. You may need to add up to 6 US tbsp (89 ml) of water, but don’t add it all at once. The more water you add, the runnier your slime will be. [6] X Research source If you like a more dough-like slime, you may not need much or any water."
    },
    {
      "title": "Knead the slime by hand.",
      "content": "Knead the slime by hand. Once you’re happy with the consistency, your slime is ready to play with! Scoop it out of its bowl, then squish it, knead it, and let it run through your fingers. Store the slime in an airtight container once you are done playing with it. You may need to add 1/4 teaspoon of water to refresh the slime the next day. [7] X Research source"
    },
    {
      "title": "Squeeze some thick shampoo into a bowl.",
      "content": "Squeeze some thick shampoo into a bowl. You can use any type of shampoo you want, but thicker shampoos work better. Choose a color and fragrance that you like. [8] X Research source To make a thicker slime, mix equal parts shampoo and body wash. [9] X Research source Make sure that your body wash and shampoo are similar colors, or your slime will look muddy."
    },
    {
      "title": "Stir in some salt until the shampoo thickens.",
      "content": "Stir in some salt until the shampoo thickens. There is no set amount for the salt—each brand of shampoo reacts differently with it. Add in a pinch of salt, then stir the slime. Keep adding salt and stirring until the shampoo turns into a glob. [10] X Research source"
    },
    {
      "title": "Freeze the shampoo for 15 minutes.",
      "content": "Freeze the shampoo for 15 minutes. Once the slime starts to come together, place the bowl into the freezer. Leave it there for 15 minutes. [11] X Research source"
    },
    {
      "title": "Play with the slime.",
      "content": "Play with the slime. Once the freezing time is up, the slime will have set and is ready to play with! When you are done playing with it, put it into an airtight container. You may need to re-freeze it for about 15 minutes if it starts to get too runny."
    },
    {
      "title": "Squeeze some 2-in-1 shampoo into a mixing bowl.",
      "content": "Squeeze some 2-in-1 shampoo into a mixing bowl. The 2-in-1 combo shampoos work the best for this slime. Choose a fragrance that goes well with mint, like strawberry. You can try plain shampoo as well, but make sure that you use one that’s thick."
    },
    {
      "title": "Add in enough toothpaste to create a 1:1 ratio with the shampoo.",
      "content": "Add in enough toothpaste to create a 1:1 ratio with the shampoo. You can use either white toothpaste or gel toothpaste. Add about the same amount of toothpaste as shampoo."
    },
    {
      "title": "Stir the mixture and adjust the ingredients as needed.",
      "content": "Stir the mixture and adjust the ingredients as needed. Keep stirring until the color is consistent and no streaks remain. As you stir, the shampoo and toothpaste will come together and form a putty-like slime. If the slime is too thick, add in some more shampoo. If it is too thin, try some more toothpaste. Stir well each time you adjust the ingredients."
    },
    {
      "title": "Play with the slime.",
      "content": "Play with the slime. This slime is not quite as gooey as the store-bought kind, but it is fun to poke and prod. When you are done playing with it, scoop it into an airtight container."
    },
    {
      "title": "Mix 1/2 tsp (3 g) of baking soda and 1⁄4 cup (59 ml) of gel shampoo.",
      "content": "Mix 1/2 tsp (3 g) of baking soda and 1 ⁄ 4 cup (59 ml) of gel shampoo. Measure about 1 ⁄ 4 cup (59 ml) of clear gel shampoo into a small bowl. Then, stir in about 1/2 tsp (3 g) of baking soda. Mix everything together with a small spoon or stir stick until it’s completely combined and the soap thickens and starts to turn opaque. [12] X Research source You may need to stir for several minutes. If you’d like, you can add a drop of food coloring to get a more colorful slime."
    },
    {
      "title": "Refrigerate the mixture for 24 hours.",
      "content": "Refrigerate the mixture for 24 hours. Cover the container and put the slime in the fridge for about a day to set up. If you’re in a hurry, try putting it in the freezer for about an hour instead. If you don’t want to use a fridge or freezer, let the mixture sit covered at room temperature for 2 days. [13] X Research source This slime is gooey, jiggly, and stretchy. But it’s also a little sticky, so it might be messier than some other slimes."
    },
    {
      "title": "Pour some shampoo into a small bowl.",
      "content": "Pour some shampoo into a small bowl. You can use gel or opaque shampoo as long as whatever you choose is thick. It’s also a good idea to choose a product that smells good to you. [14] X Research source If you want your slime to be more colorful, add food coloring to the shampoo."
    },
    {
      "title": "Mix a pinch of salt into the shampoo, then a squirt of shaving cream.",
      "content": "Mix a pinch of salt into the shampoo, then a squirt of shaving cream. Add a pinch of salt and stir it in really well. Keep adding salt and stirring it in until the shampoo takes on a thick, gloopy consistency. [15] X Research source Then, add a small squirt of foam shaving cream to the shampoo mixture and stir it in. [16] X Research source Before you add the shaving cream, the mixture will look like slime, but it will be very sticky. Once you add the shaving cream, it will be fluffier but not as stretchy."
    },
    {
      "title": "Freeze the slime for 10 minutes, adjust the ingredients, and enjoy.",
      "content": "Freeze the slime for 10 minutes, adjust the ingredients, and enjoy. Cover the container and put it in the freezer for about 10 minutes. Test the consistency when it comes out—if it’s too sticky, add more salt, and if it’s too wet, add more shampoo. [17] X Research source When the slime is the right consistency, it should be squishy, stretchy, and jiggly."
    },
    {
      "title": "Adjust the ingredients ratio if your slime is too thick or runny.",
      "content": "Adjust the ingredients ratio if your slime is too thick or runny. If you’re making a slime with more than one ingredient, sometimes you’ll need to adjust the proportions. For instance, you might need a little more salt if you’re using a thin shampoo in a shampoo-and-salt slime. But make the changes gradually—add a little more of one ingredient, then stir very well before you make any more adjustments. If your shampoo slime doesn’t turn out well, try again with a thicker shampoo. Be sure to regularly stir mixtures that you put in the fridge or freezer so they’ll keep their slime-like texture."
    },
    {
      "title": "Rinse your hands well after handling slime.",
      "content": "Rinse your hands well after handling slime. Don’t give this slime to babies or toddlers who put their hands in their mouth, and supervise small children—this soapy slime shouldn’t be tasted. And be sure to rinse your hands well after playing with it. Although it’s rare, some shampoos may cause fragrances or preservatives that could cause an allergic reaction. If shampoo slime causes your skin to be red or itchy, stop using it and gently rinse away any residue. [18] X Research source"
    },
    {
      "title": "Play with slime on a washable surface and use rags to clean up residue.",
      "content": "Play with slime on a washable surface and use rags to clean up residue. This slime tends to be stickier than other slimes, so it’s a good idea to play with it on a tablecloth, place mat, or plate. When you’re finished, use a damp cloth to clean up any residue, and wash your hands thoroughly. If you’d like, you can toss the slime into a warm bath after you’re finished—it will melt and leave the water soapy."
    },
    {
      "title": "Store your slime in an airtight container.",
      "content": "Store your slime in an airtight container. Most shampoo slimes will keep for a few days if you place them in a covered container. If your slime does dry out a little, add a few drops of water and stir or knead until it’s stretchy again. When the slime gets too sticky to play with, it’s time to toss it and make new slime."
    }
  ]
}