{
  "url": "https://www.wikihow.com/Identify-Snakes",
  "title": "How to Identify Snakes",
  "steps": [
    {
      "title": "See if the snake has a bright and colorful pattern.",
      "content": "See if the snake has a bright and colorful pattern. This is one of the easiest ways to tell if a snake is venomous from a distance. Many snakes that have a bright, colorful body are venomous, such as the coral snake. [1] X Research source The color and pattern of coral snakes is the best way to identify this species, as it lacks other common characteristics of venomous snakes such as a rattle, elliptical eyes, and heat sensing pits. Coral snakes have bright yellow, red, and black bands. However, there are always exceptions to these characteristics. For example, the Black Mamba snake which is found in Eastern and Southern Africa is extremely venomous, yet it is solid brown in color. [2] X Trustworthy Source National Geographic Website of the National Geographic Society Go to source"
    },
    {
      "title": "Look for a triangular head and a sharp jawline.",
      "content": "Look for a triangular head and a sharp jawline. It's easiest to see the shape of the snake's head by looking at it from the side rather than from above. Venomous snakes tend to have a head that is shaped like an arrow, with a thin neck, sharp face, and a bulbous jaw. This is because of the protruding venom glands which are located in the snake's neck. [3] X Research source Non-venomous snakes usually have rounded faces, however, some can flatten their heads to look more arrow-like if they feel threatened."
    },
    {
      "title": "Determine if the snake has elliptical eyes if you are close enough.",
      "content": "Determine if the snake has elliptical eyes if you are close enough. While it isn't advisable to approach a snake that you come across, if you are already close enough to see the shape of its eyes this will help you to identify if it is venomous or not. Many venomous snakes have slit-like eyes, similar to a cat, rather than round eyes like many non-venomous species. [4] X Research source Rattlesnakes, copperheads, and cottonmouths all have elliptical eyes."
    },
    {
      "title": "Check between the eyes and nostrils for heat-sensing pits.",
      "content": "Check between the eyes and nostrils for heat-sensing pits. A group of venomous snakes called pit vipers have a small slit between each eye and nostril. These organs help the snakes to detect changes in temperature, which is useful when hunting prey. [5] X Research source To see if a snake has heat-sensing pits you will have to be very close to it, which is not recommended. This characteristic is useful if you are trying to identify snakes based on a picture or video instead. Most venomous snakes in the U.S. are part of the pit viper group of snakes. This group includes rattlesnakes, copperheads, and cottonmouths. This is just a guideline, since pythons and boas also have heat pits, but they just look a bit different. [6] X Research source"
    },
    {
      "title": "Listen for a rattling sound to identify a rattlesnake.",
      "content": "Listen for a rattling sound to identify a rattlesnake. Rattlesnakes are a very common type of venomous snake. The distinct rattling sound provides a helpful warning not to get any closer to the snake and to stay away. [7] X Research source A rattling sound or seeing a rattle on the end of a snake's tail is the best way to tell rattlesnakes apart from other venomous species. Despite not having a rattle, copperhead snakes can sometimes make a rattling sound as they move through leaves. Regardless of if the snake is a rattlesnake or a copperhead, it's safest to vacate the area if you hear the sound, rather than trying to work out what species it is."
    },
    {
      "title": "Look for an hourglass pattern to identify a copperhead.",
      "content": "Look for an hourglass pattern to identify a copperhead. The best indicator of a copperhead snake is the repeated, hourglass-shaped bands that cover its body. Copperheads are a reddish-brown color and are found across the Central and Eastern U.S. [8] X Research source Although some harmless species share a similar pattern to copperheads, it's best to avoid the snake if you notice an hourglass pattern."
    },
    {
      "title": "Identify a cottonmouth by looking for a stocky body and tail.",
      "content": "Identify a cottonmouth by looking for a stocky body and tail. Cottonmouth snakes tend to be very short and thick for their length. Defining characteristics include a head that is much wider than the neck, a very short and heavy tail, and a brown-black pattern. Cottonmouths are found across the Southeastern U.S. [9] X Research source Cottonmouths are often confused with water snakes, a non-venomous species. Water snakes have a similar body pattern but are much thinner and more slender."
    },
    {
      "title": "Look for a solid body color.",
      "content": "Look for a solid body color. Most non-venomous snakes have a solid body color that isn't bright. A snake's color is described as solid when only 1 color dominates its back or belly. There may be variations in the color, but overall, the pattern is uniform. [10] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source For example, adult black racer snakes are harmless and are either a solid black or bluish-grey. Rough green snakes are solid green in color, and worm snakes are fully brown. [11] X Research source Some common non-venomous snakes that have solid yet differing colors for the body and belly include the Northern redbelly snake (black body and a red belly), the ringneck snake (black body and a yellow belly), and the Southeastern crowned snake (tan body and a white or pink belly). These characteristics are just a general guideline, as there are always exceptions to the rule when identifying snakes. For example, the non-venomous king snake has very similar coloring to the venomous coral snake. When in doubt, it's safest to just avoid the snake. [12] X Research source"
    },
    {
      "title": "Check the shed snakeskin for a double belly scales.",
      "content": "Check the shed snakeskin for a double belly scales. Look at the belly area of the shed snakeskin. Many non-venomous snake species have belly scales that are divided down the center, creating a divided row of scales. Contrastingly, the shed snake skin of a venomous snake will commonly have a singular row of scales, which is called non-divided. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source It's best to use this method only with a shed snakeskin, as it can be dangerous to get too close to an unidentified snake."
    },
    {
      "title": "See if the snake has a round head.",
      "content": "See if the snake has a round head. Look at the snake's head from the side if possible. Most non-venomous snakes have a smooth, round head. The head won't be angular or have a large, sharp jawline due to the lack of venom glands. [14] X Research source"
    },
    {
      "title": "Check that the snake has round pupils.",
      "content": "Check that the snake has round pupils. Although it's safest to not approach snakes, try to look at the shape of its pupils if you are already close enough. Non-venomous snakes have round pupils, similar to humans, while venomous snakes tend to have pupils that look like slit-like or similar to a cat. [15] X Research source"
    },
    {
      "title": "Make sure that the snake doesn't have fangs.",
      "content": "Make sure that the snake doesn't have fangs. While all snakes have teeth and can bite, only venomous snakes have fangs. Fangs are used to inject venom into the area that has been bitten. The fangs look like long, protruding teeth at the top of the snake's jaw. These are normally seen when the snake has its mouth open. Avoid getting close enough to the snake to see if it has fangs or not. It's best to use the presence of absence of fangs as an identifying characteristic for snakes in pictures or videos."
    },
    {
      "title": "Use a snake reference website to identify snakes in your region.",
      "content": "Use a snake reference website to identify snakes in your region. Use a search engine to find a website that is specific to the location where you want to identify snakes. These websites usually guide you through answering questions about the snake to determine the defining characteristics or show you pictures of common snakes in the area. Many local government and council websites provide these services. There are also websites that provide maps about where common species of snakes are found. Online resources are ideal for identifying snakes because you can utilize them from either your computer or smartphone, and they are free to use."
    },
    {
      "title": "Check a reference book to find detailed entries of a wide variety of snake species.",
      "content": "Check a reference book to find detailed entries of a wide variety of snake species. You can purchase snake reference guides from bookstores or online. You can also visit your local library to take out a book about snakes. There are books available that describe different snake species around the world or you can choose one that is specific to the types of snakes that are found in your region. [16] X Research source If you can't find a general snake reference guide, try to find one that is specifically written about your location. For example, Amphibians and Reptiles in Minnesota by John J. Moriarty and Carol D. Hall is an ideal reference book to start with if you want to identify snakes in Minnesota."
    },
    {
      "title": "Use an app to identify the snake if you have a smartphone.",
      "content": "Use an app to identify the snake if you have a smartphone. When you are out and about and you see a snake, you can use your smartphone to quickly find out the type and if it is venomous or not. Search for and download an app that is specific to your region, so that you can get an accurate identification. Then enter the characteristics of the snake that you want to identify and the app will show you pictures to help you match the snake to the species. Even if you don't want to identify a snake on the spot, a snake identification app can help you to learn more about the snakes in your region. Many countries and regions have snake identification apps. There are apps for Africa, India, and several states in the U.S. [17] X Research source"
    }
  ]
}