{
  "url": "https://www.wikihow.com/Make-Ginger-Water",
  "title": "How to Prepare Ginger Water",
  "steps": [
    {
      "title": "Trim off the tip of the ginger.",
      "content": "Trim off the tip of the ginger. A knob of ginger will have one rounded edge that was not previously cut. Cut off this edge using a sharp knife from your kitchen, like a butcher or pairing knife. Both ends of your ginger should be flat. [1] X Research source"
    },
    {
      "title": "Remove the skin.",
      "content": "Remove the skin. Stand the ginger upright on one of its flat sides. Slide your knife along all sides of the ginger to remove the skin. [2] X Research source If you prefer, you can use a potato peeler. However, it's quicker to simply slice off the sides."
    },
    {
      "title": "Scrape the ginger along a cheese grater.",
      "content": "Scrape the ginger along a cheese grater. Hold a cheese grater over a bowl at an angle. Press your ginger against the grater. Swipe it across the grater using long, steady motions. Keep grating the ginger until it's completely grated in a fine pulp. [3] X Research source"
    },
    {
      "title": "Cut your lemon in half.",
      "content": "Cut your lemon in half. Take a sharp knife from your kitchen. Place your lemon on a cutting board or similar surface. Cut it in half down the middle."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Wet your hands with clean, running water and then lather them with hand soap. Scrub your hands for about 20 seconds, making sure to target areas like between your fingers, the backs of your hands, and under your fingernails. Then, rinse your hands thoroughly. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source To keep track of time, hum the \"Happy Birthday\" song twice."
    },
    {
      "title": "Hold the lemon above a container, cut side up.",
      "content": "Hold the lemon above a container, cut side up. Take a container such as a bowl or glass. In one hand, hold the lemon in the palm of your hand. The cut-side should be facing upward."
    },
    {
      "title": "Squeeze the lemon.",
      "content": "Squeeze the lemon. Use your hand to squeeze the lemon as hard as you can. The juice should run over your hands and down the sides of the lemon. Keep squeezing the lemon until juice is no longer coming out steadily."
    },
    {
      "title": "Remove any seeds.",
      "content": "Remove any seeds. Squeezing the lemon cut-side up should prevent most seeds from getting into the lemon juice. However, some seeds may drip into the lemon juice anyway. If you notice any seeds, remove them with a fork or spoon."
    },
    {
      "title": "Pour a 12-ounce glass of room temperature water.",
      "content": "Pour a 12-ounce glass of room temperature water. Let it sit out until the temperature of the water is roughly the same as the room's temperature. You can use your finger to test the water's temperature. [5] X Research source The time it takes your water to cool depends on how hot or cold it was when you poured it. Room temperature water tends to mix better with ginger and lemon."
    },
    {
      "title": "Add the lemon juice to your glass.",
      "content": "Add the lemon juice to your glass. Pour the lemon juice from earlier into your glass of water. Use a spoon to stir the mixture until the lemon juice is thoroughly mixed in. [6] X Research source"
    },
    {
      "title": "Mix in the ginger.",
      "content": "Mix in the ginger. Pour the grated ginger into your water. Use a spoon to mix the ginger until you have an even mixture. You can now drink your ginger water. [7] X Research source If you want to cool your beverage, you can add ice."
    },
    {
      "title": "Store the water in the fridge.",
      "content": "Store the water in the fridge. Ginger water generally lasts for about a day after mixing. If you don't finish your water right away, store it in the fridge overnight. [8] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}