{
  "url": "https://www.wikihow.com/Get-What-You-Want-for-Christmas",
  "title": "How to Get What You Want for Christmas",
  "steps": [
    {
      "title": "Think about your family and friends.",
      "content": "Think about your family and friends. They probably want to make all your Christmas wishes come true, but, many wishes come with a cost and it is usually money. Try hard not to ask for things that your family and friends can't afford. If you have a lot of brothers and sisters it might be hard for your parent/s to get all of you everything you want. Remember there are other things parents have to pay for at Christmas like food and decorations. Your parents may have to compromise on buying things for everyone at Christmas or making one person very happy. They won't have to choose if you pick a gift they can afford. Don't sulk or say Christmas will be ruined for you if you don't get everything you want."
    },
    {
      "title": "Use a website or app.",
      "content": "Use a website or app. Many big stores, especially toy stores, let you create an account on their website where you can make a wish list filled with things you want for Christmas. You can give the link to your wish list to friends and family so they can go online to find out what you want. There are also many apps that allow you to create a wish list on your phone and share it with friends and family through text, email or social media."
    },
    {
      "title": "Email your wish list.",
      "content": "Email your wish list. You can type what you want for Christmas in a fun holiday email and send it to friends and family. Collect all of the email addresses and send the list to as many people as you want. You can send it as a group email, or to be more personal you can send the emails individually with a personalized note in each one. Make the email have a theme of gratitude to show your friends and family that you’re thankful to have them all in your life and not just asking for presents."
    },
    {
      "title": "Write your list on paper.",
      "content": "Write your list on paper. Write your Christmas list down on paper and hang it up in your house. Hang it somewhere that your family will see and read it. You can also mail a letter to friends and family that has your list on it. Make sure you mail it early enough for your friends and family to get it before Christmas."
    },
    {
      "title": "Hint at what you want.",
      "content": "Hint at what you want. Let your friends and family know that you really want something by mentioning the item casually. Bring up the item you want several times over a period of days or weeks before Christmas. ”I saw a new bike at the store and thought it would be really fun to ride.” ”My friend got a new bike and wants me to ride with him; I wish I had one to join him” ”Did you know that bikes were on sale this week at the sporting goods store? Maybe this is a good time to get one.”"
    },
    {
      "title": "Tell your family you only want one specific item.",
      "content": "Tell your family you only want one specific item. Make sure that your parents know exactly what you want by telling them the specific thing you want. Tell them that you’d be happy if that was the only item you got this year. Chances are you will still get other presents, but let them know that this one thing means a lot to you."
    },
    {
      "title": "Leave a note saying what you want.",
      "content": "Leave a note saying what you want. Leave a note with a nice message for your parents that includes the item you want for Christmas. Make sure that you compliment or thank your parents in the note and aren’t just demanding a new toy. ”I’m really glad I have the best parents in the world! I hope I can get an XBox for Christmas!”"
    },
    {
      "title": "Do extra chores.",
      "content": "Do extra chores. Volunteer to help out around the house to show your parents how responsible you can be. Try to pitch in with extra chores so your parents want to reward your help with a special present. The more you are able to do, the more likely your parents will be willing to get you the things you want. Offer to do the dishes. Clean your room really well. Offer to wash the windows. Clean the bathrooms. Take out the trash."
    },
    {
      "title": "Ask friends and family to give you cash.",
      "content": "Ask friends and family to give you cash. A great way to get what you want for Christmas is to buy it yourself. Ask your friends and family for cash this Christmas, and then you can use it to buy whatever you want. As a bonus, you might make the cash last a little longer because you can take advantage of the after Christmas sales. [1] X Research source"
    },
    {
      "title": "Ask for bank gift cards.",
      "content": "Ask for bank gift cards. There are many gift cards that can be used anywhere for anything. These types of gift cards are great to get because they work like cash, and many of them can be replaced if lost or stolen. These gift cards are typically through the major credit card companies, and can even be used for purchases online. If you get one for Christmas, you can use it to buy the exact item you want. Make sure you read the fine print on these gift cards. Some of them have an expiration date that allows them to charge you a fee for any funds left on the card. They will make the balance on the gift card zero."
    },
    {
      "title": "Ask for gift cards to your favorite stores.",
      "content": "Ask for gift cards to your favorite stores. If you want a lot of items from one particular store, you can ask your friends and family to give you gift cards to that specific store. Store gift cards are a great way to ensure you buy the item you wanted, and you don’t spend the money on something else. Most store gift cards don’t have any expiration date or fees associated with them at all."
    }
  ]
}