{
  "url": "https://www.wikihow.com/Grow-Anthurium-Plants",
  "title": "How to Grow Anthurium Plants",
  "steps": [
    {
      "title": "Prepare a soil mix.",
      "content": "Prepare a soil mix. Anthurium prefers a coarse, well-draining soil. Try a mixture of equal parts perlite, peat moss, and pine bark. [1] X Research source Alternatively, combine three parts potting mix with one part coarse material such as orchid bark or lava rock. If the anthurium plant is at least a year old, it may prefer an even coarser material, achieved by adding a handful of crumbled aquarium charcoal, coarse river sand, or small pieces of broken brick. Anthurium plants can only grow outdoors in USDA Hardiness Zones 11 and 12, corresponding to minimum annual temperatures of 40ºF (4.4ºC) or higher. [2] X Research source In any other climate, use a flowerpot and keep them indoors. The ideal temperature range for anthurium is 60-85ºF (15-30ºC)."
    },
    {
      "title": "Plant anthurium in a pot 1/3 full of this soil mix.",
      "content": "Plant anthurium in a pot 1/3 full of this soil mix. The anthurium plant should be kept in a pot only slightly larger than itself, or its roots may rot and die. Fill a pot 1/3 of the way full with the prepared potting mix and place the anthurium on top. Fill in with additional potting mix around the sides. Typically, the roots of the plant will continue to grow above the potting material, so begin with this low level of fill to delay the need to transplant your anthurium to a larger pot. [3] X Research source If you are using a potting mix with less coarse material or worse drainage, consider one or two layers of pebbles at the base of the container to speed up water drainage."
    },
    {
      "title": "Keep in a warm or hot location, with indirect sun.",
      "content": "Keep in a warm or hot location, with indirect sun. Anthurium plants thrive in daytime temperatures between 80 and 90ºF (27–32ºC). If this is not possible, the plant will typically survive indoors at temperatures above 60ºF (15.5ºC), but warmer is better. [4] X Research source Avoid direct sun, which may burn the plant, but keep it in a bright location to encourage blooming. A south- or east-facing windowsill is a good option (north- or east-facing if you are in the Southern Hemisphere). Place the plant 5–8 feet (1.5–2.4 m) (1.5-2.5m) from a window for some gentle sunlight. If night temperatures dip below 40ºF (4.4ºC), the leaves may yellow and growth will likely slow. The plant rarely survives long if temperatures fall below freezing (32ºF / 0ºC). [5] X Research source Do not keep plants directly in front of heaters and heating vents, which may burn them."
    },
    {
      "title": "Keep the air humid.",
      "content": "Keep the air humid. Mimic the humid, tropical environment of anthurium plants by keeping the room at 80% humidity or higher. [6] X Research source Placing the pot in an aquarium or a shallow tray of pebbles in water will help achieve a high level of humidity. Mist the plant weekly, or daily if you live in a dry climate, making sure to spray portions of the stem that have grown over the lip of the pot."
    },
    {
      "title": "Keep the soil moist, but not soaked.",
      "content": "Keep the soil moist, but not soaked. Water in small amounts as necessary to prevent the soil from drying out. Even in hot weather, the soil does not need watering more than once every two or three days, as the plant does not soak up large amounts of water from its roots. If the leaves turn yellow (but not brown and withered), this may be a sign of overwatering. Let the soil dry out before watering again if this occurs. [7] X Research source"
    },
    {
      "title": "Provide a stake if the anthurium is drooping.",
      "content": "Provide a stake if the anthurium is drooping. Most anthurium plants in nature, but probably the minority sold as houseplants, are \"epiphytic,\" meaning they grow on other plants instead of in soil. If your plant is vine-like and failing to support itself, use a stake or other wooden object for the plant to climb up. You do not need to move epiphytic anthurium out of the soil; it will not cause them harm. [8] X Research source"
    },
    {
      "title": "Fertilize your anthurium plant cautiously.",
      "content": "Fertilize your anthurium plant cautiously. Newly planted anthurium should not need fertilizer for at least a few months. If you decide to apply fertilizer to encourage vivid colors and growth, use a slow release 3:1:2 fertilizer and dilute it to 1/4 the recommended strength before applying according to the instructions. [9] X Research source You can fertilize your anthurium every other time you water it, or as needed."
    },
    {
      "title": "Transfer to a larger pot whenever necessary.",
      "content": "Transfer to a larger pot whenever necessary. Anthurium plants often build up a mound of roots above the surface of the soil. About once a year, or if the soil begins to dry out rapidly between watering, pack a layer of peat or sphagnum moss over the lower 1/2 or 2/3 of the exposed stem. Keep this layer moist and wait for roots to grow out of the buried portion of the stem. Once they have extended throughout this layer, cut the stem with a clean, sharp knife at the base of the soil mixture, and transfer the buried stem into a new pot, with the buried stem below the level of the soil. [10] X Research source Remember, pot anthurium in a container only 1/3 full of soil, so the stem is below the rim of the pot."
    },
    {
      "title": "Start with seeds for an added challenge.",
      "content": "Start with seeds for an added challenge. Commercially grown anthurium are typically propagated using cuttings and grafts. It is possible to grow anthurium from seeds, but the resulting plant may have unpredictable characteristics if it was produced by a hybrid mother plant, and may be more difficult to grow. Outside of tropical areas, it may be difficult to even locate fresh anthurium seeds. If you are growing an anthurium cutting or an adult plant, skip to the start of another section."
    },
    {
      "title": "Harvest ripe anthurium fruit.",
      "content": "Harvest ripe anthurium fruit. Anthurium seeds must be fresh and moist when planted. [11] X Research source If you do not have an anthurium plant yourself, ask another gardener or garden store whether you can collect some of their plants' fruits, which are rarely used. If you live in a tropical New World region, you may be able to harvest wild anthurium plants. There are hundreds if not thousands of anthurium species, so you may wish to refer to a local plant identification booklet. Warning: The fruit, along with all other parts of the anthurium plant, are toxic and should not be eaten."
    },
    {
      "title": "Remove the pulp.",
      "content": "Remove the pulp. The pulp of the fruit, surrounding the seed, may prevent the seed from growing or cause mold. Rub off as much pulp as you can with your fingers, then drop the seed into a cup of water. Leave it in there for a day or two while the pulp material detaches and floats to the top. [12] X Research source Warning : Some species of anthurium may irritate the skin. Using gloves is recommended."
    },
    {
      "title": "Prepare a potting mix for the seeds.",
      "content": "Prepare a potting mix for the seeds. Prepare a potting mix with equal parts sphagnum peat moss, pearlite and pine bark. The soil needs of anthurium seeds are similar to the needs of adult plants."
    },
    {
      "title": "Plant the seeds and potting mix in a flowerpot or tray, with a clear covering.",
      "content": "Plant the seeds and potting mix in a flowerpot or tray, with a clear covering. Anthurium plants are native to the tropics, and require warm, humid environments. There are a couple different ways you can recreate this environment: Place the potting mix in 4 inch (10 centimeter) flowerpots. Place a seed on the surface of the soil, one per flowerpot, and place a glass canning jar upside down over each pot. [13] X Research source Or layer the bottom of a shallow, earthenware tray with your prepared potting mix. Scatter the seeds evenly over this, and cover with a flat sheet of glass or plastic over the tray, leaving a gap of air between the sheet and the soil. [14] X Research source"
    },
    {
      "title": "Lightly moisten the potting mix.",
      "content": "Lightly moisten the potting mix. Wet the potting mix slightly, then cover with the clear barrier as described above to keep the environment moist. Wetting the mossy mixture may also help prevent the seed from sinking beneath the surface, which reduces the likelihood of germination. If tap water in your area is hard, use bottled water instead."
    },
    {
      "title": "Keep in a warm environment, away from direct sunlight.",
      "content": "Keep in a warm environment, away from direct sunlight. Keep the potting mix at a temperature of about 80ºF (27ºC), in an area of indirect sun or partial shade. Keep the soil moist while you wait for the seeds to germinate, as they are very vulnerable to drying out at this stage. Within about 20–30 days, the seeds should sprout and grow their first root and leaves, after which they can be moved to a larger container and cared for, as described above. [15] X Research source Move the young plant carefully, as the roots may be fragile. Ideally, use a scoop to pick up the mossy material surrounding the plant, and drop this gently onto the new pot after preparing it as described below."
    }
  ]
}