{
  "url": "https://www.wikihow.com/Make-Warhammer-Terrain",
  "title": "How to Make Warhammer Terrain",
  "steps": [
    {
      "title": "Find some space to work.",
      "content": "Find some space to work. You will need dedicated bins for supplies, and a surface that you can cut, glue and paint on. You are very likely to create a mess, and will be working with a number of materials that can be hazardous or dangerous to leave around children or pets."
    },
    {
      "title": "Find a cardboard box, foam core, styro or plywood to create your base.",
      "content": "Find a cardboard box, foam core, styro or plywood to create your base. The board should be rigid, light and thin. [1] X Research source It should be thin enough to cut with a knife. The base must be big enough to support your entire object."
    },
    {
      "title": "Outline the desired shape for your terrain base.",
      "content": "Outline the desired shape for your terrain base. Use a pencil to make the desired shape. It is best to have an idea of the best shape and size for your terrain. If you are just building a base for a tree, a round shape will be most efficient. If you are doing a cubic building, you will probably want something that is more square. You may need to take some measurements of your terrain object before creating the base."
    },
    {
      "title": "Cut the shape out from the board.",
      "content": "Cut the shape out from the board. You can use scissors to cut out the shape on a cardboard base. If you have a thicker material like plywood, you might need to use a sharp knife to cut."
    },
    {
      "title": "Cover the edges with tape.",
      "content": "Cover the edges with tape. A painter’s tape works well to hide the rough edges, especially if you use cardboard as your material. Do not use a tape with a glossy, non-stick surface. You want the paint to be able to stick."
    },
    {
      "title": "Paint the base using an enamel paint.",
      "content": "Paint the base using an enamel paint. You can choose a green color for natural grass look or gray for a rock or concrete type of texture. Choose something appropriate to your piece and then apply it over the entire surface. Do not use a water-based paint or glue on terrain bases. These paints shrink when drying and can warp the surface of the base."
    },
    {
      "title": "Allow paint to dry and set aside.",
      "content": "Allow paint to dry and set aside."
    },
    {
      "title": "Use foam board to design the walls of buildings.",
      "content": "Use foam board to design the walls of buildings. A 3/16\" or 1/4\" thick foam board will make great walls, floors, and even the bases on which to craft the rest of your terrain. Foam board will make it easier to cut out windows and doorway shapes with precision. It is easier to make any modifications to your design before assembling the building. Be sure you are satisfied with your design before proceeding."
    },
    {
      "title": "Cut it to your desired size.",
      "content": "Cut it to your desired size."
    },
    {
      "title": "Draw your design on the foam board before cutting.",
      "content": "Draw your design on the foam board before cutting. Use a pencil to outline the doorways and windows. Design the walls. You can just make the foam board wall pieces the same size if you want an intact structure, or you can design walls that are partially destroyed from being in a war zone. If you are new to crafting Warhammer terrain, designing ruins is a good way to start. Even if you mess it up you can work around it since the building is supposed to be destroyed anyway."
    },
    {
      "title": "Use a pliers to trace the outline of your design.",
      "content": "Use a pliers to trace the outline of your design."
    },
    {
      "title": "Fit the walls together at the corner.",
      "content": "Fit the walls together at the corner. You can trim away the foam at the edge of one wall, then fit the other wall into the corner. This will conceal the gap between the foam board pieces and make it look more realistic. Be sure to get the pieces lined up exactly how you want them. Then, add some glue then fit the two walls together. Hot glue will dry the fastest and allow you to keep working. Be sure to let the glue dry completely before painting so you don't ruin your brushes by getting glue in them."
    },
    {
      "title": "Create details with recycled objects.",
      "content": "Create details with recycled objects. Use straws to create realistic looking pipes coming out of the rubble of your building. Break down some styrofoam packaging to create debris, bricks, rubble, impact craters, or rocks. Start with a simple object or design, and use these creative details to build a more elaborate scenery."
    },
    {
      "title": "Save all your small pieces of foam.",
      "content": "Save all your small pieces of foam. You can use small pieces to shape in random bricks and rubble to add more detail to your terrain. Using the same materials you can shape foam board in a raised circle and attach it to a base to create a blast crater."
    },
    {
      "title": "Set aside and prepare for painting.",
      "content": "Set aside and prepare for painting. Visit model train shops. Many terrain objects, such as trees, can be found ready-made at a hobby shop. While many train modeling pieces will add a great touch to your Warhammer terrain, just be sure to select pieces that are durable enough for gaming purposes. Check out garage sales. They offer a cheap way to find lots of materials that can be incorporated into your Warhammer terrain. Take an old action figure, mount it on a tin cup, give it a little gray paint, and you have the beginning of a statue. The possibilities of what you can create are limited only by your imagination."
    },
    {
      "title": "Paint it with black as the base paint.",
      "content": "Paint it with black as the base paint."
    },
    {
      "title": "Allow to dry.",
      "content": "Allow to dry."
    },
    {
      "title": "Mix paint of gray and apply on the surface.",
      "content": "Mix paint of gray and apply on the surface."
    },
    {
      "title": "Glue the walls to the base.",
      "content": "Glue the walls to the base."
    },
    {
      "title": "Apply a coat of latex paint with sand to create textures.",
      "content": "Apply a coat of latex paint with sand to create textures. If you desire a more realistic appearance to concrete or rock structures, coat the entire surface with this paint mixture. Use a large brush to apply the paint with vertical strokes for best results. You will do this step before priming because you are just trying to create a layer of texture over the surface of your buildings. The color will not matter. You can buy paint that is already mixed with sand at craft and hobby stores. You can also make some on your own. Just add a small pinch of sand to start with. More sand can be added depending on your desired appearance."
    },
    {
      "title": "Seal with a primer.",
      "content": "Seal with a primer. Cover the entire surface with a liberal coat. This will provide a good surface for your paint to be applied. Use a black primer to provide a base for darker surfaces like rocks and buildings. Use a white primer for light-colored surfaces."
    },
    {
      "title": "Create visual details by dry-brushing different shades.",
      "content": "Create visual details by dry-brushing different shades. Dry-brush is applying paint to a piece with a brush that has dried but still holds paint. [2] X Research source Dry-brush various shades of gray and white to add an impression of weathering to objects buildings. Shades of brown can be useful to create mud or dirt. It might take many layers to look exactly like you want. A skilled piece can take up to 30 hours to paint. [3] X Research source The key is to take your time and enjoy the experience."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}