{
  "url": "https://www.wikihow.com/Insert-a-Nasal-Cannula",
  "title": "How to Insert a Nasal Cannula",
  "steps": [
    {
      "title": "Make sure you have the right size cannula.",
      "content": "Make sure you have the right size cannula. Most brands of cannulae come in infant, pediatric, and adult sizes, so select the one that best fits you for your size. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The cannula should fit snugly in your nostril so that it doesn't come out, but it shouldn't be so long that it goes far back into the nostril. Some brands may have extended sizes, such as small, medium, and large for adults, and premature through pediatric for children, giving you more options. In this case, choose the one that feels the most comfortable when placed in your nostrils. If the cannula is rubbing uncomfortably against your nostrils, it may be too large. If it's pinching, it may not be the correct size."
    },
    {
      "title": "Attach the end connector to the oxygen source.",
      "content": "Attach the end connector to the oxygen source. At one end of the nasal cannula tube, you’ll see a connector that hooks onto your oxygen tank or converter. Slip the connector over the end of the oxygen line coming from your tank to connect the nasal cannula. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure the connector is seated tightly onto the oxygen line so none of the gas can escape. Place the connection against your arm to feel for any leaking oxygen. You may also be able to smell escaped oxygen."
    },
    {
      "title": "Adjust the amount of oxygen that flows through the tubes.",
      "content": "Adjust the amount of oxygen that flows through the tubes. Your healthcare provider will prescribe a flow rate for you. Turn the knob on the machine so that the dial is set to this exact number every time, and do not change it unless your doctor tells you to. [3] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source Changing the flow rate could result in you getting more or less oxygen than you need, which could lead to health complications. Try using a pulse oximeter to monitor your oxygen. If it's always at 100%, turn your oxygen down a little."
    },
    {
      "title": "Turn the cannula so the prongs are curved downward.",
      "content": "Turn the cannula so the prongs are curved downward. Most cannulae today have curved prongs so they fit more naturally inside the nostrils. Hold the cannula so the prongs are pointing up toward the ceiling and curve down toward you. [4] X Research source If the cannula does not have curved prongs, just hold it so the prongs are pointed upward and angled toward your body."
    },
    {
      "title": "Insert the prongs into your nostrils.",
      "content": "Insert the prongs into your nostrils. Place the cannula in as far as it will go. If the cannula is properly connected, you will feel a gentle flow of air. If it's the proper size, the prongs should sit comfortably in your nostrils. [5] X Research source"
    },
    {
      "title": "Lift the tubes and fit them over or under your ears.",
      "content": "Lift the tubes and fit them over or under your ears. Make sure the tubes that connect the nasal prongs to the oxygen delivery system are fitted snugly over or under your ears and tape them in place. This will help hold the cannula in place, even if you’re moving around or sleeping. [6] X Research source If having the tubes looped behind your ears is uncomfortable, you may prefer to rest the headset behind your head. Instead of looping the tubes over your ears and under your chin, turn the cannula so the tubes go from your nostrils down toward the back of your neck, with the slider resting at the base of your neck."
    },
    {
      "title": "Move the slider up the tubes to adjust the fit.",
      "content": "Move the slider up the tubes to adjust the fit. The slider is the small piece on the tubes which you can move up and down to tighten or loosen the headset. Push the slider up until it is just under your chin. [7] X Research source The headset should be snug, but you still should be able to fit two fingers between the tubes and your chin. If the cannula causes indents in your skin, it is too tight."
    },
    {
      "title": "Place gauze beneath the tubing or prongs to prevent chafing.",
      "content": "Place gauze beneath the tubing or prongs to prevent chafing. Friction from the cannula can cause skin irritation in your nose or behind your ears, especially if you have to wear your nasal cannula for long periods of time. Placing or gently taping gauze on your skin where the cannula rubs can help minimize friction and keep the tubes in place. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can purchase gauze and first aid tape at any drug store. If your tubes cause frequent irritation, try using a softer, thinner tubing."
    },
    {
      "title": "Adjust the tubes so they rest higher on your cheeks to ease irritation.",
      "content": "Adjust the tubes so they rest higher on your cheeks to ease irritation. Wearing the tubes higher on your cheekbones will decrease the friction against your skin as you move. To do this, keep the tubes tightened so the slack doesn’t drag them down. [9] X Research source Move the slider higher up the tubes to help keep the slack out of the line."
    },
    {
      "title": "Use a saline spray if your nostrils become dry.",
      "content": "Use a saline spray if your nostrils become dry. The constant flow of air may sometimes dry out your nasal passages. If this happens, use a simple saline spray to add moisture back. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can use these products as needed. If you're having a lot of problems with dryness, you can set up a humidifier to add moisture into the air around you. In some cases, you can even attach a humidifier directly to your oxygen."
    },
    {
      "title": "Wash the cannula every day, and replace it every 2 weeks.",
      "content": "Wash the cannula every day, and replace it every 2 weeks. Nasal cannulas are designed to be disposable and should be replaced every 2 weeks. Wash your nasal cannula every day with unscented liquid soap and warm water to prevent the growth of bacteria and ensure that you are always using functional, high-quality tubing. [11] X Research source"
    },
    {
      "title": "Place the cannula in a glass of water to tell if the oxygen is flowing.",
      "content": "Place the cannula in a glass of water to tell if the oxygen is flowing. If you can’t feel any air coming out of the nasal prongs, submerge them in a glass of water. If the nasal cannula is working properly, you should see bubbles coming up through the water. [12] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source If you don't, check to make sure the oxygen is turned on and the tubing is not bent or blocked. If it still doesn’t work, contact your medical provider. If you are struggling with your cannula, try a pulse oximeter check to make sure you are not low on oxygen. If you are, go to the emergency room."
    }
  ]
}