{
  "url": "https://www.wikihow.com/Linux-How-to-Mount-Drive",
  "title": "How to Mount Drives on Linux: Command Line & GUI",
  "steps": [
    {
      "title": "Open a Terminal window.",
      "content": "Open a Terminal window . If you want to mount an internal or external drive in Linux, you can do so easily from the command line. You can open a terminal on most Linux distributions by pressing Ctrl + Alt + T ."
    },
    {
      "title": "Run the lsblk -lf command to find the path to the drive.",
      "content": "Run the lsblk -lf command to find the path to the drive. When you run this command, you'll see an entry for each drive that's connected to your system—including any internal drives. Make note of the new drive's \"NAME\" column value (e.g., sdc or sdc1 ) and the file system type (e.g., ext4 , vfat ). If the drive is already mounted, you will see a path under \"MOUNTPOINTS.\" You can use cd to enter that directory to access the files on the drive."
    },
    {
      "title": "Create a new directory for the mount point.",
      "content": "Create a new directory for the mount point. For example, use sudo mkdir /media/myflashdrive to create a directory called myflashdrive in /media."
    },
    {
      "title": "Use mount to mount the drive to the new directory.",
      "content": "Use mount to mount the drive to the new directory. The syntax is mount /dev/drivename <new mount point> . For example, if the drive is /dev/sdc1 and you want to mount the drive at /media/myflashdrive, use sudo mount /dev/sdc1 /media/myflashdrive ."
    },
    {
      "title": "Mount the drive permanently (optional).",
      "content": "Mount the drive permanently (optional). If you don't want to have to mount the drive every time you sign into Linux, you can add an entry for it to /etc/fstab so it mounts automatically. This will be helpful if you've installed a new internal drive. [1] X Research source Don't do this for removable drives—if the drive isn't connected at boot time, your system will not boot at all. Open /etc/fstab in a text editor like Vim or Nano. Add a line to the file using this syntax: /dev/sdc1 /media/myflashdrive ext4 defaults 0 0 Replace \"ext4\" with the file system type you found with lsblk -lf earlier. Save and exit the file ."
    },
    {
      "title": "Unmount a drive with umount.",
      "content": "Unmount a drive with umount . To unmount the drive, just run the command sudo umount /media/myflashdrive ."
    },
    {
      "title": "Open the Disks utility in Ubuntu.",
      "content": "Open the Disks utility in Ubuntu. If you're running Ubuntu and want to use a graphical option to mount a drive, the Disks utility makes it easy. Just go to the Activities overview, type disks , and click Disks in the search results. [2] X Research source"
    },
    {
      "title": "Select the new drive in the left panel.",
      "content": "Select the new drive in the left panel. Details about the drive will appear."
    },
    {
      "title": "Click the Play button to mount the drive.",
      "content": "Click the Play button to mount the drive. If the drive is not mounted, you'll see a Play button (a sideways triangle). Clicking it will mount the drive. If the drive is already mounted, you'll see a Stop button (a square)."
    },
    {
      "title": "Click the gear icon and select Edit Mount Options….",
      "content": "Click the gear icon and select Edit Mount Options… . This displays a window with several customization options."
    },
    {
      "title": "Choose your mounting preferences.",
      "content": "Choose your mounting preferences. If you want this drive to mount automatically each time Ubuntu boots up, check the box next to \"Mount at system startup.\" Keep in mind that you shouldn’t do this for a flash drive or SD card, as your system may not boot if the drive is not connected. If you want to be able to access this drive in your file manager and other GUI apps, check the box next to \"Show in user interface.\" To change the mount point to something that's easier to remember and type, you can edit the mount point. Just make sure you're entering a directory that already exists (e.g., if you want to mount the drive at /mnt/media/mydrive, you will need to sudo mkdir /mnt/media/mydrive before entering that path. Click OK when you're finished."
    },
    {
      "title": "To unmount a drive, select it, then click the Stop button.",
      "content": "To unmount a drive, select it, then click the Stop button. It's the square to the left of the gear button. This unmounts the drive."
    }
  ]
}