{
  "url": "https://www.wikihow.com/Light-a-Joint",
  "title": "How to Light and Smoke a Joint the Right Way",
  "steps": [
    {
      "title": "Hold the joint at a 45-degree angle over the flame.",
      "content": "Hold the joint at a 45-degree angle over the flame. Hold the joint or pre-roll between your thumb and index finger and bring the flame of your lighter to the tip. If your joint has a long twisted paper tip, burn that off first. [1] X Research source An uneven burn can cause the joint to “canoe,” or burn on one side faster than the other. This can waste the flower, affect the joint’s taste, and affect the potency of your hit."
    },
    {
      "title": "Slowly rotate the joint over the flame until the end glows red.",
      "content": "Slowly rotate the joint over the flame until the end glows red. Slowly roll the joint back and forth between your fingers so all the sides of the tip burn evenly. When the end of the joint is lit and glowing red, it’s ready to use. [2] X Research source If the end of your joint isn’t even all the way around, use your flame to even it out. [3] X Research source You can also gently blow on the unlit side. The red, lit end of a joint is often called a “cherry.” [4] X Research source"
    },
    {
      "title": "Take small short puffs to make sure the joint stays lit.",
      "content": "Take small short puffs to make sure the joint stays lit. After the tip of the joint glows red, take a couple of short inhales to make sure the entire end of the joint is evenly lit. [5] X Research source Hitting or inhaling the joint too fast can sometimes force one side to burn faster than the other. [6] X Research source Let the joint rest in between hits so your next puff doesn’t pull the flame faster down one side. [7] X Research source To limit lung irritation, try not to hold the smoke in for longer than a second or two. Holding it in longer doesn’t give you more of an effect, it just harms your lungs. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "The best way to light a joint is with a small lighter or hemp wick.",
      "content": "The best way to light a joint is with a small lighter or hemp wick. One of the safest and most environmentally friendly ways to light a joint is to use a hemp wick coated in beeswax. [9] X Research source Some cannabis users also recommend using a small butane lighter because bigger lighters can cause uneven burning and matches that can leave residue on your joint. If you do use a match, wait a second after you light it so the sulfur can burn off before using it to light your joint."
    },
    {
      "title": "Trying to inhale while you light the joint.",
      "content": "Trying to inhale while you light the joint. Some people light the joint in their mouth and inhale immediately after, like you would a cigarette. [10] X Research source However, this might cause canoeing because you can’t make sure the end is burned evenly before you inhale. Instead, try to light the joint placed between your thumb and index finger so you can see the end as you light it."
    },
    {
      "title": "Lighting a joint that’s too tightly or loosely packed.",
      "content": "Lighting a joint that’s too tightly or loosely packed. If your joint keeps burning too fast or unevenly, your joint might have been rolled too loosely. If the end keeps going out, your joint might be rolled too tightly. When you roll a joint, work the weed into a cylinder shape so that there’s some airflow, but not enough to cause uneven burning. [11] X Research source"
    },
    {
      "title": "Choose a thin rolling paper for a slower burn.",
      "content": "Choose a thin rolling paper for a slower burn. A thinner paper creates a more even burn as you smoke and allows you to taste the flower better. [12] X Research source There are tons of different materials, but many people prefer hemp papers because they’re thin and burn evenly without affecting the taste of the weed. [13] X Research source If you’re a beginner, start by using thick papers until you’re confident in your joint-rolling abilities. [14] X Research source Stick to unbleached, unflavored, and unrefined papers to reduce exposure to chemicals and further damage to your lungs. [15] X Research source"
    },
    {
      "title": "Grind the weed evenly to prevent uneven burning.",
      "content": "Grind the weed evenly to prevent uneven burning. The best way to get an even grind is to use a three-chamber grinder made out of metal. As you grind, pick out any stems that might puncture the paper or make your burn uneven. [16] X Research source If you don’t have a grinder, roll the buds between your fingers or chop them up with scissors and pick out any stems, seeds, and seed shells. [17] X Research source If you’re using a 1-chamber grinder, try to avoid over-grinding your weed—this might cause a harsher smoking experience."
    },
    {
      "title": "Pack the joint with a pen to create a tight seal.",
      "content": "Pack the joint with a pen to create a tight seal. When you finish sealing the joint, insert a thin long object like a pen, toothpick, or chopstick into the open end of the joint. Push the weed down towards the filter to make sure there are no gaps or air pockets. That way, the join burns evenly as you smoke. [18] X Research source When you twist the paper left over at the end of the joint to close it, go as far as you can to push the weed down the joint without ripping the paper. [19] X Research source If your joint keeps canoeing, you may need to roll the joint more tightly. [20] X Research source"
    },
    {
      "title": "Tap the end of the joint against the side of the ashtray.",
      "content": "Tap the end of the joint against the side of the ashtray. Ashing a joint is similar to ashing a cigarette, except that fragile joints might require you to be more careful. Gently knock or graze the end of the joint against the side of the ashtray so that the ash hanging onto the tip falls off. [21] X Research source This way, you can light up the joint and smoke it again later. Alternatively, flick the joint with your thumb or blow gently on the end so that the ash falls off into your non-flammable tray."
    },
    {
      "title": "Gently press the joint’s end against the bottom of the ashtray.",
      "content": "Gently press the joint’s end against the bottom of the ashtray. Push the lit end of the joint against the side or bottom of your ashtray. Try to avoid pushing the joint into the ashtray like a cigarette—this can crush anything left over in your joint, making it unusable. [22] X Research source If you don’t have an ashtray, use a non-flammable surface, like concrete. If you have a pre-roll or joint storage tube, simply place the joint inside lit-end-down and seal the lid to snuff out the flame."
    }
  ]
}