{
  "url": "https://www.wikihow.com/Make-Stairs-in-Minecraft",
  "title": "How to Make Stairs in Minecraft",
  "steps": [
    {
      "title": "Decide on a material for your stairs.",
      "content": "Decide on a material for your stairs. In addition to being able to use any type of wood in the Minecraft world to make a set of stairs, you can also use certain types of stone: [1] X Research source Bricks (made from clay) Quartz Cobblestone Sandstone (mined or made from sand) Nether brick"
    },
    {
      "title": "Collect at least six blocks of your chosen material.",
      "content": "Collect at least six blocks of your chosen material. You'll need six blocks of the same material to create a set of four stair blocks. In order to do so: [2] X Research source Stone - Mine any kind of stone (cobblestone, sandstone, mossy stone, stone bricks, etc.) with at least a wooden pickaxe. Wood - Mine any kind of wood (jungle, birch, oak, etc.) with any tool. Use an axe for the quickest production."
    },
    {
      "title": "Open your crafting table.",
      "content": "Open your crafting table. To do this, right-click the crafting table (computer edition) or press your console controller's left trigger while facing the table. If you don't have a crafting table, you can press E (or X for consoles) and use four wood planks to create a crafting table."
    },
    {
      "title": "Place your material in the crafting table.",
      "content": "Place your material in the crafting table. To create stairs, you'll need to place three blocks in the first column of the crafting table, two in the second column, and one in the third. You'll need to place your blocks starting on the bottom row of the crafting table. If you're using the Xbox version of Minecraft, simply scroll over to the stairs icon and then scroll up or down to select your preferred material."
    },
    {
      "title": "Click the stairs icon.",
      "content": "Click the stairs icon. It's to the right of the crafting table interface. Doing so will both create a set of four stairs blocks and add them to your inventory. On Xbox, just press A . If your quick-access bar at the bottom of the screen has an opening, the stairs will be added to it."
    },
    {
      "title": "Open the Creative menu.",
      "content": "Open the Creative menu. Do so by pressing E (PC) or X (Xbox)."
    },
    {
      "title": "Scroll down to the stairs section.",
      "content": "Scroll down to the stairs section. You'll find every type of stair available for creation in Minecraft about two-thirds of the way down the page. These stairs include the following: Oak, birch, spruce, jungle, acacia, and dark wood stairs Cobblestone stairs Brick stairs Stone brick stairs Sandstone stairs Red sandstone stairs Quartz stairs Purpur stairs"
    },
    {
      "title": "Click and drag your preferred stair onto the quick-access bar.",
      "content": "Click and drag your preferred stair onto the quick-access bar. This bar is at the bottom of the screen; dropping the stairs onto this bar will make them equippable. On Xbox, just selected your preferred stairs, tap A , and tap A again."
    },
    {
      "title": "Equip your stairs blocks.",
      "content": "Equip your stairs blocks. To do so, click on the stairs in your quick-access bar. They will appear in your hand on-screen. If your stairs aren't yet in your quick-access bar, tap E (or press Y for an Xbox controller) and move the stairs from your inventory to your quick-access bar. On Xbox, tap RB to cycle through your quick access menu until your stairs are selected."
    },
    {
      "title": "Face the block upon which you wish to place stairs.",
      "content": "Face the block upon which you wish to place stairs. Your cursor in the middle of the screen should be directly in the middle of the block."
    },
    {
      "title": "Right-click the space on the ground.",
      "content": "Right-click the space on the ground. Doing so will place your stairs. The steps will be facing you. On an Xbox, you'll press the left trigger instead."
    }
  ]
}