{
  "url": "https://www.wikihow.com/Install-Floor-Tile",
  "title": "How to Install Floor Tile",
  "steps": [
    {
      "title": "Install cement board first if you're dealing with just a subfloor.",
      "content": "Install cement board first if you're dealing with just a subfloor. [1] X Research source While it's possible to lay tile directly on plywood subfloor, it's certainly not recommended. Plywood subfloor won't bond as surely with thinset as cement board will; neither will it provide as even and stable of a surface for the tile. Cement board will probably be a bit more expensive and will add time to your project, but the investment is totally worth it. Tile done right requires a solid substrate."
    },
    {
      "title": "The cement in mortar and grout is a serious chemical and you need proper safety gear.",
      "content": "The cement in mortar and grout is a serious chemical and you need proper safety gear. Cement can cause first degree burns, eye injury from dust or wet cement getting into your eyes and also can sometimes cause lifelong chromium sensitization, so be safe EVERY time and wear alkali-resistant waterproof gloves, long sleeves and long pants (unlike the pictures in this article, which don't follow proper safety guidelines!) and waterproof or thick shoes. Wear goggles with side protectors and a ventilator at LEAST when pouring mortar to mix it, preferably throughout the project - remember, if mortar gets into your eyes, even once, you'll have to flush with water for 20 minutes and may need a trip to the hospital. Don't wash mortar off with normal soap (special pH neutral soap can be used). Make sure there's nowhere mortar can get inside and get trapped against your skin. Rinse any mortar that touches your skin off right away, and keep vinegar on hand to neutralize. [2] X Research source"
    },
    {
      "title": "Lay down some latex-modified thinset mortar onto the subfloor.",
      "content": "Lay down some latex-modified thinset mortar onto the subfloor. If you're mixing mortar from scratch, add enough water to the dry mortar so that the final consistency resembles toothpaste or peanut butter. [3] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. Then, let the mortar slake, or rest, for 10 minutes. [4] X Research source Use a trowel with notches about the same size as the cement board thickness to lay down the mortar. Lay only enough mortar that you can safely cover in about 10 minutes. This is the time it will take the mortar to start hardening."
    },
    {
      "title": "Press down the cement board onto the subfloor and attach with cement board screws.",
      "content": "Press down the cement board onto the subfloor and attach with cement board screws. Starting in one corner, press the cement board down to the subfloor using your own weight. Drill the cement board screws into the board to fasten the board to the subfloor. Screw about every 8 inches (20.3 cm) around the edge of the board and every 10–12 inches (25.4–30.5 cm) in the center of the board."
    },
    {
      "title": "Continue laying mortar and cement board onto the subfloor, staggering the end joints so that they don't line up.",
      "content": "Continue laying mortar and cement board onto the subfloor, staggering the end joints so that they don't line up. For added strength, make sure that the end joints don't form one continuous line. This means that you might need to lay one line of cement board starting on one side of the room, and then start the next line on the opposite side of the room."
    },
    {
      "title": "Cut the cement board with a jigsaw or a carbide-tipped scoring tool.",
      "content": "Cut the cement board with a jigsaw or a carbide-tipped scoring tool. If you need to cut non-linear shapes out of your cement board, use a jigsaw and a carbide-tipped blade. If, however, you're only cutting straight lines out of the cement board, use a carbide-tipped scoring tool (it costs $10) and a straight edge. [5] X Research source"
    },
    {
      "title": "Finish up by mudding and taping the joints of the cement board.",
      "content": "Finish up by mudding and taping the joints of the cement board. This process is almost exactly like mudding and taping drywall , except you're using mortar instead of compound and fiberglass mesh tape instead of joint tape. Lay down a bit of mortar with your trowel, then press the fiberglass mesh tape into the joint. Then go over the mesh tape with your trowel, pressing it into the seams and locking it firmly in the mortar. Smooth out the resulting joints so that they don't bulge out, feathering the edges."
    },
    {
      "title": "If you need to, clean the existing floor thoroughly with a non-toxic floor cleaner.",
      "content": "If you need to, clean the existing floor thoroughly with a non-toxic floor cleaner. You'll want to remove all glue, dirt and existing mortar before you start laying your new tile floor. The floor should be completely clean in order for maximum bonding between the tile and the thinset. TSP, or trisodium phosphate, is a great all-purpose cleaner if you need to use it. It cleans extremely effectively, but is no longer as widely used today as it was before because of environmental concerns."
    },
    {
      "title": "Decide where you want to start your tile.",
      "content": "Decide where you want to start your tile. Most people decide to lay tile from the center of the room outward, which is important if you're dealing with even-sized tiles. This method will create a nice effect in the center of the room, but tiles in the edges of the room will need to be cut. You may decide to start tiling from another spot in the room, especially if you're using irregular-sized tiles. You may choose to have uncut tiles on the sides of the room and work from there if cabinets, sofas, or other furniture is covering tiles on one side of the room. This article will assume that you want to start from the center of the room and work outward. Make sure you do a dry layout with your tile and spacers directly on the cement board before you lay down the mortar. A dry layout will allow you to visualize the room as it might be when everything is finished. Experiment with different layouts until the right one catches your eye. [6] X Research source"
    },
    {
      "title": "Find the center of the room by snapping a chalk line in the center of the room widthwise and lengthwise.",
      "content": "Find the center of the room by snapping a chalk line in the center of the room widthwise and lengthwise. Set up your chalk string in the center of each wall by measuring the wall and putting the string exactly in the middle. Leave the string in place after you snap it to use as a guide for your first few tiles. Lay down some floor tiles along one of the center lines to make sure you marked the center of the room properly. If you realize that your chalk lines aren't square, redo them now."
    },
    {
      "title": "Line up your boxes of tile and open each one.",
      "content": "Line up your boxes of tile and open each one. When you're laying the tile, alternate which box you're pulling from to account for any variation in color among the boxes. If you're making a design or pattern with the tile, put the tiles in order so you know which ones you need at any specific time. If you end with a very small or very large space in comparison with the size of the tile you're using, move everything down so the extra space is about the width of a half a piece of tile and snap new chalk lines to use when placing the tiles. You don't want to have to cut your tile into small pieces to finish a row along the wall."
    },
    {
      "title": "Lay down tile cement or thinset mortar where your first section of tile will be.",
      "content": "Lay down tile cement or thinset mortar where your first section of tile will be. Use the flat side of the trowel to key in the thinset, and then comb with the notched side of the trowel with even horizontal lines. The goal is to have a nice even application of cement or mortar for the tile to hold onto, and even horizontal lines grip the tile better than random curved lines. Only lay down as much mortar as you can work with in 10 minutes; otherwise it will begin to harden and become difficult to work with. [7] X Research source If you're using tile cement, give it about 15 minutes to become tacky so the tile will stick properly. Use tile cement with linoleum and vinyl tiles, and thinset mortar with ceramic or porcelain tiles."
    },
    {
      "title": "Start laying the floor tiles in the middle of the room, lining them up with your chalk lines.",
      "content": "Start laying the floor tiles in the middle of the room, lining them up with your chalk lines. Press each tile gently into the cement or mortar; you can also use a rubber mallet to do this after you complete each section."
    },
    {
      "title": "Put a grout spacer at each corner of your tiles.",
      "content": "Put a grout spacer at each corner of your tiles. Butt each new tile up to these, taking care not to slide the tiles through the adhesive material. Wipe up the thinset that squishes up between the tiles."
    },
    {
      "title": "Continue laying all but the tiles on the outer edges of your room.",
      "content": "Continue laying all but the tiles on the outer edges of your room. Then, measure the space between the last tile and the wall and mark the tiles you need to cut. Use a wet saw to make these cuts and install the cut tiles like you installed the others. If you lay all the tile in the middle of the room first and then mark and cut your tile afterward, you only need to rent the wet saw for one day, saving you tile and money. As you lay down smaller pieces of tile in the corners of rooms, back-butter the individual tiles instead of messily trying to get mortar into the small nooks and crannies of your room."
    },
    {
      "title": "Allow the tile adhesive to dry overnight, then remove the grout spacers, if necessary.",
      "content": "Allow the tile adhesive to dry overnight, then remove the grout spacers, if necessary. [8] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. Some can be left in place so check with the manufacturer to be sure."
    },
    {
      "title": "Mix your grout according to the directions on the package; usually grout is mixed with water in a 5 gallon (18.9 L) bucket.",
      "content": "Mix your grout according to the directions on the package; usually grout is mixed with water in a 5 gallon (18.9 L) bucket. It should have a peanut butter-like consistency. Like the thinset mortar, it should slake for 10 minutes and then briefly be mixed again before application."
    },
    {
      "title": "Use a masonry float to spread the grout into the spaces between the tiles, creating a smooth surface.",
      "content": "Use a masonry float to spread the grout into the spaces between the tiles, creating a smooth surface. Float your grout in several different directions to make sure you're working the grout into the grout lines effectively and evenly. Work quickly here. The grout sets up fast — considerably faster than the mortar does. For this reason work only in small areas before branching out."
    },
    {
      "title": "Remove the excess grout you get on the tiles with a sponge.",
      "content": "Remove the excess grout you get on the tiles with a sponge. Again, give yourself a small area to work on so that the grout doesn't set up before you have time to wipe it off the tiles. You can also use a damp cloth after this time to rub away any haze left over on the tile. Let the grout set for at least a few hours. [9] X Research source"
    },
    {
      "title": "Seal the grout",
      "content": "Seal the grout after it has set for 72 hours. [10] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. Use a grout sealer with an applicator brush and take care not to get any on the tile itself."
    }
  ]
}