{
  "url": "https://www.wikihow.com/Lose-Weight-Without-Exercising",
  "title": "How to Lose Weight Without Exercising",
  "steps": [
    {
      "title": "Count calories.",
      "content": "Count calories. Weight loss programs usually require you to modify your total calorie intake. Counting calories and being aware of how much you eat can help you lose weight. In general, you'll want to cut out about 500–750 calories daily to lose about one to two pounds weekly. [2] X Research source Figure out how many calories you can cut from your daily diet by first calculating the number of calories you should take in each day. Do this by searching online for a calorie calculator, then inputting your weight, height, age and activity level in order to calculate your recommended caloric intake . Each person is different, so it's best to get your own, personalized number. Do not consume less than 1200 calories daily. A diet that's too low in calories puts you at risk for nutrient deficiencies as you cannot eat enough food to meet your daily requirements for most vitamins, minerals, and protein. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Be aware that your weight is a balancing act.",
      "content": "Be aware that your weight is a balancing act. Calorie intake is only a part of the equation. Fad diets may promise you that counting carbs (carbohydrates) or eating a mountain of grapefruit will make the pounds drop off; but when it comes to weight loss, it's calories that count. Weight loss comes down to burning more calories than you take in. You can do that by reducing extra calories from food and beverages, and increasing calories burned through physical activity. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Write yourself a meal plan.",
      "content": "Write yourself a meal plan. If you are not exercising to burn calories, you must trim them from your diet in order to lose weight. Writing out a meal plan can help you plot out all your meals and snacks and make sure they fit into your pre-determined calorie range. In addition, be sure to use strategies to help yourself feel more full. Spend some time writing out all your meals, snacks, and beverages for a few days or a week. Allot a certain caloric amount for each meal. For example: 300-calorie breakfast, two 500-calorie bigger meals, and one to two 100-calorie snacks. This may help you choose what foods to eat for meals and snacks throughout the day. Include foods from all five food groups most days. Review your meal plan to make sure you're getting adequate amounts of fruits, vegetables, whole grains, lean protein, and dairy. Having all your meals and snacks planned in advance may keep you from making poor nutrition choices when you're in a rush. Keep snacks conveniently located and ready in your fridge, car, backpack or purse."
    },
    {
      "title": "Eat a balanced diet.",
      "content": "Eat a balanced diet. A diet that is calorie controlled and includes all five food groups is a good foundation for healthy weight loss. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should include all of the following most days: Fruits and vegetables. These foods are dense, filling, low-calorie and low-fat. Not only are fruits and veggies great for your waistline; they have copious amounts of vitamins, minerals, fiber, and antioxidants that you need for long-term health. Aim to make 1/2 of your meals fruits and/or vegetables. Lean protein. Foods like poultry, eggs, pork, lean beef, legumes, dairy products, and tofu are great sources of lean protein. Protein will help keep you satisfied longer and may curb hunger cravings. [6] X Research source Aim to include 3-4 oz of protein at each meal — this is about the size of a deck of cards. 100% whole grains. Foods that are whole grains are high in fiber and some vitamins and minerals. [7] X Research source Quinoa, oats, brown rice, millet, and 100% whole wheat pasta and bread are examples of whole grains to include in your diet. Limit your grains to about 1/2 cup or 1 oz per meal."
    },
    {
      "title": "Snack healthy.",
      "content": "Snack healthy. Including one to two low-calorie snacks is appropriate when you're trying to lose weight. Many times a snack will help support your weight loss. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Snacking may be appropriate when there is more than five or six hours between your meals. Sometimes, going for long periods of time without eating may make it harder for you to stick to your planned meal or portion sizes as you may be overly hungry. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Most snacks included in a weight loss plan should be calorie controlled. Aim to keep snacks between 100 and 200 calories. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Healthy snacks include: 1/4 cup of nuts, one individual Greek yogurt, a hard boiled egg or celery and peanut butter."
    },
    {
      "title": "Choose healthier cooking techniques.",
      "content": "Choose healthier cooking techniques. Don't sabotage your good intentions with poor preparation methods. Cooking methods that use a lot of oil, butter, or other high-fat sauces or seasonings may cause your weight loss to plateau or slow. Try cooking methods that use little to no added fat. Try: steaming, grilling, braising, roasting and poaching/boiling. Switch to extra virgin olive oil or canola oil. When substituted for saturated fats (like butter), these healthy monounsaturated fats can help to improve blood cholesterol levels, thereby reducing risk for heart disease and obesity. Avoid cooking techniques such as deep fat frying or pan frying. Also avoid cooking methods that use a lot of butter, oil, or margarine."
    },
    {
      "title": "Drink adequate amounts of fluids.",
      "content": "Drink adequate amounts of fluids. Staying well-hydrated is also essential to weight loss. Many times, thirst can feel similar to hunger and trigger you to eat. Drinking enough fluid can help prevent this mistake and promote weight loss. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Aim for about 64 oz or about eight glasses of clear, sugar-free liquids each day. This is a general recommendation, but is a good place to start. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Fluids that will count toward your daily goal include: water, sugar-free flavored waters, plain tea, and coffee without cream or sugar."
    },
    {
      "title": "Ditch alcohol and sugary beverages.",
      "content": "Ditch alcohol and sugary beverages. Both alcoholic beverages and sugary beverages contain large amounts of calories that may work against your weight loss plan. Ideally, completely pass these up as long as you desire continued weight loss. [13] X Research source Sugary beverages to avoid include: regular soda, sweetened tea, sweetened coffee drinks, sports drinks and juices. At the maximum, women should consume one glass or less of alcohol daily and men should consume two or less daily. Again, if continued weight loss is desired, alcohol should be avoided. [14] X Research source"
    },
    {
      "title": "Weigh yourself once or twice a week.",
      "content": "Weigh yourself once or twice a week. Monitoring your progress is important when you're losing weight. Stepping on the scale regularly can help you see how effective your diet program is going and whether or not you need to make any changes. Remember, safe weight loss is about one to two pounds per week. Be patient with your progress. You're more likely to sustain slow and steady weight loss in the long-term. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For the most accurate pattern of results, it's best to weigh yourself at the same time of day, on the same day of the week and in the same clothes (or choose to go without clothes). If your weight loss has plateaued or you've begun to gain weight, recheck your meal plans and food journals and see if you can cut out any more calories to help weight loss."
    },
    {
      "title": "Find a support group.",
      "content": "Find a support group. Having friends, family members or co-workers supporting you through your weight loss plan may help you continue to lose weight and maintain it long-term. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Build a support group to help you stay on track. See if others you know also want to lose weight. Many times people find it easier to tackle weight loss together as a group. You can also try finding online support groups or support groups that meet in person on a weekly or monthly basis. Get support by working with a registered dietitian; he/she can customize your meal plan and provide on-going support."
    },
    {
      "title": "Reward yourself.",
      "content": "Reward yourself. Having a motivating and enticing reward at the end of your weight loss goals can help push you through to the end. Set up something exciting for yourself as you meet your goals. Ideas to try include: Buying yourself new shoes or clothes. Treating yourself to a round of golf or other favorite sport. Getting a massage or other spa treatment. Avoid food-related rewards, as these can trigger old habits that might not be conducive to weight loss."
    },
    {
      "title": "Start a food journal.",
      "content": "Start a food journal. Journaling your meals, snacks and drinks can help motivate you to stay on track. Also, people who journal typically lose more weight and keep it off longer compared to those who do not track their food. You can either purchase a journal or download a food journal app. Try to track as many days as you can. Again, you're more likely to stay on track and stick with your meal plan the more often you record your foods. Keep track of your food journal. This may be a good resource to evaluate how well your diet is going and how effective it is for weight loss."
    },
    {
      "title": "Get adequate rest.",
      "content": "Get adequate rest. Sleeping seven to nine hours each night is recommended for general health and wellness. [17] X Research source However, adequate sleep is also important for weight loss. Studies show that people who sleep less than six or seven hours nightly or have poor sleep weigh more than those who get adequate rest. Go to bed earlier. If you have to get up early, try to get in bed earlier to help increase your total sleep time. To make sure you have a sound and undisturbed sleep, remove all electronics — like your phone, tablet device or computer — from your bedroom. Practice good sleep hygiene to ensure you get the most out of your sleep."
    },
    {
      "title": "Increase your baseline physical activity.",
      "content": "Increase your baseline physical activity. Baseline activity is activity that you already do everyday — walking up stairs, walking to and from your car, and doing daily chores. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source This type of activity does not burn a lot of calories, but can help support your weight loss. Although it's very possible to lose weight without going to the gym or working out regularly, there are definitely benefits of being moderately active. Even by simply increasing baseline activity, you may notice more weight loss, improved mood, or increased energy. Try to increase your baseline activity each day. This can include parking further away from where you work or are shopping, taking the stairs instead of the elevator, standing during commercial breaks, or delivering messages to co-workers in person instead of by email. Encourage social gatherings that are a bit more active. Frisbee, golf, swimming, or a simple picnic in the park with friends are activities that will get you moving (and get you fresh air). If weather is an issue, do something indoors like dancing."
    }
  ]
}