{
  "url": "https://www.wikihow.com/Get-a-Boy-in-Elementary-School",
  "title": "How to Get a Boy in Elementary School",
  "steps": [
    {
      "title": "Make sure to be friends with the boy you like.",
      "content": "Make sure to be friends with the boy you like. If you aren't, hang around him a lot, talk to him, sit by him, and if you think your ready, ask to help with his homework. Friendship should always come first if you want to be with him in school, especially elementary. People this young would be surprised if they found out you liked a boy that you hardly knew."
    },
    {
      "title": "Get to know him well.",
      "content": "Get to know him well. What are his interests, what does he like doing and what things do you have in common with him? Find those things out. Then you can start to do things that he likes. Maybe play a sport that he likes. Or get him a present on his birthday. It wouldn't seem that suspicious if you were already friends."
    },
    {
      "title": "Get to know his friends more.",
      "content": "Get to know his friends more. If you don't know his friends, make more effort to get to know them. Maybe the person you like hangs out with his friends a lot, so try to join in the group, even if you're a little shy you might be the only girl there. If you are shy that your the only girl there, try inviting one of your friends so you won't be that shy."
    },
    {
      "title": "Be his best friend.",
      "content": "Be his best friend. Don't know how? Just let him be your best friend how you'd do it for your girl best friend. Hang out with him the most, partner up for projects. Maybe if he has a sibling who your friends with as well, go to his house. Don't steal him though. That's not how you do it."
    },
    {
      "title": "Be nice and be thoughtful.",
      "content": "Be nice and be thoughtful. Try to stay as calm as you can if you get into an argument or disagreement with him. The last thing you'll want is first thinking of him as your crush, and then an enemy. Don't call him stupid or ugly or anything mean. Show him you're there for him but don't baby him. Attracting a good guy begins with owning your self-worth and living a fulfilling life. Confidence is one of the most desired traits a man will seek in a partner, as he’s attracted to someone who will compliment his lifestyle."
    },
    {
      "title": "Don't let people make fun of him.",
      "content": "Don't let people make fun of him. Stand up for him and let him see that you really mean your friendship with him. Show him that you're brave. Some boys find this feeling nice."
    },
    {
      "title": "Allow the friendship to blossom properly.",
      "content": "Allow the friendship to blossom properly. That means, give it time. Even if it progresses no further than friendship, at least you have a good friend in the making. After all, you're both still really young and there is a lot of life ahead of both of you."
    },
    {
      "title": "Be interested in the sports that he does.",
      "content": "Be interested in the sports that he does. If he is playing basketball in PE, then tell him he did a good job. If you like the sport, join in and suggest you play together, either for practice or for real. Show off your athletic ability because you are good at it and enjoy it. Don't show off just to impress him; you're too smart for that."
    },
    {
      "title": "Stand next to him in line and sit next to him at assemblies.",
      "content": "Stand next to him in line and sit next to him at assemblies. Not all the time. He'll think you're weird. But sometimes."
    },
    {
      "title": "Talk together.",
      "content": "Talk together. Talk about things you have in common, things you both like doing and things that happen at school. Keep it light and friendly."
    },
    {
      "title": "Avoid interrupting his time spent with friends.",
      "content": "Avoid interrupting his time spent with friends. Find out when he is happy to spend time together and let him know when you're free too, and when you'd rather spend time with your girlfriends."
    },
    {
      "title": "Continue to aim to do well in school.",
      "content": "Continue to aim to do well in school. You could even study together, and help each other to learn the things you're both best at."
    },
    {
      "title": "Do not ask him out.",
      "content": "Do not ask him out. Seek first to be really good friends. If you want something more, give it a lot of time. You are both very young and it's a lot more fun to spend time together as friends, learning more about one another and having fun than making things awfully serious and complicated. The moment you get serious, the fun stops and the worries start."
    },
    {
      "title": "Avoid love letters or telling your secret to others.",
      "content": "Avoid love letters or telling your secret to others. These sorts of actions might cause him to not like you or to find you silly."
    },
    {
      "title": "Keep your romantic interest close to your heart.",
      "content": "Keep your romantic interest close to your heart. Don't tell him you like him until you are either moving or going to a new school or until you are in at least grade 5. The awkwardness of learning that you have feelings for him might ruin your friendship!"
    },
    {
      "title": "Chill and take it all in your stride.",
      "content": "Chill and take it all in your stride. You're in elementary school. You have the rest of your life for romance. Don't rush it."
    }
  ]
}