{
  "url": "https://www.wikihow.com/Have-Fun-on-a-School-Computer",
  "title": "How to Have Fun on a School Computer",
  "steps": [
    {
      "title": "Draw on Microsoft Paint or Paint 3D.",
      "content": "Draw on Microsoft Paint or Paint 3D. It's not likely that these apps would be blocked, so check out these or other drawing apps. On MS Paint and Paint 3D, you can draw anything you want! Plus, these two apps don't require internet, so you can draw anytime."
    },
    {
      "title": "Customize your computer.",
      "content": "Customize your computer. Customizing your computer is a fun thing to do! You can do many different types of things like changing your lockscreen, Google background, profile picture, Google shortcuts, and many more! You can put any kind of picture/image you like!"
    },
    {
      "title": "Write a story on Google Docs or Word.",
      "content": "Write a story on Google Docs or Word. If you're bored and want to write a story, then you should try out Google Docs or Word. Both apps are great places to write a story. On Google Docs and Word, you can change the font and the color of your text, you can write as much as you want, and on some school computers, you can use Google Docs offline! Both apps are great places to write a story."
    },
    {
      "title": "Make a wikiHow account.",
      "content": "Make a wikiHow account. A great thing to do would be to make a wikiHow Account. With a wikiHow Account, you could make your own user page and help improve articles! If you don't know how to make an Account, you can check out How to wikiHow:Create a wikiHow Account."
    },
    {
      "title": "Make a group chat in Google Slides.",
      "content": "Make a group chat in Google Slides. A great thing to do with your friends on school computers is making a group chat! Most chat websites are blocked, but on Google Slides, you can make your own chat! If you want to invite your friends, just hit the share button and add their emails."
    },
    {
      "title": "Edit pictures on Pixlr.",
      "content": "Edit pictures on Pixlr. Pixlr is an Online Photo Editor that let's you edit any image you want. You can change the effects, background, filter, etc. There are two versions of Pixlr. There is Pixlr X and Pixlr E. Pixlr X is simple and easy to use, whereas Pixlr E is more advanced. You can have a lot of fun on this app! it may cost money depending on what you use. ."
    },
    {
      "title": "Play Google Games.",
      "content": "Play Google Games. On most school computers, Google Games aren't blocked! Some examples of Google Games are, Minesweeper, Snake, PAC-MAN, Solitaire, and Tic Tac Toe! These games are really fun, and a great way to pass the time!"
    },
    {
      "title": "Have some fun on Kahoot.",
      "content": "Have some fun on Kahoot. Kahoot is a website where you can play fun learning games. Right now, you can create four different Kahoots: Quizzes, Jumbles, Surveys, and Discussions. Kahoot Quizzes and Jumbles: For Kahoot quizzes and jumbles, you can award points and show a leaderboard. Kahoot Surveys and Discussions: For Kahoot surveys and discussions, there are no points and there isn't a leaderboard. Kahoot is a great website! You can play with family and friends."
    },
    {
      "title": "Explore places on Google Earth.",
      "content": "Explore places on Google Earth. Google Earth is a program where you can see a 3D representation of Earth. Google Earth allows you to see any landscapes and cities you want. If you don't know what exactly you want to see, try pressing the Domino icon called, \"I'm Feeling Lucky.\" That'll take you to a random place."
    },
    {
      "title": "Host a Zoom meeting.",
      "content": "Host a Zoom meeting. If you're feeling bored and want to talk to your friends, try hosting a Zoom meeting. If you want to host a meeting on Zoom, just hit the \"Host a meeting\" button. If you want to join a meeting, hit the \"Join a meeting\" button."
    }
  ]
}