{
  "url": "https://www.wikihow.com/Insert-Progesterone-Suppositories-Without-an-Applicator",
  "title": "How to Insert Progesterone Suppositories Without an Applicator",
  "steps": [
    {
      "title": "Clean your vaginal area with unscented soap and warm water.",
      "content": "Clean your vaginal area with unscented soap and warm water. Stand in your shower or bathtub and wet your vaginal area. Use your hand to apply the soap (washcloths or loofahs may irritate the sensitive skin). [2] X Research source After you lather, rinse with warm water until all of the soap is gone. Your vaginal area can harbor bacteria and germs. You need to wash the area to make sure these bacteria and germs don’t enter your vagina when you insert the suppository. Make sure your soap is unscented, as fragrances can cause irritation. [3] X Research source"
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands with soap and warm water. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Wet your hands with warm water and apply soap. Rub your hands together to create a lather, continuing for 20 seconds. Then, rinse your hands under warm running water until all of the soap is washed away. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Your hands can also have germs and bacteria on them, and you don't want to transfer any germs or bacteria into your vagina."
    },
    {
      "title": "Be careful when handling the suppository because it can melt.",
      "content": "Be careful when handling the suppository because it can melt. Your suppository is made from progesterone suspended in a base. When it enters your body, the base melts and releases the progesterone. You don't want the suppository to melt in your warm hands, so handle it as little as possible before applying. [6] X Research source It’s best to lightly hold your suppository between 2 fingers. Never hold it in your palm."
    },
    {
      "title": "Lie on your bed with your bent knees pulled back toward your chest.",
      "content": "Lie on your bed with your bent knees pulled back toward your chest. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This helps open your vagina as much as possible so it's easier to insert the suppository. You'll be able to push it in deeper than you would in other positions, which helps it be more effective. Pull your legs as far back as possible, rather than just bending your knees."
    },
    {
      "title": "Place the suppository on the end of your finger.",
      "content": "Place the suppository on the end of your finger. You may be able to get your suppository to stick to the end of your finger. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If this doesn’t work, hold the suppository at the entrance to your vaginal canal, between the lips of the vagina. [9] X Research source Then, put the tip of your finger behind it to push it into your vagina. Remember to use a light touch when handling the suppository, as it can easily melt in your hands."
    },
    {
      "title": "Push the suppository into your vagina as far as it will comfortably go.",
      "content": "Push the suppository into your vagina as far as it will comfortably go. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This will likely be as far as your finger will go, as well. Insert the suppository by pushing upward and backward. [11] X Research source If you feel any resistance, stop pushing and leave the suppository where it is. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You should not feel any pain or discomfort when you insert the suppository. If you do, stop pushing and remove your finger."
    },
    {
      "title": "Remove your finger from your vagina.",
      "content": "Remove your finger from your vagina. Slide your finger out, leaving the suppository in place. Make sure you don’t remove any of the medicine when you pull out your finger. It's unlikely that the suppository will stay stuck to your finger. If this happens, however, re-insert the suppository into your vagina. Press against the sidewall of your vagina to help it stick."
    },
    {
      "title": "Lower your legs back down onto the bed.",
      "content": "Lower your legs back down onto the bed. Relax in a lying down position for a moment before getting up. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The suppository will start melting immediately after you insert it into your vagina. You don't need to stay lying down after you insert the suppository."
    },
    {
      "title": "Wash your hands after handling the progesterone suppositories.",
      "content": "Wash your hands after handling the progesterone suppositories. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Scrub your hands with soap and water for 20 seconds, then rinse them clean in warm, running water. This will prevent the progesterone from absorbing into the skin on your hands and fingers. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Read all of the information included with your suppositories.",
      "content": "Read all of the information included with your suppositories. Follow all of the instructions provided by your doctor and pharmacist. The instructions for using progesterone can vary depending on your individual needs, so do as your doctor directed. [16] X Research source Your suppositories should look like ovals or bullets. They’re usually prepared by the pharmacist, so check with them if you have any questions."
    },
    {
      "title": "Take a missed dose as soon as possible, unless your next dose is near.",
      "content": "Take a missed dose as soon as possible, unless your next dose is near. If you miss a dose of your progesterone, take it as soon as you remember. It’s important to take your medicine as directed, without missing a dose. However, don’t take two doses at once. [17] X Research source If it’s close to your next scheduled dose, skip the dose you forgot to take and get back on schedule with your next dose."
    },
    {
      "title": "Opt for loose fitting, breathable clothing while using the suppositories.",
      "content": "Opt for loose fitting, breathable clothing while using the suppositories. The progesterone will keep your vaginal area moist, as it will slowly leak out of your vagina. Wear cotton underpants and loose skirts or pants until you’re finished with your medication. While using vaginal progesterone, don’t wear tight pants, nylon underwear, or tights. These materials don’t breathe, so they increase your risk of developing a yeast infection. [18] X Research source"
    },
    {
      "title": "Wear a sanitary pad to protect your underwear from leakage.",
      "content": "Wear a sanitary pad to protect your underwear from leakage. The suppository will melt inside your body and may slowly leak out of your vagina. You can wear a sanitary pad to protect your underwear from the leakage. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Remember to change your pad every few hours. You want to keep your vaginal area as dry as possible, which will help prevent a yeast infection. If you use your suppository right before bedtime, you will experience less discharge than if you walk around after you insert it."
    },
    {
      "title": "Do not wear tampons while using vaginal progesterone.",
      "content": "Do not wear tampons while using vaginal progesterone. Tampons can absorb the progesterone, which can limit how effective it is. Always use sanitary pads rather than tampons. [20] X Research source You might start your period while you’re using the progesterone. If this happens, continue to use sanitary pads only. Don’t use tampons."
    },
    {
      "title": "Store your suppositories in the refrigerator to keep them from melting.",
      "content": "Store your suppositories in the refrigerator to keep them from melting. It’s best to store your suppositories in the cool, dry conditions in your refrigerator. This helps them hold their form and makes them easier to insert, as they can easily melt. [21] X Research source Some progesterone suppositories can be stored at room temperature. Check the label on your medication to be sure. Don’t freeze your suppositories."
    },
    {
      "title": "Talk to your doctor about the risks of taking progesterone.",
      "content": "Talk to your doctor about the risks of taking progesterone. Although progesterone is considered safe, all medicines come with risks. Your doctor can help you understand how your personal medical history relates to the risks of taking progesterone. Here are some risks your doctor may discuss: [22] X Research source You shouldn't take progesterone during pregnancy unless it's prescribed as part of your fertility treatment. Progesterone can increase your risk of developing blood clots, liver disease, stroke, heart attack, high blood pressure, breast cancer, or other side effects and conditions. This risk is greater if you have a personal or family history of these conditions."
    }
  ]
}