{
  "url": "https://www.wikihow.com/Know-the-Difference-Between-Emo-and-Goth",
  "title": "How to Know the Difference Between Emo and Goth",
  "steps": [
    {
      "title": "Both terms are rooted in history.",
      "content": "Both terms are rooted in history. While the term 'emo', which stands for 'emotive hardcore' and has its roots in the 80s hardcore punk scene, it is unclear on exactly who first used it. [1] X Research source ‘Goth,’ on the other hand, which was used to describe the atmosphere of late 70s/early 80s post-punk bands, can be traced back to the term \"gothic\" used by journalists. [2] X Research source [3] X Research source"
    },
    {
      "title": "Listen to proto-goth for an early look at goth culture.",
      "content": "Listen to proto-goth for an early look at goth culture. Many cite bands such as The Velvet Underground, David Bowie, and The Doors, who were labelled \"gothic rock\" in 1967 due to the sound of their atmospherics and dreary use of the organ [4] X Research source as influential goth predecessors. [5] X Research source [6] X Research source Nico's The Marble Index is considered is a proto-goth album and has even been citied as \"the first Goth\" album due to her \"lyrical drone accompanied by a medieval-sounding musical landscape populated with a harpsichords and glockenspiels\". [7] X Research source [8] X Research source"
    },
    {
      "title": "Siouxsie and The Banshees and The Cure give a snapshot of the 1980s goth sound.",
      "content": "Siouxsie and The Banshees and The Cure give a snapshot of the 1980s goth sound. These artists combined lyrics with a fixation on darkness and depravity with effects-laded guitars, atmospheric basslines and tom-tom heavy or 'tribal' drums. However, it wasn't until Bauhaus released their 1979 single Bela Lugosi's Dead , in reference to the actor who played the 1931 film adaption of Bram Stoker's Dracula , that goth really became recognized as a genre and subculture. [9] X Research source [10] X Research source Other bands like UK Decay, Southern Death Cult, and The Danse Society were also particularly popular and influential bands during this era. [11] X Research source [12] X Research source [13] X Research source"
    },
    {
      "title": "The second wave, spearheaded by The Sisters of Mercy, saw a shift in goth's sound.",
      "content": "The second wave, spearheaded by The Sisters of Mercy, saw a shift in goth's sound. During the mid-80s the genre began to move away from its pure experimental and arty post-punk sound and started to incorporate hard rock elements. The bands' use of the drum machine is particularly notable. Their mainstream success spawned several similar sounding bands, such as Red Lorry Yellow Lorry, The Merry Thoughts, and Fields of the Nephilim. [14] X Research source [15] X Research source Goths evolution saw the beginnings of notable offshoots, including darkwave (Clan of Xymox and Switchblade Symphony) which is post-punk crossed with new wave and synthpop, [16] X Research source and ethereal wave (Cocteau Twins). [17] X Research source The first deathrock revival began in 1998 and petered out, with bands such as All Gone Dead and Tragic Black as the face, around the mid-00s. These bands mixed cartoonish aesthetics with the caricature of the Batcave and a more modern deathrock sound. [18] X Research source [19] X Research source"
    },
    {
      "title": "While goth certainly does have it classic bands, it continues to evolve.",
      "content": "While goth certainly does have it classic bands, it continues to evolve. Decades on sees bands continuing to experiment and incorporate elements of other genres into their music, with several developments springing up all around the world. One includes the boom in Russian post-punk with bands like Ploho and Molchat Doma, who gained popularity after their song \"Sudno (Boris Ryzhy)\" went viral on TikTok. [20] X Research source [21] X Research source Another includes bands such as She Past Away, Twin Tribes, TRAITRS, and HAPAX part of so-called \"gothwave\" genre, a perfect blend of classic goth guitar sounds with signature darkwave synths. [22] X Research source"
    },
    {
      "title": "Emo also has its roots in music.",
      "content": "Emo also has its roots in music. Many consider the first emo band to be Rites of Spring, a Washington, D.C. band that formed in 1984. Led by singer Guy Picciotto, the band’s music was characterized by noisy, hardcore instrumentation and intensely vulnerable, confessional lyrics. [23] X Research source Soon after, bands like Embrace, Beefeater, and Dag Nasty joined the D.C. scene, and the emo music movement officially began (even if each of these bands has been forthright about hating the term ‘emo.’). [24] X Research source Rites of Spring’s Guy Picciotto and Ian MacKaye of Embrace eventually formed the hardcore punk band Fugazi, another band credited as influencing the emo movement."
    },
    {
      "title": "Listen to Midwest emo bands to learn about the 1990s emo music movement.",
      "content": "Listen to Midwest emo bands to learn about the 1990s emo music movement. In the nineties, bands like Sunny Day Real Estate, American Football, and Cap’n Jazz made the Midwest the epicenter of the revival. These bands took emo’s messy, noisy sound and made it a little more polished. [25] X Research source As bands continued to form under the influence of preceding emo bands, offshoots of the emo sound started to shape in all kinds of directions, most notably screamo (Saetia and Orchid). [26] X Research source"
    },
    {
      "title": "From the late 90s to the late 2000s, emo music burst into the mainstream.",
      "content": "From the late 90s to the late 2000s, emo music burst into the mainstream. Pioneered by bands like The Promise Ring and The Get Up Kids, emo saw a shift from the unconventional song structures into a catchy and hook-filled fusion of emo and pop punk. [27] X Research source Jimmy Eat World officially launched the emo-pop movement with their 2001 album Bleed American whose \"The Middle\" became the flagship. Other bands such as Saves The Day and Brand New were also considered emo pop bands. [28] X Research source [29] X Research source Soon other bands, such as Fall Out Boy and My Chemical Romance whose debuts, Take This to Your Grave [30] X Research source [31] X Research source and I Brought You My Bullets, You Brought Me Your Love [32] X Research source [33] X Research source [34] X Research source respectively, began gaining more mainstream attention."
    },
    {
      "title": "The waning commercial popularity of emo-pop saw the genre retreat underground.",
      "content": "The waning commercial popularity of emo-pop saw the genre retreat underground. Around the early 2010s, many mainstream emo-pop bands either broke up or began to move away from their roots and experiment with other genres. In its place saw a new crop of bands such as Snowing and Algernon Cadwallader that, not only took taken inspiration from the sounds and aesthetics of the '90s, but seemed to explore a fusion between post-hardcore, math rock, and pop-punk. [35] X Research source [36] X Research source Screamo has shown a similar resurgence, with 2018 summers being labelled \"Summer of Screamo\" due to many classic screamo bands reuniting. [37] X Research source [38] X Research source More recently, emo continues to influence present-day artists in a more multifaceted style, with emo rappers like Lil Peep, Lil Tracy, and Princess Nokia bringing innovations to the genre. [39] X Research source Billie Eilish is also another great example."
    },
    {
      "title": "For a grasp on goth fashion, take a look at what the goth musicians wore.",
      "content": "For a grasp on goth fashion, take a look at what the goth musicians wore. Staples in goth fashion include black clothing often in lace or leather with a DIY air, elaborate and expressive make-up, fishnets, winklepickers, silver jewelry, and big, back-combed, often dyed hair. [40] X Research source [41] X Research source In the early days, many goths creatively thrifted and made their own clothes; the goal was to take inspiration from their idols without directly copying."
    },
    {
      "title": "If you're going for an emo look, try something a little more casual.",
      "content": "If you're going for an emo look, try something a little more casual. Staples of the subculture include band t-shirts, sweeping bangs, skinny jeans, beaten-up converse, and, you guessed it, heavy eyeliner. If you get cold, wear a sweater. It’s important to note, though, that due to the varying subgenres within emo music, typical emo fashion varies pretty widely. [42] X Research source For example, 1980s and 1990s emo bands like Embrace and Sunny Day Real Estate really didn’t emphasize fashion as a part of the work that they did. Later emo-pop bands like My Chemical Romance and Fall Out Boy were more focused on style and fashion."
    },
    {
      "title": "Goth music often uses synthesizers, drum machines, and effect-ladened guitar.",
      "content": "Goth music often uses synthesizers, drum machines, and effect-ladened guitar. Goth can carry an array of sounds, but usually stands out due to its use of a prominent atmospheric bass and a flanging guitar, most notably used on Siouxsie and the Banshees' second LP Join Hands . [43] X Research source Vocal styles can appear baritone, unusually high-pitched or drowned out, especially in modern darkwave. At one point in time, goth was given the name \"positive punk\" in reference to the positive direction punk was heading. Many bands used tribal drums and avoided guitar power chords, opting for slashing, screeching and razor-like effects instead. [44] X Research source"
    },
    {
      "title": "Emo music combines punk-influenced guitars and heart-on-your-sleeve style lyrics.",
      "content": "Emo music combines punk-influenced guitars and heart-on-your-sleeve style lyrics. In addition to the hardcore dissonance of emo guitar playing and instrumentation, a huge part of what distinguishes the genre is the lyrics. Most emo lyrics describe intense feelings of alienation, loneliness, and despair, often using anguished metaphors that veer towards melodrama. [45] X Research source For example, Guy Picciotto kicks off the Rites of Spring track “For Want Of” with the lyrics, “I woke up this morning with a piece of past caught in my throat / And then I choked.” [46] X Research source"
    },
    {
      "title": "A goth club is a bar or nightclub affiliated with goth culture.",
      "content": "A goth club is a bar or nightclub affiliated with goth culture. Starting with the highly influential goth club The Batcave in the 1980s, goth clubs have been a staple in keeping a flourishing goth scene alive in cities across the world. To learn more about goth subculture and distinguish it from emo subculture, consider finding a goth club in your city! [47] X Research source"
    },
    {
      "title": "More recently, bars and clubs have been throwing emo-themed events.",
      "content": "More recently, bars and clubs have been throwing emo-themed events. These events feature emo music and invite attendees to dress in their favorite emo fashion looks. If you want to see first-hand what makes emo subculture unique from goth subculture, see if any local clubs or bars are hosting an emo night in your area! [48] X Research source"
    },
    {
      "title": "It’s important to avoid making harmful assumptions about any group of people.",
      "content": "It’s important to avoid making harmful assumptions about any group of people. Learning about particular music and fashion subcultures is a lot of fun, but you should remember that everyone is a unique individual. Avoid generalizing groups of people simply because of the clothes they wear or the music they like. For example, liking emo music doesn’t make someone an unhappy person. They may just enjoy the emotional catharsis the lyrics and music bring them!"
    }
  ]
}