{
  "url": "https://www.wikihow.com/Hit-Enter-Without-Sending-a-Message-on-Facebook-Messenger",
  "title": "How to Type on a Second Line in Messenger without Sending a Message",
  "steps": [
    {
      "title": "Open a conversation in Facebook Messenger.",
      "content": "Open a conversation in Facebook Messenger. Click the Messenger icon at the top-right corner of Facebook, then click the message you want to reply to."
    },
    {
      "title": "Enter text into the message field.",
      "content": "Enter text into the message field."
    },
    {
      "title": "Hold ⇧ Shift and press ↵ Enter.",
      "content": "Hold ⇧ Shift and press ↵ Enter . The typing cursor will move to the next line without sending the message. This is known as a soft return, or a soft line break. On Mac, you would hold ⇧ Shift and press ⏎ Return . Although it was once supported, you can no longer change the default action for hitting enter when sending messages."
    },
    {
      "title": "Tap on a conversation in the Messenger app.",
      "content": "Tap on a conversation in the Messenger app."
    },
    {
      "title": "Type what you want to say in the text field.",
      "content": "Type what you want to say in the text field. When you open the conversation, your cursor should automatically be in the text field."
    },
    {
      "title": "Tap the ⏎ Return button.",
      "content": "Tap the ⏎ Return button. On mobile, there is a separate Send button that is not connected to the Enter or Return key on your phone keyboard. On Android, the return button might look like an arrow."
    },
    {
      "title": "Continue typing your message on the new line.",
      "content": "Continue typing your message on the new line."
    },
    {
      "title": "Tap the arrow next to the text field to send your message.",
      "content": "Tap the arrow next to the text field to send your message. The icon looks like a triangle or a paper airplane and is directly to the right of the message input box."
    }
  ]
}