{
  "url": "https://www.wikihow.com/Install-After-Effects-Presets",
  "title": "How to Install After Effects Presets",
  "steps": [
    {
      "title": "Aquire After Effects presets.",
      "content": "Aquire After Effects presets. After Effects presets are created in After Effects and saved as a \".ffx\" file. You can transfer them from another computer or download them from the internet. Most websites require a subscription to download After Effects presets. The following are a few websites where you can download After Effects presets: https://aenhancers.com/ https://www.videocopilot.net/presets/ https://motionarray.com/browse/after-effects-presets/"
    },
    {
      "title": "Locate the After Effects User Presets folder.",
      "content": "Locate the After Effects User Presets folder. Open File Explorer on Windows or Finder on Mac and use the following steps to navigate to the After Effects User Presets folder: [2] X Research source Open your Documents or My Documents folder. Open the Adobe folder. Open the After Effects CC (version number) folder. Open the User Presets folder. If you don't see a User Presets folder, you can make one or save a preset in After Effects to create one automatically)."
    },
    {
      "title": "Drag and drop the preset files into the \"User Presets\" folder.",
      "content": "Drag and drop the preset files into the \"User Presets\" folder. You can drag and drop individual \".ffx\" files, or drag and drop an entire folder full of \".ffx\" files. [3] X Research source"
    },
    {
      "title": "Open After Effects.",
      "content": "Open After Effects. After Effects has a dark blue icon that says \"Ae\" in the middle. Click the After Effects icon to open After Effects."
    },
    {
      "title": "Locate the \"Effects & Presets\" menu.",
      "content": "Locate the \"Effects & Presets\" menu. By default it is in the panel to the right in After Effects. If you don't see the \"Effects & Presets\" menu, click Window in the menu bar at the top, and then ensure \"Effects & Presets\" is checked."
    },
    {
      "title": "Click the menu icon in the \"Effects & Presets\" menu.",
      "content": "Click the menu icon in the \"Effects & Presets\" menu. It's the icon with four horizontal lines and an arrow pointing down. It's in the upper-right corner of the \"Effects & Presets\" menu. Click this icon to display a pop-up menu."
    },
    {
      "title": "Click Refresh List.",
      "content": "Click Refresh List . It's at the bottom of the pop-up menu. After Effects will scan the User Presets folder for new presets and add them to the list of presets. [4] X Research source You can find your installed preset below \"User Presets\" below \"Animation Presets\" in the \"Effects & Presets\". Click and drag a preset into the timeline at the bottom to apply a preset. If your presets are not showing up in your After Effects folder, make sure you install them in the folder for the correct version of After Effects. If you have used multiple versions of After Effects, you may have an separate After Effects folder for the different versions of After Effects you have used. If you are using After Effects 2020, and you put your presets in the User Presets folder for After Effects 2015, they will not show up in After Effects 2020. After Effects presets are not backwards compatible with older versions of After Effects. [5] X Research source"
    }
  ]
}