{
  "url": "https://www.wikihow.com/Hit-a-Draw-or-Fade",
  "title": "How to Hit a Draw or Fade",
  "steps": [
    {
      "title": "Use a strong grip.",
      "content": "Use a strong grip. Hitting a draw means hitting the ball to that, for a right-handed player, the ball curves slightly from right to left. Employing what's called a strong grip will help you do this. Weak grips tend to cause fades, while strong grips encourage draws. In order to hit a draw: [1] X Research source Place your left hand on the top of the grip, with your wrist turned in to your body, so that some knuckles are showing. Place your right hand below of your left hand, covering your left thumb, with the crease in your right hand angled to your right shoulder. Your palms should face each other. [2] X Research source Note : Rolling your right hand over the club is what \"weakens\" the grip, causing a slide or fade. If you can see the knuckles in your right hand, you're weakening your grip, making a draw harder."
    },
    {
      "title": "Aim to the right of your target.",
      "content": "Aim to the right of your target. Point your feet and shoulders so that they are aimed slightly to the right of your intended target, but aim your shot right at the target. This is called a closed club face. [3] X Research source When you hit the ball, it should start out right of its initial target, curling back to the left the closer it gets. Some golfers prefer dropping their front shoulder, believing that more of an upward trajectory on the ball contributes to a draw."
    },
    {
      "title": "Draw an imaginary line to shoot with a rounded swing.",
      "content": "Draw an imaginary line to shoot with a rounded swing. What does this mean? When you set up your feet and shoulders, draw an imaginary line that both your feet and shoulders are pointing to. On the takeaway, keep your swing low and on the inside of this imaginary line. Try for more of a rounded swing than a vertical swing."
    },
    {
      "title": "Straighten your right arm out immediately on the downswing.",
      "content": "Straighten your right arm out immediately on the downswing. When your club begins to come down, try to straighten out your right arm. This will create good club head speed, promoting a right-to-left path in the flight of the ball. As you do this, keep your right shoulder back for as long as possible. This, in combination with a straight right arm will help the club face close on time, creating a draw."
    },
    {
      "title": "Keep the toe of the club in front of the heel of the club.",
      "content": "Keep the toe of the club in front of the heel of the club. As you hit the ball, try to make sure that the toe of the club is in front of the heel; as you continue your follow-through, the toe of the club should travel farther in front of the heel than it was when you made contact. To do this, the right arm will cross over the left arm as you make contact with the ball. This will create the signature draw arc."
    },
    {
      "title": "Weaken your grip.",
      "content": "Weaken your grip. If you're a right-handed golfer, move your grip over to the left a bit. Make sure your knuckles on your left hand aren't visible on your grip, but your right-hand knuckles are. Don't overdo this. A fade can easily turn into a slice if you move your grip too much to the left. Make sure your left hand is on top of your right hand for as long as possible. Hold your club face square to your release path, or even open to it."
    },
    {
      "title": "Aim slightly to the left.",
      "content": "Aim slightly to the left. A fade is where the ball starts off left and slowly drifts back to center. To make sure your fade doesn't become a slice, aim slightly left of target with your feet and shoulders. [4] X Research source"
    },
    {
      "title": "Hit with a slightly open face.",
      "content": "Hit with a slightly open face. On impact, hit the ball so that the toe of the club is tilted slightly rearward and the heel is in front of the toe. [5] X Research source This will promote the left-to-right movement that you're looking for with a fade."
    },
    {
      "title": "Don't over swing.",
      "content": "Don't over swing. Swinging really hard with an open swing encourages a slice. So don't kill the ball. Swing evenly so that your hands don't turn over."
    },
    {
      "title": "Tee the ball low and line up the center of the ball with the sweet spot of your driver.",
      "content": "Tee the ball low and line up the center of the ball with the sweet spot of your driver. A lower height on the teed-up ball will help you swing more level at impact."
    }
  ]
}