{
  "url": "https://www.wikihow.com/Get-a-Dancer%27s-Body",
  "title": "How to Get a Dancer's Body",
  "steps": [
    {
      "title": "Listen to your body.",
      "content": "Listen to your body. Ballerinas and other dancers are commonly asked about what they eat. Their specific diets vary, but all of them eat with one primary goal in mind: keeping their bodies healthy and full of energy. When deciding what's right for you in a given day, pay attention to how you feel. As your diet becomes healthier, you'll grow more aware of the foods that make you feel best. Stick to those! As an example, if you wake up feeling very hungry, eat a larger but healthy breakfast. If you don't feel like having much, have a smoothie or a hot, unsweetened drink and a piece of fruit."
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. How much water you need in a day depends on your size, weight, activity level and where you live. To calculate how much water you need, take your weight in pounds and divide it in half: that number is where you should start. On average, a 150-pound person needs between 75 and 150 ounces of water each day. If they were sedentary and living in a cool climate, they would drink closer to 75 ounces of water each day; if they were active and lived in a hot climate, their intake would be closer to 150 ounces."
    },
    {
      "title": "Take supplements (optional).",
      "content": "Take supplements (optional). Many ballerinas start their morning with a glass of water and supplements. If your diet is complete and you have no health concerns, you may not need supplements at all. It really depends on personal taste and needs. If you are chronically tired or have any other chronic health concerns, consult a doctor about taking supplements. As an example, if you're often tired, you may find that your iron and/or vitamin D levels are low, in which case you might need to take supplements."
    },
    {
      "title": "Eat lean sources of protein.",
      "content": "Eat lean sources of protein. Healthy sources of protein include seafood; white-meat poultry (e.g., chicken breast or turkey breast); milk, cheese, and yogurt; eggs; beans; pork tenderloin; soy; lean beef; and meal replacement drinks. [2] X Research source Some ballerinas start their morning with a smoothie, hot milky drink (e.g., a cappuccino), Greek yogurt, or eggs."
    },
    {
      "title": "Eat healthy sources of fat.",
      "content": "Eat healthy sources of fat. It might seem counterintuitive, but eating fat is actually good for you — you just need to make sure you're eating good fats, not bad ones. To find out what types of fats are in your foods, read the labels and/or look them up online. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Bad fats include saturated fats and artificial trans fatty acids. Saturated fats are found in animal products and in vegetable fats that liquefy at room temperature (e.g. coconut and palm oils). Artificial trans fatty acids are found in packaged foods and some margarines. Good fats include unsaturated fats such as those found in vegetable oils, fish, plants, flaxseeds, and walnuts."
    },
    {
      "title": "Limit your carb intake.",
      "content": "Limit your carb intake. Most professional dancers are careful about their starch and sugar intake. Those that do eat carbs mainly eat healthy ones such as whole wheat bread or rye crackers, or vegetables. [4] X Research source Some professional dancers claim to eat mostly protein and to avoid carbs. Note that the lower your carb intake, the more likely you are to need a supplement, particularly fibre and folic acid. [5] X Research source While cutting carbs may help you lose weight, it may also cause tiredness and digestive problems. If you're planning to go very low-carb, consult a nutritionist to ensure that you do it healthfully."
    },
    {
      "title": "Avoid all processed foods.",
      "content": "Avoid all processed foods. When dancers list what they eat it's almost always whole foods, and when they do eat things that come out of a package, it's usually a healthy snack bar made of nuts and/or dried fruit. [6] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Most diet plans recommend avoiding processed foods as much as possible, as these are more likely to contain sodium and carbohydrates, both of which will do nothing to help you lose weight."
    },
    {
      "title": "Treat yourself.",
      "content": "Treat yourself. Even dancers know that if you deprive yourself of a “guilty pleasure” long enough, you may end up bingeing. If you have a sweet tooth, allow yourself a bit of a high-quality, dark chocolate bar now and then! [7] X Research source You don't want to indulge every day, but you can definitely give into those cravings now and then — the key is to eat something relatively healthy, and only a small amount of it."
    },
    {
      "title": "Warm up before and after exercise.",
      "content": "Warm up before and after exercise. Do some light pilates or yoga, stretching, or some slow cardio for at least five to ten minutes before and after you exercise. This will ensure that your muscles are loose and warm, and will help prevent injury. [8] X Research source Many dancers start and end their day with at least some gentle stretching in order to keep their limbs feeling limber. Tailor your warmup to your exercise. If you're going to do cardio, start with a slow activity like walking or biking at an easy pace. If you're doing strength training, do a slow jog or walk, then some light activity that uses the muscles you intend to work on."
    },
    {
      "title": "Do Pilates.",
      "content": "Do Pilates. Pilates is a system of exercises known for creating long, lean muscles in the arms, legs, and backside. Pilates will also help strengthen your core, giving you better balance, good abs, and a toned back."
    },
    {
      "title": "Do 30 to 60 minutes of cardio each day.",
      "content": "Do 30 to 60 minutes of cardio each day. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Cardio will help you lose weight or, if you're already at a healthy body weight, it will help you maintain your current weight. You don't have to get the entire 30 to 60 minutes in in one big chunk. You can also do 20 minutes in the morning, 20 minutes in the afternoon, and 20 minutes after work/school, or at other intervals that suit you throughout the day — doing it this way will keep your metabolism revved."
    },
    {
      "title": "Strength train",
      "content": "Strength train . To get a dancer's body you must build muscle, and strength training will help you do that. To keep your muscles lean, try using light weights with high repetitions: [10] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Usually you'd use a weight that would exhaust you by the time you reached your 5th to 15th repetition (depending on the exercise and the trainer). This time, try weights that allow you to reach 18 to 20 repetitions before you have to give up."
    },
    {
      "title": "Dance.",
      "content": "Dance. A no-brainer way to get a dancer's body is to dance. Like with running, cardio, and weight-training, dancing provides a full body workout. [11] X Research source"
    },
    {
      "title": "Swim.",
      "content": "Swim. If you're weight-training and running regularly, consider giving your joints a break by swimming. Swimming gives you cardio and helps enlarge your muscles without causing stress to your joints. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Go slowly.",
      "content": "Go slowly. Jumping into a new exercise routine too quickly and ambitiously is a great way to burn yourself out and/or injure yourself. Add exercises to your routine in slow, small increments, giving yourself time to build strength and stamina. [13] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source If you currently don't do any cardio at all, don't try to jump into 30 minutes a day. Start with 30 minutes of brisk walking, three times a week."
    },
    {
      "title": "Pay attention to your body.",
      "content": "Pay attention to your body. You might feel tired or a bit sore after exercising, but you shouldn't be in pain. If anything causes you pain, stop doing it. If the pain persists, depending on how severe and long-lasting it is, you may want to consult a doctor."
    },
    {
      "title": "Take rest days.",
      "content": "Take rest days. Allowing yourself to rest is imperative to building muscles. If you do work out every day, be sure to alternate your workouts so that you're not using the same muscles every day. [14] X Research source"
    },
    {
      "title": "Build your calf muscles using a ledge.",
      "content": "Build your calf muscles using a ledge. Stand on a ledge (a staircase will work well) with your toes/balls of your feet on the ledge and your heels hanging off. Draw your heels up so that you're standing on your toes, then slowly lower them back down. Do this for roughly 5 minutes. [15] X Research source If your calves begin to burn, that's a good sign! Just make sure it's a good burn, and not a painful tearing feeling. If at any point it feels truly painful, stop!"
    },
    {
      "title": "Do leg lifts.",
      "content": "Do leg lifts . Start by lying on your back with your legs straight out and your hands at your sides. Keeping your legs straight, raise them to a 45-degree angle from the ground. Slowly lower your legs to just above the ground (don't touch it!) and repeat. This is a simple leg lift, but there are many variations: [16] X Research source Lie on your back with your hands behind your head and elbows wide. Raise your legs to a 45-degree angle and hold them there while you move them in crisscross motions for 30 seconds — right leg in front of left, then vice versa. As you do this, your shoulder blades should be off the floor as well, as if you were doing a crunch . Your legs should remain straight the entire time. Lie on your back with your legs up at 45 degrees and your hands at your sides. Use your abs to raise your shoulder blades and arms off the floor. Again you should look like you're doing crunches, but with your arms straight out in front of you and your legs at 45 degrees. Lie on your back and lift your shoulders a few inches off the ground as you move your legs into an L position. Place your hands behind your head and lift the leg that's still on the ground slightly off the ground. Keeping your lower leg and shoulders off the ground, curl up towards the highest leg (the vertical part of the L shape) and pulse for 30 seconds. Then, switch legs and repeat. You can speed this up to single pulses as well. These exercises tone your abs, thighs, and bum. If you find these exercises challenging, you can raise your legs slightly higher than 45 degrees to make the exercise less difficult. There are also variations that include standing up and kicking your legs out behind you — these are great for firming up your buns. [17] X Research source"
    },
    {
      "title": "Do a plié",
      "content": "Do a plié . Place one hand on the counter or back of a chair, and lift your opposite arm towards the ceiling, allowing a gentle bend in your elbow. Ensure that your back is straight (shoulders down, pelvis tucked, abs in and tensed) and that your heels are touching, with your toes pointed outward (your feet should look like a V). [18] X Research source Maintaining a good posture, lift your heels 2 inches off the floor so that your weight is now on the balls of your feet. This is your starting position. Continuing to maintain your posture, bend your knees and lower your body up to 12 inches. Hold in this lowered position for one count (say one one thousand inside your head) before returning to your starting position. Do two sets of 10 repetitions. Stay on the balls of your feet throughout."
    },
    {
      "title": "Do a wide plié.",
      "content": "Do a wide plié. Holding onto the edge of a chair or counter with one hand, raise your opposite arm towards the ceiling with a gentle bend at the elbow. Stand with your feet roughly 3 feet apart, toes pointed out. Draw your shoulders down and away from you ears, tighten your abs, tuck your pelvis, and bend your knees. This is your starting position. Ensuring that you maintain your starting posture (shoulders down, abs strong, pelvis tucked, knees bent), raise your heels off the floor as high as you can. Stay on the balls of your feet. Remaining on the balls of your feet, with bent knees and a tucked pelvis, squeeze your butt muscles, and press your thighs and knees back. This should be a small movement. Hold the tension for one count (say one one thousand inside your head), then release. Do two sets of 20 reps. This exercise will firm your thighs and bum."
    },
    {
      "title": "Do a reverse pushup.",
      "content": "Do a reverse pushup. [19] X Research source Sit with your legs extended in front of you and your arms at your sides. Your palms should be on the floor with your thumbs pointing forward and your fingers pointing out to the side. Tuck your pelvis and lift your bum as high as possible off the floor. Bend your elbows and lower your body roughly 2 inches, holding it there as you count to two. Being careful not to lock your elbows, push back up to your starting position (pelvis tucked, bum lifted). Do 15 reps. Be sure to keep your pelvis tucked and your abs strong (pulled in) throughout this exercise. If you find it too difficult, a variation is to place your feet flat on the floor and bend your knees"
    },
    {
      "title": "See the benefits of your new program.",
      "content": "See the benefits of your new program. One way to stay motivated is to identify the ways in which your exercise and diet routine benefit you. For example, you might feel stronger or have more energy, or reduce your risk for diabetes. [20] X Research source It may be enough to focus on the aesthetics at first — that you'll be thinner — but this may not be enough to keep you motivated in the long run. Allow your motivations to change. If you're feeling unmotivated, sit down and remind yourself why you're working so hard for your new body. You may find it helpful to write it down in a journal."
    },
    {
      "title": "Record your progress.",
      "content": "Record your progress. Keep track of your weight, measurements, daily food intake, and daily exercise. When you need motivation, look at your progress. If you're exercising daily and eating healthy, you will see a difference, and measuring this difference may keep you going. [21] X Research source Often weight won't tell you much about how you're doing in your exercise program. You might even find that you get heavier as you build muscle. Measuring yourself, or even just paying attention to how you feel and how your clothes fit, is generally more effective than weighing yourself. You can download apps on your smart phone or tablet that can help you record your progress and even share it with other people."
    },
    {
      "title": "Be realistic.",
      "content": "Be realistic. Experts repeatedly warn us that if we try to do too much too soon, we'll burn out. [22] X Research source Instead of jumping into an hour of exercise every day, make small, incremental boosts to your current routine. As an example, if you already jog once a week and do yoga twice a week, you could add one Pilates class (or video) and two 30-minute walks to your weekly routine."
    },
    {
      "title": "Set weekly goals.",
      "content": "Set weekly goals. Keep track of what you do every day, and at the end of each week, tally up your work. If you've met your goal for that week, reward yourself. [23] X Research source An example of your first week's goal might be 30 minutes of cardio for three days, plus two days of yoga, and one day of Pilates; in addition, you only ate carbs once per day, where you'd normally eat them at every meal."
    },
    {
      "title": "Don't think of it as exercise.",
      "content": "Don't think of it as exercise. Try to do things that hide the fact that you're exercising — for example, walking or playing with your dog, or playing recreational sports such as soccer or tennis. [24] X Research source You could even join a dance class, which would be particularly useful given that you're trying to get a dancer's body!"
    },
    {
      "title": "Make a schedule.",
      "content": "Make a schedule. Take the time to go over your schedule and specifically block out the times in which you'll exercise and prepare healthy meals for yourself. [25] X Research source When creating a schedule try to account for things that might go wrong — for example, a meeting running late or waking up feeling sick. If you don't carve out a specific block of time for your exercise and/or healthy meal preparation, chances are you won't find the time to do those things."
    },
    {
      "title": "Be positive.",
      "content": "Be positive. You will have setbacks. It's important not to beat yourself up over these things. Get through the setback and then get back on track with your diet and exercise. [26] X Research source For example, if you sleep in and miss going for a run on Monday, don't give up on your whole week. Just get back on schedule and make sure you don't miss your next scheduled exercise session."
    },
    {
      "title": "Find a friend",
      "content": "Find a friend to work out with you. Having a workout buddy can keep you accountable and more likely to stick to your routine. They can also help make working out more fun. Just make sure they're as motivated as you are! Make sure that you don't use their lack of motivation as an excuse for your own if your friend cancels on your workout sessions."
    },
    {
      "title": "Keep learning.",
      "content": "Keep learning. Always keep an eye out for new recipes and exercises so that you don't get bored with your current ones. Keeping yourself educated about healthy living techniques will help keep you inspired."
    }
  ]
}