{
  "url": "https://www.wikihow.com/Know-How-Many-Fish-You-Can-Place-in-a-Fish-Tank",
  "title": "How Many Fish Can You Place in a Fish Tank?",
  "steps": [
    {
      "title": "A popular guideline is 1 inch of fish per 1 gallon of water.",
      "content": "A popular guideline is 1 inch of fish per 1 gallon of water. Some experts believe that 1 inch of fish for every gallon of aquarium water (or 1 centimeter of fish for ever liter) is a sufficient amount, as long as you’re considering the fish’s adult size in your calculations. [1] X Research source Other fish experts find this guideline far too broad, and believe that fishkeepers should consider multiple factors (like fish size, total waste load, etc.) when planning to stock their aquarium. [2] X Research source If you do use the 1-inch guideline, make sure that you’re weighing other factors into your setup as well. Morton finds that “1 inch of fish per 2 gallons of water is a good rule.” [3] X Expert Source Craig Morton Aquarium Specialist, Aquarium Doctor Inc. Expert Interview. 21 July 2020. While the 1 inch per 1-gallon rule (or 1 centimeter per 1-liter rule) can make sense with smaller fish, it doesn’t make as much sense with really large species (like the Oscar, which can grow to be 10 to 12 in (25 to 30 cm). To give your aquarium the best chance at success, it helps to do as much planning and research as possible."
    },
    {
      "title": "Swimming space",
      "content": "Swimming space Fish need plenty of room to swim comfortably in their tank—so, the more fish you’d like to care for, the more tank space you’ll need. A 20 US gal (76 L) tank is a good starting point for beginner fishkeepers, with 10 US gal (38 L) being the absolute minimum. [4] X Research source Plenty of shops may sell really tiny aquariums (like 1 US gal (3.8 L)). Never buy these tiny tanks for your own setup—they’re much too small for any sustainable aquarium ecosystem. Did you know? Small tanks are actually more challenging to manage than bigger ones. When dealing with less water, the ecosystem is more sensitive and liable to change quickly."
    },
    {
      "title": "Filtration",
      "content": "Filtration Having a mechanical filter is an important part of any successful aquarium setup—but so is the number of aquarium plants you have in your tank (real ones, not fake). Aquarium plants naturally soak up the fish waste as a food source, which helps improve the water quality. [5] X Research source If you plan on having tons of plants in your aquarium setup , you’ll likely be able to manage more fish."
    },
    {
      "title": "Maintenance schedule",
      "content": "Maintenance schedule The more often you’re willing to clean your tank , the more fish you’re able to have. As is the case with many aspects of fishkeeping, there’s no “perfect” maintenance schedule—it ultimately depends on your personal schedule and the type of fish you have. Changing the water frequently helps offset the waste load of the fish and keeps the aquarium ecosystem in tip-top shape. [6] X Research source If you don’t have the time or energy to manage weekly water changes, you might prefer a lower-maintenance, less busy aquarium setup. Your maintenance schedule may depend on the type of fish you have, too. For betta fish specifically, Morton mentions how “unfiltered bowls should have 30-50% of the water changed and filtered every week, while filtered tanks should have 20-25% of the water changed every week.” [7] X Expert Source Craig Morton Aquarium Specialist, Aquarium Doctor Inc. Expert Interview. 21 July 2020."
    },
    {
      "title": "Tank surface area",
      "content": "Tank surface area Like us, fish need oxygen to breathe and stay healthy. [8] X Research source The more surface area (length x width) your tank has, the more oxygen your fish have access to. [9] X Research source While tank volume is still an important factor to consider, the surface area is just as vital (if not more so). [10] X Research source"
    },
    {
      "title": "Fish size",
      "content": "Fish size The “1 inch per 1 gallon of water” (or “1 centimeter per 1 liter of water) rule is all well and good when you’re dealing with tiny fish—but what if you’re interested in adding some pretty big boys into your aquarium? It’s important to research the adult sizes of your desired fish breeds, so you can know what to expect further down the line. [11] X Research source For instance, a goldfish can grow to be around 1 ft (30 cm) long. By the 1 inch rule, a 10 in (25 cm) goldfish should be able to fit in a 10 US gal (38 L) tank. This isn’t true at all, though—for goldfish, especially, you’d want a tank size that’s at least 6 times bigger than the length of your goldfish, which a 10 US gal (38 L) tank definitely wouldn’t be. [12] X Research source"
    },
    {
      "title": "Fish aggression levels",
      "content": "Fish aggression levels Like people, fish have different personalities and temperaments that may not be compatible with other fish. Take the betta fish, for example—bettas can get pretty territorial, so it wouldn’t necessarily be a good idea to add several of them to your tank. [13] X Research source"
    },
    {
      "title": "Fish habits",
      "content": "Fish habits Fish tend to hang out in different parts of the tank, which is helpful to keep in mind when planning your aquarium. For instance, you wouldn’t want to overload your tank with lots of bottom-feeding fish (like catfish or zebra loaches). [14] X Research source Similarly, you wouldn’t want to get a lot of fish that only swim around the top of the tank. Some fish instinctually swim in groups with other members of their own species, which is also known as “schooling.” Danios, tetras, raspboras, and other species especially prefer schooling, which is important to keep in mind as you plan your aquarium roster. For instance, you wouldn’t just add 1 neon tetra to your tank—you’d add multiple. [15] X Research source"
    },
    {
      "title": "Fish difficulty",
      "content": "Fish difficulty Some fish are more difficult to keep than others, and might make your aquarium setup more difficult to manage if you’re hoping to add a lot of fish. The discus, for instance, is known to be a tricky fish to manage, especially when it comes to breeding. [16] X Research source It may help to research the difficulty of your desired fish breeds before committing to an aquarium roster."
    },
    {
      "title": "Write a list of fish you’d like in your aquarium.",
      "content": "Write a list of fish you’d like in your aquarium. Are you hoping to fill your tank with beautiful freshwater fish (like tetras), or are you eyeing a saltwater setup? Make a list of the fish you’d most like to have in your aquarium, so you can start narrowing things down. Do a little research online and see what types of fish other fish hobbyists have in their aquariums. It might help to seek out fish that are more beginner-friendly, like the common goldfish, barbs, angelfish, or cory catfish. [17] X Research source"
    },
    {
      "title": "Choose fish that can thrive in similar tank conditions.",
      "content": "Choose fish that can thrive in similar tank conditions. There are lots of different fish out there with all sorts of feeding and environmental requirements. Once you’ve jotted down a list of fish you’d like to have in your aquarium, research the type of food and ideal living conditions they need. It doesn’t make sense to choose fish that have vastly different requirements. [18] X Research source"
    },
    {
      "title": "Set a realistic tank maintenance schedule for yourself.",
      "content": "Set a realistic tank maintenance schedule for yourself. Think about what an average week in the life looks like for you. What are your school/work commitments? Could you manage a weekly maintenance schedule, or does a low-key, monthly routine make more sense for your schedule? The more often you’re able to clean your tank, the more fish you can feasibly take on. [19] X Research source Aquarium specialist Morton suggests “changing 25% of the water every two weeks.” [20] X Expert Source Craig Morton Aquarium Specialist, Aquarium Doctor Inc. Expert Interview. 21 July 2020."
    },
    {
      "title": "Add your favorite fish to your aquarium first.",
      "content": "Add your favorite fish to your aquarium first. Don’t add any other fish at this time—just give these new fish time to adjust and get used to their new home. [21] X Research source"
    },
    {
      "title": "Test the nitrate levels over the next couple of weeks.",
      "content": "Test the nitrate levels over the next couple of weeks. Using a nitrate test kit , see how your tank fares in terms of cleanliness. Test your water a few times during this period, or at a frequency that makes the most sense to you. [22] X Research source"
    },
    {
      "title": "Add new fish if the nitrate levels are 40-45 ppm or less.",
      "content": "Add new fish if the nitrate levels are 40-45 ppm or less. Once your tank hits 40-45 ppm, you need to change the water to help cleanse the aquarium’s ecosystem. If the water is below that threshold, feel free to add some new fish to your tank. [23] X Research source Once you’ve added new fish, test the water levels for another couple of weeks to see if they hit the 40-45 ppm mark. If they pollute the water too much, consider this the max threshold for your tank. If you’d still like to add more fish, consider upgrading your aquarium setup to something larger, or changing your water more often."
    }
  ]
}