{
  "url": "https://www.wikihow.com/Help-Your-Girlfriend-with-Depression",
  "title": "How to Help Your Girlfriend with Depression",
  "steps": [
    {
      "title": "Listen, don't judge.",
      "content": "Listen, don't judge. Rather than jumping to offer advice about how your girlfriend can improve, or criticism about her feelings, let her know that you are ready to listen and offer support at any time. [1] X Research source Don’t belittle her feelings by saying things like “You’ve got to snap out of this” or “If you just focus on the positive, you’ll feel better.” Instead, ask how she is doing and feeling. Keep in mind that some forms of depression are episodic (related to some specific experience). Depression may also be chronic (long-lasting). If you haven't been dating your girlfriend long, you may not know what type of depression she has. Resist the urge to “fix” what she tells you. If you feel like you could help, ask “How can I help?” or “Would it be helpful to you if I called you in the morning?”"
    },
    {
      "title": "Practice small acts of kindness.",
      "content": "Practice small acts of kindness. Do something nice for your girlfriend, without telling her about it. Little things you can do everyday will lift your girlfriend’s spirits, especially if the depression is mild or episodic. Most of all, they’ll help her feel like she has real support from you. For instance, try things like: [2] X Research source Leaving a note to wish her a good day. Making her favorite dinner. Buying her flowers or another small gift she will enjoy. Walking her to class. Show plenty of physical affection, like long hugs. Reader Poll: We asked 502 wikiHow readers how they want their partner to comfort them, and 56% of them agreed that the best gesture is a sweet hug or tender touch. [Take Poll]"
    },
    {
      "title": "Help her find relaxing and positive activities.",
      "content": "Help her find relaxing and positive activities. Encourage your girlfriend to get involved in things she loves, and be ready to participate, too. This won’t erase depression, but it will help your girlfriend concentrate on positive things. Try things your girlfriend might enjoy, like: Host a board game night with a couple of friends. Go running together. Surprise her with a picnic on a nice day. Book her a day at the spa."
    },
    {
      "title": "Tell her that your feelings for her are separate from her depression.",
      "content": "Tell her that your feelings for her are separate from her depression. Depression can make a person feel worthless and unworthy of love, so help her see that's not the case for your relationship. Remind her of all the things you love and like about her, including those related to her depression. Consider if there are any parts of her personality that stem from the depression but make her who she is. For example, you might think your girlfriend is more creative or empathetic because of her depression. You could say, \"I can tell you are sensitive to others who are going through a tough time. I notice you offer encouragement to them even if you don’t know them well. Do you think your depression helps you see others in need?”"
    },
    {
      "title": "Point out her strengths.",
      "content": "Point out her strengths. Many people with depression tend to focus on negative things. Let her know that you see positive things about her. Remind her of her positive traits. For example, if she is kind to children, you could say something like, “You have a compassionate heart for children. They really respond to you.” You may even want to write them down so that she can read over them when you're not around."
    },
    {
      "title": "Offer to help out with little things.",
      "content": "Offer to help out with little things. Depression of any kind can make it hard to accomplish everyday tasks. Lend your girlfriend a hand by helping out with chores and whatever else she needs to get done, especially when she’s having a bad day. Try little (but helpful) things like: Getting her lunch. Picking up groceries for her. Taking her car to the carwash."
    },
    {
      "title": "Encourage her to think of depression as a medical issue.",
      "content": "Encourage her to think of depression as a medical issue. Don’t just think of depression as “feeling down.” Instead, stress that depression is a treatable, medical condition. Hearing this from someone she trusts can help empower your girlfriend to get help. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you don't know whether your girlfriend's depression is episodic or chronic, encourage her to see a doctor so she can get the kind of care she needs. Remind her to separate herself from the depression. For example, if she says things like “I”m depressed.” Help her reframe it by saying, “No, Cindy, you are someone who has depression. You are a kind, beautiful person who feels and experiences depression.”"
    },
    {
      "title": "Help her seek counseling or therapy.",
      "content": "Help her seek counseling or therapy. Even if your girlfriend wants to get help for long-term or serious depression, her condition can make actually doing so difficult. There are many ways that you can help her connect to therapy and other kinds of help. For instance: Offer to help her research different kinds of counseling, therapy, and medical treatments. Listen to her thoughts, concerns, and questions about these treatments. Offer to go with her to the doctor or counseling sessions. If she is working with a therapist she doesn’t seem to connect with, encourage her to find a new one."
    },
    {
      "title": "Help her stay accountable for treatment.",
      "content": "Help her stay accountable for treatment. Once your girlfriend begins treatment for long-term depression, it’s crucial that she sticks with it. Since you’re in a relationship with her, you’re in a position to help hold her accountable. Try things like: Creating a schedule to make sure she takes any medications her doctor prescribed. Offer to give reminders about when to take it, or to ask her if she did. Mark therapy appointments on a common calendar. Continue to ask her how she feels."
    },
    {
      "title": "Encourage her to participate in support groups.",
      "content": "Encourage her to participate in support groups. Resist the urge to be her sole source of social support, which can create an unhealthy relationship dynamic. Not only that, it's unfair for both of you. Instead, help her seek out groups that can help her connect with others who've shared a similar experience. Check out NAMI.org, Mental Health America, or the Depression and Bipolar Support Alliance at http://www.dbsalliance.org/ . Each of these resources has listings of support groups online and in real life."
    },
    {
      "title": "Offer to try Behavioral Couple Therapy (BCT).",
      "content": "Offer to try Behavioral Couple Therapy (BCT). Depression can take its toll on a relationship. If you and your girlfriend feel like the issue is causing problems in yours, you can try couples or relationship counseling. Behavioral Couple Therapy, for instance, is a developing form of counseling that can help couples learn to care for each other and reduce conflict. [4] X Research source"
    },
    {
      "title": "Recognize the signs of a serious problem.",
      "content": "Recognize the signs of a serious problem. Even if your girlfriend is undergoing treatment for her depression, she may be at risk of harming herself or others. If you see any of these warning signs, seek medical assistance immediately: Changes in behavior that last more than a few weeks (like avoiding friends or activities, changes in sleep habits, or abusing drugs or alcohol) Mentioning death or killing herself Seeming to prepare for death (giving things away, talking about saying good-bye to people, etc.)"
    },
    {
      "title": "Take her depression seriously.",
      "content": "Take her depression seriously. If your girlfriend seems depressed, recognize it as a problem. Don’t brush it off as something she should just “get over.” If she’s already getting treatment, don’t think that the problem is solved—continue to offer support. [5] X Research source This is especially the case for chronic depression. Those who have this form are prone to relapses, even if they appear to have been well for a while."
    },
    {
      "title": "Take care of yourself as well.",
      "content": "Take care of yourself as well. Caring for someone with depression can be hard on you, too. You can’t fully support your girlfriend if you aren’t at your best, so make sure to practice good self-care. [6] X Research source Make sure that you’re eating well, getting enough sleep, and generally taking care of yourself. Seek help yourself if you begin to experience depression or other health issues. Don’t engage in risky behavior, like drug or alcohol abuse, to help your girlfriend feel better. Keep living your own life. See your friends, go to work or school, and have fun."
    },
    {
      "title": "Don't take it personally.",
      "content": "Don't take it personally. People develop depression for a variety of complex reasons. It’s never as simple as saying that one thing or another “caused” someone’s depression. Don't fall into the trap of feeling like something you may have done caused your girlfriend’s depression. Instead, focus on her treatment and recovery. [7] X Research source"
    }
  ]
}