{
  "url": "https://www.wikihow.com/Make-KFC-Original-Fried-Chicken",
  "title": "How to Make KFC Original Fried Chicken",
  "steps": [
    {
      "title": "Blend all of the spices in a food processor until they're all the same size.",
      "content": "Blend all of the spices in a food processor until they're all the same size. This includes your celery salt, garlic salt, and kosher salt, as well as your dried herbs, ground black and white pepper, dried mustard, and paprika. Keep pulsing the ingredients until the herbs are broken up and the same size. [1] X Research source For a more authentic flavor, add 1/2 teaspoon of Accent Seasoning (MSG) for every 1 pound (0.45 kg) of chicken. MSG is a flavor enhancer, but it's not very healthy. If you can't find oregano or thyme, try marjoram and sage instead. [2] X Research source"
    },
    {
      "title": "Whisk the spice blend into the flour.",
      "content": "Whisk the spice blend into the flour. Pour the flour into a large dish, then add the spice blend. Whisk the ingredients together until everything is combined. Set the bowl aside for later. [3] X Research source [4] X Research source You'll be placing your chicken pieces in this. The bowl should be big enough to fit at least 1 chicken breast or 1 chicken thigh."
    },
    {
      "title": "Beat the egg and buttermilk in a separate bowl.",
      "content": "Beat the egg and buttermilk in a separate bowl. Do not add them to the bowl with the flour and spiced blend. Instead, crack the egg open into a different bowl, then add the buttermilk. Whisk the 2 ingredients together until the yolk has broken up and no streaks remain. [5] X Research source [6] X Research source Make sure that the bowl is deep enough to submerge all of your chicken pieces."
    },
    {
      "title": "Cut the chicken apart into 10 pieces.",
      "content": "Cut the chicken apart into 10 pieces. You will need: 2 wings, 2 legs (drumsticks), 2 thighs, and 2 breasts. Cut each chicken breast in half so that you have 4 breast pieces total. [7] X Research source Try to use a chicken that is around 3 pounds (1.4 kg). [8] X Research source You can also buy chicken pieces separately. For example, you could use 10 chicken breasts. Leave the skin on the chicken pieces. This will make it nice and crispy."
    },
    {
      "title": "Marinate the chicken in the buttermilk for 20 to 60 minutes.",
      "content": "Marinate the chicken in the buttermilk for 20 to 60 minutes. If you are short on time, then 20 to 30 minutes will do just fine. [9] X Research source A full hour would be much better however. Be sure to marinate the chicken on the counter; if you put it into the fridge, the cold meat will decrease the temperature of the hot oil. [10] X Research source Cover the dish with plastic wrap to keep the marinade from spoiling. If it is very hot in your kitchen, then you could marinate the chicken in the fridge at first, then halfway through the marinating time, transfer it to the counter."
    },
    {
      "title": "Dredge the chicken through the flour-spice blend.",
      "content": "Dredge the chicken through the flour-spice blend. Take a piece of chicken out of the buttermilk, and let the excess mixture drip off. Place the chicken into the spice-flour blend, then flip it over so that both sides get covered. Transfer the chicken to a baking sheet. [11] X Research source Repeat this step for each piece of chicken. Work 1 piece at a time. Keep the chicken pieces in the buttermilk until you are ready to dredge them."
    },
    {
      "title": "Let the chicken pieces rest on the baking sheet for about 5 minutes.",
      "content": "Let the chicken pieces rest on the baking sheet for about 5 minutes. Discard any leftover spiced flour. It came into contact with raw meat, so it is no longer safe to use. Be sure to discard any leftover buttermilk marinade; it's been contaminated by raw meat, so you can't reuse it."
    },
    {
      "title": "Fill a pot or deep fryer with at least 5 inches (13 cm) of vegetable oil.",
      "content": "Fill a pot or deep fryer with at least 5 inches (13 cm) of vegetable oil. The oil needs to be deep enough so that you can submerge the chicken pieces. [12] X Research source Plan on using about 2 quarts (1.9 L) of oil. You can use another neutral-tasting oil. Avoid olive oil, however, as the flavor is too intense."
    },
    {
      "title": "Heat the oil over medium-high heat until it is 350 °F (177 °C).",
      "content": "Heat the oil over medium-high heat until it is 350 °F (177 °C). This may take a few minutes, but do not step away from the fryer. Once the oil starts to heat up, the temperature will rise rapidly. Use a candy-making or oil thermometer to keep track of the oil's temperature. [13] X Research source If you don't have a thermometer, stick a wooden spoon handle into the oil. The oil is ready once you start to see bubbles around the handle. [14] X Research source"
    },
    {
      "title": "Fry the chicken in batches for 12 to 18 minutes.",
      "content": "Fry the chicken in batches for 12 to 18 minutes. The breasts and wings will be ready in about 12 to 14 minutes. The legs and thighs will take about 15 to 18 minutes. [15] X Research source Check the internal temperature, the chicken is done when the internal temperature reads 165 °F (74 °C). Use a meat thermometer to gauge the temperature. The oil should be deep enough to ensure even frying, so there's no need to turn the chicken pieces. Make the chicken easier to remove by placing the chicken into a fryer basket, do not overcrowd the basket, then dipping the basket into the hot oil."
    },
    {
      "title": "Use a pair of metal tongs to transfer the chicken to a wire cooling rack.",
      "content": "Use a pair of metal tongs to transfer the chicken to a wire cooling rack. To help keep your counter clean, place a baking sheet under the cooling rack to catch any oil drips. Once the chicken has cooled off to room-temperature, it's ready to serve! [16] X Research source Don't put the chicken on top of newspaper or paper towels. This will trap the steam in, causing the chicken to go soft. If you used a fryer basket, lift it out and hook it over the edge of the deep fryer. Use tongs to pull the chicken pieces out."
    }
  ]
}