{
  "url": "https://www.wikihow.com/Keep-Car-Doors-from-Freezing-Shut",
  "title": "How to Keep Car Doors from Freezing Shut",
  "steps": [
    {
      "title": "Avoid weather effects.",
      "content": "Avoid weather effects. The typical cause of car doors and car locks freezing shut is ice. When icing conditions are predicted — rain near the freezing point, freezing rain, freezing fog, or rain and snow — get your vehicle under cover. Another possible cause is frigid weather, which may cause locks and car doors to freeze without a lot of moisture causing the problem. Of course, not everyone has access to a covered parking space, heated garage, or the like. Avoid locking your doors. If possible, keep doors unlocked. This will avoid the locking mechanism from locking into place. However, leaving the doors unlocked may allow the car to be entered by a thief. Do not leave any valuables in the vehicle if you plan on leaving it unlocked. Place duct tape over your door lock to keep it from freezing. If your car is parked outside, a car cover or tarp minimizes the amount of moisture from snow and rain that can reach the door parts and freeze.This is especially useful during an ice storm or other icing event."
    },
    {
      "title": "Replace torn or missing rubber gaskets.",
      "content": "Replace torn or missing rubber gaskets. The rubber gasket, or seal, along the edge of the car door is the area that freezes, not the metal itself. Inspect the seal on each car door and around each window. Visit an auto parts store to purchase replacements if you notice tears or gaps where water could seep in."
    },
    {
      "title": "Wipe down the door frame.",
      "content": "Wipe down the door frame. Clean the entire door frame to remove road debris and other detritus that can build up over time. Water can collect around the dirt and freeze the door shut once the temperatures drop."
    },
    {
      "title": "Coat the rubber with a protective liquid.",
      "content": "Coat the rubber with a protective liquid. Rub oil or lubricant over the rubber seals with a paper towel. This will repel water, reducing the amount that enters the seal and freezes. There is some disagreement over which oil is best to use, but here are a few options: A rubber conditioner or rubber care product are probably the safest options for long-term care. Silicone spray lubricant can last several weeks per application, but it can damage foam rubber seals and should be kept away from paint. [1] X Research source WD40, another light lubricating oil, or even nonstick cooking spray are easily available options, but repeated use can dry out or disintegrate the rubber. [2] X Research source"
    },
    {
      "title": "Rub the key and lock with rubbing alcohol.",
      "content": "Rub the key and lock with rubbing alcohol. Choose a rubbing alcohol that contains at least 60% alcohol, so the alcohol will adhere to the lock and prevent moisture from freezing over it. Rub it onto the key and the door lock with a paper towel once per week to prevent ice from forming. This can also work to melt existing ice, but is typically slower than the methods below. Petroleum jelly is another option, but may leave a messy residue on your equipment."
    },
    {
      "title": "Spray a lock lubricant for severe problems.",
      "content": "Spray a lock lubricant for severe problems. If rubbing alcohol is not enough to keep your lock usable, select a lock lubricant. Even experts tend to have differing opinions about lubricant choices, but some options are recommended more often than others. Use only one of the following options per lock, since a mix could easily gum it up: [3] X Research source [4] X Research source A graphite lubricant typically comes in a squeeze bottle of air that can be pressed directly into the keyhole. Some people find this can absorb moisture over time and leave gunk on the key. Teflon-based lubricant is often recommended, but some people consider the products that contain silicone messy and ineffective. Greaseless lubricants are supposed to attract less dust and debris."
    },
    {
      "title": "Spray frozen locks with a de-icer.",
      "content": "Spray frozen locks with a de-icer. Keep a de-icer product in your garage or winter jacket, in case you are frozen out of your car. These are typically sprayed directly onto the lock, and are the most effective option in severe ice conditions. Choose the lock with the least amount of ice buildup, spray, and insert the key."
    },
    {
      "title": "Heat the key.",
      "content": "Heat the key. Hold the key with an oven mitt or tongs, with the toothed tip over a lighter or match, then insert it in the lock. If the key is completely metal, with no plastic handle or computerized fob, you can safely heat the key while it is inserted in the lock. This is not common a practice in cold climates; and there are other, safer alternatives for you and your vehicle. This should only be attempted if no other alternatives are available. Do not do this with a key with a computerized chip. This may easily damage the electronics, and replacements can costs hundreds of dollars."
    },
    {
      "title": "Warm the lock with a hairdryer or your own breath.",
      "content": "Warm the lock with a hairdryer or your own breath. This method is less effective, but worth a try if no other options are available. A cardboard tube (such as an empty toilet paper tube) placed over the frozen lock will help direct the warm air. Keep trying for several minutes, especially if you do not have a tube or if conditions are windy. If your car is outside, use a battery-operated hair dryer, or an extension cord rated for outdoor use."
    }
  ]
}