{
  "url": "https://www.wikihow.com/How-Long-Do-9-Holes-of-Golf-Take",
  "title": "How Long It Takes to Play 9 Holes of Golf & What Affects Times",
  "steps": [
    {
      "title": "1 ½–2 hours for 1 player",
      "content": "1 ½–2 hours for 1 player If you’re at an average skill level and play at a standard pace, you’ll normally get through the course within 2 hours, which is about 13 minutes per hole. That makes playing 9 holes the perfect activity for when you have a couple of hours to kill or if you want to hit the course before it gets dark after a long day at work. For 2 players, expect to spend up to 2¼ hours to play 9 holes (or 2¾ hours if you're not using a golf cart). For 3 players, it may take up to 2 hours and 45 minutes to finish your golf game. With 4 people in your group, it could take 3½ hours to play through 9 holes since you have to wait for everyone else to finish before you move onto the next hole. Some courses also set pace limits to ensure you don’t spend too long on a hole or hold up other groups behind you. [1] X Research source"
    },
    {
      "title": "Player skill level",
      "content": "Player skill level If you’re an experienced golfer, you already know the correct technique for driving the ball and sinking tough shots on the green, so you’ll be able to move through the course faster. If you just started golfing or don’t have a lot of experience, then it may take you a little longer to line up your shots and move the ball toward the hole. [2] X Research source Take time to improve your golf game in between rounds. Practice your swing at the driving range, line up putts on a putting green, or ask someone at the course clubhouse if they have coaches that can teach you."
    },
    {
      "title": "Other players on the course",
      "content": "Other players on the course When you don’t have any groups playing ahead of you, you’re free to move onto the next hole and drive right away. If you’re at the course on a busy day, then you may have to wait for a group to finish the hole before teeing off. [3] X Research source If you have a larger group, let smaller, faster groups “play through” if they come up behind you. That way, they can continue moving at a steady pace as you take a little more time."
    },
    {
      "title": "Walking the course",
      "content": "Walking the course While most courses offer golf carts to quickly get to your ball, you may choose to walk to get more of a workout instead. Walking typically adds about 15–30 minutes to your total play time, but it may vary depending on how well you hit the ball. [4] X Research source"
    },
    {
      "title": "Course size",
      "content": "Course size Since par-3 courses tend to have shorter distances from the tee to the hole, your golf game may be 20–30 minutes shorter than the average time. If you’re playing a course that’s par-4 or par-5, each hole may take a few minutes longer since they have longer fairways. [5] X Research source If the golf course is longer than 7,000 yards (6,400 m), then it will usually take 2 ½ hours or longer to play."
    },
    {
      "title": "Course difficulty",
      "content": "Course difficulty If the course has a lot of water hazards or bunkers, there’s a greater chance of losing a ball or getting caught in the sand. Any time your ball lands in one of the hazards, it’ll add an extra few minutes to your play time as you try to get back onto the fairway or green."
    },
    {
      "title": "Bad weather",
      "content": "Bad weather Most golf courses will stop you from playing and delay your game if there are storms nearby. As a standard rule of thumb, if lightning strikes and you hear thunder within 30 seconds, then the course will delay your golf game until at least 30 minutes after the last lightning bolt. Check the weather before you head to the golf course to make sure that there isn’t a chance of rain, strong winds, or other severe weather."
    },
    {
      "title": "Create a 20-second time limit for all players.",
      "content": "Create a 20-second time limit for all players. Whether you're playing by yourself or in a group, set a timer for 20 seconds whenever someone takes their turn on the green—this includes picking a club and taking a practice swing. The faster you all go, the quicker the game can progress. [6] X Research source"
    },
    {
      "title": "Drive golf carts if they’re available.",
      "content": "Drive golf carts if they’re available. Ask the employee at the clubhouse to rent a golf cart for your game so you can quickly search for your ball after each stroke. Golf cart rentals for your game usually cost $10–20 USD and they can shave up to 30 minutes off of your total play time. [7] X Research source When you drive a golf cart , be sure to stay on marked paths and avoid bringing it up onto the green."
    },
    {
      "title": "Follow the \"buddy system\" if you use a golf cart.",
      "content": "Follow the \"buddy system\" if you use a golf cart. Instead of hanging out in the cart while your partner or group member takes their turn, walk out to your ball (while bringing a couple of clubs along with you). Then, take your shot as soon as your turn rolls around and wait for your buddy to drive over and pick you up. [8] X Research source Alternatively, take the golf cart over to your ball while your partner or group member takes their turn. Once you've taken your shot, drive back over to them and pick them up."
    },
    {
      "title": "Try “Ready Golf” if you have multiple players.",
      "content": "Try “Ready Golf” if you have multiple players. When you play a standard golf game, the person furthest from the hole normally shoots first, but it may make your game go slower. After teeing off, immediately go look for your ball and take your swing as soon as you’re ready. That way, you’re not waiting for one person to search for their ball before you shoot the ball. [9] X Research source Before you swing, just make sure there’s nobody between you and the hole to ensure you don’t hit anyone with your golf ball. If the ball slices toward someone, shout “Fore!” loudly so the person knows to watch out."
    },
    {
      "title": "Schedule a tee time to ensure you start right away.",
      "content": "Schedule a tee time to ensure you start right away. Call the golf course earlier in the week and ask what times are available to start golfing. Choose one of the available tee times for your group and arrive at least 15 minutes early to ensure you’re ready to tee off right at your start time. [10] X Research source Many golf courses schedule their tee times at regular intervals to keep golfers moving at a steady pace. They also plan ahead so if you take the last tee time of the day, you’ll be able to finish before it gets dark."
    },
    {
      "title": "Play from the appropriate tee for your handicap.",
      "content": "Play from the appropriate tee for your handicap. Calculate your handicap using any past golf scores you have. When you reach the tee box for each hole, check which tee to use based on your handicap. If you’re a less experienced golfer, use the tee box closest to the hole. If you have more experience, then it’s okay to start at one of the tees further back. [11] X Research source"
    },
    {
      "title": "Avoid taking mulligans.",
      "content": "Avoid taking mulligans. Mulligans are basically do-overs when you’re not happy with your last shot, but taking them makes you stall your game. Rather than redoing your shot, just accept the first one you took and keep moving toward the green. If you’re struggling to hit the ball to a good spot, take a “gimme.” Pick up your ball and move it up closer to the green or next to other players in your group. Count picking up the ball as a stroke and just continue the game from there."
    },
    {
      "title": "Spend 3 minutes or less looking for lost balls.",
      "content": "Spend 3 minutes or less looking for lost balls. If you lost your ball in the rough or aren’t sure of where it landed, only spend a few minutes looking for it. If you’re not able to find the ball within that time, then take a second golf ball and drop it somewhere nearby and take your swing. [12] X Research source If you’re playing with another person, ask them to help you search for your ball if they’ve already taken their next shot. If you’re playing in a tournament or professional game, then you may need to add an extra stroke to your score for losing a ball."
    }
  ]
}