{
  "url": "https://www.wikihow.com/Get-a-Girl-to-Like-You-when-She-Has-a-Crush-on-Someone-Else",
  "title": "How to Get a Girl to Like You When She Has a Crush on Someone Else",
  "steps": [
    {
      "title": "Think about what her crush is like.",
      "content": "Think about what her crush is like. If you know the guy she has a crush on, stop and take an inventory of what traits he possesses. Is he the athletic type? Does he have a particular talent, like art or music? Is he brainy with straight As? Learning more about her crush can tell you a lot about what she looks for in a guy. Think about what the other guy is like and whether there’s a possibility that she could like you for the same reasons without you having to change your personality. Find out what other people have to say about the guy she has a crush on. If you go to school with him, ask people that know him what kind of person he is, what they like about him, etc. She may like nice guys, or she may be more attracted to the “bad boy” type."
    },
    {
      "title": "Talk to her friends.",
      "content": "Talk to her friends. Get to know the people she hangs out with and see what they’re like. Most likely, the qualities she looks for in choosing friends are the same ones that determine who she likes. Find out what you have in common with her clique. If things go well, your crush’s friends may become your friends, too, which means you’ll be able to spend more time around her. [1] X Research source When talking to your crush’s friends, casually bring up the subject of what kinds of guys she normally falls for, and how she feels about you. If they like you, they’ll be willing to give you helpful advice about how to win her over. Try not to act like you’re interrogating them. You’re trying to find out more about her by talking to her friends. If they feel like you’ve got ulterior motives or you’re being dishonest, you may end up doing more harm than good."
    },
    {
      "title": "Study her habits.",
      "content": "Study her habits. Pay attention to the things she likes to do. Is she studious or social? Where does she like to hang out, and who does she hang out with? What type of music does she listen to? You’re looking for clues that will tell you more about what she’s into so that you can find ways to relate to her. Start taking notice of things she gets excited about, or that she finds uninteresting. This will help you decide what sorts of subjects to talk about the next time you’re around her. [2] X Research source Be observant, but don’t be a stalker. There’s a difference between noticing details about her personality and spying on her."
    },
    {
      "title": "Review your own attributes.",
      "content": "Review your own attributes. Use your newfound knowledge of the kind of guys she likes and what she looks for in a friend to tell you how you should present yourself to her in the future. If you want her to like you, the first thing you need to do is grab her attention by making her feel like you’re someone she wants to get to know. This doesn’t require that you change who you are, but it may allow you to play up one aspect of your character or another that you think she’ll be attracted to. [3] X Research source Don’t try to be someone you’re not. There’s no use changing yourself to get someone to like you because even if you succeed you may not be happy with yourself anymore. Instead, look for existing similarities between the two of you and focus on showing her what you already have in common. Take this time to think about what you do and don’t like about yourself. If there’s some area where you feel you need improvement, now is a good opportunity to change it. Likewise, if there’s some feature of yourself that you’re especially proud of, show this off to her. You want to highlight the positive and minimize or downplay the negative. Spend time doing things you love and living an interesting life. You don't want to come across as desperate, and you've got a lot going for you besides this girl! [4] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021."
    },
    {
      "title": "Be more like her crush.",
      "content": "Be more like her crush. You don’t have to outright emulate him, but you can try to act more like him in certain ways that she’ll respond to. If she’s drawn to jocks, start practicing a sport or try out for a school team. If she likes guys in bands, pick up an instrument. Not only will you be winning favor with her, it will also give you a chance to acquire new skills and interests. [5] X Research source Rather than trying to beat him at his own game, think about ways that you and her crush are alike but also qualities you have that he doesn’t. Keep it from becoming a direct competition and make yourself the obvious choice by being more well-rounded. Girls are sometimes attracted to jerks because they think a guy must have a lot going for him to treat other people with disrespect. This isn’t the case, and it’s one way you definitely don’t want to be like her crush."
    },
    {
      "title": "Take care of your body.",
      "content": "Take care of your body. Like it or not, physical attraction is all about how you look. If you want to look good for the girl you’re trying to impress, you need to put some effort into eating right, exercising and looking after your physique. Start performing a few simple workouts during the week, and choose healthier nutrition options over junk food. You’ll start to look and feel better, and your hard work won’t go unnoticed. [6] X Research source Basic exercises like push ups, pull ups, dips and squats can help you build muscle mass and are convenient to perform because they don’t require training equipment. Incorporate a few sets of calisthenic exercises into your daily training routine. You can also jog or swim a few miles a couple times a week to stay trim and in good shape. [7] X Research source Lose the pizza, chips and soda and eat more whole foods containing a proper balance of protein, carbohydrates, fiber and fats. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Wear clothes that make you feel good.",
      "content": "Wear clothes that make you feel good. When you look good, you feel good. Put a little extra thought into your wardrobe choices every morning. Pick out clothes that are comfortable and stylish and look good on you. Clothes are often the first thing people notice about you when they see you frequently, so make sure you look sharp when the girl you like is around. [9] X Research source Accessorize for each individual outfit with the right belt, shoes, watch or hat. People who know how to dress well always stand out."
    },
    {
      "title": "Display confidence.",
      "content": "Display confidence. It’s a fact of life that confident people are well-liked. To up your confidence level, put your best foot forward and let people see what makes you unique. Take pride in your appearance. Concentrate on displaying the best parts of your personality, like your sense of humor or intellect. If you have a special talent, show it off. You should make it a point to always be comfortable with yourself in any situation. When you seem confident, fun and inviting, others will naturally gravitate to you. [10] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021. [11] X Research source One of the most effective tricks for keeping your confidence up is to constantly reaffirm yourself. Remind yourself of your best traits and reinforce these in your mind while learning to overlook your shortcomings. Don’t be afraid to laugh at yourself when you make a mistake. People love someone who doesn’t take himself too seriously."
    },
    {
      "title": "Be outgoing around her.",
      "content": "Be outgoing around her. Put your most sociable side on display. Talk to the people around you, make new friends and laugh. Make sure you’re with your friends when she’s around and always be ready with a kind word or helping hand. She’ll see that you’re a popular guy who people like and will want to be around you herself. [12] X Research source You don’t have to be an extrovert to be a people-person. Just smile and be friendly to everyone you meet. Those around you will be drawn to your charm. Aim to be a genuinely likable person. Don’t just pretend to be nice when she’s watching in order to impress her."
    },
    {
      "title": "Participate in activities she’s involved with.",
      "content": "Participate in activities she’s involved with. See about taking part in things that she likes to do. There are all sorts of clubs and teams at school you could join, or it might be as simple as discovering what her hobbies are and arranging to run into her at the right time and place. The more common ground she knows you share, the easier it will be for the two of you to become friends. Another benefit of finding ways to be around her is that you’ll be more present in her mind than the guy she likes, giving you more opportunity to get her to like you. People who share passions tend to form strong bonds. Find out what’s especially important to her and see how your passions and interests align. You may learn that you have much more in common than you originally thought."
    },
    {
      "title": "Bring your friend groups together.",
      "content": "Bring your friend groups together. One of the best ways to get more face time with the girl you like is to create circumstances in which you’re hanging out with the same people. Become acquainted with her friends and introduce them to your own. Strike up a mutual friendship between your social circles so that more of your time is spent around her and her friends. Once she’s a part of your group, you can begin to work on singling out her attention. [13] X Research source Avoid social settings where her crush or his friends happen to be around."
    },
    {
      "title": "Talk to her one-on-one.",
      "content": "Talk to her one-on-one. Make an effort to talk to her on a more personal level. Say hello to her when you pass her in the hallway or see her talking with someone you know to make an initial pass at conversation. Try to get to the point where she’s comfortable hanging out with you without other people around. [14] X Research source If her crush is still just a crush, it probably means he’s unaware that she likes him or hasn’t acted on it. Crushes fade eventually, so be patient. [15] X Expert Source Suzanna Mathews Dating & Relationship Coach Expert Interview. 18 August 2021. When the time is right, ask her about her personal life. If she doesn’t mention that he has a crush on anybody else, it’s probably a sign that she likes you."
    },
    {
      "title": "Give her your attention.",
      "content": "Give her your attention. Don’t try to hide the fact that you like her. Take an interest in her and gradually make your feelings known. As your relationship blossoms, she’ll come to value having someone to talk to that cares about what she has to say. Be your best self around her and give her a reason to forget about the other guy. [16] X Research source Be careful about coming on too strong. Stick to being casual friends at first and leave her wanting more. Giving her your attention is also about capturing hers. The goal is to insulate her from her crush and get her to realize how she feels about you."
    }
  ]
}