{
  "url": "https://www.wikihow.com/Install-Windows-8-on-an-Android-Tablet",
  "title": "How to Install Windows 8 on an Android Tablet",
  "steps": [
    {
      "title": "Open your tablet's Google Play Store.",
      "content": "Open your tablet's Google Play Store. This app resembles a multicolored \"Play\" button on a white background."
    },
    {
      "title": "Tap the search bar.",
      "content": "Tap the search bar. It should be at the top of the screen."
    },
    {
      "title": "Type in limbo pc emulator.",
      "content": "Type in limbo pc emulator . This will search the Play Store for the Limbo emulator app."
    },
    {
      "title": "Tap Limbo PC Emulator QEMU ARM x86.",
      "content": "Tap Limbo PC Emulator QEMU ARM x86 . It's at the top of the drop-down menu below the search bar. Doing so takes you to the Limbo download page."
    },
    {
      "title": "Tap INSTALL.",
      "content": "Tap INSTALL . This green button is on the far-right side of the screen."
    },
    {
      "title": "Tap ACCEPT when prompted.",
      "content": "Tap ACCEPT when prompted. Doing so will allow Limbo to download onto your tablet."
    },
    {
      "title": "Allow Limbo to download.",
      "content": "Allow Limbo to download. Limbo is a small app, so you can proceed with downloading the Windows 8 file while Limbo finishes downloading."
    },
    {
      "title": "Enable downloads from unknown sources.",
      "content": "Enable downloads from unknown sources. This will allow you to download and install programs from websites rather than having to go through the Google Play Store: [1] X Research source Open Settings Tap Security or Lock screen and security Tap the grey \"Unknown sources\" switch Tap OK if prompted."
    },
    {
      "title": "Open a web browser.",
      "content": "Open a web browser. Tap your preferred web browser's app icon (e.g., Chrome ) to do so."
    },
    {
      "title": "Open the Windows 8 ISO site.",
      "content": "Open the Windows 8 ISO site. Go to https://www.microsoft.com/en-us/software-download/windows8 in your tablet's browser."
    },
    {
      "title": "Scroll down and select an operating system.",
      "content": "Scroll down and select an operating system. Tap the \"Select edition\" drop-down box, tap Windows 8.1 in the drop-down menu, and tap the blue Confirm button below the edition."
    },
    {
      "title": "Scroll down and select a language.",
      "content": "Scroll down and select a language. Tap the \"Choose one\" drop-down box, tap your preferred language, and tap Confirm ."
    },
    {
      "title": "Tap 32-Bit Download or 64-Bit Download.",
      "content": "Tap 32-Bit Download or 64-Bit Download . It's a blue button near the bottom of the page. Doing so will prompt the Windows 8 file to begin downloading onto your tablet's SD card. The download may take upward of an hour to complete, so just make sure that your tablet is connected to the Internet and plugged into a power source."
    },
    {
      "title": "Wait for the download to complete.",
      "content": "Wait for the download to complete. Once it does, you can proceed with adding the Windows 8 file to the Limbo folder."
    },
    {
      "title": "Open your file explorer app.",
      "content": "Open your file explorer app. Depending on your tablet's manufacturer, this app's name will vary. If you don't have a built-in file explorer app, you can download one from the Google Play Store. ES File Manager is a popular free choice."
    },
    {
      "title": "Go to the Windows 8 file.",
      "content": "Go to the Windows 8 file. Tap the storage location to which the Windows 8 file was downloaded. In most cases, this will be a folder entitled Downloads that's in the \"Internal Storage\" or \"SD Card\" folder."
    },
    {
      "title": "Tap and hold the Windows 8 file.",
      "content": "Tap and hold the Windows 8 file. Doing so will prompt a menu or options to appear."
    },
    {
      "title": "Tap Copy or Move.",
      "content": "Tap Copy or Move . You should see one of these options either in a pop-up menu, or at the bottom or top of the screen. You may first have to tap ⋮ in one of the tablet's corners to select Copy or Move ."
    },
    {
      "title": "Find the limbo folder.",
      "content": "Find the limbo folder. Go back to the main page of the file explorer app, select your tablet's Internal Storage , and tap the limbo folder. If you can't find limbo in the internal storage, try the SD Card option. You may also need to restart your tablet before the limbo folder shows up. If you selected the Move option, you will be prompted to select a destination folder."
    },
    {
      "title": "Tap Paste or Move.",
      "content": "Tap Paste or Move . Again, you'll either see this option in a pop-up menu or at the top/bottom of the screen, or you'll need to tap ⋮ to see this option. Doing so will place the Windows 8 ISO file in the limbo folder. Once the copying/moving completes, you'll be able to run Windows 8."
    },
    {
      "title": "Open Limbo.",
      "content": "Open Limbo. Tap the computer-shaped Limbo app icon to do so."
    },
    {
      "title": "Tap I Acknowledge when prompted.",
      "content": "Tap I Acknowledge when prompted. It's at the bottom of the screen."
    },
    {
      "title": "Tap OK when prompted.",
      "content": "Tap OK when prompted. Doing so will bring you to the main Limbo page. The pop-up window on which you have to select OK is usually a list of version notes, so you don't have to read the window here."
    },
    {
      "title": "Tap the \"Load Machine\" drop-down box .",
      "content": "Tap the \"Load Machine\" drop-down box . It's in the upper-right side of the screen. A drop-down menu will appear. This box will likely say None in it."
    },
    {
      "title": "Check the New box.",
      "content": "Check the New box. You'll find this in the drop-down menu. Doing so opens a window."
    },
    {
      "title": "Enter a name.",
      "content": "Enter a name. Type in a name (e.g., windows 8 ) for your operating system."
    },
    {
      "title": "Tap CREATE.",
      "content": "Tap CREATE . It's at the bottom of the window. This will select Windows 8 as your operating system."
    },
    {
      "title": "Change the CPU model option.",
      "content": "Change the CPU model option. Tap the \"CPU Model\" drop-down icon, then tap qemu32 (32-bit) or qemu64 (64-bit) in the drop-down menu. [2] X Research source"
    },
    {
      "title": "Select a RAM option.",
      "content": "Select a RAM option. Tap the \"RAM Memory (MB)\" drop-down icon, then tap at least 1024 for 32-bit or 2048 for 64-bit. [3] X Research source If your tablet can handle more RAM, consider tapping 4096 here instead."
    },
    {
      "title": "Check the \"Hard Disk A\" box.",
      "content": "Check the \"Hard Disk A\" box. It's in the \"Storage\" section of this page, though you may need to scroll down a bit to see it."
    },
    {
      "title": "Tap the \"Hard Disk A\" drop-down icon.",
      "content": "Tap the \"Hard Disk A\" drop-down icon. It's to the right of the \"Hard Disk A\" heading. A drop-down menu will appear. [4] X Research source"
    },
    {
      "title": "Tap OPEN.",
      "content": "Tap OPEN . This option is in the menu. Doing so will open a list of your tablet's internal storage folders."
    },
    {
      "title": "Select the Windows 8 file.",
      "content": "Select the Windows 8 file. Scroll down and tap limbo , then find the Windows 8 file and tap it to select it. You may need to tap a checkmark ✓ or a button (e.g., OPEN or OK ) to confirm this choice."
    },
    {
      "title": "Scroll down and check the \"Fullscreen\" box.",
      "content": "Scroll down and check the \"Fullscreen\" box. It's in the \"User interface\" section of the page. Once you've selected this final option, you're free to run Windows 8."
    },
    {
      "title": "Scroll up and tap the \"Play\" button.",
      "content": "Scroll up and tap the \"Play\" button. This is the triangle-shaped icon at the top of the Limbo page. Doing so will prompt Windows 8 to begin running on your tablet. Keep in mind that your tablet will run quite slowly during this time."
    }
  ]
}