{
  "url": "https://www.wikihow.com/Justify-Text-in-Photoshop",
  "title": "How to Justify Text in Photoshop",
  "steps": [
    {
      "title": "Click on the “text tool.”",
      "content": "Click on the “text tool.” Within your Photoshop document, click on the text tool that looks like a capital “T” in the tools palette. Click on the layer of the text you want to justify in the layers panel. Then, select the text tool by clicking the T in the tool menu or pressing the \"T\" shortcut. You can choose either the horizontal Type tool or the Vertical Type tool. [1] X Research source View the Paragraph panel by clicking the A icon or going to the windows menu and clicking \"Paragraph.\" [2] X Research source You can also click on the Paragraph panel tab if the panel is visible, but it’s not active. [3] X Research source"
    },
    {
      "title": "Set options with numeric values in the Paragraph panel.",
      "content": "Set options with numeric values in the Paragraph panel. You can use the up and down arrows or you can edit the value directly in the text box. Press enter or return to apply a value when you edit a value directly. Press shift plus enter or shift plus return to apply a value and highlight the value just edited or press tab to apply a value and move to the next text box in the panel. Then click on the text you want to edit, which should make a box appear around the text."
    },
    {
      "title": "Select all of the text you want to justify.",
      "content": "Select all of the text you want to justify. Do this by clicking and dragging or pressing ctrl+a (windows)/cmd+a (mac). Then go to the paragraph panel [4] X Research source and select how you want to justify your text by clicking on the icons. Click and drag a marquee covering the area you want your text to appear in. This creates a new text layer in the Layers palette in Photoshop . Type into the marquee you have drawn. From the “Window” menu, select the Character palette to choose font, size, leading, etc."
    },
    {
      "title": "Click the Horizontal Type Tool (\"T\") from the menu.",
      "content": "Click the Horizontal Type Tool (\"T\") from the menu. Click and drag your cursor to create a text box the size of your paragraph or text. In the menu above, click toggle the character and paragraph palettes. Select the paragraph palette. If your text is not in a correct paragraph format, you can adjust it by highlighting your text using the paragraph tool. From your \"Windows\" drop down menu, select \"Paragraph.\" Once you have selected paragraph, your paragraph edit tools will appear on your screen and from there you can adjust your paragraph."
    },
    {
      "title": "Determine the difference between text tool and paragraph tool.",
      "content": "Determine the difference between text tool and paragraph tool. The paragraph tools allows you to edit your text in many ways. A shortcut to edit your text is using your text tool option, as the text tool allows you to edit your Fonts, text size, text color, curve your text, and it also gives you three options of paragraph layouts. The difference between using your text tool and your paragraph tool is that the paragraph tool allows you to edit your paragraph layout further, but you can only edit your paragraph using the paragraph tool and nothing more. The text tool gives only three paragraph layout options, but you can edit your text size, fonts, color, italic, bold and curve your text. Paragraph tool is for paragraphs layout only. Text tool is for editing your text and minimum paragraph layout options."
    },
    {
      "title": "Choose justification.",
      "content": "Choose justification. From the “Window” menu, select the “Paragraph” palette to choose justification. On a Mac, the keystroke “Command-T” brings up the Character and Paragraph palettes. Convert to your text layer to paragraph type. Text justification is enabled only for paragraph text in Adobe Photoshop. So first convert your text layer to paragraph type by right clicking on the text layer and selecting “convert to paragraph text.” Now click on window tab and select “paragraph” to open up the paragraph tool box. Then select the text which you want to be justified and now you can choose among four different types of justifications (at right top of the paragraph box)"
    },
    {
      "title": "Select all of the text you want to justify.",
      "content": "Select all of the text you want to justify. To do this first you need to click on the text with the horizontal type tool to place an insertion point in the text. Then you can either press command/ctrl+A to select all of the text in the area or drag the cursor across the text to highlight it. Once the text is highlighted, open the paragraph window (Window>Paragraph). With the text still highlighted, click one of the different Justify options at the top of the dialog box."
    },
    {
      "title": "Choose alignment type.",
      "content": "Choose alignment type. Align text to one edge of the paragraph. You can choose left, center or right for horizontal type. Choose top, center, or bottom for vertical type. [5] X Research source You will only find alignment options for paragraph type. Select a type layer if you want everything – all of the paragraphs – in that type layer to be affected. Choose the paragraphs that you want to affect."
    },
    {
      "title": "Pick the options for horizontal alignment.",
      "content": "Pick the options for horizontal alignment. There are three options each for horizontal type and for vertical type. For horizontal type, you could choose “left align text.” This aligns the type to the left. It will leave the right edge of the type jagged. Center text pushes the type to the center. It leaves both edges of text jagged. Right align text pushes type to the right. It leaves the left edge of the type jagged."
    },
    {
      "title": "Pick the options for vertical alignment.",
      "content": "Pick the options for vertical alignment. There are three choices for vertical alignment too. Use “top align text.” This aligns type to the top. It leaves the bottom edge of the type jagged. ”Center text” pushes text to the center. It leaves both the top and the bottom jagged. “Bottom align text” aligns text to the bottom. It leaves the top edge jagged."
    },
    {
      "title": "Choose justification type for horizontal text.",
      "content": "Choose justification type for horizontal text. There are four options in Photoshop for justification type. You will need to choose one of them if you want both edges of the text to be aligned. Justify last justifies all lines except the last line and that last line it is left aligned. Justify last centered justifies all lines except the last line which is aligned to center. Justify last right justifies all lines except the last line and that last line it is right aligned. Justify all justifies all the lines including the last line. Once finished, click the checkmark button on the menu above to commit your changes. Once your changes are committed, you can click the Move Tool from the menu, and move the text box around as needed."
    },
    {
      "title": "Choose justification type for vertical text.",
      "content": "Choose justification type for vertical text. There are four options for justifying vertical type. \"Justify Last Top” justifies all lines except the last. It’s top aligned. \"Justify Last Centered” justifies all lines except the last. It’s center aligned. \"Justify Last Bottom” justifies all lines except the last. It’s bottom justified. \"Justify All” justifies all lines including the last. It’s force justified."
    },
    {
      "title": "Change word and letter spacing in justified text.",
      "content": "Change word and letter spacing in justified text. It’s easy to also change how the text is spaced and looks in the justified section. Select paragraphs you want to change. Or select a type layer if you want all the paragraphs in the type layer to be affected. Choose justification from Paragraph panel menu and enter values for Word Spacing, Letter Spacing, And Glyph Scaling. The Minimum and Maximum values define a range of acceptable spacing for justified paragraphs only. The Desired value defines desired spacing. This is used for justified and unjustified paragraphs alike."
    },
    {
      "title": "Word spacing can range from 0 to 1,000 percent.",
      "content": "Word spacing can range from 0 to 1,000 percent. If you choose 100% there is no additional space between words. Letter spacing can range from -100% to 500%. You won’t add space between letters if you choose 0%. At 100%, an entire space width is added between letters. Glyph scaling means the width of characters. You can choose 50% to 200%. At 100% the height of characters won’t be scaled."
    },
    {
      "title": "Indent paragraphs.",
      "content": "Indent paragraphs. This means you choose the space between type and bounding box or line that contains the type. Indentation is only going to affect selected paragraphs. Select a type layer if you want all layers affected. Select the paragraphs you want affected if you don’t. In the Paragraph Panel, choose an option. Indent left margin indents from the left end. Indent right margin indents from the right edge. Indent first line, indents the first line of the paragraph."
    }
  ]
}