{
  "url": "https://www.wikihow.com/Make-Teal-Paint",
  "title": "How to Make Teal Paint",
  "steps": [
    {
      "title": "Give yourself a selection of blues.",
      "content": "Give yourself a selection of blues. Blue is one of the primary colors you will need to find your perfect teal, and artists may differ on what shade of blue with which to start. By grabbing a brighter, lighter shade of blue, along with a deeper, darker shade of blue (sometimes referred to as a “pthalo” blue), you will give yourself a better chance of creating a color that’s right for you. [2] X Research source"
    },
    {
      "title": "Choose a vibrant green paint.",
      "content": "Choose a vibrant green paint. Green is another essential color in making greenish-blue paint. You don’t want to go to dark, so choose a medium green shade of paint, akin to kelly green or emerald green. [3] X Research source Teal tends to be a darker shade than its close cousin, turquoise, but your blues can lend that element of depth and richness. [4] X Research source"
    },
    {
      "title": "Pick a couple of yellow paints.",
      "content": "Pick a couple of yellow paints. Again, artists differ on which shade of yellow to utilize in achieving their desired teal. A bright yellow will provide a greater brightness, while a more amber or burnt yellow will help to create a bolder, deeper hue."
    },
    {
      "title": "Grab a plain white paint for touching up your tones.",
      "content": "Grab a plain white paint for touching up your tones. Perhaps you’ve gone a bit darker than you intended, and need to lighten it up a bit. A dab of white paint can change the intensity of the color, and allow you to make smaller tweaks and adjustments."
    },
    {
      "title": "Create a basic teal from which to work from.",
      "content": "Create a basic teal from which to work from. Mix 2 parts blue paint, with 1 part green, and ½ to 1 part yellow. You don’t need to nail it on the first go. Try to get a general feeling for the color and make alterations as necessary. You can also create a basic teal by taking your pthalo blue paint, adding in some bright yellow, along with small amounts of white paint. [5] X Research source Brushes and palette knives can both be used to mix and paint. Brushes are good for mixing large amounts of paints, while a palette knife is a smaller and finer way of incorporating paints together. Choose one (or a series) that works best for you. [6] X Research source If you want to search through every tone and temperature of teal you can think of, you will need a large enough canvas to carry out the task. If a smaller sampling is all you desire, then a simple painter’s palette should do nicely. [7] X Research source"
    },
    {
      "title": "Bolster colors by adding white.",
      "content": "Bolster colors by adding white. White isn’t just good for achieving a lighter shade; it also affects the opacity and complexity of colors. Squeeze some colored paint directly onto your canvas, and dab in some white to see how it can make your color really pop off the canvas."
    },
    {
      "title": "Avoid adding black paint to your mixture.",
      "content": "Avoid adding black paint to your mixture. While adding black will certainly make your shade darker, it may also dull and dampen your desired look. Try adding a darker shade of one the colors you originally used to achieve a similar effect."
    }
  ]
}