{
  "url": "https://www.wikihow.com/Make-a-Family-Crest",
  "title": "How to Create Your Own Family Crest",
  "steps": [
    {
      "title": "Decide how you will use your crest.",
      "content": "Decide how you will use your crest. Keeping the audience and purpose of your crest in mind throughout the design process can help you make decisions about what to include. For example, a crest solely for personal use might include silly images or inside jokes. If you’re making a family crest for a school project or something similar, you might want to include more historically accurate symbols."
    },
    {
      "title": "Research historical heraldic symbols.",
      "content": "Research historical heraldic symbols. Heraldry symbols, or charges, are the symbols you see on family crests and coats of arms, and each one has a unique significance that’s rooted in history. If you want to include historically accurate heraldry symbols on your family crest, choose heraldry symbols that are meaningful and relevant to you. Some popular choices include: [1] X Research source Lions: Represent courage, valiance, and nobility. Dragons: Represent protection, power, and bravery. Eagles: Represent spirit, intelligence, and protection. Mermaids Represent eloquence and an association with the sea. Swords: Represent military honor, liberty, and strength. Sun: Represents hope, glory, and happiness. Rose: Represents hope, joy, and beauty."
    },
    {
      "title": "Choose appropriate symbols to use on your crest.",
      "content": "Choose appropriate symbols to use on your crest. Select symbols that best represent your family, your values, or your characteristics. Think about your history, your profession, the number of children you have, your hobbies, your interests, etc. Any of those can be used as a symbol for your crest—narrow it down to 1-3 specific images that best represent you or your family. For instance, if you're a writer, maybe you want a feather as your crest to represent a quill. If you value bravery, maybe you want an eagle as a crest. The symbols or charges that you choose don’t have to be historically accurate or even that serious! If you like to laugh, you can include part of a favorite joke in your coat of arms, such as a banana peel. If you love nature, you could include a favorite flower or tree, and dogs could easily be part of a coat of arms. If you’re creating a crest as a family activity, brainstorm ideas together to talk about what makes your family special. Do you like to cook together? Do you like to travel? Do you have pet members of your family?"
    },
    {
      "title": "Choose the colors for your family crest.",
      "content": "Choose the colors for your family crest. Pick from traditional coat of arms colors like purple, red, blue, green, and black, with metal colors gold and silver. Choose 2-3 colors that are easy to distinguish from each other, in accordance with the “rule of tincture,” a design philosophy that applies to heraldic traditions. [2] X Research source However, the “rule of tincture” applies to traditional coats of arms. If you’re just making a family crest for fun or for school, include whatever colors you want! If you’re using a natural symbol in your crest, you can use the color found in nature. For instance, if you are drawing an eagle for your crest, you can use brown for the wings, even though brown isn’t a “traditional” design color. You can also choose your colors based on their heraldic meanings. For example, red signifies strength and passion, blue represents loyalty, purple is justice, green is hope, and black is constancy. [3] X Research source"
    },
    {
      "title": "Arrange your symbols onto a background shape.",
      "content": "Arrange your symbols onto a background shape. Most coats of arms use a shield shape, but you can use other shapes, such as triangles or squares. Divide the shape into four sections with different symbols in each one, or use one symbol for the entire crest. If you’re creating your family crest with members of your family, divide up the crest and pick a person to design and color each section. Pay attention to symmetry. Though not all crests are symmetrical, many have symmetrical elements. For instance, you may have an eagle with its wings outstretched and its head turned. In that case, the turned head makes it not symmetrical, but the wings and other parts of the body should be symmetrical. [4] X Research source You can also add supporters, which go on either side of the crest. Generally, these are two animals, like griffins or lions, that help create balance within the design."
    },
    {
      "title": "Add a family motto or surname to your crest.",
      "content": "Add a family motto or surname to your crest. Many crests and coats of arms feature family mottos or surnames to explicitly identify the family they represent. If your family has a motto, you can include that on the top of your crest. Draw a banner shape across the top of the crest and write your family motto in black ink. If you’d prefer to include one of your family names, draw the banner at the bottom of the crest. Write your family surname in black ink. For example, perhaps your family motto is Respicias Veritas , Latin for “Respect truth.” You would write this phrase in a banner at the top of your crest. Similarly, if your family surname is “Hedlund,” write that in a banner at the bottom of your crest."
    },
    {
      "title": "Create a written description of your crest.",
      "content": "Create a written description of your crest. Write 2-3 sentences that describe the details of your design. This piece of text can help you document and explain the symbolism of your design. If you’re making a coat of arms for a school assignment, your teacher will likely ask for a written explanation of your design choices."
    },
    {
      "title": "Finalize your family crest on paper.",
      "content": "Finalize your family crest on paper. Gather craft materials like construction paper, stickers, markers, glue, and scissors. Trace and cut out your desired background shape on a piece of construction paper, or print out a family crest template . Draw symbols directly onto the crest, or print them out from online image galleries and glue them onto the paper. If you’d like to include a banner, cut the shape out of another piece of construction paper and glue it onto the crest. Alternatively, you can create a digital family crest with an online graphic design tool like Canva or with a website specifically made for designing family crests. If you don’t want to draw your crest by hand (or want a really official design), websites like CoaMaker , MyTribe 101 , Roll for Fantasy , and Hall of Names at Lineage all offer family crest generators so you can create yours digitally."
    },
    {
      "title": "Use a reputable online ancestry service to find your family’s crest.",
      "content": "Use a reputable online ancestry service to find your family’s crest. Organizations like Hall of Names offer searches for your family surname in their heraldry database. However, not every family has a crest or coat of arms—it is more likely that your family will have these ancestral symbols if your ancestors were European and of noble origin. [5] X Research source"
    },
    {
      "title": "Research armory records in the city your ancestors are from.",
      "content": "Research armory records in the city your ancestors are from. If you have access to a city armory, look through manuscripts and old books that contain the original descriptions of each coat of arms. Researching via these records should give you information about when each coat of arms or crest was created and what family names they were used by."
    },
    {
      "title": "Family crests are symbolic emblems that identify families or individuals.",
      "content": "Family crests are symbolic emblems that identify families or individuals. Traditionally, crests appeared on the top of a family’s coat of arms. However, crests are sometimes also used as a stand-in for the coat of arms as a whole. In modern, unofficial speech, “family crest” and “family coat of arms” are often understood to mean the same thing. [6] X Research source"
    },
    {
      "title": "Crests were originally painted on the shields of medieval knights.",
      "content": "Crests were originally painted on the shields of medieval knights. Each knight had a unique design that represented who he was and where he came from. In some cases, those knights were allowed to pass their coat of arms down through their male line of descendants—thus becoming a family crest used by ongoing generations. [7] X Research source The first known use of a medieval coat of arms was in the 11th century A.D. The Bayeux tapestry, which documents the Norman invasion of England, depicts some knights holding shields with heraldic symbols. By the 12th century, coats of arms were commonly used by knights and feudal lords in battle. By the 13th century, these heraldic symbols were more commonly used by families as their family logo or within the flag that flew above their castle or manor. However, only aristocratic and noble classes in medieval Europe used coats of arms, as they had to have been granted distinction to use the symbol by their current ruler."
    },
    {
      "title": "Some modern countries like the UK still regulate the use of family crests.",
      "content": "Some modern countries like the UK still regulate the use of family crests. If you want to register a coat of arms in the United Kingdom (or one of its realms like Canada or Australia), you must submit a petition to the official College of Arms . They will review your design and inform you of next steps. [8] X Research source In the United States, it’s legal for anyone to register a family crest or coat of arms. However, you must submit your crest design to a certified organization like The American Heraldry Society."
    }
  ]
}