{
  "url": "https://www.wikihow.com/Go-Sledding-With-a-Trash-Bag",
  "title": "How to Go Sledding With a Trash Bag",
  "steps": [
    {
      "title": "Tape a trash bag around a piece of cardboard to make a sled with a firm base.",
      "content": "Tape a trash bag around a piece of cardboard to make a sled with a firm base. Slide a piece of cardboard that is big enough for you to sit on inside a heavy-duty trash bag. Fold over the end and any loose parts of the bag so it is wrapped tightly around the cardboard. Wrap duct tape or packing tape around the folded parts to keep it tightly secured. [1] X Research source The cardboard creates a solid base so there is less friction when you go sledding. It will also provide insulation and a bit of padding to protect your behind while you sled down a hill. You can use a disassembled cardboard box and cut it to the right size with scissors or a utility knife if it is too big for you. You want it to be about 2/3 the length of your body to sit comfortably on it. Use the thickest garbage bag you can find so that it doesn’t rip easily when you go sledding."
    },
    {
      "title": "Use a trash bag that is big enough to sit in if you don’t have a cardboard base.",
      "content": "Use a trash bag that is big enough to sit in if you don’t have a cardboard base. Get a heavy-duty trash bag that is big enough to cover your whole legs and bottom. Sit in it and hold the edges tight against your body when you go sledding. [2] X Research source If you use a trash bag with handles, then you can cinch it around your waist for even more protection from the snow."
    },
    {
      "title": "Tape 2 trash bags together to make a longer bag if you are too tall to fit in 1.",
      "content": "Tape 2 trash bags together to make a longer bag if you are too tall to fit in 1. Cut the bottom off of 1 heavy-duty trash bag with scissors. Insert the bottom of the bag you cut into the top of another bag, then tape them where they overlap with duct tape or packing tape to connect them. [3] X Research source You want the trash bag you cut open to come up around your waist. Sit in the bags before you tape them to make sure you attach them in the right place. Wrap about 2-3 layers of tape around the bags where they meet to be sure they stay connected when you go sledding."
    },
    {
      "title": "Wear layers of warm, waterproof clothing to keep you warm and dry.",
      "content": "Wear layers of warm, waterproof clothing to keep you warm and dry. Put on your warmest winter gear, including snow boots and snow pants if you have them. Wear a hat, gloves or mittens, and a winter jacket. [4] X Research source Don’t wear a scarf when you go sledding , as it can come loose and get caught in or under your sled."
    },
    {
      "title": "Find a snowy hill with a gentle incline and a flat area at the bottom.",
      "content": "Find a snowy hill with a gentle incline and a flat area at the bottom. Don’t pick a hill that is so steep that you won’t be able to stop safely at the bottom. Make sure the hill doesn’t end in a parking lot, street, or near trees, ponds, fences, or any other objects that you might crash into. [5] X Research source Pick a hill that is free of bumps, rocks, trees, poles, and other obstacles. Hills with a long flat area at the bottom and no obstacles are the safest for sledding."
    },
    {
      "title": "Sit down on your sled at the top of the hill with your feet facing downhill.",
      "content": "Sit down on your sled at the top of the hill with your feet facing downhill. Climb to the top of the hill and sit down on your trash bag sled or get inside of the bag. Point your feet downhill and sit up straight. [6] X Research source Never sled down a hill face-first or standing up. This could result in serious injuries. Children 5 years old and under must sled paired with an adult. Children between 5-12 years old need to be watched at all times by an adult or older guardian."
    },
    {
      "title": "Shove yourself off to start sledding down the hill.",
      "content": "Shove yourself off to start sledding down the hill. Hold on to the trash bag around your waist or bend up the front and hold on if you made one with a cardboard base. Scoot your behind to start yourself moving forward down the hill or push yourself off with one hand. [7] X Research source Always slide straight down the hill with your feet forward and sitting straight up to avoid injury."
    },
    {
      "title": "Hold on to the sled and keep your arms and legs within the sled.",
      "content": "Hold on to the sled and keep your arms and legs within the sled. Keep holding on to the sides of the bag or the front of the sled until you reach the bottom. Don’t let go or get off the sled while you are moving. [8] X Research source If you fall off the sled by accident, then keep rolling with your momentum until you come safely to a stop."
    },
    {
      "title": "Glide safely to a stop at the bottom.",
      "content": "Glide safely to a stop at the bottom. You will naturally come to a stop if the bottom has a flat enough area. Drag your hands in the snow at the bottom to help brake the sled if you need to. Stand up only after you have come to a full stop. [9] X Research source If your sled won’t stop, then let go and roll off and away from it so you don’t crash. If you are sitting in a trash bag, then you can just try to start rolling to the side to stop yourself while still inside the bag. If there are other sledders coming down the hill, then move out of the way quickly when you come to a stop. Walk up the side of the hill, out of their path, if you want to return to the top and sled down again."
    }
  ]
}