{
  "url": "https://www.wikihow.com/Look-Like-a-Zombie",
  "title": "How to Look Like a Zombie",
  "steps": [
    {
      "title": "Apply makeup.",
      "content": "Apply makeup. You can use makeup to create the illusion of a deathly pallor. A white/grey, purple or green tint works well for most people. Go to the drugstore and look for under-eye concealer or foundation base in these colors. Also purchase some dark eye shadow, eyeliner and baby powder. Apply the base over your entire face and down your neck to get that unhealthy pallor. Get directly under a light source and start using eye shadow to accent sunken areas of your face, such as your eye sockets and around the mid-way of your cheeks. Find shadows and darken those a lot. Black out your eyes completely, but keep it under control. Make it look like your eye sockets have shrunken in about an inch. Get darker towards the middle and inside corners of the eyes, making sure to accent natural shadows but a bit more darker. (you can even try a darker gray shade; this sometimes works better for a realistic effect than black). Use baby powder on your face to make your skin look dull and dead. Put a lot on so it looks like you're pale and dead and use some colors like pale light green or grayish-green eye shadow and apply it in some parts of your face and around the areas you had darkened. Lighten the color of your eyebrows.If you want to be a zombie you have to look as realistic as possible. Apply solid red lipstick on parts where later you will apply your 'fake blood' on your lips and apply some dabs of purple or grayish or maroon lipstick to make it look like as if the blood is a bit dried and look more realistic. If you want or can afford you can purchase contact lenses with the scary eyeballs. Well, most people think it is unnecessary to have them and any ways you can look scary enough even without these lenses but it's up to you to decide. There are many people who didn't use these on Halloween so there's no need to worry if you are not buying."
    },
    {
      "title": "Mess up your hair.",
      "content": "Mess up your hair. Try to make your hair look like you just rolled out of a grave.You can also use a lot of hair oil to make your hair look greasy. Backcomb it at the roots. You can also apply hairspray, then use a small teasing comb or brush to tease your hair (brush hair in the \"opposite\" direction toward the roots). Do this in small sections. Your hair will stay messed up (or in place) if you use hair oil and when you use other cosmetics on your hair (such as powder or your fake blood on your hair) it will come out easily in the end of the day when you take a shower. Apply baby powder. Rub some baby powder into your hair to make it look grey and ashen. If you have long hair, you can either leave it down or pull it into a messy up-do or even rub your head against your pillow. An extremely crooked ponytail, ratty braids or a falling-apart bun look appropriately disheveled. Try starting with bedhead. If you're going to dress like a zombie first thing in the morning, try washing your hair right before you go to sleep the night before. Sleeping on wet hair will automatically make it look wild and mussed, and it might even get pushed far to one side like you've been lying in a grave. Or just not brush your hair when you wake up."
    },
    {
      "title": "Make fake blood",
      "content": "Make fake blood . For one fluid cup (probably more than you'll ever use), do this: 1 1/2 cups of corn syrup. Do not use pancake syrup, which can make the blood go a bit gold. 1-2 tbsp of red food coloring. Some chocolate syrup, like the kind you put on ice cream (not a \"shell\" type). A couple small drops of blue or green food coloring, for color preference. This will give your \"blood\" a deeper, more realistic red. Mix well and add small amounts of water until desired consistency/smearing factor is achieved. An alternative mix uses honey for thickness and stickiness instead of corn syrup, washing-up liquid (dish soap) (e.g. Fairy Liquid) and red and blue food coloring. The washing-up liquid helps the blood wash out of your clothes later. Play around with the ratio of honey to washing-up liquid to get the right consistency - different brands vary. Be warned, though - pine-scented dish soap isn't very tasty, so if you're putting this mix in your mouth, use a minimal amount! To get a more paste-like or thicker consistency, petroleum jelly works very well. Just mix the food dyes in, or used a crushed maroon or red eyeshadow."
    },
    {
      "title": "Apply fake blood.",
      "content": "Apply fake blood . Here's the fun part, unless you get sick easily. Go nuts. Give yourself some wounds of some kind. Dribble blood into your hairline and let it run down your face, arms, legs and hands. If you want bullet holes, get a really black marker and draw holes on your shirt. Then dribble down some fake blood around it. For the \"I just got done munching on the neighbor\" look, pour a fair amount of blood into your hand, and then \"eat\" it, to get a nice mouth smear. Then, put some more in your mouth (this mix is non-toxic, unlike some others) and let it dribble down your chin and throat. If you have time, allow some blood to dry a little (about 10 minutes) and then re-apply another layer differently, to get a nice effect. Try to go for dark colored fake blood, as bright red blood will give you a cartoony appearance."
    },
    {
      "title": "Get your costume looking right.",
      "content": "Get your costume looking right. Here are the basic steps for getting your clothes properly trashed. Go outside and roll around in dirt. Try to find some mud and roll in it. While applying fake blood, make sure you're messy, and get it on your clothes. This stuff runs and seeps in quite well and looks extremely convincing. Use a knife or other pointed implement (carefully!) and rip holes into your costume."
    },
    {
      "title": "Act zombie-like.",
      "content": "Act zombie-like. Zombies are slow, stiff, dim-witted, can't talk well, if at all, and crave human flesh. Make moaning and gasping sounds when you breathe through your mouth. It adds great effect. Your jaw should hang slack at most times. If you must make other noises, talk in gibberish or moan louder/higher. Moaning always works. Shamble, don't walk. Lean forward and almost fall with every step. Adding a limp or dragging one leg works great as well. Swing your arms limply, like you don't ever use them. When passing people, growl or groan at them and wave your arms. Some higher-level zombies tend to moan for \" brains!!! \" as well. If you want to get some laughs, say \"Hi!\" to some people, and wave. You'll be hilarious. If you want to really freak someone out, go to a movie theater with a zombie movie out (if there is one). In the middle of the movie, where tension is highest, walk across the front of the screen. That will scare at least half the people in there. Act stupid. The average zombie has an IQ barely above freezing temperature. They will run into walls, trip, fall, and can't work with their hands."
    }
  ]
}