{
  "url": "https://www.wikihow.com/Install-Surface-Mount-Hinges",
  "title": "How to Install Surface Mount Hinges",
  "steps": [
    {
      "title": "Take apart the hinge, if possible.",
      "content": "Take apart the hinge, if possible. Some hinges are all one piece and can’t be taken apart. However, if your hinge can be separated into pieces, remove the hinge pin to take the hinge apart. This will help you install it easier. The package your hinges come in should tell you whether or not they can be taken apart."
    },
    {
      "title": "Use a measuring tape and level to help you evenly space your hinges.",
      "content": "Use a measuring tape and level to help you evenly space your hinges. Measure your cabinet or door so you can space the hinges the same distance from each end. Use a level or combination square to make sure the hinge is even. [1] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. Mark the spot where you’d like the hinge to go using a pencil or piece of painter’s tape. If you’ve taken the hinge apart, remember to mark the spots for the 2 pieces, not just 1. A door hinge is usually installed 5 inches (13 cm) from the top of the door and 10 inches (25 cm) from the bottom. To use a level, set the level at the top of the hinge. Rotate the hinge until the bubble in the level is between the 2 middle vertical lines. Use a combination square by lining up the edge of the square with the edge of the door, cabinet, etc. The combination square will create a right angle, helping you line up your hinge."
    },
    {
      "title": "Place the hinge in its spot and trace it with a pencil.",
      "content": "Place the hinge in its spot and trace it with a pencil. Once you’ve decided where the 2 hinge pieces will be placed, trace around the hinge and screw holes using a pencil. Remove the entire hinge once you’ve traced it. [2] X Research source"
    },
    {
      "title": "Mark the center of the hole so you know where to place the screws.",
      "content": "Mark the center of the hole so you know where to place the screws. Use a center punch to mark the center of each hole that you just traced. If you don’t have a center punch, you can use a nail and hammer to create a small hole exactly where you’d like the screws to go. Place the tip of the center punch on the center of the hole—you can use a pencil or pen to mark the center. Use a hammer to hit the top of the center punch, creating the indentation."
    },
    {
      "title": "Drill the holes for the screws.",
      "content": "Drill the holes for the screws. [3] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. Place your drill bit into the indentations left from the center punch—these will help keep your drill from moving around. Carefully drill the holes for all of the screws. Use a drill bit that’s slightly smaller than your screw size. You can look up charts online that will tell you what size drill bit to use according to your screw size. Do a visual check by holding up the drill bit in front of the screw. If you can't see the threads of the screw, the drill bit is too big and you need to go down a size or 2."
    },
    {
      "title": "Position the hinges and place a screw in each hole.",
      "content": "Position the hinges and place a screw in each hole. Line up the hinges so that they're in the center of their tracings, then place a screw in each hole so you can tighten them down."
    },
    {
      "title": "Tighten each screw using 2 or 3 twists until they’re all tightened.",
      "content": "Tighten each screw using 2 or 3 twists until they’re all tightened. Use a screwdriver to begin tightening each screw 1 at a time. Tighten the first screw 3 rotations, and then move on to the next screw. Do this until they’re all evenly tightened. [4] X Research source"
    },
    {
      "title": "Replace the hinge pin, if necessary.",
      "content": "Replace the hinge pin, if necessary. If your hinge came in 2 pieces with a hinge pin, you can replace it once the screws are nice and tight. Just drop it into place in between the 2 hinge pieces. If you’re installing a door or cabinet, put the top hinge in first to help with the alignment."
    }
  ]
}