{
  "url": "https://www.wikihow.com/Look-Good-for-Your-Passport-Photo",
  "title": "How to Look Good for Your Passport Photo",
  "steps": [
    {
      "title": "Style your hair.",
      "content": "Style your hair. Don’t do anything you wouldn’t ordinarily do to your hair for a passport photo. Passport photos should be a good representation of what you usually look like so that you don’t get detained. Do not wear a hat or any other head covering unless you already do so on a daily basis for religious purposes. If you do wear a head covering, for a U.S. passport, your face has to be visible. The covering can’t hide your hairline or cast shadows over any part of your face. [1] X Research source Reader Poll: We asked 269 wikiHow readers if they think hair is an important part of looking presentable, and 94% said yes . [Take Poll]"
    },
    {
      "title": "Put on approximately the same amount of makeup as usual.",
      "content": "Put on approximately the same amount of makeup as usual. If you usually wear makeup, go ahead and put it on as usual. If you never wear makeup, you probably don’t want to put on a ton of it for the photo. You won’t look like yourself, and you could get detained. Wear a little oil-absorbing powder to prevent shine if you want to. This will be most useful on your forehead or nose. Even if you don’t usually wear makeup, you may want to put a bit of concealer or powder over any dark circles under your eyes. These dark places can cause a glare (and make you look sick or tired). [2] X Research source Cover up any blemishes you have with a little concealer so they don't show up in the photo. [3] X Expert Source Crystal Bear Professional Photographer Expert Interview. 21 January 2021."
    },
    {
      "title": "Dress appropriately.",
      "content": "Dress appropriately. Remember that you may need to use your passport for many occasions other than traveling. (For example, sometimes you can use it to get a background check when you apply for a job.) [4] X Research source Try to wear solid colored clothing in muted tones. [5] X Research source Wear something flattering and reasonably comfortable. Don’t wear anything too flashy, or it will cause people to look at your outfit instead of your face. Pay most attention to your shirt, since that’s what will be in the photo. Scoop or v-necks work nicely. If it’s too low cut or if it’s a tank top, you might look naked, so check the neckline. [6] X Research source Since you will be in front of a white or black background, avoid those colors. Choose colors that flatter your skin tone. Wear a minimal amount of jewelry. Uniforms or anything that resembles a uniform (including camouflage) are not allowed unless they are religious attire that you wear every day. [7] X Research source Some people have reported that the passport office rejected their photo because it looked too much like previous photos (which means that the passport office couldn’t confirm that it was a recent picture), so you should dress a bit differently than you did in your last photo if this is an update. [8] X Research source"
    },
    {
      "title": "Check your teeth.",
      "content": "Check your teeth. Be sure to brush your teeth the morning of your photo so that they’re pearly white. Right before the photo, you should also duck into the bathroom or pull out a compact to be sure there is nothing in them."
    },
    {
      "title": "Take your glasses off.",
      "content": "Take your glasses off. This is a requirement. [9] X Research source If you cannot remove your glasses for medical reasons, please include a signed note from your doctor with application. Reapply makeup. In particular, if you tend to look shiny in photos, you may want to add a bit of oil-absorbing powder at the last minute. Be sure to also check for lipstick smears or eye makeup that has smudged."
    },
    {
      "title": "Check your hair.",
      "content": "Check your hair. If you’re wearing your hair down (especially if it’s long), arrange it over your shoulders if you want. If your hair is short, make sure that it’s laying the way you want it to. Rub a tiny bit of gel or mousse between your fingers and run it over your hair at the last minute to keep flyaways at bay. If your hair is very long, you may want to only arrange one side of it over your shoulders. If it covers the straps of your shirt or hides the sleeves, you might look naked. [10] X Research source"
    },
    {
      "title": "Follow directions.",
      "content": "Follow directions. Assuming you’re not taking your own photo, listen carefully to the person who is. The photographer wants to capture you from your most flattering angle. Follow his or her directions accurately and don't move from one pose to the next unless he or she asks you to. There are strict requirements about headspace in a passport photo, so you don’t want to ruin their shot. [11] X Research source . The photographer will ask you to face the camera directly, since this is a government requirement. If you’re taking your own photo, be sure to square your shoulders and look directly into the camera. [12] X Research source Your head must be between 50% and 69% of the total height of the photo. Measure from the top of your head (including your hair and any headwear) to the bottom of your chin. [13] X Research source"
    },
    {
      "title": "Stand tall.",
      "content": "Stand tall. Be sure that your posture looks nice and confident. Keep your shoulders down and back. Don’t hold your head up high to avoid a double chin, because it will make your neck look large. [14] X Research source Instead, thrust your chin forward very slightly (a little farther out than you would normally hold it, but not much)."
    },
    {
      "title": "Smile if smiling is permitted in passport photos in your country.",
      "content": "Smile if smiling is permitted in passport photos in your country. In general, either a “natural smile” (one that doesn’t show your teeth) or a neutral expression are permitted for passport photos. Choose an expression that you think flatters your face, but listen carefully to the photographer’s instructions if they tell you you look unnatural. [15] X Research source If your expression looks “unusual” or you are squinting at all, the passport office may reject the photo, which will delay the process of getting your passport. [16] X Research source If you choose not to smile at all, think of a happy thought so that your eyes will still appear friendly and pleasant."
    },
    {
      "title": "Get involved in the selection process.",
      "content": "Get involved in the selection process. A good photographer will look at the pictures with you and recommend the ones he or she thinks turned out best from a professional point of view. Be assertive and choose the one you like best if you disagree with the photographer, but be sure that your photo meets the requirements."
    },
    {
      "title": "Decide where to get your picture taken.",
      "content": "Decide where to get your picture taken. There are dozens of options, and they all have different benefits. Choose one that’s conveniently located and fits your budget. You can get a good photo without shelling out a lot of cash, but of course a professional photographer will offer the highest quality photo. Some places require appointments, so plan ahead. [17] X Research source Some options include shipping centers (in the U.S., this includes Fedex and UPS) places with memberships (such as Costco and AAA) Costco offers some of the cheapest passport photos. AAA will sometimes do it for free if you’ve booked a trip through their travel services. pharmacies and retail stores (CVS, Rite Aid, Walgreens, and Walmart all offer this service) professional photography studios passport offices (many offer this service, but not all, so call ahead) registered passport expediters (if you need it in under two weeks) in your own home (but be sure to follow the strict requirements)"
    },
    {
      "title": "Get a haircut about one to two weeks in advance.",
      "content": "Get a haircut about one to two weeks in advance. Give your hair a little time to get over that fresh cut look by planning a haircut in advance if you need one. About a week or two should still leave your hair looking neat and tidy by picture time. Of course, if you want the fresh cut look and trust your stylist not to botch it, you can wait until the last minute."
    },
    {
      "title": "Pluck your eyebrows if that’s your thing.",
      "content": "Pluck your eyebrows if that’s your thing. If you like to shape your eyebrows, it’s best to do it about a day in advance to get rid of any redness before the photo but not give strays enough time to return. You could also get them waxed if you want to shell out a few bucks for this special occasion. [18] X Research source If you find that the skin around your eyebrows gets red after you pluck them, try applying cool, wet tea bags or a bit of aloe."
    },
    {
      "title": "Get enough sleep.",
      "content": "Get enough sleep. To prevent dark shadows under your eyes and redness in your eyes, try to get enough sleep for several days before you take your passport photo. This will also help brighten your skin and make you look healthier."
    }
  ]
}