{
  "url": "https://www.wikihow.com/Install-an-Aftermarket-Air-Intake",
  "title": "How to Install an Aftermarket Air Intake",
  "steps": [
    {
      "title": "Determine the exact specifications of your car.",
      "content": "Determine the exact specifications of your car. If you own a commonly customized car, such as a Honda Civic or a Volkswagen Jetta, you will likely need only your model, year, and engine type. If your car is less commonly modified, it may be harder to find aftermarket parts."
    },
    {
      "title": "Research the types of intakes available and choose the one that fits your needs best.",
      "content": "Research the types of intakes available and choose the one that fits your needs best. Short-pipe intakes are the simplest design to install, but offer the least benefits in terms of horsepower, torque, and gas mileage. They pull hot air directly from within the engine compartment into the engine. Cold air intakes pull cool air from places outside the engine compartment such as around the wheel well or bumper. These are a bit more complicated to install since you may have to install part of the intake from underneath the car. The cooler air is denser than the air inside the engine compartment so it gives a better boost to performance and gas mileage than short-pipe designs. Ram-air intakes usually pull cool air from the bumper area. Because they are designed to be at the front of the car, they actually pressurize the cool air coming into the engine as the car moves faster. This provides maximum airflow and maximum benefits. It is also the most complicated to install since you will likely have to install part of the system from underneath the car. You may even have to remove your bumper."
    },
    {
      "title": "Park your car.",
      "content": "Park your car. You should choose an area that has plenty of space for you to move around the front and sides of your vehicle. You also want a well-lit area so that you can see what you are doing. Be sure to turn your vehicle off before proceeding."
    },
    {
      "title": "Wait until your engine has cooled completely before doing anything.",
      "content": "Wait until your engine has cooled completely before doing anything. Parts in the engine compartment can get very hot when the car is running. You do not want to get burned."
    },
    {
      "title": "Unplug the car battery.",
      "content": "Unplug the car battery. Start by removing the negative terminal (black or unmarked) and then remove the positive terminal (red)."
    },
    {
      "title": "Locate the air intake.",
      "content": "Locate the air intake. This should be easy to identify. It will look like a large plastic tube running from the engine to a large plastic filter box."
    },
    {
      "title": "Remove the air intake system.",
      "content": "Remove the air intake system. This consists of removing the air filter, the filter box, and the tube running from the filter box to the opening in the engine bay. Some of these parts will be attached to the engine bay by small plastic mounts. You will need a wrench or socket set to remove the small bolt holding the mounts in place. Some pieces of the intake system are fastened to each other with hose clamps, which can be loosened by turning the small bolt on the end with a screwdriver or socket. You may need to remove one or more air sensors which feed information to the car's computer. These should be handled very delicately."
    },
    {
      "title": "Keep your original air intake.",
      "content": "Keep your original air intake. If the new intake you purchased is damaged or doesn’t fit, you will have to re-install the original intake system before driving your car. Set the intake aside until you know the new one works properly."
    },
    {
      "title": "Install the new intake.",
      "content": "Install the new intake. You should follow the specific manufacturer’s instructions as to which piece to install first. Be sure to secure the intake with hose clamps where appropriate. Carefully re-install any sensors removed with the old intake. Once the new intake is installed, install a new air filter. Remember that if you purchased a cold air or ram air intake, you will likely need to climb under the car to complete the installation as these systems pull cool air from outside the engine compartment."
    },
    {
      "title": "Check to make sure the intake system is secured properly.",
      "content": "Check to make sure the intake system is secured properly. If the intake easily strikes other objects in the engine bay, tighten the mountings until it is secure."
    },
    {
      "title": "Re-attach your battery terminals.",
      "content": "Re-attach your battery terminals. You should attach the red (positive) terminal first. Next, attach the black (negative/ground) terminal."
    },
    {
      "title": "Test drive your new intake!",
      "content": "Test drive your new intake! You want to make sure that the intake is functioning properly before you hit the open road."
    }
  ]
}