{
  "url": "https://www.wikihow.com/Lower-Child-Support",
  "title": "How to Reduce Child Support Payments",
  "steps": [
    {
      "title": "Understand the purpose of child support.",
      "content": "Understand the purpose of child support. Child support is designed to allow a child to enjoy a standard of living that is approximate to what he or she would have enjoyed had the parents lived together. Child support may be ordered when the parents are separated, have never lived together, or are in divorce, dissolution of marriage, annulment, or in the midst of paternity and legal separation cases. It is usually provided to the parent who will spend most of the time with the child, but this will depend on a variety of factors such as the state where child support is in order and your annual earnings. [1] X Research source [2] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (chapter 3). Child support is not alimony. The purpose of alimony is to rehabilitate or support a former spouse. Though the other parent may financially benefit from child support payments, the purpose of the payments is to benefit the children who no longer live with you. Once set, child support payments can only be amended by court order (which is very difficult to change). The biological parent who is ordered to pay the child support is legally required to do so until their child reaches 18 to 21 years of age depending on the state. However, some states allow young adults (18 and older) with special needs to continue receiving child support beyond the age of 21 or even for a lifetime. Child support may also end earlier if the parent who receives child support marries another person and the divorced parent (who is the biological parent) relinquishes their parental rights. The step-parent must be willing to adopt the child, otherwise, the biological parent remains obligated to pay. In very rare cases, it also ends if the child or biological parent passes away."
    },
    {
      "title": "Read your state laws on child support.",
      "content": "Read your state laws on child support. Each state has formulas for determining child support payments, typically found in statutes. You may find your statute by typing “child support” and your state into a web browser. These formulas consider the child's needs and the parents' ability to pay. [3] X Research source These formulas, however, are often only “guidelines,” which a judge can deviate from. [4] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (chapter 3) Typically, courts can consider a variety of factors when setting child support payments: [5] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (chapter 3). The parents' income. Some states consider only the non-custodial parent's income, while other courts consider both. Also, some states use “gross” income while others consider only “net” income (income after taxes and allowable deductions, such as taxes and/or union dues). Child support or alimony that either parent receives or is paying from a previous marriage. Which parent is paying for childcare and health care. Whether either parent is responsible for children other than the children from the current marriage. The number of children each parent is supporting and their age. This factor is important because the expenses of raising children do not double for each child you add. Whether either parent lives with a new partner or spouse who contributes to household expenses. If the child is disabled. If your child is disabled, support payments could continue indefinitely if the child is not capable of self-care."
    },
    {
      "title": "Meet with an attorney.",
      "content": "Meet with an attorney. An experienced attorney can help you strategize ways of lowering your child support payments. An attorney also may have particular experience with local judges and will know what the judges are looking for when considering a modification to child support. If your ex-spouse (who collects child support from you) opposes your request to decrease how much you pay them, they may hire an attorney to represent them. If this happens, it is strongly recommended that you hire an attorney on your behalf. To find an experienced family law attorney, you can visit your state's bar association website. States often run referral services, which you can call or email."
    },
    {
      "title": "Gather evidence of changes in circumstances.",
      "content": "Gather evidence of changes in circumstances. Judges have the power to modify an existing child support order and also have the power to set an amount lower than the state guidelines suggest. [6] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (Chapter 9) However, the judge will want to see evidence of changed circumstances: reduced earnings, increased expenses, etc. Before filing a petition with the court, you should gather the following: recent pay stubs or other evidence of self-employed income. evidence that your familial obligations have changed, e.g., the birth of another child. medical records, if you have become disabled."
    },
    {
      "title": "File a Petition to Modify Child Support.",
      "content": "File a Petition to Modify Child Support. To lower your payments, you will need to file a motion in court to modify your child support payments. You will need to file this motion in the court that issued the initial child support order. [7] X Research source Most courts have pre-printed “fill in the blank” motion forms. You can check with the court clerk to see if they have a form. Also ask if you need any additional forms, such as a Financial Affidavit. You can find relevant forms by visiting this website . If your court does not have a pre-printed form, then use a form as a guide as you draft your own motion. Use the caption information from an earlier motion (from the initial child support case). In the body of the motion, list the reasons why you want the court to reduce your child support. Sign the motion. You will have to provide the other parent with notice. The easiest option is to have the sheriff personally serve the papers on the other parent for a small fee. Ask the court clerk about acceptable service."
    },
    {
      "title": "Argue that you are paying “extras.”",
      "content": "Argue that you are paying “extras.” In your motion, you may argue that you have been paying more than what the child support order required. For example, you might have picked up 100% of your child's school tuition or medical insurance. If so, you might be able to get the child support lowered. [8] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (Chapter 9) The “extras” must be substantial. Simply buying clothes or presents for your child will not qualify as substantial."
    },
    {
      "title": "Identify a change in financial circumstances.",
      "content": "Identify a change in financial circumstances. You can argue that your financial conditions have changed such that a modification of child support is justified. The change must be substantial and permanent. Also, you cannot have voluntarily changed your financial situation by leaving a high-paying job for a lower-paying one, or quitting work altogether. [9] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (Chapter 9) Any change in the custodial parent's financial condition should also be mentioned. If the custodial parent's income has increased dramatically, then you could ask for a reduction in your payments. As a general rule, changes that would alter the child support order by 10-25% (depending on your state) qualify as sufficiently substantial to warrant filing a petition. [10] X Research source Nolo's Essential Guide to Child Custody &amp; Support, Emily Doskow (Chapter 9) Some states allow you to petition for a change without alleging a substantial change if at least 3 years have passed since the prior child support order."
    },
    {
      "title": "Submit a joint request to the court.",
      "content": "Submit a joint request to the court. If the other parent doesn't object, you could agree to modify the payments. Even if you agree, you must nevertheless have your agreement approved by the court, as the court will always need to assure itself that the change is in the child's best interests. Get the form. Often, courts will have special forms for joint requests. The form may also be called an “Uncontested Motion” or a “Stipulation to Modify a Prior Court Order.” [11] X Research source Both parents must sign. You also should fill out and complete a Child Support Worksheet. Every state has a worksheet. You can find your state's by searching on the web. You should have already filled out the worksheet when determining your initial child custody payments."
    },
    {
      "title": "File a Petition to Terminate Support.",
      "content": "File a Petition to Terminate Support. In some situations, the court will terminate a parent's support obligations. However, this only happens in certain specified situations: You have no income. Most states will grant a non-custodial parent's petition to temporarily suspend child support if the parent has lost his or her job or has become disabled and is in the process of applying for disability benefits. You are being incarcerated. Some states will allow temporary suspension for incarceration; however, other states will not. The child reaches age of majority. In most states, a parent can stop paying when a child reaches the age of majority (18 in most states). However, in some states a parent is obligated to pay until the child reaches 21. The child dies."
    },
    {
      "title": "Obtain custody.",
      "content": "Obtain custody. Custodial parents generally do not pay child support. Filing a petition to modify custody and subsequently being awarded custody will terminate your child support obligations. To obtain custody, you will need to: File a Petition to Modify Custody with the court. [12] X Research source In the petition, you must allege a change of circumstances such that a change in custody is warranted. The change must be sufficiently serious—something that endangers the child's physical or emotional well-being. [13] X Research source Convince a judge that custody should be modified. At a hearing, you will need to present evidence and witnesses who can back up your theory of why a change of custody is warranted. Evidence includes medical reports and police reports. [14] X Research source Hire an attorney to assist you. Custody determinations are complicated, and you will need the expert assistance of an experienced family law attorney to guide you. For more information, read wikiHow's guide on How to File for Full Custody."
    },
    {
      "title": "Reach an agreement with the other parent.",
      "content": "Reach an agreement with the other parent. Just as you can lower your child support payments by agreement with the other parent, you can also try to get out of child support obligations entirely by getting the other parent to agree. If the other parent will not agree, propose temporarily suspending child support payments until you can get back on your feet."
    }
  ]
}