{
  "url": "https://www.wikihow.com/Ignore-Your-Boyfriend-to-Teach-Him-a-Lesson",
  "title": "How to Ignore Your Boyfriend to Teach Him a Lesson",
  "steps": [
    {
      "title": "The silent treatment will show your boyfriend that something is wrong.",
      "content": "The silent treatment will show your boyfriend that something is wrong. It may be difficult, but pretend he’s not there. You’ve said your piece and he didn’t listen, so now you’re trying something new. Avoid conversations by moving to another room or silencing his calls. [1] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source The first hours or even days might be hard, but you’re giving him the chance to do some self-reflection. He will be forced to sit with his thoughts and ponder why you’re ignoring him, which will lead to him realizing what he did wrong. [2] X Research source"
    },
    {
      "title": "Using one-word responses will make him miss hearing your thoughts and opinions.",
      "content": "Using one-word responses will make him miss hearing your thoughts and opinions. Some time-sensitive and planning questions or statements do require an answer like “Do you want Chinese for dinner?” or “I’m going out. Be back at 12.” Even though you’re answering him, you’re still ignoring him by giving him less attention. [3] X Research source Give straight answers that require no explanation. Blunt answers like “okay,” “nah,” and “fine” show that you’re listening but don’t want to engage in a full conversation. Your voice matters, so show him how valuable you are by removing yourself from detailed conversations. If he texts you “How are you?” respond with a 👍 or a short “Ok.”"
    },
    {
      "title": "Let him leave a voicemail so he learns not to take your attention for granted.",
      "content": "Let him leave a voicemail so he learns not to take your attention for granted. Take your time reaching out to him, waiting hours or even days to call him back. If he sends you a text, leave him on read. [4] X Research source By seeing that you read his message but didn’t respond, he will wonder why you’re not talking to him and if he could have done something to hurt you. Only respond if he has a question you alone can answer, especially if it has to do with child care or finances. Wait a couple of hours before hitting that redial button so he knows you’re still mad. Changing his ringtone can help you be prepared when he calls. Instead of scrambling to find your phone when it rings, you can let it go to voicemail when you hear his ringtone."
    },
    {
      "title": "Freezing all communication with him will let him know you’re serious.",
      "content": "Freezing all communication with him will let him know you’re serious. He may think you’re just ignoring him in real life, so bring the silent treatment to Instagram, Twitter, and Snapchat. It may be hard, but try not to fall back into the pattern of liking his posts and sending him funny memes—hold your ground. [5] X Research source You are worthy of his attention, and by ignoring him, you’re showing him what he’ll miss out on if you leave. Engage with other friends on social media when you start to miss him. Save the posts that made you think of him during your time apart. After he’s learned his lesson, you can send them his way!"
    },
    {
      "title": "Spending time apart will give him a chance to reflect on what’s happened.",
      "content": "Spending time apart will give him a chance to reflect on what’s happened. Sometimes the easiest way to ignore someone is to just leave them alone for a while, so take a deep breath and step back. Grab a coffee, go to your favorite store, or see a movie. Do something you love while he thinks. You can teach him a valuable lesson by just being out of the equation. Give him time to question what he’s done, and let him realize how much he misses you when you’re not there."
    },
    {
      "title": "Keeping yourself occupied will have him missing your time together.",
      "content": "Keeping yourself occupied will have him missing your time together. Take this time to get back into a routine. Enroll in an art class, or plan a day to have lunch with a friend. Keep living in the present moment, even if that means doing things without him. [6] X Research source He’ll start missing you when you continue living your life without him. This will motivate him to reflect on why you’re ignoring him, and, who knows, maybe he’s hurting just as much as you. [7] X Research source"
    },
    {
      "title": "Showering other men with affection will make him jealous.",
      "content": "Showering other men with affection will make him jealous. Men are competitive, and when your boyfriend sees you hanging out with other men, warning bells will go off! Show him that you have plenty of choices out there. A little bit of jealousy will have him wishing he never wronged you in the first place! Invite some guy friends over for a movie night or go to a sporting event together. Post a group picture on social media to show your boyfriend how much fun you’re having! Be careful not to be overly flirtatious. You don’t want to give your boyfriend the impression that you’re cheating. Keep it cool and casual. Remember that he’ll come after you if he wants to. You are an amazing and beautiful person. If he can’t see that, he’s not worth your time!"
    },
    {
      "title": "Letting your boyfriend be the first to apologize will let him feel heard.",
      "content": "Letting your boyfriend be the first to apologize will let him feel heard. Emotions are running high, but give him the chance to take the first step. This will strengthen your relationship and also prove that he’s learned his lesson. [8] X Research source He might find it hard taking the first step, so be patient with him. Maybe he texts you asking if you can meet him somewhere, or he slowly steps into the room waiting for the right moment. Let him come in his own time, and listen to everything he has to say."
    },
    {
      "title": "Taking some time to focus on yourself will teach him you can live without him.",
      "content": "Taking some time to focus on yourself will teach him you can live without him. It can be easy to fall into the pattern of doing things as a couple when you’re in a relationship, but who says you can’t do things without him? Take yourself on a date doing something you love or go to a spa to unwind. Don’t forget to document your adventures so he can see all the fun you’re having! Taking care of yourself is always important, especially when it comes to needing to teach your man a lesson. Your needs can come before his. Post photos on social media of your solo adventures. Teach your boyfriend that you can have just as much fun without him!"
    },
    {
      "title": "Socializing with other people will show him you're independent.",
      "content": "Socializing with other people will show him you're independent. Ignore your boyfriend by making an extra effort to reach out to new and old friends. Hanging out with other people will keep you busy and make him jealous that other people are getting your attention—ultimately forcing him to reflect on why you’re ignoring him and pushing him to change his behavior. A small dose of jealousy can be good for him! Jealousy helps people look at the world with a new perspective. Seeing you having fun with friends without him can help him realize he made a mistake and motivate him to make a change. [9] X Research source"
    },
    {
      "title": "Scheduling your day around yourself will make him realize he isn’t your world.",
      "content": "Scheduling your day around yourself will make him realize he isn’t your world. It may be tricky trying to avoid someone if you live in the same space together, so take this as an opportunity to set your own schedule. Rather than working around his schedule, work around yours. If you’ve always wanted to wake up early to go on a morning hike, do it! Do the things you’ve always wanted to do as if he weren’t there. This will teach him that you are worthy of his attention. He will start to miss being a part of your daily routine and want to make amends to be back in your life."
    },
    {
      "title": "Opening up about your feelings can strengthen your relationship.",
      "content": "Opening up about your feelings can strengthen your relationship. When you’re ready, talk to him about what’s going on. It’s okay if that’s today, tomorrow, or days away. Go to him when you’re comfortable and be honest about how you’re feeling. He might not know he hurt you, and he won’t ever know unless you tell him. [10] X Research source Your feelings are valid, and no one should make you think otherwise. If he truly cares for you, he will listen."
    }
  ]
}