{
  "url": "https://www.wikihow.com/Grow-Shallots",
  "title": "How to Grow Shallots",
  "steps": [
    {
      "title": "From seed, shallots are ready for harvest after about 100-120 days.",
      "content": "From seed, shallots are ready for harvest after about 100-120 days. Shallot seeds are produced by the flowering top of the plant and are small and dark in color. They can be started indoors or sown directly into the grown. Shallots grown from seed produce up to 4 bulbs and are ready for harvest after about 100 days. [1] X Research source Shallots grown from seed produce fewer bulbs than shallots grown from cloves."
    },
    {
      "title": "Shallots grown from cloves are ready after about 60-120 days.",
      "content": "Shallots grown from cloves are ready after about 60-120 days. Cloves are the separate sections of a shallot bulb. It’s actually much more common to plant a clove instead of a seed to grow a shallot because they’re more likely to reach maturity and they’ll produce more bulbs by the time they’re ready for harvest. [2] X Research source"
    },
    {
      "title": "Plant seeds about 4 weeks before the average last frost in your region.",
      "content": "Plant seeds about 4 weeks before the average last frost in your region. Shallots can tolerate frost, but they’ll thrive and grow into healthy productive plants if you time your planting according to the last frost. Look up the average last frost date in your area online and plant your seeds in the soil about a month before it. [3] X Research source For instance, if the last expected frost date in your area is April 5, then plant the seeds around March 5."
    },
    {
      "title": "Plant bulbs in fall or early to mid-spring.",
      "content": "Plant bulbs in fall or early to mid-spring. Shallot bulbs are a little hardier than seeds so they can be planted a little longer before the last expected frost. Break bulbs into individual cloves and plant them about 1 inch (2.5 cm) deep so the tops are just covered. Space the cloves about 6 inches (15 cm) apart in rows spaced 12 inches (30 cm) apart. [4] X Research source You can also actually cut larger cloves into smaller pieces and plant the individual pieces. Just make sure the head of the clove has some root on it."
    },
    {
      "title": "Plant seeds about 1⁄2 inch (1.3 cm) deep.",
      "content": "Plant seeds about 1 ⁄ 2 inch (1.3 cm) deep. Make a small hole in the soil and drop a seed into it. Plant your seeds in rows spaced out 10–18 inches (25–46 cm) apart and water the soil when you’re finished. [5] X Research source"
    },
    {
      "title": "Break bulbs into cloves and plant them about 1 inch (2.5 cm) deep.",
      "content": "Break bulbs into cloves and plant them about 1 inch (2.5 cm) deep. Bury them in the soil so the tops are just covered with the pointy end facing up. Space the cloves about 6 inches (15 cm) apart in rows spaced 12 inches (30 cm) apart. [6] X Research source"
    },
    {
      "title": "Space your shallots at least 6 inches (15 cm) apart.",
      "content": "Space your shallots at least 6 inches (15 cm) apart. Shallots need a decent amount of room so their bulbs can develop and grow. Stick to at least 6 inches (15 cm) of space for seeds or cloves so they can grow and develop into healthy bulbs. [7] X Research source"
    },
    {
      "title": "Transplant the seedlings about 4-5 weeks before the last expected frost.",
      "content": "Transplant the seedlings about 4-5 weeks before the last expected frost. You can start shallot seeds as early as 10-12 weeks before the last expected frost date. About a month or so before the frost date, transplant them into their containers or into the ground so they can start to grow into mature plants. [8] X Research source Starting shallot seeds in seed starting trays or small pots is a great way to let them grow into more established seedlings before you transfer them to grow in the ground or in larger containers"
    },
    {
      "title": "They prefer full sun, but will tolerate partial shade.",
      "content": "They prefer full sun, but will tolerate partial shade. If you’re planting your shallots outside, try to choose a location with good drainage and full sun. For pot plants, choose a bright, sunny spot such as a windowsill. While shallots thrive in full sun, they can still grow and produce healthy bulbs in partial sunlight. [9] X Research source"
    },
    {
      "title": "Choose an area with good drainage if you’re planting outside.",
      "content": "Choose an area with good drainage if you’re planting outside. Shallots can rot if they sit for too long in over-saturated soil. Look for an area in your yard that doesn’t hold water after a storm to identify locations with good drainage and plant your shallots there. [10] X Research source"
    },
    {
      "title": "Water the soil enough to keep it moist but not saturated.",
      "content": "Water the soil enough to keep it moist but not saturated. Shallots prefer moist soil, but you may not need to water them every day. Check the soil to see if it’s dry. If it is, water it. If it’s still slightly damp, don’t add more water so you don’t overwater them, which could potentially cause them to rot. [11] X Research source The amount that you need to water your shallots can vary depending on your climate. For instance, if your soil dries out faster, you may need to water them more often."
    },
    {
      "title": "Give the shallots a heavy feeder fertilizer in the spring.",
      "content": "Give the shallots a heavy feeder fertilizer in the spring. Heavy-feeders are plants that need lots of minerals and nutrients to thrive, such as tomatoes, cabbage, onions, and shallots. After you plant your shallots, give them a heavy feeder fertilizer according to the directions on the packaging to help them grow into healthy, strong plants. [12] X Research source You can find a heavy feeder fertilizer at your local garden supply store or nursery. You can also order it online."
    },
    {
      "title": "Yes!",
      "content": "Yes! Simply break the bulb apart into individual cloves. Plant the cloves deep enough to just cover the tops with the pointy end facing up. They’ll start to grow into entirely new plants that you can harvest somewhere between 60-120 days. [13] X Research source Avoid choosing shallots with sunken or soft spots on them."
    },
    {
      "title": "Yes, you can grow 2-3 shallots in an 8-inch (20cm) pot.",
      "content": "Yes, you can grow 2-3 shallots in an 8-inch (20cm) pot. Choose a pot that’s at least 8 inches (20cm) deep and fill it with quality gardening soil. Stick to no more than 3 cloves or seedlings per pot so they have plenty of room to develop a healthy root system. [14] X Research source Make sure the pot has drainage holes as well so your shallots won’t get waterlogged and potentially rot."
    },
    {
      "title": "Dig out the bulbs once the leaves begin to turn brown.",
      "content": "Dig out the bulbs once the leaves begin to turn brown. Dying leaves that are falling over are a sure sign that your shallots are ready to be harvested. Loosen the soil with a small shovel or hand trowel and remove the bulbs."
    },
    {
      "title": "Allow the bulbs to cure for at least 3 weeks.",
      "content": "Allow the bulbs to cure for at least 3 weeks. Place the harvested shallot bulbs in a shady, well-ventilated location and let them dry out. After about 3 weeks, pull off the dried tops and store them in a cool location until you’re ready to use them!"
    }
  ]
}