{
  "url": "https://www.wikihow.com/Lower-the-Action-on-an-Acoustic-Guitar",
  "title": "How to Lower the Action on an Acoustic Guitar",
  "steps": [
    {
      "title": "Check the straightness of the guitar neck.",
      "content": "Check the straightness of the guitar neck. To determine whether you need to adjust your truss rod to lower the action, you must first take a close look at the neck of your guitar to determine whether it is upbowed or backbowed. [2] X Research source An upbowed neck will bend up slightly when you hold the guitar flat in front of you, while a backbowed neck is going to bend downward slightly. To check the straightness of the neck, hold it at eye level and look straight down the neck, or lay it flat on a table or bench and look at the neck at eye level. There's another way to check the straightness of your guitar neck, but you'll need a helper. Press a string down at the first and 14th frets. Have your helper line up a ruler next to the string you're pressing down at the sixth fret. There should be approximately 0.01 of an inch (about 0.25 millimeters) between the string and the fret."
    },
    {
      "title": "Locate your guitar's truss rod.",
      "content": "Locate your guitar's truss rod. The truss rod is a slim, steel rod inside the neck of your guitar. You can find the adjusting nut either at the peghead or through the sound hole, depending on how your guitar is designed. [3] X Research source An adjustable truss rod is either one-way or two-way – also known as single-action or double-action. A one-way rod will only straighten the neck of your guitar against string tension and upbow, while a two-way rod can also correct a backbowed neck. With a one-way truss rod, there's no way to adjust a backbowed neck. However, if you have a newer guitar you typically have a two-way truss rod, since these became standard in the 1980s."
    },
    {
      "title": "Adjust your strings.",
      "content": "Adjust your strings. Particularly if your truss rod is only accessible through the sound hole, you'll want to loosen your strings before you attempt to adjust your truss rod. This will make it easier for you to get a tool into the sound hole and turn it. However, don't remove your strings entirely. Check the truss rod to see what kind of tool you're going to need for the job. Typically it will either have a nut or a hex key slot. If your truss rod is only accessible through the sound hole, you'll probably want a longer allen wrench or nut driver to turn it so you're not trying to stick your whole hand in the sound hole. If your truss rod is accessible from the headstock, you don't need to worry about the sound hole. You just need to unscrew the screws holding the truss rod cover in place. When you're adjusting the truss rod from the headstock, don't loosen your strings – you need to have them tuned to pitch so you have appropriate tension on the neck and can see the extent to which you're adjusting it."
    },
    {
      "title": "Turn the truss rod screw.",
      "content": "Turn the truss rod screw. Use your allen wrench or nut driver to slowly and gradually turn the truss rod screw. You may need to lubricate the truss rod nut, especially if you have an older guitar or the truss rod has never been turned. Remember \"righty-tighty, lefty-loosey.\" Turn the truss rod screw to the right to straighten an upbow, and to the left to straighten a backbow. Place a mark on the nut so you can tell where it was when you started. Don't turn the screw more than 1/8 of a turn at a time. This will keep you from adjusting too much."
    },
    {
      "title": "Retune your guitar.",
      "content": "Retune your guitar. After you've made your first 1/8 turn, you'll need to retune your guitar so you can check the distance between the strings and the frets and see whether you've corrected your problem. This isn't something you can just eyeball with loose strings. The neck must have correct tension on it for you to be able to tell whether you've straightened it enough or not."
    },
    {
      "title": "Repeat as necessary.",
      "content": "Repeat as necessary. If the first 1/8 turn didn't correct the upbow or backbow in your guitar's neck, give your truss screw another 1/8 turn, then retune your guitar and check again. Keep note of the mark you made. Don't turn the screw more than one complete rotation, as this can cause major damage to your guitar. [4] X Research source"
    },
    {
      "title": "Gather basic tools.",
      "content": "Gather basic tools. If you want to lower the action on an acoustic guitar by filing the notches on the nut, you'll need a set of nut files that corresponds to the gauge of string you're using. Since each string is a different thickness, you'll need a set of six nut files – one for each string. If you don't have a set of nut files, you can typically find them at a luthier supply shop, as well as at many music stores. You'll also need a feeler gauge so you can measure the action at each fret and file accordingly."
    },
    {
      "title": "Tune your guitar.",
      "content": "Tune your guitar. If it isn't already, you need to make sure all six strings of your guitar are in tune before you start measuring the action at the nut and making adjustments."
    },
    {
      "title": "Use a feeler gauge to measure the action at the first fret.",
      "content": "Use a feeler gauge to measure the action at the first fret. Place your feeler gauges right on top of the first fret so you can determine how much the nut needs to be filed down to lower the action. Use a ruler to measure first. It should be 0.3 inches or about 7.5 millimeters from the string to the first fret. If it's greater than that, keep checking the distance using larger feeler gauges until the string moves because the gauge is too big to fit. The distance between the string and the fret is the thickness of the largest feeler gauge that doesn't cause the string to move. Repeat this with each of the six strings."
    },
    {
      "title": "Loosen the sixth string.",
      "content": "Loosen the sixth string. Carefully loosen the string, only enough to pop it out of the nut without damaging the nut. Loosen it just enough that you can easily pop it out and thread it along the side of the nut."
    },
    {
      "title": "File the nut with the appropriate nut file.",
      "content": "File the nut with the appropriate nut file. Find the nut file that corresponds to the sixth string and get a piece of plastic or masonite to protect the headstock so you don't file the headstock while filing the nut. Place your nut file in the notch and file carefully, going in the direction of the headstock at the same angle. Only file a small amount at a time, as you cannot replace material once you've filed it down and you don't want to file it down too much. When you think you're done, replace the string, tune it, and measure it again to see if you need to refile or if you've corrected your problem."
    },
    {
      "title": "Repeat with each of the other strings.",
      "content": "Repeat with each of the other strings. Once you've got the notch for your sixth string filed correctly, you'll want to repeat the process with each of the other five strings to lower the action on your guitar at the nut."
    },
    {
      "title": "Identify your bridge and saddle.",
      "content": "Identify your bridge and saddle. The saddle is basically a long, skinny nut, usually made of bone or a synthetic material, that is inlayed at the bridge. To lower the action on an acoustic guitar you don't have to adjust the bridge in any way, you only have to adjust the saddle. The saddle serves the same purpose as the nut, controlling the height of the guitar strings. If you lowered the action at the nut, you must also lower the action at the bridge or your tone will be off. The strings are strung through the bridge, and their tension holds the saddle in place. It isn't glued in place. Saddles may be either straight or compensated. A compensated saddle is curved to compensate for the tone of the strings and help keep the guitar in tune. This is why if you want to lower the action at the bridge, you always sand down the bottom of the saddle, never the top."
    },
    {
      "title": "Measure your guitar's action at the bridge.",
      "content": "Measure your guitar's action at the bridge. Use a ruler to measure the distance between the sixth string and the 12th fret. You'll also want to measure the first string at the 12th fret. You don't need to measure the other strings. [5] X Research source Most acoustic guitars take 2/32 of an inch (about 1.5 millimeters) of action for the first string and 3/32 of an inch (about 2.3 millimeters) of action for the sixth string. If your action is more than that, you'll want to lower it."
    },
    {
      "title": "Loosen your strings.",
      "content": "Loosen your strings. Since the tension from the strings holds the saddle in place, you won't be able to take it out without first loosening the strings of your guitar. However, you should be able to leave them on the tuners. Use your string winder to detune your guitar until the strings are loose and floppy. Don't take your strings off the tuner."
    },
    {
      "title": "Remove the lower three strings.",
      "content": "Remove the lower three strings. You'll have to take your strings off if you want to get the saddle out, but there's no reason to remove all of your strings. This will just give you extra work and make the process take longer. The lower three strings should give you enough room to slide the saddle out, provided the other three strings are really loose and floppy. You still don't need to remove your strings from the tuners unless the strings go through the bridge. If you do have a string-thru bridge, this process will take a little longer because you'll have to remove the strings from the tuners as well to get the saddle out."
    },
    {
      "title": "Remove the saddle from the bridge.",
      "content": "Remove the saddle from the bridge. Once you've removed the lowest three strings, you should have enough room to slide the saddle out of its slot on the bridge. Do this very carefully. If it's wedged in there tightly, you may need a pair of pliers to grip it and pull it out safely without damaging your guitar"
    },
    {
      "title": "Sand down your saddle.",
      "content": "Sand down your saddle. Once the saddle is out of the bridge, you're ready to lower your action at the bridge. Take care to keep it even as you sand it, because an uneven saddle will ruin the tone of your guitar. [6] X Research source One way to do this is to place a piece of double-stick sand paper on a level table or work bench. Get the ruler you used before and determine how much you want to sand down your saddle. Mark your saddle across with a pencil. Then all you have to do is sand until you get to the pencil line. Keep in mind that if you sand your saddle down too low, your strings will be too long. You also don't want to take more than you need. Be cautious and only sand down a little at a time. You can always repeat the process if you didn't sand enough, but if you sand too much you won't be able to put it back."
    },
    {
      "title": "Replace the saddle and bridge.",
      "content": "Replace the saddle and bridge. Lift your strings and carefully slide the sanded saddle back into its slot. Then replace the bottom three strings that you removed and retune your guitar. [7] X Research source Measure the action again and play your guitar a little bit to see if you like it. You may want to repeat the process and sand down a little more. Keep in mind that industry standards are just that, but each guitarist has their own personal preference for how much action they like."
    }
  ]
}