{
  "url": "https://www.wikihow.com/Make-a-Shy-Person-Talk",
  "title": "How to Make a Shy Person Talk",
  "steps": [
    {
      "title": "Smile.",
      "content": "Smile. [1] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. Before making contact with the shy person, you can let them know you’re a friendly and inviting personality by flashing a genuine smile, as though you're smiling at an old friend, not a stranger. It’s a small, simple gesture, but it can do wonders to open up channels of communication and start building trust. This is because, unlike other body language and gestures which vary across different cultures and historical periods, smiling constitutes a universally positive signal. Smiling has even been shown to have positive psychological effects for the person who is smiling, so remember that your friendly face isn’t just a good tool for conversation. [2] X Research source"
    },
    {
      "title": "Make the first move.",
      "content": "Make the first move. Dealing with a shy person means you’ll probably have to extend the first overture. After smiling from a distance, approach the shy person with a warm greeting. Introduce yourself and have a topic ready so that you can get the conversation rolling immediately. For example, bring up a book you've been reading or a short, funny anecdote. [3] X Research source Taking the initiative and approaching first takes pressure off the other person and puts them at ease. [4] X Research source While you should try to avoid clichéd, boring comments about the weather, you don't need to find a dazzling, original greeting. A simple, \"Hi, how are you?\" will do the job just fine."
    },
    {
      "title": "Ask open-ended questions.",
      "content": "Ask open-ended questions. The best way to get a conversation started and keep it going is to ask questions. All questions aren’t equally helpful, though. Those which ask for a ‘yes’ or ‘no’ response will stop conversation dead in its tracks just as quickly as silence will, so make sure your questions are thoughtful and open-ended. [5] X Research source For example, instead of saying, \"Do you like this music?\" you might say, \"What kinds of music do you listen to?” Avoid controversial topics with someone you just met! Otherwise showing an interest in someone is a great way to make them like you instantly."
    },
    {
      "title": "Be an active listener.",
      "content": "Be an active listener. Being a good listener is one of the most important interpersonal skills and also one of the most difficult, so showing you’re a good listener will encourage the person to open up and trust you. [6] X Research source Show the person that you’re listening to them and engaged by making eye contact, keeping your face turned toward them, and nodding occasionally. [7] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. Ask follow-up questions or restate their points to confirm you are listening. [8] X Research source For example, if the person has just expressed an opinion or explained a complex idea, paraphrase what they've said in order to clarify that you've understood correctly. Try, \"So, what you're saying is...\""
    },
    {
      "title": "Look for signals that the person isn't engaged.",
      "content": "Look for signals that the person isn't engaged. Sometimes even your best efforts to make small talk will be fruitless. If the person you're talking to gives short, one-word answers, avoids eye contact, and steps back from you, chances are they're not just shy — they're also not interested in talking to you. Don't sweat it when this happens: you won't connect with everyone you ever talk to, so it's not a personal insult or failure when you don't hit it off. Cut your losses and move on to someone who's happy to talk. [9] X Research source This doesn't mean you have to be rude or abrupt. Smile, tell the person it was a pleasure meeting them, and excuse yourself."
    },
    {
      "title": "Avoid dominating the conversation.",
      "content": "Avoid dominating the conversation. A shy person’s reticence can make it tempting to fill the silence with your own chatter, but try to resist this impulse. Talking for extended periods of time may relieve the other person’s uncertainty and anxiety, but it’s unlikely to draw them out and get them talking. Keep asking questions about the other person and give them time to answer. It can help to remind yourself that, despite what pop culture might tell you, silence isn’t necessarily awkward. On the contrary, a meaningful pause can signal thoughtfulness and respect, so try not to panic the moment a wave of silence sets in. [10] X Research source If it feels like you're pulling teeth to get the other person to talk, you might want to consider wrapping up the conversation. You can do this in a graceful manner by excusing yourself to go get a drink or say hello to an acquaintance and making sure that you make eye contact before withdrawing. [11] X Research source"
    },
    {
      "title": "Steer the conversation to subjects the shy person likes.",
      "content": "Steer the conversation to subjects the shy person likes. Once you’ve uncovered a few things that the shy person enjoys, guide the conversation in the direction of these personal preferences. You can do this easily by playing the student and asking your interlocutor to explain or elaborate. [12] X Research source For example, if the person has revealed that they love cooking, you can say something like, \"I don't know much about cooking but I've always wanted to get better at it. How can I start doing that? What are some of your favorite recipes?\" These learning-centered questions will show your interest while getting the person talking about something they love and feel confident about. If you don’t share their interests, try to suspend judgment and avoid expressing your conflicting tastes. This doesn’t mean you have to lie or pander, though. Just try to keep an open mind and stay away from strong statements of disgust or disapproval."
    },
    {
      "title": "End on a positive note.",
      "content": "End on a positive note. Once you’ve concluded your conversation, make sure your interlocutor walks away feeling good about the interaction. You can do this by saying what a pleasure it was to talk or expressing interest in continuing the conversation at another time. If they walk away thinking that you appreciate and like them, they’ll be more likely to branch out and talk in the future. If you’re at a business or networking event, shake hands before you part ways. Friendly, personal contact is a good way to show respect and attentiveness while helping to leave a lasting, unique impression on your conversation partner."
    },
    {
      "title": "Invite the person to hang out.",
      "content": "Invite the person to hang out. If you’re trying to get closer to a shy acquaintance and develop a friendship, chances are that you’ll have to make the first move. Ask them if they’d like to meet up sometime soon, or send them a text asking if they’re busy. Be upfront about your interest in developing a friendship and, more likely than not, it will make them feel flattered and welcoming of your overtures. [13] X Research source If you’re in school or college, it can be an easy, no-pressure invitation to ask if they would like to go get some coffee and study or go to a campus event. If you know one another from work, see if they’d like to go out after work for a happy hour drink."
    },
    {
      "title": "Find activities you both enjoy.",
      "content": "Find activities you both enjoy. Going out for a meal, drinks, or coffee is usually a good way to get to know someone, but these kinds of talk-heavy activities can be intimidating or high-pressure for a shy person. You can alleviate this pressure by planning activities for the first few times you hang out together: a shared activity means that neither of you has to work continuously to support the conversation. It will also create shared memories that deepen and strengthen a friendship. [14] X Research source If you’re both sporty people, you can go for a hike or a bike ride. If one or both of you isn’t comfortable with this kind of activity, though, pick a more relaxed thing to do, such as seeing a movie or attending a community event."
    },
    {
      "title": "Don’t tell the person to speak up.",
      "content": "Don’t tell the person to speak up. A shy person already knows they're shy, so mentioning and drawing further attention to it won’t do any good. In fact, you’ll just make the person feel uncomfortably spotlighted and even attacked for something which comes innately. [15] X Research source You want to show them that you like and are interested in them just as they are, not that you’re trying to change them and their behavior in order to suit you. For example, avoid saying things like, \"You're so quiet! Why are you so quiet?\" or \"Stop being such a wallflower! Pipe up!\" If you want to encourage your shy friend open up, say something instead like, \"You always have such interesting stories, I'd love to hear more!\" If the shy person has done well by sustaining conversation for a while, give them a break. Take control of the conversation for a while or just keep the activities short and let them go."
    },
    {
      "title": "Wait a while to get personal.",
      "content": "Wait a while to get personal. [16] X Expert Source Eddy Baller Dating Coach Expert Interview. 7 February 2020. It can take time to break down the personal defense barriers of a shy person, so don’t rush the process. Keep talking points light and impersonal until you're well-acquainted. In general, this is good etiquette with anyone, but it’s particularly important when dealing with a shy person. [17] X Research source Touching on a sensitive personal issue or political hot-button can make the shy person feel vulnerable and retreat back into their shell, effectively undoing any progress you’ve made in the past. A good way to develop intimacy in a friendship is to divulge a secret or something personal from your life, or to acknowledge an insecurity of your own. This self-revealed vulnerability will make the shy person feel entrusted with your intimate feelings and more likely to share something personal with you in return. [18] X Research source Revealing your own insecurity may make the shy person feel okay about their own anxieties. Also be sure to avoid racy or dark humor. Racial, sexual, or extremely sarcastic jokes may offend the person or make them uncomfortable, so keep your banter breezy and PG-13."
    },
    {
      "title": "Introduce other friends gradually.",
      "content": "Introduce other friends gradually. Introducing your friends to one another can be a tricky business with no established etiquette, and it's made even more difficult when you’re dealing with a shy person. [19] X Research source Since it’s more difficult and takes longer to get to know a shy person, you might want to keep your hangout sessions one-on-one until you get more comfortable with one another. Letting other friends into the dynamic too soon can make the newcomer feel pushed out and more hesitant to open up, so wait a beat before you bring in the whole gang. You can help facilitate this by telling this person about your friends before they meet — knowing what to expect can help them feel more comfortable. Try introducing the person to others around you with a piece of information you learned about the person. For instance, “John have you met Allison? We were just talking about how much she loves traveling.” This will help the shy person make more connections and feel comfortable. If you met the shy person through your larger group of friends, this is less of an issue. You should still make time for the two of you to hang out one-on-one, though, in order to cultivate a unique friendship."
    },
    {
      "title": "Check in to find out how the other person is feeling.",
      "content": "Check in to find out how the other person is feeling. While a shy person will often open up after they begin feeling comfortable with a new acquaintance, they might revert to old, reserved ways when something bad happens or they’re struggling emotionally. Be a good friend by checking in and helping them to articulate these thoughts and feelings. The best way to get anyone to open up is to show them you're listening. Pick a time when the two of you are alone and ask, \"Hey, how have you been lately? What's been going on in your life?\" If you've noticed your friend has seemed withdrawn or depressed, you can gently bring it up by saying, \"It seems like you've been a bit down recently. Is there anything you want to talk about?\" [20] X Research source Make sure your friend knows that you're available and interested in the future as well. Reassure them by saying something like, \"I'm always here to listen if you want to talk.\""
    }
  ]
}