{
  "url": "https://www.wikihow.com/Lighten-Your-Hair-With-Cinnamon",
  "title": "How to Lighten Your Hair With Cinnamon",
  "steps": [
    {
      "title": "Assemble your ingredients.",
      "content": "Assemble your ingredients. Check your kitchen cupboards before going out and buying things. You may already have everything you need for this at-home hair lightener. Cinnamon. Buy sticks or ground cinnamon. Be sure to buy a lot because you will need multiple tablespoons per use. Honey. Raw honey works the best. If you can’t get raw honey, use pure honey. Conditioner. Any moisturizing conditioner will work. It will help your hair take in the chemicals. Lemon juice. If preferred, buy a lemon and juice it at home for the mixture. Shower cap. If you don’t want to buy a shower cap, you can use plastic wrap or a plastic grocery bag but be careful with this around your face."
    },
    {
      "title": "Create the mixture.",
      "content": "Create the mixture. Put the ingredients together in a bowl and mix well. 1 cup honey 1 cup deep conditioner 1 tsp. lemon juice 2 tbsp. cinnamon Leave it for at least half an hour. Honey contains hydrogen peroxide. When the cinnamon is mixed in, it activates the hydrogen peroxide. By letting the mixture sit, the hydrogen peroxide will develop and this is what will lighten your hair."
    },
    {
      "title": "Brush your hair.",
      "content": "Brush your hair. While you wait for the mixture to develop, comb your hair very well. Ensure all of the tangles are out of your hair. This way the mixture can take evenly to every strand. You can use this mixture with clean or dirty hair."
    },
    {
      "title": "Know what results you’re aiming for.",
      "content": "Know what results you’re aiming for. Lightening your hair with this cinnamon mixture is different than using straight hydrogen peroxide. Blondes: strawberry blond, some brown highlights Black: lighter brown, red tints (after several times) Red : red highlights, brown tints Light brown: lighter shades and red tints Dark brown: light brown and red"
    },
    {
      "title": "Dampen your hair.",
      "content": "Dampen your hair. You’ll need your hair to be wet, but not soaked, for this process. Use a spray bottle. If you don’t want to step into the shower, use a small spray bottle to dampen your hair. Wet your brush. Run the wet brush through your hair. This will help the mixture grab onto each strand."
    },
    {
      "title": "Test the mixture.",
      "content": "Test the mixture. Before you apply the mixture to your hair, be sure to test some of it on your hand. If your skin has a reaction, don’t apply the mixture. There is such a thing as a cinnamon allergy. Rub some of the cinnamon paste onto the back of your hand and let it sit for 5-10 minutes to make sure you don’t react. Cinnamon creates a warm tingle but shouldn’t burn; if you have a sensitive scalp, this treatment is not recommended. If it does burn, rinse immediately!"
    },
    {
      "title": "Apply the mixture.",
      "content": "Apply the mixture. This will be messy! Have a friend help you if you can. As an alternative, use an applicator brush instead of your hands, which will cut down on the mess. Rub the mixture all over your hands. Apply thoroughly from root to tip. Be sure to use generous amounts of the mixture throughout your hair. If the mixture is too thick, add ¼ cup of water to it. If you have thick hair, split it into sections before you apply the mixture. Use hair clips to hold your hair out of the way until you're ready to apply the mixture to it. Be careful to keep the mixture off your neck, as it may irritate the skin there."
    },
    {
      "title": "Let it sit.",
      "content": "Let it sit. Give the mixture time to lighten your hair while you sit back and relax. Put your hair in a bun and cover it. You can use a shower cap to easily cover your hair. Leave the mixture in your hair for at least 2-4 hours. If possible, leave it overnight. Put a towel over your pillow. Even if you have a shower cap on, the mixture could make a big mess if you move in your sleep. Put a towel over your pillow to protect it."
    },
    {
      "title": "Clean your hair.",
      "content": "Clean your hair. Be patient. Even though the honey is sticky, it’s the cinnamon that will give you the most difficulty when you’re cleaning the mixture from your hair. Rinse your hair. Before trying to wash your hair, do your best to rinse the mixture out of it. Shampoo your hair. Once you’ve rinsed all that you can out of your hair, shampoo thoroughly. You may need to shampoo twice to get all of the cinnamon out."
    },
    {
      "title": "Repeat as necessary.",
      "content": "Repeat as necessary. Unlike bleach, this mixture won’t create a drastic change. Since the mixture is good for your hair, you can repeat it as many times as you’d like without damage. Do this until you get your desired shade. Lightening your hair with cinnamon is a gradual process. It will only subtly change the color of your hair with each use. It may take three to four applications before your hair becomes noticeably lighter."
    },
    {
      "title": "Try olive oil instead of conditioner.",
      "content": "Try olive oil instead of conditioner. If you’re looking to use a completely natural mixture, olive oil can replace the conditioner. Olive oil is a great moisturizer, but don’t use it if your hair is naturally greasy. The olive oil will be tougher to rinse out than conditioner. This natural conditioner is great for curly hair. If you have dry curls, the olive oil will soak right into your hair and moisturize them."
    },
    {
      "title": "Use cardamom.",
      "content": "Use cardamom. Cardamom is a spice that is a peroxide booster. Therefore, it has similar lightening powers to cinnamon. This spice can be used in place of cinnamon for similar results. Try this if you have an allergic reaction to the cinnamon."
    },
    {
      "title": "Add vitamin C.",
      "content": "Add vitamin C. This is an easy way to add nutrients to your mixture. Vitamin C is one of the most effective nutrients to help grow and strengthen hair. [1] X Research source Crush up a couple vitamin C tablets and add them to the mixture. The vitamin C will help lighten your hair and keep it healthy. [2] X Research source"
    }
  ]
}