{
  "url": "https://www.wikihow.com/Have-a-Discreet-Bowel-Movement-at-Your-New-Boyfriend%27s-House",
  "title": "How to Have a Discreet Bowel Movement at Your New Boyfriend's House",
  "steps": [
    {
      "title": "Tell him the truth.",
      "content": "Tell him the truth. This is a natural cycle, everyone does it, including your boyfriend. One of the best way to deal with your insecurities is to be honest and joke about it. This not only tells that you are secure but also tells that you are cool. Say something like \"I was making room for the dinner.....\" or \"I just unloaded in the toilet and now I feel so light\" humorously. Remember it matters only if you think it matters. if you feel uncomfortable about it, he would too. Most guys are quite casual and much easier to talk to. If the guy minds after you take a dump in his bathroom, then probably you should find another guy. Keep this in mind, guys feel the same way."
    },
    {
      "title": "Tell him you are going to take a quick shower.",
      "content": "Tell him you are going to take a quick shower. If it is appropriate for your situation, this is great because he thinks you are taking a shower. Turn on the shower to mask the sound of plopping. However, beware that: The smell will be worse in a humid environment so use cold water"
    },
    {
      "title": "Flush as you plop.",
      "content": "Flush as you plop. Pretty self explanatory. If its not going to be super weird for you to flush four or five times, then time your plops to the same time as the loud flushing noise. Beware : You must time everything properly! The loud part of the flush is not for a few seconds after you've pushed the lever."
    },
    {
      "title": "Put some toilet paper into the toilet before you begin.",
      "content": "Put some toilet paper into the toilet before you begin. This absorbs the plop and thus prevents that telling backsplash noise. Beware, it will smell worse if you use this method because the specimen is not submerged fully into the water."
    },
    {
      "title": "Turn up the radio before you leave, saying that you love this song.",
      "content": "Turn up the radio before you leave, saying that you love this song. Then after a minute of dancing or singing along, excuse yourself. Chances are, he'll leave the radio up loud until you come back."
    },
    {
      "title": "Use the bathroom spray or, barring that, perfume, before you drop one and after.",
      "content": "Use the bathroom spray or, barring that, perfume, before you drop one and after. Most people wait until after. Do not make this mistake."
    },
    {
      "title": "Crack a window or light a match, but these are both telltale poop smell concealers.",
      "content": "Crack a window or light a match, but these are both telltale poop smell concealers."
    },
    {
      "title": "Wait to go until right after he goes.",
      "content": "Wait to go until right after he goes. If you can wait, it is best. That way, the smell has a chance to disappear by the time he needs to go in there again."
    },
    {
      "title": "Take advantage if multiple flushes aren't a problem.",
      "content": "Take advantage if multiple flushes aren't a problem. The less time poop is sitting in the toilet, the less chance is has to stink up the room."
    }
  ]
}