{
  "url": "https://www.wikihow.com/Keep-a-Secret-Diary",
  "title": "How to Keep a Secret Diary",
  "steps": [
    {
      "title": "Keep your thoughts in a simple, plain book.",
      "content": "Keep your thoughts in a simple, plain book. Write down your journal entries in a book that isn't labelled and doesn't draw much attention to itself. This way, wandering eyes won't be able to spot the diary. [1] X Research source Put the diary in an obscure part of your room to ensure privacy."
    },
    {
      "title": "Begin each entry with a blank page.",
      "content": "Begin each entry with a blank page. You can also start each entry with a page that indicates your desire for the journal not to be read by anyone else. If someone opens your diary and sees a blank page, they'll know it's private and not for their eyes. [2] X Research source You can write things like “private” or “don't read” on the page preceding an entry to really get the point across."
    },
    {
      "title": "Use abbreviations and shorthand that only you can understand.",
      "content": "Use abbreviations and shorthand that only you can understand. On the off chance that someone else does read your diary, it would be difficult for them to get anything out of it if you use shorthand with which only you are familiar. For example, if you're writing about a negative situation, use code words to portray the people involved. [3] X Research source Keep a reference sheet separate from your diary if you need to keep track of your shorthand. This way, when you go back and read your previous write-ups, you won't be confused about what you meant to say."
    },
    {
      "title": "Purchase a diary with a lock to keep your thoughts private.",
      "content": "Purchase a diary with a lock to keep your thoughts private. You can buy a journal that has a traditional lock and key or one that requires you to punch in a passcode to open it. Some of these diaries can get expensive and cost more than 100 dollars, but you can obtain a solid, secure diary for around 25 bucks. [4] X Research source It's possible to find this type of diary in stores, but looking for one online would be your best bet."
    },
    {
      "title": "Buy a safe to keep your diary secure when you're not using it.",
      "content": "Buy a safe to keep your diary secure when you're not using it. If you don't feel comfortable having your journal out in the open, buy a safe online or at a local home improvement store. A small safe can cost fewer than 50 dollars. [5] X Research source Safes are a great idea if you are living in a college dorm and want to keep your journal private."
    },
    {
      "title": "Archive your entries in a hidden folder on your computer.",
      "content": "Archive your entries in a hidden folder on your computer. If you want to keep a digital diary but don't feel comfortable putting it on the internet, save it in a hidden folder on your password-protected computer. This way, you can gather all the documents that make up your digital journal in one location, but also feel certain that they won't be leaked to others on the web. If you have a Windows computer, select the files you want to hide, right-click on them and choose “Properties”. Then, click the “General” tab and select the checkbox next to “Hidden” in the “Attributes” section. Click “Apply” to finish the process. On a Mac, use a quick Terminal command to hide the folders. Press “Command” and the space bar and type “Terminal” into the search bar. Double-click the first search result and type the name of the file followed by “hidden /path/to/file-or-folder/”. [6] X Research source"
    },
    {
      "title": "Download an app that specializes in private journaling.",
      "content": "Download an app that specializes in private journaling. There are numerous journaling apps that let you keep your writing private and come with other fantastic features. These include sharing specific posts with friends of your choosing, searching past entries, and adding photos to certain posts. You can also customize the layout of your journal. [7] X Research source Many of these journaling apps are free, but you can pay for them to get extra features. For a small monthly fee, you can fully encrypt your diary and even keep multiple journals at once!"
    },
    {
      "title": "Start a private blog on a blogging platform.",
      "content": "Start a private blog on a blogging platform. A blogging platform gives full control over how you want your diary to look and allows you to share your work with specific people without needing to make your entries public. It's also far less complicated than hiding files on your personal computer. Best of all, these platforms are free to use! When you go to post a journal entry, make sure you select “private” so no one else can see it. [8] X Research source Another alternative is to download blogging software instead of just setting up an account online. This way, your diary will still be protected, and you can access it even if you're offline."
    },
    {
      "title": "Store your journal entries on Dropbox.",
      "content": "Store your journal entries on Dropbox. This method is much simpler than using a blogging platform because it allows you to write in your preferred text editor or word processor and then upload the entries to Dropbox, a password-protected file hosting service. Like the blogging platforms mentioned above, it has an app which allows you to access your work from any of your devices. [9] X Research source While it is entirely possible to just keep your entries on your personal computer, using an app, blogging platform, or Dropbox gives you access to your diary at all times. You never know when inspiration will strike, so try and keep your journal accessible at all times."
    },
    {
      "title": "Encrypt your journal for ultimate privacy.",
      "content": "Encrypt your journal for ultimate privacy. Encrypting your diary means that you'll need a password or some decryption key to gain access to your work. Doing this will prevent you from accessing your diary quickly, but encryption will keep your writing secure. To encrypt files on Windows, right-click on the file or folder and hit “Properties”. On the General tab, click the advanced button. Select the box that says “Encrypt contents to secure data”, then click OK. For a Mac, put your diary file in a folder, then go to Finder>Applications>Utilities>Disk Utility. In the menu bar, click Files>New Image>New Image from Folder. Then choose the name of the disk, and where to save it to. Then, select either option under encryption, and insert the password you want to use. To keep your diary secure, delete the original folder, which removes the unencrypted copy. If you go this route, write down your journal entries in a paper diary. If your files get corrupted at any point, it can be extremely difficult for you to retrieve your encrypted work."
    }
  ]
}