{
  "url": "https://www.wikihow.com/Get-a-Sick-Kitten-to-Eat",
  "title": "How to Get a Sick Kitten to Eat",
  "steps": [
    {
      "title": "Offer small amounts at frequent intervals.",
      "content": "Offer small amounts at frequent intervals. When your kitten is sick, the best approach is to offer smaller portions, but more often. Thus, offering a mouthful every one to two hours is ideal, as long as you are not waking the kitten up for feedings. Note that very young kittens should be woken up for frequent feedings. [1] X Research source"
    },
    {
      "title": "Change your kitten’s food brand.",
      "content": "Change your kitten’s food brand. Sometimes sick kittens do not feel like eating their regular food and have to be given something different just to make them more interested in eating. By changing the brand or flavor, you might be able to get your kitten interested enough to taste some of the food. When your kitten is sick even getting a little amount of food in him can make a difference. [2] X Research source Here are a few foods that are easier for kittens to eat: Gravy-based cat food Packaged chicken-flavored baby food Boiled chicken [3] X Research source Unseasoned, cooked rice"
    },
    {
      "title": "Ask your veterinarian about a convalescent diet.",
      "content": "Ask your veterinarian about a convalescent diet. Convalescent diets are specially designed to meet the needs of a sick animal that is not eating well. They are extremely nutrient dense, so a 1 kg (2.2 lb) kitten might receive his daily calorie needs from just under a third of a tin. The two most widely available diets are Hills AD (suitable for cats and dogs), and Royal Canin Feline Convalescent Diet. These highly palatable diets include: Protein, which provides building blocks for repair of body tissues and strengthens the immune system. Fats and carbohydrates, which provide metabolic energy for the kitten to run his organs and fight infection. Zinc and potassium, which aid wound healing. Vitamins E and C, plus Taurine, which have antioxidant properties to help the body detox, and also fortify the immune system"
    },
    {
      "title": "Try heating the food.",
      "content": "Try heating the food. If your kitten has a congested nose, he will stop eating for two reasons--he can’t smell the food and it is difficult to eat with a clogged up nose. Try heating the food a little bit (not more than 30 seconds in the microwave) and then serve it. Heating will enhance the aroma of the food and most likely lure the kitten into eating some of it. Warm food also tastes better. Cleaning a kitten’s congested nose with nasal drops can also help in encouraging him to eat."
    },
    {
      "title": "Do not hide medicine in your kitten’s food.",
      "content": "Do not hide medicine in your kitten’s food. A sick kitten needs his medicine, but never make the mistake of hiding his medicine in his food. Kittens can detect medicine — both through taste and smell — and will not eat food with medicine in it. Hiding the medicine will only ensure that your kitten will not come near the food next time, whether there is medicine in it or not. Keep medicine separate and force feed it at regular intervals. It will be an unpleasant task and the kitten will not like it, but this is something you have to do."
    },
    {
      "title": "Make sure your kitten stays hydrated.",
      "content": "Make sure your kitten stays hydrated. It is very important to make sure that your kitten is getting enough water and is staying hydrated. Dehydration in kittens can be a very serious problem and when they are sick it becomes even more serious. If your kitten refuses to drink water, try adding some water to her food. Not only will it make the food more palatable, it will also hydrate her at the same time. The first thing to check when your kitten refuses to drink water is whether his water dish is clean or not. Kittens do not like to drink water from an unclean surface."
    },
    {
      "title": "Try finger feeding your kitten.",
      "content": "Try finger feeding your kitten. Put a small amount of food on your finger and bring it to the kitten’s mouth. Try not to force your finger into the kitten’s mouth as it will irritate him. Let him lick the food at his own pace and be patient."
    },
    {
      "title": "Try feeding your kitten via syringe.",
      "content": "Try feeding your kitten via syringe. If finger feeding does not work, give syringe feeding a try. You'll need a clean syringe with the needle removed, filled with a liquid food. Hold the kitten gently and insert the syringe in his mouth at an angle. Do not insert it straight into his mouth as doing so will make the food go straight to the back of his throat and could cause your kitten to choke. Bend it to the right or left side and squeeze a small amount of food onto the back of the tongue. The kitten will swallow the food that is on the back of the tongue. Repeat the process several times until you think he has had enough to eat, varying the position of the syringe to avoid rubbing the mouth too much in one spot. Try using a milk replacer powder for cats if you don't have a liquid food prescribed by a vet. Do not use ordinary milk. The food should be at room temperature, or preferably slightly warmer but not hot."
    },
    {
      "title": "Give your kitten meloxicam if they are over six weeks old.",
      "content": "Give your kitten meloxicam if they are over six weeks old. Meloxicam (also known as Metacam) belongs to a family of drugs called NSAIDs (Non-Steroidal Anti-inflammatory Drugs). Meloxicam works by inhibiting an enzyme, COX-2, which triggers prostaglandin release, which in turn limits the inflammation that leads to fever. Meloxicam is a useful drug to reduce fever. Meloxicam is only for kittens over six weeks of age, and only if no sickness or diarrhea. Meloxicam needs to be given with food lining the stomach, so never dose your kitten with meloxicam if they are not eating at all. The recommended maintenance dose is 0.05mg/kg one daily of feline meloxicam. Thus, a 1 kg (2.2 lb) kitten needs 0.1ml of cat Metacam. Note that meloxicam is formulated in two strengths: for dogs (1.5mg/ml) and for cats (0.5mg/ml). Dog Metacam is three times more concentrated, and extreme care should be taken when considering its use in the feline as inadvertent overdose may easily occur. Meloxicam should only be used in well hydrated animals. Dehydrated animals may have impaired renal function; the additional decrease in blood supply to the kidney may tip the animal into renal failure. Meloxicam must be given with or after food. If the cat is not eating, be sure to line his stomach by syringe feeding a small amount of food. Do not give Metacam on a completely empty stomach. The inhibitory effect on the blood supply to the stomach will be exacerbated, which can lead to serious gastric ulceration. Do not give meloxicam with or after other NSAIDs or steroids. Doing so can cause gastric ulceration, gastro-intestinal ulceration, and bleeding -- with possibly fatal blood loss."
    },
    {
      "title": "Keep your kitten warm.",
      "content": "Keep your kitten warm. A chilled kitten will feel sluggish and be slower to recover, which will make it more difficult to get him to eat."
    },
    {
      "title": "Provide a comfortable nesting space.",
      "content": "Provide a comfortable nesting space. Sick kittens feel vulnerable, and they will recover more effectively if they have a place to hide. Provide a nesting area or cardboard box lined with blankets."
    },
    {
      "title": "Seek veterinary care if necessary.",
      "content": "Seek veterinary care if necessary. If your kitten seems very ill, or if your kitten's symptoms persist for more than a day or so, see a veterinarian."
    },
    {
      "title": "Look for signs that your kitten might be depressed.",
      "content": "Look for signs that your kitten might be depressed. Aside from eating, there several signs that your kitten is depressed. These include a lack of energy and sleeping more than usual, loss of interest in her regular activities, becoming reclusive, or showing aggressive behavior."
    },
    {
      "title": "Spend more time with your kitten.",
      "content": "Spend more time with your kitten. The most common reason that kittens become depressed is because they are not shown enough attention. To combat your kitten’s depression and get her to start eating again, play with her and show her love as much as you can. Hold her while you are working or watching a movie, play with her in the mornings and afternoons, and praise her with treats and affection."
    },
    {
      "title": "Find things that will entertain your kitten.",
      "content": "Find things that will entertain your kitten. You can’t always be home to play with your kitten. Invest in some toys that will keep your kitten entertained while you are away. Climbing trees, toys, scratching posts, and food puzzles are all great ways to keep your kitten entertained while you are away. [4] X Research source Consider getting your kitten a friend. If you can afford to do so, you may want to bring another kitten into your home so that each kitten will have someone else to play with; however, it's important to keep in mind that integrating a new kitten can get harder as your original kitten gets older."
    },
    {
      "title": "Consider whether or not your kitten is depressed because she is sick.",
      "content": "Consider whether or not your kitten is depressed because she is sick. If you pay a lot of attention to your kitten and are constantly showing her love, she is probably not depressed because you don’t play with her. Instead, she is probably depressed because she is in pain in some way, either through sickness or because she got hurt. If you can’t seem to figure out what is ailing your kitten, take her to the vet. Kittens should be playful and alert. The most likely reason for a kitten to be depressed is immediately after homing. If you have owned the kitten for a while and she is quiet, then it's more likely there is a health problem."
    },
    {
      "title": "Use appetite stimulants as a last resort.",
      "content": "Use appetite stimulants as a last resort. Some drugs have a stimulatory effect on appetite. These are usually a treatment of last resort in kittens for several reasons. First, many of the drugs are human medications, so breaking the tablets down to provide a small enough dose is extremely difficult. Second, young kittens do not have fully developed hepatic and renal function. These organs are not yet operating to maximum capacity to break drugs down, and so the kitten is potentially more vulnerable to overdose toxicity than an adult cat. Lastly, these drugs have been known to cause unpleasant side effects even in smaller doses. [5] X Research source When your kitten is not eating because of a health problem, it is important to diagnose the underlying problem rather than mask the signs."
    },
    {
      "title": "Ask a vet for advice.",
      "content": "Ask a vet for advice. A qualified animal care professional should make the decision on which drug to prescribe your kitten, if any. The most common options are described below so you can ask a veterinarian about them, and understand the general function and dosage."
    },
    {
      "title": "Consider mirtazapine.",
      "content": "Consider mirtazapine. This is a human medication from the tricyclic antidepressant group. No information is available as to why, but it is noted that it has a stimulatory effect on appetite in cats. The smallest tablet size available is 15 mg, and the dose per cat is 3.5mg, equivalent to a quarter of a tablet. For a small kitten weighing less than a kg (2.2 lb) it is extremely difficult to calculate a proper dose, and you end up giving a small crumb of a tablet. This dose can be repeated once every three days."
    },
    {
      "title": "Investigate cyproheptadine.",
      "content": "Investigate cyproheptadine. This is another human medication. It is an antihistamine and a serotonin re-uptake inhibitor. Again, the mechanism is not understood, but this medication stimulates appetite in cats. The dose is 0.1 – 0.5mg/kg given by mouth two or three times daily. The smallest tablet size is 4 mg, and so (just as for mirtazapine) it is extremely difficult to cut the tablet accurately into small enough pieces. As an example, a 1 kg (2.2 lb) kitten require one eighth of a 4 mg pill, and it should be kept in mind that many kittens do not reach 1 kg (2.2 lb) until they are 3 months old."
    },
    {
      "title": "Ask about intravenous diazepam.",
      "content": "Ask about intravenous diazepam. Some cats have an idiosyncratic reaction such that a one-off dose of intravenous diazepam makes them very hungry. This only works by IV, and in small kittens it can be very difficult to find a vein large enough to catheterize. The dose is 0.5-1.0 mg/kg given once only, intravenously. Thus a 1 kg (2.2 lb) kitten requires 0.2ml of a vial of 5mg/ml emulsion of injectable diazepam. This is a treatment of last resort because it is also associated with an unpredictable side effect that causes liver failure."
    },
    {
      "title": "Suggest Vitamin B injections.",
      "content": "Suggest Vitamin B injections. Vitamin B plays an important role in maintaining appetite. If the level of Vitamin B, specifically cobalamin, falls too low in the bowel wall, or in the blood stream, then the kitten's appetite can fail. This is easily rectified by four, weekly subcutaneous injections of a multi B vit injection. A typical dose is 0.25 milliliters (0.0085 fl oz) given by subcutaneous injection once every four weeks."
    },
    {
      "title": "Use caution with one-off steroid injections.",
      "content": "Use caution with one-off steroid injections. A side effect of steroid is appetite stimulation. In most cases of sick kittens this option would not be used because steroids also suppress the immune system, which could weaken the kitten's ability to fight off infection. If however, the kitten is protected with antibiotics, and the vet assesses that steroid is unlikely to worsen the existing infection, then a one-off dose of steroid to kick start the appetite may be appropriate. The dose range is wide, ranging from 0.01 – 4 mg/kg of dexamethasone, but a conservatively low dose is advisable for the purpose of appetite stimulation. Thus a 1 kg (2.2 kg) kitten requires 0.5mg of dexamethasone, which in a formulation containing 2mg/ml equates to 0.25ml by intramuscular injection."
    }
  ]
}