{
  "url": "https://www.wikihow.com/Give-an-Intradermal-Injection",
  "title": "How to Give an Intradermal Injection",
  "steps": [
    {
      "title": "Prepare the medication.",
      "content": "Prepare the medication. Check the physician’s orders, MAR (medical administration record), and the Parenteral Drug Therapy Manual (PDTM) to identify the correct medication to be administered. Then prepare the medication by sticking the syringe into the appropriate vial. [1] X Research source Make sure to fill the syringe with an appropriate amount of medication. The dosage of an intradermal injection is typically below 0.5 mL."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Place non-sterile gloves, a syringe, alcohol swabs, and gauze on a tray. Place the tray near your workstation. [2] X Research source Make sure the needle you are using is a 3 ⁄ 8 to 3 ⁄ 4 inch (1.0 to 1.9 cm), 25- to 28-gauge needle. Non-sterile medical gloves are typically used for medical procedures that are non-surgical."
    },
    {
      "title": "Explain the procedure to the patient.",
      "content": "Explain the procedure to the patient. Introduce yourself to the patient. To reduce the patient’s anxiety about the procedure, explain to the patient why the procedure is being done and what it will entail. [3] X Research source Also, allow the patient to express any concerns and to ask questions before you begin."
    },
    {
      "title": "Wash your hands and put on gloves.",
      "content": "Wash your hands and put on gloves. To avoid any kind of contamination, make sure to wash your hands thoroughly with soap and water. Lather your hands with soap for at least 20 seconds and rinse with warm water. Before turning off the water, dry your hands with paper towels and use the paper towels to turn off the faucet. Once your hands are dry, put on your medical gloves to prepare for the procedure. [4] X Research source"
    },
    {
      "title": "Choose the injection site.",
      "content": "Choose the injection site. Intradermal injections are usually given on the inner surface of the forearm. Choose an injection site that is free of hair, moles, rashes, scars, and other skin lesions. [5] X Research source Intradermal injections can also be administered on the patient’s thigh or the back of their upper arm. Ask the patient where they prefer you to administer the medication."
    },
    {
      "title": "Double check the medication and patient.",
      "content": "Double check the medication and patient. Ensure you have the correct medication and dosage. You should also double-check the patient’s name and date of birth to be sure you are administering the correct medication to the correct person. Ensure the patient knows what you are administering. [6] X Research source You could say, “The doctor ordered ‘xyz medication.’ Is this what you were expecting?”"
    },
    {
      "title": "Position the patient.",
      "content": "Position the patient. If you are giving the injection through the patient’s inner forearm, then position their arm with their palm facing up. Their arm should be relaxed with their elbow flexed."
    },
    {
      "title": "Clean the injection site.",
      "content": "Clean the injection site. Using a firm, circular motion, wipe the injection site with the antiseptic or alcohol swab. Let the injection site dry completely before proceeding. [7] X Research source By allowing the skin to dry completely before inserting the needle, you can prevent alcohol and pathogens from entering the skin when the needle is inserted. Since intradermal injections do not involve the penetration of major blood vessels, you do not need to aspirate the syringe."
    },
    {
      "title": "Pull the skin taut.",
      "content": "Pull the skin taut. Use your non-dominant hand to do this. Place your thumb below the injection site and your middle finger above it. Use these fingers to gently pull the skin taut to ensure easy penetration of the needle. [8] X Research source Try to avoid moving the skin to the side or drawing the skin too far back."
    },
    {
      "title": "Hold the needle at a 10° to 15° angle.",
      "content": "Hold the needle at a 10° to 15° angle. Use your dominant hand to hold the syringe parallel to the patient’s arm. The bevel should be facing up. Slightly angle the needle so that it is at a 10° to 15° angle relative to the skin. [9] X Research source Make sure to place your fingers and thumb on the sides of the barrel. If they are underneath the barrel, this can cause the angle of insertion to go beyond 15°."
    },
    {
      "title": "Insert the needle into the skin.",
      "content": "Insert the needle into the skin. Slowly insert the needle into the patient’s skin until it is 1 ⁄ 4 inch (6.4 mm) in, or the entire bevel is under the skin. Once the syringe is in place, remove your non-dominant hand to release the tension surrounding the injection site. Use this hand to push the plunger in to administer the medication. [10] X Research source"
    },
    {
      "title": "Look for the formation of a weal or a bleb.",
      "content": "Look for the formation of a weal or a bleb. Do this as you are administering the medication. A weal or bleb is an area of the skin that is raised like a blister or bubble. The presence of a weal indicates that the medicine has been administered into the dermis properly. [11] X Research source If a weal or bleb does not form, then remove the needle and repeat the procedure on another site. [12] X Research source"
    },
    {
      "title": "Remove the needle.",
      "content": "Remove the needle. Do this once all of the medication has been administered. Slowly remove the needle at an angle that is the same as the insertion angle. This will help minimize damage to the tissues at the injection site and discomfort to the patient. [13] X Research source"
    },
    {
      "title": "Gently pat the site with gauze if there’s blood.",
      "content": "Gently pat the site with gauze if there’s blood. Sometimes, a small amount of blood will seep out after you remove the needle. If this happens, lightly dab the area with clean gauze. Try to avoid massaging the injection site. By massaging the area, you could cause the medication to spread to the underlying subcutaneous tissues. [14] X Research source Instruct the patient not to scratch or rub the injection site, since this could dilute the medication or spread it around."
    },
    {
      "title": "Discard the needle.",
      "content": "Discard the needle. Place the safety cap on the needle. Then throw away the needle in a sharps container. Additionally, properly dispose of any contaminated supplies. [15] X Research source"
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Remove your medical gloves and throw them away. [16] X Research source Wash your hands thoroughly with warm water and soap. Dry them with clean paper towels. [17] X Research source If you don’t have access to soap and water, clean your hands with an alcohol-based hand rub."
    },
    {
      "title": "Make a note of the injection site.",
      "content": "Make a note of the injection site. After you’ve finished, document the time and date of the injection, as well as the type of medication you injected. [18] X Research source It’s also a good idea to write down where on the body you administered the medication. This is especially useful if the patient gets injections often, as it will help other medical personnel know to rotate the injection sites so that one area is not constantly used."
    }
  ]
}