{
  "url": "https://www.wikihow.com/Groom-Maltese-Dogs",
  "title": "How to Groom Maltese Dogs",
  "steps": [
    {
      "title": "Wipe eyes daily.",
      "content": "Wipe eyes daily. Soak a cotton ball or clean washcloth with warm water and wipe the eye area. Use one cotton ball for each eye. Wipe the area right under the eye where stains are most likely to occur. [1] X Research source This daily wiping may help prevent the tears from staining in the first place. Once you have finished wiping, place a small amount of petroleum jelly in the area. The petroleum jelly may also keep the tears from staining the hair. If you notice any matter in the corner of your dog's eye, use a fine tooth comb or a soft bristled tooth brush dipped in warm water to remove it. [2] X Research source"
    },
    {
      "title": "Brush fur daily.",
      "content": "Brush fur daily. Daily brushing of the fur will help prevent matting and tangles. If you cannot brush your dog every day, shoot for every other day. Spray your dog with a detangling spray before you begin to brush. Use a metal comb, a slicker brush, or a pin brush. Never use natural fiber brushes on your dog. If you do not want use a detangling spray, you can mix conditioner and water in a spray bottle instead. If you are unable to brush your dog daily, at least try to brush every other day or once a week. [3] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020."
    },
    {
      "title": "Examine for any excess hair.",
      "content": "Examine for any excess hair. As you brush your dog, check to see if there is any hair growing around its anus, ears, or paws. Pay special attention to hair around the anus. If the hair gets too long, feces will stick to the hair after a bowel movement. You can shave the hair around the anus to keep it short. You can do a quick trim of the hair until you have time to thoroughly groom your dog."
    },
    {
      "title": "Brush your dog's fur.",
      "content": "Brush your dog's fur. Before you bathe your dog, you need to thoroughly brush its fur. Brushing will help remove knots, tangles, and dead hair. If you run into any matted hair, gently work out the mats with your fingers. Do not try to brush it out. [4] X Research source If you cannot work through the matted fur with your finger, apply a detangler and then try to un-matt the fur. [5] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. You can then use a small comb to loosen the hairs. If none of this works, you will need to cut out the mat. Do not bathe your Maltese without removing mats. The mats will only get worse when exposed to water."
    },
    {
      "title": "Apply shampoo and conditioner.",
      "content": "Apply shampoo and conditioner. Thoroughly wet your dog before you apply the shampoo and conditioner. Try not get any water in the eyes or ears. Apply a straight line of shampoo down your Maltese's back and work in the shampoo. Use a plastic cup or a spray nozzle to rinse off the shampoo. Once you have rinsed out the shampoo, use these same steps and apply the conditioner. [6] X Research source Bathe your dog in a bathtub or sink. Remove any bows, collars, or dog clothing before you begin. Do not use human shampoo and conditioner on your dog. These products are too harsh for Maltese skin. [7] X Research source"
    },
    {
      "title": "Dry your Maltese.",
      "content": "Dry your Maltese. Gently pat down your Maltese with a soft towel once you are finished bathing. Do not completely dry your dog with the towel. You want the fur to be damp when you brush it again. You can also use a blow dryer to dry the fur. [8] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. A hands-free canine dryer is better than a hand held dryer. The hands free dryer will allow you to brush the hair during the drying process. Use low to medium heat to dry the fur and dry small sections at a time."
    },
    {
      "title": "Brush your dog's coat.",
      "content": "Brush your dog's coat. Brush your dog from head to toe after each bath. Start with the hair that is closest to the skin and work your way out. Keep in mind, the fur should still be slightly damp when you are brushing the fur. [9] X Research source The face should be the last part of your dog that you brush. Use a metallic comb when you are doing this. If you notice long hair around your dog's anus while you are brushing, trim the hair so that feces will not stick to it when your dog has a bowel movement."
    },
    {
      "title": "Cut and file the nails.",
      "content": "Cut and file the nails. Your dog's nails should be softer after a bath. This is an ideal time to cut and trim the nails. Only cut the tips of the nail and be careful not to cut too deep. Cutting too deep may result in bleeding. Trim any hair that you see between your dog's toes at this time as well. You can purchase nail clippers from your local pet store."
    },
    {
      "title": "Brush teeth at least twice a week.",
      "content": "Brush teeth at least twice a week. Use doggie toothpaste and a doggie brush to clean your dog's teeth. Never use human toothpaste brush your dog's teeth. Apply a small amount of toothpaste to the toothbrush and rub it against the front teeth. You do not have to brush the back of the teeth. [10] X Research source Ideally, you should brush your dog's teeth every day. Brushing 2-3 times a week is the minimum. If you do not buy a doggie toothbrush, you can use a human baby toothbrush. These brushes are super small and soft. [11] X Research source You can also purchase a finger brush that may easier to use. Regular teeth cleaning is important because small dogs are more likely to develop gum disease, tartar buildup, tooth loss, and gingivitis. [12] X Research source"
    },
    {
      "title": "Clean ears with a cotton ball.",
      "content": "Clean ears with a cotton ball. Dampen a clean cotton ball with an alcohol-based ear solution and wipe the inside of your dog's ear until you no longer see any residue. [13] X Expert Source Lancy Woo Certified Pet Groomer Expert Interview. 26 February 2020. You will probably need to use multiple cotton balls. Never use a cotton swab to dig down into the ear. [14] X Research source If the cotton ball is not getting the job done, you can use an ear cleaning solution. If you notice a strong odor or a heavy wax buildup, take your Maltese to the veterinarian. If your dog keeps shaking its head, tilting its head, or scratching its ear, your dog may have some sort of ear problem."
    },
    {
      "title": "Get a haircut that fits with your lifestyle.",
      "content": "Get a haircut that fits with your lifestyle. The longer the hair of your Maltese, the more time you will spend on grooming. A puppy cut is the shortest cut and requires the least amount of maintenance. Long and medium length hair is more prone to knots and tangles. [15] X Research source Puppy cuts are also best if your dog has a more cottony texture as opposed to a silky texture. Use dog clippers or scissors to cut the hair. If you do not want to cut your dog's hair yourself, take it to a professional groomer for a cut. The frequency of hair cutting will depend on how fast your dog's hair grows."
    },
    {
      "title": "Use a tear stain remover.",
      "content": "Use a tear stain remover. Tear stain removers are specially formulated cleansers that will remove the stains from white fur. Always read the instructions on the bottle before using. Typically, you will wet the area, apply the stain remover using a wet cloth, and then rinse the area with clean water. The most popular brands of tear stain removers include Angel's Eyes, Eye Envy, Betta Bridges, and Tropiclean. [16] X Research source The frequency of use may vary depending on if you are treating existing stains or preventing stains. You can always ask your veterinarian to recommend a product for you to use."
    },
    {
      "title": "Consult a veterinarian.",
      "content": "Consult a veterinarian. Some Maltese will stain more than others. If you are concerned about your dog's tear staining, see a veterinarian to make sure that everything is fine. [17] X Research source There may be other reasons that your dog is having a big problem with tear staining. Once you know the cause of the tear staining, you can use the right solution. Excessive tear production, blocked tear ducts, other eye diseases, diet, and ear infections can cause your dog to have more tear stains. [18] X Research source If your Maltese is a teething puppy, you may also notice more tear stains."
    },
    {
      "title": "Trim the hair around the ears.",
      "content": "Trim the hair around the ears. Maltese have a lot of hair around their ears. Excessive amounts of hair can cause ear problems for your dog. Sprinkle some ear powder on the ear canal and all of the ear hair. Hold the ear flap up with one hand, and use your fingers to pluck hair out of the ear canal. [19] X Research source The ear powder will keep your dog from feeling pain when you pluck. If you are not comfortable doing this, take your dog to a professional groomer. Ear powder can be purchased from your local pet store."
    },
    {
      "title": "Groom your dog at regular intervals.",
      "content": "Groom your dog at regular intervals. Your dog may not be to fond of grooming at first. However, you need to get your dog used to the grooming process. Get all of your supplies together before you start a grooming session. This will make the session as short and efficient as possible. [20] X Research source If your dog does not like being touched in a certain spot, touch the spot for a few seconds to help your dog get used to it. Reward your dog when it is well behaved during grooming. You can also start with short grooming sessions and build your way up to longer sessions."
    }
  ]
}