{
  "url": "https://www.wikihow.com/Identify-Beetles",
  "title": "How to Identify Beetles",
  "steps": [
    {
      "title": "Look for 2 hard wing coverings on the insect’s back.",
      "content": "Look for 2 hard wing coverings on the insect’s back. Beetles have wings, but they are covered by 2 hard wing coverings(elytra). This is what gives a beetle its distinctive hard-shelled look. The hardened wing coverings on a beetle’s back are also the reason why a beetle will make a crunching sound if you accidentally step on one. [1] X Research source If the insect is a beetle, its wings should not be visible unless the coverings are lifted up and the wings are extended. Not all beetles have wings that are completely covered."
    },
    {
      "title": "Check for chewing mouth parts on the underside of its head.",
      "content": "Check for chewing mouth parts on the underside of its head. Beetles have sharp mandibles (chewing mouthparts) so they can consume other insects, plant matter, fungus, and decaying plants and animals. Look at the underside of the insect’s mouth to see if they have sharp-looking mouthparts. [2] X Research source If the insect has a long, straw-like protrusion, then it is not a beetle."
    },
    {
      "title": "See if the insect has 6 legs.",
      "content": "See if the insect has 6 legs. Beetles have 6 legs distributed between their front and back body segments. When they are in their larval stage, the legs are all on the front of a beetle’s body. Otherwise, the legs are spread between the front and back segments. Count the insect’s legs and check their location to determine if it is a beetle. [3] X Research source If the insect has 4 legs, 8 legs, or more, then it is not a beetle."
    },
    {
      "title": "Identify a click beetle by a narrow, long body and a clicking sound.",
      "content": "Identify a click beetle by a narrow, long body and a clicking sound. Click beetles, also known as Elateridae, can snap the front and back sections of its body together to make a clicking sound, and it can also use this motion to flip itself over if it gets stuck on its back. Click beetles are black or dark brown, and they have grooved sections running down their backs. [4] X Research source An adult click beetle may be between 0.5 to 1.5 in (1.3 to 3.8 cm) long. This beetle is common all over the world and there are over 900 species of click beetles in North America alone."
    },
    {
      "title": "Watch for a fast moving beetle with a strong smell to spot a ground beetle.",
      "content": "Watch for a fast moving beetle with a strong smell to spot a ground beetle. Ground beetles are black with grooves on their backs, and they produce a strong odor. They usually hang out under logs and leaves, but they may wander into your house through a crack or open window. These beetles move quickly, so it might be hard to get a close look. [5] X Research source Keep in mind that these beetle are harmless. They eat other insects, but will not bite you or your pets."
    },
    {
      "title": "Check for longhorn beetles with long-antennae hanging out around dead trees.",
      "content": "Check for longhorn beetles with long-antennae hanging out around dead trees. These are called longhorn beetles because their antennae are reminiscent of longhorn cattle. The antennae may be straight, curved, or half and half. Longhorn beetle coloring can range from black, brown, green, yellow, red, or a combination of these colors. [6] X Research source There are 413 species of longhorn beetles in Texas alone, but they all share the distinguishing feature of long antennae."
    },
    {
      "title": "Inspect the head of the beetle for a scoop shape to see if it’s a mealworm.",
      "content": "Inspect the head of the beetle for a scoop shape to see if it’s a mealworm. If the beetle has a rounded head with a scoop neck shape around the base of it, then it is most likely a mealworm. Despite the name, these are actually beetles. Mealworms usually live outdoors, but you may find them infesting containers of flour and other dried grains. Keep your grains in air-tight containers to prevent an infestation."
    },
    {
      "title": "Identify an oldhouse borer by white spots on its wings and enlarged leg segments.",
      "content": "Identify an oldhouse borer by white spots on its wings and enlarged leg segments. If you look closely at an oldhouse borer, you may notice small gray hairs on its back. You may also be able to make out 3 dark eyes on each side of the beetle’s mouth. [7] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source These beetles usually turn up in a house about 4 to 7 years after it has been built."
    },
    {
      "title": "Check for a black body with an elongated abdomen to identify a carpet beetle.",
      "content": "Check for a black body with an elongated abdomen to identify a carpet beetle. This is most likely a black carpet beetle. These beetles are usually black or very dark brown and their bodies are oval shaped. They range in size from 0.12 to 0.19 inches (0.30 to 0.48 cm). [8] X Research source Varied color carpet beetles are similar to black carpet beetles. These are very small (0.12 in (0.30 cm)) beetles with bright yellow and green markings."
    },
    {
      "title": "Look for green and black stripes on an elm beetle.",
      "content": "Look for green and black stripes on an elm beetle. These beetles are 0.25 in (0.64 cm) long. They feed on tree leaves, especially on elm tree leaves, and they lay their eggs on the undersides of leaves as well. [9] X Research source Elm leaf beetles can damage trees if they get out of control, so you may need to manage them with pesticides."
    },
    {
      "title": "Identify ladybugs by a brightly-colored, rounded body and black spots.",
      "content": "Identify ladybugs by a brightly-colored, rounded body and black spots. These are also known as lady beetles and in some countries, ladybirds. Their bodies may be yellow, orange, or red with black markings, but they can also be black with red, orange, or yellow markings. [10] X Research source There are over 450 species of lady beetles in North America alone."
    },
    {
      "title": "Protect your ham from larger beetles.",
      "content": "Protect your ham from larger beetles. Larder beetles are black beetles that are known to infest cured ham. They have a whitish, silver streak running across their back and they are oval-shaped. Be sure to keep ham covered when it is out, and put it in the refrigerator to store it."
    },
    {
      "title": "Watch for cylindrical-shaped bark beetles around firewood.",
      "content": "Watch for cylindrical-shaped bark beetles around firewood. Bark beetles are only about 0.12 in (0.30 cm) and they are common around piles of firewood. Bark beetles may also infest live trees, which may die as a result of a bark beetle infestation. [11] X Research source Bark beetle infestations create dry, dead wood, which intensifies forest fires."
    },
    {
      "title": "Identify drug store beetles by lines on the wing covers and a slightly bent head.",
      "content": "Identify drug store beetles by lines on the wing covers and a slightly bent head. The coloring of these beetles may range from brown to reddish brown, and they are around 0.1 to 0.14 in (0.25 to 0.36 cm) long. These beetles infest packaged food. If the head is so far bent over that the beetle has a hump, then it is likely a cigarette beetle. These are almost identical to drugstore beetles but they appear to be hunchbacked."
    },
    {
      "title": "Check for rust beetles with a rust-colored, flattened body with clubbed antennae.",
      "content": "Check for rust beetles with a rust-colored, flattened body with clubbed antennae. These are also known confused flour beetles. These beetles feed on corn flour and other packaged products. [12] X Research source Make sure to keep your corn flour and other flours in air-tight containers to protect them from these pests."
    },
    {
      "title": "Inspect your rice and grains for long-beaked beetles called weevils.",
      "content": "Inspect your rice and grains for long-beaked beetles called weevils. Weevils are only about 0.12 in (0.30 cm) and brown with a pointed head that resembles a beak. Their bodies are long and slender. Weevil infestations in rice and other grains are common. These pests can chew right through paper and plastic, so it is best to keep any loose grains and flour in air-tight glass, metal, or hard plastic containers. [13] X Research source"
    },
    {
      "title": "Look for protrusions on the sides of a saw-toothed beetle’s thorax.",
      "content": "Look for protrusions on the sides of a saw-toothed beetle’s thorax. These beetles are only about 0.12 in (0.30 cm) long. Their favorite foods to infest and eat are sunflower seeds and nuts, but they can also infest large quantities of grains. Sawtoothed grain beetles are more likely to get into the food supply if the bins are not sanitized at least every 6 months. [14] X Research source"
    }
  ]
}