{
  "url": "https://www.wikihow.com/Link-Excel-to-PowerPoint",
  "title": "3 Simple Ways to Insert Excel Data Into PowerPoint",
  "steps": [
    {
      "title": "Open a project in Microsoft PowerPoint.",
      "content": "Open a project in Microsoft PowerPoint . You can only link data from an Excel worksheet using the desktop application. Currently, this can't be done on the web version. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Insert.",
      "content": "Click Insert . This is the tab at the top."
    },
    {
      "title": "Click Object.",
      "content": "Click Object . You can find this in the Text section, next to Slide Number . If you don't see the text, click the icon of a small, blue square on top of a rectangle. A new window will open."
    },
    {
      "title": "Select Create from file.",
      "content": "Select Create from file . This is the option on the left. The bubble will be filled in. If you're using a Mac, skip this step."
    },
    {
      "title": "Click Browse and select your Excel file.",
      "content": "Click Browse and select your Excel file. Make sure it's the file with the data you want to insert. If you're using a Mac, click From file… and select your file. Then, click Insert ."
    },
    {
      "title": "Check the \"Link\" box.",
      "content": "Check the \"Link\" box. This is how your changes will be synced to PowerPoint if you make changes to the Excel file. You can select Display as icon if you want the Excel file to show up as a clickable icon rather than the entire worksheet."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The file will be linked to PowerPoint. If prompted, click Grant Access to allow the Excel file to be inserted into PowerPoint. If you don't see the correct worksheet in PowerPoint, open the Excel file. Make sure the worksheet is the one that appears first. You may need to reorder the worksheets."
    },
    {
      "title": "Open a workbook in Microsoft Excel.",
      "content": "Open a workbook in Microsoft Excel . To link a certain table, graph, or section of Excel, you'll need to copy and \"paste special\" into the PowerPoint slide. This method ensures the data linked will be updated on PowerPoint if you make changes on Excel. If you'd rather paste the raw data, skip to the next section."
    },
    {
      "title": "Select the data you want to link.",
      "content": "Select the data you want to link. Drag your cursor over the area to highlight it."
    },
    {
      "title": "Click Copy.",
      "content": "Click Copy . This is on the Home tab. You can also press CTRL + C (Windows) or CMD + C (Mac)."
    },
    {
      "title": "Open a project in Microsoft PowerPoint.",
      "content": "Open a project in Microsoft PowerPoint. Now that the data is copied, you can paste it into your slide."
    },
    {
      "title": "Click the arrow underneath \"Paste\".",
      "content": "Click the arrow underneath \"Paste\". This is on the Home tab. More options will open."
    },
    {
      "title": "Click Paste Special….",
      "content": "Click Paste Special… . This is the bottom option. A new window will open."
    },
    {
      "title": "Select Paste link.",
      "content": "Select Paste link . This is the option on the left. The bubble will be filled in. Microsoft Excel Worksheet Object should already be selected underneath the As header. If it isn't, click it. If you're using a Mac, skip this step."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The data will be linked to Excel. If you made changes in Excel and it isn't showing up on PowerPoint, right-click the data in PowerPoint and click Update Link . If you're using a Mac, remove the Excel data from your PowerPoint, and then add the updated data again."
    },
    {
      "title": "Select and copy the data you want to link.",
      "content": "Select and copy the data you want to link. In Microsoft Excel, drag your cursor over the data to highlight it. To copy it, press CTRL + C (Windows) or CMD + C (Mac). You can also click Copy on the Home tab."
    },
    {
      "title": "Open a project in Microsoft PowerPoint.",
      "content": "Open a project in Microsoft PowerPoint. Now that the data is copied, you can paste it into your slide."
    },
    {
      "title": "Click the arrow underneath \"Paste\".",
      "content": "Click the arrow underneath \"Paste\". This is on the Home tab. More options will open."
    },
    {
      "title": "Select a paste option.",
      "content": "Select a paste option. Some options may not appear due to the type of data you've copied. You can select the following: Use Destination Styles/Theme : uses the format of your PowerPoint presentation to create a table Keep Source Formatting : uses the format of the Excel worksheet Embed : copies the data as information that can be edited later in Excel Picture : copies the data as a picture that cannot be edited Keep Text Only : copies data as a single text box"
    }
  ]
}