{
  "url": "https://www.wikihow.com/Make-a-Rubber-Band-Guitar",
  "title": "How to Make a Rubber Band Guitar",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This guitar is more complex to make, but the results are well worth it. Here's a list of what you will need: Shoebox Box cutter and scissors Cardboard 4 – 6 rubber bands School glue Cardboard tube, paper towel tube, or PVC pipe Tape or hot glue Paint, paper, stickers, etc (to decorate)"
    },
    {
      "title": "Cut a large hole in the center of a shoe box lid.",
      "content": "Cut a large hole in the center of a shoe box lid. Use a cup or mug to trace a circle into a shoe box lid. Then, use a box cutter to cut the circle out. This will be your sound hole. If you are a child, ask an adult to help you with this step. If you can't find a shoe box, you can buy one from the scrapbooking section of an arts and crafts shop. They are mainly used for storing photographs, but they are right size and come in many different colors and patterns."
    },
    {
      "title": "Punch four to six holes in a straight line 1 inch (2.54 centimeters) above and make sure to use a pencil below the sound hole.",
      "content": "Punch four to six holes in a straight line 1 inch (2.54 centimeters) above and make sure to use a pencil below the sound hole. These will be your string holes. Make sure to align the top and bottom holes so that each string will run straight across the sound hole. The row of holes should not extend past the widest point of the sound hole."
    },
    {
      "title": "Paint or decorate the shoe box.",
      "content": "Paint or decorate the shoe box. You can paint the box part using acrylic or tempera paints. You can also cover the lid and box parts (separately) with paper. Here are some more ways in which you can decorate your guitar: Draw designs on the guitar using markers, crayons, or glitter glue. Stick some stickers or foam shapes onto your guitar to make it look more colorful. Decorate the rim of the sound hole. Paint the inside of your box. This way, the color will show through the sound hole, and make your guitar look more interesting."
    },
    {
      "title": "Cut four, 1 inch (2.54 centimeters) wide strips of cardboard.",
      "content": "Cut four, 1 inch (2.54 centimeters) wide strips of cardboard. Measure the distance from the far left string hole to the far right string hole, then cut the cardboard accordingly. Each strip of cardboard needs to be the same length. If you've painted the body of the guitar, you may want to paint the strips of cardboard as well. For a more striking effect, paint them using a contrasting color."
    },
    {
      "title": "Glue two of the cardboard strips above and below the sound hole to make the bridge.",
      "content": "Glue two of the cardboard strips above and below the sound hole to make the bridge. The strips should be right between the string holes and the top to bottom edge of the sound hole. The strips will help lift the strings off the body of the guitar and give you a better sound."
    },
    {
      "title": "Poke four to six holes through the remaining two cardboard strips.",
      "content": "Poke four to six holes through the remaining two cardboard strips. The distance between the holes needs to be the same as the string holes you made on your box lid."
    },
    {
      "title": "Cut four to six rubber bands open.",
      "content": "Cut four to six rubber bands open. You will be stringing these rubber bands through the string holes. Consider using both thick and thin rubber bands. Each will give you a different sound."
    },
    {
      "title": "Thread the rubber bands through one of the cardboard strips and secure them with a knot.",
      "content": "Thread the rubber bands through one of the cardboard strips and secure them with a knot. Begin by tying a knot at the end of each rubber band. Thread the loose end through the holes in one of the cardboard strips. You will need one rubber band for each hole. The knot at the bottom of the rubber band will keep it from falling out. Don't make the knots too close to the ends of the bands or the ends might slip through and untie the knots."
    },
    {
      "title": "Place the cardboard strip under the lid and feed the rubber bands up through the string holes.",
      "content": "Place the cardboard strip under the lid and feed the rubber bands up through the string holes. The cardboard strip will hold the rubber bands securely in place. If you want, you can tape the edges of the cardboard strip to the underside of the lid."
    },
    {
      "title": "Stretch each string across the sound hole and into the corresponding string hole on the other side of the sound hole.",
      "content": "Stretch each string across the sound hole and into the corresponding string hole on the other side of the sound hole. You can use a binder clip to temporarily hold the rubber band strings in place once you have fed them through the string holes."
    },
    {
      "title": "Place the other cardboard strip under the lid and thread the rubber bands through the holes.",
      "content": "Place the other cardboard strip under the lid and thread the rubber bands through the holes. Secure each rubber band by tying the end into a knot. If you want, make each string a little looser/tighter than the previous one. This will allow you to achieve different notes, sort of like in a real guitar. You can also tape the cardboard strip to the underside of the lid"
    },
    {
      "title": "Consider gluing a ½ inch (1.27 centimeters) wide cardboard strip across the top and bottom string holes.",
      "content": "Consider gluing a ½ inch (1.27 centimeters) wide cardboard strip across the top and bottom string holes. This will help cover the holes and make your guitar look neater. Each piece of cardboard needs to be long enough to cover all of the string holes on each side. Draw a line of glue across the top and bottom holes, then press the cardboard strip down onto it. Consider painting the cardboard strip a contrasting color so that it stands out from the rest of your guitar."
    },
    {
      "title": "Find a tube that is longer than your shoe box to make the neck.",
      "content": "Find a tube that is longer than your shoe box to make the neck. You can use a cardboard mailing tube, a paper towel tube, or even a plastic or pvc tube."
    },
    {
      "title": "Decorate the tube.",
      "content": "Decorate the tube. You can paint it, cover it with paper, or even wrap tape around it to make it more colorful. You can also glue paper \"keys\" to the top of the tube to make the knobs. You can even draw 4 to 6 lines down the front of the tube to make the strings. Note that if the neck is a different material than the body, the painted result might not match (even if you use the same paint)."
    },
    {
      "title": "Cut a hole in the top of the shoe box to slide the neck tube through.",
      "content": "Cut a hole in the top of the shoe box to slide the neck tube through. Use the base of your tube to trace a circle onto the top of your guitar. Then, use a box cutter to cut the circle out. If you are a child, ask an adult to help you with this step."
    },
    {
      "title": "Attach the neck to the body of the guitar.",
      "content": "Attach the neck to the body of the guitar. Slide the tube about 2 inches (5.08 centimeters) down into the hole. If your tube is made out of a heavier material, slide it down further. Secure the seam between the tube and the box with hot glue or tape. Make sure that you are putting the tape and glue on the inside of your box, so that you don't see it once you put your guitar together."
    },
    {
      "title": "Place the lid on your shoe box.",
      "content": "Place the lid on your shoe box. Draw a line of glue around the inside edges of your box lid. Place the lid down onto the box and wait for the glue to dry."
    },
    {
      "title": "Play your guitar.",
      "content": "Play your guitar. If you want, you can cut a triangle shape out of some colored cardboard and use it as a guitar pick."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This guitar is easy to make, and great for young children. It is your classic tissue box guitar. Here's a list of what you will need: Tissue box 4 rubber bands Scissors Paper towel tube Tape Glue Popsicle sticks, straws, or unsharpened pencil Paint, paper, stickers, etc (for decorating)"
    },
    {
      "title": "Find an empty tissue box and pull out the clear plastic piece inside the hole.",
      "content": "Find an empty tissue box and pull out the clear plastic piece inside the hole. It should come away easily. If it doesn't, cut it out using a pair of scissors."
    },
    {
      "title": "Tape the paper towel roll down to one of the skinny ends of the box.",
      "content": "Tape the paper towel roll down to one of the skinny ends of the box. You can also attach the roll using hot glue. The tube should be aligned with the vertical hole in the box."
    },
    {
      "title": "Decorate the guitar.",
      "content": "Decorate the guitar. You can cover the guitar with paper. You can also paint it using tempera or acrylic paints. Here are some more decorating ideas: Draw little designs on the guitar using markers, crayons, or glitter glue. Stick down some stickers or foam shapes onto the guitar to make it more colorful. Glue down some large beads near the top of the tub to make the knobs. You will need two to three beads on each side."
    },
    {
      "title": "Glue down a popsicle stick above and another below the hole to make the bridge.",
      "content": "Glue down a popsicle stick above and another below the hole to make the bridge. Draw a horizontal line of glue above and below the tissue hole. Press a popsicle stick down onto each line of glue. Let the glue dry. The popsicle sticks will lift the rubber bands up a little and make the guitar sound better. Consider painting or decorating the sticks once the glue dries. You can also use crayons, pencils, or even straws to make the bridge."
    },
    {
      "title": "Allow the paint and glue to dry before moving on.",
      "content": "Allow the paint and glue to dry before moving on. If you move ahead to the next steps too soon, your guitar will far apart."
    },
    {
      "title": "Wrap four large rubber bands around the box lengthwise.",
      "content": "Wrap four large rubber bands around the box lengthwise. You want to end up with two rubber bands on the left side of the tube, and two rubber bands on the right side of the tube. Position the rubber bands so that they are right over the tissue hole. Try to use thick and thin rubber bands. Each one will give you a different sound."
    },
    {
      "title": "Play with your guitar.",
      "content": "Play with your guitar. Experiment with making different sounds. You can even cut a triangle out of a piece of colored cardboard to make the guitar pick."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. This guitar is simple and easy to make. It is ideal for young children. It can also double up as a banjo. Here's a list of what you will need: [1] X Research source Two paper plates Glue Wooden ruler or paint stir stick 4 rubber bands Paint, stickers, glitter, etc (to decorate)"
    },
    {
      "title": "Glue two paper plates together to make a thick, sturdy plate.",
      "content": "Glue two paper plates together to make a thick, sturdy plate. Draw a line of glue around the upper rim of a paper plate. Place the second plate right on top of it. The plates should be stacked, so that you end up with one thick plate. Make sure that your paper plates are sturdy and have a ridge or rim."
    },
    {
      "title": "Glue a wooden ruler or paint stir stick to the back of the plate to make the neck.",
      "content": "Glue a wooden ruler or paint stir stick to the back of the plate to make the neck. Cover the bottom third of the stick with glue. Press it against the back of the plate. The rest of the stick should be sticking out from behind the guitar; you don't want the neck to be too short or it will look silly. Try to center the stick as much as possible."
    },
    {
      "title": "Decorate the guitar.",
      "content": "Decorate the guitar. You can paint the guitar using acrylic paint. You can also draw designs on it using markers or glitter glue. You can even make it look more colorful by covering it with stickers. Consider clipping two wooden clothespins to the top of the stick. Space them about 1 inch (2.54 centimeters) apart. If you don't want the clothespins to fall off and get lost, place glue on the stick before clipping them on."
    },
    {
      "title": "Let the guitar dry.",
      "content": "Let the guitar dry. If you move ahead to the next step too soon, your guitar will fall apart. How long it dries depends on how much paint and glue you used."
    },
    {
      "title": "Wrap four rubber bands around the plate.",
      "content": "Wrap four rubber bands around the plate. Place two rubber bands two the left side of the stick, and two rubber bands to the right side of the stick. Try using both thick and thin rubber bands to create different sounds."
    },
    {
      "title": "Play with your guitar.",
      "content": "Play with your guitar. Experiment with producing different sounds. Don't pull on the strings too tightly, however, or they may break."
    }
  ]
}