{
  "url": "https://www.wikihow.com/Make-Pressure-Cooker-%22Fried%22-Chicken",
  "title": "How to Make Pressure Cooker \"Fried\" Chicken",
  "steps": [
    {
      "title": "Pour cold water into the pressure cooker and put a steamer basket in it.",
      "content": "Pour cold water into the pressure cooker and put a steamer basket in it. Put 1 cup (240 ml) of cold water into the pressure cooker and set a steamer basket down into the cooker. [1] X Research source If you're using a steamer basket that didn't come with your pressure cooker, ensure that it will fit inside your machine."
    },
    {
      "title": "Arrange chicken pieces in the steamer basket.",
      "content": "Arrange chicken pieces in the steamer basket. Get out 6 chicken thighs and place them in the steamer basket. If you need to, you can stack the thighs so they're loosely touching. [2] X Research source Avoid overcrowding the basket. If you want to make more chicken, cook the chicken in batches. If you prefer, use a combination of breasts, wings, or drumsticks."
    },
    {
      "title": "Cook the chicken at high pressure for 6 to 9 minutes.",
      "content": "Cook the chicken at high pressure for 6 to 9 minutes. Put the lid on the cooker and secure it closed. Turn the pressure cooker onto high pressure and set the timer to 6 minutes, if you're using small thighs. [3] X Research source If you're using large thighs, they'll probably need closer to 9 minutes to pressure cook."
    },
    {
      "title": "Turn off the heat and let the pressure release naturally.",
      "content": "Turn off the heat and let the pressure release naturally. Once the chicken has pressure cooked, turn off the heat and select \"Full Natural Release.\" This will allow the pressure to gradually. Then you can open the lid of the machine. [4] X Research source Most pressure cookers take about 10 minutes for the pressure to naturally release."
    },
    {
      "title": "Heat butter and olive oil over medium heat.",
      "content": "Heat butter and olive oil over medium heat. Set a skillet on the stove and pour 2 tablespoons (30 ml) of olive oil into it. Add 2 tablespoons (29.6 ml) (28 g) of unsalted butter and turn the burner on to medium heat. [5] X Research source The butter should melt and combine with the oil."
    },
    {
      "title": "Stir 1 to 1 ½ cups (62 to 93 g) of panko breadcrumbs into the skillet.",
      "content": "Stir 1 to 1 ½ cups (62 to 93 g) of panko breadcrumbs into the skillet. Add the panko breadcrumbs to the butter and oil mixture. Stir until the breadcrumbs have absorbed the mixture. [6] X Research source If you're using smaller thighs, you may only need 1 cup (62 g) of the breadcrumbs. If you don't have panko breadcrumbs, you can substitute dried breadcrumbs but they won't crisp up as much."
    },
    {
      "title": "Heat the breadcrumbs for about 3 to 5 minutes.",
      "content": "Heat the breadcrumbs for about 3 to 5 minutes. Continue to cook and stir the breadcrumbs frequently until they become rich, golden brown. Then stir in kosher salt according to your taste. [7] X Research source Watch the breadcrumbs closely while they're toasting since they can burn quickly."
    },
    {
      "title": "Preheat the oven to 400 °F (204 °C) and set a rack on a sheet.",
      "content": "Preheat the oven to 400 °F (204 °C) and set a rack on a sheet. Get out a large baking sheet and put a large wire rack on it. The wire rack will allow air to circulate under the chicken as it bakes. This will make the chicken even crispier. [8] X Research source"
    },
    {
      "title": "Check the chicken temperature to see if it's reached 160 °F (71 °C).",
      "content": "Check the chicken temperature to see if it's reached 160 °F (71 °C). Insert an instant-read meat thermometer into the thickest part of a chicken thigh to ensure that it's reached 160 °F (71 °C). Keep in mind that the chicken will cook more when you put it into the oven to crisp up. [9] X Research source If the chicken hasn't reached temperature, close the pressure cooker and turn it back on to high for 3 to 5 more minutes."
    },
    {
      "title": "Remove the chicken and pat the pieces dry with a paper towel.",
      "content": "Remove the chicken and pat the pieces dry with a paper towel. Lift the steamer basket out of the pressure cooker and lay the pieces of chicken on a baking sheet. Take a paper towel and blot the chicken pieces until they're completely dry. [10] X Research source If the chicken is very moist, you may need several paper towels."
    },
    {
      "title": "Season the chicken and coat them with flour.",
      "content": "Season the chicken and coat them with flour. Sprinkle the chicken with salt and pepper. Put 1 cup (125 g) of all-purpose flour into a shallow bowl and place the chicken pieces in it. Turn the chicken over so they're completely coated with the flour. [11] X Research source"
    },
    {
      "title": "Beat 2 eggs in a bowl and dip the chicken into them.",
      "content": "Beat 2 eggs in a bowl and dip the chicken into them. Crack 2 eggs into a bowl and whisk them until they're uniform in color. Transfer the chicken from the dish of flour and lower them into the beaten eggs. [12] X Research source Shake off the excess flour before you put them into the beaten eggs."
    },
    {
      "title": "Coat the chicken with the breadcrumbs and bake it for 5 to 10 minutes.",
      "content": "Coat the chicken with the breadcrumbs and bake it for 5 to 10 minutes. Put the baking sheet with the chicken into the preheated oven. Bake the chicken until the breadcrumbs become completely crispy and the chicken appears to be fried. [13] X Research source Keep the chicken pieces on the wire rack that's on the baking sheet."
    },
    {
      "title": "Remove and serve the chicken.",
      "content": "Remove and serve the chicken. Turn off the oven and take the chicken out of the oven. Put the chicken on a platter and serve it immediately with your favorite sides. For example, serve the chicken with mashed potatoes , green beans, or biscuits. [14] X Research source Refrigerate the leftover chicken in an airtight container in the refrigerator for up to 3 to 4 days. Keep in mind that the chicken breading will become soggy as it's stored."
    }
  ]
}