{
  "url": "https://www.wikihow.com/Make-Dough-Rise-Faster",
  "title": "How to Make Dough Rise Faster",
  "steps": [
    {
      "title": "Preheat your oven to the lowest temperature setting for two minutes.",
      "content": "Preheat your oven to the lowest temperature setting for two minutes. Set a timer so you don’t lose track of the time. While the oven is preheating, start to bring a pot of water to boil on the stovetop. Turn the oven off after the two minutes are up. [1] X Research source"
    },
    {
      "title": "Fill an oven-safe glass bowl with the boiling water.",
      "content": "Fill an oven-safe glass bowl with the boiling water. Use a medium to large size bowl. Fill the bowl so the water line is about 1 to 2 inches (2.5 to 5 cm) below the rim. [2] X Research source"
    },
    {
      "title": "Place the bowl of boiling water in the oven and shut the door.",
      "content": "Place the bowl of boiling water in the oven and shut the door. Let the bowl of water sit in the oven while you prepare the dough. The warmth from the oven and the bowl of water will create a warm, humid environment for the dough to rise in. [3] X Research source"
    },
    {
      "title": "Put the dough in an oven-safe pan and set it in the oven.",
      "content": "Put the dough in an oven-safe pan and set it in the oven. Close the oven door. [4] X Research source"
    },
    {
      "title": "Leave the dough in the oven until it's doubled in size.",
      "content": "Leave the dough in the oven until it's doubled in size. Check the dough after 15 minutes to see if it's ready. If it's not, let it rise more in the oven and check back again in 15 minutes. [5] X Research source"
    },
    {
      "title": "Preheat your oven to the temperature you’ll be baking the bread at.",
      "content": "Preheat your oven to the temperature you’ll be baking the bread at. Usually bread is baked at around 350 to 500 °F (177 to 260 °C). Look at the recipe you’re using to make the bread for specific heating instructions."
    },
    {
      "title": "Rinse a kitchen towel under some warm water until it’s damp.",
      "content": "Rinse a kitchen towel under some warm water until it’s damp. You want the entire towel to be wet, but not soaked. If a lot of water is dripping from the towel, wring it out over a sink."
    },
    {
      "title": "Lay the damp towel over the dough.",
      "content": "Lay the damp towel over the dough. All of the dough should be covered with the towel. Stretch the towel so the edges are hanging off the side of the bowl or tray you’re raising the dough in. The moisture from the damp towel will help the dough rise faster. [6] X Research source Use two overlapping damp towels if you have a lot of dough to cover."
    },
    {
      "title": "Place the covered dough near, but not on, the preheated oven.",
      "content": "Place the covered dough near, but not on, the preheated oven. Some cleared off counter space right next to the oven will work. The heat coming from the oven will speed up the rising process. [7] X Research source"
    },
    {
      "title": "Let the dough rise until it’s doubled in size.",
      "content": "Let the dough rise until it’s doubled in size. Check the dough after 30 minutes to see if it’s finished rising. If it hasn’t doubled in size, re-cover the dough with the damp towel and check back again in 10 to 15 minutes."
    },
    {
      "title": "Fill a microwave-safe glass with 1 cup (0.24 liters) of water.",
      "content": "Fill a microwave-safe glass with 1 cup (0.24 liters) of water. Make sure the glass you use is small enough to fit in your microwave. [8] X Research source"
    },
    {
      "title": "Microwave the glass of water on high for two minutes.",
      "content": "Microwave the glass of water on high for two minutes. After two minutes, open the microwave and move the glass of water to the side of the microwave to make room for the bowl of dough. Use an oven mitt or dish towel to move the glass in case it's hot. [9] X Research source"
    },
    {
      "title": "Place the dough you’ll be baking in a bowl.",
      "content": "Place the dough you’ll be baking in a bowl. Use a bowl that’s small enough to fit in your microwave. Don’t worry if the bowl isn’t microwave safe - the microwave won’t be on when it’s in there."
    },
    {
      "title": "Set the bowl of dough in the microwave and shut the door.",
      "content": "Set the bowl of dough in the microwave and shut the door. Leave the glass of water in the microwave with the dough. The glass of water and the heat from the microwave will create a warm, moist environment that will help the dough rise faster. Do not turn on the microwave. [10] X Research source"
    },
    {
      "title": "Let the dough rise for around 30 to 45 minutes.",
      "content": "Let the dough rise for around 30 to 45 minutes. Check on the dough after 30 minutes to see if it’s finished. You’ll know it’s finished rising once it’s doubled in size. If it's not done rising, leave the dough in the microwave for another 15 minutes. [11] X Research source"
    },
    {
      "title": "Reheat the water if the dough doesn’t rise all the way.",
      "content": "Reheat the water if the dough doesn’t rise all the way. If after 45 minutes the dough still hasn’t doubled in size, remove it from the microwave. Reheat the glass of water on high for two minutes and then place the bowl of dough back in the microwave. Let the dough continue to rise for another 10 to 15 minutes. [12] X Research source"
    },
    {
      "title": "Get rapid-rise yeast packets.",
      "content": "Get rapid-rise yeast packets. Rapid-rise yeast comes in smaller granules, which makes it activate faster. Quicker yeast activation makes bread rise faster. Find rapid-rise yeast packets at your local grocery store. They might be labeled \"instant yeast\" or \"quick-rise yeast.\" [13] X Research source"
    },
    {
      "title": "Mix a packet of rapid-rise yeast in with the dry dough ingredients.",
      "content": "Mix a packet of rapid-rise yeast in with the dry dough ingredients. Rapid-rise yeast doesn't need to be dissolved in water like regular yeast. Just mix it in with the flour and other ingredients you're using to make the dough. Check the recipe you're using to see how many yeast packets it calls for. You can use hot water to dissolve regular yeast."
    },
    {
      "title": "Skip the first rise and shape the dough after kneading.",
      "content": "Skip the first rise and shape the dough after kneading. If the recipe you're using calls for two rises, only do the second one. Dough only needs to rise once when it's made with rapid-rise yeast. Skipping the first rise will cut your total rise time in half. [14] X Research source"
    },
    {
      "title": "Let the dough rise once before baking.",
      "content": "Let the dough rise once before baking. Place the dough in a warm, humid place to help it rise faster. Keep in mind that lean doughs that consist of mostly water and flour will rise faster than doughs that contain dairy, eggs, salts, and fat. [15] X Research source"
    }
  ]
}