{
  "url": "https://www.wikihow.com/Make-Mud-in-Minecraft",
  "title": "How To Make Mud in Minecraft (And How to Use It)",
  "steps": [
    {
      "title": "Mine mud in mangrove swamp biomes with a shovel or by hand.",
      "content": "Mine mud in mangrove swamp biomes with a shovel or by hand. Mangrove swamp biomes were added to Minecraft 1.19 and higher. They are usually found in warmer regions next to jungles and deserts. Mud blocks resemble dirt blocks, but they are much darker. Mud blocks can be mined by hand, but it is much quicker to use a shovel made from any material . [1] X Research source Shovels can be crafted by selecting a crafting table . Open the crafting table and place two sticks in the center column of the crafting grid, and a block of whatever material you want to make the shovel out of in the top-center block above the sticks. Move the completed shovel into your inventory. [2] X Research source"
    },
    {
      "title": "Or, create mud blocks by pouring water onto a dirt block.",
      "content": "Or, create mud blocks by pouring water onto a dirt block. You can also use a course dirt block or rooted dirt block. Use a glass bottle to pour water onto a dirt block. You can fill a glass bottle with water by equipping it and using it to interact with a water source. Pouring water onto a dirt block will empty the water bottle. After turning a dirt block into mud, you can mine it with your hand or a shovel. You can craft a glass bottle by selecting a crafting table and placing two glass blocks in the top corners of the crafting grid and placing a glass block in the center. Move the glass bottle into your inventory. Grass blocks or mycelium cannot be turned into mud."
    },
    {
      "title": "Make muddy mangrove roots.",
      "content": "Make muddy mangrove roots. Muddy mangrove roots are decorative block you can use in building. You can make muddy mangrove roots using a crafting table. Combine one mud block with one mangrove roots and drag the new block into your inventory. Mangrove roots can be found in mangrove swamp biomes alongside mud blocks."
    },
    {
      "title": "Make packed mud.",
      "content": "Make packed mud. You can create a packed mud block using a crafting table. Combine one mud block with one wheat bushel in the crafting grid. Drag the packed mud block into your inventory."
    },
    {
      "title": "Make mud bricks.",
      "content": "Make mud bricks. To make mud bricks, you need to create four packed mud blocks. Then open the crafting table and combine the 4 packed mud bricks into a 4x4 space of the crafting grid. Drag the mud brick block into your inventory. Mud bricks are a light brown color you can use in building houses or structures. [3] X Research source"
    },
    {
      "title": "Gather pointed dripstone.",
      "content": "Gather pointed dripstone. Pointed dripstones are the pointy beige rocks that form stalactites, which can be found underground in dripstone cave biomes. Pointed dripstones can be mined with any tool, but it's quickest to use a pickaxe. [4] X Research source"
    },
    {
      "title": "Gather dripstone blocks.",
      "content": "Gather dripstone blocks. Dripstone blocks are the beige blocks that pointed dripstones grow out of on the floors or ceilings of caves. They need to be mined using a pickaxe , or the block will be destroyed."
    },
    {
      "title": "Place a dripstone block in an elevated position.",
      "content": "Place a dripstone block in an elevated position. You can attach it to a wall or column or let it float in midair. You will need access to both the top and bottom of the dripstone block."
    },
    {
      "title": "Place a pointed dripstone beneath the dripstone block.",
      "content": "Place a pointed dripstone beneath the dripstone block. This will dehydrate whatever block sits on top of the dripstone block."
    },
    {
      "title": "Place a mud block on top of the dripstone block.",
      "content": "Place a mud block on top of the dripstone block. With the pointed dripstone beneath the dripstone block, this will cause the mud to dry out and form clay."
    },
    {
      "title": "Wait for the mud block to turn into clay.",
      "content": "Wait for the mud block to turn into clay. This may take up to 10 minutes with the game playing at normal speed. Wait for the mud block to dry out and form a clay block. [5] X Research source Clay blocks can be mined by hand or with any item, but a shovel is the quickest way to mine clay. [6] X Research source"
    }
  ]
}