{
  "url": "https://www.wikihow.com/How-Much-to-Tip-Grocery-Delivery",
  "title": "How Much Should You Tip for a Grocery Delivery Service?",
  "steps": [
    {
      "title": "Aim to tip 20% of your shopping bill or $5, whichever is highest.",
      "content": "Aim to tip 20% of your shopping bill or $5, whichever is highest. Tip at least 10% if you have a smaller order, but 20% is generally better to keep drivers afloat. Tack on an additional $3-5 for weather difficulties and $1-2 if the delivery person has to climb a ton of stairs. [1] X Research source You can also tip using cash—just keep in mind that your delivery driver won’t necessarily know you’re planning on tipping them unless you leave a note online, so they might not be as motivated to get your order to you quickly."
    },
    {
      "title": "Most grocery delivery services allow you to tip a precalculated amount.",
      "content": "Most grocery delivery services allow you to tip a precalculated amount. These will allow you to tip 5-25% without calculating the exact tip yourself. However, if your service doesn’t precalculate the tip, just take the percentage you’d like to tip, slide the decimal one space to the left, and multiply that number by your order total. [2] X Research source For example, if your shopping bill comes out to $63.19, and you want to tip your driver 20%, just multiply 63.19 by .2 to get $12.64 as your tipping amount."
    },
    {
      "title": "Adjust your tip after delivery if the service was exceptional or poor.",
      "content": "Adjust your tip after delivery if the service was exceptional or poor. In many cases, grocery delivery apps will allow you to adjust a tip after delivery if the original amount you entered doesn’t accurately reflect the quality of the delivery service. While some apps allow you to adjust the amount yourself, others will ask you to contact customer service to make changes. [3] X Research source Instacart You can decrease the tip up to 2 hours after delivery or increase the tip for up to 2 weeks after the delivery date. To adjust your tip in-app after the delivery, tap the 3 horizontal lines in the top left corner, select “Your orders,” and tap the delivery you want to adjust. Tap “View order details,” then click “View receipt” and change the tipping amount. DoorDash You can add a tip up to 30 days after the delivery is complete. If you’d like to change the tip amount after your food is delivered, contact customer support . [4] X Research source Grubhub Contact customer support to change your tipping amount after the delivery is complete. Shipt Once you leave a tip, you can’t change the amount. However, you have unlimited time to add a tip after your order has been delivered. [5] X Research source Uber Eats You have 6 hours after your groceries have been delivered to adjust the tip. Open the app and tap “Shopper Tip” to change how much you’d like to give your driver, then tap “Save.” Amazon Fresh You can change your tipping amount up to 24 hours after the delivery. Look at the bottom of your price layout for your order, select the “Edit” button next to “Tip” and enter the amount you’d like to change it to. [6] X Research source Walmart Grocery You can edit your tip up to 24 hours after your delivery, and you have up to 14 days after the delivery to leave a tip. On the Walmart website, select “Account,” then “Purchase History,” then tap the appropriate order. Then, select “Add tip” and enter the amount you’d like to give your driver. [7] X Research source Try to avoid “tip baiting” your delivery drivers. Some customers set their tip to $0 after their groceries have been delivered to make sure that their delivery arrives quickly."
    },
    {
      "title": "It’s time-saving and convenient.",
      "content": "It’s time-saving and convenient. If you’re busy during the workweek, it can be difficult to carve out time to make it to the grocery store. With delivery, you can enjoy an easy, hassle-free shopping experience—no standing in lines needed. [8] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "It creates jobs.",
      "content": "It creates jobs. Grocery delivery has shot up in popularity, leading to a huge job boom for delivery drivers, engineers, operations managers, and more. [9] X Research source"
    },
    {
      "title": "It increases small business revenue.",
      "content": "It increases small business revenue. Because ordering online is more convenient for customers, they might choose to order something they need right away rather than waiting until their next grocery day, which also increases grocery store revenue. Ordering food from your favorite local grocery store also helps keep small businesses afloat. [10] X Research source"
    },
    {
      "title": "You save gas money.",
      "content": "You save gas money. If you have to go to the grocery store often, the money you spend on gas alone can add up quickly. Save a little extra money and reduce the number of miles you put on your car by getting your groceries delivered instead of going all the way to the grocery store. [11] X Research source"
    },
    {
      "title": "You can stay on a budget more easily and plan your meals in advance.",
      "content": "You can stay on a budget more easily and plan your meals in advance. If you’ve ever shopped on an empty stomach, you know how easy it can be to impulse buy. Because online shopping has all the items and their prices laid out for you on one screen, you may be less tempted to buy items you don’t need, you can stay on budget by using electronic coupons, and you can plan your meals ahead of time and avoid buying food that you already have. [12] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "It can be more expensive.",
      "content": "It can be more expensive. Although you’re less likely to overspend, there may be additional usage and delivery fees depending on the store you buy from. [13] X Research source"
    },
    {
      "title": "Not every item is easily accessible on the app.",
      "content": "Not every item is easily accessible on the app. You might not be able to order a certain item because they don’t have it listed online yet. Plus, it can be difficult to find what you’re looking for, especially if you’re searching for a specific brand or sized item. [14] X Research source"
    },
    {
      "title": "Orders can be delivered with missing items.",
      "content": "Orders can be delivered with missing items. Although most grocery delivery services allow you to ask for substitutions if something is out-of-stock, orders have been delivered without the item altogether, which risks you having to take another trip to the grocery store. [15] X Research source"
    },
    {
      "title": "You can’t hand-pick perishables, such as produce or meat.",
      "content": "You can’t hand-pick perishables, such as produce or meat. Buying fresh produce or packaged meat products can be difficult because you aren’t in the store to pick the best items yourself. As a result, you may receive perishables that are less high-quality. [16] X Research source"
    }
  ]
}