{
  "url": "https://www.wikihow.com/Make-a-Cone-Hat-for-a-Cat",
  "title": "How to Make a Cone Hat for a Cat",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To start, you will need the proper supplies to make a hat for your cat. You can get most supplies at a local craft store, although you may have some of them lying around your house. You will need the following: [1] X Research source A pen or pencil A ruler Scissors A glue stick Plain or patterned paper - the type of paper is up to you, but sturdier craft paper you find at a craft store may be the most moldable. You can also try construction paper. Avoid flimsy papers, like tissue paper or wrapping paper."
    },
    {
      "title": "Cut your paper in a triangular shape.",
      "content": "Cut your paper in a triangular shape. Start at the corner of the paper, as you'll be using the corner as the sides of your triangle. You will be cutting out a triangle with two sides of three inches, so your paper should be at least a 3 inch by 3 inch square. Take your ruler and measure three inches on each sides of the corner. You will want two out of three of the triangle's sides to be three inches long. [2] X Research source The third side of your triangle should not be a straight line. You want to cut it into a curved shape, like a side of a circle. Your curve does not need to be perfect. You will be trimming down the curve later after assembling the hat."
    },
    {
      "title": "Curl your paper.",
      "content": "Curl your paper. Hold the bottom of the paper with one hand. With your other hand, take your pen. Place the pen towards the bottom of the paper, where your other hand is holding the paper. [3] X Research source Place your thumb on top of the piece of paper, and press the pen into the paper with your other fingers. Run the pen swiftly across the paper, with your thumb firmly pressing the pen and paper together. Use enough force to create a curl, but not so much force that you inadvertently damage the paper. When you're done, the triangle should already be forming a cone-like shape."
    },
    {
      "title": "Glue the paper into a cone.",
      "content": "Glue the paper into a cone. Dab some glue along either edge of the paper that is slightly rolled into a cone shape. Press the two edges together to create a cone. You should now have what looks like a small birthday hat. [4] X Research source [5] X Research source You can secure the cone together with paper clips while waiting for the glue to dry. Be sure to leave a small opening on the top of the cone. Later, when you embellish the cone by adding ruffles or a puff at the top of the cone, you will need a small hole."
    },
    {
      "title": "Trim the base of your cone.",
      "content": "Trim the base of your cone. Use your scissors to trim around the base of your hat. You want to trim to the point you can set the hat down on a table and it will stand more or less flat. This makes the hat more comfortable for your cat. [6] X Research source Do not worry if the hat does not lie perfectly flat. As long as it does not lean too far in one direction, it should be okay to place on your cat's head."
    },
    {
      "title": "String elastic thread through the hat to tie the hat in place.",
      "content": "String elastic thread through the hat to tie the hat in place. Use a hole puncher to punch two holes on either side of the hat. Take some elastic thread, which you can buy at a craft store, and tie one piece of thread in either hole. When you put your hat on your cat, you can tie these two threads together to secure the hat in place. [7] X Research source Make sure your threads are long enough. It's a good idea to use slightly more thread than you think you need. That way, the threads will not be too tight when you put the hat on your cat. If you have too much thread, you can always trim it down later. If you can't find elastic thread, ribbon or regular string can work in a pinch. However, elastic string works best as it will cling to your cat's face, keeping the hat on his head."
    },
    {
      "title": "Add some fringes to the top of the cone hat.",
      "content": "Add some fringes to the top of the cone hat. A plain cone hat is a little boring. You can add some curly fringes stemming from the top of the hat with some construction paper. Take some colorful construction paper and cut out a 3 inch by 2 inch rectangle. Make a series of small cuts running across one of the longer sides of the rectangle. When you're cutting, stop about half an inch from the other side of the rectangle. [8] X Research source Curl all the small fringes of construction paper with your pen or pencil. Roll the rectangle up as tight as you can. You should now have a piece that looks something like an umbrella, but with curly fringes on top. You should be able to fit the non-fringed end of the rectangle into the small hole on top of your cat's hat. Use some glue to hold the rectangle in place. You should now have a hat for your cat with fun fringes coming off the top."
    },
    {
      "title": "Place a puff ball on top of the hat.",
      "content": "Place a puff ball on top of the hat. If fringes seem a little too flashy, you can simply add a puff ball to the top of your cat's hat. You can add a puff ball in any color you want and secure it to the hat with a little glue. [9] X Research source You can buy puff balls at a craft store. They come in a variety of sizes and colors. You can even get sparkly or glittery puff balls. Make sure you wait for the glue to dry completely before putting the hat on your cat. Cats may be eager to play with puff balls that fall off the hat."
    },
    {
      "title": "Write on the hat.",
      "content": "Write on the hat. It can be fun to use a marker or pen to write on your cat's hat. If you're struggling to write on the cone itself, you can write something on a small piece of construction paper, cut it out, and glue it to the hat. You can write whatever you want on the hat. If it's your cat's birthday, something like, \"Birthday Boy!\" can be fun. If it's New Years, try writing the year on the hat. This can be a fun, cute New Years Eve costume for your cat."
    },
    {
      "title": "Check for possible hazards.",
      "content": "Check for possible hazards. You do not want your cat to end up swallowing a part of the hat and becoming sick. Do not use any small parts on your hat. Your cat may break these parts off, chew on them, and potentially swallow a hazardous item. When decorating the hat, go for bigger items. A puff ball is big enough to be safely placed on a hat, as it probably will not pose a choking hazard. Something like googly eyes, however, may be tempting for your cat to chew and swallow. Read product labels. Do not use anything on your hat that has warnings about being toxic to children or pets."
    },
    {
      "title": "Do not leave your cat alone with the hat in place.",
      "content": "Do not leave your cat alone with the hat in place. This is especially important if you put thread on the hat to hold it in place. Threads could get twisted on other objects in your home, trapping and potentially choking your cat. [10] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Watch your cat closely when he is wearing the hat. Do not let him out of your site as long as the hat is on. Do not let him crawl under a bed or in a drawer when he's wearing the hat. Do not leave your home when your cat is still wearing his hat. Remove the hat before going out."
    },
    {
      "title": "Avoid forcing your cat to wear the hat.",
      "content": "Avoid forcing your cat to wear the hat. Costumes can be fun, but most pets are happiest without clothing of any kind. If your cat is resistant to wearing the hat, do not force it. You want your cat to live in a stress free home, and forcing costumes can cause anxiety. [11] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If your cat squirms or cries when you put the hat on, stop and let your cat go. It's best not to force your cat to wear a costume against his will. You should also not force your cat to wear the hat if it restricts his vision or movement."
    }
  ]
}