{
  "url": "https://www.wikihow.com/Make-Someone-Love-You-Again",
  "title": "How to Make Someone Love You Again",
  "steps": [
    {
      "title": "Ask yourself why you want their love.",
      "content": "Ask yourself why you want their love. It’s important that you’re self-aware in going into this. Do you want them to love you because you feel lonely, you miss them, you want to reconnect, or you want someone in your life? Do you regret your actions and want to deal with the guilt? Are you feeling disconnected and wanting more closeness? [1] X Research source Imagine your ideal circumstance. If you know what you want from them, you might have a good reason to seek their love. You may find out that you don't have a great reason. Maybe you miss how good it felt to be loved, but don't really want to get back together. In this case, leave them alone. Be clear why you want this person’s love and help that motivate you to win their affection."
    },
    {
      "title": "Speak in person.",
      "content": "Speak in person. If you haven’t spoken in a bit, you may wish to reach out. While it’s okay to establish a connection through a text or message, make sure you speak in person. This way, nothing can get lost in translation and you can be in each other’s presence. If they are hesitant to see you, then wait some time and try again. If they agree to meet you, this is a promising first step. See what it’s like to be with them and what emotions it brings up for both of you. Does it seem likely that you can win back their love?"
    },
    {
      "title": "See if they’re on the same page.",
      "content": "See if they’re on the same page. If you want to make someone love you again, make sure they are at least open to returning to a loving relationship with you. If they are distant or angry with you, don’t get your hopes up. You may need to give some space. If they have told you that being loving toward you won’t happen again, don’t try to convince them. Respect their decision and let them know that you are open to being in a loving relationship with them. [2] X Research source If they are clear that they do not want to love you, say, “I respect your decision, even if I feel differently. Please know that this is what I want and I’m leaving the door open if you want to reconsider.”"
    },
    {
      "title": "Be your best self.",
      "content": "Be your best self. Put your best foot forward and showcase all of your best qualities. Remind them of all the things they used to love about you. Think about your best attributes and let them shine! The person may have told you what they loved about you in the past, like your smile, your wit, or your compassion. Make extra effort to bring these traits forward. Being your best self will show them how irresistible you are. [3] X Research source For example, if you tend to be a funny person and they enjoyed your humor, reach out with a joke or silly story. If you don’t know your best attributes, write out the characteristics you think you embody. For example, you might write kind, thoughtful, sincere, forgiving, funny, caring, generous, intelligent, and open-minded."
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. Eye contact is important for creating a connection with somebody else. Most importantly, you must learn how to make proper eye contact. There is no “right way” to make eye contact overall. Instead, tune in to the person’s eye contact. Do they make frequent eye contact, meet your eyes then look away, or maintain a steady gaze? Mimic their style so that they feel connected to you. For example, if the person likes to make constant eye contact, they may think your fleeting eye contact is dismissive, while someone who prefers less eye contact might find your steady gaze intimidating."
    },
    {
      "title": "Spend time together.",
      "content": "Spend time together. It’s hard to get someone’s love if you’re only texting or emailing. Spend time together away from talking about what went wrong or is going wrong. Do activities you know you enjoy. Remember their favorite restaurants and movies and find activities that allow you to spend time doing fun things together. [4] X Research source You don’t need to travel to a tropical island to reconnect. Just do something that helps you spend time and feel close, like taking a walk or a hike. Show your thoughtfulness by recreating activities that you’ve done together in the past that have been memorable and enjoyable. For example, go back to a special restaurant or rent the first movie you watched together."
    },
    {
      "title": "Laugh and be playful.",
      "content": "Laugh and be playful. Make a point to have fun in each other’s presence. Plan fun activities to do together. Reach out to the person and invite them on a fun activity, like going ice skating or seeing an improv show. Do activities that bring out a fun and loving side to both of you. Talk about things that make the other person laugh or smile. Be intentionally silly or playful. Remind them of how much fun you have together."
    },
    {
      "title": "Talk openly and honestly.",
      "content": "Talk openly and honestly. Honesty is the basis of trust and often, love. Being honest will show the person that you’re serious, which they may respect and like about you. However, honestly isn’t just telling the truth. Say things in a way that the person will understand them and benefit from them. Sometimes, brutal honesty can do more harm than good, so try some tender honesty. If the person asks you an uncomfortable question, answer it honestly, even if you know they won’t like the answer. However, you may also want to talk about what has changed. [5] X Research source If you’ve made mistakes, admit them. Say how you’ve grown since making the mistake and how you will avoid future similar mistakes. Don’t be afraid to ask hard questions, either."
    },
    {
      "title": "Express unconditional love.",
      "content": "Express unconditional love. Even if the person has harmed or hurt you, be unconditional in your love toward them. Show them that though times may be difficult and the relationship may waver, you will be a constant source of love and support. If the person is hesitant in expressing their love, don’t be hesitant in giving your love. Even if the person upsets you or lets you down, be unwavering in your love toward them. [6] X Research source However, if they ask you to leave them alone or to give them more space, respect their request. Do not stalk them or give them more attention than they’d like. You don’t want to turn them off or have them upset with you for going overboard on your attention and affection."
    },
    {
      "title": "Love yourself.",
      "content": "Love yourself. Remember that above all, you must learn to love yourself before you love another. Think about what aspects of yourself you suppress or feel ashamed to show to the world. Feel free to show your true self to yourself, friends, family, and to the person you want love from. Allow them to see you in your entirety. [7] X Research source If you feel scared being vulnerable or feel like you are unlovable, work with a therapist. They can help you uncover your insecurities, work through your wounds, and build your self-esteem."
    },
    {
      "title": "Admit any wrongdoings.",
      "content": "Admit any wrongdoings. The person may be impressed to hear you admit anything you’ve done that has hurt or harmed them. Especially if they see you as stubborn, this can help them see a new side of you that they may not have considered, which can open the doors to love. Show that you are a bigger person than you were before. Say, “I know I made some mistakes, and I regret them. I was different then and have learned to be a better person.”"
    },
    {
      "title": "Rebuild broken trust",
      "content": "Rebuild broken trust . A big part of repairing trust is forgiveness. Forgive yourself and forgive them. Forgive yourself for the mistakes you made and the hardships you contributed to in your relationship. Forgive the other person for their mistakes, judgments, or problems. Then, begin to trust yourself. If you cheated, know that you won’t do it again. Also, trust them. If they cheated, trust them to not do it again. [8] X Research source If you hurt the other person, don’t expect to earn their trust right away. Show them that you can be trusted by being honest."
    },
    {
      "title": "Set the intention to make changes.",
      "content": "Set the intention to make changes. It’s time to get humble. If the relationship is on bad terms due to a mistake you made or bad habits you continued that your partner couldn’t handle, take responsibility and consider their view. Think back on the gripes they expressed and work on them on your own accord, without their prompting. Say that you are now listening to their feedback and willing to improve. Tell the person that you’re inspired to be better because of them. [9] X Research source For example, if the person became distant or broke up with you due to your addiction, make this part of your motivation to get sober. Reader Poll: We asked 302 wikiHow readers what change they’re most interested in making before trying to date their ex again, and 62% agreed that they want to focus on maturing as a person . [Take Poll]"
    },
    {
      "title": "Follow through on changes.",
      "content": "Follow through on changes. It’s not enough to have good intentions, you have to follow through on them. Be solutions-focused in making changes happen by choosing to improve who you are as a person and as a partner. If you were a bad partner, make efforts to be more supportive, listen, and compromise. Take the initiative to create solutions, anticipate difficulties, and work through existing troubles. [10] X Research source Don’t just say that you’ll get treatment for an addiction. Find a therapist, go to a treatment center, or enroll in rehabilitation as soon as you can. Solve specific problems. For example, if you tend to lose your temper, enroll in anger management and practice your new skills so that you can interact differently. Once you’ve taken action, talk to them. Say, “I’m making changes to make this work. I want this, so I’m willing to do what it takes.”"
    }
  ]
}