{
  "url": "https://www.wikihow.com/Make-a-Fake-Bruise-with-Makeup",
  "title": "How to Make a Fake Bruise with Makeup",
  "steps": [
    {
      "title": "Place the bruise.",
      "content": "Place the bruise. Decide where you will put the bruise and consider what would have caused a bruise in that particular area. This will help you decide where the bruise should be as well as it’s shape and size. Put the bruise in a place which is easy to reach to make applying makeup simple. The shape of the bruise should reflect whatever you think would have caused it. Consider a bruise on your forearm as if it was hit by a blunt object like a bat, which would be an oval bruise. It would be a little longer than it is wide and have rounded edges. Another option is giving yourself a black eye as if you were punched in the face."
    },
    {
      "title": "Apply a base layer of red eye shadow.",
      "content": "Apply a base layer of red eye shadow. Cover your bruise area with a base layer of red eye shadow. This should create a good size and shape for you to work with. The red will represent all of the area of irritation effected by the bruise. [1] X Research source For example, if you are creating the effect of a black eye, curve the red around the bottom of the eye, beginning in the corner and expanding out below the eye and to the side in a crescent shape. It should be about one inch wide at the largest section near the outer, bottom corner of the eye. You can add some red on the edge of the top eye lid to show irritation."
    },
    {
      "title": "Add purple eye shadow to the area to give the bruise some color and depth.",
      "content": "Add purple eye shadow to the area to give the bruise some color and depth. Purple should be used on the deepest sections of the bruise to make it really stand out. In the black eye example, start at the bottom corner of the eye and draw along the edge of the bottom lid. Starting back at the corner, draw down along the edge of the eye socket. This will create sort of a “greater than” symbol or a “v” on it’s side."
    },
    {
      "title": "Age your bruise with yellow and green.",
      "content": "Age your bruise with yellow and green. If you have yellow and green eye shadow and want your bruise to appear to be healing, you can blend some green out around the edges of the bruise, as well as a spot of it in the center. Dab yellow on the edges and in the center of these green sections as highlights. [2] X Research source Use green and yellow around the edges of the crescent in your black eye. Also put some in the corner of your eye, pushing it into the dip in the socket and dragging it slightly up the top lid and down the corner of the bottom."
    },
    {
      "title": "Dull any bright spots using black eye shadow.",
      "content": "Dull any bright spots using black eye shadow. If your green and yellow stand out, are too bright, or make your bruise look unrealistic, you can dab little spots of black throughout these areas to dull them and break up the color a bit. You can also use black to darken the purple areas if your shade was a little light, or you want more emphasis."
    },
    {
      "title": "Blend the bruise into the skin and make it last with face powder.",
      "content": "Blend the bruise into the skin and make it last with face powder. Take a large makeup brush and apply some powder to the area. Powder the entire bruise with face powder to blend it into your skin tone and take out some of the shine from the eye shadow. [3] X Research source"
    },
    {
      "title": "Fool your friends.",
      "content": "Fool your friends. Let them notice the bruise before you go around showing it off. They are more likely to believe it is real if you don’t say anything about it. Let them ask you what happened and be prepared with a fake story. If they don’t ask about it, you can “accidentally” touch the bruise or hit it on something, then react as if it hurt."
    },
    {
      "title": "Decide on the timeline of the bruise.",
      "content": "Decide on the timeline of the bruise. Bruises go through a cycle of trauma and healing. Each part of this cycle reflects different colors and intensity. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source A new bruise is dark red due to the blood pooling under the skin. Next the bruise begins to loose iron and purples. As the bruise begins to heal, it will green around the edges. Before the bruise fades, it will develop yellow spreading across the skin. Lastly, the bruise fades back into regular skin color."
    },
    {
      "title": "Purchase a color wheel.",
      "content": "Purchase a color wheel. There are several brands of stage makeup which range from inexpensive Halloween makeup to professional stage makeup. The most popular brand of makeup used for theater is Ben Nye. [5] X Research source Mehron and Ben Nye both offer a product called a “Bruise Wheel.” The colors you will want for your bruise are red, purple, yellow, green, and blue. Choose darker, duller tones like maroon, mustard and olive."
    },
    {
      "title": "Create a red base layer.",
      "content": "Create a red base layer. Using a makeup sponge, dab it in the red makeup. Apply a cover of red in the size and shape of your bruise. Keep this layer light. Your skin should still show through the makeup. This layer of red should resemble skin irritation."
    },
    {
      "title": "Add depth with darker colors.",
      "content": "Add depth with darker colors. Use a stippling sponge to add purple and blue makeup to your bruise. Work from the edges toward the center of the bruise. [6] X Research source Continue using very little makeup and add small amounts at a time. Blend hard edges with your finger or makeup sponge to blend the dark colors into the red makeup."
    },
    {
      "title": "Highlight the bruise with yellow.",
      "content": "Highlight the bruise with yellow. Use your makeup sponge to apply a dab of yellow to the center of the bruise. This will give it highlight, as well as the appearance of beginning to heal."
    },
    {
      "title": "Age the bruise with yellow and green.",
      "content": "Age the bruise with yellow and green. If you want the bruise to look like it has been there for a while and is almost healed, start with a base layer of yellow instead of red. Create a circle of purple in the middle of the yellow for depth, then add green around the outside edges of the purple. [7] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}