{
  "url": "https://www.wikihow.com/Make-a-Crossword-Puzzle-in-Microsoft-Word",
  "title": "How to Make a Crossword Puzzle in Microsoft Word",
  "steps": [
    {
      "title": "Create a table with 2 columns and 10 to 12 rows.",
      "content": "Create a table with 2 columns and 10 to 12 rows. Open up Microsoft Word and click “Insert” at the top of the toolbar. Then, hit “Table,” and select one with 2 columns and 10 to 12 rows (depending on how many hints you’re going to create). Toggle the left row until it’s super small—the left row of the table only needs to fit a single number, while the right row is going to hold all of your hints. [1] X Research source Keep this table in landscape mode so you can read and write your hints easily."
    },
    {
      "title": "Add your hints to the right columns.",
      "content": "Add your hints to the right columns. Make your hints specific, and don’t forget to keep track of which answers they go with! If you want to, you can add the answers in with the hints for now, since you’ll be editing them later. Type your hints into the right row of the table, but leave the left one blank for now. [2] X Research source If you wrote your hints out ahead of time, you can simply copy and paste them into this new table."
    },
    {
      "title": "Insert a 10 x 10 table into the document.",
      "content": "Insert a 10 x 10 table into the document. Scroll down to a new page and click “Insert” again, then select “Table.” This time, pick a table with 10 rows and 10 columns. When you can see the table in your document, toggle the grid so that the height and the width are exactly the same. [3] X Research source In standard crossword puzzles, the height and width are the same, which is why it’s important to do this step now."
    },
    {
      "title": "Add your answers to the 10 x 10 table.",
      "content": "Add your answers to the 10 x 10 table. Now it’s time to create your crossword! Take a look at your hints again and strategically place your answers into the grid. You can add them both horizontal and vertical, and don’t be afraid to cross some over each other! This could take a little while, since you’re creating the puzzle part of your crossword puzzle. [4] X Research source Answers can cross over each other if they both contain the same letter. For instance, if the word “banana” is going across and “apple” is going down, you could make the “a” in “apple” the same as one of the a’s in “banana.”"
    },
    {
      "title": "Assign each answer a number, then match the number to the hints.",
      "content": "Assign each answer a number, then match the number to the hints. In your answer grid, add a number to the first letter of each answer so you know where it starts. Then, write the number that correlates with each answer next to each of your hints. That way, you’ll keep track of which answer goes where in your puzzle. [5] X Research source You can make the numbers smaller by highlighting the number and then hitting “Ctrl,” “Shift,” “Plus” at the same time."
    },
    {
      "title": "Divide your hints into 2 separate text boxes.",
      "content": "Divide your hints into 2 separate text boxes. In your toolbar, click “Insert,” then “Textbox.” Add 2 text boxes right next to each other, and label one “Down” and one “Across.” Then, divide your hints into the separate boxes based on which way their answers go. [6] X Research source"
    },
    {
      "title": "Delete the unnecessary cells in the answer table.",
      "content": "Delete the unnecessary cells in the answer table. Highlight the entire 10 x 10 table, then select “No border.” Highlight one of the letters in the answers, then click Select > Select text with similar formatting. Click the borders option again in the toolbar, then select “All borders.” This will create a grid that perfectly fits your crossword puzzle without any unnecessary boxes. [7] X Research source Unfortunately, on Microsoft Word, you can’t create a traditional look with black boxes surrounding the answers."
    },
    {
      "title": "Delete your answers and drag the hint text boxes up to the grid.",
      "content": "Delete your answers and drag the hint text boxes up to the grid. Blank your crossword puzzle out by deleting each letter in the grid. Drag your text boxes up so everything fits on one page, and arrange them however you’d like to. Once you’ve done that, your crossword puzzle is ready to print! [8] X Research source To print your crossword puzzle, hit “Ctrl” and “P” at the same time."
    },
    {
      "title": "Download a free template to skip the formatting.",
      "content": "Download a free template to skip the formatting. There are tons of different Microsoft Word templates you can use for crossword puzzles for free. EclipseCrossword and Crossword Labs are 2 of the most popular ones, and you can add them to your Microsoft Office in no time. Hit “download” and wait for them to load onto your computer before you start making your puzzle. [9] X Research source You can also search for templates in Microsoft Word. If you don’t have any templates already downloaded, you can find ones that you want right in Word. Open up a new document, then click “File,” and “new.” Then, type crossword into the search bar."
    },
    {
      "title": "Enter your list of words and hints.",
      "content": "Enter your list of words and hints. Crossword makers do most of the work for you, but you still have to write them out. Once you come up with a list of hints and words you’d like to use, go ahead and type them into the relevant spaces. Then, your crossword will be formatted for you, and all you have to do is print it out! [10] X Research source"
    },
    {
      "title": "Scroll through different puzzle formats to pick your favorite.",
      "content": "Scroll through different puzzle formats to pick your favorite. If you don’t like the format that your crossword maker spit out at first, feel free to change it up. You can pick a traditional-looking crossword with black squares instead of blanks, or you can go for a more modern version with colorful spots in the middle. [11] X Research source You might also be able to decorate your crossword puzzle with fun stickers or logos."
    },
    {
      "title": "Pick an exciting theme.",
      "content": "Pick an exciting theme. It’s much easier to come up with answers and hints if your crossword puzzle has a general theme that you can stick to. Before you start creating, sit down and think of a fun, relevant theme that you can model your crossword after. Make it relevant to your audience, and pick something broad that you can create a lot of hints for. [12] X Research source Some fun themes include toys and games, 90’s nostalgia, fruits and vegetables, pop culture, insects, plants, or sports."
    },
    {
      "title": "Create fun hints that make you think.",
      "content": "Create fun hints that make you think. When it’s time to think of the hints, feel free to get creative. You don’t want your hints to be too easy (unless you’re making a crossword puzzle for young kids), but you also don’t want your audience to be stumped. As you write out your hints, try to read them on their own and think about whether or not you’d be able to guess the answer based on your hints alone. [13] X Trustworthy Source Read Write Think Online collection of reading and writing resources for teachers and students. Go to source For instance, if your answer was “banana,” you might write, “A fruit, yellow and curved.” If the answer was “lunch,” your hint might be, “The thing you eat after breakfast.” If your answer was “cold,” you might write, “The inside of your freezer.”"
    },
    {
      "title": "Consider the age of your audience.",
      "content": "Consider the age of your audience. A crossword puzzle for 8 year olds will be much different than a crossword puzzle for older adults. Younger children don’t have the life experience that older adults do, so they may need easier hints and simpler words. You should also keep in mind the specific audience you’re handing out your crossword puzzle to: a group of biologists might enjoy a crossword puzzle full of scientific terms, while a group of writers might love a puzzle full of obscure words. [14] X Trustworthy Source Read Write Think Online collection of reading and writing resources for teachers and students. Go to source"
    },
    {
      "title": "Check out a daily crossword puzzle for inspiration.",
      "content": "Check out a daily crossword puzzle for inspiration. If you subscribe to a newspaper or do crossword puzzles online, you can get some inspiration from people who write crossword puzzles for a living. Check out how they write each hint and how long all their answers are. You should also take note of how tough the hints are and how long it takes you to solve the puzzle. The more crosswords you write, the better you’ll get! [15] X Expert Source Ada Nicolle Crossword Puzzle Expert Expert Interview. 27 November 2024. [16] X Trustworthy Source Read Write Think Online collection of reading and writing resources for teachers and students. Go to source The New York Times has a fairly famous daily crossword puzzle that you can play online."
    }
  ]
}