{
  "url": "https://www.wikihow.com/Know-if-Your-Cosmetics-Contain-Lead",
  "title": "How to Know if Your Cosmetics Contain Lead",
  "steps": [
    {
      "title": "Know the lead limits for color additives.",
      "content": "Know the lead limits for color additives. In the U.S., the Food and Drug Administration (FDA) has limited authority to regulate cosmetics, but it can legally regulate color additives in cosmetics (as well as foods and drugs). Color additives require prior approval from the FDA before the products can legally be manufactured or sold in the U.S. [1] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Although there are some variations, the typical limit for lead in a color additive is 20 parts per million, which is well within recognized safe parameters under normal use. A listing of FDA-permitted color additives is available at https://www.fda.gov/Cosmetics/Labeling/IngredientNames/ucm109084.htm ."
    },
    {
      "title": "Be wary of traditional eyeliners.",
      "content": "Be wary of traditional eyeliners. Eyeliners known by names including kohl, kajal, and surma have long been popular in many parts of the world, and occasionally appear for sale in the U.S. However, these eyeliners contain high amounts of lead and are not approved for sale or use in the U.S. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The danger of these products is real — they have been linked to cases of lead poisoning in children. These eyeliners are on an FDA “import alert,” meaning they can be seized by FDA field personnel to prevent sale or distribution."
    },
    {
      "title": "Use progressive hair dyes cautiously, and only as intended.",
      "content": "Use progressive hair dyes cautiously, and only as intended. Most hair dye products, and especially progressive hair dyes that darken hair color over time, use color additives that are subject to FDA approval. They typically contain lead acetate, and are permitted by the FDA to have much higher concentrations of lead than is typically allowed for color additives. [3] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The FDA contends that, when used as intended, the elevated lead content in these products is not a health concern because the product does not enter the body. However, the products must contain this special label on the packaging: \"Caution: Contains lead acetate. For external use only. Keep this product out of children's reach. Do not use on cut or abraded scalp. If skin irritation develops, discontinue use. Do not use to color mustaches, eyelashes, eyebrows, or hair on parts of the body other than the scalp. Do not get in eyes. Follow instructions carefully and wash hands thoroughly after use.\""
    },
    {
      "title": "Weigh your options with lipstick.",
      "content": "Weigh your options with lipstick. Lipstick is the most common cause for concern about lead in cosmetics, as emails, news stories, and press releases about lead in lipstick seem to make the rounds in waves every several years. [4] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The FDA has done substantial testing and is not concerned with the findings. However, it did find lead in virtually every lipstick tested. The other sections of this article contain more information on lead content in lipstick. Practically speaking, however, the darker (especially red) your lipstick is, the more likely it is to have greater amounts of lead in the pigments. [5] X Research source"
    },
    {
      "title": "Don’t expect to find lead listed among the ingredients.",
      "content": "Don’t expect to find lead listed among the ingredients. Your lipstick can contain lead without noting it on the package ingredients because lead is not considered an ingredient. That is, manufacturers don’t purposely add lead as part of the manufacturing process. Instead, lead is considered a “contaminant” that is present in trace amounts in the base materials and pigments that constitute the product. [6] X Research source In the U.S., the Food and Drug Administration (FDA) actually has quite limited authority in regards to identifying and banning substances such as lead from cosmetics. And, in any case, the FDA has studied the matter and determined that the amount of lead in cosmetics is not a health concern. [7] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Consult existing lists and databases.",
      "content": "Consult existing lists and databases. When the FDA addressed the topic of lead in cosmetics in 2010, it authorized detailed testing of 400 different products. The bad news, if you are worried about any amount of lead in your cosmetics (even if the FDA isn’t), is that each and every product showed traces of the element. The good news is that the entire results list for those 400 products is available online. [8] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source You can also look for lists and searchable databases maintained primarily by organizations that are working to eliminate lead and other potential toxins from consumer products. [9] X Research source Remember that cosmetics formulations change regularly and without warning, so the list of eleven (out of 33 products) that passed muster during testing by the Campaign for Safe Cosmetics in 2007 is probably no longer accurate. Seek out up-to-date information whenever possible. [10] X Research source"
    },
    {
      "title": "Contact the manufacturer.",
      "content": "Contact the manufacturer. Even if your cosmetics manufacturer is not required to list trace amounts of lead in its products, it may have conducted testing (or be aware of testing results) that determined any lead content. They don’t have to disclose this information to you, either, but it can’t hurt to ask. [11] X Research source Increasing numbers of cosmetics companies are proud to advertise that their products are “lead-free,” but again there is no clear definition of that term. Does any trace amount of lead count? How much testing must be done? Who did the testing? You can feel more confident about choosing products that are advertised as lead-free, but you can’t be completely certain due to the lack of established, common standards."
    },
    {
      "title": "Test the product yourself.",
      "content": "Test the product yourself. If you really want to be certain whether your favorite lipstick or face cream contains lead, the most accurate results will come from sending the product to a laboratory that can do detailed testing. There are actually laboratories that advertise for this service, so some people must be utilizing it. [12] X Research source You can also purchase at-home testing kits from various sources, although the accuracy cannot be guaranteed. [13] X Research source There is also a simple at-home method that may or may not be useful (depending upon who you ask). It involves smearing your chosen product onto a clean surface, then thoroughly rubbing a piece of gold, copper, pewter, or silver on it. Supposedly, the presence of lead will cause the product to discolor with darker streaks or smears. Again, the effectiveness of this method has not been confirmed."
    },
    {
      "title": "Recognize the dangers of lead.",
      "content": "Recognize the dangers of lead. Lead is an element that has served useful purposes from plumbing to paint and beyond for centuries, but the dangers of excessive lead levels in the body have become apparent in recent decades. Lead is a neurotoxin that can cause behavioral, developmental, and learning difficulties. It is therefore particularly dangerous for children and their developing brains. [14] X Research source See the handout created by an agency of the U.S. Centers for Disease Control and Prevention (CDC) (available at https://www.atsdr.cdc.gov/ToxProfiles/tp13-c1-b.pdf ) for detailed information about lead, how it enters the body, how it impacts the body, and how to limit exposure."
    },
    {
      "title": "Don’t overreact to the situation.",
      "content": "Don’t overreact to the situation. Yes, 400 out of 400 cosmetics tested by the FDA in 2010 contained lead (and a separate major study also got a 100% result). And yes, lead is a toxic substance. That said, among the most likely sources for dangerous levels of lead exposure, your cosmetics are pretty low on the list. Continuing to use cosmetics is unlikely to significantly alter the amount of lead in your body, and pitching all your cosmetics will not protect you from possible lead exposure from more likely sources. [15] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source You are more likely to be exposed to higher levels of lead by way of water carried through old pipes, houses built before 1978 with flaking paint, and airborne dust near industrial sites, to name some examples. [16] X Research source Often with good intentions, some individuals and groups have resorted to scare tactics in order to advocate for the removal of all traces of lead from cosmetics. You may have gotten emails before that say cosmetics companies intentionally use lead because it lowers their costs, and that lead causes cancer. In reality, most lead in cosmetics occurs as a natural contaminant, and the possible links between lead exposure and certain cancers are still unclear."
    },
    {
      "title": "Look at both sides of the debate.",
      "content": "Look at both sides of the debate. On one hand, then, you have organizations like the FDA that state that the small amounts of lead found in cosmetics are of no real health concern. On the other hand, you have advocacy groups and some researchers who focus on the fact that lead is a toxic substance, and say that it should be avoided in any amount whenever possible. Advocates against lead in cosmetics believe that the FDA does not adequately factor in the cumulative impact of reapplying a product like lipstick several times per day, every day. This cumulative buildup, they contend, can push lead intake above the daily “safe” threshold, especially for children. [17] X Research source [18] X Research source There is, unfortunately, no clear consensus about the impact of lead in cosmetics."
    },
    {
      "title": "Take practical steps to reduce lead exposure from cosmetics.",
      "content": "Take practical steps to reduce lead exposure from cosmetics. The amount of lead in your lipstick is probably not an issue that should cause you sleepless nights. That said, if you can find cosmetics products that work for you and don’t contain lead, then perhaps it is your best option to choose them. Consider also: [19] X Research source [20] X Research source Limiting the use of cosmetics by children, especially when it comes to reapplying lipstick or other lip products. Reapplying lipstick or lip products yourself only as necessary, and ideally not more than a handful of times per day. Choosing lighter shades of lipstick and makeup, which tend to have less lead in them. Seeking out lead-free products and/or testing your cosmetics for lead, as discussed elsewhere in this article."
    }
  ]
}