{
  "url": "https://www.wikihow.com/Handle-Being-Dropped-from-Your-Sports-Team",
  "title": "How to Handle Being Dropped from Your Sports Team",
  "steps": [
    {
      "title": "Give yourself some time.",
      "content": "Give yourself some time. It can take a while to process these feelings. Even elite athletes struggle when they’ve lost their position on a team. Being upset is a normal reaction. Be patient and don’t be hard on yourself. Learning to move forward after a loss is a skill that will be helpful all your life, so take all the time you need to get through this. [1] X Research source"
    },
    {
      "title": "Talk to someone who’s been through it.",
      "content": "Talk to someone who’s been through it. Find someone else who has lost their place on a team. Lots of people have had the same experience. Ask good friends or family members to talk about when they faced it. Listen to what they went through and how they dealt with it. A loss like this can feel like the end of the world, so get perspective from someone who has been there before. [2] X Research source"
    },
    {
      "title": "Meet with the coach.",
      "content": "Meet with the coach. Ask for input on why you didn’t make the team. This can reassure you that it wasn’t personal. Coaches have to consider the team as a whole, and not just a single player. Listen to the reasons that contributed to the coach’s decision. Find out if there’s something you can work on in case you decide to try again. [3] X Research source"
    },
    {
      "title": "Try a new activity.",
      "content": "Try a new activity. You may have been too busy before to pursue the different clubs and sports out there.Take this opportunity to explore another activity that you’re interested in. There are lots of ways to be a part of a team. Look into different sports and clubs in your area. Ask friends what they enjoy and be open to trying new things. Pursue other interests. Look into activities you have always been curious about. Try things like art, dancing, or cooking. You may discover new talents!"
    },
    {
      "title": "Play your sport at the recreational level.",
      "content": "Play your sport at the recreational level. Join a non-competitive team to stay active in the sport. Playing on a team with less pressure can help you decide if you still love the game the way you used to, or if you’re burned out. See if you enjoy playing the game in a lower stress situation."
    },
    {
      "title": "Continue to support the team.",
      "content": "Continue to support the team. Don’t lose relationships with your friends who are on the team, which will only make you feel more alone. Stay in touch with your teammates. Attend games to cheer them on. If you decide you want to stay a part of the group, volunteer to help out by doing things such as keeping statistics or managing equipment."
    },
    {
      "title": "Make a plan to get ready for tryouts.",
      "content": "Make a plan to get ready for tryouts. If you decide you still love your sport and want to try again, make a concrete plan for improving your skills. Check out books and DVDs from the library to help you work on the fundamentals of your sport. Focus on the areas the coach mentioned and find drills and exercises to help you improve. Work out a training schedule to keep you on track. [4] X Research source"
    },
    {
      "title": "Be prepared to try a different position.",
      "content": "Be prepared to try a different position. You may find that your skills work better in a different position than you played before. Be flexible about what you’re willing to try. You may even enjoy a different position more. Demonstrate that you’re focused on how you can best help the team. [5] X Research source"
    },
    {
      "title": "Don’t give up on yourself.",
      "content": "Don’t give up on yourself. Whether you decide to try out for the team again or not, remember how much you’ve learned through this experience. Finding your way through disappointment makes you stronger. Keep working to improve, in sports and in life, and believe in yourself! [6] X Research source"
    }
  ]
}