{
  "url": "https://www.wikihow.com/Get-Your-Friend-to-Stop-Copying-You",
  "title": "How to Get Your Friend to Stop Copying You",
  "steps": [
    {
      "title": "Talk in private.",
      "content": "Talk in private. Pull your friend to the side and away from the earshot of others to have this talk. You don't want to risk embarrassing them or having your business aired out to everyone. Ask them to meet you after school or call them at a time you're both free. Say “Hey Sarah, do you have a few minutes to talk after school? I was thinking we could get ice cream. I wanna chat about something.”"
    },
    {
      "title": "Begin the conversation gently.",
      "content": "Begin the conversation gently. Avoid jumping straight to the issue; ease into it instead. Spend a few minutes chatting about their day or the latest news. Once you are both comfortable, you can talk to them about the copying. You can say “Lately, I've been feeling like every time I buy a shirt or pair of shoes, you go out and buy the same ones. I've tried to ignore it but it's been bothering me and I wanted to talk to you about it.”"
    },
    {
      "title": "Listen to their side of things.",
      "content": "Listen to their side of things. Once you have opened up, listen to what they have to say. Don't interrupt them, and even when you feel that they are wrong, try to see things from their perspective. This 'copying' could be a coincidence, or perhaps the items that you have are very popular and worn by many people. They might also admit that they've been copying you. If you tend to get more attention or are more confident, them copying you could be a way to feel cooler. Remember that you friend may be copying an aspect that they admire about you and that it's not necessarily a bad thing."
    },
    {
      "title": "Encourage them to be an individual.",
      "content": "Encourage them to be an individual. If they do admit to copying you, let them know that you're not mad at them. Talk to them about the reasons you two are friends and the things that you like about them. Encourage them to express those things rather than copying your personality or style. For instance, you might say “Kris, you have such a fun personality and I don't know why you'd want to change that to be more like me. I want to be friends with YOU, not a copycat version of myself.”"
    },
    {
      "title": "Manage any defensiveness.",
      "content": "Manage any defensiveness. Your friend might not have taken this news well. They might be offended that you think they are copying you. Even if they yell or get upset, keep a completely neutral tone and demeanor so they don't get more agitated. Base all of your feelings in facts so that you have examples to back them up. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If they say that you're crazy for thinking they would copy you, say something like “In two weeks, you bought four of the same shirts I have. You even cut your hair in the same style as mine. Maybe you didn't notice what you were doing, but it does seem like you're copying me.” When they make valid points, let them know that you understand where they're coming from."
    },
    {
      "title": "End on a high note.",
      "content": "End on a high note. After this talk, try to be positive. Your friend might be feeling a bit low after the chat, but do try to reaffirm your friendship. Hug it out and then give them some space to think. Text or call them the next day to check in. Say something like “I'm glad we could talk about this. Thanks for hearing me out. I still want us to be friends; that hasn't changed. I'll call you tomorrow, okay?”"
    },
    {
      "title": "Compliment them on their own style.",
      "content": "Compliment them on their own style. Your friend might copy you often, but they probably can't do so all the time. On the days that they are being themselves, compliment them. This will reinforce to them that their individuality is valued and they will copy you less. [2] X Research source"
    },
    {
      "title": "Don't let them know what you're wearing beforehand.",
      "content": "Don't let them know what you're wearing beforehand. If you know your friend is a copycat, give them less opportunities to copy you. If they call asking what you are wearing to a party, tell them you aren't sure yet. [3] X Research source"
    },
    {
      "title": "Go shopping alone or with others.",
      "content": "Go shopping alone or with others. Avoid shopping with a friend who copies you, as they will likely buy the same or similar clothes. Especially avoid shopping for big events like prom with these types of friends."
    },
    {
      "title": "Be selective with your social media.",
      "content": "Be selective with your social media. Be mindful of what you post, as your copycat friend could be using your social media to bite your style. Only share things that you wouldn't mind them copying from you, like the books you're reading or movies you're watching. You might also consider limiting their access to your profiles so they can't access your updates."
    },
    {
      "title": "Keep your accomplishments to yourself.",
      "content": "Keep your accomplishments to yourself. If you did something nice for someone, won an award, or were complimented on something, avoid telling your friend. Your friend might take this information and copy something that you did or said so that they can be praised, too. Don't keep all of your successes to yourself, though! Share with your family and friends who don't copy you."
    },
    {
      "title": "Wait it out and act when necessary.",
      "content": "Wait it out and act when necessary. Before you confront your friend about something like this, be patient. They could be going through a phase that will be over soon. Wait until the copying has lasted at least a month before you say anything and determine if confronting them is worth the conflict. For instance, if your friend has a few of the same shirts as you because they liked them, is it really worth confronting them over? If the copying is low level, you might decide instead to just table the issue for now."
    },
    {
      "title": "Assess your own style.",
      "content": "Assess your own style. Are you copying a celebrity with some of the clothes you wear or things you do? Could your friend be doing so, too? Ask yourself these questions before you speak to your friend. You might find that they are not copying you, but someone else instead."
    },
    {
      "title": "Ask for a friend's help.",
      "content": "Ask for a friend's help. Talk to a friend about the concerns you have. See if they have noticed the copying. If not, then you may overthinking things a bit. Ask them to help you to be fair and objective during this process. You might say, “John, I've noticed that Charly sometimes copies my ideas and he has even bought a few of the exact same ties as me. Have you noticed anything? I wanted to check with you before I said something.”"
    },
    {
      "title": "Take a break from the friendship.",
      "content": "Take a break from the friendship. If the copying has become too much for you, step back from your friend for a while. Don't ignore them, but do let them know that you need a bit of space and ask them to respect that. During this time, consider whether this issue is worth losing your friendship over. For instance, perhaps they used your same research topic for a paper, and now your professor thinks you copied them. If they are copying you to the point that they are hurting you academically or professionally, it's probably best to sever ties at least temporarily."
    }
  ]
}