{
  "url": "https://www.wikihow.com/Make-Rice-Milk",
  "title": "How to Make Rice Milk",
  "steps": [
    {
      "title": "Measure the rice and water into a blender.",
      "content": "Measure the rice and water into a blender. Add 4 cups (950 mL) of water and 1 cup (200 grams) of cooked white rice into your blender. For the purest rice milk, use filtered water, as this has very few added chemicals or minerals in it. [1] X Research source Both a food processor or a smoothie maker will work for making rice milk. The more powerful your blender is – the smoother your rice milk will be."
    },
    {
      "title": "Blend the ingredients for 1 minute.",
      "content": "Blend the ingredients for 1 minute. Turn the blender onto the highest setting and wait 1 minute for it to blend the rice and water into a smooth liquid. If the liquid is still a little lumpy after 1 minute, blend it for another minute or until it is smooth. [2] X Research source Avoid using other kitchen appliances while you are using the blender, as the high wattage required can cause a fuse to blow in your multi-box."
    },
    {
      "title": "Store the milk in your fridge and stir it before you drink it.",
      "content": "Store the milk in your fridge and stir it before you drink it. Rice milk tends to taste best cool; however, it can also be enjoyed straight from the blender. If you want cool milk, leave it in the fridge for 30 minutes. Stir the milk vigorously before you drink it to ensure that the water and blended rice are fully combined. [3] X Research source Keep the milk for up to 5 days. [4] X Research source"
    },
    {
      "title": "Add the water, brown rice, and dates into your blender.",
      "content": "Add the water, brown rice, and dates into your blender. Measure 2 cups (470 mL) of water and ½ cup (100 grams) of cooked brown rice into the blender and then add 4 dates. For best results, use a high-speed blender; however, a food processor will also work. [5] X Research source The dates help to give the milk a slightly sweeter taste, if you want a sugar-free milk, simply leave them out."
    },
    {
      "title": "Blend the mixture until it turns into a smooth liquid.",
      "content": "Blend the mixture until it turns into a smooth liquid. Turn the blender on and wait for the rice to disintegrate into the water to form a milky liquid. This normally takes about 2 minutes. The longer that you blend the rice and water – the lighter the consistency of your milk. [6] X Research source"
    },
    {
      "title": "Pour the liquid through a fine sieve to remove any lumps, if desired.",
      "content": "Pour the liquid through a fine sieve to remove any lumps, if desired. The thick texture of brown rice means that sometimes small chunks remain after you have blended it. If you like extra smooth rice milk, simply place a fine sieve over a wide-necked bottle and slowly pour the liquid through the strainer. [7] X Research source Compost the leftover rice chunks or throw them in the trash."
    },
    {
      "title": "Enjoy the rice milk fresh or keep it in the fridge for up to 4 days.",
      "content": "Enjoy the rice milk fresh or keep it in the fridge for up to 4 days. Pour the delicious rice milk into a cup and drink it fresh. If you prefer a cooler taste, place it in the fridge to cool down for half an hour. If you notice the water sitting on the top of the milk after it has been in the fridge, simply stir it to recombine the rice and water. [8] X Research source If the milk starts to smell bad, this indicates that it has gone off and should be thrown away."
    }
  ]
}