{
  "url": "https://www.wikihow.com/Jailbreak-an-iPad-3",
  "title": "How to Jailbreak an iPad 3",
  "steps": [
    {
      "title": "Navigate to the Redsn0w website at http://www.redsn0w.us/2013/10/the-ultimate-jailbreak-wizard.html.",
      "content": "Navigate to the Redsn0w website at http://www.redsn0w.us/2013/10/the-ultimate-jailbreak-wizard.html . This page features a jailbreak wizard that helps you find compatible jailbreak software for your iPad 3."
    },
    {
      "title": "Select “iPad” under iDevice, then select “3” under Model.",
      "content": "Select “iPad” under iDevice, then select “3” under Model."
    },
    {
      "title": "Select the iOS version currently installed on your iPad 3.",
      "content": "Select the iOS version currently installed on your iPad 3. Go to Settings > General > About on your iPad 3 to identify its current iOS version."
    },
    {
      "title": "Select your computer’s operating system under Platform.",
      "content": "Select your computer’s operating system under Platform."
    },
    {
      "title": "Click on “Check your iDevice.",
      "content": "Click on “Check your iDevice. ” The jailbreak wizard will return the name of jailbreak software compatible with your iPad 3. For example, if running iOS 7.1.1 and using a Windows computer, the jailbreak software compatible with your iPad 3 is Pangu version 1.2.1."
    },
    {
      "title": "Navigate to the official website for the jailbreak software compatible with your iPad 3.",
      "content": "Navigate to the official website for the jailbreak software compatible with your iPad 3. Using the example above for an iPad running iOS 7.1.1, you would navigate to Pangu’s site to install Pangu for iOS 7.1 to 7.1.x. Use your favorite search engine to find the official site for the jailbreak software, or refer to Redsn0w’s jailbreak tools downloads page at http://www.redsn0w.us/2010/03/download-direct-links-jailbreak-guides.html ."
    },
    {
      "title": "Select the option to download the jailbreak software to your computer.",
      "content": "Select the option to download the jailbreak software to your computer."
    },
    {
      "title": "Double-click on the installation file and follow the on-screen instructions to install the jailbreak software on your computer.",
      "content": "Double-click on the installation file and follow the on-screen instructions to install the jailbreak software on your computer."
    },
    {
      "title": "Back up your iPad 3",
      "content": "Back up your iPad 3 using iCloud or iTunes on a computer. This prevents data loss in the event your iPad resets during the jailbreaking process."
    },
    {
      "title": "Connect the iPad 3 to your computer using a USB cable.",
      "content": "Connect the iPad 3 to your computer using a USB cable. The jailbreak software will detect your iPad within a few moments."
    },
    {
      "title": "Follow the on-screen instructions displayed in the jailbreak program to jailbreak your iPad 3.",
      "content": "Follow the on-screen instructions displayed in the jailbreak program to jailbreak your iPad 3. The jailbreak program will guide you through the entire process from beginning to end, and your iPad may reboot several times before jailbreaking is complete. [1] X Research source"
    },
    {
      "title": "Disconnect the iPad 3 from your computer when the software informs you jailbreaking is finished.",
      "content": "Disconnect the iPad 3 from your computer when the software informs you jailbreaking is finished. Cydia will now be displayed in your app tray."
    },
    {
      "title": "Launch the Cydia application.",
      "content": "Launch the Cydia application. You can now use Cydia to browse and install apps and tools exclusive to the iOS jailbreak community."
    },
    {
      "title": "Try using another USB cable or USB port on your computer if jailbreaking software fails to detect your device.",
      "content": "Try using another USB cable or USB port on your computer if jailbreaking software fails to detect your device. This helps rule out problems with faulty hardware when your computer is unable to detect your iPad 3."
    },
    {
      "title": "Confirm your iPad 3 is running the latest version of iOS.",
      "content": "Confirm your iPad 3 is running the latest version of iOS . This helps ensure your iPad is up to date and compatible with the latest jailbreak software."
    },
    {
      "title": "Use Redsn0w’s jailbreak wizard to find other compatible jailbreak software if you experience recurring problems with the first software you download.",
      "content": "Use Redsn0w’s jailbreak wizard to find other compatible jailbreak software if you experience recurring problems with the first software you download. Jailbreak tools and software are not supported by Apple, and are not guaranteed to work at all times."
    },
    {
      "title": "Restore your iPad 3 to its original factory settings",
      "content": "Restore your iPad 3 to its original factory settings using iTunes if jailbreaking renders your device inoperable. This removes all traces of jailbreaking from your iPad 3 and reinstates the manufacturer’s warranty with Apple."
    },
    {
      "title": "Delete and reinstall the jailbreak software on your computer to rule out problems with a corrupt install.",
      "content": "Delete and reinstall the jailbreak software on your computer to rule out problems with a corrupt install. In some cases, problems that initiated during installation can prevent jailbreaking from completing successfully."
    },
    {
      "title": "Try using another computer to jailbreak your iPad if you continue running into issues associated with jailbreaking.",
      "content": "Try using another computer to jailbreak your iPad if you continue running into issues associated with jailbreaking. For example, if trying to jailbreak your device using Windows 7, try using a friend’s computer, or a computer running a different operating system, such as Windows 8 or Mac OS X. [2] X Research source"
    }
  ]
}