{
  "url": "https://www.wikihow.com/Get-over-Being-Unfriended-on-Facebook",
  "title": "Unfriended on Facebook? Here's What to Do",
  "steps": [
    {
      "title": "Remind yourself that being unfriended may have nothing to do with you.",
      "content": "Remind yourself that being unfriended may have nothing to do with you. Although being unfriended can be a painful experience, it’s often because of the other person’s perception or hangups and nothing to do with you. Avoid wracking your brain to figure out what you could have done or said to upset the person because there may be nothing at all that led them to do it. [1] X Research source For example, the person may simply have unfriended you because the two of you have not spoken in a few years or because they are jealous of some aspect of your life."
    },
    {
      "title": "Rephrase any negative thoughts",
      "content": "Rephrase any negative thoughts that pop into your head. In the face of rejection, some people resort to self-blame and harsh criticism of themselves. This will do you more harm than good, so try to avoid it. If you do catch yourself speaking negatively to yourself, rephrase the thoughts to something more realistic and positive. [2] X Research source For example, if you start telling yourself something like, “Nobody likes me!” stop and consider whether this is a realistic statement. Then, rephrase the statement to something more realistic like, “I have many friends who like my company because I’m a fun, intelligent person.”"
    },
    {
      "title": "Reach out to friends and family members to discuss what happened.",
      "content": "Reach out to friends and family members to discuss what happened. Talking with a friend or family member about being unfriended may help you to feel less upset about it. Your friend or family member may even share with you about times they were unfriended, which can help you to see that this is a pretty common thing and most people have experienced it. [3] X Research source Try saying something like, “Rebecca just unfriended me on Facebook and I am really sad about it. We didn’t talk much, but I always considered her a good friend.” Or, you might say something like, “I just found out Derek unfriended me and I am so confused. Can we talk about it?”"
    },
    {
      "title": "Acknowledge that you’re hurt by being unfriended.",
      "content": "Acknowledge that you’re hurt by being unfriended. Ignoring your feelings won’t help you to get over being unfriended. Before you can feel better, allow yourself to feel whatever you’re feeling about what happened. Embrace any feelings of sadness, anger, or confusion that arise. [4] X Research source For example, allow yourself to cry, punch a pillow, or puzzle over the situation for a while. Just avoid taking out your feelings on other people or doing anything that might hurt you, such as binge drinking or self-harming."
    },
    {
      "title": "Limit how long you focus on negative feelings.",
      "content": "Limit how long you focus on negative feelings. Be careful not to dwell on feelings of anger and sadness for too long or you may end up getting stuck in a negative thought pattern. Try giving yourself a set time frame to express your emotions and then distract yourself with something else when your time is up. [5] X Research source For example, you might allow yourself to cry and feel sad about being unfriended for 1 hour, and then put on your favorite comedy movie or play a video game to take your mind off of it."
    },
    {
      "title": "Make a list of all the positive traits you possess.",
      "content": "Make a list of all the positive traits you possess. After being rejected by someone on Facebook, you might benefit from a reminder of what makes you so great. Take a few minutes to list all of your positive traits and read over the list. Include things that you like about yourself and that other people have complimented you on. [6] X Research source For example, you might include in the list that you are friendly, kind, funny, smart, pretty, artistic, or something else!"
    },
    {
      "title": "List all the traits you did not like about the person who unfriended you.",
      "content": "List all the traits you did not like about the person who unfriended you. Although it’s not a good idea to dwell on feelings of anger about what happened, you might feel better about what happened if you remind yourself that the person who unfriended you was not perfect. Include in the list any traits that you disliked about them, even if you didn’t know them very well. [7] X Research source For example, you might list things like pettiness, short temper, annoying laugh, boring, no sense of humor, or bad listener. :"
    },
    {
      "title": "Identify traits that you value in your friends.",
      "content": "Identify traits that you value in your friends. Following a rejection is a great time to think about what you value most in your friends. Write down these traits and keep it for reference. This way, you can use the list to help you find people you click with moving forward. [8] X Research source For example, you might decide that you value loyalty, kindness, acceptance, and generosity in your friends above all else."
    },
    {
      "title": "Consider what you might learn from this situation.",
      "content": "Consider what you might learn from this situation. Even though it might be hard to see any positives from losing a Facebook friend, there are ways that you can benefit from it. Reflect on the situation and decide what you want to take away from it. [9] X Research source For example, you might use the experience to remind yourself of who your real friends are and be grateful for them. Or, you might consider the experience a good indicator that social media is playing too much of a role in your life."
    },
    {
      "title": "Evaluate your social media behavior to see what you can improve.",
      "content": "Evaluate your social media behavior to see what you can improve. If you tend to use social media as a soapbox for your political views, personal problems, or other issues, this can bother some people and even cause them to unfriend you in some cases. If you think this might have been the reason why someone unfriended you and that bothers you, consider scaling back on these kinds of posts. [10] X Research source For example, instead of posting about your political beliefs on social media, try discussing your views in a political forum or in a closed Facebook group for politics. This will allow you to continue engaging in politics through social media without rubbing any of your friends the wrong way."
    },
    {
      "title": "Find positive ways of interacting with people on social media.",
      "content": "Find positive ways of interacting with people on social media. Some people might unfriend people because they never interact with them. If you are upset by someone unfriending you, you might make a point of liking and leaving positive comments on other people’s posts more often. [11] X Research source For example, if a friend from high school posts a picture of their new haircut, like their picture and give them a compliment. Or, if someone posts an article that they think is interesting, give it a quick read and comment on what you think is interesting about it."
    },
    {
      "title": "Take a break from social media",
      "content": "Take a break from social media if it’s upsetting you. It’s normal to get carried away with social media use sometimes, but using social media too much or relying on it too heavily for socialization can be harmful to your mental health. If you notice that you’re socializing more on social media than in person, you might want to take a break from social media. [12] X Research source Try posting something on your social media feeds so it will be official and you won’t be tempted to check them all the time. Try writing something like, “Taking a month off social media to focus on other things! Send me a text or an email if you want to talk or hang out. Thanks!” You don’t absolutely have to post about your social media hiatus, but it can help to ensure that you’ll stick with it."
    }
  ]
}