{
  "url": "https://www.wikihow.com/Make-Your-Phone-Look-Aesthetic",
  "title": "How to Make Your Phone Look Aesthetic",
  "steps": [
    {
      "title": "Get a phone case.",
      "content": "Get a phone case. A case can add some spice to the exterior of your phone. It's also a great way to protect it from possible damage. There are so many cases out there, so browse online to pick the best option for you. Do you want something a bit more practical? Maybe try out a phone case that’s extra durable, or one that has a built-in charger. Or, do you want something more based on look? Search through the plethora of colors, patterns, and styles to best fit your aesthetic! Be sure to specify the model and type of your phone when searching for cases."
    },
    {
      "title": "Get a PopSocket.",
      "content": "Get a PopSocket. These plastic circles stick to the back of your phone and act as a handy grip and stand. They also come in many different colors and designs. Maybe you coordinate your phone case and PopSocket to match. [1] X Research source"
    },
    {
      "title": "Get a phone charm.",
      "content": "Get a phone charm. That’s right, phone charms from the early 2000s are making a comeback. These beaded strings can attach to your phone case as a fun accessory."
    },
    {
      "title": "Add some stickers.",
      "content": "Add some stickers. Stickers can be a great way to personalize the back of your phone! Simply gather some small stickers that you like and put them on your phone case."
    },
    {
      "title": "Choose your wallpaper.",
      "content": "Choose your wallpaper. Wallpapers are a great way to personalize your phone. You can set both your lock screen and your home screen, so pick two images if you want these to be different. Your lock screen is the page you see before unlocking your phone, and your home screen is what you see after. We recommend searching through your camera roll, Pinterest, or the internet to find images you want."
    },
    {
      "title": "Save the images.",
      "content": "Save the images. Once you have found your image(s), be sure to save them to your camera roll (that is, if they are not already there). Do so by taking a screenshot or by downloading the image(s) to your camera roll."
    },
    {
      "title": "Set your wallpaper on an Android.",
      "content": "Set your wallpaper on an Android. Go to settings, “Display,” and then “Wallpaper.” Tap “Gallery” and select the image from your camera roll that you want. Now tap on one of the three options: “Home screen,” “Lock screen,” “Home screen and lock screen.” [2] X Research source Simply repeat this step using a different photo if you want to set separate images for your home and lock screen. There are also wallpapers preloaded on your device. To use these instead, tap the other option(s) instead of “Gallery.” This label varies based on Android model, but it may appear as “Live Wallpapers,” “My Wallpapers,” or “Styles & Wallpapers.”"
    },
    {
      "title": "Set your wallpaper on an iPhone.",
      "content": "Set your wallpaper on an iPhone. Go to settings, “Wallpaper,” and then “Choose a New Wallpaper.” Tap on one of the camera roll categories (pick “All Photos” to view your entire camera roll) and tap on an image. Tap on “Set” in the bottom right corner and select one of the three options “Set Lock Screen,” “Set Home Screen,” “Set Both.” [3] X Research source Repeat this step if you want to set separate images for the home and lock screen. To choose a wallpaper preloaded on the device, tap “Dynamic” or “Stills” and select one of the options."
    },
    {
      "title": "Create folders on an iPhone.",
      "content": "Create folders on an iPhone. Placing your apps in folders can be a great way to declutter and organize your home screen. Long-tap an app icon until it begins to wiggle. Then, drag it over another app and release your finger - you will now see a folder with those two apps inside. Now you can tap, hold, and drag any other apps into the folder. [4] X Research source"
    },
    {
      "title": "Create folders on an Android.",
      "content": "Create folders on an Android. First navigate to your app drawer. Long-tap an app and drag it onto the home screen. Go back to your app drawer, then tap, hold, and drag another app onto the one you just added. Once you release it you will see a folder on your homescreen with those two apps! [5] X Research source Some Androids may not let you create folders by simply dragging apps. If this is the case for you, tap, hold, and drag an app to the “Create Folder” icon in the top left corner. Release your finger and type in a name for the folder. Press “Done” or the enter arrow in the bottom right corner to make the folder!"
    },
    {
      "title": "Rename app folders.",
      "content": "Rename app folders. Perhaps you choose to make folders based on type of app or even by app icon color. You can use folder names to make these distinctions. On an iPhone, long-tap the folder icon, go to “Rename,” type out a new name, and tap “Done” in the bottom right corner. [6] X Research source On an Android, tap on the folder then tap on its title. Type in a new title and press “Done” or the enter arrow in the bottom right corner. [7] X Research source"
    },
    {
      "title": "Organize your apps by color.",
      "content": "Organize your apps by color. Do you want to take your home screen to a whole new level of visual appeal? Consider moving your apps around so they’re in rainbow order (or really whatever color organization you want!). To do so, long-tap an app, drag it to a new place on your home screen, and release. Do this with all your apps until they are arranged how you want. Once you’re finished rearranging on an iPhone, tap “Done” in the top right corner. On an Android, you may have to open your app drawer to access apps that are not on your home screen. [8] X Research source"
    }
  ]
}