{
  "url": "https://www.wikihow.com/Hang-Shelves-Without-Nails",
  "title": "How to Hang Shelves Without Nails: Using Adhesives & Other Methods",
  "steps": [
    {
      "title": "Get a shelf made of a light, hollow material.",
      "content": "Get a shelf made of a light, hollow material. Unfortunately, fasteners like nails are necessary to hang up extremely heavy shelves made of dense, solid materials like steel or oak. However, you can use adhesive fasteners to hang up light, hollow shelves made of things like balsa wood. As a general rule, try to hang shelves that weigh 3 lb (1.4 kg) or less. For safety, do not attempt to hang shelves with adhesive strips if they weigh over 10 lb (4.5 kg). Look for hollow floating shelves at furniture stores or light planks of wood at hardware stores. Home improvement specialist Ryan Tuttle says to never hang anything with nails unless it’s a picture. [1] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 13 January 2021."
    },
    {
      "title": "Purchase adhesive mounting strips.",
      "content": "Purchase adhesive mounting strips. To hang up your shelf, you’ll need to get strong adhesive mounting strips designed for pictures or other large objects. Before buying a set of strips, check their weight capacity to make sure they can support your shelf and any objects you want to put on it. [2] X Research source Purchase adhesive strips that have a sticky material on 1 side and a rough, hook-and-loop fastener-like gripping material on the other. Be aware that this is not the same type of material used for things like Command hooks. Popular adhesive strips include Command picture hanging strips , Scotch reclosable fasteners, and hook-and-loop fastener removable mounting strips . You can buy these products from most craft and office supply stores. For extremely small or light shelves, a moldable adhesive glue like Sugru may also work. Make sure the shelf and the objects you put on it weigh less than the weight capacity of your adhesive strip. Going over the weight capacity can cause the shelf to fall and damage the surrounding area."
    },
    {
      "title": "Clean your shelf and wall with |isopropyl alcohol.",
      "content": "Clean your shelf and wall with |isopropyl alcohol. To clean using isopropyl alcohol , start by dampening a fresh cleaning cloth with isopropyl alcohol. Then, gently rub the cloth against your wall and the mounting side of your shelf. Give the surfaces around 5 minutes to dry before attaching your adhesive strips. [3] X Research source Doing this will help remove grease, oil, and wax from the surfaces, making the adhesive strips easier to mount. According to handyman Jason Phillip, one of the most common mistakes people make when using adhesive strips is using them in the bathroom. Since bathrooms are humid, command strips are more likely to fall off. [4] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. Look for isopropyl alcohol at big-box and drug stores."
    },
    {
      "title": "Stick your strips to the shelf by pressing them down for 30 seconds.",
      "content": "Stick your strips to the shelf by pressing them down for 30 seconds. If they’re not already attached, press the hook-and-loop fastener-style fastening sides of 2 of your mounting strips together. Then, remove the protective liner from 1 of the strips, press the newly-exposed adhesive side to your shelf’s mounting area, and hold the connected strips down for about 30 seconds. Repeat this process with the rest of the strips. [5] X Research source Space your strips out evenly to give your shelf the greatest amount of hanging strength possible. Use staples to attach your strips to shelves made of wood."
    },
    {
      "title": "Hold your shelf to the wall for 30 seconds.",
      "content": "Hold your shelf to the wall for 30 seconds. Once you’ve attached the adhesive strips, remove the remaining strip liners and position your shelf along the wall. Then, press your shelf against the wall for 30 seconds to fix it in place. [6] X Research source If possible, attach adhesive strips to 2 adjacent sides of the shelf and hang it in a corner. This will give your shelf a greater amount of support."
    },
    {
      "title": "Remove your shelf and press each strip down for 30 seconds.",
      "content": "Remove your shelf and press each strip down for 30 seconds. Using slow, careful motions, pull on the edges of your shelf to peel it away from the wall. Each pair of strips should separate so that 1 side is attached to the wall and the other side is attached to the shelf. Then, push down on each individual adhesive strip for 30 seconds to make sure they adhere completely. [7] X Research source If any of the strips come off, fix a new strip to your shelf and repeat the attachment and removal process."
    },
    {
      "title": "Replace your shelf after 1 hour.",
      "content": "Replace your shelf after 1 hour. Give your adhesive strips approximately 1 hour to set and solidify. Then, reattach your shelf by connecting the sets of adhesive strips together. As you let go of your shelf, watch it carefully to make sure it doesn’t fall down. [8] X Research source Phillip says another common mistake is forgetting to push the adhesive strip all the way into the wall. [9] X Expert Source Jason Phillip Handyman Expert Interview. 2 July 2020. Consider placing blankets or pillows below your shelf to catch it if it falls."
    },
    {
      "title": "Place light, durable objects on your shelf.",
      "content": "Place light, durable objects on your shelf. Without firm fasteners like nails, your shelf probably won’t be able to support heavy objects like textbooks or appliances. However, it should be able to hold small trinkets, light-weight electronics, and similar items. [10] X Research source Do not place glass objects or other fragile items on the shelf in case it falls down. If your shelf juts out from the wall by more than 4 or 5 in (10 or 13 cm), place your objects near the back of the shelf to avoid ripping it away from the adhesive strips."
    },
    {
      "title": "Buy adhesive fixtures to hold up light objects.",
      "content": "Buy adhesive fixtures to hold up light objects. Before putting up a shelf to hold light objects like clothing, jewelry, and small electronics, consider buying an adhesive fixture instead. The most common types of adhesive fixtures are hooks and hangers, which you can find at most big-box stores. However, you can purchase a number of more unique fixtures online, including: Adhesive rails, which are great for holding items like keys. Adhesive caddies, which can hold things like phones, kitchen spices, and bathroom supplies. Adhesive display ledges, which are perfect for showing off light knick-knacks and collectibles."
    },
    {
      "title": "Place adhesive strips on objects to stick them directly to the wall.",
      "content": "Place adhesive strips on objects to stick them directly to the wall. Instead of hanging a shelf up to display a photo, painting, or other relatively flat object, consider attaching the object directly to your wall using adhesive strips. To apply the strips, rub the back of your object with isopropyl alcohol and give the surface about 5 minutes to dry. Then, adhere your strips to the corners of the object and fix the item to the wall just like you would a shelf. Before attaching adhesive strips to a picture frame, make sure to remove the object’s current hanging hardware. Check an adhesive strip set’s load capacity before buying it to make sure the strips can hold up your painting."
    },
    {
      "title": "Purchase a free-standing shelf for more space and support.",
      "content": "Purchase a free-standing shelf for more space and support. Sometimes, an adhesive-mounted shelf will simply not provide the load strength or storage space you need. In these cases, home improvement and DIY specialist Emily Fazio says to consider buying a free-standing shelving system like a bookshelf. [11] X Expert Source Emily Fazio Home Improvement & DIY Specialist Expert Interview. 27 July 2021. [12] X Research source You can find free-standing shelves at most big-box and furniture supply stores. To set up a free-standing shelf , follow the assembly instructions included with your purchase."
    }
  ]
}