{
  "url": "https://www.wikihow.com/Grow-Dreadlocks-Free-Form-or-Twist-%26-Rip",
  "title": "How to Grow Dreadlocks Free Form or Twist & Rip",
  "steps": [
    {
      "title": "Stop brushing or combing your hair.",
      "content": "Stop brushing or combing your hair. Your hair will form knots and start to cling together. Your hair will naturally start to separate into sections within a few days and will form distinctive sections within a couple of weeks. Be patient. This stage can be short or take longer, depending on what your hair's natural texture is. The coarser your hair is, the faster dreads will form. If you have very straight hair, as with most Asian hair textures and some Caucasian hair textures, you may need to help dreads form by backcombing, adding wax , or crocheting dreads."
    },
    {
      "title": "Wash your hair 1-2 times a week.",
      "content": "Wash your hair 1-2 times a week. Clean hair dreads best, but washing your hair too often can prevent it from dreading. At most, wash your hair every 2 days. After about a year into the dreading process, you will only need to wash once a week. Try looking for a dread-friendly shampoo. These shampoos leave less residue and help your hair knot."
    },
    {
      "title": "Keep your hair dry.",
      "content": "Keep your hair dry. If you have greasy or oily hair, it won't be able to knot and form dreads. Dry your hair after showering with a microfiber towel by squeezing out extra moisture and then wrapping your dreads. You can also use a hairdryer on a cool setting to speed up the process. [1] X Research source If you have naturally greasy hair, you may need to wash it more often to keep your hair as dry as possible. Blow dryers can damage your dreads. It is best to air dry them, but you can use a blow dryer on cool, constantly moving it around between sections."
    },
    {
      "title": "Separate any dreads that are trying to join together into a larger dread.",
      "content": "Separate any dreads that are trying to join together into a larger dread. Do this by holding both sections and slowly pulling them apart up starting from the bottom and going up toward the scalp. Or, to separate 2 dreads more permanently, run your finger along the scalp along a section line, then hook your finger underneath the hair where it is crossing over into another section. Pull from the scalp away from the head. [2] X Research source Any section larger than 1 inch (2.5 cm) around will produce 'Congos' or 'fat dreads'. The area of the section where your hair meets the scalp will be the thickness of your mature dreadlocks."
    },
    {
      "title": "Wait up to 2 years for mature dreads to form.",
      "content": "Wait up to 2 years for mature dreads to form. Short hair around 4 to 6 inches (10 to 15 cm) can take as little as a year to lock up, while hair longer than shoulder length can take 2 years or more. Mature dreadlocks are tightly knotted and you can't pull them apart with your fingers. You will also notice that they don't change in shape or appearance anymore. You will need patience, but the end result will be the healthiest dreadlocks possible. There are no definite timelines for how long hair takes to lock. Everyone's hair is different and will mature at its own rate. Longer hair usually takes more time to mature, because it needs to shrink and kink more for dreads to lock up. Coarse and curly hair locks quicker than fine, straight hair."
    },
    {
      "title": "Section your hair based on the size and number of dreadlocks you want.",
      "content": "Section your hair based on the size and number of dreadlocks you want. Sit in front of a large mirror and split your hair into sections that are as wide as you want your dreadlocks. Tie off each section with a small hair tie or elastic band. [3] X Research source This takes time and can give you sore arms, so if you have somebody to help you it will be a little easier. You can do this over a matter of days if necessary, so don't feel compelled to rush yourself. The twist and rip method works for all hair types, but your hair needs to be at least 5 inches (13 cm) long."
    },
    {
      "title": "Separate 1 section in half and twist the pieces 3-4 times.",
      "content": "Separate 1 section in half and twist the pieces 3-4 times. Divide 1 section in half and twist the pieces around each other a few times. Keep each half separated. Start at the top of your head, so that when you complete a section you can pin it out of the way and begin on the next one. [4] X Research source You can use a hairclip or other tool to keep other sections out of the way as you work on 1 area."
    },
    {
      "title": "Pull the 2 pieces away from each other.",
      "content": "Pull the 2 pieces away from each other. This is called 'ripping' and creates knots where the hair has been twisted. Pull the section 3-4 times for each twist. [5] X Research source Leave about 1 inch (2.5 cm) of untouched hair at the scalp. For straight-textured hair, you may have to rip more for each twist. Rip until you notice knots forming."
    },
    {
      "title": "Repeat the twisting and ripping for the entire length of the section.",
      "content": "Repeat the twisting and ripping for the entire length of the section. To avoid getting a braided look, don't always divide the section perfectly in half. The friction from ripping will start to form knots that will become dreads. [6] X Research source Don't twist too tightly, as this can break your hair."
    },
    {
      "title": "Hold each completed section in place with small elastic bands.",
      "content": "Hold each completed section in place with small elastic bands. When you finish the length of your section, secure the ends with an elastic band. This will help keep your dreads separate as they form. [7] X Research source A good alternative to elastic bands is embroidery thread or yarn, which allows the strands of hair to move more freely. Wrap the thread around your dreads from the roots to the ends and tie it in a knot at the end. [8] X Research source Avoid rubber bands, as they pull out hairs and can melt into the hair. Only use elastic bands at the bottom of each section, never by the roots. Using elastic at your roots can damage the strands and cause the dreads to break or get heavier."
    },
    {
      "title": "Complete this process over your entire head.",
      "content": "Complete this process over your entire head. Repeat the process for each section of hair you created. Take your time and twist and rip over the course of a couple of days, if you need to."
    },
    {
      "title": "Wash your hair every 2-3 days.",
      "content": "Wash your hair every 2-3 days. About 2 days after you've twisted and ripped, wash your hair using dread shampoo. Continue washing your hair every 2-3 days until your dreads are mature. After your dreads are mature, wash them only once a week. You will know your dreads are mature when the texture is tight, you can't pull the locks apart with your fingers, and they aren't changing in size or shape anymore. [9] X Research source If you have hard water, look for a dread shampoo specifically made to work with hard water. If you have soft water, you can use any dread shampoo."
    },
    {
      "title": "Remove the elastic bands after a week.",
      "content": "Remove the elastic bands after a week. If possible, take the elastic bands out of your hair after the first wash. Removing the elastic bands allows your hair to move and naturally lock. [10] X Research source"
    },
    {
      "title": "Separate 2 dreads if they start to join together.",
      "content": "Separate 2 dreads if they start to join together. To separate dreads, hook your finger into the roots where you want the dreads to separate and gently pull away from your head. Most areas will only need separating done once a week, and for some, it is only every 2 weeks. The area that joins together the most is on the part of the head that you sleep on. If you have a hard time separating your dreads from the roots, try pulling them apart from the ends."
    },
    {
      "title": "Expect the maturing process to take a few months to 2 years.",
      "content": "Expect the maturing process to take a few months to 2 years. The maturing process is the shrinking and looping of the hair. Be patient. Every head of hair is different, so the process may take longer or shorter. Generally, coarse and curly hair locks up fastest, while straight and fine hair takes the longest. You can tell that your dreads are mature when they don't change in size and shape anymore and they are very tightly knotted. Don't worry about loose roots. They can be up to 3 inches (7.6 cm) loose in the beginning and once mature they will be about 1 inch (2.5 cm) loose. Your hair will frizz around the 3-month mark. While your dreads mature, they may take on lots of different shapes and may look very messy at some points. Don't worry, as this will pass."
    }
  ]
}