{
  "url": "https://www.wikihow.com/Help-Protect-Giant-Pandas",
  "title": "How to Help Protect Giant Pandas",
  "steps": [
    {
      "title": "Donate to a conservation organization.",
      "content": "Donate to a conservation organization. The most immediate way to help giant pandas is by giving a gift to a protective organization like the World Wildlife Fund (WWF) or Pandas International. Use the donation button on these websites to send your gift. Your money goes to causes such as installing cameras and training rangers that protect panda habitats from poachers. [1] X Research source You usually can donate any amount of money you want, as well as choose to make it an automatically-recurring monthly donation. Visit the World Wildlife Fund for Nature’s website at http://wwf.panda.org/ . Pandas International’s website is located at https://www.pandasinternational.org/ . [2] X Research source"
    },
    {
      "title": "Sponsor or “adopt” a panda.",
      "content": "Sponsor or “adopt” a panda. Various organizations offer these programs. You get gifts for paying a certain amount of money, such as $50 USD, to sponsor a panda. The gifts often include an “adoption” certificate and a panda plushie, so this can be a good option if you have young children. [3] X Research source The WWF, Pandas International, and most zoos offer adoption programs."
    },
    {
      "title": "Buy panda-related merchandise from conservation organizations.",
      "content": "Buy panda-related merchandise from conservation organizations. Organizations like the WWF, Pandas International, and zoos sell panda gifts and gear. You can buy stickers, calendars, mugs, and other items. The proceeds help the organizations fund their operations. [4] X Research source Merchandise can be given as a gift. It can also be a good way to publicly show your support for pandas."
    },
    {
      "title": "Purchase carbon offsets",
      "content": "Purchase carbon offsets to protect the environment. Climate change is a big threat to panda habitats, so purchasing Gold Standard carbon credits helps. By purchasing credits, you invest in sustainable energy projects such as efficient stoves in China. These stoves, for example, require less bamboo to operate and give off fewer carbon emissions. You can purchase credits at https://www.goldstandard.org/ . Any Gold Standard project helps, even if it doesn’t appear to be directly related to panda protection."
    },
    {
      "title": "Volunteer at a panda reserve in China.",
      "content": "Volunteer at a panda reserve in China. Set up a volunteer opportunity by contacting a conservation organization or a panda center. You will need to make your way to China, covering your own travel expenses. Then, you will be trained to help feed and clean up after the pandas. Volunteer work is a physically-demanding yet rewarding opportunity to protect pandas. [5] X Research source Contact conservation organizations and panda preserves for more information. [6] X Research source"
    },
    {
      "title": "Tell others about protecting giant pandas.",
      "content": "Tell others about protecting giant pandas. Spread the word about panda preservation. Talking about pandas and the environment can encourage others to join in the conservation effort. They can always reduce their conservation efforts, donate, or recycle. Raise awareness whenever you see a chance to do so. [7] X Research source For example, you can say, “Did you know that conservation efforts have raised giant pandas from an endangered species to a vulnerable one?” You might tell someone, “I know a trustworthy charity you can donate to, and you get a cute panda plushie for sponsoring a panda.”"
    },
    {
      "title": "Share conservation news on social media.",
      "content": "Share conservation news on social media. Post any news articles or updates relating to giant pandas. Promote conservation organizations to show that their hard work makes a difference. By spreading the word, you can inspire others and inform them on ways they can contribute to the cause. For example, you might write a status update saying, “The WWF recently released a new documentary proving how conservation has saved pandas.”"
    },
    {
      "title": "Teach others how to conserve resources.",
      "content": "Teach others how to conserve resources. Conserving resources is important and helps pandas even if you aren’t in China. If someone can’t donate or volunteer, they can use less water, recycle paper, or drive less. Even small actions have a positive effect on the world’s overall health, which can help reduce climate change and the damage to panda habitats. [8] X Research source For example, tell someone, “Did you know your phone charger continually uses electricity while its plugged in?” You might say, “Leaving the faucet on while brushing your teeth wastes 5 US gal (19 L) of water a day.”"
    },
    {
      "title": "Travel in vehicles less often.",
      "content": "Travel in vehicles less often. Traveling is a main cause of the carbon emissions responsible for climate change. If you can, walk or ride a bicycle to your destination. Some meetings or appointments can be handled through video conferencing so you don’t need to leave home. [9] X Research source If you have to travel by car, utilize public transportation or carpool with others. When traveling long distances, choose more efficient, higher-capacity trains and airplanes."
    },
    {
      "title": "Conserve wood and other resources as much as possible.",
      "content": "Conserve wood and other resources as much as possible. Trees are an important part of reducing carbon emissions in the atmosphere, which affects panda habitats. Trees are often cut down illegally near panda habitats, causing further damage. Saving energy has a big role in protecting the environment and allowing pandas to live in their natural environment. [10] X Research source If you save wood, less trees need to be cut down and manufactured into products, which helps preserve environments and reduce carbon emissions in the atmosphere. Avoid wasting wood products. For example, use both sides of a sheet of paper. Look for wood and paper products that is labeled as “eco-friendly” or “FSC.” Also turn off the water and electrical devices when they are not in use to avoid wasting energy."
    },
    {
      "title": "Recycle wood, plastic, and other resources.",
      "content": "Recycle wood, plastic, and other resources. Contact your local government or waste disposal service to enroll in a recycling program. Wood, plastic, and aluminum cans are a few products that are often recycled. Recycling minimizes resource usage and carbon emissions. [11] X Research source Also save natural resources such as water. For example, collect unused water and use it to water your plants."
    },
    {
      "title": "Choose recreational activities that are safe for the environment.",
      "content": "Choose recreational activities that are safe for the environment. Whether you’re home or on vacation, respect nature. Some activities use lots of resources or release lots of carbon emissions. Stay away from these activities as much as possible. [12] X Research source For example, golf courses use a lot of water every day. If you golf, choose courses that recycle water. Autosports release lots of carbon into the atmosphere and should be avoided. Be responsible when outdoors, such as by picking up trash and not wasting food, water, and other resources."
    },
    {
      "title": "Avoid souvenirs that are made from animal products.",
      "content": "Avoid souvenirs that are made from animal products. Be aware of what your souvenirs are made of. Even buying non-panda material such as leather and ivory encourages poaching that threatens the panda population. Make sure your products are labeled and sourced legally. Discuss this with the seller if you’re unsure. [13] X Research source Although pandas are a protected species, poachers still harm them when hunting for other animals. Protect them by refusing all animal products. Many animal-based souvenirs are illegal to own. Panda paws, fur, or meat, for example, will get you in a lot of trouble."
    }
  ]
}