{
  "url": "https://www.wikihow.com/Improve-Your-Breathing",
  "title": "How to Improve Your Breathing",
  "steps": [
    {
      "title": "Breathe through your nose.",
      "content": "Breathe through your nose. Although most of us are able to breathe through our mouths, you should always favor breathing in through your nose. Your nose is specifically designed for the intake of air and will help filter out particles and dust. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source [2] X Expert Source Monica Kieu, DO, FACS Board Certified Otolaryngologist Expert Interview. 20 October 2020. Your nose has thin hairs and mucous that will help keep the air entering your lungs clean. Breathing in through your mouth may cause your mouth and throat to dry out. Your nose produces a gas called nitric oxide that enhances your immune system [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source and may even increase the oxygenation of your blood. [4] X Research source"
    },
    {
      "title": "Take deep breaths.",
      "content": "Take deep breaths. Either due to bad breathing habits or from being under stress, many people take quick and shallow breaths. Breathing provides vital oxygen to the body, and these short breaths don't carry as much oxygen as deeper and slower breathing will. [5] X Expert Source Francisco Gomez Competitive Runner Expert Interview. 24 October 2019. Inhale through your nose. Imagine you are filling your belly up with air. At the start of the breath, your stomach should rise first, before your chest. When your stomach is “full” continue the inhalation, allowing the chest to rise now. Take your time breathing in. A good breath should last around five seconds on the inhalation."
    },
    {
      "title": "Exhale properly.",
      "content": "Exhale properly. Just as with inhaling, exhalations of the breath should be done slowly. Exhaling too quickly lessens the time that our lungs can intake oxygen and remove carbon dioxide. Exhale through your mouth. You can try pursing your lips to slow the exhalation. [6] X Research source Let the lungs push the air out at their own pace. Try not to force air out of your lungs. Start the exhalation at the stomach level, letting your diaphragm relax first. Your chest should fall with or after your stomach does. Don't rush the exhalation. Just like with the inhalation, you should take a few seconds to exhale."
    },
    {
      "title": "Keep a good rhythm when running.",
      "content": "Keep a good rhythm when running. If you are a jogger, you can improve your runs by employing better breathing techniques. The main technique involves breathing in a certain rhythm and deeply inhaling and exhaling. [7] X Expert Source Francisco Gomez Competitive Runner Expert Interview. 24 October 2019. Try to keep your breathing ratio around 3:2, in relation to your steps. For three steps, inhale deeply. For the next two steps, exhale as fully as you can. You may need to change the ratio as you increase the intensity of your run. Always keep the inhalation longer than the exhalation as you make your adjustments. Shorter breaths mean less oxygen and greater amounts of carbon dioxide in your body. This results in your heart working harder than it has to and a decrease in athletic performance."
    },
    {
      "title": "Breathe correctly when strength training.",
      "content": "Breathe correctly when strength training. Weight lifting or body weight exercises can be a great way to build strength and add muscle. Breathing properly during these activities can increase the amount of exercise you are able to do. Remember the following tips during your strength training routines: [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When you are exerting yourself, exhale. For example, when lifting a weight, let yourself exhale fully. Inhale when relaxing the movement. For instance, when lowering the weight back down, take a deep breath. Your breathing should correspond to the lifting and lowering of whatever weight you are lifting. Properly breathing during strength training prevents injury and increases performance."
    },
    {
      "title": "Use your natural breath during stretching.",
      "content": "Use your natural breath during stretching. Breathing during your stretching sessions, after or before a workout, most closely resembles the way in which you normally breathe. Relaxed and full inhalations and exhalations are the key. [9] X Research source Inhale through your nose. Your nose is specially designed to filter incoming air. Some experts believe that it's best to exhale through your nose as well. Get a deeper breath by inhaling with your diaphragm as opposed to your chest. Never force your breath, either on the inhalation or exhalation. Try getting a deeper stretch as you exhale, relaxing into the motion."
    },
    {
      "title": "Exercise to improve breathing.",
      "content": "Exercise to improve breathing. By getting proper exercise you will increase the quality and efficiency of your breathing. The main cause of this is that by improving the health and strength of your muscles, they will function better, requiring less oxygen. [10] X Research source If you are new to exercise, or have a condition such as COPD, try starting out with light workouts. Aim for increasing the length of time that you exercise rather than increasing the intensity of exercise. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "If you have a gas stove, ensure it is properly adjusted.",
      "content": "If you have a gas stove, ensure it is properly adjusted. Gas stoves can introduce air pollution into the home even when it is switched off. [13] X Research source"
    },
    {
      "title": "Monitor moisture levels in your house.",
      "content": "Monitor moisture levels in your house. Too much moisture or high humidity can promote the growth of molds and mildew. Mold and mildew can be harmful to the respiratory system and may cause respiratory problems. Devices to measure humidity are widely available at any home improvement or household stores. Purchase and use a dehumidifier if your humidity levels are too high. Remember to regularly empty the water it collects from your house."
    },
    {
      "title": "Avoid smoking.",
      "content": "Avoid smoking. Smoking indoors will immediately introduce harmful chemicals into the air. These won't simply vanish with the smoke but will instead cling to many surfaces in the room. If you must smoke, do it outside. [14] X Research source Smoking anywhere will harm your lungs and make breathing less efficient. Incense or other scented combustibles also release smoke and reduce the air quality in your home."
    },
    {
      "title": "Reduce dust in your home",
      "content": "Reduce dust in your home . Removing dust regularly can help reduce the pollutants it contains. While removing dust, ensure your home is well-ventilated to reduce your exposure to these pollutants."
    },
    {
      "title": "Make sure your house is properly ventilated.",
      "content": "Make sure your house is properly ventilated. Stagnant air can be harmful to breathe as it may have accumulated allergens, microbes, high concentrations of carbon dioxide or other irritants. Create airflow in your house to let fresh air enter your space and allow stale air an exit. [15] X Research source Opening a few windows is the easiest way to create airflow in your house. You may also try to place a fan, either pulling air in or pushing air out, to help increase airflow. Older air conditioners and HVAC systems do not introduce outdoor air to the home, which can mean that pollutants are recirculated. Therefore, ventilation is important, particularly when cooking or painting. [16] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Newer HVAC systems may be installed in your home to greatly improve air quality."
    },
    {
      "title": "Get some house plants.",
      "content": "Get some house plants. House plants are a great and easy way to improve the quality of air in your house. Plants absorb many chemicals in the air that humans cannot breathe, such as carbon dioxide, and release oxygen that we need. Note, though, that houseplants must not be overwatered to prevent mold growth . Some plants are more efficient at removing chemicals than others, review the list and pick your favorites: [17] X Research source Aloe vera. Spider plants. English ivy. Azaleas."
    }
  ]
}