{
  "url": "https://www.wikihow.com/Import-SIM-Contacts-on-an-iPhone",
  "title": "Transfer Contacts from Your SIM Card to Your iPhone",
  "steps": [
    {
      "title": "Some SIM cards support storing contacts.",
      "content": "Some SIM cards support storing contacts. A SIM card is a tiny chip that stores the data you need for your phone to work with your cellular network. Your phone’s SIM card holds information like your phone number, user identity information, and mobile network authorization data. However, some SIM cards can also carry additional data, like saved contacts or even text messages."
    },
    {
      "title": "You can move stored contacts from your old SIM to your iPhone.",
      "content": "You can move stored contacts from your old SIM to your iPhone. If you’re switching to a new phone, downloading your old contacts from your SIM can make the process a little quicker and easier. Not all SIM cards work with all devices, so this will only work if you have a SIM that both supports stored contacts and will fit in your iPhone. Some iPhones don’t support a physical SIM card at all. If you don’t have a SIM card that supports storing contacts, or if your SIM card isn’t compatible with your new phone, there are several alternative ways to transfer your contacts to iPhone ."
    },
    {
      "title": "Make sure your old SIM card contains your contacts.",
      "content": "Make sure your old SIM card contains your contacts. Check your SIM storage or device manufacturer’s documentation to see if it supports SIM storage. iPhones do not store contacts on a SIM card and can only pull contacts from the SIM card to its internal storage. [1] X Research source If your SIM card doesn’t have contacts stored on it yet, save them now before removing it from your old phone."
    },
    {
      "title": "Move the SIM card from the old phone into your iPhone.",
      "content": "Move the SIM card from the old phone into your iPhone. On most models of iPhone, the SIM tray is located on the left or right side of the phone, under the side or volume buttons. If you have a very early model, such as an original iPhone or an iPhone 3G or 3GS, the tray is located on the top. Insert a paperclip or other thin wire into the hole next to the SIM tray. It will pop open and you can place the SIM card inside. Some iPhone models (such as the iPhones 14 and 15) don’t have a SIM card tray and are designed only to work with a virtual eSIM. Check Apple’s handy guide to find the location of your phone’s SIM tray (if it has one). If you’re not sure what type of SIM card will work with your iPhone, check Apple’s compatibility list ."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. This is the grey icon with cogs on one of your home screens. [2] X Research source This could also be located in the \"Utilities\" folder on one of your home screens or in the App Library."
    },
    {
      "title": "Scroll down and tap Contacts.",
      "content": "Scroll down and tap Contacts . You’ll find this option in a list of apps that come with your iPhone. A new menu will open up."
    },
    {
      "title": "Tap Import SIM Contacts.",
      "content": "Tap Import SIM Contacts . It’s at the bottom of the screen. This will copy any contacts on the SIM card to your iPhone’s Contacts app. You may be prompted to select a location for the imported contacts. For example, if you have a Gmail account connected to your iPhone as well as an iCloud account, choose one of these from the popup. Depending on how many contacts are on your SIM card, this process may take a few moments to complete."
    },
    {
      "title": "Open the “Contacts” app.",
      "content": "Open the “Contacts” app. After the transfer is complete, the contacts from your SIM card will appear listed here. Check your list of contacts to make sure the data was imported correctly. Since different types of phones may have different ways of storing contact data, the contacts might not transfer correctly or completely. Check the manual or manufacturer website for your old device if you need more help. If you have a newer SIM card for your iPhone that you want to use, take the one from your old device out now and put the new one in."
    }
  ]
}