{
  "url": "https://www.wikihow.com/Make-a-Panty-Hose-Sculpture",
  "title": "How to Create a Cool Sculpture with Pantyhose",
  "steps": [
    {
      "title": "Use a pair of pliers to untwist the neck of the hanger.",
      "content": "Use a pair of pliers to untwist the neck of the hanger. After you’ve untwisted the neck, carefully pull the ends of the hanger apart to straighten it. The size of the hanger will determine the size of the sculpture, so choose wisely. The color of the hanger doesn't affect the sculpture at all."
    },
    {
      "title": "Drill holes that are about a quarter of an inch (0.64 cm) deep.",
      "content": "Drill holes that are about a quarter of an inch (0.64 cm) deep. Choose a block of wood that’s 2-inches X 4-inches or 4-inches by 4-inches. Use a power drill to drill 2 holes wherever you like, and have them at least three inches (7.62 cm) apart from each other to make the hosiery snug. [1] X Research source If you want to use 2 hangers, drill 4 holes into the wood. Make sure the holes are small enough so the ends of the hanger fit snugly without falling out. The holes can be any length apart, but their distance will have an effect on the sculpture. If you want a thin sculpture, put them closer together."
    },
    {
      "title": "Bend and twist the hanger into any shape you want.",
      "content": "Bend and twist the hanger into any shape you want. Once the ends are snugly in the holes, get creative and twist the hanger however you like. The curves in the hanger will give you the basic shape of your sculpture. When you have the hanger in the right position, use a glue gun (or e6000 glue) on the ends of the hanger to help keep them secure in the holes. [2] X Research source If you're feeling ambitious, you can add a second hanger for the other two holes to design your shape. You can either cover the extra pair of holes or just don't punch those. Remember that you'll usually see the outline of the hanger, so consider where you put all the wire curving and shaping in places so the panty hose is stretched by the wire; then you will see the hanger or hangers as curved edges."
    },
    {
      "title": "Pull the panty hose over the hanger once you have the base sculpture.",
      "content": "Pull the panty hose over the hanger once you have the base sculpture. Pull the pantyhose over the hanger and over the wooden block. Try to make the panty hose as tight as possible without causing a run. Once you have it at the bottom of the block, there will be a few inches of unused panty hose hanging—don’t cut this off yet. [3] X Research source Throw out the pantyhose that is open on both sides. You want to use pantyhose that is closed on one side (where the toes would be)."
    },
    {
      "title": "Apply a thin layer of white glue or acrylic plaster over the panty hose.",
      "content": "Apply a thin layer of white glue or acrylic plaster over the panty hose. Paint any part of the sculpture that is covered by the pantyhose, including the wooden block. Once the white glue or plaster is dry, you can cut the extra panty hose off of the bottom. The sculpture is now secure. Don't paint the bottom of the sculpture."
    },
    {
      "title": "Experiment with shiny colors like silver and gold.",
      "content": "Experiment with shiny colors like silver and gold. Completely cover everything, except the bottom of the block. Don't paint it heavily. Let it dry for a day or two, and you're done! [4] X Research source"
    }
  ]
}