{
  "url": "https://www.wikihow.com/Keep-Smoking-Systematically-Without-Getting-Addicted",
  "title": "How to Keep Smoking Systematically Without Getting Addicted",
  "steps": [
    {
      "title": "Avoid nicotine triggers.",
      "content": "Avoid nicotine triggers. Many smokers find that they experience cravings whenever they are in situations or places where they smoke most often. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you tend to smoke at parties, bars, or around a particular group of friends, and you want to temper your smoking habits, it may be best to avoid those triggers until a day when you're ready to smoke. The first step in avoiding triggers is to identify what your triggers are. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Think about when you most often smoke, and compare that place/scenario with your frequency of cravings between cigarettes. If you absolutely cannot avoid your biggest triggers, have a plan in place to avoid smoking on \"off\" days. Give yourself permission to leave early if necessary, and arm yourself with distractions to keep you from smoking. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. One of the best ways to avoid giving in to your cravings, especially if you find yourself in places or situations that trigger the urge to smoke, is to give yourself adequate distractions. For some, that may mean something to satisfy an oral fixation. For others, it may require something to keep the hands busy. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Identify what activities suppress your cravings most effectively. Do you feel the need to put something in your mouth, hold something in your hand, or some combination of the two? [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you crave the oral fixation that comes with smoking, try chewing gum or sucking on a hard candy or lozenge. Some smokers also find it very satisfying to chew on something crunchy, like sunflower seeds, to help stave off a nicotine craving. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you find yourself craving something to do with your hands, try carrying a pen and paper around. You can twirl the pen between your fingers, or doodle/draw to help distract you from the cravings. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you feel you need both the hand occupation and oral fixation, try carrying around a bundle of toothpicks/tea tree sticks, straws, or lollipops. Many former smokers (and current smokers who cannot smoke, for example while at work) turn to toothpicks, straws, and lollipops as a means of satisfying both the behavioral and oral components of cigarette cravings."
    },
    {
      "title": "Delay and regulate your urges.",
      "content": "Delay and regulate your urges. If you find yourself absolutely craving a cigarette on a day you don't want to smoke, promise yourself you'll wait 10 minutes before reaching for a pack. In that time, do something distracting. Try going for a walk or reading something engrossing to distract your mind, and use a physical replacement (like a toothpick or lollipop) to satisfy the habitual components of smoking. You can also squeeze a stress ball to help manage any anxiety that accompanies your cravings. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you absolutely must give in to your craving, then you may want to subtract that cigarette from a day you were planning to allow yourself to smoke later in the week. For example, if you're too stressed out on a Wednesday at work and you give in to your craving, then skip the situations or groups of friends who would trigger a craving on Friday or Saturday. That way you're still keeping yourself below a weekly minimum."
    },
    {
      "title": "Use relaxation techniques.",
      "content": "Use relaxation techniques. If you find your social smoking habits turning into bad cravings whenever you're stressed, try using relaxation techniques to break your stress patterns. There are many relaxation techniques that smokers find useful, including deep-breathing, meditation, muscle relaxation, and yoga. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In deep breathing, the goal is to breathe from your diaphragm (below your rib cage) to produce a slow, steady, deep inhalation and exhalation. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Meditation is used to calm the mind and focus attention away from stressful thoughts and feelings. Most people who meditate begin by focusing on their breath, taking slow and deep breaths in and out. Some practitioners also use a repeated word or phrase (called a mantra) or practice visualization to imagine a place or time that is peaceful and serene. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Progressive muscle relaxation involves tensing and subsequently relaxing each group of muscles progressively, from one end of the body to the other. This can help alleviate muscle tension and quell stressful or anxious thoughts and feelings. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Yoga combines stretches and postures with controlled, meditative breathing to help relax the mind and body. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Make time for a workout.",
      "content": "Make time for a workout. Studies have shown that 30 minutes of moderate to intense physical activity can actually quell a nicotine craving. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you're able to get outside when a craving strikes, go for a run, a long walk, or a bike ride. If you're at work, try some low-intensity workout options like squats, lunges, pushups, or walking up/down several flights of stairs. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try nicotine replacement therapy.",
      "content": "Try nicotine replacement therapy. Nicotine replacement therapy, or NRT, is widely considered a successful means of dealing with intense cravings. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There are many over-the-counter NRT products available, and according to a decades-long study by the Food and Drug Administration, combining NRT products shows no significant health threat. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Nicotine replacement patches, nicotine gum, and nicotine lozenges are all common NRT products that have been shown to be effective in treating nicotine cravings. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Stronger NRT products are available with a doctor's prescription. These include medications, such as bupropion (Zyban) and varenicline (Chantix). [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Unlike over-the-counter NRT products, these prescription medications are best used on their own, rather than in combination with other products, unless your doctor gives you express approval to combine NRT products. Talk to your doctor if you think prescription-strength NRT products may be right for you."
    },
    {
      "title": "Have a support system.",
      "content": "Have a support system. Whether you're trying to quit altogether, or just trying to break a too-frequent smoking habit down into what you view as a more-manageable social habit, having a support system can be a valuable aid. If you know of other friends or relatives who are going through the same withdrawal cravings, call or text one another, or get together to go for a long walk or run. If you don't know anyone who's actively trying to quit or reduce their smoking frequency, you can join an online support group. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Find online support groups by searching online for smoke cessation support groups. Many long-term members have gone through what you're going through, and can likely offer support or advice on how to manage your cravings. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Consider e-cigarettes.",
      "content": "Consider e-cigarettes. E-cigarettes, also called vape pens, are a non-combustible alternative to smoking cigarettes. These products typically contain a flavor component and nicotine, although some e-cigarette cartridges also come in nicotine-free varieties. [24] X Research source While e-cigarettes are not necessarily safe, they do allow smokers to avoid inhaling actual smoke while managing (and, ideally, reducing) the amount of nicotine being consumed on a day-to-day basis. [25] X Research source"
    },
    {
      "title": "Visit nonsmoking places.",
      "content": "Visit nonsmoking places. If you're having a hard time breaking your nicotine habit, it may be helpful to go to public places, such as restaurants and certain parks, where smoking is prohibited. Being around other non-smokers may be inspiring, and if nothing else you know that you will be incapable of lighting up while you're in that location. [26] X Research source"
    },
    {
      "title": "Know when to cut yourself off.",
      "content": "Know when to cut yourself off. It's okay if you slip up once in a while and smoke on an \"off\" day. But it's important to recognize that this is akin to taking a cheat day on a diet. You can't keep indulging day after day if you want to avoid becoming a chain-smoker. The important thing is to absolutely cut yourself off after one single cigarette, if you must have one. [27] X Research source Try reinforcing your own imposed limit by only carrying one or two single cigarettes on you at any given time. You can store it in a hard-box cigarette pack that is otherwise empty, or purchase a small metal cigarette case. An even better strategy would be to avoid bringing cigarettes with you when you leave the house on \"off\" days. That way, if you do submit to your cravings, you know you'll only be able to smoke a cigarette if someone is willing to give you one of theirs."
    },
    {
      "title": "Learn the effects of tobacco.",
      "content": "Learn the effects of tobacco. Tobacco contains many, many chemicals, the most addictive of which is nicotine. Nicotine has been shown to be as addictive a drug as heroin or cocaine. Low levels of nicotine consumption create a slightly euphoric feeling due to the release of dopamine and the minor adrenaline rush that accompanies the act of smoking. Nicotine also increases the resting heart rate, lowers skin temperatures, and reduces blood flow in the body's extremities. Smoking is known to cause cancer, as well as strokes, coronary heart disease, blood clots, and chronic obstructive pulmonary disease (COPD). It has also been shown to harm virtually every organ in the body. [28] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Smoking is highly addictive. Many people recognize the harmful effects smoking causes on the body, but are incapable of quitting."
    },
    {
      "title": "Understand social smoking.",
      "content": "Understand social smoking. Many self-avowed social smokers claim that they are not addicted, and can quit any time they want. However, on a chemical level, even social smokers' brains become sensitized to nicotine. Brain scans have shown an increase in the development and density of dendrites in the parts of the brain associated with addiction. [29] X Research source Studies have shown that even beginner smokers experience a drastic reduction in the number of days they can go through without experiencing cravings, which suggests that even casual/social smoking is often the beginning of full-fledged addiction. [30] X Research source"
    },
    {
      "title": "Determine if you are addicted.",
      "content": "Determine if you are addicted. If you still consider yourself a social/casual smoker without any real risk of addiction, you may already be addicted. Psychologists and medical professionals have compiled a checklist that addresses smoking habits which may be useful in assessing your own smoking habits. Any \"yes\" answers to any of the following questions suggests to medical professionals that addiction has already started: Have you ever tried to quit but could not? [31] X Research source Do you find yourself smoking because it is difficult to quit? [32] X Research source Do you now or have you ever felt like you were addicted to tobacco/nicotine? [33] X Research source Do you ever experience strong, irresistible cravings to smoke? [34] X Research source Have you ever felt that you desperately needed a cigarette? [35] X Research source Do you find it difficult to refrain from smoking in places or situations where you know you're not supposed to smoke? [36] X Research source When you haven't smoked for a few days, do you find it difficult to concentrate? [37] X Research source After not smoking for a while, do you feel more irritable? [38] X Research source After not smoking for a while, do you feel an urgent need to smoke? [39] X Research source When you haven't smoked for a few days, do you ever feel nervous, restless, or anxious? [40] X Research source"
    },
    {
      "title": "Consider seeing a doctor.",
      "content": "Consider seeing a doctor. If you're concerned about your level or frequency of smoking, or if you've tried to quit several times and haven't been successful, you may want to consider talking to your doctor. A medical professional will be able to help you develop a treatment plan to manage both the physical and behavioral aspects of your addiction/dependence, and such treatment plans are often highly successful. [41] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}