{
  "url": "https://www.wikihow.com/Insecure-Narcissist",
  "title": "Exploring Insecure Narcissism: Traits, Behaviors, Causes & More",
  "steps": [
    {
      "title": "Yes, some narcissists are insecure and hide feelings of inferiority.",
      "content": "Yes, some narcissists are insecure and hide feelings of inferiority. Many people view narcissists as self-centered individuals who want to make everything about themselves, but the reality is that many people struggling with NPD also struggle with feelings of low self-esteem. In particular, vulnerable (covert) narcissists often have lower self-esteem than grandiose (overt) narcissists. This insecurity is a large source of motivation for behaving narcissistically. [1] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Overt narcissists are often very extroverted, confident, and assertive. Their narcissistic behaviors are often a result of wanting power and control over others. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Covert narcissists are usually more introverted, and their narcissistic behaviors are often harder to spot. They may act in a narcissistic way because they’re seeking validation to combat feelings of low self-esteem."
    },
    {
      "title": "Lack of empathy",
      "content": "Lack of empathy One major symptom of NPD is a person’s inability or unwillingness to empathize with others and understand their feelings. Not being able to relate to others’ emotions and provide comfort when needed can cause a narcissist to lose many relationships, and this in turn might make them feel even more insecure. [3] X Research source It’s possible that a narcissist is very aware of the difficulties they have relating to other people’s emotions, and this may be a big part of their insecure feelings."
    },
    {
      "title": "Need for control",
      "content": "Need for control People diagnosed with NPD are often described as being very controlling within their relationships, and they might resort to using manipulation to get their way. In order to hide their insecurities and create the perfect environment where they can receive praise and validation, a narcissist might be very controlling of their partner, friends, or other people around them. For example, a narcissist might forbid their partner from hanging out with people of the opposite gender because they feel insecure about where they stand in their relationship."
    },
    {
      "title": "Passive-aggressive behavior",
      "content": "Passive-aggressive behavior Narcissists who feel insecure may choose to use passive-aggressive behaviors in order to control or manipulate others into giving them sympathy and praise. For example, a narcissistic person may give their partner the silent treatment in order to make the other person feel guilty or get them to pay more attention. [4] X Research source For narcissists who are in a relationship, they might purposefully not be as affectionate with their partner as a passive-aggressive way to tell them to be more attentive."
    },
    {
      "title": "Sensitivity to criticism",
      "content": "Sensitivity to criticism Because of their feelings of insecurity, someone with NPD might be especially sensitive to other people’s criticism, even if it’s meant to be constructive. They might get defensive or lash out when someone makes a comment, or they might completely avoid situations where others can judge them. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source A coworker who has NPD and also feels insecure might refuse to hear any constructive criticism from their peers or simply ignore notes on their performance."
    },
    {
      "title": "Fear of rejection and abandonment",
      "content": "Fear of rejection and abandonment Part of a narcissist’s insecurity may be an underlying fear of being left behind or rebuffed by people they consider themselves to be close to. This might be a result of a neglectful childhood or trauma from a past instance where someone left them. This fear might make someone with NPD unwilling to open up to others. [6] X Research source In order to protect themselves, a narcissist might simply write others off as being inferior to them so that they can avoid being hurt. For example, a school peer with NPD might claim they’re too cool to hang out with other people."
    },
    {
      "title": "Judgemental behavior",
      "content": "Judgemental behavior In order to protect their fragile self-esteem, a narcissist—specifically, a covert narcissist—might resort to judging everyone around them as inferior. Ironically, they may fear being judged and laughed at by others, but some narcissists might have no reservations when it comes to judging others. [7] X Research source One study found that people who scored higher on a scale that measured covert narcissism were more likely to fear being laughed at by others but were also more likely to enjoy laughing at and mocking others."
    },
    {
      "title": "Perfectionist tendencies",
      "content": "Perfectionist tendencies A narcissist’s insecurity might be partially due to the very high expectations they’ve set for themselves. Underneath their narcissistic behaviors, someone with NPD might fear being humiliated by others due to their shortcomings. Because of this, they may work extra hard to appear “perfect” and avoid any potential embarrassment. [8] X Research source In many cases, grandiose narcissists tend to be perfectionists in order to feel superior to others. On the other hand, vulnerable narcissists might seek perfection to avoid having their self-esteem damaged any further."
    },
    {
      "title": "Distrust toward others",
      "content": "Distrust toward others For some people with NPD, fear of humiliation and having their flaws exposed can make them very distrustful of others. In order to avoid such embarrassment, they might withdraw completely from certain situations, or they might choose to keep their relationships more surface-level and less intimate. [9] X Research source A fear of appearing vulnerable might also cause them to be distant with others, even their romantic partner. Due to this distrust and fear of vulnerability, someone with NPD might be reluctant to be in a long-term, committed relationship. Instead, they might have a habit of only pursuing short flings."
    },
    {
      "title": "Difficulty with depression and/or anxiety",
      "content": "Difficulty with depression and/or anxiety Unfortunately, such feelings of insecurity and low self-esteem can turn into much more serious issues, such as depression and anxiety. If they put a lot of pressure on themselves to appear superior to others, insecure narcissists may start to feel anxious about always having to maintain a facade and cover their weaknesses. Additionally, their feelings of low self-esteem may be the result of depression. [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "They say self-deprecating things to get you to empathize.",
      "content": "They say self-deprecating things to get you to empathize. A narcissist who feels insecure often craves praise and sympathetic words from others. In order to get your sympathy, someone with NPD might intentionally make a self-deprecating comment just so you’ll say it’s not true and compliment them. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, a partner or friend with NPD might say something like, “I’m literally so bad at everything” or “Nobody cares about me” in order to earn your sympathy."
    },
    {
      "title": "They often brag about their accomplishments.",
      "content": "They often brag about their accomplishments. In order to make up for or conceal any of their shortcomings, a narcissist might try to boost their image by bragging about their various accomplishments. Unfortunately, if they feel threatened by any of your own successes, they might try to one-up you and may even make up a lie to make themselves look better. [12] X Research source As an example, a narcissistic friend might lie about getting a promotion at work after hearing about how well you’re doing at your job."
    },
    {
      "title": "They complain that things aren’t good enough.",
      "content": "They complain that things aren’t good enough. An insecure narcissist might have very high expectations when it comes to themselves and their lives, and they might constantly complain in order to make themselves appear better than others. By complaining, they’re showing off how they hold themselves to higher standards than “regular” people and make themselves appear superior to others. [13] X Research source For example, a narcissistic coworker might say something like, “This job is way too easy for me,” or “People clearly don’t know what good work ethic looks like.”"
    },
    {
      "title": "They play the victim when things go wrong.",
      "content": "They play the victim when things go wrong. Instead of taking responsibility for their mistakes, a narcissist who feels insecure might be more likely to shift the blame onto someone else and make themselves out to be the victim. They likely don’t want to be called out and embarrassed, so they’ll do what they can to put those feelings of guilt onto another person. [14] X Research source They might also use gaslighting to make someone feel guilty even if what happened wasn’t their fault. This is a common manipulation tactic that narcissists use. For example, a narcissistic partner or family member may put the blame on you for a problem they’re having by saying something like, “Well, I wouldn’t be this way if you actually cared about me.”"
    },
    {
      "title": "They try to make you feel insecure.",
      "content": "They try to make you feel insecure. If a narcissist feels cornered, they might lash out by projecting their insecurity onto the people around them. They might do this by overly bragging about their accomplishments, making belittling comments, or being overly passive-aggressive. [15] X Research source For instance, an insecure narcissist might try to deflect the attention away from them by telling you that you have no regard for their feelings when you bring up something they did that made you uncomfortable."
    },
    {
      "title": "Childhood abuse",
      "content": "Childhood abuse Unfortunately, some people who suffered from abuse during their childhood have been seen to develop symptoms of NPD. Narcissistic behaviors often act as a psychological defense mechanism for those who have suffered abuse or neglect early on in life, and people may turn to narcissism in order to conceal feelings of shame, loneliness, or loss. [16] X Research source"
    },
    {
      "title": "Harmful parenting styles",
      "content": "Harmful parenting styles A parent who was inconsistent with giving their child affection might have caused their child to develop an anxious attachment style and low self-esteem. If a parent was affectionate one moment but completely neglectful the next, their child is more likely to be insecure in future relationships. Vulnerable narcissists are more likely to have experienced this type of anxious attachment style. [17] X Research source"
    },
    {
      "title": "High expectations from family members",
      "content": "High expectations from family members A person can develop very low self-esteem if they grew up in a household where they were constantly judged and held to very high standards. Because of these expectations, they may develop narcissistic behaviors to make themselves feel like they’re better than others and avoid any feelings of shame or guilt for not living up to these high standards. [18] X Research source"
    },
    {
      "title": "Set firm boundaries.",
      "content": "Set firm boundaries. If the other person’s behavior makes you uncomfortable or is directly harming you, establish firm boundaries about what is and isn’t permissible. Additionally, make sure that these boundaries come with clear consequences if the other person decides to break them. [19] X Research source For example, set a boundary that says a narcissistic partner or family member need to respect your personal space when you need it. This might be in response to a narcissist’s controlling behavior within your relationship. Create consequences like having less communication with the other person, moving out, or breaking up with a narcissistic partner. If you’re dealing with a coworker, tell them you’ll take the matter to your boss or HR if they continue to make you feel uncomfortable."
    },
    {
      "title": "Express your feelings in a clear and concise way.",
      "content": "Express your feelings in a clear and concise way. When dealing with someone with NPD, whether it’s a family member, partner, friend, or coworker, it’s important to remember that they may have difficulty relating to what you’re saying due to their inability or unwillingness to empathize. If you want to express your feelings , do it in a concise and straightforward way. Use “I” language to keep the focus on your feelings instead of placing blame. For example, instead of saying, “You say really hurtful things,” be more direct by saying, “I feel very hurt when you make belittling comments.”"
    },
    {
      "title": "Take a break from the relationship if it’s negatively affecting you.",
      "content": "Take a break from the relationship if it’s negatively affecting you. If the other person’s behavior is becoming toxic and negatively affecting your life, take time to honestly evaluate your relationship and decide if you need to take a step back. This might be taking a few weeks or months to yourself, or leaving them for good . Ask yourself if your relationship with them is hurting you more than helping you. Don’t be afraid to turn to friends and family for advice. Even if you don’t completely agree with what they have to say, you may be able to gain new perspectives and find solutions you might not have thought of."
    },
    {
      "title": "Don’t internalize their hurtful comments.",
      "content": "Don’t internalize their hurtful comments. A narcissist who is dealing with insecurity might try to cope by lashing out at you and making you feel insecure. While these may certainly be hurtful, it’s important to remember that these comments aren’t an accurate reflection of you or your character. Instead, they’re usually a coping mechanism the other person uses to deflect their own feelings of inadequacy. [20] X Research source If you find yourself feeling down because of something they said, say some positive affirmations to yourself to remind yourself of your worth. Say things like, “I am loved,” “I am a good person,” and “I am trying my best” to help think positively about yourself ."
    },
    {
      "title": "Talk to a therapist for extra support.",
      "content": "Talk to a therapist for extra support. Seeing a therapist can help you cope with a narcissist’s behaviors and provide you with a space to learn more about why someone with NPD may act the way they do. A therapist might also be able to help you recognize a person’s narcissistic behaviors and handle them in a healthy way. [21] X Research source Use a site like BetterHelp to find a licensed therapist near you."
    }
  ]
}