{
  "url": "https://www.wikihow.com/Know-if-Someone-Self-Harms",
  "title": "How to Know if Someone Self Harms",
  "steps": [
    {
      "title": "Understand what self-harm is.",
      "content": "Understand what self-harm is. Self-harm is described as \"when somebody intentionally damages or injures their body. It's usually a way of coping with or expressing overwhelming emotional distress.\" [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Self-harm is a symptom, not a diagnosis. Some people may self-harm because of one or more mental illnesses such as depression , anxiety , an eating disorder or psychosis. Self-harm doesn't always necessarily indicate a mental disorder, but a lack of healthy coping mechanisms. Common methods of self-harm include: [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [3] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source Cutting or burning oneself Punching or hitting oneself Trying to poison oneself Over or undereating Biting oneself Over exercising Hair-pulling (trichotillomania) Picking scabs"
    },
    {
      "title": "Understand why people self-harm.",
      "content": "Understand why people self-harm. Self-harm is a complex issue and many people don't know the specific reason they self-harm. Self-harm isn't always caused by one big thing, it can be caused by lots of little things. Common reasons someone might self-harm are: Pressure at school or work Bullying Money worries Abuse (physical, sexual or emotional ) Bereavement Confusion about gender or sexuality Breakdown of a relationship Job loss Illness or health problem (physical or mental) Low self-esteem Stress Difficult feelings"
    },
    {
      "title": "Know the difference between self-harm and suicide.",
      "content": "Know the difference between self-harm and suicide. Self-harm may or may not be done with the intention of suicide. People who self-harm are more likely to attempt or die of suicide. Some types of self-harm can be life-threatening, even if it is not done with suicidal intent. Some people consider suicide attempts a form of self-harm. [4] X Research source"
    },
    {
      "title": "Know who is most at risk for self-harm.",
      "content": "Know who is most at risk for self-harm. Although anyone is at risk of self-harm, regardless of gender, race, sexuality, age, or social status, some groups of people are more vulnerable than others. [5] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source People with psychological conditions Young people not under the care of their parents LGBTQ+ people People who lost someone to suicide"
    },
    {
      "title": "Debunk common myths.",
      "content": "Debunk common myths. There are a lot of myths and stigma behind self-harm. Common myths include: [6] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Only girls self-harm . Studies have shown this isn't the case. Boys may use different self-harm methods than girls. This doesn't mean it is less serious. Self-harm is attention-seeking. Usually, people who self-harm will try to hide the fact they do. In some cases, self-harm can be a cry for help, but this doesn't make it any less serious. People who self-harm are suicidal. Self-harm can be seen as a coping mechanism for some. Some people who self-harm can have suicidal thoughts, but not all."
    },
    {
      "title": "Know how self-harm scars can differ from ordinary scars.",
      "content": "Know how self-harm scars can differ from ordinary scars. What the scars look like can differ depending on how the person self-harms, but self-harm scars, particularly from cutting, are usually in a straight or symmetrical pattern. Look out for scars grouped close together. Notice if the person keeps getting scars in the same place, as this can be a sign they are self-harming. Self-harm scars are often parallel and look similar. Keep in mind that some people may disguise their scars as accidents."
    },
    {
      "title": "Look on the person's arms, especially wrists.",
      "content": "Look on the person's arms, especially wrists. The majority of people who harm themselves use the wrists. Look for marks and bandages. They may wear jackets, long sleeves, or gloves, and may put their hands in the pockets of their clothes. The person may also cover their injuries with bracelets or watches. It is easier to notice in summer, since in winter, many people cover up because of the cold. Notice if they cover up even in hot weather. [7] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source"
    },
    {
      "title": "Check their legs and ankles.",
      "content": "Check their legs and ankles. People may self-harm in a variety of places: thighs, lower legs, ankles, etc. They may wear long pants, long socks, or tights, to hide the scars or injuries. Be careful about staring at a person's legs. You don't want to upset or scare them."
    },
    {
      "title": "Look on the person's neck.",
      "content": "Look on the person's neck. Some people harm themselves by trying to hang themselves. Those kind of people will often wear scarves, turtlenecks, or something that hides the neck. If someone tries to hang themselves, this is especially serious. Take action if you believe someone may attempt suicide."
    },
    {
      "title": "Look for bald patches on someone's head or lack of hair.",
      "content": "Look for bald patches on someone's head or lack of hair. Some people that self-harm pull hair. Addiction to hair pulling is called trichotillomania. Trichotillomania isn't always pulling hair from one's scalp, but can be picking hair from any part of the body such as facial hair, eyebrows or eyelashes. [8] X Research source Such a person may buy wigs or hair extensions to conceal hair loss. They may also buy fake eyelashes. Notice if the person frequently covers their hair with a hat or another accessory. Keep in mind that some people cover their hair for religious reasons. Be aware there are many reasons for hair loss besides self-harm, such as: [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Cancer treatment Stress Ageing Illness Weight loss Iron deficiency Hair-pulling can also be a sign of an anxiety disorder such as OCD."
    },
    {
      "title": "Look for burns.",
      "content": "Look for burns. Many people who self-harm burn themselves. These burns can be from matches, lighters, cigarettes, or anything else that's hot. Look for a group of burns close together or an area that keeps getting burns. Burns can cause red peeling skin, blisters, charred skin, and swelling. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Notice if they keep any \"tools\".",
      "content": "Notice if they keep any \"tools\". The person may hide tools that they self-harm with. Examples include blades (knifes, razors, safety pins, etc.) or lighters. They may keep these in a bag or small space. Watch if they take certain things into the bathroom or a space alone. Watch out for any signs of blood, such as bloody tissues."
    },
    {
      "title": "Ask the person if they would like to go swimming.",
      "content": "Ask the person if they would like to go swimming. Swimming is an activity that usually exposes one's arms and legs. If the person seems reluctant, it could be that they are reluctant to show skin. The person may also wear clothes which cover their arms or legs such as a wetsuit or T-shirt. They may also make excuses. Don't assume they are self-harming just because they don't want to go swimming. There are many reasons someone might not want to go swimming."
    },
    {
      "title": "Approach them about their injuries.",
      "content": "Approach them about their injuries. Ask them about what happened. If the person gets defensive, has a story that doesn't make sense, or avoids the question, they may be self-harming. Give people the benefit of doubt. Sometimes perfectly innocent injuries can look like self-harm."
    },
    {
      "title": "Notice how isolated the person is.",
      "content": "Notice how isolated the person is. People who self-harm may be overwhelmed with feelings of guilt and isolation, and they may not have any friends (or have poor contact with their friends). They often spend lots of time alone. The person may not want to do activities they previously enjoyed. Notice if they say they \"can't be bothered\" a lot of the time. Isolating oneself can be a symptom of depression, with or without self-harm. Note that not all people who self harm isolate themselves. Just because someone spends time in the company if others, it doesn't mean they can't self harm."
    },
    {
      "title": "Observe whether they retreat into the bathroom or bedroom and lock the door.",
      "content": "Observe whether they retreat into the bathroom or bedroom and lock the door. While it's typical to lock the door while changing clothes, showering, and using the toilet, something is probably wrong if they have been locked away for thirty minutes and won't let you in for anything (for example, not opening up to answer a question). They may be very secretive or defensive about their time in there. Notice if when they are dealing with difficult emotions, they go away somewhere alone and seem fine when they come back. This can indicate that they have done something to cope with these feelings. Be aware that most teens have a strong need of privacy. It's natural for them to want to be alone from their family, and this doesn't necessarily mean they are cutting. Respect their quiet time and try not to interrupt much."
    },
    {
      "title": "Check for symptoms of depression.",
      "content": "Check for symptoms of depression. Depressed people may be lethargic, indecisive, grumpy, listless, and indifferent. They may withdraw from friends and family and lose interest in their favorite things. Depression is a serious illness that can be treated by a doctor. Reader Poll: We asked 347 wikiHow readers, and 51% of them agreed that the symptoms of depression they find the most challenging to deal with are intense feelings of sadness and despair . [Take Poll]"
    },
    {
      "title": "Get to know",
      "content": "Get to know the person. Try to talk to them. Ask them about their school/job and friends. Try to make the person feel loved, and that you'll always be there for them. People who harm themselves are often lonely, or are people who were hurt in some way. Remember that not all people who self-harm seem sad. The person may seem like a happy person on the outside. Don't assume someone isn't self-harming just because they seem to be happy. Be aware, however, if someone who is depressed or frequently sad suddenly acts happy or content. If they seem incredibly calm or happy out of the blue, they may have decided to die by suicide and are content because they won't have to deal with problems in their life anymore. If you see someone who is usually depressed seem suddenly happy, check in on them and ask them how they're doing and the cause of their joy. [11] X Research source"
    },
    {
      "title": "Notice if they talk about self-harm frequently.",
      "content": "Notice if they talk about self-harm frequently. The person may disguise it as a joke or say it's \"nothing\". Sometimes joking about these topics can be a cry for help. [12] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Don't be afraid to ask someone what they meant by what they said. The person may make self-depreciating jokes or statements often. They may express feelings of hopelessness or self-loathing. They may also talk about punishing themselves. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Take any mentions of self-harm as an opportunity to talk about the subject. The person may open up."
    },
    {
      "title": "Observe their eating habits",
      "content": "Observe their eating habits . [14] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Eating too much or too little deliberately can be a form of self-harm. The person may try to conceal their eating habits. People who have an eating problem may: [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Be over or underweight or have significant weight changes. Skip meals or eat too little. Binge eat. Feel light-headed or dizzy. Force themselves to throw up, possibly by using laxatives. Eat too fast or when they're not hungry. Eat alone. Eat inedible objects ( pica )."
    },
    {
      "title": "Watch out for alcohol or drug abuse.",
      "content": "Watch out for alcohol or drug abuse . [18] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Someone who self-harms is at higher risk of having a drinking or drug problem. If the person smokes , it could also mean they have a higher chance of self-harming."
    },
    {
      "title": "Notice risk-taking behavior.",
      "content": "Notice risk-taking behavior. The person may be more self-destructive than usual. The person may get into fights frequently. They may drive dangerously or have unprotected sex. [19] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source"
    },
    {
      "title": "Be aware of mood changes.",
      "content": "Be aware of mood changes. [20] X Research source If someone gets angry or upset easily, it could be a sign that something's up. They may be hot-headed or unpredictable. They may also be more aggressive than usual. Of course, mood swings can be a sign of puberty or that someone is on their period. Don't jump to conclusions too quickly."
    },
    {
      "title": "Take action.",
      "content": "Take action. Read Help Someone Who Self Injures for detailed advice on how to help the person. If the person is planning suicide or to seriously hurt themselves, call the emergency services immediately. The number for America and Canada is 911 and the number for the UK is 999. The Suicide and Crisis hotline is 988 in America. Don't force the person to stop and take away their \"tools\", this can result the person in taking risky measures. Instead, encourage the person to get professional help. Don't threaten/scare someone who is self-harming and say you're going to tell their parents if they won't stop. Self-harm is a vast topic. Its origins can vary broadly. Self-harm can mean different things to different people. It is better to seek specific support, depending on the origins of self-harm behavior for a person. Seeing a Dialectical Behavior Therapy therapist or group might help the individual better understand daily triggers and increase their coping resources."
    }
  ]
}