{
  "url": "https://www.wikihow.com/Make-a-Shortcut-on-Snapchat",
  "title": "How to Make a Shortcut on Snapchat",
  "steps": [
    {
      "title": "Shortcuts allow you to send Snaps to multiple people at once.",
      "content": "Shortcuts allow you to send Snaps to multiple people at once. Rather than searching for each added friend in your contact list, you can compile them into groups to send Snaps with a single button. Each Shortcut can be labeled with a single emoji. Shortcuts are private to you. Other Snapchat users will not be notified you are using a shortcut. When you and a friend send at least one Snap to each other every day, you build a Streak. If you have ongoing Streaks with multiple friends, using Shortcuts can help keep your Streaks active by sending a Snap to all Streak friends with one click."
    },
    {
      "title": "Shortcuts are different from Groups.",
      "content": "Shortcuts are different from Groups. Groups are similar to group chats. Every user in a Group can see the members, messages, and replies. Use Groups only if you want to create a group chat where every participant can see the activity."
    },
    {
      "title": "Open Snapchat and create a Snap.",
      "content": "Open Snapchat and create a Snap. By default, your camera will be open. Tap the record button once to take a picture or hold it down to record a video. [1] X Research source You can also navigate to your Snapchat Memories to send existing pictures or videos."
    },
    {
      "title": "Share your Snap.",
      "content": "Share your Snap. Click Send To on the bottom right. A page will pop up with all your contacts and sending options. [2] X Research source This is also where you can post to your Snapchat Story ."
    },
    {
      "title": "Tap the search bar.",
      "content": "Tap the search bar. It will have Send To… within the bar, next to a magnifying glass. [3] X Research source You must click the search bar, or the option to create a Shortcut will not appear."
    },
    {
      "title": "Tap Create Shortcut.",
      "content": "Tap Create Shortcut . A list of your contacts will appear. [4] X Research source"
    },
    {
      "title": "Select the friends you want to add to the Shortcut.",
      "content": "Select the friends you want to add to the Shortcut. You can scroll through the list or use the search bar on top to find a specific person quickly. [5] X Research source"
    },
    {
      "title": "Enter an emoji.",
      "content": "Enter an emoji. You can select any emoji available in your library. [6] X Research source You must choose an emoji to name your Shortcut. If you try to use text, Snapchat won't allow you to continue."
    },
    {
      "title": "Tap Create Shortcut.",
      "content": "Tap Create Shortcut . Your Shortcut will now be created. [7] X Research source To send the Snap to your newly made Shortcut, click the emoji you used as its label. Tap Select , then tap the arrow on the bottom right corner to send your Snap."
    },
    {
      "title": "Open Snapchat and create a Snap.",
      "content": "Open Snapchat and create a Snap. By default, your camera will be open. Tap the record button once to take a picture or hold it down to record a video."
    },
    {
      "title": "Tap Send To at the bottom right.",
      "content": "Tap Send To at the bottom right. This will be in yellow, next to an arrow icon. [8] X Research source"
    },
    {
      "title": "Tap the emoji assigned to your Shortcut.",
      "content": "Tap the emoji assigned to your Shortcut. You will see a list of all the contacts associated with the Shortcut underneath the emoji. [9] X Research source"
    },
    {
      "title": "Tap Select.",
      "content": "Tap Select . This will select all the contacts in the Shortcut. [10] X Research source Alternatively, you can click the circle beside each contact to include or exclude specific people."
    },
    {
      "title": "Tap the arrow on the bottom right to send the snap.",
      "content": "Tap the arrow on the bottom right to send the snap. Your Snap will send to the contacts in the Shortcut. [11] X Research source You'll be returned to the Chat screen, where you can view messages and check their status. If needed, you can delete Snapchat conversations. You can create a Shortcut for all friends you have a Streak with. This can help keep Streaks active by sending Snaps to multiple friends with one click."
    }
  ]
}