{
  "url": "https://www.wikihow.com/Make-Play-Dough",
  "title": "How to Make Play Dough",
  "steps": [
    {
      "title": "Combine the flour, cream of tartar, and salt in a saucepan.",
      "content": "Combine the flour, cream of tartar, and salt in a saucepan. Measure out 2 cups (470 ml) of flour, 4 teaspoons (20 ml) of cream of tartar, and 3 ⁄ 4 cup (180 ml) of salt. Stir the dry ingredients together until they’re thoroughly mixed. [1] X Research source Don’t skimp on the salt. It’s what keeps the dough from being too sticky. The saucepan should not be warm. Do not turn on the stove yet."
    },
    {
      "title": "Add 2 cups (470 ml) of water and 2 tablespoons (30 ml) of vegetable oil.",
      "content": "Add 2 cups (470 ml) of water and 2 tablespoons (30 ml) of vegetable oil. Use a spoon to mix the wet ingredients into the dry ingredients. Stir until there are no clumps of flour and all of the ingredients are completely combined. [2] X Research source A whisk will help get rid of any stubborn lumps."
    },
    {
      "title": "Cook the mixture over medium heat for 2 to 3 minutes, stirring constantly.",
      "content": "Cook the mixture over medium heat for 2 to 3 minutes, stirring constantly. Turn the stove burner to medium heat and start stirring the play dough with a spoon. Make sure to scrape the bottom frequently to prevent any dough from sticking or burning. [3] X Research source If your stove heats up fast, you may need to only cook it for 30 seconds to 1 minute."
    },
    {
      "title": "Remove the dough from the pan when it’s no longer wet.",
      "content": "Remove the dough from the pan when it’s no longer wet. You’ll first notice the dough pulling away from the edges of the pan as it thickens and forms. Once all of the wet spots are gone and the dough can be molded into a ball, carefully take it out of the pan. [4] X Research source Even though you should be able to pull the dough out of the pan with your hands if it’s ready to be removed, use a spoon so you don't burn yourself. Don’t forget to turn the stove off and remove the pan. You’ll likely want to let the pan soak in the sink with soap and water so it’s easier to clean later."
    },
    {
      "title": "Add a couple drops of food coloring if you want colorful play dough.",
      "content": "Add a couple drops of food coloring if you want colorful play dough. The more drops you add, the more vibrant your dough will be. A good rule of thumb is to start with 5 drops and then increase from there if you want brighter colors. [5] X Research source If you’re making multiple colors, divide the dough into even sections before adding the food coloring. For example, if you want red and blue dough, split it into 2 balls, then mix in each color."
    },
    {
      "title": "Knead the dough for about 30 seconds or until it’s smooth.",
      "content": "Knead the dough for about 30 seconds or until it’s smooth. Use your hands to squish and fold the ball of dough until there are no more lumps. If you added food coloring or anything else, continue kneading until everything is completely blended and there are no streaks. [6] X Research source If the dough is too hot at first, let it cool slightly before you begin kneading. You can knead on any flat surface. Lay down a sheet of wax paper on a counter, for example, for a clean area."
    },
    {
      "title": "Store the dough in an airtight container for up to 3 months in the fridge.",
      "content": "Store the dough in an airtight container for up to 3 months in the fridge. Make sure the container is sealed tightly to prevent the dough from drying out. After 3 months, or if you notice any moldy spots on the dough, throw it away. [7] X Research source If the dough gets dry, simply knead a few drops of water into it to refresh it. Resealable bags will work instead of a container. Squeeze all air out of the bags before sealing."
    },
    {
      "title": "Combine the marshmallows, cornstarch, oil, and water in a bowl.",
      "content": "Combine the marshmallows, cornstarch, oil, and water in a bowl. Pour the entire 10 oz (280 g) bag of marshmallows into a microwave-safe bowl. Then add 2 1 ⁄ 2 cups (590 ml) of cornstarch, 1 ⁄ 3 cup (79 ml) of vegetable oil, and 3 tablespoons (44 ml) of water. [8] X Research source To check if a bowl is microwave-safe, look on the bottom of the dish. It should state something like “Safe for microwave use.”"
    },
    {
      "title": "Microwave the bowl for 2 minutes, stirring the mixture every 30 seconds.",
      "content": "Microwave the bowl for 2 minutes, stirring the mixture every 30 seconds. You want to microwave the mixture until the marshmallows are completely melted. Checking it and stirring it with a spoon every 30 seconds will prevent you from overcooking it. The marshmallows will begin browning if you've cooked them too much. Make sure you scrape the bottom of the bowl when you're stirring so the marshmallows don't burn. Depending on the strength of your microwave, it might not take a full 2 minutes to melt the marshmallows."
    },
    {
      "title": "Squeeze a few drops of food coloring into the bowl for colorful dough.",
      "content": "Squeeze a few drops of food coloring into the bowl for colorful dough. If you want light, pastel colors, use fewer drops. If you want richer, brighter shades, increase the number of drops. Remember that a little goes a long way with food coloring. [9] X Research source You can also leave the dough plain white if you prefer. Get creative and mix different colors with your food coloring. For example, use blue and red drops to create purple."
    },
    {
      "title": "Knead the dough until it’s smooth and the colors are blended.",
      "content": "Knead the dough until it’s smooth and the colors are blended. Similar to how you would knead dough when you’re baking bread, stretch, fold, and squish the play dough with your hands. There shouldn’t be any clumps of cornstarch or streaks of food coloring when you’re done. [10] X Research source If the dough feels too sticky, add a little more cornstarch and knead it into the dough. Brushing a little bit of coconut oil on your hands before kneading will prevent the dough from sticking to your fingers."
    },
    {
      "title": "Place the dough in an airtight container in the fridge for up to 1 week.",
      "content": "Place the dough in an airtight container in the fridge for up to 1 week. Since the dough is edible and made of perishable ingredients, it won’t last for very long. Seal the container securely to prevent the dough from going bad faster. [11] X Research source Don’t let your kids eat the dough if it’s been in the refrigerator for longer than 1 week or if there are signs of mold. You can use resealable bags instead of a container."
    }
  ]
}