{
  "url": "https://www.wikihow.com/Make-Gold-in-Color-Pencil",
  "title": "How to Create Realistic, Shiny Gold with Colored Pencils",
  "steps": [
    {
      "title": "Mix white, yellow, light brown, and dark brown colored pencils to make gold.",
      "content": "Mix white, yellow, light brown, and dark brown colored pencils to make gold. Gold is created by mixing warm brown and bright yellow shades together. [1] X Research source To create a gold hue using colored pencils, you’ll need a gradient of white, yellow, light brown, and dark brown pencils. You can play around with different pencil shades to make your ideal hue. Gold is an incredibly versatile shade made up of multiple colors, so you have plenty of options to choose from, like dull gold and bright gold. For dull gold, select black, grey, brown, and dark yellow colored pencil shades. For bright gold, choose white, light yellow, yellow, and light brown shades."
    },
    {
      "title": "Use your colored pencils to create a gradient like the one above.",
      "content": "Use your colored pencils to create a gradient like the one above. While you could just mix your 4 shades together to make a solid gold color, realistic gold is actually made up of highlights and shadows since it’s reflective. To capture this in your drawing, you’ll want to make a gradient that’s made up of your 4 shades. Practice making a gradient like the one above—then you can incorporate it into your drawing once you get the hang of it. [2] X Research source"
    },
    {
      "title": "Blend your shades together using a cotton swab.",
      "content": "Blend your shades together using a cotton swab. After experimenting with gradients, use a cotton swab or your finger to lightly blend the shades together to achieve a seamless, hyper-realistic sheen. [3] X Research source Make sure to wipe off your finger on a paper towel or use a new cotton swab between blending your gradient lines. If you don’t alternate your cotton swabs or wipe off your finger when blending your color gradients, you might drag the darker colors into the lighter ones, resulting in a less realistic blend."
    },
    {
      "title": "Apply a gold gradient to part of the object you’re coloring.",
      "content": "Apply a gold gradient to part of the object you’re coloring. Start at one side of the object, like we did in the vase above. Don’t worry about filling in the whole object yet—you’ll add more gradients as you go."
    },
    {
      "title": "Add another gradient next to the first one, reversing the order of the colors.",
      "content": "Add another gradient next to the first one, reversing the order of the colors. Once you’ve reached the middle of the object you’re filling in, reverse the color order starting with your second lightest shade, and work your way backward until you reach the opposite edge of the object, finishing with your darkest pencil shade. [4] X Research source Depending on the various shades you’ve chosen, your pattern should look something like this: Dark brown, light brown, yellow, white, yellow, light brown, dark brown, and so on, layering these shades until you fill your desired section entirely."
    },
    {
      "title": "Lightly blend your gradient layers together.",
      "content": "Lightly blend your gradient layers together. Using a cotton swab or your finger, lightly shade the color gradients in your art piece as you did on your practice gradient sheet to ensure a super realistic gold finish. [5] X Research source Don’t press down too hard when shading with your colored pencils, as the pigment colors will become more difficult to blend, and we don’t want it to look blocky."
    },
    {
      "title": "Go back in with a white colored pencil to enhance your gold’s gleam.",
      "content": "Go back in with a white colored pencil to enhance your gold’s gleam. To create a gold shade that nearly glints off the page, grab your white colored pencil and further shade in the lightest parts of your chosen object to add even more luster, like in the vase above. You can apply more pressure as you shade to saturate the white pigment on the page. [6] X Research source By going back in with your white pencil after blending, you’re creating more contrast in the gold gradient, resulting in the illusion of a shinier finish—magic!"
    }
  ]
}