{
  "url": "https://www.wikihow.com/Make-a-Soft-Boiled-Egg",
  "title": "How to Make a Soft Boiled Egg",
  "steps": [
    {
      "title": "Prick the end of your egg.",
      "content": "Prick the end of your egg. To prevent eggs from cracking and to make them easier to peel, gently prick the end of each egg. You can carefully use a small pin or tack to poke a very small indentation through the shell at the large end of the egg. Take care not to poke very far or the white will leak out of the egg. [1] X Research source You could also use something with a slightly rounded point to poke the egg. For example, you could use a wooden pestle. If you use this, just tap the larger end of the egg."
    },
    {
      "title": "Cover the eggs with cold water.",
      "content": "Cover the eggs with cold water. Put your eggs into a small saucepan and pour enough cold water to cover the eggs by 1-inch (2.5 cm). [2] X Research source If you want to cook more than 4 eggs, consider using a larger pot or cooking them in batches. This will ensure that you can remove the eggs quickly, so they won't overcook. Using a saucepan is the most common approach, but you can also boil an egg in an electric kettle if you don't have access to a stove."
    },
    {
      "title": "Bring the water to a boil and turn off the heat.",
      "content": "Bring the water to a boil and turn off the heat. Turn the heat on to medium-high and keep the lid off of the pan. Once the water begins to boil (bubble vigorously), turn off the heat and start your timer right away. [3] X Research source If you continue to boil the eggs over such a high-heat, they may bounce around in the pan and crack as they bump into each other. That's why it's important to turn off the heat (or simmer them gently if you're using a hot start method of cooking)."
    },
    {
      "title": "Cook the soft-boiled eggs to your liking.",
      "content": "Cook the soft-boiled eggs to your liking. You'll need to keep a close eye on the timer, since every minute makes a difference when boiling eggs. Leave the eggs in the hot water to get the desired consistency. Try cooking the eggs for: [4] X Research source 2 minutes to get a raw yolk and very soft egg white 4 minutes to get a really runny, thick yolk and set white 6 minutes to get a mostly set yolk and set white 8 minutes to get a tender, but set yolk and fully set white"
    },
    {
      "title": "Heat water in a saucepan.",
      "content": "Heat water in a saucepan. Place a saucepan on your stove and fill it with 2 to 3 inches (5 to 7.5 cm) of cold water. Turn the heat on to high, so the water boils. Turn the heat down a little, so the water rapidly simmers. [5] X Research source For a rapid simmer, the water should be bubbling gently, but not creating large bubbles all over the surface of the water."
    },
    {
      "title": "Place the eggs in the pan.",
      "content": "Place the eggs in the pan. Set your egg in a slotted spoon and gently lower it into the simmering water. If you're soft boiling several eggs, lower them in one at a time. You can cook up to four eggs at once. [6] X Research source If you want to soft-boil more than four eggs, cook them in several batches."
    },
    {
      "title": "Simmer the eggs.",
      "content": "Simmer the eggs. Start a timer, so you can perfectly boil the eggs. If you're cooking one or two eggs, you can use the following cooking times. But if you're cooking three or four eggs, add about 30 seconds to the times. Simmer the eggs for: [7] X Research source 5 minutes to get a runny yolk with a barely set white 6 minutes to get a barely setting yolk with a set white 7 minutes to get a softly set yolk with a set white"
    },
    {
      "title": "Serve the egg in a cup.",
      "content": "Serve the egg in a cup. Use a slotted spoon or wire strainer to scoop a soft boiled egg out of the hot water in your pan. Place the egg in an egg cup. You can place it pointy side up or down. The cup will prevent the egg from rolling around on your plate which will make it easier to eat. [8] X Research source If you don't have an egg cup, you can set the cooked egg in a shot glass, small bowl, or tea cup."
    },
    {
      "title": "Tap the egg to open it.",
      "content": "Tap the egg to open it. You can take a teaspoon and tap around the top of the egg. Use the spoon or a butter knife to cut and lift away the egg cap. You can also whack the top of the egg, but this could get shell into your soft-boiled egg if you use too much force. [9] X Research source You can also use tools designed to open soft-boiled eggs. These may look like small scissors, suction cups, bottle openers, or cigar cutters. They're made to easily slice off and remove the top cap of the egg."
    },
    {
      "title": "Serve Malaysian style soft-boiled eggs.",
      "content": "Serve Malaysian style soft-boiled eggs. Malaysian style eggs and toast is a popular breakfast in Malaysia and Singapore. Crack one soft-boiled egg into a small ramekin, so the soft yolk is contained. Use a soft-boiled egg with a very soft white. Pour a little soy sauce over the egg and serve it with toast. [10] X Research source You can also sprinkle the eggs with white pepper and serve the toast with coconut jam."
    },
    {
      "title": "Serve dippy egg and toast.",
      "content": "Serve dippy egg and toast. Soft boil an egg using the cold start method. Simmer the egg for exactly 4 minutes and then remove the egg using a slotted spoon. Set the egg in your egg cup and crack it open. Toast and butter a piece of bread to serve with the dippy egg. [11] X Research source To make classic toast soldiers, slice the toast into several long strips. You can dip the toast soldiers into the soft-boiled egg yolk."
    }
  ]
}