{
  "url": "https://www.wikihow.com/Get-Sleek-Hair",
  "title": "How to Get Sleek Hair",
  "steps": [
    {
      "title": "Limit hair brushing to twice a day.",
      "content": "Limit hair brushing to twice a day. Although brushing your hair promotes hair growth and shine, brushing it too much can cause damage and frizz. Stick to brushing your hair once in the morning and once at night or right before washing or styling to keep a sleek, straight look."
    },
    {
      "title": "Detangle wet hair with a wide-tooth comb.",
      "content": "Detangle wet hair with a wide-tooth comb. Wet hair is more prone to damage than dry hair, so it’s better to be safe than sorry when stepping out of the shower. When detangling wet locks, opt for a detangling brush with flexible bristles or a wide-tooth comb . [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Brush your hair before jumping in the shower to lessen the amount of tangles you’ll have after the wash. Use a detangling or leave-in conditioner spray before you comb wet hair to help knots smooth away."
    },
    {
      "title": "Sleep with a silk pillowcase.",
      "content": "Sleep with a silk pillowcase . Believe it or not, what you sleep on can make or break your waking look. Ordinary cotton pillowcases produce static, and this can cause your hair to frizz up at night. The smooth texture of a silk pillowcase gives your hair a buttery soft place to rest static-free."
    },
    {
      "title": "Try a weekly deep-conditioning treatment.",
      "content": "Try a weekly deep-conditioning treatment . Bring moisture and shine back into your hair by applying a deep-conditioner weekly. Not only will this help you achieve a healthy and sleek look, but it will restore and protect your hair strands, especially if you’re doing to be using heat tools to achieve a sleek hairstyle. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Get a trim every 4 to 8 weeks.",
      "content": "Get a trim every 4 to 8 weeks. If you have naturally straight hair, it’s best to trim it sooner rather than later. Keeping up with trims every month or so can help your locks stay sleek and smooth. Letting your hair go too long without a trim can cause the ends to naturally curl, drawing away from a smooth, sleek look."
    },
    {
      "title": "Brush dry hair with a boar hair bristle brush.",
      "content": "Brush dry hair with a boar hair bristle brush . These brushes are very gentle on your hair, making them ideal for everyday brushing. Along with being gentle, the boar hair bristles add shine and sleekness by redistributing the natural oils in your hair as you brush through it. [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Avoid hair brushes with nylon or plastic bristles for general hair brushing. These tend to cause breakage and hair damage."
    },
    {
      "title": "Use a flat paddle hair brush when blow drying.",
      "content": "Use a flat paddle hair brush when blow drying. [4] X Research source These brushes use a combination of boar hair and nylon bristles that’ll give your hair a smooth, glossy sheen. Plus, the flat design helps combat frizz and gives you a straight look. Avoid using round metal brushes when drying your hair to prevent breakage and damage."
    },
    {
      "title": "Invest in an ionic blow dryer.",
      "content": "Invest in an ionic blow dryer . [5] X Research source The ion technology behind these hair dryers allows them to dry your hair faster with the least amount of damage. The negative ions the dryer emits cause your hair cuticle to lay flat, which smooths out frizz and coarseness, resulting in straighter, shinier hair. Opt for an ionic dryer that comes with a nozzle attachment. This will help you direct and focus the hot air. Look for a dryer that’s at least 1500 watts. [6] X Research source"
    },
    {
      "title": "Get a high-quality ceramic flat iron.",
      "content": "Get a high-quality ceramic flat iron . Ceramic-plated flat irons straighten hair faster and more efficiently than other irons, and they are also the most gentle on hair. Look for one that's no wider than 1 1 ⁄ 2 inches (3.8 cm), since anything wider isn't ideal for straightening hair (the wider ones are better for styling hair). Ceramic flat irons are the best choice for those who have fine to normal hair. If you have thick, curly hair, opt for a gold or titanium-plated flat iron. If you have coarse hair, try a ceramic and titanium-plated flat iron."
    },
    {
      "title": "Wash your hair with smoothing shampoo and conditioner.",
      "content": "Wash your hair with smoothing shampoo and conditioner . [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Look for products that advertise as being “smoothing” and frizz-reducing and contain hydrating ingredients, proteins, and nourishing oils. These will give your hair a boost of moisture and encourage your hair to lay flat and look smooth. Check the labels for ingredients like Argan oil, keratin, avocado oil, vitamin E, Moroccan oil, and coconut oil. Avoid clarifying shampoos and conditioners, as these strip your hair of moisture and result in limp, dull hair. If you dye your hair, choose a straightening shampoo that includes sodium laureth sulfate and sodium lauryl sulfate ingredients. These will help preserve the color. [8] X Research source"
    },
    {
      "title": "Try a smoothing serum or oil before styling.",
      "content": "Try a smoothing serum or oil before styling. [9] X Research source These products are a must for those with dry or frizzy hair, but anyone hoping to get a sleek look can give them a try. Serums and oils smooth the hair cuticle, add shine, and protect your strands from environmental damage. [10] X Research source Look for serums with Argan or Moroccan oil and avoid those with a high percentage of alcohol. Alcohol can be very drying. Consider your hair type before using. If you have thin hair, you’ll need to use less product. If you have thick hair, you may need to use more. [11] X Research source"
    },
    {
      "title": "Use a heat protectant before styling with heat.",
      "content": "Use a heat protectant before styling with heat. Blow drying and straightening your hair with a flat iron can cause significant damage if you’re not using a product to protect it. [12] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021. Add a few spritzes to your hair before using heat tools to keep your hair happy and healthy. [13] X Research source Heat protectants can be used on wet hair, so make sure to spray some on your hair before blow drying. Look for heat protectants that also protect against humidity to tame frizzy strands."
    },
    {
      "title": "Add shine and prevent frizz with a finishing spray.",
      "content": "Add shine and prevent frizz with a finishing spray . These products are like an extra-strong hairspray, except they also add shine. Once you’re done styling, spray your hair with a finishing spray to lock everything in place. [14] X Research source Many of the “shine” finishing sprays on the market contain silicone, which is harmful, so look for versions that are silicon-free. [15] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021. If you can’t find a silicon-free finishing product, a light hold hairspray can do the trick, just minus the extra shine."
    },
    {
      "title": "Wash your hair with smoothing shampoo and conditioner.",
      "content": "Wash your hair with smoothing shampoo and conditioner. Do your shower routine as you normally would. After applying the conditioner, comb through your wet, conditioned hair with a paddle brush or wide-tooth comb to evenly distribute the product. Rinse until all the product is washed away. If you have long hair and want to avoid washing your hair daily, use dry shampoo in between washings to keep your locks fresh."
    },
    {
      "title": "Towel dry your hair with a microfiber towel and let it air dry.",
      "content": "Towel dry your hair with a microfiber towel and let it air dry. Pat your hair gently with the towel, working downwards. Then, go about your day or routine until your hair is about 80% dry. The friction that builds when rubbing hair with cotton or terrycloth towels can damage your locks and cause them to fluff up. Microfiber towels, on the other hand, prevent damage and control frizz because of their ultra-absorbent material. [16] X Research source Blow drying very wet hair is extremely damaging, and it can also cause your hair to become frizzy."
    },
    {
      "title": "Apply a smoothing serum to your damp hair.",
      "content": "Apply a smoothing serum to your damp hair. Place a small amount of product in your palms and comb through your hair. Start at the roots and work the product down to the ends for maximum smoothness. [17] X Research source"
    },
    {
      "title": "Spray your hair with a heat protectant.",
      "content": "Spray your hair with a heat protectant. This will add an extra layer of protection between your hair and any heat styling tools you use. Opt for a product that also combats frizz to keep everything sleek, even in the highest humidity."
    },
    {
      "title": "Blow dry your hair",
      "content": "Blow dry your hair with downward motions. Hold up the blow dryer with the nozzle facing down towards the ends of your hair. Start drying at the top of your head and moving to the ends. This will smooth your hair cuticles and keep the hair from fluffing up. Make sure to use the nozzle attachment on the hairdryer and your paddle brush with a mix of nylon and boar hair bristles when blow drying. [18] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021. Once your hair is dry, try blasting it with cool air using the blow dryer's cool setting for about 60 seconds for additional shine. [19] X Research source"
    },
    {
      "title": "Flat iron your hair",
      "content": "Flat iron your hair to smooth everything out. Separate your hair into 1 to 2 inches (2.5 to 5.1 cm) sections. Run the flat iron through your hair, starting near the root and moving down to the end. Work slowly, and don’t iron over the same section more than 2 to 3 times. [20] X Research source If you have thick or long hair, it may be easier to tie up each section and bring one down at a time. Make sure your hair is completely dry before straightening. If you hear a sizzle, stop and blow dry for a few more minutes before continuing. Adjust the heat setting on your flat iron to suit your hair type. If you have fine or damaged hair, set the temperature at 300- to 350-degrees. If you have coarse hair, use the 400-degree setting."
    },
    {
      "title": "Set your sleek look with a finishing spray.",
      "content": "Set your sleek look with a finishing spray. Once your hair has cooled down completely, lightly mist your hair with a smoothing finish spray to lock in your look and add an extra layer of shine. [21] X Research source Want to avoid a cloud of spray? Spray your brush with the finishing spray and gently run it through your hair. You can also run a smoothing serum through your hair again after straightening, but avoid using too much as this can make your hair look greasy."
    },
    {
      "title": "Wrap and pin damp hair",
      "content": "Wrap and pin damp hair around your head if you want to avoid heat styling. You can achieve a sleek, straight look overnight without using heat styling tools with a few pins and some patience. Simply wash your hair and let it air dry until it’s damp. Next, grab sections of hair and wrap them around the crown of your head, using bobby pins to hold them in place. Go to sleep, and pull out the pins in the morning for a straight hairdo. You can speed up the drying process by using the cold setting on you hairdryer. Wrap a silk scarf around your head to keep the hair and pins from shifting while you sleep."
    }
  ]
}