{
  "url": "https://www.wikihow.com/Fold-a-Paper-Into-Thirds",
  "title": "How to Fold a Paper Into Thirds",
  "steps": [
    {
      "title": "Start with your paper flat on your work area.",
      "content": "Start with your paper flat on your work area. Believe it or not, there are many ways to fold a paper into thirds, but some give more precise results than others. Try this method if you don't need to be exact — it's quick and it works well, but rarely will your results be perfect. On the plus side, you won't need any tools for this method. Note that a standard 8 1/2 × 11 inch (27.9 cm) sheet of paper doesn't have to be folded perfectly into thirds to fit in an envelope, making this a good choice for correspondence."
    },
    {
      "title": "Roll the paper into a loose cylinder.",
      "content": "Roll the paper into a loose cylinder. Your goal is to make a fat, loose roll from your paper — about the dimensions of a rolled-up newspaper. Don't make any folds yet."
    },
    {
      "title": "Align the edges, then gently flatten the middle.",
      "content": "Align the edges, then gently flatten the middle. Look at your cylinder from the side — you want one edge of the rolled-up paper to be on the left and the other to be directly across from it on the right. Start to compress the cylinder, adjusting as you go to keep the edges lined up. You want the three layers of paper created this way to be approximately the same size. For this, you'll want one edge of the paper snug against the inside of the fold of the cylinder and the other edge lying over the top, lined up with the other fold. This is more intuitive than it sounds."
    },
    {
      "title": "Flatten the cylinder completely when you have a near-fit.",
      "content": "Flatten the cylinder completely when you have a near-fit. When you see that your paper is as near to perfect thirds as you can realistically get it, press down on the edges of the paper to get smooth, clean creases. Congratulations! Your paper should be in (nearly) perfect thirds. At this point, you can make last-minute adjustments, but avoid making more than one crease unless your thirds are very uneven — this can look unprofessional."
    },
    {
      "title": "Fold a \"scratch\" piece of paper into rough thirds.",
      "content": "Fold a \"scratch\" piece of paper into rough thirds. This method sacrifices one piece of paper to help you get another piece just right. You'll need two pieces of paper for this method — one that you want to fold well and one that you don't mind ruining. Your two pieces of paper should be the same size. [1] X Research source Get your \"scratch\" paper into rough thirds any way you wish — you may want to use the \"intuitive\" method above or one of the others in this article. You can even use trial-and-error to get your folds right. [2] X Research source"
    },
    {
      "title": "Refold until the thirds are as precise as possible.",
      "content": "Refold until the thirds are as precise as possible. Now, make adjustments to your scratch paper until you have it folded into near-perfect thirds. Do not worry about how many times this takes or how many unsightly creases you make — this paper doesn't \"count.\""
    },
    {
      "title": "Use your scratch paper as a folding guide for the \"good\" paper.",
      "content": "Use your scratch paper as a folding guide for the \"good\" paper. Once you are satisfied with the folds in your scratch paper, take the now-folded blank sheet and line it up with the edge of the paper you want to fold well. [3] X Research source Use the scratch paper as a blueprint for the folds you make in your \"good\" sheet of paper. You can do this by marking the positions of the folds on the \"good\" paper or using your eyes to visually compare the two sheets."
    },
    {
      "title": "If desired, use a straight edge to assist.",
      "content": "If desired, use a straight edge to assist. If you want, you can take a straight edge (even something as simple as your envelope) and lay it over the two sheets to help you mark the folds from your scratch paper on your \"good\" paper. [4] X Research source If you're using a sturdy straight edge, you can even fold your \"good\" paper over it for precision. When you're done, save your \"scratch\" paper for note-taking or recycle it. Don't send perfectly good paper to a landfill."
    },
    {
      "title": "Fold one edge of the paper over the top of the sheet.",
      "content": "Fold one edge of the paper over the top of the sheet. This method of folding perfect thirds uses nothing more than the measuring power of the human eye to find the spots where your paper folds into thirds. Despite this, it's surprisingly effective. In fact, once you've practiced it a few times, you can probably get away with using it for important correspondence. To begin, you want to take one edge of the paper and double it up, bringing it across the top of the rest of the page. Don't make any creases yet — the edge you are about to fold should be gently rounded."
    },
    {
      "title": "Line the edge up so that it covers half of the space.",
      "content": "Line the edge up so that it covers half of the space. Try to line up the edge of the paper that you're holding so that it covers half of the paper that remains. The human eye is much better at judging halves than thirds, so it will be much easier to line up the paper correctly here than it would have been if you had attempted fold the paper into thirds from the beginning. When you have the edge of the page lined up just right , crease the paper, making sure not to let the free edge move as you're making your crease."
    },
    {
      "title": "Tuck the remaining edge into the crease and fold in half.",
      "content": "Tuck the remaining edge into the crease and fold in half. The hard part of this method is already done. Now, all that you need to do is make the final one-third fold. Do this by taking the other edge of the paper and tucking it under the top edge so that it is snug against the inside of the crease. Make a second crease. If you've made accurate folds, all of the edges of your paper should line up at this point. If they don't, feel free to make minor adjustments as needed."
    },
    {
      "title": "Fold the paper in half.",
      "content": "Fold the paper in half. This method uses techniques derived from origami , the Japanese art of paper-folding, to get perfect third folds. [5] X Research source Though origami is usually done with square sheets of paper, this method should also work with standard 8 1/2 × 11 inch (27.9 cm) paper like you'd find in an office. Start by folding your paper in half in the same direction you'd like to fold it into thirds. Note: If you don't want to make extra folds in your paper, you can find the midpoint of the paper and carefully mark a line across to divide the paper in half. If you do this, however, your line will need to be extremely straight to match the accuracy of a simple half-fold."
    },
    {
      "title": "Draw a line from the bottom left to the right side of the half-fold.",
      "content": "Draw a line from the bottom left to the right side of the half-fold. Position your paper so that the half fold you just made goes from left to right. Use a straight edge to carefully draw a line from the bottom left to the point where the fold in the middle meets the right edge of the paper. You can also do this method with a line that extends from the bottom right corner if you reverse all of the directions after this, but for convenience's sake we've decided to just give a single set of directions."
    },
    {
      "title": "Draw a line from the top left to the bottom right.",
      "content": "Draw a line from the top left to the bottom right. Use your straight edge to carefully draw a line from the very top left corner of the paper to the bottom right. This line should intersect your middle fold at its center and your first line somewhere on the right side of the page."
    },
    {
      "title": "Make one fold at the intersection of your two lines.",
      "content": "Make one fold at the intersection of your two lines. The spot where your two lines intersect marks one of the third folds you need to make. Use a straight edge to draw a line that passes through this point and also intersects both edges of the paper at 90 degree angles. Carefully fold and crease along this edge. The folded edge should divide the rest of the paper into halves — if it doesn't, you may need to make minor adjustments at this point so that it does."
    },
    {
      "title": "Make the second fold by tucking the other side of the paper in.",
      "content": "Make the second fold by tucking the other side of the paper in. Finally, take the non-folded edge of the paper and tuck it underneath the folded edge. Make a second crease when it is snug against the inside of your first crease. Your paper should now be divided into thirds."
    },
    {
      "title": "Measure the length of one side.",
      "content": "Measure the length of one side. Have the methods above left you unsatisfied by the preciseness of your folds? Try following the steps in this section, which should give you folds that are as close to exact as you can reasonably hope to be. You'll need a measuring tool (like a ruler ) and a calculator or some scratch paper for this method. Start by measuring the length of the side you want to make folds in."
    },
    {
      "title": "Divide this length by three.",
      "content": "Divide this length by three. Doing this will give you the width of each of your thirds. For instance, if you're using a standard 8 1/2 × 11 inch (27.9 cm) piece of paper and you want to divide it into thirds along the 11 inch (27.9 cm) side, simply divide 11 by 3. 11/3 = 3 2/3 or 3.667 . This means the folds should be 3 2/3 inches apart."
    },
    {
      "title": "Mark this distance, measuring from the edge of the paper.",
      "content": "Mark this distance, measuring from the edge of the paper. Using your measuring tool, mark the spot that is the distance you determined above from the edge of the paper. Again, you should be measuring along the side of the paper that you plan to fold. In our example above with the 8 1/2 × 11 inch (27.9 cm) paper, we would measure 3 2 ⁄ 3 inches (9.3 cm) along the 11 inch (27.9 cm) side and mark this distance."
    },
    {
      "title": "Make a crease at this point, then fold the remaining flap of paper over.",
      "content": "Make a crease at this point, then fold the remaining flap of paper over. Make a fold through your marking that is perpendicular to both edges of the paper. This is one of your third folds. The second is easy — just tuck the other edge of paper under so that it is snug against the inside of the first crease (exactly as in the sections above.)"
    }
  ]
}