{
  "url": "https://www.wikihow.com/Do-Bicycle-Crunches",
  "title": "How to Do Bicycle Crunches",
  "steps": [
    {
      "title": "Lie flat on the floor and lace your hands behind your head.",
      "content": "Lie flat on the floor and lace your hands behind your head. [1] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021. Spread your elbows wide as you bring your hands behind your head. Lightly touch the back of your head with your fingers and palms. [2] X Research source Try to relax as you look straight up at the ceiling so you're not holding tension in your shoulders. [3] X Research source If it's more comfortable, you can lie on a lightly cushioned surface. For example, lie down on a yoga mat or carpeted floor. If you keep your elbows tucked in, your crunches won't engage your oblique muscles as well. Avoid interlacing your fingers because you'll be more likely to pull on your neck. This can cause muscle strain or fatigue."
    },
    {
      "title": "Bend your knees up at a 90-degree angle.",
      "content": "Bend your knees up at a 90-degree angle. Keep your feet planted on the floor as you bring your knees up so they form the peak of a triangle. Your feet should be flat and about shoulder-width apart on the floor. [4] X Research source Your knees shouldn't be knocking together once they're at a 90-degree angle. Instead, keep space between them."
    },
    {
      "title": "Lift your legs up and away from your body.",
      "content": "Lift your legs up and away from your body. Once your knees are bent, lift your feet up so your legs are extended and slightly bent at the knee. Avoid straightening your legs so much that your hamstrings feel tight. [5] X Research source"
    },
    {
      "title": "Bring your right knee to your chest and touch your left elbow to it.",
      "content": "Bring your right knee to your chest and touch your left elbow to it. [6] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021. Twist your torso as you draw in your knee. At the same time, rotate your left elbow to touch your right knee. [7] X Research source Your shoulder blades should be raised off the floor so your abs are getting stretched instead of your arms."
    },
    {
      "title": "Alternate the crunch by touching the other knee with the opposite elbow.",
      "content": "Alternate the crunch by touching the other knee with the opposite elbow. [8] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021. Release the crunch and bring your other knee in towards your chest as you touch the opposite elbow to it. Extend the leg that's not tucked in so it's pushed away from your body as though you're pedaling a bike. [9] X Research source Once you get the hang of it, you can smoothly rotate your torso as your elbows touch alternating knees."
    },
    {
      "title": "Aim for 15 to 20 crunches per set.",
      "content": "Aim for 15 to 20 crunches per set. If you're just starting out with bicycle crunches try to do 1 to 2 sets. Then, work your way up to at least 3 or 4 sets of 15 to 20 crunches for a more challenging workout that builds your abs. [10] X Research source It's okay to adjust the number of crunches you perform for each set. For example, you might prefer to start with 10 crunches per set."
    },
    {
      "title": "Stand instead of lie down for an easier way to do the bicycle crunch.",
      "content": "Stand instead of lie down for an easier way to do the bicycle crunch. If you feel uncomfortable when you lie on the ground and twist, stay in a standing position. Then, twist your waist and bring the elbow of your arm to the knee of your opposite leg. Lift that leg while you twist to mimic the movements of the bicycle crunch. [11] X Research source Repeat this crunch in the opposite direction."
    },
    {
      "title": "Keep your knees bent instead of peddling them for a simpler crunch.",
      "content": "Keep your knees bent instead of peddling them for a simpler crunch. If the traditional bicycle crunch is too hard on your torso, try leaving your feet on the ground so your knees form a 90-degree angle. Then, follow the rotation portion of the crunch so you bring your elbow to the opposite knee. [12] X Research source Remember to keep your fingers loose instead of locking them so you don't pull on your neck. Reader Poll: We asked 147 wikiHow readers which type of crunches they found most effective for building ab muscles, and 54% of them said elbow-to-knee crunches. [Take Poll]"
    },
    {
      "title": "Lie on a bench to do bicycle crunches for a more challenging workout.",
      "content": "Lie on a bench to do bicycle crunches for a more challenging workout. To do an elevated bicycle crunch, lie with your back on an exercise bench so your legs are hanging over both sides. Then, pull a knee up towards your chest as you bring your opposite elbow towards the knee. Remember to leave one of your legs touching the floor as you do the crunch. [13] X Research source The elevated bicycle crunch is more of a workout for your core muscles since you're doing a deeper stretch."
    },
    {
      "title": "Do the bicycle crunch on a half-dome balance ball for an intense stretch.",
      "content": "Do the bicycle crunch on a half-dome balance ball for an intense stretch. Place the flat side of the half-dome ball on the floor and sit on it. Then, lean back so your lower back is supported by the domed part of the ball. Plant your feet on the floor before you perform the bicycle crunch. [14] X Research source This will probably feel like a difficult workout because you'll be using your muscles to balance while performing the crunch."
    }
  ]
}