{
  "url": "https://www.wikihow.com/Fix-a-Leaking-Refrigerator",
  "title": "How to Fix a Leaking Refrigerator",
  "steps": [
    {
      "title": "Pull off the grille at the bottom of the refrigerator.",
      "content": "Pull off the grille at the bottom of the refrigerator. In most cases, you can simply pull straight out to remove the grille. Some refrigerators, though, use 2-4 screws to hold the grille in place. In this case, use a screwdriver. [1] X Research source Consult the product manual if you’re having trouble removing the grille."
    },
    {
      "title": "Slide out and inspect the drain pan.",
      "content": "Slide out and inspect the drain pan. The pan is generally square or rectangular in shape and somewhere around 10 × 10 × 2 in (25.4 × 25.4 × 5.1 cm) in size. Slowly slide it straight out from under the fridge, as it likely has some water in it. Look for any cracks, holes, warping, or other signs of damage. [2] X Research source The drain pan collects condensate from the freezer compartment of the appliance. When the fridge is operating properly, the collected water will evaporate before the pan comes close to filling. If the pan is full or overflowing, the fridge may not be leveled properly, there may be a water line leak, or there may be another issue with the fridge. Try the other troubleshooting measures described in this article, then call a appliance repair technician if needed."
    },
    {
      "title": "Replace a damaged drain pan with an exact match.",
      "content": "Replace a damaged drain pan with an exact match. Take the drain pan with you to a home improvement store and see if you can find an exact match. If not, check the fridge manufacturer’s website for replacement information. You may be able to order a replacement pan directly from them, or get a part number that you can use to find the correct replacement pan online. [3] X Research source If you can’t get the replacement pan within a few hours, slide the old pan back in place for the time being. Once you get the right replacement pan, slide it into place and pop the grille back on. With any luck, your leaky fridge will be fixed!"
    },
    {
      "title": "Check the fridge’s horizontal positioning with a spirit level.",
      "content": "Check the fridge’s horizontal positioning with a spirit level. Position the level side-to-side on the fridge’s interior floor. If necessary, pull out one or both of the crisper drawers at the bottom so you can access the interior floor. Don’t put the level on one of the shelves—unless it’s just not possible to access the interior floor—since these may be slightly out of level on their own. [4] X Research source For optimum performance, the fridge should be completely level from side to side. A simple spirit level (also called a carpenter’s level), which uses a bubble encased in a tube of liquid, is ideal for this task."
    },
    {
      "title": "Turn the level front-to-back and confirm the fridge leans back slightly.",
      "content": "Turn the level front-to-back and confirm the fridge leans back slightly. The back of the fridge should be 0.25–0.5 in (0.64–1.27 cm) lower than the front, as this aids both in drainage and in keeping the door closed tightly. If the bubble in the level is halfway inside and halfway outside of the near-side line on the tube that denotes perfect leveling, the fridge is probably leaning back properly. [5] X Research source When the level is in fact level, the bubble should be centered between the level lines like this: |o| When the level is slightly out of level to show that the fridge is leaning back properly, the bubble and level lines should look more like this: | ф If possible, check the fridge’s product guide for the ideal amount of drop from front to back."
    },
    {
      "title": "Remove the grille from the bottom front of the appliance.",
      "content": "Remove the grille from the bottom front of the appliance. In most cases, giving the grille a good pull should pop it out of place. Some fridges, though, may use screws to secure the grille in place. Once the grill is out of the way, you’ll be able to see the 2 front legs of the refrigerator. [6] X Research source Check the product guide if you’re having trouble figuring out how to remove the grille."
    },
    {
      "title": "Turn the adjustable legs and use your level to position the fridge correctly.",
      "content": "Turn the adjustable legs and use your level to position the fridge correctly. Adjust the jaw of a crescent wrench so it fits snugly over one of the legs. Turn the leg clockwise to shorten it and counterclockwise to lengthen it. Repeat on the other side so the legs match. In most cases, you’ll be able to make the necessary adjustments with just the front legs. [7] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. For example, if the fridge isn’t leaning back enough, lifting the front legs evenly should do the trick. Regularly use your level to confirm that the fridge’s interior floor is level from side-to-side and sloped from front-to-back. If the fridge isn’t level side-to-side, unplug the appliance and recruit a strong friend to help you slide it out so you can access the rear legs. The rear legs adjust in the same way as the front legs, so fine-tune all 4 legs until the fridge is completely level from side-to-side and leans back slightly. [8] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020."
    },
    {
      "title": "Move any food items that are blocking airflow to the defrost drain in the freezer.",
      "content": "Move any food items that are blocking airflow to the defrost drain in the freezer. Practically every refrigerator model has a defrost drain located along the bottom of the back wall of the freezer compartment. It may be shielded by a piece of plastic to prevent debris from falling in, but it’s usually easy to locate. If you have a lot of frozen food items covering or blocking in the drain, do some rearranging to improve the airflow. [9] X Research source Create an open column from the drain to the ceiling, and an open path from the back to the front of the ceiling. Proper airflow helps prevent the drain line from freezing up. Consult the product manual if you need help finding the defrost drain."
    },
    {
      "title": "Empty the freezer and expose the drain if the fridge still leaks after 2-3 days.",
      "content": "Empty the freezer and expose the drain if the fridge still leaks after 2-3 days. If you’re still getting water puddles 2-3 days after improving the airflow to the defrost drain, empty the freezer completely and move everything to ice chests. Then, pull off the plastic cap (if your model has one) that covers the defrost drain. [10] X Research source Don’t worry about emptying the main refrigerator compartment at this point. The food in there will stay at a safe temperature for 4 hours without power. [11] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Unplug the fridge and squirt hot tap water down the defrost drain.",
      "content": "Unplug the fridge and squirt hot tap water down the defrost drain. After you unplug the fridge, fill a cup with hot tap water, then draw some of it up into a turkey baster—which is a long plastic bulb syringe that typically holds around 2 fl oz (59 ml) of liquid. Put the tip of the baster into the drain opening and squeeze the hot water down the drain. Repeat 1-2 more times, then refill the freezer compartment with your food and plug the appliance back in. [12] X Research source The hot water should melt any ice in the drain line and break loose any minor clogs. Look for a turkey baster at any kitchen supply store or online."
    },
    {
      "title": "Check the fridge’s drain pan several times for excess water accumulation.",
      "content": "Check the fridge’s drain pan several times for excess water accumulation. The water from the baster will end up in the drain pan under the fridge. Due to the added water, you should check and empty (as needed) the drain pan 1-2 times per day over the next 2-3 days. Pop the cover off the grille at the bottom of the fridge, slide out the pan, and empty it into the sink if it’s more than one-third full. [13] X Research source If you don’t see excess water in the drain pan, the drain line must still be clogged, in which case you should move on to the next step—pulling out the fridge. Use your product manual for more specific information on emptying your drain pan. You can also check out the drain pan section of this article."
    },
    {
      "title": "Find the drain line and check valve behind the fridge if the problem isn’t fixed.",
      "content": "Find the drain line and check valve behind the fridge if the problem isn’t fixed. If hot water won’t break up the clog, resort to manual methods. Unplug the fridge and have a friend help you slide it out from the wall. Use the product manual (whenever possible) to help you identify the plastic drain line that runs from the base of the freezer compartment to the bottom of the appliance. You’ll also see a plastic check valve (one-way valve) near the bottom of the drain line. [14] X Research source Don’t confuse the drain line with the water supply line that runs to your ice maker. The latter won’t connect to the underside of the fridge."
    },
    {
      "title": "Clean out and replace, if needed, the check valve and/or drain line.",
      "content": "Clean out and replace, if needed, the check valve and/or drain line. If you don’t see any blockages in the clear plastic drain line, pull the check valve free from the drain line. Use a pipe cleaner or unbent paperclip to dislodge any blockages you see inside the check valve. If you can’t break the blockage free, take the valve to a home improvement store and buy a matching replacement. Install the cleaned or replaced check valve. [15] X Research source If you do see stubborn blockages in the drain line, pull it free and buy a matching replacement at the home improvement store. Most drain lines install by pushing the tube firmly over the connection points, but check your product manual for specific instructions."
    },
    {
      "title": "Unplug the fridge and pull it away from the wall.",
      "content": "Unplug the fridge and pull it away from the wall. Refrigerators are quite heavy, especially when filled with food, so grab a friend to help you. So long as you can conduct your repairs within 4 hours, don’t worry about emptying the refrigerator or freezer compartments. [16] X Research source With the door closed, refrigerated foods will stay at a safe temperature for approximately 4 hours. Frozen foods will keep for roughly 24-48 hours (the fuller the freezer is, the longer the food will keep). [17] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Inspect the water supply line or lines at the back of your fridge.",
      "content": "Inspect the water supply line or lines at the back of your fridge. If you have an ice maker, ice and/or water dispenser, or both, you’ll see one or more supply lines that connect your fridge to your household water supply. In most cases, the supply line or lines are made of clear flexible plastic. Look for drips, dribbles, leaks, cracks, pinholes, or any other signs of leakage or damage. [18] X Research source Alternatively, your water supply line(s) may be made of non-translucent flexible plastic or, in some cases, braided metal."
    },
    {
      "title": "Tighten the connection points if that’s where you see evidence of a leak.",
      "content": "Tighten the connection points if that’s where you see evidence of a leak. Many water supply lines are held in place with clamps that you can tighten by twisting a screw clockwise with a screwdriver. In this case, tighten the connections and check back for any signs of leaks after 1 hour. [19] X Research source Check your product manual for specific details regarding how your water lines connect to the fridge."
    },
    {
      "title": "Turn off the water supply to the supply line if you still see leaks.",
      "content": "Turn off the water supply to the supply line if you still see leaks. If tightening the connections doesn’t help, or if the leak is somewhere along the supply line, move on to shutting off the water supply. Locate the point where the water supply line connects to your household water supply piping—this may be located behind the fridge, in the basement right below the fridge, or somewhere else nearby. Rotate the shutoff valve clockwise in order to turn off the water supply. [20] X Research source"
    },
    {
      "title": "Replace the water line yourself only if you’re confident in your ability to do so.",
      "content": "Replace the water line yourself only if you’re confident in your ability to do so. There are a lot of variables here, based on the type of supply line, refrigerator model, type of connection to the household water supply, and so on. If you have the product manual and feel confident that you know how all the connections work, disconnect the supply line and take it to a home improvement store to buy a matching replacement. Then, reinstall the new water line using the same procedure, turn on the water, and check for leaks. [21] X Research source Doing this job improperly can lead to major water damage, so call in a professional plumber or appliance repair technician if you’re not completely sure you can handle it yourself. In this case, keep the water supply turned off, slide the fridge back into place, and plug it in. You can still use the fridge and freezer, just without the ice maker or water/ice dispenser for the time being."
    }
  ]
}