{
  "url": "https://www.wikihow.com/Get-Emo-Hair",
  "title": "How to Get Emo Hair",
  "steps": [
    {
      "title": "Give yourself a deep side part.",
      "content": "Give yourself a deep side part. Many emo hair styles start with a deep side part. Hold a comb up at the outside of your eyebrow, then slide the comb through your hair from your hairline to the crown of your head. Comb your hair on either side of the part and use hairspray to hold your hair in place. [1] X Research source If you have long bangs, part them so they'll fall over one eye."
    },
    {
      "title": "Use bobby pins to get the look of bangs if you don't have them.",
      "content": "Use bobby pins to get the look of bangs if you don't have them. After you part your hair, take the front section of your hair and comb it slightly forward to it falls across your forehead. Sweep the hair to the side so it looks like long bangs, then use bobby pins near your ear to hold the hair in place. [2] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020."
    },
    {
      "title": "Wear your hair super-straight or wavy with straight bangs.",
      "content": "Wear your hair super-straight or wavy with straight bangs. Most emo hair is worn straight to emphasize the choppy layers. If your hair is naturally curly or wavy, you can straighten your hair with a flat iron . [3] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. You can also wear it natural and only straighten your bangs."
    },
    {
      "title": "Backcomb your hair",
      "content": "Backcomb your hair to get extra volume at the top. Lift a section of your hair, then comb it backwards towards the roots. Do this several times until you see a visible lift in your hair. Carefully smooth the very top layer of your hair over the backcombed section, then hairspray it to hold it in place. You can also purchase a root volumizer at a drug store or beauty supply store to help you get more lift. These are usually a powder or foam that you apply to the roots of your hair. Backcombing damages your hair and makes it more susceptible to tangling, so do not do this regularly."
    },
    {
      "title": "Use cute hair accessories if you want.",
      "content": "Use cute hair accessories if you want. Emo hairstyles are often accented with colorful plastic barrettes. Popular barrette styles include brightly-colored bows and plastic skulls. Wear them clipped into your bangs or just above your ear. [4] X Research source"
    },
    {
      "title": "Experiment with your hair color.",
      "content": "Experiment with your hair color. Most emo kids dye their hair black or bleach it platinum blonde, usually with some brightly-colored accents mixed in. [5] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Some popular color combinations are black with blue or red streaks and blonde with pink streaks or darker horizontal stripes, known as “coon tails.\" Don’t feel pressured to do this, though — plenty of emo kids embrace their natural hair color. If you’ve never dyed your hair before, consider visiting a salon to have it professionally done. If you want to dye your hair at home , make sure you carefully follow all packaging instructions. To get the look without the commitment, try colorful clip-on extensions or temporary hair color like hair chalk or colored hair spray."
    },
    {
      "title": "Study inspiration photos so you’ll know what look you’re going for.",
      "content": "Study inspiration photos so you’ll know what look you’re going for. Pay attention to what you like about different haircuts. Look at where the layers originate, and picture how this would translate to your own hair. Keep the pictures handy as you’re cutting."
    },
    {
      "title": "Wash and dry your hair before you cut.",
      "content": "Wash and dry your hair before you cut. Wet hair is longer than dry hair, since it’s pulled down by the weight of the water. This means if you try cutting wet hair, you’ll probably end up with a style that’s shorter than you wanted. Start cutting on clean, dry hair for the best results. [6] X Research source"
    },
    {
      "title": "Use good haircutting scissors.",
      "content": "Use good haircutting scissors. Now’s not the time to pull out your craft scissors. Invest in a decent pair of haircutting scissors from a beauty supply store. Professional scissors can be over $100, but you should be fine with a pair in the $15-$20 range. [7] X Research source"
    },
    {
      "title": "Have at least two mirrors.",
      "content": "Have at least two mirrors. You’ll need to be able to see the front and back of your hair, so have a mirror in front of you and one behind you. If you have more mirrors available, set them up so you can clearly see the sides of your hair."
    },
    {
      "title": "Part your hair into several sections.",
      "content": "Part your hair into several sections. Comb your hair so that it’s parted how you plan to wear your hair. Section out your bangs and clip or pin them so they’re out of your way. Next, separate out sections of your hair to become layers. Use your inspiration photos to determine how many layers you want and where they should begin."
    },
    {
      "title": "Trim your hair using the points of the scissors.",
      "content": "Trim your hair using the points of the scissors. It can be tempting to cut straight across to get that blunt emo look, but this can make it hard to blend the layers. Hold your scissors so the point goes upwards into your hair and make small cuts across the layer. [8] X Research source You can also use a straight razor to cut your hair into blunt layers. Hold the razor at a 45 degree angle to your hair and only cut a little at a time. [9] X Research source"
    },
    {
      "title": "Cut a little at a time.",
      "content": "Cut a little at a time. You can always cut more as you go, but you can't make the hair longer if you accidentally cut too much. Cut your hair a little longer than you think you want it, then take off a little more until you reach your desired length. [10] X Research source Leave some of the bottom layers extra long to get an authentic emo look."
    },
    {
      "title": "Cut your bangs so they hit at about your cheekbones or your chin.",
      "content": "Cut your bangs so they hit at about your cheekbones or your chin. Emo bangs are usually long, so plan for them to fall below your eyes. Use the same technique as you did for cutting your layers. If you plan on teasing your bangs, you might want to leave them a little longer to account for the extra volume. [11] X Research source"
    },
    {
      "title": "Bring inspiration pictures.",
      "content": "Bring inspiration pictures. Even the coolest stylist might not know exactly what you have in mind when you say “emo hair,\" especially since that term can cover a variety of looks. Cut out pictures from magazines or show your stylist pictures on your phone so they’ll know the look you’re going for. [12] X Research source Nowadays, the emo style is being brought back by the kids from the 2000s, and the idea is usually to make it more subtle and suited for adults and workplaces, while also incorporating elements that reflect your personality and preferences. [13] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Take that in account when going to the salon."
    },
    {
      "title": "Request long, side-swept bangs to get a signature emo style.",
      "content": "Request long, side-swept bangs to get a signature emo style. Bangs are a trademark of emo style. Ask your stylist to give you long, razor-cut bangs that start from a deep part on one side."
    },
    {
      "title": "Ask for a razor cut for blunt layers.",
      "content": "Ask for a razor cut for blunt layers. Your stylist can create blunt, choppy layers by cutting your hair with a straight razor. Razor cutting can cause split ends on your hair, so ask your stylist to use a brand-new razor on your hair to minimize damage. [14] X Research source"
    },
    {
      "title": "Ask your stylist to thin out the bottom 3–4 inches (7.6–10.2 cm) of your hair.",
      "content": "Ask your stylist to thin out the bottom 3–4 inches (7.6–10.2 cm) of your hair. Emo styles generally have a lot of volume on top and taper down at the bottom. Ask your stylist to use thinning shears to thin out the bottom few inches of your hair to really emphasize your layers. [15] X Research source"
    },
    {
      "title": "Return for a trim every 4-6 weeks.",
      "content": "Return for a trim every 4-6 weeks. Since you’ll be sporting short layers and heavy bangs, it’s best to get a trim every 4 weeks. You can get away with waiting up to 6 weeks, but split ends and grown-out bangs will start making your emo hair look sloppy if you wait much longer than that. [16] X Research source"
    }
  ]
}