{
  "url": "https://www.wikihow.com/Defrost-Rice",
  "title": "How to Defrost Rice",
  "steps": [
    {
      "title": "Put the frozen rice in a microwave-safe bowl that has a lid.",
      "content": "Put the frozen rice in a microwave-safe bowl that has a lid. Plastic wrap, plastic bags, and some containers can melt and degrade inside the microwave. You need to transfer the rice out of any non-microwavable packaging and put it in a microwave-safe bowl. [2] X Research source If you packed your rice in individual portions using plastic wrap, unwrap your desired amount and place the frozen rice in a microwave-safe bowl that has a lid. If you froze your rice in a container that is not microwave safe, simply run the outside of the container under hot water for a few seconds. The hot water will help the frozen rice dislodge from the container. Then transfer the frozen rice into a container that is microwave safe."
    },
    {
      "title": "Place the lid on top of the bowl but do not snap it closed.",
      "content": "Place the lid on top of the bowl but do not snap it closed. You want the lid to just rest on the top of the bowl, so it can help generate steam within the bowl and defrost the rice. If you snap the lid shut, it might pop off when microwaving or prevent your rice from defrosting properly. [3] X Research source"
    },
    {
      "title": "Microwave the rice in one minute intervals, fluffing it after each minute, until it's thawed.",
      "content": "Microwave the rice in one minute intervals, fluffing it after each minute, until it's thawed. Breaking up the softening mound of rice with a spoon and fluffing it will help it defrost faster. Continue to microwave and fluff the rice at 1-minute intervals until the rice is completely defrosted. [4] X Research source If you are defrosting a large amount of rice, you can increase the intervals to 2 minutes, but try not to go longer than that. You don’t want your rice to dry out while microwaving."
    },
    {
      "title": "Add 1 tablespoon (15 mL) of water to moisten the rice if it seems dry.",
      "content": "Add 1 tablespoon (15 mL) of water to moisten the rice if it seems dry. You can add more water throughout the microwaving process if needed, but be careful not to add too much water at once. Frozen rice tends to trap moisture. You do not want to add more water than necessary, otherwise, it might make the rice have a pasty texture. [5] X Research source"
    },
    {
      "title": "Let the defrosted rice rest in the lidded bowl for 10 minutes.",
      "content": "Let the defrosted rice rest in the lidded bowl for 10 minutes. This will ensure that any remaining frozen or cold clumps of rice will heat evenly. Just don’t let your rice sit for a long period of time. After sitting at room temperature for an hour, the rice will begin to grow harmful bacteria. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Place the frozen rice in the refrigerator.",
      "content": "Place the frozen rice in the refrigerator. If you are defrosting multiple containers or bags of frozen rice, spread the packages out in the refrigerator. Stacking the containers or bags will prevent the rice from defrosting properly. Defrosting rice in the refrigerator is simple, but can take several hours to do. [7] X Research source Do not try and speed up the defrosting process by leaving the frozen rice out on the counter. Rice can easily grow bacteria that will make you sick if it is left out at room temperature for more than an hour. [8] X Research source The packaging you used to freeze the rice in might not be waterproof. To avoid having a puddle of water in your fridge, place a paper towel or a plate under the frozen rice. [9] X Research source"
    },
    {
      "title": "Let the rice thaw in the refrigerator for 12 to 24 hours.",
      "content": "Let the rice thaw in the refrigerator for 12 to 24 hours. The rice should be partially defrosted after resting in the refrigerator for 12 hours. Periodically break up any large clumps with a spoon to help speed up the defrosting process. You will know when the rice is completely defrosted, as you will easily be able to fluff it with a spoon. [10] X Research source If you want, you can finish defrosting the rice in the microwave after letting it partially thaw in the refrigerator for 12 hours. You would not need to add any water for the microwaving process. Since the rice has been defrosting in the refrigerator, it has retained more of its moisture. Simply transfer the rice into a microwave-safe bowl, and heat for 1-minute intervals until it is completely defrosted and steaming. [11] X Research source"
    },
    {
      "title": "Eat the rice within 2 to 3 days.",
      "content": "Eat the rice within 2 to 3 days. Once completely thawed, you can leave the rice in the refrigerator for 2 or 3 more days. When you are ready to eat it, just reheat it in the microwave for 1 minute or until it is steaming hot. [12] X Research source Once you reheat the rice in the microwave, you should not reheat it again. Continuously reheating the same batch of rice in the microwave can cause it to grow harmful bacteria. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Put the container of frozen rice into a plastic bag.",
      "content": "Put the container of frozen rice into a plastic bag. You do want the water to permeate the container or bag the rice is frozen in, as the water will make the rice soggy. If sealed well, the plastic bag will act as a second layer of defense against the water. [14] X Research source If you are defrosting multiple packages of rice, place each package into an individual plastic bag."
    },
    {
      "title": "Put a large pot in your sink and place the bag of frozen rice in the pot.",
      "content": "Put a large pot in your sink and place the bag of frozen rice in the pot. The pot should be wide enough and tall enough so the bag of frozen rice can sit comfortably in it. This is especially true if you are defrosting multiple packages of rice. If you overstuff the pot, the rice will not thaw properly. [15] X Research source"
    },
    {
      "title": "Fill the pot with cold water.",
      "content": "Fill the pot with cold water. The cold water will give the rice a chance to defrost without being exposed to the temperate air. If the water is not cold, harmful bacteria can begin to grow on the rice. [16] X Research source It is important that the water remains cold within the pot. If the air is warm, you can allow the cold water to trickle into the pot continuously to maintain the cold temperature during the defrosting process."
    },
    {
      "title": "Check on the rice every 10 minutes to see if it is defrosted.",
      "content": "Check on the rice every 10 minutes to see if it is defrosted. You can check it by removing it from the packaging, and fluffing it with a spoon to see if there are frozen clumps. If the rice is still frozen, place it back inside the packing and set it in the pot for another 10 minutes. A single package of rice should be defrosted within 20 to 30 minutes. If there are multiple packages in the pot, it could take up to an hour to defrost all of the rice."
    },
    {
      "title": "Eat the rice within a day of defrosting it in the water bath.",
      "content": "Eat the rice within a day of defrosting it in the water bath. Remove the wet packaging once the rice is defrosted. The defrosted rice can be heated in the microwave at 1-minute intervals until it is hot enough to eat, or it can be stored in the refrigerator until you are ready to serve your meal. Rice that is defrosted in a water bath should be eaten within a day of defrosting to prevent bacteria growth. [17] X Research source"
    }
  ]
}