{
  "url": "https://www.wikihow.com/Dress-for-60-Degree-Weather",
  "title": "How to Dress for 60 Degree Weather: 10 Stylish Outfits",
  "steps": [
    {
      "title": "Thin layers provide warmth without adding bulk.",
      "content": "Thin layers provide warmth without adding bulk. [1] X Expert Source Kathi Burns, CPO® Board Certified Professional Organizer Expert Interview. 31 December 2019. 60 degrees isn't really cold, but it's not exactly warm either. Dress in several thin layers , starting with a tank, that you can gradually remove without taking away too much warmth or coverage. Basic: a tank top, a tee, and a light sweater with jeans and flats or sneakers Casual: a tank top, a tee, and a hoodie with leggings or joggers and sneakers Dressy: a tank top, a tee, and a light sweater with tailored trousers and heels or boots"
    },
    {
      "title": "This look is comfortable in mild weather and never goes out of style.",
      "content": "This look is comfortable in mild weather and never goes out of style. If you had to find the perfect transitional look, this would be it. You can dress it up or down easily. If you're cold, you can easily add a sweater or jacket over top without really changing the overall look. [2] X Research source Basic: jeans and a button-down with loafers or ballet flats Casual: jeans and a button-down, more relaxed fit, with sneakers Dressy: tailored button-down with French cuffs tucked into jeans with heels and statement jewelry"
    },
    {
      "title": "The shacket (shirt-jacket) gives you more options in mild weather.",
      "content": "The shacket (shirt-jacket) gives you more options in mild weather. While the shacket is a trendier piece, it's versatile enough to look like it's here to stay, so you'll be able to keep it for more than one season. And it gives you an extra layer of warmth so you can go ahead and break out those shorts, even in early spring. [3] X Research source Basic: plaid shacket over a tee with jeans shorts and loafers, boat shoes, or ballet flats Casual: solid shacket over a tee with athletic shorts and sneakers Dressy: solid shacket over a shell with tailored shorts and heels"
    },
    {
      "title": "Get some extra mileage out of your favorite short skirt or dress.",
      "content": "Get some extra mileage out of your favorite short skirt or dress. A miniskirt and boots are practically a staple of transition dressing, especially in the fall. If it's a little chilly, add some tights—you can always shuck them later if it gets warmer. [4] X Research source Basic: denim mini skirt and sweater with riding boots or cowboy boots Casual: denim mini skirt and hoodie with rain boots Dressy: bodycon mini dress with black tights and black stiletto boots"
    },
    {
      "title": "Tall boots keep your legs warm with style.",
      "content": "Tall boots keep your legs warm with style. When paired with a flowy peasant skirt, you're not actually showing any skin at all, so you don't have to worry about any tights underneath. The light weight of your skirt won't matter because your boots will keep your legs warm. [5] X Research source Basic: peasant skirt and tee with riding boots Casual: peasant skirt and tee with rain boots Dressy: peasant skirt and silk shell with black stiletto boots and statement jewelry"
    },
    {
      "title": "Mock turtlenecks can keep you just warm enough.",
      "content": "Mock turtlenecks can keep you just warm enough. These shirts were practically made for 60-degree weather! A regular turtleneck might make you break a sweat, but a mock turtleneck covers just the right amount of skin to keep you cozy. [6] X Research source Basic: lightweight mock turtleneck sweater with jeans and flats or sneakers Casual: mock turtleneck shirt or sweater with leggings and sneakers Dressy: mock turtleneck sweater with a silk or satin skirt and heels"
    },
    {
      "title": "The shawl provides a stylish emergency layer in case it gets chilly.",
      "content": "The shawl provides a stylish emergency layer in case it gets chilly. Sweater dresses provide all-over warmth in a simple, one-and-done outfit that'll have you out the door with style in a snap. On a 60-degree day, a shawl or blanket scarf just keeps you a little cozier and can add some texture and contrast to your dress. [7] X Research source Basic: Sweater dress and shawl with riding boots or flats Casual: Sweater dress and shawl with sneakers Dressy: Sweater dress and shawl with heels and statement jewelry"
    },
    {
      "title": "Use the sweater to ward off the chill you'd get in a light dress.",
      "content": "Use the sweater to ward off the chill you'd get in a light dress. If you're not ready to let go of summer yet, keep your favorite sundress out a little longer by pairing it with a chunky oversized sweater or a fitted cardigan. You'll stay warm and really capture the spirit of the transitional season. [8] X Expert Source Paul Julch, MA Personal Wardrobe Stylist & Speaker Expert Interview. 16 November 2021. Basic: sundress and chunky sweater with ballet flats Casual: sundress and chunky sweater with sneakers Dressy: sundress and fitted cardigan with heels, a thin belt, and a chunky bracelet or necklace"
    },
    {
      "title": "A well-fitted blazer changes the tone of any outfit.",
      "content": "A well-fitted blazer changes the tone of any outfit. [9] X Expert Source Paul Julch, MA Personal Wardrobe Stylist & Speaker Expert Interview. 16 November 2021. With jeans and a tee, the blazer makes you look a little more serious and classy. Throw it on over a fancy dress, and you instantly turn it a little more casual. There's really nothing a good blazer can't do—and its light weight makes it perfect for those 60-degree transitional days. Basic: navy blazer over jeans and a tee with ballet flats Casual: bright blazer over jeans and a tee with sneakers Dressy: black blazer over black skinny jeans and a silk shell with statement jewelry and heels"
    },
    {
      "title": "Trenches are especially helpful if rain is in the forecast.",
      "content": "Trenches are especially helpful if rain is in the forecast. A well-fitted trench coat can instantly elevate any outfit you wear—it even makes a basic tee and jeans look more polished and intentional. [10] X Research source It also doesn't add a lot of weight, like a puffy winter coat, so you won't be sweating in the sun on a mild day. Basic: a trench over a tee and jeans or trousers with sneakers or loafers Casual: a trench over a button-down and jeans or leggings with sneakers Dressy: a trench over a classic little black dress with pearls, pantyhose, and heels"
    }
  ]
}