{
  "url": "https://www.wikihow.com/Deal-With-Your-Teenager-(for-Parents)",
  "title": "How to Deal With Your Teenager (for Parents)",
  "steps": [
    {
      "title": "Treat them like a teen, not a child or adult.",
      "content": "Treat them like a teen, not a child or adult. Your teen is not a small child anymore, so it’s important to adjust your expectations and not treat them like a child. However, teens are not quite adults and cannot be held responsible as an adult. The teenage brain is in the middle of a critical stage of development, and teens need you to help them through this part of their lives. They are not quite developed in their decision-making, reasoning, or in managing impulsivity. Instead of assuming they will act and think like an adult, be prepared for some seemingly irrational behavior. [1] X Research source If you’re disappointed because your teen keeps making the same mistakes, have some compassion and recognize that your teen is still learning a lot and nowhere near being an adult yet. Part of being a teenager is learning through failure and mistakes. Frame the negative experiences in their lives as learning opportunities."
    },
    {
      "title": "Be flexible with their freedoms.",
      "content": "Be flexible with their freedoms. If your teen is making an effort and showing their responsibility, allow more freedom. If they are making bad choices, be more restrictive. Ultimately, show them that their behavior gives them freedom or restrictions and their own choices determine their outcomes. If your teen is asking for permission to do something you’re inclined to say no to, hear them out. Say, “I’m not comfortable with this, but I want you to show me that you’re responsible enough to go to this concert with your friends.” Likewise, say, “I gave you freedom and you weren’t prepared for it, so we need to scale back now.”"
    },
    {
      "title": "Focus on trust, not suspicion.",
      "content": "Focus on trust, not suspicion. It’s true that teens can get into a lot of trouble, but don’t focus your attention on the bad things they’ve done in the past or the risks they might face. Even if your teen has greatly betrayed your trust, it is important for both of you to repair that trust. If you think your teen may be up to something, have them explain it to you fully. Ask questions instead of jumping to conclusions. If you’re not sure, say to your teen, “I’m concerned, but I’m choosing to trust you on this.” [2] X Research source If your child does break your trust, take away a privilege and have them earn it back. For example, if they stay out long after curfew, say they cannot drive for one week, and they must earn the use of the car after that by showing they can be responsible with time."
    },
    {
      "title": "Stay calm.",
      "content": "Stay calm. If you are angry, take a moment and gather yourself. Take a few deep breaths or walk away and come back when you’re calmer. This way, you’re more likely to give fair and reasonable consequences. Especially if your teen knows how to push your buttons or set you off, it’s especially important to keep your cool and not discipline them out of frustration or irritation. If you feel anger or upset coming on, tune into your body. Notice where you feel upset: do you have knots in your stomach, feel shaky, or start sweating? Notice these signs and recognize it’s time to back off. [3] X Research source Keep a journal of how you feel when you’re upset. This can help you blow off steam and reveal patterns in you or your child’s behavior."
    },
    {
      "title": "Establish boundaries and stick to them.",
      "content": "Establish boundaries and stick to them. The teen should know what is expected of them. Set some boundaries around when they can go out, what time they need to come home, and what their role is in the home. Teens will want to push the boundaries, so remain firm when you set a limit. Discuss these boundaries with your teen, and let them have a say in how they work. They are more likely to follow rules that they helped establish. Put boundaries and rules in writing so that there’s no confusion as to what’s expected of your teen. Have the teen sign off on the agreed rules. If they break the rules, you can bring out the signed document. For example, you may decide that your teen is not allowed to do extra activities without completing their chores or housework. If your teen makes a request, say,, \"Oh, that sounds fun, but you never did your chores this week. I'm so sorry you can't go.\" Make it clear that they can go once their chores are complete."
    },
    {
      "title": "Enforce consequences.",
      "content": "Enforce consequences. Learning to navigate problem behaviors can be tricky. If you’re too lenient, your teen may think they have no limits or you don’t take their behavior seriously. However, if you’re too strict, your teen may grow to resent you or they may rebel. Be firm in enforcing consequences, and don’t let your teen sway your decision. When your teen breaks a rule, calmly tell them what they did and why they are in trouble. When deciding on a consequence, make sure it’s proportional to the behavior and not given out of anger. Do not become a dictator. This can cause your teenager to rebel and become resentful. If they do something wrong, don't criticize or insult them as a person. Simply state the facts and the consequences as agreed upon previously. Assign your teen more housework or take away privileges (such as television time or computer time) as a consequence. Consider setting rules and their accompanying consequences beforehand. That way, when your teen breaks a rule, they know what they did and what consequence will result."
    },
    {
      "title": "Be reasonable.",
      "content": "Be reasonable. Don’t set impossible rules. It’s not reasonable to tell your teen to go to bed at 7:30 or that they cannot hang out with friends. Teens want freedom and independence, so be reasonable in allowing them these things. One of the best ways to be reasonable is to listen to your teen’s perspective. Ask them what time they think is appropriate to go to bed on school nights. When they’re in trouble, ask them what a reasonable consequence might be. Get their input and consider their perspective. Ultimately, the decision lies with you. Consider your teen’s strengths and limitations. If your teen is naturally messy, it may be unreasonable to demand a spotless room. If your teen needs some chillout time after school, let them do so before starting their homework. Look out for signs that your teen is resentful about the rules you set. For instance, they might bring up old fights or act annoyed and disrespectful. Reader Poll: We asked 2372 wikiHow readers, and 65% of them agreed that a common sign that your teen is growing resentful is by avoiding spending time with you . [Take Poll]"
    },
    {
      "title": "Handle conflicts.",
      "content": "Handle conflicts. Sometimes, your teens may want to prove themselves to you or test their independence in your home. Refuse to fight with them. You can avoid major conflicts by monitoring your own reactions to your teen, even if you think they’re being outrageous. If either of you are having a hard time managing your anger, count to ten or take some deep breaths. If things get too heated, take some time out before talking. Speak calmly, and if need be, agree to disagree. [4] X Research source Let them know it’s not worth fighting over petty things. Using empathy in your voice, develop one-liners, such as, \"I bet it feels that way” or, “I know this is difficult for you.” Avoid yelling at your teenager. If your teenager has done something they are not allowed to, explain calmly and rationally what they have done and why it broke the rules. Teenagers may need some space to handle conflicts, especially if they are upset or stressed. Often emotions can get in the way of rational thinking. Try to pick your battles, and let them calm down before you discuss a conflict."
    },
    {
      "title": "Use effective communication.",
      "content": "Use effective communication. If you keep the lines of communication open, you may help them make positive, informed choices or come to you when they need help. Keep a path of open communication between you whenever possible so they can ask questions, admit mistakes, and reach out when they need help. Instead of jumping to conclusions about your teen’s behavior, ask questions. Try to understand their position without assuming they’ve been doing something wrong. [5] X Research source Learn to make compromises with your teen. That way you retain much of the control and neither of you will end up completely dissatisfied. If your teenager doesn’t talk to you, communicate through texts or notes. You don't have to get upset with them; just show that you’re available."
    },
    {
      "title": "Have fun together.",
      "content": "Have fun together. Make sure you find time to enjoy your teen. Even if they are making your life difficult at times, do activities together and with the family that you know everyone will enjoy. For example, set up a family game night once each month and play board games your teen enjoys. If your teen is adventurous, take them go-karting. If your teen is artistic, take a painting class together. Find common ground and have fun. [6] X Research source Even if the time you spend together is just walking the dog once each day, it’s still quality time with your teen you may look back on fondly. Understand that as your teenager gets older, they may want to spend more time with their friends and less with their family. Don't force them to do family activities. Plan activities that they genuinely want to do, and respect their personal boundaries."
    },
    {
      "title": "Develop empathy.",
      "content": "Develop empathy. At this crucial time in their life, your teen is looking for someone to understand what they're going through. If you’re having a hard time connecting with your teen, find ways to relate to them. Put yourself in their shoes and think about what it would be like to live a day in their life. If your teen comes to you with a problem, hear them out. They generally don't need you to fix their problems for them (they'll figure that out for themselves), but they need someone who'll listen to and empathize with them. [7] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Sometimes loneliness (or any other issue) can trouble teens and can impact their exam marks negatively. Don't immediately punish them. Instead, understand and support them so that they don't experience loneliness, isolation, or some other negative feeling from the parental side either. Don't belittle or discount your teen's problems as being unimportant or caused by hormones. Their problems and struggles seem big to them."
    },
    {
      "title": "Honor and respect your teen.",
      "content": "Honor and respect your teen. Just as you want your teen to treat you with respect, treat them with respect as well. Be a good role model and show them what respect looks like, even when you’re fighting or disagreeing. Constantly yelling at a child can damage their emotions and cause them to feel insecure. Respect their opinions and ask for them. Show respect by speaking calmly and listening to your teen. Increase their independence and let them know that you trust them. Give them responsibilities and let them show you that they can come through. Don't forget to praise them for what they do right. Recognize their efforts when they have done well in school, sports, social activities, chores, or family events."
    },
    {
      "title": "Support your teen’s interests.",
      "content": "Support your teen’s interests. If they like sports or activities, sign them up and go to their events. If they are musical, pay for lessons and go to their recitals. Get them involved in the activities they enjoy and show that you support them. This shows that you care and are invested in their skills and happiness. If they win any awards, make a big deal out of it and take the whole family out to dinner in their honor. These are easy, fun things you can do for your teen that will cement a lifelong healthy relationship between the two of you. Sometimes teenagers may want to celebrate in ways that don't include the whole family. Make sure that when you celebrate, you celebrate in the way that they choose."
    },
    {
      "title": "Open your home to your teenager's friends.",
      "content": "Open your home to your teenager's friends. Your teen is looking for a place to hang out with their friends. Be a good sport by opening your own home to them. Create a space where they can hang out by themselves but you can casually walk through. Have some healthy snacks around and let them listen to their music, hang out, and play video games. [8] X Research source Make yourself available, too. You'll be surprised how many of their friends might need a listening ear. Having your teen’s friends over at your house means that you can casually monitor what they’re up to and make sure they’re being safe."
    },
    {
      "title": "Be available to them.",
      "content": "Be available to them. Teens may not always want your physical affection, but they do want your love. Show your love to your teen by being there for them. Don’t just notice their academic achievement or athletic excellence, praise them for who they are as a person and for the traits they possess. Show your love through actions, too. Whether this includes going to their sports meets or packing their lunch every day, tell them these are acts of love. [9] X Research source Not all teens want to talk with their parents, but let them know you’re willing to listen. Unconditional love and acceptance is the greatest gift you can give them, one that will not only boost their confidence to face another day, but will also steer your relationship with them in a positive direction."
    },
    {
      "title": "Look out for problem behaviors",
      "content": "Look out for problem behaviors . All teens want a degree of privacy, but be aware if your teen is especially secretive. As their parent, you should know who they hang out with and where they go, and make sure they are back by curfew. If your teen hides what they’re doing or get caught in lies, take these things seriously. Don’t let these behaviors slide. Teens may not be able or willing to express their problems in words, so they might turn to external things to deal with their pain or confusion. Sometimes, acting out can indicate inner turmoil that needs attention. Take any drug use or alcohol use seriously. Not only is it illegal, it is more dangerous because their brain is still developing."
    },
    {
      "title": "Listen to and understand them.",
      "content": "Listen to and understand them. While an angry, bitter, or hostile teen can be difficult to deal with, do your best to listen to and understand them. All teens need to feel loved. If they are angry or upset, hear them out without interrupting. Let them have their space if they’re not in the mood to talk and let them know you can talk about it once they’ve cooled down. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Validate their feelings by saying, “I can see that you’re upset” or, “Wow, that must have really hurt you.” Help your teen find ways to cool down or control their anger and emotions. Have them write in a journal, listen to music, go on a run, or punch a pillow."
    },
    {
      "title": "See a counselor or therapist.",
      "content": "See a counselor or therapist. If your teen is showing signs of anxiety, depression, or other mental or emotional problems, or is especially destructive or rebellious, a therapist can help. Teens can be especially sensitive to emotional events such as a recent move, divorce, loss, bullying, romantic breakup, or other stressors. [11] X Research source Set up an appointment with their school counselor or psychologist. You can also see a private therapist to help your teen adjust and deal with their problems by calling your insurance provider or local mental health clinic. Take your teenager's issues seriously. Do not brush them off as normal teen angst. Many lifelong psychological problems begin during the teenage years. It's best to seek treatment early to prevent problems from getting worse."
    },
    {
      "title": "Deal with a crisis.",
      "content": "Deal with a crisis. If you think your teen is in danger, don’t think twice about taking action. Take talk or threats of suicide and doing harm to others seriously. Seek help immediately by calling emergency services , taking them to the emergency department, and alerting their therapist immediately. If you’re unsure what to do, call emergency services and they can help direct you to get the care you need. They may advise you to take them to the emergency department or to watch your teen closely."
    }
  ]
}