{
  "url": "https://www.wikihow.com/Freeze-Dry-Meat",
  "title": "How to Freeze Dry Meat",
  "steps": [
    {
      "title": "Press the on button so the freeze dryer can get cold.",
      "content": "Press the on button so the freeze dryer can get cold. To safely freeze dry meat for long-term storage, you need to use a freeze drying machine. Since the machine will use a lot of power, plug it into an outlet that doesn't already have a large appliance plugged into it. Turn on your machine so it starts to get cold. [1] X Research source"
    },
    {
      "title": "Trim and cut the meat you want to freeze dry.",
      "content": "Trim and cut the meat you want to freeze dry. Lay your frozen or cooked meat on a cutting board and cut away any visible fat or bones. Discard the trimmed bits and cut the meat into slices or chunks. While the meat can be as long as you like, it shouldn't be thicker than 3 ⁄ 4 inch (1.9 cm). If you're freeze drying both raw and cooked meats, handle them separately to prevent cross-contamination."
    },
    {
      "title": "Arrange the meat on your freeze dry machine tray.",
      "content": "Arrange the meat on your freeze dry machine tray. Spread the prepared meat on the trays that came with your freeze dry machine so you leave at least 1 ⁄ 4 inch (0.64 cm) of space between the pieces. The meat shouldn't come up higher than the sides of the tray or you may need to cut them in half."
    },
    {
      "title": "Place the trays in the freezer and seal the machine shut.",
      "content": "Place the trays in the freezer and seal the machine shut. Once your freezer is cold, open the door and slide the trays with meat in. If your machine has a door pad, place this between the trays and the door. Close the door of the machine so it's sealed shut. [2] X Research source"
    },
    {
      "title": "Press the start button on the freeze drying machine.",
      "content": "Press the start button on the freeze drying machine. Once you push the start button, the machine will's temperature will drop so the meat freezes. The machine will freeze the meat between −40 °F (−40 °C) and −50 °F (−46 °C). Once the meat is frozen, the machine will create a vacuum to remove all moisture from the meat. [3] X Research source The machine will run for about 24 hours before the meat is freeze-dried."
    },
    {
      "title": "Remove the meat and check to see that it's dry.",
      "content": "Remove the meat and check to see that it's dry. Once the machine shuts off or alerts you that it's finished, open the door and remove the trays. Touch the meat to feel for any moisture or break a piece in half to see if it's dry. You can store it if the meat is completely dry. If the meat still feels moist, you may need to freeze dry the meat for 2 to 3 more hours. Remember that freeze drying won't remove the bacteria from raw meats. Handle these as you would raw, fresh meat."
    },
    {
      "title": "Place the meat in mylar bags.",
      "content": "Place the meat in mylar bags. Immediately place the meat in mylar storage bags so it doesn't begin to absorb moisture from the air. Place 1 oxygen absorber packet into each storage bag and use an impulse sealer to close the bags. You can buy oxygen absorber packets online or from some supermarkets."
    },
    {
      "title": "Put the meat in canning jars for shorter storage.",
      "content": "Put the meat in canning jars for shorter storage. Place the freeze dried meat in clean canning jars and drop an oxygen absorber packet in the jar. Screw the lid on to seal air."
    },
    {
      "title": "Label the freeze dried meat.",
      "content": "Label the freeze dried meat. You need to label the meat regardless of what storage system you use. Note what kind of meat it is, if it's raw or cooked, and the date you freeze dried it. It's also useful to note how much meat is in the container."
    },
    {
      "title": "Store the packaged freeze dried meat at room temperature.",
      "content": "Store the packaged freeze dried meat at room temperature. Keep the mylar bags or jars of freeze dried meat in the pantry or a storage room that's cool and dry. For long term storage over 1 year, keep the jars out of direct sunlight. While you can leave the jars in direct sunlight, the this could change the color of the meat and cause it to fade."
    },
    {
      "title": "Remove the amount of meat you want.",
      "content": "Remove the amount of meat you want. Tear or cut open the mylar bag or open the canning jar with the freeze dried meat. Take out as much freeze dried meat as you'd like to prepare and close the bag or jar with the rest of the freeze dried meat."
    },
    {
      "title": "Add a new oxygen absorber packet to the jar or bag.",
      "content": "Add a new oxygen absorber packet to the jar or bag. Before you return the extra freeze dried meat to storage, put a fresh oxygen absorber packet into the container. This will absorb the oxygen that was introduced when you took out some of the meat. To completely seal the air out of the mylar bag, seal it shut with an impulse sealer."
    },
    {
      "title": "Place the meat in a bowl of warm or hot water.",
      "content": "Place the meat in a bowl of warm or hot water. Fill a bowl halfway with water and place the raw or cooked freeze dried meat directly in the water. The meat will absorb the water within a few minutes. It will become tender once it's rehydrated. [4] X Research source The meat will only absorb as much water as it needs, so don't worry about the meat becoming soggy."
    },
    {
      "title": "Remove the meat from the water and eat or cook it.",
      "content": "Remove the meat from the water and eat or cook it. Lift the rehydrated meat out of the water and eat it, if it's already been cooked or smoked. If the meat is raw, cook it like you would cook other raw meat. For example, bake, pan-fry, or slow-cook the meat until it's completely cooked."
    }
  ]
}