{
  "url": "https://www.wikihow.com/Find-out-the-Size-of-a-Hard-Drive",
  "title": "How to Find out the Size of a Hard Drive",
  "steps": [
    {
      "title": "Make sure you're using a PC.",
      "content": "Make sure you're using a PC. You should only need to measure your current hard drive if you plan on upgrading it, in which case you'll need to know the exact dimensions of your hard drive to ensure a proper fit. Removing or upgrading the hard drive on a Mac without professional help is not recommended."
    },
    {
      "title": "Back up your computer.",
      "content": "Back up your computer. If you aren't careful while handling your hard drive, you can damage your files. Backing up your computer ensures that your files will be safe even if you accidentally harm your hard drive."
    },
    {
      "title": "Turn off your computer.",
      "content": "Turn off your computer. For a desktop, you should also unplug your Central Processing Unit (CPU)."
    },
    {
      "title": "If you have a laptop, remove the battery.",
      "content": "If you have a laptop, remove the battery. If you don't, you can get shocked. [1] X Research source Most laptops have a quick-release button on the casing's underside that removes the battery, although some models require you to unscrew the casing. Mac batteries are extremely difficult to remove, which is another reason PCs are better-suited to this method."
    },
    {
      "title": "Open your computer's casing.",
      "content": "Open your computer's casing. If you have a laptop, this will be on the underside of the computer. For a desktop, you need to open the side of the CPU. You may need a screwdriver to open your casing. If you aren't comfortable opening your computer's casing, take your computer to a tech department (e.g., Best Buy) and have them open the casing for you."
    },
    {
      "title": "Remove your hard drive from it's mounting.",
      "content": "Remove your hard drive from it's mounting. Depending on your computer make and model, you may have to unscrew a bracket around your hard drive before removing it."
    },
    {
      "title": "Be careful not to unplug anything from the hard drive.",
      "content": "Be careful not to unplug anything from the hard drive. There will be a ribbon attaching your hard drive to your computer--leave this attached. You should be able to measure the hard drive without disconnecting it from your computer."
    },
    {
      "title": "Place your hard drive on a soft surface.",
      "content": "Place your hard drive on a soft surface. Your hard drive is fragile. Use a pillow or towel to support it."
    },
    {
      "title": "Measure your hard drive with a standard ruler.",
      "content": "Measure your hard drive with a standard ruler. This will both tell you the exact dimensions of your hard drive and determine your hard drive's classification. You should measure length, width, and height. For maximum accuracy, record your drive's dimensions in millimeters. Pay close attention to your hard drive's height. This value dictates which types of hard drive will fit into your casing should you decide to install a new hard drive."
    },
    {
      "title": "Determine your hard drive's classification.",
      "content": "Determine your hard drive's classification. Hard drives come in two main sizes--\"3.5 inch\", and \"2.5 inch\"--which are technical classifications that refer to the width of a hard drive's platter (the disk that stores your computer's memory), but not the full dimensions of the hard drive unit itself. Your hard drive's actual dimensions will determine its classification. 3.5 inch drives are 146 mm long, 101.6 mm wide, and either 19 or 25.4 mm tall. 2.5 inch drives are 100 mm long, 69.85 mm wide, and either 5, 7, 9.5 (the most common), 12.5, 15, or 19 mm tall. [2] X Research source"
    },
    {
      "title": "Write down your hard drive specifications.",
      "content": "Write down your hard drive specifications. If you ever need to install a new hard drive, this information will help you accurately pick one."
    },
    {
      "title": "Put your hard drive back in your computer and re-attach the casing.",
      "content": "Put your hard drive back in your computer and re-attach the casing. Now you know the size of your hard drive!"
    },
    {
      "title": "Open \"My Computer\" on your desktop.",
      "content": "Open \"My Computer\" on your desktop. You should see two distinct sections when it opens: \"Folders\" and \"Devices and Drives\"."
    },
    {
      "title": "Locate the \"OS (C:",
      "content": "Locate the \"OS (C: )\" icon under \"Devices and Drives\". This is your default hard drive, where the bulk of your files are likely stored. Your hard drive may be labeled as \"Local Disk (C:)\" instead. If you want to find out the size of a different currently connected hard drive, find the (letter) name for that drive instead."
    },
    {
      "title": "Right-click on your hard drive's icon and select \"Properties\".",
      "content": "Right-click on your hard drive's icon and select \"Properties\". This will display your hard drive's specifications. [3] X Research source"
    },
    {
      "title": "Click on the \"General\" tab.",
      "content": "Click on the \"General\" tab. The \"General\" tab displays your hard drive's total memory, used memory, and remaining memory as a graph. Find the \"Capacity\" value to see your hard drive's total space."
    },
    {
      "title": "Click on the Apple icon in the upper toolbar.",
      "content": "Click on the Apple icon in the upper toolbar. This will bring up the Apple Menu."
    },
    {
      "title": "Click on \"About This Mac\".",
      "content": "Click on \"About This Mac\". This should launch a small window with system details, such as your operating system version."
    },
    {
      "title": "Select the \"Storage\" tab.",
      "content": "Select the \"Storage\" tab. The \"Macintosh HD\" icon should be the first entry on the top--this is your default hard drive. [4] X Research source"
    },
    {
      "title": "Read over your hard drive's information.",
      "content": "Read over your hard drive's information. Next to the \"Macintosh HD\" icon, it will say something like \"X amount free of Y amount\", where \"X\" is your remaining space and \"Y\" is your hard drive's total capacity. Mac hard drives show a breakdown of what file types are consuming the most hard drive space. Use this to target large files if you're trying to clear some space."
    },
    {
      "title": "Open your \"Settings\" menu.",
      "content": "Open your \"Settings\" menu."
    },
    {
      "title": "Tap the \"General\" tab.",
      "content": "Tap the \"General\" tab. Look for the \"Storage and iCloud Usage\" tab. For Android, find the \"Storage\" tab and select it. [5] X Research source"
    },
    {
      "title": "Select the \"Storage and iCloud Usage\" tab.",
      "content": "Select the \"Storage and iCloud Usage\" tab. Under \"Storage\" (which covers your phone's internal hard drive) and \"iCloud\" (which covers your online-based cloud storage), you can see how much memory you are currently using and how much is remaining. If you have an Android with an SD card, you'll have a drive option for your phone's internal storage as well as the card. These different drives are under \"Internal Storage\" and \"SD Card\", respectively."
    },
    {
      "title": "Add your \"memory used\" value to your \"memory remaining\" value.",
      "content": "Add your \"memory used\" value to your \"memory remaining\" value. This will tell you your hard drive's total capacity for file storage Note that a portion of the hard drive is dedicated to the operating system and other non-retrievable system files, so your actual total space won't quite match the number associated with your phone model (e.g. 32GB, 64GB) You can also view your phone's effective storage capacity and currently available space under the \"About\" tab in the \"General\" menu."
    },
    {
      "title": "Tap \"Manage Storage\" under \"Storage\" or \"iCloud\".",
      "content": "Tap \"Manage Storage\" under \"Storage\" or \"iCloud\". This feature shows you how memory is being used by apps, images, or other information. Use this feature to clear up space. For example, if you see that several gigabytes of your used space come from saved conversations, you can free up that space by deleting those conversations."
    }
  ]
}