{
  "url": "https://www.wikihow.com/Draw-an-Anime-Cat-Girl",
  "title": "How to Draw an Anime Cat Girl",
  "steps": [
    {
      "title": "Draw some guidelines for the head and ears.",
      "content": "Draw some guidelines for the head and ears. Add a circle for the head, with two triangular shapes on top for the ears."
    },
    {
      "title": "This helps you determine where the features are going to be.",
      "content": "This helps you determine where the features are going to be. There should be a vertical line down the center of the head and one horizontal line about 1/4 to 1/3 up from the bottom of the circle."
    },
    {
      "title": "Add a couple of circles for where the eyes are going to be.",
      "content": "Add a couple of circles for where the eyes are going to be. They should be along the horizontal guidelines you drew before."
    },
    {
      "title": "Add the guidelines for the hair.",
      "content": "Add the guidelines for the hair. This can just be a simple shape, just to outline what the hair is going to look like. Having long sideburns is a good idea to cover where the human ears would be. It can be a little strange when there are 2 sets of ears. And no one likes a bald cat girl."
    },
    {
      "title": "Add the chin, ears, mouth, nose, and eyebrows.",
      "content": "Add the chin, ears, mouth, nose, and eyebrows. The bottom of the chin should be as far from the top of the eyes as the top of the eyes are from the top of the head. The top of the eyes are should be the middle of an anime girl's head."
    },
    {
      "title": "With anime, hair can be incredibly complicated or very simple.",
      "content": "With anime, hair can be incredibly complicated or very simple. Decorate the hair depending on your skill level."
    },
    {
      "title": "Breakdown the individual parts of the anime eyes.",
      "content": "Breakdown the individual parts of the anime eyes. Anime eyes can seem complicated to beginners. Just try to simplify the shapes. Here there are 3 shapes, the upper shape, the lower C shape, and the square highlight shape."
    },
    {
      "title": "Remove all the guidelines and sketch marks that you don't need.",
      "content": "Remove all the guidelines and sketch marks that you don't need. If you drew it digitally, turn off the lower layer. If you drew the sketch with pencil and then went over it with ink, erase the pencil. If you only used pencil, erase only the guidelines."
    },
    {
      "title": "Bring your drawing to life with some colour.",
      "content": "Bring your drawing to life with some colour. Though adding color is a tutorial in and of itself. So don't worry about that yet."
    }
  ]
}