{
  "url": "https://www.wikihow.com/Extract-a-JAR-File",
  "title": "How to Extract a JAR File",
  "steps": [
    {
      "title": "Install an archive program.",
      "content": "Install an archive program. JAR files work just like ZIP files. You can use any archive program to extract them. On Windows, you can Install WinRAR 7-Zip, or WinZIP. Macs have their own built-in archive program called Archive Utility. [2] X Research source"
    },
    {
      "title": "Find the JAR file you want to extract.",
      "content": "Find the JAR file you want to extract. Use File Explorer (press Win + E to open File Explorer) or Finder on Mac to navigate to the JAR file you want to extract."
    },
    {
      "title": "Right-click the JAR file.",
      "content": "Right-click the JAR file. Doing so prompts a drop-down menu."
    },
    {
      "title": "Select Open with.",
      "content": "Select Open with . It's in the drop-down menu. A pop-out menu will appear with programs you can use to open the file. If you don't see this option, click the JAR file once, then right-click it again and select Open with ."
    },
    {
      "title": "Click the Archive program you want to use.",
      "content": "Click the Archive program you want to use. You can use any archive program you have available on your computer. On Mac, click Archive Utility ."
    },
    {
      "title": "Click Extract files or Extract here.",
      "content": "Click Extract files or Extract here . \"Extract files\" gives you the option to select a destination to extract the file to. \"Extract here\" extracts the files to the same location the Jar file is located."
    },
    {
      "title": "Select an extraction location.",
      "content": "Select an extraction location. If necessary, click one of the folders on the right side of the window to select it as the location to which you want to extract your JAR file (WinRAR). If you are using 7-Zip, click the icon with three dots in the upper-right corner and navigate to the folder you want to extract the files to. Then click Ok ."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the WinRAR window. Doing so will extract your JAR file to the selected folder."
    },
    {
      "title": "Make sure you have Java SE installed.",
      "content": "Make sure you have Java SE installed. If you don't have Java SE (the Java Developer Kit) installed, you won't be able to use the \"jar\" extraction command, and your file will be impossible to extract with this method: Open the JDK download page . Click the Windows tab. Scroll down and click \" https://download.oracle.com/java/22/latest/jdk-22_windows-x64_bin.exe \" next to \"Windows x64 Installer\". Click the checkbox next to agree to the license agreement and click the green download button. Open the JDK install file and click Yes . Click Next . Click Close ."
    },
    {
      "title": "Press ⊞ Win+E to open File Explorer .",
      "content": "Press ⊞ Win + E to open File Explorer . Click the folder-shaped File Explorer app icon in the taskbar that's at the bottom of your computer's screen. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Go to the JAR file's location.",
      "content": "Go to the JAR file's location. Find the JAR file that you want to unzip."
    },
    {
      "title": "Select the JAR file's path.",
      "content": "Select the JAR file's path. Click a blank space in the address bar at the top of the File Explorer window to do so."
    },
    {
      "title": "Press Ctrl+C to copy the path of the JAR file.",
      "content": "Press Ctrl + C to copy the path of the JAR file. This will save the path to your JAR file."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen."
    },
    {
      "title": "Type in cmd and press ↵ Enter.",
      "content": "Type in cmd and press ↵ Enter . This opens the Windows Command Prompt."
    },
    {
      "title": "Navigate to the JAR file's path location.",
      "content": "Navigate to the JAR file's path location. To do this type in cd and press the space bar. Then press Ctrl+V to past the file's path. Then press \"Enter\".."
    },
    {
      "title": "Type in jar xf followed by a space followed by the name of the JAR file.",
      "content": "Type in jar xf followed by a space followed by the name of the JAR file. This is the command to extract a JAR file. [4] X Research source For example, to extract a JAR file called \"minecraft\", you would type in jar xf minecraft.jar ."
    },
    {
      "title": "Press ↵ Enter.",
      "content": "Press ↵ Enter . This executes the command and extracts the JAR file. If you receive an error message that says \"'jar' is not recognized as an external or internal command\", you need to change the path environment variable to \"C:\\Program Files\\Java\\jdk[latest version]\\bin\" Make sure you replace \"[latest version]\" with the latest version of Java Development Kit you have installed."
    },
    {
      "title": "Go back to the JAR file's location.",
      "content": "Go back to the JAR file's location. You should now see the JAR file's extracted contents here."
    },
    {
      "title": "Make sure you have Java SE installed.",
      "content": "Make sure you have Java SE installed. If you don't have Java SE (the Java Developer Kit) installed, you won't be able to use the \"jar\" extraction command, and your file will be impossible to extract with this method: Open the JDK download page . Click the macOS tab. Scroll down and click \" https://download.oracle.com/java/22/latest/jdk-22_macos-aarch64_bin.dmg \" next to \"macOS Installer\". Open the JDK dmg file. Double-click the JDK pkg file. Click Continue Click Install . Enter your Mac user password and click Install Software . Click Close"
    },
    {
      "title": "Open Finder.",
      "content": "Open Finder. Click the Finder app icon, which resembles a blue face, in your Mac's Dock."
    },
    {
      "title": "Find your JAR file.",
      "content": "Find your JAR file. Go to the location of the JAR file that you want to extract."
    },
    {
      "title": "Select your JAR file.",
      "content": "Select your JAR file. Click the JAR file once to do so."
    },
    {
      "title": "Copy the JAR file's path.",
      "content": "Copy the JAR file's path. Use the following steps to copy the path of the JAR file: Right-click the JAR file. Hold OPTION and click Copy [jar file] as pathname ."
    },
    {
      "title": "Open Spotlight .",
      "content": "Open Spotlight . Click the magnifying glass-shaped Spotlight icon in the top-right corner of the screen to do so."
    },
    {
      "title": "Open Terminal .",
      "content": "Open Terminal . Type \"terminal\" into the Spotlight text box, then double-click the Terminal icon when it appears. This will open a Terminal window."
    },
    {
      "title": "Type in jar xf and press the space bar.",
      "content": "Type in jar xf and press the space bar. This is the command to extract a JAR file. Don't press enter just yet, there is still more you need to do. [5] X Research source"
    },
    {
      "title": "Press ⌘ Command+V to paste in your JAR file's path, and press ⏎ Return.",
      "content": "Press ⌘ Command + V to paste in your JAR file's path, and press ⏎ Return . This executes the command to extract the JAR file."
    },
    {
      "title": "Go back to the JAR file's location.",
      "content": "Go back to the JAR file's location. You should now see the JAR file's extracted contents here."
    }
  ]
}