{
  "url": "https://www.wikihow.com/Evolve-Seadra",
  "title": "Evolve Seadra into Kingdra in Pokémon",
  "steps": [
    {
      "title": "A Dragon Scale is a blue scale-like object that is required to trigger Seadra's evolution process.",
      "content": "A Dragon Scale is a blue scale-like object that is required to trigger Seadra's evolution process. It can only be found in specific areas inside the game. These special areas vary depending on which version of the game you’re playing. Look for Dragon Scales by searching for hidden areas or defeating wild Pokémon in the following areas: Gold, Silver, Crystal, HeartGold, and SoulSilver — Can be obtained inside Mount Mortar. They can also be acquired by defeating wild Horsea, fellow Seadra, Dratini, and Dragonair. Ruby, Sapphire, and Emerald — Can be acquired by defeating wild Horsea and Bagon. FireRed and LeafGreen — Can be obtained inside the Water Path and Trainer Tower. Diamond, Pearl, and Platinum — Can be acquired by defeating wild Horsea and Seadra. Black and White — Can be found on Route 13 and 18. They can also be acquired by defeating wild Horsea, fellow Seadra, Kingdra, Dratini, Dragonair, and Dragonite. Black 2 and White 2 — Can be found on Victory Road, inside the Antiques Shop on Join Avenue, and inside the Wild Forest. They can also be acquired by defeating wild Horsea, fellow Seadra, Kingdra, Dratini, Dragonair, and Dragonite. X and Y — Can be found inside the Terminus Cave. They can also be acquired by defeating wild Horsea, fellow Seadra, Kingdra, Dratini, Dragonair, and Dragonite. Sun, Moon, Ultra Sun, and Ultra Moon: Can be acquired in Battle Tree. They can also be acquired by defeating wild Dratini, Dragonair, and Dragonite. Go — Can be obtained by searching PokéStops and Gyms starting at level 10. They can also be obtained by completing Part \"A Ripple in Time\" or Special Research."
    },
    {
      "title": "Open your bag and select the Dragon Scale.",
      "content": "Open your bag and select the Dragon Scale. Then, choose Seadra from the list of Pokémon you can give it to. A message will pop up reading, \"SEADRA was given the DRAGON SCALE to hold.\""
    },
    {
      "title": "Seadra will only evolve to Kingdra once it's traded to another player.",
      "content": "Seadra will only evolve to Kingdra once it's traded to another player. Use the game's trading system to do this. Here's how you can find a Trading Center depending on your game's model: For older versions of the game, you can trade Pokémon with other players using the Game Boy’s cable link connection by going inside a Pokémon Center in any town and talking to the receptionist (non-playable character) in charge. For newer generations (fourth generation to present), trading Pokémon is done using the Global Trade Stations (GTS). To trade using the GTS, go inside a Pokémon Center in any town, and talk to the receptionist (non-playable character) in charge of the system. You can also use Quick Link to trade Pokémon locally with friends. On Pokémon Go, players can trade with registered friends. Regular trades cost both players 100 Stardust. [1] X Research source Both players must be within 100 meters of each other to initiate a trade. [2] X Research source"
    },
    {
      "title": "Ask one of your friends to trade Pokémons with you.",
      "content": "Ask one of your friends to trade Pokémons with you. Select Seadra from the list and trade it with any Pokémon the other player has or is willing to exchange. Once the other player receives Seadra, its evolution will start and will then change to Kingdra. Seadra will only evolve when traded while it’s holding the Dragon Scale. Trading without a Dragon Scale will not evolve Seadra. Leveling up and gaining experience will not trigger Seadra's evolution."
    },
    {
      "title": "Trade back your newly evolved Kingdra.",
      "content": "Trade back your newly evolved Kingdra. Ask the other player to start another trading system so you can have Kingdra back. You can choose to skip this step if you prefer not to get your evolved Kingdra back."
    }
  ]
}