{
  "url": "https://www.wikihow.com/Dye-Clothes-with-Food-Coloring",
  "title": "How to Dye Clothes with Food Coloring",
  "steps": [
    {
      "title": "Choose a wool fabric if you want your color to last.",
      "content": "Choose a wool fabric if you want your color to last. Protein fibers, like wool, cashmere , and silk will hold the dye for the longest. Cotton fabric dyes well, but the color generally fades a little bit faster over time. Remember that you can always re-dye items that have faded."
    },
    {
      "title": "Lay down old towels and gather your materials together in one place.",
      "content": "Lay down old towels and gather your materials together in one place. Use towels or sheets that you don’t mind getting discolored. You’ll also need a large plastic bowl, white vinegar, water, and various food coloring options. Getting everything together is helpful so that you don't have to go searching for anything while your hands are messy. [1] X Research source There are some techniques to remove food coloring stains, but it’s easiest to avoid making them if you can."
    },
    {
      "title": "Place your clothes in a 1:1 mixture of water to vinegar for 30 minutes.",
      "content": "Place your clothes in a 1:1 mixture of water to vinegar for 30 minutes. Place your clothes in the bowl first, and then add enough equal parts of water and white vinegar so that they’re completely saturated. To keep things even, use a measuring cup to add 8 ounces (230 g) of each liquid at a time. [2] X Research source The pre-soak prepares the clothes to accept the dye better than if you were to go straight to water and food coloring. Although you can dye your clothes without soaking them first, the color won't be as vibrant!"
    },
    {
      "title": "Soak your clothing in water and food coloring after the vinegar soak.",
      "content": "Soak your clothing in water and food coloring after the vinegar soak. Dump out the water/vinegar mix, and gently wring out your clothes. Then use 3 to 4 cups (710 to 950 mL) of water (or more, depending on how bulky the clothes are) and 10-15 drops of food coloring. Mix the water and dye in a large bowl and place your wrung-out clothes into the new mixture. [3] X Research source If you’re nervous about the color being too dark, start with fewer drops and add more until you get the desired color."
    },
    {
      "title": "Mix together 2 or more dyes to create different colors.",
      "content": "Mix together 2 or more dyes to create different colors . Most packs of food coloring have 4 basic color options—blue, green, red, and yellow. Mix together red and blue to make purple. If you want orange, combine red and yellow. Make a beautiful cyan color by mixing green and blue. Experiment with your dyes and water to find the perfect shade for your clothes. [4] X Research source If your pack of food coloring comes with white or black dyes, use those to either lighten or darken the mixture to get the color you want."
    },
    {
      "title": "Let your clothes sit in the water and dye mixture for 10-20 minutes.",
      "content": "Let your clothes sit in the water and dye mixture for 10-20 minutes. Use a long spoon to push the fabric down in the water to make sure it’s fully submerged, and stir it every few minutes let the dye access all of the material. You could even wear rubber gloves and manually rearrange the fabric every couple of minutes, too. After 10-20 minutes, you will notice that the water is clearer than it was before because the dye is getting absorbed into the fabric."
    },
    {
      "title": "Put the clothes into a resealable bag for at least 8 hours.",
      "content": "Put the clothes into a resealable bag for at least 8 hours. Wring out your clothes after they’ve soaked in the water and dye mixture, and then place each item into its own resealable bag and set them out of the way somewhere. It’s okay if they’re left for longer than 8 hours. [5] X Research source The time in the resealable bag makes the dye react with the fabric faster, which gives you a more vibrant, longer-lasting color in the end."
    },
    {
      "title": "Choose clothes made from protein fibers for long-lasting colors.",
      "content": "Choose clothes made from protein fibers for long-lasting colors. Depending on your project, use clothing made of wool, cashmere, or silk for the longest-lasting results. These fibers are made from animals, and food coloring stays in them better than other sorts of fibers, like cotton, linen, and some synthetic fibers. If you have clothes that you want to dye that aren’t made from protein fibers, that’s okay too! You can still dye them—just keep in mind that the color may fade more quickly."
    },
    {
      "title": "Use cotton fabric for a lighter-colored option that may fade over time.",
      "content": "Use cotton fabric for a lighter-colored option that may fade over time. Cotton clothes can be dyed with food coloring, but the color won’t be as vibrant and will fade out more quickly. If you want a lighter color anyways, though, cotton is a great way to go. [6] X Research source Rub salt into your cotton shirt before you begin to achieve more vibrant colors. There are also ways to set in the color after the clothes have been dyed."
    },
    {
      "title": "Protect your workstation by laying out several old towels.",
      "content": "Protect your workstation by laying out several old towels. Before you begin dyeing anything, lay out some towels or sheets that you don’t mind getting discolored. There are ways to remove stains from food coloring accidents, but it’s easier if you can avoid them altogether. [7] X Research source You may also want to wear old clothing and pull back your hair before you get started."
    },
    {
      "title": "Mix 1 cup (240 mL) of water in a water bottle with 6-8 drops of dye.",
      "content": "Mix 1 cup (240 mL) of water in a water bottle with 6-8 drops of dye. Use a plastic bottle for each color you want to incorporate, and fill each one with the 1 cup (240 mL) of water and at least 6 drops of food coloring—you can add more, though, if you want a darker shade. Replace the caps, shake the bottles, and set them to the side so they’re ready to use later. [8] X Research source If your bottles don't come with a nozzle, prepare them for the tie-dyeing process by using a thumbtack to poke a hole through the lid of each water bottle after they’ve been filled. That way you can squeeze the bottle and distribute the color with a little more control."
    },
    {
      "title": "Soak your fabric in a 1:1 mixture of water to vinegar for 30 minutes.",
      "content": "Soak your fabric in a 1:1 mixture of water to vinegar for 30 minutes. Put your clothes into the bowl and add enough water and white vinegar to fully saturate them. Depending on what size your bowl or container is, you may need anywhere from 16 ounces (450 g) to 32 ounces (910 g) each of water and white vinegar. [9] X Research source The pre-soak in water and vinegar prepares the clothing to accept the dye."
    },
    {
      "title": "Twist rubber bands around the fabric to create different patterns.",
      "content": "Twist rubber bands around the fabric to create different patterns. After the 30-minute soak, wring out the clothes and prepare them for tie-dyeing. Use rubber bands to wrap them in different places, or try some of these fun designs: [10] X Research source Twist your fabric into a spiral and then wrap two rubber bands around the clothes in an “x” to create a spiral pattern. Roll your fabric into a tube and then place rubber bands periodically around the tube to create stripes. Pinch little tufts of fabric and wrap rubber bands around them to make starbursts. Make a random pattern by scrunching up the clothes and wrapping rubber bands around them wherever you want."
    },
    {
      "title": "Squeeze the dyes onto the different sections of your clothes.",
      "content": "Squeeze the dyes onto the different sections of your clothes. In general, using a single color in a section and then switching to a new color for the next section will create a comprehensive looking shirt. But don’t be afraid to experiment and try mixing colors or doing multiple dyes in one section! You may want to wear gloves during this part, as the dye will stain your hands. Don’t forget to dye each side of the clothes. For easier application, try putting your rubber-banded clothes on a baking tray to keep the dye from getting everywhere."
    },
    {
      "title": "Place your clothes into a resealable plastic bag for at least 8 hours.",
      "content": "Place your clothes into a resealable plastic bag for at least 8 hours. Once you’ve applied the dye, place each item into a plastic bag and let them sit somewhere out of the way for a minimum of 8 hours. [11] X Research source It’s okay if you leave the clothes for longer than 8 hours! You just want to make sure they stay in the bag for that long at a minimum."
    },
    {
      "title": "Submerge the fabric into a bowl filled with cold water and table salt.",
      "content": "Submerge the fabric into a bowl filled with cold water and table salt. After the 8+ hours have passed, take your clothes out of the resealable plastic bags. Fill a bowl with cold water and add 1-2 tablespoons (15-30 grams) of table salt to the water. Put your clothes into the water and hold them down until they’re completely submerged. Let them stay in there for about 5 minutes. [12] X Research source This is a really quick and easy way to set in the dye. Check out the microwaving and baking options for some extra-strength setting methods."
    },
    {
      "title": "Use a microwave to produce more vibrant colors.",
      "content": "Use a microwave to produce more vibrant colors. The heat from the microwave reacts with the dye to make it a little brighter, and it also helps the dye set into the fabric, too. Simply place your bowl of water, salt, and the fabric into the microwave and cover it with plastic wrap. Poke a few holes into the plastic wrap, and microwave the bowl on low for about 2 minutes. [13] X Research source Let the fabric cool down before you try and handle it, or use tongs to remove it from the bowl."
    },
    {
      "title": "Bake your clothes in a mixture of water and citric acid to set the dye.",
      "content": "Bake your clothes in a mixture of water and citric acid to set the dye. Fill a shallow baking pan halfway with water and add in 1 ⁄ 2 cup (120 mL) of citric acid. Stir until the citric acid has dissolved, then submerge your clothes in the pan. Set your oven for 300 °F (149 °C) and bake the clothes for 30 minutes. Let the water and fabric completely cool before you touch it with your bare hands. [14] X Research source You can buy citric acid in the baking aisle at your local grocery store."
    },
    {
      "title": "Rinse out the item under cool water until the water runs clear.",
      "content": "Rinse out the item under cool water until the water runs clear. Regardless of which setting option you used, always rinse your dyed clothes under cool water. The water may be very lightly tinted at first, but before long it should run clear, letting you know that the dye has set into the fabric and won’t bleed out. [15] X Research source If you microwaved or baked your clothes, make sure they are cool to the touch before you rinse them out to protect yourself from burns."
    },
    {
      "title": "Hang the clothes to dry rather than putting them in the dryer.",
      "content": "Hang the clothes to dry rather than putting them in the dryer. The heat from the dryer could fade the dye on the first drying go-around. So instead, hang them out somewhere and let them air dry. [16] X Research source Avoid laying the clothes out flat on a surface. If there is any residual dye, it could leach onto the surface."
    },
    {
      "title": "Clean your clothes separately from other items for the first 2-3 washes.",
      "content": "Clean your clothes separately from other items for the first 2-3 washes. Although the setting process should keep your clothes from bleeding, there is always the off-chance that they might. Wash them separately from other loads to ensure the dye won’t contaminate anything else. [17] X Research source If you have several dyed items of similar color, it’s okay to wash them all together."
    },
    {
      "title": "Wash your dyed items with cold water to prevent them from bleeding.",
      "content": "Wash your dyed items with cold water to prevent them from bleeding. Even after those first 2-3 washes, use cold water to prevent any potential bleeding and also to give the color more longevity. Throw your dyed clothing into the wash with other items that need cold water and you should be good to go! [18] X Research source You can use normal laundry detergent on your dyed items. The soap won’t harm the color in any way."
    },
    {
      "title": "Re-dye your clothes if the color fades over time.",
      "content": "Re-dye your clothes if the color fades over time. One of the great things about dyeing your clothes with food coloring is that it’s easy to give touch-ups over time. Simply repeat the dyeing process to darken an item that has gotten lighter. Keep in mind, too, that you can dye old or stained items of clothing to give them new life."
    }
  ]
}