{
  "url": "https://www.wikihow.com/Distinguish-Between-Acids-and-Bases",
  "title": "How to Distinguish Between Acids and Bases",
  "steps": [
    {
      "title": "Acids are substances with a pH lower than water.",
      "content": "Acids are substances with a pH lower than water. Pure water is a neutral substance with a pH of 7. Any substance with a lower pH is an acid—the lower the pH, the stronger the acid. In chemistry, 3 theories further define acids: [2] X Research source Arrhenius theory : Acids are any substances that increase the concentration of hydronium ions (H 3 O + ) in solution. Brønsted-Lowry theory : Acids are any substances that can act as proton donors. Lewis theory : Acids are any substances that can accept a pair of electrons."
    },
    {
      "title": "Bases are substances with a pH greater than water.",
      "content": "Bases are substances with a pH greater than water. Any substance that has a pH higher than 7 is a base. The higher the pH, the stronger the base. The same 3 theories that define acids also define bases: [3] X Research source Arrhenius theory : Bases are any substances that donate hydroxide ions (OH - ) in solution. Brønsted-Lowry theory : Bases are any substances capable of accepting a proton. Lewis theory : Bases are any substances capable of donating a pair of electrons."
    },
    {
      "title": "Citric acid and vinegar are common acids.",
      "content": "Citric acid and vinegar are common acids. Acids show up frequently in your body and in the foods you eat. Your stomach uses acid to break down and digest food so your body can use the nutrients in it. Other acids are electrolytes, essential for your body to function. [4] X Research source You've probably been encouraged to take vitamin C if you have a cold. Vitamin C is the common name for ascorbic acid, which is found in citrus fruits."
    },
    {
      "title": "Baking soda and bleach are two common bases.",
      "content": "Baking soda and bleach are two common bases. Bases aren't as common in your daily life as acids are, but they are often used in cleaning. Soaps are bases, as well as cleaning products that contain bleach or ammonia. Toothpaste is also a base. [5] X Research source This is why it tastes so weird to drink orange juice (which contains high levels of citric acid ) after you've just brushed your teeth."
    },
    {
      "title": "Acids:",
      "content": "Acids: Acids have the following characteristics: They're sticky They taste sour They have a sickly sweet smell, like soured milk [6] X Research source They have a pH of less than 7.0 They produce hydrogen gas and salt in reaction to metal [7] X Research source"
    },
    {
      "title": "Bases:",
      "content": "Bases: Bases have the following characteristics: They're slippery They taste bitter They have a pH higher than 7.0 They're odorless and capable of neutralizing odors [8] X Research source"
    },
    {
      "title": "Acids usually have the word \"acid\" in their name.",
      "content": "Acids usually have the word \"acid\" in their name. Acids are pretty easy to identify this way, because they're almost always directly called acids—think citric acid, amino acid, or folic acid. Some acids do have more common names that leave off the word, though, so you might have to research the substance to find its scientific name. For example, while you've likely heard of vinegar before, you might not know that it's technically acetic acid . So there's the word acid right in the name, although it's not the name most commonly used for the substance. If you're looking at a chemical formula, acids typically start with H."
    },
    {
      "title": "Bases usually have the word \"hydroxide\" in their name.",
      "content": "Bases usually have the word \"hydroxide\" in their name. This can get tricky because most bases are commonly known by a different name. But if you can track down the scientific name for the substance, it will typically include the word \"hydroxide\" in it if it's a base. Carbonates, such as sodium bicarbonate (baking soda) are also bases. For example, ammonia is also known as ammonium hydroxide. The \"hydroxide\" part of the name tells you it's a base. You can also look at the chemical formula of the substance. If it's a base, it typically ends with hydroxide (OH - )."
    }
  ]
}