{
  "url": "https://www.wikihow.com/Enable-the-Notification-Bar-on-an-Android",
  "title": "2 Simple Ways to Enable + Use the Notification Bar on Android",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. You can find the gear icon in the Quick Menu panel by swiping down from the top of your screen or you can find the app icon on one of your Home screens, in the app drawer, or by searching. [1] X Research source"
    },
    {
      "title": "Tap Lock Screen.",
      "content": "Tap Lock Screen . You might instead see \"Notifications\" or similar language. These menu options will vary between manufacturers. [2] X Research source"
    },
    {
      "title": "Tap the toggle next to Notifications to enable it.",
      "content": "Tap the toggle next to Notifications to enable it. You'll then see your notifications appear on your Lock screen as well as the notification bar at the top of your screen. After you've tapped the toggle to switch it on, you can change the settings here to customize your notifications. If, for instance, you only want your notification to show you the icon of the app that sent the notification, tap View style > Details . You can also tap the switch next to \"Hide content\" to prevent notifications from showing you more than the icon of the app it's coming from. [3] X Research source If you don't like the notification bar, you can hide it using third-party apps ."
    },
    {
      "title": "Open Settings.",
      "content": "Open Settings. You can find the gear icon in the Quick Menu panel by swiping down from the top of your screen or you can find the app icon on one of your Home screens, in the app drawer, or by searching. [4] X Research source"
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . You may see a menu called \"Apps & Notifications\" instead, and then you'll need to tap \"Notifications\" again. [5] X Research source"
    },
    {
      "title": "Tap the toggle next to Swipe left or right for snooze.",
      "content": "Tap the toggle next to Swipe left or right for snooze . Now when you get a notification, you'll be able to snooze it and get a reminder about it later. When you get the notification banner alert, swipe it about half as much as a normal swipe and you'll see the clock icon. Tap that icon and it'll snooze for an hour (or tap the down arrow and select a different time). When you snooze a notification, you'll be reminded about it again at the time you set. For example, if you snoozed a text message notification for 2 hours, you'll get notified about that text message again in 2 hours."
    }
  ]
}