{
  "url": "https://www.wikihow.com/Freeze-Avocados",
  "title": "How to Freeze Avocados",
  "steps": [
    {
      "title": "Choose very ripe avocados.",
      "content": "Choose very ripe avocados."
    },
    {
      "title": "Wash the avocados you're going to freeze.",
      "content": "Wash the avocados you're going to freeze."
    },
    {
      "title": "Peel each avocado.",
      "content": "Peel each avocado. To peel, cut the avocado in half around the seed. Twist each half to open it up. Use a teaspoon to lift out the seed. [1] X Research source"
    },
    {
      "title": "Puree the avocados.",
      "content": "Puree the avocados. Set up your food processor. Add the avocado and for every two avocados, add one tablespoon of lemon or lime juice. Puree. If you can't puree the avocados, then mash them with a fork."
    },
    {
      "title": "Put the pureed avocados into an airtight container.",
      "content": "Put the pureed avocados into an airtight container. Leave a small space between the puree and the lid. [2] X Research source"
    },
    {
      "title": "Label and date.",
      "content": "Label and date. The avocado can be kept frozen for up to 5-6 months."
    },
    {
      "title": "Use.",
      "content": "Use. After freezing, pureed avocado is good use in dips, guacamole, soups, salads, sandwich or wrap spreads and for frosting mixes that use avocado. To thaw, leave the container in the refrigerator 12 to 24 hours before use, to allow gradual thawing. If you can't wait that long, place into a bowl and run cold water over it."
    },
    {
      "title": "Cut a ripe avocado in half.",
      "content": "Cut a ripe avocado in half. Wrap in foil or plastic food wrap."
    },
    {
      "title": "Place each half in the freezer.",
      "content": "Place each half in the freezer. [3] X Research source"
    },
    {
      "title": "When frozen, place each frozen half in a resealable bag.",
      "content": "When frozen, place each frozen half in a resealable bag. Label and date the bag."
    },
    {
      "title": "To thaw, place at room temp for about an hour or place in microwave on defrost or low for just under a minute.",
      "content": "To thaw, place at room temp for about an hour or place in microwave on defrost or low for just under a minute. The resulting pulp works well in guacamole, chocolate pudding, cake batter, etc. [4] X Research source"
    }
  ]
}