{
  "url": "https://www.wikihow.com/Create-Secret-Codes-and-Ciphers",
  "title": "How to Invent and Decode Secret Ciphers and Codes",
  "steps": [
    {
      "title": "Write out words in reverse.",
      "content": "Write out words in reverse. This is a simple way of encoding messages so they can't be understood with just a quick glance. A message like \"Meet me outside\" written in reverse would instead be “Teem em edistuo.” [1] X Research source"
    },
    {
      "title": "Split the alphabet in half and replace each letter in your message with its opposite.",
      "content": "Split the alphabet in half and replace each letter in your message with its opposite. Write out the letters A through M in a single line on a piece of paper. Directly beneath this line, write out the letters N through Z, also in a single line. Change each letter in your message to the letter directly below or above it in the grid you just made. [2] X Research source For example, the letter A would be replaced with N, B with O, C with P, and so on and so forth. By using a reflected alphabet, the message “Hello” would instead become “Uryyb.”"
    },
    {
      "title": "Draw a tic-tac-toe grid to make a pigpen cipher.",
      "content": "Draw a tic-tac-toe grid to make a pigpen cipher . Draw a tic-tac-toe grid on a piece of paper and write out the letters A through I in the grid going from the left to right, top to bottom, one letter per box. In this example: [3] X Research source The first row is made up of the letters A, B, C. The second row has D, E, F. The last row consists of G, H, I."
    },
    {
      "title": "Create a second tic-tac-toe grid, but draw a dot in each box.",
      "content": "Create a second tic-tac-toe grid, but draw a dot in each box. Draw another tic-tac-toe grid next to the first one. Fill the grid in with the letters J through R just like how you did with the first grid. Then, draw small dots in each space of the grid as follows: [4] X Research source In the first row, starting on the left, place a dot in the lower right corner (letter I), on the bottom side in the middle (letter K), and in the lower left corner (letter L). In the second row, starting on the left, place a dot in the middle of the right side (letter M), in the middle of the bottom side (letter N), and in the middle of the left side (letter O). In the third row, starting on the left, place a dot in the upper right corner (letter P), in the middle of the top side (letter Q), and in the upper left corner (letter R)."
    },
    {
      "title": "Draw 2 X-shaped grids and fill in the rest of the letters.",
      "content": "Draw 2 X-shaped grids and fill in the rest of the letters. The first X will contain the letters S, T, U, and V. In the second X, place dots in the open spaces surrounding where the X crosses so there is a dot on each side of the center of the X. Then, fill in the remaining letters W, X, Y, and Z. [5] X Research source In the first (undotted) X shape, write S in the top space, T on the left side, U on the right, and V on the bottom. In the second (dotted) X shape, write W on the top, X on the left side, Y on the right, and Z on the bottom."
    },
    {
      "title": "Use the grid surrounding the letters to write in pigpen cipher.",
      "content": "Use the grid surrounding the letters to write in pigpen cipher. The grid shapes (including dots) surrounding the letters are used as substitutes for the letters themselves. Use your pigpen cipher key to translate messages into and out of pigpen. [6] X Research source"
    },
    {
      "title": "Choose a specific year, month, and day to use in a date-shift cipher.",
      "content": "Choose a specific year, month, and day to use in a date-shift cipher. This might be something with personal significance, or something arbitrary. Write out the date as an unbroken string of numbers. This is going to be your number key, which will be the tool needed by your friend to be able to decode your message. For example, let’s use George Washington's birthday (2/22/1732). The number key would then be 2221732. If you've already agreed to use a date shift cipher with someone, come up with a clue (like “Washington”) you can say to each other to talk about the number key."
    },
    {
      "title": "Write one number of the date-shift number key under each letter of your message.",
      "content": "Write one number of the date-shift number key under each letter of your message. Write out your message on a piece of paper. Underneath the message, write out a single digit of the number key for each letter of your message. When you reach the last digit of the number key, repeat the key from the beginning. For example, using George Washington's birthday (2/22/1732): Message : I'm hungry Enciphering : I.m.h.u.n.g.r.y 2.2.2.1.7.3.2.2 Shift letters forward along the alphabet according to the number key, as in… Coded message : K.O.J.V.U.J.T.A"
    },
    {
      "title": "Use a secret language, like Pig Latin, to both speak and write in code.",
      "content": "Use a secret language, like Pig Latin, to both speak and write in code. When you speak Pig Latin , words that start with a consonant sound move that sound to the end of the word and add “ay.” It’s the same for words starting with a cluster of consonants. Words that start with vowels just get “way” or “ay” added to the end of the word. [7] X Research source Consonant initial examples: pig = igpay ; me = emay ; too = ootay ; wet = etway ; hello = ellohay Consonant cluster initial examples: glove = oveglay ; shirt = irtshay ; cheers = eerschay Vowel initial examples: ate = ateway ; egg = eggay ; until = untilay ; eat = eatay"
    },
    {
      "title": "Think about what you can do to make your code harder to break.",
      "content": "Think about what you can do to make your code harder to break. Code books can be stolen, lost, or destroyed, and modern technologies and computer programs can oftentimes break even strong, well-planned code. But codes can be used to condense long messages into a single line, making them great time savers. Think about the complexity of the symbols or words you’ll use to make your code stronger and less easy to figure out. [8] X Research source"
    },
    {
      "title": "Decide what kinds of messages you’ll use your code on.",
      "content": "Decide what kinds of messages you’ll use your code on. Knowing the purpose of your code from the very start will help you avoid doing any unnecessary work. For example, if your goal is to save time, you might only need a few specific code words or symbols. If you're trying to encode really long and detailed messages, you may need to develop a code book that’s more like a dictionary. Make your codes even more complex by using several different codes in rotation or combination. Just keep in mind that the more codes you use, the more code books you’ll need to make for decoding."
    },
    {
      "title": "Come up with code words or phrases to replace common words.",
      "content": "Come up with code words or phrases to replace common words. Start by using constrained writing to condense common phrases into a single code word. For example, “Reading you loud and clear” can be a random name like “Roy.” Then, replace words that are especially critical to the subject matter of your message with their own unique code words. Things like names, locations, and actions are best to replace with code words. Write down these code words and their meaning in your code book, kind of like a dictionary. You don’t need to make a code word for every single word in your message. Partially coding what you want to say will be just as effective. For example, the following message replaces just the most important words with code words. In this case, “tango” means “walk,” “restaurant” means “museum,” and “Roy” means “reading you loud and clear.” Message: About yesterday. I wanted to say, Roy . I'll tango to the restaurant as planned. Over and out. Meaning: About yesterday. I wanted to say, reading you loud and clear . I'll walk to the museum as planned. Over and out."
    },
    {
      "title": "Apply your code book to messages.",
      "content": "Apply your code book to messages. Use the code words in your code book to start encoding messages. Use just a singular code to make it easier to encode your message, or use multiple codes to make it more complex."
    },
    {
      "title": "Use a key word as an alternative way to encode your message.",
      "content": "Use a key word as an alternative way to encode your message. Write one letter of the key word under each letter of your message. Repeat the key word until you get to the end of your message. Count how many spaces each letter of your message is away from the letter in the key word. Write this number down and repeat for each letter in your message. The encoded message will be a string of numbers that the recipient will need to decode using the key word. [9] X Research source For example, with the key word \"SECRET,\" each letter of your message would convert to the number of letters between it and the corresponding letter of the keyword as you move along the alphabet. One letter of the keyword is assigned to each letter in your message. Keep repeating the keyword until all the letters in your message have a corresponding letter. Message: Hello Encoding: /H/ is 11 letters away from the key /S/ /e/ is the same ( zero ) as the key /E/ /l/ is 9 letters away from the key /C/ And so on... Coded Message: 11; 0 ; 9 ; 6 ; 10"
    },
    {
      "title": "Decode messages using your code book or key.",
      "content": "Decode messages using your code book or key. As you receive coded messages, refer back to your code book or key to make sense of them. This may take you a bit longer at first, but it’ll become more intuitive as you become more familiar with the code. Soon, you’ll be able to read your code like it’s nothing."
    },
    {
      "title": "Employ the code used by Mary, Queen of Scots.",
      "content": "Employ the code used by Mary, Queen of Scots. While trying to send messages during a time of political turmoil, Mary, Queen of Scots, used symbols as a substitute code for English letters and common words. View the code by visiting the UK’s National Archives’ cipher website . Some features of Mary's code you might find useful for your own attempts at code-creating include: [10] X Research source The use of simple shapes for high frequency letters, like Mary's use of a circle for the letter /A/. This saves time while encoding. Common symbols used as part of the new code language, like Mary's use of \"8\" as code for the letter \"Y.\" These can confuse code breakers who might interpret this as a number and not a code symbol. Unique symbols for common words. In Mary's day, \"pray\" and \"bearer\" received unique symbols, but these were more common then than they are today. Still, using symbols for frequent words and phrases saves time and adds complexity. [11] X Research source"
    },
    {
      "title": "Use color code words similar to emergency alerts.",
      "content": "Use color code words similar to emergency alerts. Code phrases can pack a lot of meaning into a single phrase. Many kinds of organizations use specific colors to indicate a certain emergency or other situation, such as the DEFCON system, security alerts, and medical alerts. [12] X Research source To mimic this system, come up with some colors to use as code words that apply to your everyday life. They also don’t have to be emergency-related. For example, instead of saying \"I've got to run to my locker\" among your friends, you might use the code word \"Code green.\" To let your friends know that the person you want to date has entered the room, you might say the code phrase, \"Code pink!\""
    },
    {
      "title": "Encode messages using a book key code.",
      "content": "Encode messages using a book key code. Thankfully, books are fairly easy to come by. Using this method, first decide on a book to use as the key to your code. When encoding a message, locate the word you want to send within the book, then send the recipient 3 numbers: the page number, the line number the word is in, and the position of your word within the line starting from the left. Different editions of books might use different page numbers. To ensure the right book is used as a key, include publication information, like edition, year published, and so on with your book key. For example, you might decide on using Frank Herbert's Dune, with the code looking like the following: Encoded Message: 224.10.1 ; 187.15.1 ; 163.1.7 ; 309.4.4 Decoded Message: I'm hiding my words."
    },
    {
      "title": "Come up with ideas about how you can strengthen your cipher.",
      "content": "Come up with ideas about how you can strengthen your cipher. A cipher uses an algorithm, which is like a process or transformation that is applied to a message consistently. This means that anyone who knows the cipher can translate it. On the other hand, ciphers can be a lot more complex than simple code words, and so might keep your messages more secure form regular folks. Many cryptographers add a key, like the date, to strengthen ciphers. This key adjusts the output values by the corresponding number of the day of the month (on the first, all output values would be changed by one). [13] X Research source"
    },
    {
      "title": "Invent an algorithm to apply to messages.",
      "content": "Invent an algorithm to apply to messages. You can either invent a completely new algorithm, or use an existing one, such as the ROT1 Cipher (also called the Caesar Cipher). This method simply rotates each letter in your message forward by a single letter. [14] X Research source ROT1 Message: Hello ROT1 Enciphered: i ; f ; m ; m ; p Caesar Ciphers can be modified to rotate forward by a different number of letters. So you could make it so that you rotate forward 3 letters instead of just one. In this case “Hello” would become k ; h ; o ; o ; r"
    },
    {
      "title": "Apply your algorithm to start enciphering messages.",
      "content": "Apply your algorithm to start enciphering messages. Add to your algorithm to make it more complex. For example, include a rotating condition to your cipher, like the day of the week. For each day of the week, assign a value, such as 1 through 7. Adjust your cipher by this value when encrypting a message on that day. So on Monday, you shift letters forward by 1. On Tuesday, it’s 2 letters, and so on."
    },
    {
      "title": "Start deciphering incoming messages that follow your cipher.",
      "content": "Start deciphering incoming messages that follow your cipher. Reading your cipher over and over will help make the deciphering process a whole lot easier as you gain experience. The great thing about ciphers is that their algorithms are consistent and usually follow some kind of pattern. Getting in the habit of reading ciphers will help you notice trends and crack them a lot faster."
    },
    {
      "title": "Master Morse Code",
      "content": "Master Morse Code . In spite of its name, Morse Code is actually a cipher, not a code. Dots and dashes represent long and short electrical signals which in turn represent the letters of the alphabet. Common letters in Morse, represented as long ( _ ) and short (.) signals, include: [15] X Research source R ; S ; T ; L = ._. ; _.. ; _ ; ._.. A ; E ; O : ._ ; . ; _ _ _"
    },
    {
      "title": "Make use of transposition ciphers.",
      "content": "Make use of transposition ciphers. Many greats in history, like the genius Leonardo da Vinci, have written out messages as they would look reflected in a mirror. Because of this, enciphering in this fashion is often called “mirror writing.” [16] X Research source When you write your message, write from right to left instead of left to right, and write each letter backwards. Transposition ciphers generally treat messages or the formation of letters visually. The image of the message is physically transformed into something else to hide its meaning. [17] X Research source"
    },
    {
      "title": "Hide messages by writing them in binary.",
      "content": "Hide messages by writing them in binary . Binary is the language of 1's and 0's used by computers. Use a binary alphabet chart to help encipher and decipher your messages. When enciphering your message, be sure to space out each line of binary clearly so the other person knows where one letter ends and the next begins. [18] X Research source The name \"Matt\" would encipher to binary as: 01001101 ; 01000001 ; 01010100 ; 01010100."
    }
  ]
}