{
  "url": "https://www.wikihow.com/Do-a-One-Foot-Spin-in-Figure-Skating",
  "title": "How to Do a One Foot Spin in Figure Skating",
  "steps": [
    {
      "title": "Prepare a two-foot spin.",
      "content": "Prepare a two-foot spin. Have your left arm in front of you and your right arm to your right. Keep your head up, and look to the left. Bend your left leg."
    },
    {
      "title": "Using pivots or a push, begin to spin on two feet.",
      "content": "Using pivots or a push, begin to spin on two feet. Keep your body stable. Feel the center of the spin. Begin to pull your arms into towards your left. Try to do only a few rotations on two feet, so you can have more rotations on one foot."
    },
    {
      "title": "Once you feel centered, lift your right foot up.",
      "content": "Once you feel centered, lift your right foot up. Try bringing your right foot to different heights, from just above the ice to your knee. Do not drop your hip when you lift your leg. Fully bring your arms in to a crossed position."
    },
    {
      "title": "Exit the spin.",
      "content": "Exit the spin. When you are ready to end the spin, put your right foot down, and lift your left foot behind you. Skate on a backward edge with your right arm in front and left arm to the side."
    },
    {
      "title": "Start off by doing 3-4 backwards crossovers.",
      "content": "Start off by doing 3-4 backwards crossovers. If you are right footed, you will spin on your left foot, meaning you will start off your spin by doing right over left backwards crossovers. If you are left footed, you will spin using your right leg, so you will start off your spin from left over right backwards crossovers."
    },
    {
      "title": "After your last crossover, instead of bringing your foot out from the crossover, leave it crossed and off the ice while keeping your other foot planted and leg bent.",
      "content": "After your last crossover, instead of bringing your foot out from the crossover, leave it crossed and off the ice while keeping your other foot planted and leg bent."
    },
    {
      "title": "Bring the arm on the inside of the circle you have made and bring it across your chest.",
      "content": "Bring the arm on the inside of the circle you have made and bring it across your chest. For right footed skaters, this will be your left arm. For left footed skaters, this will be your right arm."
    },
    {
      "title": "Bring the foot you have crossed behind and step out into the circle, with your knee slightly bent.",
      "content": "Bring the foot you have crossed behind and step out into the circle, with your knee slightly bent."
    },
    {
      "title": "Swing your other foot and your hands around at the same time and straighten your knee.",
      "content": "Swing your other foot and your hands around at the same time and straighten your knee."
    },
    {
      "title": "Bring your Right leg up and your foot should be a little below your knee.",
      "content": "Bring your Right leg up and your foot should be a little below your knee."
    },
    {
      "title": "Cross your arms in to your chest.",
      "content": "Cross your arms in to your chest. The tighter you are, the faster you go and the more rotations you'll get."
    },
    {
      "title": "Slowly bring your right leg down as you are spinning",
      "content": "Slowly bring your right leg down as you are spinning"
    },
    {
      "title": "Once it hits the ice, push off backwards with your left foot (if you are a right footed skater) or your right foot (if you are a left footed skater) bring the leg you were spinning on up behind you, as if you are doing a backwards spiral on an inside edge.",
      "content": "Once it hits the ice, push off backwards with your left foot (if you are a right footed skater) or your right foot (if you are a left footed skater) bring the leg you were spinning on up behind you, as if you are doing a backwards spiral on an inside edge."
    }
  ]
}