{
  "url": "https://www.wikihow.com/Find-Surface-Area",
  "title": "How to Find Surface Area",
  "steps": [
    {
      "title": "Define the formula for surface area of a cube.",
      "content": "Define the formula for surface area of a cube. A cube has six identical square sides. Because both the length and width of a square are equal, the area of a square is a 2 , where a is the length of a side. Since there are 6 identical sides of a cube, to find the surface area, simply multiply the area of one side times 6. The formula for surface area (SA) of a cube is SA = 6a 2 , where a is the length of one side. [1] X Research source The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the length of one side.",
      "content": "Measure the length of one side. Each side or edge of a cube should, by definition, be equal in length to the others, so you only need to measure one side. Using a ruler, measure the length of the side. Pay attention to the units you are using. [2] X Research source Mark this measurement down as a . Example: a = 2 cm"
    },
    {
      "title": "Square your measurement for a.",
      "content": "Square your measurement for a . Square the measurement taken for the length of the edge. To square a measurement means to multiply it by itself. When you are first learning these formulas, it might be helpful to write it as SA= 6*a*a . [3] X Research source Note that this step calculates the area of one side of the cube. Example: a = 2 cm a 2 = 2 x 2 = 4 cm 2"
    },
    {
      "title": "Multiply this product by six.",
      "content": "Multiply this product by six. Remember, a cube has six identical sides. Now that you have the area of one side, you need to multiply it by six to account for all six sides. [4] X Research source This step completes the calculation for the cube's surface area. Example: a 2 = 4 cm 2 Surface Area = 6 x a 2 = 6 x 4 = 24 cm 2"
    },
    {
      "title": "Define the formula for surface are of a rectangular prism.",
      "content": "Define the formula for surface are of a rectangular prism. Like a cube, a rectangular prism has six sides, but unlike a cube, the sides are not identical. In a rectangular prism, only opposite sides are equal. [5] X Research source Because of this, the surface of a rectangular prism must take into account the various side lengths making the formula SA = 2ab + 2bc + 2ac . For this formula, a equals the width of the prism, b equals the height, and c equals the length. Breaking down the formula, you can see that you are simply adding up all of the areas of each face of the object. The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the length, height, and width of each side.",
      "content": "Measure the length, height, and width of each side. All three measurements can vary, so all three need to be taken separately. Using a ruler, measure each side and write it down. Use the same units for each measurement. [6] X Research source Measure the length of the base to determine the length of the prism, and assign this to c. Example: c = 5 cm Measure the width of the base to determine the width of the prism, and assign this to a. Example: a = 2 cm Measure the height of the side to determine the height of the prism, and assign this to b. Example: b = 3 cm"
    },
    {
      "title": "Calculate the area of one of the sides of the prism, then multiply by two.",
      "content": "Calculate the area of one of the sides of the prism, then multiply by two. Remember, there are 6 faces of a rectangular prism, but opposite sides are identical. Multiply the length and height, or c and a to find the area of one face. Take this measurement and multiply it by two to account for the opposite identical side. [7] X Research source Example: 2 x (a x c) = 2 x (2 x 5) = 2 x 10 = 20 cm 2"
    },
    {
      "title": "Find the area of the other side of the prism and multiply by two.",
      "content": "Find the area of the other side of the prism and multiply by two. Like with the first pair of faces, multiply the width and height, or a and b to find the area of another face of the prism. Multiply this measurement by two to account for the opposite identical sides. [8] X Research source Example: 2 x (a x b) = 2 x (2 x 3) = 2 x 6 = 12 cm 2"
    },
    {
      "title": "Calculate the area of the ends of the prism and multiply by two.",
      "content": "Calculate the area of the ends of the prism and multiply by two. The final two faces of the prism will be the ends. Multiply the length and width, or c and b to find their area. Multiply this measurement by two to account for both sides. [9] X Research source Example: 2 x (b x c) = 2 x (3 x 5) = 2 x 15 = 30 cm 2"
    },
    {
      "title": "Add the three separate measurements together.",
      "content": "Add the three separate measurements together. Because surface area is the total area of all of the faces of an object, the final step is to add all of the individually calculated areas together. Add the area measurements for all the sides together to find the total surface area. [10] X Research source Example: Surface Area = 2ab + 2bc + 2ac = 12 + 30 + 20 = 62 cm 2 ."
    },
    {
      "title": "Define the surface area formula for a triangular prism.",
      "content": "Define the surface area formula for a triangular prism. A triangular prism has two identical triangular sides and three rectangular faces. To find the surface area, you must calculate the area of all of the sides and add them together. The surface area of a triangular prism is SA = 2A + PH , where A is the area of the triangular base, P is the perimeter of the triangular base, and h is the height of the prism. For this formula, A is the area of a triangle which is A = 1/2bh where b is the base of the triangle and h is the height. P is simply the perimeter of the triangle which is calculated by adding all three sides of the triangle together. The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Calculate the area of the triangular face and multiply by two.",
      "content": "Calculate the area of the triangular face and multiply by two. The area of a triangle is 1 / 2 b*h where b is the base of the triangle and h is the height. Because there are two identical triangle faces we can multiply the formula by two. This makes the calculation for both faces simply, b*h. [11] X Research source The base, b , equals the length of the bottom of the triangle. Example: b = 4 cm The height, h , of the triangular base equals the distance between the bottom edge and the top peak. Example: h = 3 cm Area of the one triangle multiplied by 2= 2(1/2)b*h = b*h = 4*3 =12 cm"
    },
    {
      "title": "Measure each side of the triangle and the height of the prism.",
      "content": "Measure each side of the triangle and the height of the prism. To finish the surface area calculation, you need to know the length of each side of the triangle and the height of the prism. The height is the distance between the two triangular faces. Example: H = 5 cm The three sides refer to the three sides of the triangular base. Example: S1 = 2 cm, S2 = 4 cm, S3 = 6 cm"
    },
    {
      "title": "Determine the perimeter of the triangle.",
      "content": "Determine the perimeter of the triangle. The perimeter of the triangle can be calculated simply by adding up all of the measured sides: S1 + S2 + S3. [12] X Research source Example: P = S1 + S2 + S3 = 2 + 4 + 6 = 12 cm"
    },
    {
      "title": "Multiply the perimeter of the base by the height of the prism.",
      "content": "Multiply the perimeter of the base by the height of the prism. Remember, the height of the prism is distance between the two triangular bases. In other words, multiply P by H. Example: P x H = 12 x 5 = 60 cm 2"
    },
    {
      "title": "Add the two separate measurements together.",
      "content": "Add the two separate measurements together. You will need to add the two measurements from the previous two steps together to calculate the triangular prism's surface area. Example: 2A + PH = 12 + 60 = 72 cm 2 ."
    },
    {
      "title": "Define the surface area formula for a sphere.",
      "content": "Define the surface area formula for a sphere. A sphere has a curved surface and therefore the surface area must use the mathematical constant, pi. The surface area of a sphere is given by the equation SA = 4π*r 2 . [13] X Research source For this formula, r equals the radius of the sphere. Pi, or π, should be approximated to 3.14. The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the radius",
      "content": "Measure the radius of the sphere. The radius of the sphere is half the diameter, or half the distance from one side of the center of the sphere to the other. [14] X Research source Example: r = 3 cm"
    },
    {
      "title": "Square the radius.",
      "content": "Square the radius. To square a number, simply multiply it by itself. Multiply the measurement for r by itself. Remember, this formula can be rewritten as SA = 4π*r*r. [15] X Research source Example: r 2 = r x r = 3 x 3 = 9 cm 2"
    },
    {
      "title": "Multiply the squared radius by an approximation of pi.",
      "content": "Multiply the squared radius by an approximation of pi . Pi is a constant that represents the ratio of a circle’s circumference to its diameter. [16] X Research source It is an irrational number that has many decimal digits. It is frequently approximated as 3.14. Multiply the squared radius by π, or 3.14, to find the area of one circular section of the sphere. [17] X Research source Example: π*r 2 = 3.14 x 9 = 28.26 cm 2"
    },
    {
      "title": "Multiply this product by four.",
      "content": "Multiply this product by four. To complete the calculation, multiply by 4. Find the surface area of the sphere by multiplying the flat circular area by four. [18] X Research source Example: 4π*r 2 = 4 x 28.26 = 113.04 cm 2"
    },
    {
      "title": "Define the surface area formula for a cylinder.",
      "content": "Define the surface area formula for a cylinder. A cylinder has two circular ends enclosing a rounded surface. The formula for surface area of a cylinder is SA = 2π*r 2 + 2π*rh , where r equals the radius of the circular base and h equals the height of the cylinder. Round pi or π off to 3.14. [19] X Research source 2π*r 2 represents the surface area of the two circular ends while 2πrh is the surface area of the column connecting the two ends. The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the radius and height of the cylinder.",
      "content": "Measure the radius and height of the cylinder. The radius of a circle is half of the diameter, or half the distance from one side of the center of the circle to the other. [20] X Research source The height is the total distance of the cylinder from end to end. Using a ruler, take these measurements and write them down. Example: r = 3 cm Example: h = 5 cm"
    },
    {
      "title": "Find the area of the base and multiply by two.",
      "content": "Find the area of the base and multiply by two. To find the area of the base, you simply use the formula for area of circle, or π*r 2 . To complete the calculation, square the radius and multiply by pi . Multiply by two to take into account the second identical circle on the other end of the cylinder. [21] X Research source Example: Area of base = π*r 2 = 3.14 x 3 x 3 = 28.26 cm 2 Example: 2π*r 2 = 2 x 28.26 = 56.52 cm 2"
    },
    {
      "title": "Calculate the surface area of the cylinder itself, using 2π*rh.",
      "content": "Calculate the surface area of the cylinder itself, using 2π*rh. This is the formula to calculate the surface area of a tube. The tube is the space between the two circular ends of the cylinder. Multiply the radius by two, pi , and the height. [22] X Research source Example: 2π*rh = 2 x 3.14 x 3 x 5 = 94.2 cm 2"
    },
    {
      "title": "Add the two separate measurements together.",
      "content": "Add the two separate measurements together. Add the surface area of the two circles to the surface area of the space between the two circles to calculate the total surface area of the cylinder. Note, adding these two pieces together allows you to recognize the original formula: SA =2π*r 2 + 2π*rh . [23] X Research source Example: 2π*r 2 + 2π*rh = 56.52 + 94.2 = 150.72 cm 2"
    },
    {
      "title": "Define the surface area formula for a square pyramid.",
      "content": "Define the surface area formula for a square pyramid. A square pyramid has a square base and four triangular sides. It is defined as the total lateral area of the base. Remember, the area of the square is the length of one side squared. The area of a triangle is 1/2sl (side of the triangle times the length or height of the triangle). Because there are four triangles, to find the total surface area, you must multiply by four. Adding all of these faces together yields the equation of surface area for a square pyramid: SA = s 2 + 2sl . [24] X Research source For this equation, s refers to the length of each side of the square base and l refers to the slant height of each triangular side. The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the slant height and base side.",
      "content": "Measure the slant height and base side. The slant height, l , is the height of one of the triangular sides. It is the distance between the base to the peak of the pyramid as measured along one flat side. The base side, s , is the length of one side of the square base. Because the base is square, this measurement is the same for all sides. Use a ruler to make each measurement. [25] X Research source Example: l = 3 cm Example: s = 1 cm"
    },
    {
      "title": "Find the area of the square base.",
      "content": "Find the area of the square base. The area of a square base can be calculated by squaring the length of one side, or multiplying s by itself. Example: s 2 = s x s = 1 x 1 = 1 cm 2"
    },
    {
      "title": "Calculate the total area of the four triangular faces.",
      "content": "Calculate the total area of the four triangular faces. The second part of the equation involves the surface area of the remaining four triangular sides. Using the formula 2ls, multiply s by l and two. Doing so will allow you to find the area of each side. [26] X Research source Example: 2 x s x l = 2 x 1 x 3 = 6 cm 2"
    },
    {
      "title": "Add the two separate areas together.",
      "content": "Add the two separate areas together. Add the total area of the sides to the area of the base to calculate the total surface area. Example: s 2 + 2sl = 1 + 6 = 7 cm 2"
    },
    {
      "title": "Define the surface area formula for a cone.",
      "content": "Define the surface area formula for a cone. A cone has a circular base and a rounded surface that tapers into a point. To find the surface area, you need to calculate the area of the circular base and the surface of the cone and add these two together. The formula for surface area of a cone is: SA = π*r 2 + π*rl , where r is the radius of the circular base, l is the slant height of the cone, and π is the mathematical constant pi (3.14). [27] X Research source The units of surface area will be some unit of length squared: in 2 , cm 2 , m 2 , etc."
    },
    {
      "title": "Measure the radius and height of the cone.",
      "content": "Measure the radius and height of the cone. The radius is the distance from the center of the circular base to the side of the base. The height is the distance from the center of the base to the top peak of the cone, as measured through the center of the cone. [28] X Research source Example: r = 2 cm Example: h = 4 cm"
    },
    {
      "title": "Calculate the slant height (l) of the cone.",
      "content": "Calculate the slant height ( l ) of the cone. Because the slant height is actually the hypotenuse of a triangle, you must use the Pythagorean Theorem to calculate it. Use the rearranged form, l = √ (r 2 + h 2 ) , where r is the radius and h is the height of the cone. Example: l = √ (r 2 + h 2 ) = √ (2 x 2 + 4 x 4) = √ (4 + 16) = √ (20) = 4.47 cm"
    },
    {
      "title": "Determine the area of the circular base.",
      "content": "Determine the area of the circular base. The area of the base is calculated with the formula π*r 2 . After measuring the radius, square it (multiply it by itself) and then multiply that product by pi. [29] X Research source Example: π*r 2 = 3.14 x 2 x 2 = 12.56 cm 2"
    },
    {
      "title": "Calculate the surface area of the top of the cone.",
      "content": "Calculate the surface area of the top of the cone. Using the formula π*rl, where r is the radius of the circle and l is the slant height previously calculated, you can find the surface area of the top part of the cone. [30] X Research source Example: π*rl = 3.14 x 2 x 4.47 = 28.07 cm"
    },
    {
      "title": "Add two areas together to find total surface area.",
      "content": "Add two areas together to find total surface area. Calculate the final surface area of your cone by adding the area of the circular base to the calculation from the previous step. [31] X Research source Example: π*r 2 + π*rl = 12.56 + 28.07 = 40.63 cm 2"
    }
  ]
}