{
  "url": "https://www.wikihow.com/Dye-White-Jeans-Cream",
  "title": "How to Dye White Jeans Cream",
  "steps": [
    {
      "title": "Choose jeans that are made of mostly cotton.",
      "content": "Choose jeans that are made of mostly cotton. Cotton material takes on dye the best and will hold color better. Take a look at the tag of your jeans to see what they are made out of, and be sure they are at least 95% cotton. [1] X Research source Some jeans will be made of a cotton polyester blend, which is fine as long as they are mostly cotton."
    },
    {
      "title": "Fill up a large pot with about 8 cups (1,900 mL) of water.",
      "content": "Fill up a large pot with about 8 cups (1,900 mL) of water. Use a pot that is large enough to fit your jeans at the bottom. Pour enough water in the bottom to fill about half of the pot. [2] X Research source The more water you add, the longer it will take to heat up. Try to use the bare minimum to make it faster."
    },
    {
      "title": "Simmer the water and steep 3 to 4 black tea bags in it for 1 hour.",
      "content": "Simmer the water and steep 3 to 4 black tea bags in it for 1 hour. Turn your stovetop to medium heat until small bubbles start forming towards the top of the water. Place 3 to 4 black tea bags in the water and let the pot sit on the stove. If it starts to boil, turn the heat down. [3] X Research source"
    },
    {
      "title": "Wet your pants with cold water.",
      "content": "Wet your pants with cold water. Take your pants to the sink and quickly dampen them all over. The water makes them more receptive to taking the tea dye so that it will stick longer. Wring out the excess water before you take them out of the sink. [4] X Research source"
    },
    {
      "title": "Take the tea bags out of the water and submerge your jeans in it.",
      "content": "Take the tea bags out of the water and submerge your jeans in it. Use a slotted spoon to scoop the tea bags out of the pot and put them in the garbage. Put your jeans into the pot of water and push them down with a wooden spoon until they are fully submerged. [5] X Research source Make sure your jeans are fully submerged in the water so that they get an even color all over."
    },
    {
      "title": "Keep your jeans in the pot for 1 to 3 hours.",
      "content": "Keep your jeans in the pot for 1 to 3 hours. Stir your jeans occasionally with a wooden spoon. Check on your jeans after 1 hour to see if they are the color that you want. If they aren’t, leave them in for longer so that they get darker. [6] X Research source Since cream is a lighter color, your jeans will probably be ready after 1 hour. They could start to turn tan if you leave them in much longer."
    },
    {
      "title": "Soak your jeans in cold water and vinegar for 15 minutes.",
      "content": "Soak your jeans in cold water and vinegar for 15 minutes. Take your jeans out of the tea and wring out the excess liquid. Submerge them in a bucket or large bowl full of cold water and a 1 teaspoon (4.9 mL) of white vinegar to help set the tea into the fabric of your jeans. [7] X Research source Tea tends to wash out quickly, so using vinegar to set the fabric will help keep the longevity of the color."
    },
    {
      "title": "Rinse your jeans with cold water.",
      "content": "Rinse your jeans with cold water. Take your jeans out of the water and vinegar mixture and rinse them in the sink. Make sure there is no vinegar left so that your pants don’t smell like vinegar. [8] X Research source"
    },
    {
      "title": "Dry your jeans before you wear them.",
      "content": "Dry your jeans before you wear them. Set them out to air dry or throw them in your dryer so they are ready quicker. Enjoy your new pair of cream-colored jeans! [9] X Research source You can wash your jeans with cold water in your washing machine if they get dirty after you wear them. Try to air dry them as much as possible to avoid fading. You may have to re-dye your jeans every year or so as they fade."
    },
    {
      "title": "Pick jeans that are made of mostly cotton.",
      "content": "Pick jeans that are made of mostly cotton. Most fabric dyes specify what materials they can be used for, but many are made specifically for cotton or cotton blends. Check the tag of your jeans to figure out what they are made of. [10] X Research source If your jeans have a polyester blend of 5% or less, the fabric dye will work just fine."
    },
    {
      "title": "Wash and dry your jeans according to their instructions.",
      "content": "Wash and dry your jeans according to their instructions. Read the tag on your jeans and put them through a wash and dry cycle according to the tag. Make sure they are fully dry and clean before you start dyeing so you aren’t left with patches of color. [11] X Research source"
    },
    {
      "title": "Fill a pot with 3 gallons (11 L) of hot water from the sink.",
      "content": "Fill a pot with 3 gallons (11 L) of hot water from the sink. Choose a pot large enough for your jeans to be submerged at the bottom. Fill it up about halfway with the hottest water that your sink can produce, but make sure it isn’t boiling or simmering. [12] X Research source Hot water helps to open up the fibers of your jeans and make them accept the dye."
    },
    {
      "title": "Add 1 cup (128 g) of table salt to the water and stir it in.",
      "content": "Add 1 cup (128 g) of table salt to the water and stir it in. Make sure the salt is fully dissolved in the water and there aren’t any clumps left. Salt acts as a dye fixative that will make the cream color of your jeans last longer. [13] X Research source Use table salt to make it dissolve faster."
    },
    {
      "title": "Pour in 0.5 cups (120 mL) of cream-colored liquid dye.",
      "content": "Pour in 0.5 cups (120 mL) of cream-colored liquid dye. Use a wooden spoon to stir it into the water and salt mixture. Make sure it is spread evenly throughout the liquid so that your jeans don’t end up patchy. [14] X Research source You can buy cream-colored dye at most craft supply stores."
    },
    {
      "title": "Submerge your jeans in the dye and stir them occasionally for 10 to 30 minutes.",
      "content": "Submerge your jeans in the dye and stir them occasionally for 10 to 30 minutes. Pull your jeans up out of the water after 10 minutes and check on their color. If you like it, you can take the jeans out then. If you want them to be darker, put them back in the dye mixture and keep stirring them around with a wooden spoon. [15] X Research source If you are going for a light cream color, your jeans will probably be ready in about 10 minutes."
    },
    {
      "title": "Fill a separate bucket with water and dye fixative.",
      "content": "Fill a separate bucket with water and dye fixative. Mix 3 gallons (11 L) of hot water and 4 tablespoons (59 mL) of dye fixative together in a pot or bucket and stir them together with a wooden spoon. Dye fixative helps bond the dye with the jeans so that it doesn’t wash out. [16] X Research source You can find dye fixatives near the fabric dye at most craft supply stores."
    },
    {
      "title": "Stir the jeans occasionally in the fixative mixture for 20 minutes.",
      "content": "Stir the jeans occasionally in the fixative mixture for 20 minutes. Pick your jeans up out of the dye and wring out the excess liquid. Stir them around with a wooden spoon in the fixative so that the dye adheres to the fabric of your jeans. [17] X Research source"
    },
    {
      "title": "Rinse your jeans with cold water.",
      "content": "Rinse your jeans with cold water. Wring out your jeans to get out the excess liquid and rinse them off in your sink until the water runs clear. Squeeze out any excess water into your sink so that they dry faster. [18] X Research source Cold water helps the dye stick to the fabric."
    },
    {
      "title": "Let your jeans dry before you wear them.",
      "content": "Let your jeans dry before you wear them. Spread them out on a clothes rack inside or outside and let them dry completely, or throw them in the dryer for a faster dry. Show off your new pair of cream-colored jeans! [19] X Research source You can wash and dry your jeans like normal after you wear them a few times."
    }
  ]
}