{
  "url": "https://www.wikihow.com/Do-Cops-Have-Quotas",
  "title": "Do Police Officers Have Quotas?",
  "steps": [
    {
      "title": "Yes, there’s good evidence that a lot of departments have quotas.",
      "content": "Yes, there’s good evidence that a lot of departments have quotas. A quota refers to a top-down order for police officers to secure a specific number of tickets and/or arrests each month. There is enough documented proof to indicate that many (but not all) police departments do have quotas—even if they don’t necessarily call them that. [1] X Research source Police departments in super-large cities are less likely to have quotas since there’s more political oversight. Quotas also appear to be less common in super-small towns with tiny police forces that don’t need the revenue. [2] X Research source The money from the tickets written by officers with quotas doesn’t usually go to the department. It gets split up between city and state funding. If the city and state are happy though, the police department is likely to get more support. [3] X Research source"
    },
    {
      "title": "In some states, it’s illegal for police to have quotas.",
      "content": "In some states, it’s illegal for police to have quotas. At least 20 states currently have laws on the books that make police arrest and ticket quotas illegal. Even in the states that don’t have laws prohibiting ticket quotas, many counties and cities have passed local ordinances making the implementation of quotas illegal. However, there are still states, cities, and counties that have no prohibitions. [4] X Research source States with a quota ban include Arkansas, California, Connecticut, Florida, Illinois, Iowa, Louisiana, Michigan, Minnesota, Missouri, Montana, Nebraska, New Jersey, New York, North Carolina, Pennsylvania, Rhode Island, South Carolina, Virginia, and Wisconsin."
    },
    {
      "title": "Departments call their quotas something less divisive.",
      "content": "Departments call their quotas something less divisive. The most common strategy police departments use is to just call the quota something other than a “quota.” Police departments all over the country will refer to “benchmarks,” “productivity goals,” “targets,” “objectives,” or “performance stats.” These are often treated the same way as quotas—officers are pushed to reach a certain number of tickets or arrests to prove they've reached their “goal.” [5] X Research source If there is a specific number of arrests or tickets set as the “goal” or “target,” it’s functionally the same thing as a quota since the incentive is for officers to arrest a certain number of people or write a certain number of tickets—not only when it’s necessary."
    },
    {
      "title": "Captains and superintendents punish cops who don’t write tickets.",
      "content": "Captains and superintendents punish cops who don’t write tickets. It’s less common than simply disguising a quota as something else, but there are examples of police departments punishing officers who don’t stick with the program. [6] X Research source For example, an officer may be demoted, sent to desk duty, denied overtime, or punished with bad performance reviews if they consistently don’t meet targets. [7] X Research source"
    },
    {
      "title": "Departments reward officers who write a lot of tickets.",
      "content": "Departments reward officers who write a lot of tickets. In some police departments, quotas are enforced via social pressure and rewards. For example, an officer who consistently writes the most tickets or makes the most arrests will be promoted or given more overtime. This can create a feedback loop where the entire department is eventually just pushing for higher and higher quotas. [8] X Research source"
    },
    {
      "title": "Quotas encourage officers not to exercise restraint.",
      "content": "Quotas encourage officers not to exercise restraint. At their absolute best, a quota gives an officer a reason to not cut people a break when it comes to writing tickets or arresting people for minor offenses. At their worst, quotas can drive officers to look unnecessarily for tiny violations, which is a gross misuse of an officer’s time. [9] X Research source This is why many police departments are beginning to revise their methods for promoting officers. More arrests and more tickets does not automatically mean a police officer is good at their job. An officer who occasionally lets people off with a warning or doesn’t arrest someone for minor violations is probably better for the community in the long run! [10] X Research source"
    },
    {
      "title": "Contact your local clerk’s office and ask for info.",
      "content": "Contact your local clerk’s office and ask for info. The local city (or county) clerk is responsible for tracking and documenting all public records, laws, and legislative actions. Call your local clerk and ask them if the police department has a quota. If they aren’t sure, ask them for the police department’s handbook. They’ll give you a copy and you can scan it to see if there’s anything about quotas in there. [11] X Research source If you live in a major city, you can usually just google, “Detroit Police Policies” or “New York City Law Enforcement Handbook” to get the info you need. It’s possible a police department still has a quota even if there’s nothing on the books if the quota manifests as an unwritten social pressure to maximize arrests/tickets."
    },
    {
      "title": "Drive 5 mph (8.0 km/h) under the speed limit at all times.",
      "content": "Drive 5 mph (8.0 km/h) under the speed limit at all times. Never give the police an excuse to pull you over for speeding. It’s easy to say, “Oh, I’ll just stick to the speed limit,” but it’s extremely easy to space out a bit as you drive and find yourself breaking the speed limit—even if you’re technically driving safely. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source There seems to be a huge overlap between “police departments who have quotas” and “police departments who employ speed traps,” so don’t give them an opportunity to pull you over."
    },
    {
      "title": "Stay up to date on your registration and insurance.",
      "content": "Stay up to date on your registration and insurance. Always keep your car street-legal. Update your state (and city, if necessary) registration to ensure your car is never unregistered. Also, keep your insurance up to date. Police officers have a very easy time running your plate to see if the insurance or registration is out of date."
    },
    {
      "title": "Practice defensive driving to stay safe on the road.",
      "content": "Practice defensive driving to stay safe on the road. Let people turn, brake early when approaching a light or another car, and keep the gap between you and the car in front of you sizable. If you put yourself in a situation where you have to make an evasive maneuver or speed up to avoid danger, you could end up in the eyes of a police cruiser. [13] X Research source"
    },
    {
      "title": "Be extra cautious in touristy areas or during holidays.",
      "content": "Be extra cautious in touristy areas or during holidays. Police departments are often more diligent and intense when it comes to arrests and citations in busy areas or during holidays that often involve alcohol. So, don’t break any laws or take any risks when you’re on vacation, visiting a big nightlife area, or driving around during a major holiday. [14] X Research source This is especially important when it comes to anything where you’re going to be consuming alcohol and going out in public. If you’re doing a pub crawl in Prague, visiting Bourbon Street in New Orleans, or going out in Miami Beach, play it safe to avoid attracting unwanted attention from an officer."
    }
  ]
}