{
  "url": "https://www.wikihow.com/Design-an-Effective-Base-in-Clash-of-Clans",
  "title": "How to Design an Effective Base in Clash of Clans",
  "steps": [
    {
      "title": "Decide which type of base you want to have.",
      "content": "Decide which type of base you want to have. There are three main types of bases: Farming, Trophy, and Hybrid. A farming base is a type of base mostly active when you farm . The main idea of this base is to leave your town hall away outside your walls. You may lose some trophies. Don't worry, because you will rewarded with a 12 hours shield during which no one can attack your village! You also generally keep your storages and possibly your collectors inside your walls. A trophy base is one in which you put your town hall inside your base, and your trophies are the most important thing to you. It is just the opposite of the farming base. You will risk losing your resources. A hybrid base is one where it defends your trophies and resources equally."
    },
    {
      "title": "Decide what you want to make your layout.",
      "content": "Decide what you want to make your layout. Some popular base designs are: An egg-shell base is where the base is surrounded with multiple walls. For example one core surrounded by walls, with an outer layer of walls surrounding less important buildings. A compartment base is where all of the most important buildings have their own compartment, and less important buildings go outside the base. These form an extra \"building wall.\" A bulkhead base is kind of like the Titanic. The idea is that there is multiple compartments, so if your enemies flood one section, the others will support it. It is sort of a mix between an egg-shell and a compartment base. A modified compartment base is where your compartments hold 2-3 buildings instead of each compartment holding only one."
    },
    {
      "title": "Keep splash damage buildings close to the center.",
      "content": "Keep splash damage buildings close to the center. These are some of the most important buildings to keep close to the center of your base. The mortars especially are important, because of their huge range and weak zone. The wizard towers give you a bit more leniency, because they have a smaller range and no weak spot."
    },
    {
      "title": "Centralize any buildings in your \"normal\" category, including archer towers and cannons.",
      "content": "Centralize any buildings in your \"normal\" category, including archer towers and cannons. The best thing to do with is make sure they offer each other coverage. This way, if one tower is being attacked, the others are taking out of the attackers. Also in this category is the air defense. You want to centralize these, because if they get destroyed, your base is easy picking for dragons."
    },
    {
      "title": "Follow your gut with your traps.",
      "content": "Follow your gut with your traps. They're some of the most versatile buildings in the game. They can be used for several techniques, including funneling and wall-breaker sniping (see part three). Basically, have fun with them. If you want to make a troll base, make one. Just do what you want."
    },
    {
      "title": "Use \"double-walling\".",
      "content": "Use \"double-walling\". This is where you put one wall layer, then a space, and then another wall. This way, archers can't shoot over the wall."
    },
    {
      "title": "Build a \"troll base\".",
      "content": "Build a \"troll base\". This is where you place a \"accidental\" hole in the middle of your base, and load it with traps. You also surround it with good defensive buildings, so inexperienced players will put down loads of troops then get them blown up."
    },
    {
      "title": "Use funneling.",
      "content": "Use funneling. This is where you make an \"accidental\" hole in your wall, so troops will go inside there and get blown sky-high by the traps you set."
    },
    {
      "title": "Use wall-breaker sniping.",
      "content": "Use wall-breaker sniping. This is where you put a wall with broken spots in it, and put spring traps in that hole. That way, the wall-breakers will get sprung into the sky instead of breaking your wall."
    }
  ]
}