{
  "url": "https://www.wikihow.com/Eat-Durian",
  "title": "How to Eat Durian",
  "steps": [
    {
      "title": "Put on gloves.",
      "content": "Put on gloves. When opening a durian , gloves are important for several reasons. For one, they’ll protect your hands from the spikes on the outside of the fruit. They’ll also keep your hands from smelling like the fruit, which some people find unpleasant. Finally, the gloves will also help you hold the durian steady as you cut into it. You can use thick rubber gloves, clean gardening gloves, a baseball mitt, or even a clean towel to protect your hands. [1] X Research source"
    },
    {
      "title": "Cut off the stem.",
      "content": "Cut off the stem. Turn the durian on its side and hold it firmly in place with one hand. On the other hand, use a sharp knife to carefully slice the stem from the top of the fruit. Cut off the stem and a small sliver from the top of the shell. Turn the durian over and rest it on the cut edge. [2] X Research source Cutting a sliver from the top of the fruit will give you an even edge to rest the durian on as you cut into it."
    },
    {
      "title": "Locate the seams.",
      "content": "Locate the seams. The fruit inside a durian grows in pods, and the shell grows in sections around these pods. As such, the durian will have seams where the shell comes together, and you can open the fruit easily by locating and cutting the seams. The seams of a ripe durian will start to tear apart on their own, so you may not even have to cut into the fruit. [3] X Research source"
    },
    {
      "title": "Make deep scores in the shell at the seams.",
      "content": "Make deep scores in the shell at the seams. For durians that aren't perfectly ripe, use a sharp knife to carefully cut along the seams of the fruit. Start with a shallow cut, and then cut progressively deeper until the sections of the shell start coming apart. Cut the entire length of the seam. Repeat with each seam in the shell. Cutting in progressively deeper slices will ensure you cut deeply enough to crack the shell, but not so deeply that you score the fruit underneath. [4] X Research source"
    },
    {
      "title": "Pry the shell apart.",
      "content": "Pry the shell apart. Once you’ve made cuts deep enough in the seam that you can open the shell, put the knife down. Pick a seam to start and stick your thumbs or fingers on both sides of the opening. Pull the seams away from each other to open the shell and reveal the pod of fruit inside. [5] X Research source Repeat with all the seams to reveal all the pods of flesh."
    },
    {
      "title": "Remove the pods of flesh.",
      "content": "Remove the pods of flesh. When the shell has been fully cracked open, the sections of the shell will come apart in wedges. Inside each wedge will be a pod of fruit. You'll be able to pull the fruit away from the shell easily if the durian is ripe. Otherwise, use a sharp knife to cut away the fibrous parts attaching the pod to the shell, and then remove the fruit. The edible fruit of a durian is the soft and yellowish pod-like flesh at the center of each wedge. [6] X Research source"
    },
    {
      "title": "Eat the fruit with your hands.",
      "content": "Eat the fruit with your hands. Durian fruit is soft and custard-like, so you'll be able to tear pieces off the pods easily. Remove a bite-sized chunk from one of the pods and eat the fruit with your hands. Continue tearing off bites and eating the fruit with your hands. A single cup (243 g) of durian contains over 350 calories, and it’s also high in fat and sugar. However, durian also contains lots of nutrients, including vitamins C and B6, iron, manganese, fiber, and potassium. [7] X Research source Some people find durian to have a pungent fruity flavor, while others think it tastes like onions, rotting, or turpentine. Durian is an acquired taste, so don’t worry if you don’t like it."
    },
    {
      "title": "Eat around the seed.",
      "content": "Eat around the seed. Inside each pod of flesh will be a dark seed that’s similar in size to a date. [8] X Research source This seed isn't edible. You can either cut out the seed before you start eating, pull it out with your fingers, or eat around it like you would with a cherry."
    },
    {
      "title": "Slice the fruit into pieces as an alternative.",
      "content": "Slice the fruit into pieces as an alternative. Instead of eating durian with your hands, you can slice the pods into thin slivers to serve them on a platter or with other foods. After you remove the pod from the shell, place the fruit on a cutting board. Use a knife to slice the durian into small sections. Remove the seed when you find it. [9] X Research source"
    },
    {
      "title": "Serve durian with sticky rice and coconut milk.",
      "content": "Serve durian with sticky rice and coconut milk. Fill a bowl with freshly made sticky rice. Layer a few slices of fresh durian on top of the rice, and drizzle coconut milk on top. For a sweeter treat, top the rice and fruit with mildly sweetened coconut milk. [10] X Research source You can also combine the durian with mango and other fresh fruits."
    },
    {
      "title": "Try durian ice cream.",
      "content": "Try durian ice cream. Durian ice cream is a popular treat in many Asian countries. If you're not able to find this chilled dessert, you can always make your own ice cream and flavor it with chunks of fresh durian. If you don’t like the taste of durian right away, try durian flavored snacks like ice cream and chips to help you acquire a taste for it. [11] X Research source"
    },
    {
      "title": "Snack on durian chips.",
      "content": "Snack on durian chips. Durian chips are pieces of durian that have been sliced and deep-fried. You can buy these in many Asian markets, Asian grocery stores around the world, or online from specialty grocery sites. Durian chips have a milder flavor and taste like slightly fruity potato chips. [12] X Research source"
    },
    {
      "title": "Try it with other fruit.",
      "content": "Try it with other fruit. Durian is a great addition to a fresh fruit cocktail. Cut the durian into small chunks and combine it with other tropical fruits, such as mango, papaya, guava, coconut, and pineapple. You can even add in some nuts and toasted coconut to make a more substantial snack. [13] X Research source"
    }
  ]
}