{
  "url": "https://www.wikihow.com/Cut-a-Tank-Top",
  "title": "How to Cut a Tank Top",
  "steps": [
    {
      "title": "Get a ribbed tank top with wide shoulder straps.",
      "content": "Get a ribbed tank top with wide shoulder straps. The exact width of the shoulder straps does not matter, but something that’s at least 1 in (2.5 cm) would be good. For best results, choose a tank top that has a binding around the armholes and collar, rather than hems. [1] X Research source You can use another knitted material, such as your basic jersey (T-shirt) material, but most tank tops with wide shoulder straps will be ribbed."
    },
    {
      "title": "Cut a notch into the shoulder seam, within the collar and armhole hems.",
      "content": "Cut a notch into the shoulder seam, within the collar and armhole hems. Do not cut straight across the top of the shoulders, or the shirt will fall apart. Just cut a small notch into the shoulder of your tank top, but don't cut past the hems on the armhole or collar. [2] X Research source Most tank tops have a binding around the hem, like bias tape. If yours doesn’t have this binding, just stay within the stitched hem instead. Try to make the notch go across the entire shoulder, while still trying within the hems. This will make it even easier to cut the fabric later!"
    },
    {
      "title": "Cut around the armhole, stopping just below the collar level.",
      "content": "Cut around the armhole, stopping just below the collar level. Start at the notch you made and cut down the front of the tank, using the armhole's binding as a guide. Finish cutting when you’re at the same level as the bottom edge of the collar, or just below it. Use the edge of the binding or stitching as a guide. [3] X Research source Repeat this step for the back of the tank. Keep in mind that the collar in the back will be a lot higher up."
    },
    {
      "title": "Cut around the collar in a similar fashion but stop just before it curves.",
      "content": "Cut around the collar in a similar fashion but stop just before it curves. Begin at the top of the collar, at the shoulder notch, and finish at the bottom, just before it starts to curve out horizontally. [4] X Research source Repeat this step for the back of the tank. Remember, the collar will be shallower! You're cutting the collar side of the strap shorter than the armhole side because you’ll be cutting the final piece off at an angle. Cut alongside the vertical part of the collar, not the horizontal section."
    },
    {
      "title": "Snip the strips off at an angle in the front and back of the tank.",
      "content": "Snip the strips off at an angle in the front and back of the tank. After you’ve cut around the collar and armhole, you’ll end up with strips of loose fabric in the front and back of your tank. Cut these strips off at an angle where they connect to the rest of the shirt. [5] X Research source This will give you 2 thin straps that are intact at the shoulder."
    },
    {
      "title": "Clean up the cut edges with smaller scissors for a neater finish.",
      "content": "Clean up the cut edges with smaller scissors for a neater finish. Cut as close as possible to the fabric that's wrapped around the edges of the collar and armholes. This helps the straps look more like slender spaghetti straps. [6] X Research source Once you’ve finished one strap, repeat the entire process on the other side!"
    },
    {
      "title": "Choose a tank top made from stretchy material.",
      "content": "Choose a tank top made from stretchy material. You will be wrapping the cut straps of this tank around your torso, so it’s important that the material stretches. The longer the tank top is, the easier it will be to wrap. [7] X Research source"
    },
    {
      "title": "Turn the tank inside-out and cut the side seams off halfway up the sides.",
      "content": "Turn the tank inside-out and cut the side seams off halfway up the sides. Do not cut the side seams off all the way up to the armpits; just slice them open halfway up on each side of the tank. This will divide the tank top into 2 panels: a front panel and a back panel. [8] X Research source If you're worried about the stitching unraveling, hand sew a few stitches over the cut ends. Hold the tank top against you, then make a mark where you want it to end. Cut the side seams off up to this mark."
    },
    {
      "title": "Cut the back panel off where you stopped cutting the side seams.",
      "content": "Cut the back panel off where you stopped cutting the side seams. Turn the tank top so that the back is facing you. Tuck the front panel of the tank top out of the way, then cut the back panel off. Start cutting at one side seam and finish cutting at the other. [9] X Research source You are essentially cutting half of the tank top off. Use the bottom cut edge of each side seam as a guide. Do not cut through the front panel. This will make the ties!"
    },
    {
      "title": "Cut a vertical slit into the center of the front panel, halfway up the tank.",
      "content": "Cut a vertical slit into the center of the front panel, halfway up the tank. Unfold the front panel so that it sticks out from under the back of the shirt. Find the middle of the hem on the front panel, then cut a vertical line, straight up to the bottom edge of the back panel. [10] X Research source You can always cut from the front of the shirt, but it'll be harder to see where you should stop cutting!"
    },
    {
      "title": "Put the shirt on, then cross and tuck the front ties across your chest.",
      "content": "Put the shirt on, then cross and tuck the front ties across your chest. Put the tank top on, then wrap the 2 ties across your chest. Angle them so that the bottom edges are aligned. Next, take the end of whatever tie is on top, and tuck it under the tank top to hold it in place. [11] X Research source The end of the left tie should be hidden under the bottom edge of the right tie. If it isn't, tuck it into place."
    },
    {
      "title": "Glue the ties in place if you don't want to re-wrap them each time.",
      "content": "Glue the ties in place if you don't want to re-wrap them each time. Insert a sewing pin into the front and sides of your tank, making sure to go through both layers of fabric. Do the same for the left and right sides. Pull the tank top off, then place a drop of fabric glue where the pins are. Let the glue dry, then remove the pins. [12] X Research source Don't glue the entire bottom edge, or the shirt won't stretch anymore. The fabric glue will take about 15 to 20 minutes to dry. Where exactly you place the sewing pins on the sides of the tank top depends on how far the ties stretch. This could be right at the side seams, or just before."
    },
    {
      "title": "Find a T-shirt that you don't mind cutting up.",
      "content": "Find a T-shirt that you don't mind cutting up. If you want to add a fringe to the bottom hem, be sure to use a regular T-shirt, not a fitted shirt. If you prefer a fitted tank top, then a fitted shirt would be fine. If you want to add a fringe to the tank, the longer the T-shirt is, the more material you'll have to work with. [13] X Research source"
    },
    {
      "title": "Chop the sleeves off using the seams as a guide.",
      "content": "Chop the sleeves off using the seams as a guide. Don't cut straight down through the sleeves; they are actually wider in the front than in the back. Instead, cut through the shirt material (rather than the sleeve), working your way around the seam. [14] X Research source Make the armholes deeper, if desired, by cutting further into the shirt. Avoid cutting too much into the front of the shirt, however."
    },
    {
      "title": "Cut the collar off using the stitching as a guide.",
      "content": "Cut the collar off using the stitching as a guide. Don't just cut across the collar while the shirt is lying down flat, or the back of the tank top may end up too deep. Instead, cut your way around the bottom edge of the collar. Once you have the collar cut off, you can enhance it. [15] X Research source Cut the front of the collar into a V-neck or a scoop neck. You can even trim the back collar to match the front. Fold the shirt in half lengthwise so that the shoulders match up. Cut the collar into the shape you want, then unfold it. Both sides are now identical!"
    },
    {
      "title": "Cut a 1⁄2 in (1.3 cm) wide fringe into the bottom of the shirt, if desired.",
      "content": "Cut a 1 ⁄ 2 in (1.3 cm) wide fringe into the bottom of the shirt, if desired. Start at the bottom hem, and finish cutting wherever you want the fringe to start. Somewhere halfway up the shirt would be good. Make the vertical slits about 1 ⁄ 2 in (1.3 cm) apart. [16] X Research source If the material is thin enough, you may be able to cut through both layers of fabric; otherwise, cut through the front of the shirt first, then the back. Lay a strip of tape across the shirt first, right where you want the fringe to start, then cut up to the tape. If you're worried about the fringe being too high and exposing too much, put the shirt on first, then mark it where you want the fringe to start."
    },
    {
      "title": "Cut the side seams to separate the front fringe from the back.",
      "content": "Cut the side seams to separate the front fringe from the back. Turn the shirt inside-out, then cut the seams on the sides of the shirt—all the way up to where you finished cutting the fringe. Once you have the seams off, turn the shirt right-side-out again. Skip this step if you didn't add a fringe."
    },
    {
      "title": "Tug on all cut edges to make them curl inwards.",
      "content": "Tug on all cut edges to make them curl inwards. T-shirt material doesn't fray, so you don't have to hem it, but leaving the cut edges as-is won't look very clean, especially if they are jagged. Gently pulling along the cut edges, however, will cause them to curl inward. [17] X Research source Don't pull too hard, or the cut edges will tear and unravel. You should still do this, even if you even not add a fringe. After all, there are other cut edges on your tank!"
    },
    {
      "title": "Slide pony beads onto the fringe, if desired, then knot the ends.",
      "content": "Slide pony beads onto the fringe, if desired, then knot the ends. Add 1, 2, 3, or 4 pony beads onto the tassels; you can do every tassel or every other tassel. Tie a knot at the end of each beaded tassel to keep the beads from sliding off. You don't need to put the same number of beads on each tassel. For example, some tassels can have 2 beads, while others can have 4 beads. For a fancier top, knot the tassels together to create a macramé look. [18] X Research source Skip this step if you did not give your tank top a fringe."
    },
    {
      "title": "Find a loose-fitting T-shirt.",
      "content": "Find a loose-fitting T-shirt. Do not use a fitted T-shirt, or it won’t drape properly on you. Long, baggy T-shirts work great for this. [19] X Research source"
    },
    {
      "title": "Chop the sleeves off, making them bigger in the back of the shirt.",
      "content": "Chop the sleeves off, making them bigger in the back of the shirt. Using the seams as guides, cut the sleeves off first. Next, flip the shirt over to the back, and cut the armholes wider in the back of the shirt. Leave a 4 to 5 in (10 to 13 cm) vertical strip of fabric between the armholes. [20] X Research source If you want to, cut the armholes longer, but try not to take away too much material from the front of the shirt. Cut inside the seams, towards the shirt, so that they aren't visible after you remove the sleeves."
    },
    {
      "title": "Cut the collar off, then cut a V into the back between the shoulders.",
      "content": "Cut the collar off, then cut a V into the back between the shoulders. Cut the entire collar off first, using the stitching at a guide. Next, flip the shirt over to the back, and cut the collar into a V-neck. The bottom of the V should be about half the length of the armholes. [21] X Research source Only cut the V into the back of the collar, not the front."
    },
    {
      "title": "Trim off the bottom hem, then cut it apart to make a longer strand.",
      "content": "Trim off the bottom hem, then cut it apart to make a longer strand. Cut the entire bottom hem off, just above the stitching. Next, cut the ring of fabric apart at 1 of the seams to create a single strand. For an added touch, cut the bottom corners of the shirt into curves. To create a high-low tank top, fold the top in half so that the side seams are visible, then cut at an angle from the bottom-back corner to the front, where you want the shirt to end. [22] X Research source"
    },
    {
      "title": "Wrap the cut-off hem around the V, starting at the top.",
      "content": "Wrap the cut-off hem around the V, starting at the top. Place the strip on top of the vertical bar in the back of your shirt, with about 2 in (5.1 cm) hanging off the side. Wrap the rest of the hem around the vertical bar until you reach the bottom. [23] X Research source Wrap the hem tight enough so that the vertical bar scrunches up. How close together you make each wrapped row is up to you. You can overlap them or leave gaps between them, like on a candy cane."
    },
    {
      "title": "Wrap the hem back towards the top, then tie the ends together.",
      "content": "Wrap the hem back towards the top, then tie the ends together. Once you’ve hit the bottom of the vertical bar, wrap the cut-off hem back up towards the top. Tie it to the little 2 in (5.1 cm) stub, then cut the rest off. [24] X Research source Use the same pattern for this as you did when wrapping downward. For example, if you left gaps when wrapping down, use gaps when wrapping up. Poke the cut ends of the fabric strip under the wrapped fabric to hide them from view."
    }
  ]
}