{
  "url": "https://www.wikihow.com/Fix-Scratches-on-an-Aquarium",
  "title": "How to Fix Scratches on an Aquarium",
  "steps": [
    {
      "title": "Clean the outer surface.",
      "content": "Clean the outer surface. Spray the surface with acrylic safe cleaner. Use enough cleaner so that the surface is sufficiently wet. Wipe it clean with a soft cotton cloth, freeing it from dirt and dust. Work with a clean surface so you don’t add additional scratches as you work. Wear rubber gloves while cleaning to protect your hands from the chemicals. Use only a clean soft cloth, rather than one of your sponges that already has cleaning products on it. Allow the surface to dry before continuing to the next step."
    },
    {
      "title": "Keep the surface cool.",
      "content": "Keep the surface cool. Dip your sandpaper in the bucket of water as you work. It's also important to wet down the surface, to keep it from getting too hot. Acrylic will melt at high temperatures. As you work, touch the aquarium surface cautiously, to make sure it isn't too warm. If it's hot to touch, take a break. Add water to the surface, allow it to cool, and then continue."
    },
    {
      "title": "Use 400 grit sandpaper to smooth out the scratch.",
      "content": "Use 400 grit sandpaper to smooth out the scratch. Work in circles. Remember to keep the paper wet. The surface should now feel smooth. Don't worry if the surface is hazy from the sandpaper creating tiny scratches. You will remove these with the polish. If the scratch is still visible, progress to 800, 1000, and then 2000 grit. The higher the grit, the finer the sandpaper."
    },
    {
      "title": "Buff out the scratch.",
      "content": "Buff out the scratch. Squeeze NOVUS plastic polish or acrylic polish onto a clean, soft towel. Work in a circular motion, polishing out the scratch until the surface is transparent again and like-new. Use an electronic buffer to save time, and your arm. Apply the polish to the buffer pad. Keep your tool at a low setting, and apply even pressure. [1] X Research source"
    },
    {
      "title": "Let the tank surface dry.",
      "content": "Let the tank surface dry. Check your work! Your tank should be clean and virtually scratch free."
    },
    {
      "title": "Clean the surface.",
      "content": "Clean the surface. Spray the surface with glass cleaner until the surface around the scratch is wet. Wipe down the outer surface of your glass aquarium, using a soft cotton cloth, freeing it from dirt and dust. Clean thoroughly and carefully, so you don't add more scratches as you work. Wear new rubber gloves as you work to protect your hands from the chemicals. Avoid using old sponges or cleaning brushes. Use a new soft cloth to be sure you don't scratch the aquarium surface, or mix cleaning products. Wait for the surface to dry before moving on to the next step."
    },
    {
      "title": "Mix cerium oxide powder with water.",
      "content": "Mix cerium oxide powder with water. Scoop 3 TBSP of the power into a small container and add 1 TBSP of water. It will form a paste. Dip the buffing pad into the slurry mixture to use with your electronic buffer. You can use this as a glass-polishing compound, or the brass polish below. [2] X Research source You can also purchase buffing kits on hardware stores."
    },
    {
      "title": "Squeeze brass or metal polish onto clean, dry, soft cloth or buffing pad.",
      "content": "Squeeze brass or metal polish onto clean, dry, soft cloth or buffing pad. Start with a small amount, a dab, depending on the size of the scratch. Do not overuse the polish, as it may create more scratches. Used properly, as long as the scratch isn't too deep, this product will also remove the scratch, or make it a lot less noticeable."
    },
    {
      "title": "Buff out the scratch.",
      "content": "Buff out the scratch. Keep your tool on its lowest setting. Be sure it doesn't get too hot. Apply even pressure. Pause regularly to check the surface and your progress. Work until the scratch is removed."
    },
    {
      "title": "Wipe down the surface.",
      "content": "Wipe down the surface. Use a clean, soft cloth to carefully remove any polish. You're done! The scratch should now be gone, or at least less visible."
    }
  ]
}