{
  "url": "https://www.wikihow.com/Find-Someone-on-Tinder",
  "title": "How to Find Someone on Tinder: 5 Things to Try",
  "steps": [
    {
      "title": "This is the only official way to search for specific people on Tinder.",
      "content": "This is the only official way to search for specific people on Tinder. Tinder doesn’t have a search function that lets you look for people you haven’t matched with. However, if you’ve already matched with someone, you can search for them in your list of matches . To do it: [1] X Research source Go to the main screen in the Tinder app and tap the Message icon . It looks like a speech bubble and is located at the top of the screen. Pull down from the top of the screen until you see a search bar. Type the person’s name into the search bar to search for them."
    },
    {
      "title": "If you make your search options specific enough, you may match with them.",
      "content": "If you make your search options specific enough, you may match with them. This is a more indirect workaround for finding the person you’re looking for. To edit your Discovery settings: [2] X Research source Open the Tinder app and tap the profile icon at the top of the screen. Tap Settings . Scroll down and tap Discovery . From there, fiddle with the settings to increase your chances of matching with the person you’re looking for. For instance, set the age range as close to their age as possible and restrict results to their gender under Show Me . If you know how far away they live, use that to set the Maximum Distance setting."
    },
    {
      "title": "Type https://tinder.com/@[username] in your browser’s navigation bar.",
      "content": "Type https://tinder.com/@ [username] in your browser’s navigation bar. Tinder exists as a website that you can browse as well as an app. [3] X Research source Every profile on Tinder has its own URL, which is simply https://tinder.com/@ [username] (without the brackets). If you know the person’s username, this is an easy way to find their profile. If you don't know their Tinder username, try the username they use on other social media sites like Instagram, Twitter, or TikTok."
    },
    {
      "title": "Type site:tinder.com and the person’s name into Google.",
      "content": "Type site:tinder.com and the person’s name into Google. This will give you search results just from within the Tinder website. [4] X Research source You can either use the person’s real name or their username if you know it. For example, go to the Google search bar and type site:tinder.com John Smith . Using this method, you should be able to see their profile even if you don’t have a Tinder account ."
    },
    {
      "title": "There are several websites that can help you discover people on Tinder.",
      "content": "There are several websites that can help you discover people on Tinder. If other methods aren’t working, one of these services can help you find out for sure if the person you’re looking for has a Tinder profile. Most of these services are subscription-based or charge a fee for doing a search. Try looking for the person using: Social Catfish, a website that allows you to search Tinder by username, phone number, or email. This is a subscription-based service. Intelius, a people search website that displays social media profiles and other public information when you search for a person by name or phone number. Intelius is also a subscription-based service. Spokeo, a service that allows you to look up information such as a person’s contact info and social media profiles. You’ll need a subscription to see their Tinder account and other social media information. Cheaterbuster (previously known as Swiperbuster), a website that is specifically geared toward helping you find people on Tinder. You can either purchase a subscription plan or buy individual “search credits” on an as-needed basis. CheatEye, a service that uses AI to search Tinder profiles in real-time. You can find profiles by name, age, and location, and get details like their bio, photos, last activity, and subscription status."
    }
  ]
}