{
  "url": "https://www.wikihow.com/Feel-Good",
  "title": "How to Feel Good",
  "steps": [
    {
      "title": "Drink lots of water",
      "content": "Drink lots of water . Not drinking enough water can make you dehydrated, which in turn can make you tired and not function as well. Make sure to drink whenever you feel thirsty, especially if you are hot or getting lots of physical activity. [1] X Research source Most men should drink about 15.5 cups (3.7 liters) of water every day. The average woman needs about 11.5 cups (2.7 liters) of water per day. However, everyone’s needs are different. The best approach is to drink until your thirst is quenched."
    },
    {
      "title": "Exercise.",
      "content": "Exercise. Doing this regularly can help with everything from your learning to your sleeping. It can even potentially reduce the possibility of depression. Exercise releases endorphins and serotonin that enhance your mood and aid with happiness and self-esteem. Even a minimal amount of exercise can be beneficial. Some fun forms of exercise include: Taking walks. If you live close to the store, walk instead of drive. You're doing something necessary and getting some exercise at the same time. On your lunch break, take a walk around your workplace. Explore the area where you live on foot. Practicing yoga . Yoga helps manage stress, improves breathing, helps heal the body, and aids in meditation. There are many different types of yoga, so it will be easy to find the routine that will suit you. You can learn yoga online, or find a yoga place near your home. [2] X Research source Putting on some music and dancing . This will release happy brain chemicals from exercise and it's fun."
    },
    {
      "title": "Eat a healthy, well-balanced diet",
      "content": "Eat a healthy, well-balanced diet . It’s hard to feel good if you’re not eating well. Make sure you get 3 healthy meals a day, and eat a few light snacks in between if you feel hungry. While everyone’s dietary needs are slightly different, most people will feel best if they: Eat a diet rich in fruits and vegetables, lean protein (like fish or chicken breast), complex carbohydrates (like whole grains), healthy fats (like those in fish, nuts, olive oil, and avocados), and dietary fiber. Avoid refined sugars, processed foods, and trans fats, and sugary drinks. Eat foods fortified with calcium and vitamin D."
    },
    {
      "title": "Get 7-9 hours of sleep each night.",
      "content": "Get 7-9 hours of sleep each night. Sleep is vital for helping your mind and body heal from the stresses of everyday life. Make it a priority to get to a reasonable hour every night, and practice good sleeping habits to get the most out of your sleep. If you suffer from severe insomnia or have a hard time feeling well-rested even after a good night’s sleep, talk to your doctor. They may have recommendations, and can even prescribe medications to help you sleep better, if necessary."
    },
    {
      "title": "See your doctor if you feel bad often.",
      "content": "See your doctor if you feel bad often. If you feel bad much of the time, there may be an underlying physical reason. Common causes for feeling tired or unwell all the time are vitamin D deficiency or thyroid problems. [3] X Research source Make an appointment with your primary healthcare provider for a physical, and tell them how you’ve been feeling. Tell your doctor about your health history, any symptoms you’ve been experiencing, and any medications or dietary supplements you are currently taking."
    },
    {
      "title": "Sing",
      "content": "Sing . Singing, especially group singing, releases endorphins and oxytocin, which create feelings of pleasure and lower stress and anxiety. Group singing, especially, creates a feeling of bonding and community and can alleviate depression and loneliness. [4] X Research source Group singing is easy to facilitate. Look in your area for a group or choir, or go out for karaoke with some friends. You don't even have to be a great singer to do it. Some groups don't require auditions, and it's done just for fun. Singing alone also has health benefits. Singing regulates breathing much in the same way as yoga, helping you to relax."
    },
    {
      "title": "Help others",
      "content": "Help others . Philanthropy is about using your time, energy, or money to help others. It also provides you with a sense of perspective and a sense of purpose. Research has shown that it can help to reduce stress and anxiety, which in turn makes you feel better. It also can help you connect to other people. [5] X Research source Volunteer at a homeless shelter or soup kitchen. Remember not to judge the people who need such assistance. You don't know their life story. Non-profit organizations run on the energy of their volunteers. Find something in your area that you are interested in and help out. It could be anything from running a theater camp for young children to reading to the elderly."
    },
    {
      "title": "Find something to distract yourself from the moment.",
      "content": "Find something to distract yourself from the moment. This can be something that indulges a favorite fantasy or a special object that takes you back to a happy memory. It can be important to take a break from the stress of the present. Watch a favorite movie or read a favorite book. This will allow you to step into a world that you love. Find a poem, or song, or picture that reminds of a time or person that is important to you. Don't live too much in the past, or in a fantasy world. It is important to connect with the present."
    },
    {
      "title": "Set achievable goals for yourself",
      "content": "Set achievable goals for yourself . This is not to say that you can't dream of one day becoming president, but in the meantime set goals that can be achieved—and then achieve them. You will feel accomplished when you finish. These can be simple, short-term goals or more complex, long-term ones. For example: For instance, if you want to be a rock star one day, you might start by taking a single guitar lesson. Then, you might set a goal to learn to play chords, and eventually work up to being able to play a song you love. [6] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020. Start learning a musical instrument . The sense of accomplishment from picking out a song on the piano or any instrument will make you feel good. Remember, don't be too hard on yourself while you're learning. Clean your room . The activity will keep you occupied. You can listen to music and sing, which is healthy, and you'll have accomplished something when you're finished."
    },
    {
      "title": "Assess yourself for signs of burnout.",
      "content": "Assess yourself for signs of burnout. If you’re working too hard or under a lot of stress over a long period of time, you may start to experience burnout. Common symptoms include irritability, fatigue, depression, and cynicism. [7] X Research source If you think you might be experiencing burnout, make an effort to set aside time for rest and self-care. Overworking yourself will not only make you feel worse, but will also ultimately make you less productive."
    },
    {
      "title": "Replace negative thoughts with neutral, realistic ones.",
      "content": "Replace negative thoughts with neutral, realistic ones. Everyone is troubled by negative thoughts at times. Too much negative thinking can have a serious impact on your mental and physical health. When you’re used to thinking negatively, it can be hard to reframe your thinking in a more positive light. Instead of trying to replace your negative thoughts with positive ones, start by replacing them with thoughts that are neutral and objective. [8] X Research source For example, if you find yourself thinking, “I’m so dumb. I’ll never understand math,” recognize the negative thought and ask yourself if it’s realistic. Try replacing it with something like, “Math is a difficult subject for me. But if I keep studying and maybe sign up for some tutoring sessions, I’ll probably get better at it.” Once you get the hang of replacing negative thoughts with neutral ones, you’ll probably find it easier to start thinking positively. If you find yourself dwelling on the past or fixating on negative thoughts, try doing something productive, or focus on thinking of 1 or 2 things you might try to overcome the problem you are dwelling on. [9] X Research source"
    },
    {
      "title": "Be mindful",
      "content": "Be mindful . Being aware of what you are feeling in the moment can help you feel more calm, balanced, and in control. As you go about your daily routine, make a conscious effort to stop from time to time and simply feel what is happening in and around you. Being mindful of your mental, emotional, and physical state can help you identify signs of stress and let you know when it’s time for some self-care. Mindful meditation is a great way to train yourself to be more mindful in your everyday life. Find a quiet, comfortable place to sit, and take a few moments to simply breathe and focus on how you are feeling. Practice acknowledging your thoughts and feelings without judgment. For example, you might close your eyes and think to yourself, “I am tired and a little bit cold. I feel tension in my shoulders. I’m feeling a little anxious right now because I keep thinking about that overdue bill.”"
    },
    {
      "title": "Learn to meditate.",
      "content": "Learn to meditate . Meditation relaxes your body and mind, relieving stress. It helps you to focus on the present, and reduce negativity. [10] X Research source Basic meditation method: sit quietly and close your eyes, relax your body (you may not even realize how tense you are!), and focus on your breathing. Breathe deeply in and out right down to your diaphragm and count your breaths. Don't stress when errant thoughts crop up during meditation. Simply thank them for visiting and let them go. You can practice meditation anywhere: on the bus, on your work lunch break, or right before that massive exam. If you're religious, prayer can operate in a similar manner to meditation. Take a quiet moment and pray with compassion for someone other than yourself; it can be a family member, a stranger, or even the world."
    },
    {
      "title": "Learn gratitude",
      "content": "Learn gratitude . This means taking nothing for granted and valuing and celebrating the kindnesses that have been done to you. Research has shown that practicing gratitude in your life increases your well-being and your happiness, something that will definitely make you feel good. It also helps alleviate negative emotions. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Keep a gratitude journal. Write down instances of kindness and things you are grateful for, like a person who made a positive impact on you. Talk about your gratitude. With a loved one, a significant other, a family member or a friend, discuss what you are grateful for. This will increase your awareness of the good things that were part of your day and help you to not dwell on the bad. Pay attention to the small things. Find gratitude in the warmth of your bed, in something nice someone said to you, or in your favorite snack."
    },
    {
      "title": "Face your problems.",
      "content": "Face your problems. Problems and worries have a habit of stacking up, particularly at the most inconvenient times. Facing them as soon as possible, instead of letting them linger, will help your wellbeing. Facing problems can be hard. Issues can be as varied as making rent to confronting a friend over a racist thing they said. Focus on the solution and not the problem. For example, if you're having an issue with your boss, instead of worrying about the problem, talk to them in private and give them specific examples of why you're having that issue. Provide a solution."
    }
  ]
}