{
  "url": "https://www.wikihow.com/Find-New-Friends-on-Twitter",
  "title": "The Easiest Ways to Connect with New People on Twitter/X",
  "steps": [
    {
      "title": "Scroll through the For You page.",
      "content": "Scroll through the For You page. At the top of the page, you'll see two tabs. The Following tab will only show you content from accounts you follow. Click For You to scroll down the \"For You\" page. This shows you content from accounts the algorithm thinks you might be interested in, as well as people you follow. You can find new accounts to follow on the For You page."
    },
    {
      "title": "Check other people’s Following/Follower tabs.",
      "content": "Check other people’s Following/Follower tabs. This method lets you find common ground through the people you follow. Pick an influencer or friend and click on their profile. Then click “Followers” or “Following” to see who else they’re connected to. Scroll through and follow bios that look interesting to you. [1] X Research source If you are following this account, don't click the large white button that says \"Following.\" This will unfollow that account. Click Followers or Following next to the number of followers or following they have."
    },
    {
      "title": "Try the Explore tab to find friends by topic.",
      "content": "Try the Explore tab to find friends by topic. Tap the magnifying glass icon on mobile to open the \"Explore\" page. This allows you to search, and you can tap on tabs like Trending , News , Sports , and Entertainment to find new content."
    },
    {
      "title": "Use X’s “Who to follow” window.",
      "content": "Use X’s “Who to follow” window. It's on the \"Explore\" page. If you are on a computer, you'll see it in a window on the right side. If you are using the mobile app, tap the For You and scroll down a bit until you find the \"Who to Follow\" header. This displays a few account recommendations for you to follow. Tap Follow next to any of the listed accounts you want to follow."
    },
    {
      "title": "Use hashtags to find friends with specific interests.",
      "content": "Use hashtags to find friends with specific interests. Type a hashtag related to your interests into the Explore tab search bar. According to Rodriguez, using a hashtag instead of a general topic tab enables you to look for people talking about niche interests, keywords, or timely/trending topics. Include hashtags in your posts so that other people searching for that topic can find what you’re saying. [2] X Expert Source Melissa Rodriguez Marketing & Advertising Specialist Expert Interview. 23 April 2021. Type a topic like “#indiemusic” or “#collegebasketball” into the search bar at the top of the Explore page. Click a hashtag on a tweet to explore other tweets with that hashtag. Type a hashtag for an upcoming event to find other people who might be going, too. To narrow your search down further, you can use Twitter/X's advanced search feature . You can access the advanced search at https://x.com/search-advanced . Try not to use more than two hashtags per tweet, and remember hashtags can’t include spaces. [3] X Research source"
    },
    {
      "title": "Use X’s Lists feature to browse groups of people.",
      "content": "Use X’s Lists feature to browse groups of people. Lists allow you to subscribe to a set of people to see those posts together in your feed without having to follow all of them. [4] X Research source Find Lists of interesting people through the “Discover new lists” prompt or check out other people’s Lists in their profile. [5] X Research source To see Lists using the mobile app, tap your profile icon in the upper-left corner and then tap Lists . On a desktop computer, click More in the menu bar to the left and then click Lists ."
    },
    {
      "title": "Open the \"Settings and privacy\" menu.",
      "content": "Open the \"Settings and privacy\" menu. One of the ways you can find people you know on Twitter/X is to sync your contacts on your phone with your Twitter/X account. When you sync your contacts, Twitter/X will recommend people in your contacts for you to follow, as long as those contacts allow their accounts to be searchable by email or phone number. You can sync your contacts in the \"Settings and privacy\" menu. Use one of the following steps to open it: [6] X Research source Mobile: Tap your profile icon in the upper-left corner. Then tap Settings and privacy at the bottom. Computer: Click More in the menu bar to the left and then click Settings and privacy ."
    },
    {
      "title": "Click or tap Privacy and safety.",
      "content": "Click or tap Privacy and safety . It's about halfway down the settings menu."
    },
    {
      "title": "Click or tap Discoverability and Contacts.",
      "content": "Click or tap Discoverability and Contacts . It's the last option below the \"Your X activity\" header."
    },
    {
      "title": "Click or tap the toggle switch next to \"Sync address book contacts.\"",
      "content": "Click or tap the toggle switch next to \"Sync address book contacts.\" It's below the \"Contacts\" header. This allows Twitter/X to search for people in your contacts and give you recommendations based on who's in your contacts. You may be asked to allow Twitter/X access to your contacts. Tap Allow if prompted. Additionally, you can click the checkbox or tap the toggle switch next to \"Let people who have your email address find you on X\" or \"Let people who have your phone number find you on X.\" This allows people who have your email address or phone number to be able to find you on Twitter/X."
    },
    {
      "title": "Set up an interesting profile to show you’re a fun (and real) person.",
      "content": "Set up an interesting profile to show you’re a fun (and real) person. Upload a profile picture or avatar and a banner image that represents you or the content you’d like to post. Add a brief bio that will tell potential friends what you do, who you are, and maybe even where you’re from. [7] X Research source To edit your profile on mobile, tap your profile pic or the sillhouette icon and select Edit Profile . On a computer, click Profile and select Edit Profile . Talk about your work and interests: “Stand up comic by night. Sit down office worker by day. Austin TX.” List out a few of your defining characteristics: “Food blogger, ethical-sourcing specialist, mom to two werewolves, allergic to mushrooms.” Keep it simple and professional: “Journalist/Traveler. MFA. Writes for The News Source. Former Fulbright Scholar.”"
    },
    {
      "title": "Post consistently and creatively.",
      "content": "Post consistently and creatively. Tweet about your interests so other people can find you. Ask “How can I add value?” to the conversation. When you’ve got a great tweet or piece of content, pin it to the top of your feed so users who come to check you out can see it. [8] X Research source Add visuals to your tweets to increase their appeal. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Post at least 3 times per day, but aim for quality over quantity. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Reach out to other people by liking, replying, retweeting, and mentioning users.",
      "content": "Reach out to other people by liking, replying, retweeting, and mentioning users. According to Rodriguez, when you engage with the content you like, X's algorithm will start to expose you to more of it (and, in turn, expose you to potential friends). [11] X Expert Source Melissa Rodriguez Marketing & Advertising Specialist Expert Interview. 23 April 2021. Interact with posts created by people you’d like to befriend and posts by celebrities or influencers who are part of a community you like. [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Here’s a strategy for engaging with a post from a potential friend that goes a step beyond just retweeting: Scroll through their feed and find a tweet about something they like or their off-platform content (like a personal blog). Grab a quote from something they’ve mentioned or copy the URL of the site. Tweet the quote or URL, mention the person (by using @ and their username), and say “Thanks!”"
    },
    {
      "title": "Turn on notifications to be able to reply fast.",
      "content": "Turn on notifications to be able to reply fast. As soon as someone mentions you or your favorite celebrity posts, reply to their post. That way, the person who posted will see you’re engaging with their material. As a bonus, your post will get more views and traffic since it’ll kick off the discussion. [13] X Research source"
    },
    {
      "title": "Reach out via DM to make a connection.",
      "content": "Reach out via DM to make a connection. Rodriguez recommends asking a question or giving a compliment to get a conversation started. [14] X Expert Source Melissa Rodriguez Marketing & Advertising Specialist Expert Interview. 23 April 2021. To send a DM, click or tap on the envelope icon, click Write a message, then click a user or profile and write a message. [15] X Research source Check out these sample conversation-starting DMs: “Thanks for sharing that fan art. You really captured the essence of the series. How’d you come up with that idea?” “I loved that article on gratitude. Where do you find stuff like that?” Not all accounts accept DMs. If you don't see the envelope icon, that account probably doesn't accept DMs. Some accounts require you to be verified to send them a DM."
    },
    {
      "title": "Join an X chat to meet like-minded friends.",
      "content": "Join an X chat to meet like-minded friends. Participate when a business or celebrity you like hosts an X chat. X chats occur at a specific time and use a designated hashtag so participants can keep up with the conversation. To join in, write out a tweet and include the hashtag the company/celebrity tells you to use. As the conversation flows, look out for users who make funny or interesting points that capture your attention. Then, either follow them or reply to let them know you like their content."
    },
    {
      "title": "Put your handle in your other social media profiles.",
      "content": "Put your handle in your other social media profiles. This will make it easy for people on other platforms to follow you on Twitter/X. Then, join Facebook or LinkedIn groups that are relevant to the content you like and topics you’re interested in. [16] X Research source"
    }
  ]
}