{
  "url": "https://www.wikihow.com/Create-Good-Personalities-for-Your-Characters",
  "title": "How to Create Good Personalities for Your Characters",
  "steps": [
    {
      "title": "Look for inspiration in real people.",
      "content": "Look for inspiration in real people. Giving your character traits drawn from the personalities of real people is a great way to make them feel relatable and realistic. [2] X Research source Think about people you’ve known whose personalities made an impression on you. What was it about their personality that stuck with you? If you had to define their personality in just a few words or sentences, what would you say? You might be inspired by yourself, friends, family members, teachers and mentors, public figures, or even people you’ve only met in passing. Write down a few of the person’s key personality traits. Are they shy or outgoing? Are they bubbly and animated, or more reserved when they speak? What are their interests and hobbies? What sorts of things do they want or believe in? Using real people for inspiration is not the same as basing a character directly on a real person. Just borrow traits that you find interesting, like your best friend’s crooked smile or your brother’s fear of flying."
    },
    {
      "title": "Assess what makes your favorite characters great.",
      "content": "Assess what makes your favorite characters great. [3] X Expert Source Lucy V. Hay Professional Writer Expert Interview. 16 July 2019. Do a close analysis of a few of your favorite fictional characters, and try to define what it is about them that makes them so appealing to you. [4] X Research source Write down a brief description of the character’s personality, and then make a list of the things that make the character feel particularly compelling, realistic, or relatable to you. For example, maybe you are fascinated by their complexity, or maybe you find yourself relating to their flaws and insecurities. Perhaps you enjoy their realistic speech patterns or the little details of their mundane interactions with other characters. Remember, you don’t have to like the character as a person to appreciate them as a character! Great villains and antiheroes can be totally despicable, but still fascinating if given enough complexity."
    },
    {
      "title": "Familiarize yourself with character archetypes.",
      "content": "Familiarize yourself with character archetypes. An archetype is a symbol or a typical example of something that is instantly recognizable to most people. Character archetypes can make great starting points or foundations for building fully fleshed-out characters. Consider which archetype fits your character best, and think about how you can work within and around the “rules” of the archetype to make your character unique. [5] X Research source Examples of archetypes include the hero, the villain, the warrior, the leader, the fool, the femme fatale, and the wise woman. Some genres have their own archetypes. For example, in high school settings, you’re likely to encounter archetypes like the jock, the nerd, the cheerleader, and the prep. Think about how your character fits the mold of the archetype, but also think of ways that they might not fit. [6] X Expert Source Lucy V. Hay Professional Writer Expert Interview. 16 July 2019. For example, maybe your character is a cheerleader, but she’s also a member of a Dungeons and Dragons club at her school. This is a good way to avoid falling back on clichés and stereotypes."
    },
    {
      "title": "Use personality assessment tools to help define your characters.",
      "content": "Use personality assessment tools to help define your characters. Personality tests like the Myers-Briggs Type Indicator (MBTI) assessment can be a great way to pin your characters’ personalities down and help you understand their behaviors and motivations better. If you already have a general idea of who your character is, try taking one of these tests “as” the character to gain some deeper insights into what makes them tick. [7] X Research source You can find free versions of the MBTI and other personality tests on websites like 16Personalities, Truity, and Humanmetrics. Most personality tests offer a series of statements (such as “I have a vivid imagination” or “You often think about humankind and its destiny”) and ask you to rate how strongly you agree or disagree with each statement. Think about how your character would answer each of these questions. Personality tests like the MBTI classify personalities into a set number of “types.” For example, if your character is a strong leader, they may be an ENTJ (Extroverted, Intuitive, Thinking, Judging) type."
    },
    {
      "title": "Determine your character’s major goals and motivations.",
      "content": "Determine your character’s major goals and motivations. Your character’s feelings, beliefs, and actions won’t make a lot of sense unless you have a good sense of their underlying desires, needs, and goals. Identify what goals your character is trying to achieve and think about why (and how) they wish to achieve them. [8] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source These goals and motivations can be either large or small in scale. For example, in an individual scene, maybe your character’s goal is to slip out of a party unnoticed. Her motivation might be that she’s feeling overwhelmed and wants to be alone. On a larger scale, maybe your character’s goal is to win the state spelling bee. Her underlying motivation could be to gain the approval of her favorite teacher or to show up one of her rivals in school. Remember that what your character wants is not always the same as what they need. For example, perhaps your character wants to be a famous movie star, but what he really needs is to be loved for who he is."
    },
    {
      "title": "Define your character’s fears and insecurities.",
      "content": "Define your character’s fears and insecurities. Your character’s underlying fears are just as important as their desires and motivations. Think about what your character is trying to avoid, and why. How do their fears affect their choices and reactions to the situations in which they find themselves? [9] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, maybe your character is afraid of rejection. He might avoid telling his love interest how he really feels because of this fear."
    },
    {
      "title": "Give your character interests and passions.",
      "content": "Give your character interests and passions. Your character will feel more real if they have well-defined hobbies, interests, beliefs, and opinions. Think about what your character might enjoy doing in their spare time, what kinds of books or movies they would enjoy, or how they would feel about a certain controversial issue. [10] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Your character’s interests and opinions don’t have to align with your own—in fact, your character will ultimately be richer and more interesting if they differ from you in various ways. Research your character’s interests, hobbies, and opinions so that you can portray them realistically. [11] X Expert Source Lucy V. Hay Professional Writer Expert Interview. 16 July 2019. For example, if your character enjoys beekeeping, read up on what’s involved. If there's wikiHow articles on the topic, you could start there."
    },
    {
      "title": "Let your character have flaws.",
      "content": "Let your character have flaws. Nobody is perfect in real life, so your character won’t feel real unless they have a few flaws and imperfections. Your character might have one major flaw or several smaller ones. Think about how these flaws might shape their actions and choices. [12] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source For example, maybe your character is always getting into trouble because they have a hard time saying no when their friends ask them for favors—no matter how ridiculous the request. Avoid flaws that just make your character seem even more perfect (for example, making your character “too kind” or “too beautiful”). On the other side of the coin, villains and other “bad” characters can feel more interesting and realistic if you give them a redeeming quality here and there!"
    },
    {
      "title": "Provide your character with unique traits, habits, and quirks.",
      "content": "Provide your character with unique traits, habits, and quirks. Your character’s personality may grow out of what they are thinking and feeling on the inside, but it’s also important to think about how it appears from the outside. Think about what would make your character stand out to people observing them. This could be anything from their appearance to the way they sound when they talk. [13] X Research source For example, maybe your character has a catchphrase (like “Gosh!” or “You don’t say.”), or perhaps they have a habit of nervously fiddling with their sleeves when they speak. Your character’s personality might be expressed visually through things like how they dress or style their hair."
    },
    {
      "title": "Create a backstory for your character.",
      "content": "Create a backstory for your character. A character’s past might affect their opinions, desires, fears, choices, and actions. Map out a few key events in your character’s life, and think about the way these events might have shaped who they are and how they behave. [14] X Research source For example, if your character was once in a bad car accident, they may be afraid of driving or being in cars. Maybe they will need to confront this fear at some point in order to move the story forward."
    },
    {
      "title": "Develop your character’s cultural context.",
      "content": "Develop your character’s cultural context. Where your character comes from can also have an impact on their beliefs, goals, and motivations. Think about the kinds of opportunities, challenges, and social pressures your character might experience based on when and where they grew up. [15] X Research source Maybe your character is a young woman in 1950s small-town America, for instance. She may feel some tension between the social pressure to get married and start a family, and her own personal desire to go out and achieve something big (like becoming a doctor)."
    },
    {
      "title": "Define their relationships with other characters.",
      "content": "Define their relationships with other characters. In most stories, characters do not act in isolation. They interact with other characters—as love interests, rivals, competitors, teammates, friends, enemies, or sometimes a combination of all of those things! Think about how your character’s personality might affect the way they react to those around them. [16] X Research source For example, if your character is strong-willed and competitive, they might clash with other characters who share those traits—even if they are technically on the same “side.” A shy character might feel intimidated by a character with a more forceful personality. One of their goals in the story might be to overcome their fear and learn to stand up to the more forceful character."
    },
    {
      "title": "Determine your character’s role in the plot.",
      "content": "Determine your character’s role in the plot. [17] X Expert Source Lucy V. Hay Professional Writer Expert Interview. 16 July 2019. In order for your character to have value in your story, they will need to contribute to the plot in some way. The way your character functions in the plot will be at least in part determined by their personality—and vice versa. Think about how your character’s motivations, goals, and actions can help drive the story forward. [18] X Research source For example, maybe your character gets into a major argument with his son because of a fundamental difference in values. This conflict could trigger the son to run away from home, setting the plot of the story in motion."
    }
  ]
}