{
  "url": "https://www.wikihow.com/Enable-Automatic-Logon-in-Windows-XP",
  "title": "How to Enable Automatic Logon in Windows XP",
  "steps": [
    {
      "title": "Open the Start menu.",
      "content": "Open the Start menu. It's located in the lower left-hand corner of the screen."
    },
    {
      "title": "Select \"Settings\", then open \"Control Panel\".",
      "content": "Select \"Settings\", then open \"Control Panel\". The Control Panel program lets you make changes to your system settings."
    },
    {
      "title": "Double-click the \"User Accounts\" folder.",
      "content": "Double-click the \"User Accounts\" folder. You'll be able to edit your account settings from here."
    },
    {
      "title": "Click on the \"pick an account to change\" option.",
      "content": "Click on the \"pick an account to change\" option. Choose your default account name when it comes up. Your \"default account name\" will reflect the name on the account you are trying to edit. You should refrain from editing other accounts when on a shared computer."
    },
    {
      "title": "Click on the \"Remove my Password\" link.",
      "content": "Click on the \"Remove my Password\" link. When the computer prompts you to enter your password, do so. When prompted, click \"Remove Password\" to finalize the process."
    },
    {
      "title": "Go back to \"User Accounts\" and click on \"choose the way users log on or off\".",
      "content": "Go back to \"User Accounts\" and click on \"choose the way users log on or off\". In this menu, find the check box next to \"Use the Welcome Screen\" and click it once to uncheck it."
    },
    {
      "title": "Reboot your computer.",
      "content": "Reboot your computer. Go to the Start menu again, click on \"Power\", and select \"Restart\". Your computer will shut down, pause, and start back up. It should logon automatically this time!"
    },
    {
      "title": "Open the Run program.",
      "content": "Open the Run program. Select \"Run\" from the list of default programs on the right-hand side of your Start menu. You can also hold down the ⊞ Win key and tap R to bring up the Run program without touching the Start menu."
    },
    {
      "title": "Use Run to open the Registry Editor.",
      "content": "Use Run to open the Registry Editor. Registry editor lets you edit system values--in this case, the logon values. Type in \"regedit\" without the quotations into Run and click OK to bring up the Registry Editor. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Type in \"regedt32.exe\" without the quotation marks if the first version you type in doesn't work."
    },
    {
      "title": "Locate the \"HKEY_LOCAL_MACHINE\" folder.",
      "content": "Locate the \"HKEY_LOCAL_MACHINE\" folder. Click on this folder, but do not double-click. This will expand the folder to show you its contents. Scroll through this folder until you find the \"SOFTWARE\" folder."
    },
    {
      "title": "Expand the \"SOFTWARE\" folder.",
      "content": "Expand the \"SOFTWARE\" folder. Scroll through \"SOFTWARE\" until you find the \"Microsoft\" folder."
    },
    {
      "title": "Expand the \"Microsoft\" folder.",
      "content": "Expand the \"Microsoft\" folder. Scroll through \"Microsoft\" until you find the \"Windows NT\" folder."
    },
    {
      "title": "Expand the \"Windows NT\" folder.",
      "content": "Expand the \"Windows NT\" folder. Scroll through \"Windows NT\" until you find the \"Current Version\" folder."
    },
    {
      "title": "Expand the \"Current Version\" folder.",
      "content": "Expand the \"Current Version\" folder. Scroll through \"Current Version\" until you find the \"Winlogon\" folder."
    },
    {
      "title": "Double-click the \"Winlogon\" folder in \"Current Version\".",
      "content": "Double-click the \"Winlogon\" folder in \"Current Version\". Within this folder, find the \"DefaultUserName\", \"DefaultPasswordType\", and \"AutoAdminLogon\" values. [2] X Research source"
    },
    {
      "title": "Double-click on \"DefaultUserName\".",
      "content": "Double-click on \"DefaultUserName\". Check to make sure that the value in the properties box matches your username."
    },
    {
      "title": "Double-click on \"DefaultPasswordType\".",
      "content": "Double-click on \"DefaultPasswordType\". When it opens, enter your password as you normally do to log in."
    },
    {
      "title": "Double-click on \"AutoAdminLogon\".",
      "content": "Double-click on \"AutoAdminLogon\". When it opens, type \"1\" into the value box (without quotation marks)."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. Close all of your programs and restart by going to the Start menu, selecting \"Power\", and clicking \"Restart\". Your computer should boot up straight to the desktop!"
    }
  ]
}