{
  "url": "https://www.wikihow.com/Determine-Your-Seasonal-Color-Palette",
  "title": "Which Season Are You? Finding Your Color Palette",
  "steps": [
    {
      "title": "See if you have cool or warm undertones by looking at your wrist.",
      "content": "See if you have cool or warm undertones by looking at your wrist. [1] X Expert Source Kathi Burns, CPO® Fashion Stylist Expert Interview. 31 December 2019. The color of your veins can help you determine your undertone. Simply lift your wrist to eye level in natural light and inspect the vein on the inside of your wrist. If they’re green or greenish-blue, you have a warm undertone. If they’re blue or purple, you have cool undertones. Always check your skin's undertone in natural lighting, as artificial lighting can change how color appears on your skin. If you can’t tell what exact color your veins are, chances are you have neutral undertones—you can pull off warm and cool colors! [2] X Research source"
    },
    {
      "title": "Hold a sheet of white paper next to your skin to find your complexion.",
      "content": "Hold a sheet of white paper next to your skin to find your complexion. Double-check your undertone color by looking at your arm next to a piece of white paper. You have a warm complexion if your skin looks yellow, green, or golden. If it looks pink, red, or blue, you have a cool complexion. [3] X Research source Complexion refers to the color of your skin, while undertone is a specific shade within that color."
    },
    {
      "title": "Check your eye color to see if you have warm or cool undertones.",
      "content": "Check your eye color to see if you have warm or cool undertones. [4] X Expert Source Kathi Burns, CPO® Fashion Stylist Expert Interview. 31 December 2019. [5] X Expert Source Bethany Brenneman Color Analysis Expert & Professional Makeup Artist Expert Interview. 21 February 2025. If you have grey, bright green, or clear blue eyes, you have a cool complexion. You have a warm complexion if you have hazel, brown, or amber eyes. Your eyes can change color in different lighting, so try to look at your eye color in natural light to see the true color."
    },
    {
      "title": "Look at your natural hair color to unlock more clues about your complexion.",
      "content": "Look at your natural hair color to unlock more clues about your complexion. [6] X Expert Source Kathi Burns, CPO® Fashion Stylist Expert Interview. 31 December 2019. [7] X Expert Source Bethany Brenneman Color Analysis Expert & Professional Makeup Artist Expert Interview. 21 February 2025. Believe it or not, your hair can say a lot about what colors will look best on you. If your hair is black, ashy brown, gray, or ashy blonde, you have a cool complexion. You have a warm complexion if your hair color is chestnut, dark brown, red, strawberry blonde, or auburn. Make sure to use your natural hair when finding your seasonal color palette, as it’ll help you know if you have natural cool or warm undertones."
    },
    {
      "title": "You’re a Spring if you have warm tones and light hair.",
      "content": "You’re a Spring if you have warm tones and light hair. Spring types usually have fair skin, light eyes, and light hair. For instance, a Spring may have strawberry-blonde hair and green eyes. In general, Springs have: Skin: Clear, warm undertone with peachy cheeks Hair color: Light blonde, light to medium brown, strawberry blonde Eye color: Clear blue, green, turquoise, hazel, light brown"
    },
    {
      "title": "You’re a Summer if you have light hair and cool tones.",
      "content": "You’re a Summer if you have light hair and cool tones. Summers usually don’t have a lot of contrast in hair color, eye color, and complexion. For example, a Summer might have blonde hair and cool green eyes. [8] X Research source Summer types typically have: Skin: Cool undertone and rosy cheeks Hair color: Light blond or medium brown, sometimes in muted colors Eye color: Blue, cool green, slate, grey-brown, grey-blue"
    },
    {
      "title": "You’re an Autumn if you have warm tones and dark hair.",
      "content": "You’re an Autumn if you have warm tones and dark hair. Autumn types have low contrast in their natural skin, hair, and eye colors, but they tend to have rich, golden undertones. For example, an Autumn could have dark brown hair and green eyes. Autumn types usually have: Skin: Warm, golden undertone with rich coloring Hair color: Medium or dark brown, black, medium red, deep auburn Eye color: Hazel, medium to dark brown, olive, warm green"
    },
    {
      "title": "You’re a Winter if you have dark hair and cool tones.",
      "content": "You’re a Winter if you have dark hair and cool tones. Winters usually have a lot of contrast in their complexion, hair, and eye colors. For instance, a Winter might have dark brown hair, pale skin, and piercing blue eyes. [9] X Research source Winter types usually have: Skin: Cool undertone with high contrast against hair and eyes Hair color: Medium brown, dark brown, or black Eye color: Medium or dark brown, clear blue, grey-blue, olive, or cool green"
    },
    {
      "title": "If you’re a Spring, try warm, medium shades of berry, green, and orange.",
      "content": "If you’re a Spring, try warm, medium shades of berry, green, and orange. Medium and clear shades of warmer colors are the most flattering on Springs. [10] X Expert Source Bethany Brenneman Color Analysis Expert & Professional Makeup Artist Expert Interview. 21 February 2025. Stick with softer pastels and avoid dark shades, and you’ll look superb! [11] X Research source Consider adding more of these colors to your wardrobe: Medium and bright green Medium and muted pink, berry, and cranberry Medium and bright shades of yellow and orange Muted blue-green Neutral browns, medium or slate grays, and whites Neutral dark browns, whites, blacks, and grays"
    },
    {
      "title": "If you’re a Summer, stick with cool, muted shades of green, blue, and purple.",
      "content": "If you’re a Summer, stick with cool, muted shades of green, blue, and purple. Summers shine in cool colors with muted or pastel tones. Stay clear of darker colors, as these can create an unflattering contrast with your light hair, eyes, and skin. Try styling colors like: Cool shades of light and medium green and pink Medium and light shades of blue Periwinkle, light, medium, and deep purple Light and medium yellow Neutral whites, grays, and browns"
    },
    {
      "title": "If you’re an Autumn, opt for medium and dark jewel tones.",
      "content": "If you’re an Autumn, opt for medium and dark jewel tones. Autumn types look wonderful in bright greens, yellows, and reds. Fill your closet with vibrant shades and skip the pastels so your beautiful complexion stands out. [12] X Research source Autumns look the best in colors such as: [13] X Expert Source Bethany Brenneman Color Analysis Expert & Professional Makeup Artist Expert Interview. 21 February 2025. Medium and dark green Rich shades of pumpkin and deep yellow Deep berry and maroon Neutral browns"
    },
    {
      "title": "If you’re a Winter, wear medium shades of green, blue, and purple.",
      "content": "If you’re a Winter, wear medium shades of green, blue, and purple. Winters look best in cool, fresh, vibrant and cool colors in medium tones. [14] X Expert Source Bethany Brenneman Color Analysis Expert & Professional Makeup Artist Expert Interview. 21 February 2025. Some darker shades work great, too, but avoid pastels at all costs. They can wash out your natural coloring and look less flattering. [15] X Research source Winters look great in colors like: Cool mint green, medium green, and dark forest green Medium and dark shades of blue Medium and dark purple Cool pink, classic red, and cranberry"
    }
  ]
}