{
  "url": "https://www.wikihow.com/Deter-Foxes",
  "title": "How to Deter Foxes",
  "steps": [
    {
      "title": "Make your land less attractive.",
      "content": "Make your land less attractive. Deterring foxes is a game of percentages. Each step you take will greatly reduce the number of infiltrators, but there's no magic bullet that stops every one. Regular upkeep and planning will give foxes less reason to approach in the first place, an important first step: [1] X Research source [2] X Research source Clear all food scraps and enclose compost. Cover standing water at night to prevent drinking. Stop using fertilizers made from blood, bone, or fish. Gather excess fruit and vegetables instead of leaving it on the plant. Keep shoes and other small objects inside. Foxes like to use these as playthings. [3] X Research source"
    },
    {
      "title": "Block access to enclosed spaces that could turn into a den.",
      "content": "Block access to enclosed spaces that could turn into a den. Check first to make sure there are no animals already living there. Walling them in to die may be illegal, and could attract scavengers."
    },
    {
      "title": "Choose a repellent.",
      "content": "Choose a repellent. Most commercial repellents are scent-based, which confuses the fox and prevents it marking your land as its own territory. If you can't find a fox repellent, look for one targeted at dogs. You may need to try a few repellents before you find one that works on your foxes. Check the ingredient list to make sure the second one you buy is actually different: [4] X Research source Aluminum ammonium sulphate — a scent-based repellent Methyl nonyl ketone — a different scent Capsicum (pepper spray) — extra-spicy taste. Typically less effective, as the fox has to eat it."
    },
    {
      "title": "Apply repellent strategically.",
      "content": "Apply repellent strategically. Repellent usually can't discourage a fox when it's already next to the hen house or your prize vegetables. Spray it in the following locations instead, or mix with sand and sawdust and sprinkle it: [5] X Research source Apply directly to scat, without removing it. Fox leave scat in the open to mark territory, and may return to the same spot if it is cleared. (If children play in the area, apply fox scat disinfectant as well to protect them from diseases.) Apply to soil above buried food, compost, or deceased pets. Apply to suspected entry points onto your land, or along the tops of walls and fences."
    },
    {
      "title": "Leave out bad-tasting food.",
      "content": "Leave out bad-tasting food. A fox that has an unpleasant experience eating something in your yard may not want to visit again. Try leaving out food scraps covered in hot sauce or bittering agents. [6] X Research source"
    },
    {
      "title": "Add male urine around the perimeter.",
      "content": "Add male urine around the perimeter. You may use human urine, or male predator urine from a garden store. This generally works best for deterring prey animals, not predators, but some people have reported success. As with any deterrent, results will vary based on individual foxes and how desirable your land appears."
    },
    {
      "title": "Get a guard animal",
      "content": "Get a guard animal . Many livestock owners use guard dogs or guinea fowl to scare away predators. These are often effective at chasing off foxes, if you can stand the noise."
    },
    {
      "title": "Try commercial scare products.",
      "content": "Try commercial scare products. There are many products marketed at the frustrated gardener or farmer. Most haven't been thoroughly studied, and receive a wide range of reviews from users. You might have best results with a product you know has worked for your neighbors. Common examples include: [7] X Research source Devices that squirt water when an animal approaches. Ultrasonic devices that make a high-pitched noise. Devices that flash light at the fox."
    },
    {
      "title": "Use narrow, steel mesh as fencing.",
      "content": "Use narrow, steel mesh as fencing. Hardware cloth or ½\" x ½\" (1.25cm x 1.25cm) welded wire mesh should make up the bottom 2 feet (0.6 m) of fence, plus all buried sections. Unlike chicken wire, the fox cannot get his teeth around this mesh to tear through it. For extra protection, use two layers of mesh."
    },
    {
      "title": "Bury an L-shaped fence to prevent digging.",
      "content": "Bury an L-shaped fence to prevent digging. Foxes are excellent diggers. Bury the wire barrier at least 8 inches (20 cm) deep, or up to 12 inches (30 cm) if the soil is loose or sandy. Bend the mesh at a 90º angle and extend it outward 8 inches (20 cm), so the fox can't find a way past if it digs downward. [8] X Research source Weigh down the horizontal layer with bricks or rubble before you cover it with soil, to make digging even harder."
    },
    {
      "title": "Prevent jumping and climbing.",
      "content": "Prevent jumping and climbing. A large fox can jump or climb an impressive height. An ordinary fence should be at least 6 ft (1.8m) high to keep out foxes. You can get away with as low as 5 ft (1.5m) if you bend the top of the fence outward to form a long overhang. [9] X Research source Try an overhang that bends outward at a 45º angle and extends 19 inches (50cm)."
    },
    {
      "title": "Consider electric fencing.",
      "content": "Consider electric fencing. This is one of the most effective ways to deter foxes. [10] X Research source Foxes usually examine the fence before trying to climb or jump. If they come into contact with an electric wire, the painful shock will usually discourage them from trying. Run three wires for best results: one at fox head height, one along the top, and one in the middle. You'll also need an energizer that produces about 5,000–7,000 volts. [11] X Research source This will discourage most jumpers, so you can risk building a lower fence. If there are hedgehogs in your area, the lowest electric wire should be at least 6 inches (15 cm) off the ground to prevent accidental death. Other small mammals are usually fine. [12] X Research source Electric fences are not recommended in areas with young children. The fox must make a connection between the electric wire and the ground to get a shock. If your fence isn't grounded, run a ground wire about an inch (2.5 cm) apart from the middle and upper wires. Alternatively, use electric netting."
    },
    {
      "title": "Secure the floor.",
      "content": "Secure the floor. Foxes are excellent diggers and can tear or squeeze through relatively small holes. Use one of these flooring designs to protect your animals: [13] X Research source Wooden floor: use thick wood and place a layer of hardware cloth underneath it. Dirt floor: Sink a wall of ½\" (1.25cm) or smaller wire mesh or hardware cloth 12 in (30cm) deep around the perimeter. Extend the wall horizontally, 8–12 in (20–30cm) outward, so the fox can't dig underneath it."
    },
    {
      "title": "Cover chicken wire and holes with hardware cloth.",
      "content": "Cover chicken wire and holes with hardware cloth. Foxes can chew through chicken wire. Cover it with galvanized steel hardware cloth, or mesh with holes no larger than ½\" (1.25cm). Check regularly for holes in the walls and floor, and cover these as well. Secure with construction staples. [14] X Research source Even a small hole could be torn to make a larger one, or could be the entry point for a smaller predator. Also cover any weak points in construction, such as the edge of loose boards."
    },
    {
      "title": "Install multiple bolts.",
      "content": "Install multiple bolts. Foxes can operate a twist catch and other simple locks. Use bolts instead, with a latch to secure them. Ideally, install two or more locks to protect your animals if one breaks or if someone makes a mistake while locking it."
    },
    {
      "title": "Give birds a high roost.",
      "content": "Give birds a high roost. If you're protecting birds, give them a perch at the top of the coop to reach in times of danger. This may not stop a fox indefinitely, but it could give you time to respond to a commotion."
    },
    {
      "title": "Consider waiting until the kits mature.",
      "content": "Consider waiting until the kits mature. If a fox is raising a family in your yard, consider allowing it to stay until the kits are old enough to travel. They should be able to leave safely at nine weeks old, when they start hunting with their parents. This usually happens in late spring or early summer. The first time you see kits out of the den, they're probably around four or five weeks old. Give them another month before you drive them out."
    },
    {
      "title": "Loosely block entrances with repellent.",
      "content": "Loosely block entrances with repellent. Most dens are in enclosed spaces, such as crawlspaces or rock shelters. Soak rags or straw in commercial fox repellent, and place them in the path of the entrance. Pile it high without blocking the fox's access. [15] X Research source"
    },
    {
      "title": "Replace daily.",
      "content": "Replace daily. If there are foxes living in the den, they should move the repellent out of the way frequently. Check daily and replace with fresh repellent if necessary."
    },
    {
      "title": "Block permanently once the foxes have left.",
      "content": "Block permanently once the foxes have left. If a batch of repellent is still blocking the entrances after two days, the foxes have probably moved on. Block the entrance with a more substantial barrier, such as bricks or cinder blocks."
    }
  ]
}