{
  "url": "https://www.wikihow.com/Find-Peace",
  "title": "How to Find Peace",
  "steps": [
    {
      "title": "Take twelve minutes in the morning.",
      "content": "Take twelve minutes in the morning. Mornings are often full of the activities of getting ready for the day. Since you just woke up it might not occur to you to take twelve minutes to relax your mind before you start your day. [1] X Research source Science proves that it takes approximately twelve minutes of calm to lower your cortisol, “the stress hormone” in the morning when it is at a high level. Cortisol impacts the body’s ability to maintain homeostasis. Instead of turning on the computer or phone to check mail or messages, take a cup of tea outside and clear your mind as the sun comes up."
    },
    {
      "title": "Participate in acts that encourage meditation.",
      "content": "Participate in acts that encourage meditation. When you think of meditation, you might imagine sitting on a pillow, legs crossed, eyes closed. While this is one way to meditate, the truth is you can meditate at any time and, in fact, certain types of activity can actually encourage you to enter a meditative or mindful state. Try doing something slightly repetitive that doesn't demand too much brain power. This could be a chore, such as washing dishes, chopping vegetables, or sweeping the floor, or it could be an activity like knitting, coloring, or throwing clay on a pottery wheel. Find a quiet, distraction-free place to work (turn off the television, etc.) and simply allow yourself to focus on your senses as you work. [2] X Research source For instance, if you're washing the dishes, notice how the water feels on your skin and the sponge feels in your hand. Listen to the splash of the water and smell the scent of the soap. Don't judge, label, or think too hard about what you're doing. Just allow yourself to fully experience the moment. If you find you are distracted by a nagging thought, try writing it down and going back to your activity. Try checking in with yourself to see how meditation has helped you progress. For instance, if at the start of the month you rate your peacefulness level as a 4 on a scale of 1 to 10, you might use that as a benchmark to see how you feel at the start of the following month. [3] X Expert Source Sydney Axelrod Certified Life Coach Expert Interview. 30 June 2020."
    },
    {
      "title": "Take a walk in nature.",
      "content": "Take a walk in nature. The quietness of nature is a simple way to find immediately silence. The background noise of the wind blowing, animals bustling about, and your phone turned off, helps the mind to relax on nothingness. If you decide to take a walk in the woods, leave the cell phone, iPod, or tablet at home. These noisy devices can become active at any moment disrupting the peace and quiet. Or, if you live in the city, hiking in open spaces, strolling through the park, or even watching nature scenes on television has proven to bring about a peaceful environment."
    },
    {
      "title": "Grow a green thumb.",
      "content": "Grow a green thumb. Besides the production of healthy food, gardening provides an exercise that has many benefits to finding peace. First, gardening puts you outside close to nature and, second, it is mostly a quiet, solo activity. Planting fruits and vegetables will help bring down the stress level and even keep your mind fresh . [4] X Research source Fresh air and physical exertion that is a part of gardening has shown to reduce stress, release aggression, and reduce weight while, at the same time, provide pride in your production."
    },
    {
      "title": "Commute quietly.",
      "content": "Commute quietly. Travel in your car with the music turned off and, instead, reflect on the day’s events to revive a tired spirit and restore peace. Take a break from cell phones, video games, computers, and other electronic devices while driving to or from work to regain some peace in your life. [5] X Research source Instead of turning the radio off, play specially made music that focuses on meditation. This type of music usually drowns out the hubbub of the commute and helps reduce stress and bring peace. Use your commute as an opportunity to bring awareness of your thoughts and feelings without judgment. This mindful exercise will help reduce the negative emotions of a long commute or the impatience of being stuck in traffic. While commuting, find an enjoyable activity to pass the time. You can use your daily commute a period of peace between other obligations. If you drive, try listening to meditation or classical music. If you take public transportation, read a book or grab a quick nap."
    },
    {
      "title": "Turn off cell phone notifications.",
      "content": "Turn off cell phone notifications. Cell phones are easily the greatest distraction in modern society. Research indicates that, on average, people check their cell phones 150 times every day, or every six minutes in a 16 hour day. This cacophony does not promote a peaceful environment. [6] X Research source Simply turn off all nonessential notifications – facebook, twitter, game updates, and email – as your default setting. Make a few scheduled times throughout the day to check all your notifications."
    },
    {
      "title": "Complete unfinished tasks.",
      "content": "Complete unfinished tasks. Work on your time-management skills. It is not uncommon to have several unfinished projects lined up around the house or work. The list may seem unending — household chores, unanswered mail, balancing the checkbook, hungry pets — but many of these projects can be completed in rather short time if you focus on completing them immediately. [7] X Research source Adopt a “one-minute rule” mentality as most of unfinished chores can be completed in less than two minutes. By completing these projects as quickly as possible, it will remove many of the small, irritable distractions you deal with on a daily basis. Keep a short to-do list to keep your day organized and efficient. By writing your tasks down on a piece of paper, you can let that thought leave your mind."
    },
    {
      "title": "Remove clutter.",
      "content": "Remove clutter. An unclean environment is not pleasant to anybody’s eyes and a large amount of clutter lying around causes stress. Eyes are very attentive and subtly pick up many details of the surrounding area. Clutter does not allow you to focus your thoughts or attention because of all the visual distractions. [8] X Research source Clean your desk, walls, and counters in your home and office of all unnecessary possessions so that you are not easily distracted. The same goes for digital clutter. Dozens of desktop icons, opened programs, games, or instant messaging all compete for attention. Removing these items will help your focus."
    },
    {
      "title": "Unplug the television.",
      "content": "Unplug the television. Or, cancel your cable or satellite subscription. There are fewer time consuming distractions than the television. Indeed, the average person watches between 37-40 hours of television each week. [9] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source Cable or satellite television now offers nearly two hundred channels. Think about the amount of time you waste simply surfing through all of these stations and end up watching nothing. If peace in the house is not a strong motivator, think about cost. The average cable package is now more than $100 per month, or $1,200 per year."
    },
    {
      "title": "Focus on breathing.",
      "content": "Focus on breathing. Breathing is so natural that we rarely take time to ever think about paying attention to its healthy benefits. Taking short, three minute breaks a few times every day to stop what you are doing and inhale and exhale deeply can help clarify your thoughts, calm you down, and make you more productive. Make sure you find a quiet space so that you can concentrate on breathing as the air circulates throughout your entire body. Start by deliberately preparing to engage in a breathing exercise by either sitting or standing in a quiet area. As you close your eyes to begin inhaling, ask yourself what thoughts, feelings, and sensations you are currently experiencing. Do this for one minute. After one minute, redirect your focus on your breathing from inhale to exhale as you gather and focus your attention on physical sensations. As you exhale, do not let your mind wonder. Do this for another one minute. During the final minute, expand your attention by including thoughts about your posture and facial expressions and search for any discomfort or tension. If so, concentrate your attention by imagining the intensity of your breath to the location of the pain. Breathing has a dual impact: it’s a meditation that helps you to maintain compassion and thoughtfulness, and allows you to reduce stress and pressure by taking control of the situation."
    },
    {
      "title": "Rest your eyes.",
      "content": "Rest your eyes. Most people believe that it is a fundamental act to close your eyes while performing meditation, but many forms of meditation require “open eyes” to avoid falling asleep. Most techniques want you to keep your eyes half open while others suggest you perform a full stare. Although both “eyes open” and “eyes shut” are acceptable while trying to find peace in your day. Start by focusing your eyes on a static point while relaxing your body. Take three deep breaths and as you exhale, relax your shoulders, jaw, and face. Be aware of the world around you — sounds, smells, and temperature — to help you realize what you are thinking and feeling on the inside. Accept all of the sensory information you are processing. It is important not to make an effort to control or change anything. Remember that meditation is a practice. Just like any other exercise or sport, you must set aside time to develop your skills for practical use. Indeed, the goal of open eye meditation is to maintain a centered awareness while you perform the duties of life."
    },
    {
      "title": "Relax while you sit in a chair.",
      "content": "Relax while you sit in a chair. There are several ways to relax your body sitting in a variety of positions. The most important factor is that you choose a position that affords you the most comfort. Although sitting in a chair is the easiest position, you should make sure that your spine is upright; your spine, shoulders, and head should be relaxed; and never slouch or slump over. [10] X Research source Avoid putting yourself in a position that demands more flexibility than you really have. Remember the point is to be relaxed. Place blocks of wood or a telephone directory to raise the back legs of the chair in order to make sure you are using correct posture: sit upright without having to either hold your back rigidly, or leaning against the back of the chair, only the base of your spine should touch the back of the chair. Your hands should be on your thighs with your palms facing down unless you place a pillow on your lap then your palms should face up. Keep your feet flat on the ground. If your feet cannot reach the ground, then place a folded blanket under your feet to keep them from dangling."
    },
    {
      "title": "Kneel or use a pillow.",
      "content": "Kneel or use a pillow. If sitting in a chair is too easy and you cannot sit cross-legged, then you might want to consider just sitting on the floor. The floor is a safe venue for you to mediate because it provides solid base allowing you to concentrate on easing your mind. It is okay to just kneel or you can place a pillow or bench to support your full body weight. [11] X Research source If you use pillows, make sure they are really firm and supportive (zafus are specially-designed pillows made for meditation). Make sure the height of the pillows is appropriate, otherwise you might slump which causes discomfort, pinching, and a lack of concentration. You can place your hands in several different positions, but it might be easiest if you just have your hands supported in front of you. If there is discomfort, you can always place another pillow or a blanket in front of you to rest your hands on."
    },
    {
      "title": "Sit cross-legged.",
      "content": "Sit cross-legged. Similar to the half-lotus and full-lotus position in yoga, sitting cross-legged is the most difficult position to mediate in. Therefore, caution should be taken not to force yourself into this uncomfortable posture since it could cause long-term damage to muscles and joints. You also will not be able to concentrate if you are in pain. [12] X Research source For mediators, the tailor position is the simplest and most common cross-legged position. For this pose, make sure both your knees are on the ground for proper support. If you cannot get both knees on the floor, use a firm cushion or folded blanket to keep your knees stable by placing it under the knee that is not touching the ground. If you cannot reach the complete position, trying doing yoga exercises to loosen your hips. Keep your hands rested on your lap with your palms facing up."
    },
    {
      "title": "Become mindful.",
      "content": "Become mindful. Throughout the day your mind might go on autopilot as you mindlessly rush around without much conscious thought about what you are doing. Our brains are constantly flooded with both visual and mental clutter as we endure the frenzied and chaotic world around us. Mindfulness exercises enable us to become more fully immersed in the present moment, and break the chain of stress and worry. [13] X Research source As with many other meditation techniques, breathing exercises that concentrate on inhaling, exhaling, and the air moving throughout your body is important for bringing awareness to your center and ultimately back to your surroundings. This exercise brings mindfulness to the moment-by-moment awareness of thoughts, sensations, feelings, and a sense of the environment around you. Eating is another way to achieve mindfulness. An example would be eating a raisin or other dried fruit that you can hold, feel its texture, see its color, smell, and taste it. As you eat the raisin, follow the same procedure as you swallow it. By eating the raisin, you have experienced the wide-range of senses in a mindful manner, taking note of how meaningful the exercise is. Mindfulness can be achieved by carrying out everyday chores and activities. Similar to the raisin exercise, engage with every process of the exercise instead of mindlessly completing it like you usually do. Try to only complete one mindful activity per day for about ten minutes. At the end of the week, write down your reactions to each experience and explain what it was like to engage in these activities in a more mindful manner. Most important, try to evaluate the difference between performing the activity mindlessly and mindfully. Remember that mindfulness is about acceptance and non-judgment – the way they are – rather than trying to change or control the activity. Mindfulness is an exercise that requires practice and participation to fully benefit from it."
    },
    {
      "title": "Practice conscious physical immobility.",
      "content": "Practice conscious physical immobility. Stillness is a high state of energy that provides undivided attention to experiencing the truth about yourself. Stillness is an absence of negative energy that is unopposed, dynamic, harmonious, and provides a new sense of aliveness. Achieving the highest levels of stillness will bring peace and spontaneously transform the way you think about yourself and how you view the world. Understanding yourself by being with yourself is the lowest level of stillness. First, pay attention to your body’s sensations as you practice being quiet both physically and mentally. This is accomplished by being wide awake and consciously relaxing your body in your current environment. Let go of all your contradictory self-evaluations by reaching deep inside yourself to experience yourself and find your true identity. After you resolve your internal conflict and turmoil, you will experience peace. Once you achieve this stage, you can move onto living your daily life with confidence of your new found certainty. This means staying in touch with the truth about yourself at all times throughout the day and letting go of judgments, evaluations, and false opinions about yourself. Stay centered on your inner peace to keep your perspective grounded. This will help validate your new identity to yourself and to others."
    },
    {
      "title": "Perform yoga.",
      "content": "Perform yoga. Yoga helps you uncover and discover your true nature so that you can live with your new awareness. Experiencing your true nature – thoughts, feelings, and emotions – through yoga will enable you to move into stillness. These behaviors, in turn, determine how you think, what you do, and how you interact with the environment. In short, it could factor in your quality of life. [14] X Research source Although many yoga poses will help you achieve both peace and stillness, the corpse pose, or Savasana, is an easy pose to begin with. This pose is lying on your back, arms and legs spread at 45 degrees, with deep breathes. This position is meant for total relaxation and releasing tension. Stay in the present, keep your eyes shut, and be aware of your surroundings. Relax your facial muscles and breathe deeply and slowly through your nose. Starting at the top of the head and working your way down to the feet, bring your attention to each part of your body, consciously relaxing it before proceeding on to the next. Perform this for three to five minutes and avoid falling asleep."
    },
    {
      "title": "Count backwards.",
      "content": "Count backwards. Counting backwards is a breathing exercise meant to calm your body, bring stillness, and achieve peace during a busy day. Simply find a quiet space and count backwards from fifty to zero while synchronizing the numbers with your breathing. Even numbers are for exhaling and odd numbers are for inhaling. This also helps with counting in case you lose track. Try counting only on exhales. Make sure your back is straight and your eyes are closed. You can sit on a chair or on the floor, whichever is more comfortable. When you reach zero, stop counting but be aware of the natural state of your breathing. Breathe normally as the goal is to stay in control by breathing freely without deep breathes. By counting backwards, you remain centered and develop concentration, but you also become aware of your thoughts and surroundings as your mind becomes active during the process."
    },
    {
      "title": "Come back to center.",
      "content": "Come back to center. Typically, motionless sitting is the easiest way to achieve stillness, but this does not necessarily mean you have to be physically motionless. Instead, you should become more familiar with the energy of stillness through the practice of motionless sitting. Spend only a few seconds doing this exercise, but try to do it often throughout the day. Motionless sitting can be performed at your desk at work, driving in the car, in the midst of conversation, or even during a meal. The goal is to feel peace and happiness, therefore, try coming back to center many times throughout the day."
    },
    {
      "title": "Spend time with friends and family.",
      "content": "Spend time with friends and family. Sometimes having inner emptiness or loneliness is filled with a busy lifestyle. What you might be missing is love and support. Visiting with friends and family can help fill that void by helping you to relax and give balance to your busy life. [15] X Research source Talking with people you love and trust is a good way to relieve stress, think positive, and take your mind off of work and other pressing issues. Regardless of how busy your weekly schedule is, take one day of the week to dedicate to friends and family. Your body and mind will appreciate it. Family and friends also provide companionship, camaraderie, and happier encounters that reduce feelings of loneliness and stress."
    },
    {
      "title": "Engage in meaningful work.",
      "content": "Engage in meaningful work. Recent research illustrates that participating in meaningful work, like volunteering, is linked to increased well-being, lower rates of depression, and reduced risk of dying. [16] X Research source Instead of laying around the house all day, consider getting out and volunteering. The benefits of good physical activity and helping others are sure to get you in a good frame of mind. Making social connections with human beings and not your computer or cell phone will make you feel good because humans were created to see, touch, and interact with each other. Biologically, this interaction releases the hormone oxytocin, which is associated with bonding, caring, and reducing stress levels. Volunteering is a feel-good activity that should give you a deep sense of worth and happiness."
    },
    {
      "title": "Believe in yourself.",
      "content": "Believe in yourself. There are times when even the best human being occasionally acts on impure motivations. We tell small lies to avoid larger problems, act improperly to get social approval, or console a friend or acquaintance to get a favor in return. Although these actions are not necessarily illegal, they do build up and come with guilt and other unsavory feelings. [17] X Research source Think about the true motivations for your actions by asking yourself what the real reason is for doing something. In other words, don’t lie to yourself or others. Believe your reason is a good reason. Believing in yourself and telling the truth about why you do what you do will gradually cleanse your inner self. It would be a good idea to separate yourself from individuals who continue to lie and deceive so that you do not fall back into that pattern. Continue to cleanse your mind and soul of inappropriate thoughts as move through life and you will eventually choose activities that connect you to things you enjoy and the people you love."
    },
    {
      "title": "Seek professional advice.",
      "content": "Seek professional advice. If you are struggling to find inner peace by yourself, then you should consider finding a psychologist or a therapy treatment. Professional counselors will examine your mood, anxieties, focus, and your relationships to find a treatment plan to address your issues. [18] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Professional psychologists are highly trained in clinical evaluation and assessment to help people cope more effectively with finding peace. You should never be afraid to seek out professional help. Many people believe that professional psychologists only treat people with severe mental problems like depression, anger management, or other brain traumas, but, in reality, they can help with a wide range of health problems, including physical problems. Psychologists also work with primary care physicians, pediatricians, and psychiatrists to help you find peace medically, physically, or therapeutically."
    }
  ]
}