{
  "url": "https://www.wikihow.com/Cope-With-Wearing-Diapers-to-School",
  "title": "How to Cope With Wearing Diapers to School",
  "steps": [
    {
      "title": "Determine the level of absorbency you need.",
      "content": "Determine the level of absorbency you need. The type of diaper you wear will depend on the amount of leakage you have, daytime wetting versus nighttime wetting, and what size you are. Diapers with more absorbency and nighttime wetting diapers are bulkier."
    },
    {
      "title": "Find the right diapers.",
      "content": "Find the right diapers. Because incontinence is an issue for people of all ages [1] X Research source , a variety of diapers are on the market to meet your needs, and it can be helpful to research the various products that are available that will help you feel physically comfortable. There are diapers especially for older children, preteens, teenagers, and adults [2] X Research source . You should try different brands of diapers until you find the right one. Having the right diapers can make you feel more confident. Youth pull ups are a great option for older children. Popular brands of youth pull ups are Goodnites and Select. Some of these pullups look exactly like regular underwear. Shopping for diapers can be expensive. The CareGiver Partnership allows you to try out samples before you spend a lot of money on diapers. If you are a preteen, you may be too small for adult diapers and too big for youth diapers. Race Car Diapers are made for preteens and come in many different sizes. These diapers were designed for boys. Molicare is another brand that has sizes for preteens. Popular brands for teenagers are Tena , Prevail, and Tranquility. You can also insert booster pads into your diapers to increase how much your diaper can hold. The booster pads will also allow your diapers to absorb more. The most important factor when finding the right diaper is how you feel in them. If they fit well and you are comfortable, you will be more confident wearing them to school. There may be other students with the same issues and you may want to be upfront about it. Sports are possible with the right product. Part of being more comfortable with your body is the acceptance that all bodies are diverse in shapes and functioning, and that means taking care of your body in a way that makes sense for you and your personal needs. There is a growing market of products used to manage incontinence ranging from briefs, pads, to specialty incontinence underwear that are designed to be discreet and comfortable to wear."
    },
    {
      "title": "Try your diapers on with your school clothes.",
      "content": "Try your diapers on with your school clothes. You should wear your diapers when you go shopping for new clothes. This will help you find clothes that do not expose your diapers. Wearing clothes that are one size larger than your actual size will help hide your diapers."
    },
    {
      "title": "Talk to the school nurse or an administrator.",
      "content": "Talk to the school nurse or an administrator. Both you and your parents should discuss your medical condition with people at your school. Letting an authority figure at school know that you wear diapers may allow you to have some special privileges. You may be able to gain access to a private restroom where you can change your diapers. They may also give you permission to come late to class or leave class early to change your diaper. Two more things are necessary if you want to have complete bowel and urinary protection - namely a pair of plastic pull up pants - clear is best so as to monitor adult diapers underneath; and a onesie or singlet for support of the diaper once it becomes heavier. Lastly, Seni Quatro or Tena slip maxi are the kind of quiet briefs with cotton surface and hook-and-loop fastener which attract no attention in a stall."
    },
    {
      "title": "Be discreet.",
      "content": "Be discreet. Bring your extra diapers, lotions, and creams in a special pouch that you keep in your backpack or in a backpack diaper bag. Diaper backpacks have special compartments to store all of your supplies, but they look like a regular backpack. You should also pack plastic bags in your backpack. You can put your dirty diaper in the plastic bag before you throw it away. Throwing away a plastic bag is less embarrassing than throwing away a diaper."
    },
    {
      "title": "Go to the bathroom during class.",
      "content": "Go to the bathroom during class. Plan to use the bathroom when other students are less likely to be there. You want to increase your chances of being in the bathroom alone."
    },
    {
      "title": "Practice changing your diaper.",
      "content": "Practice changing your diaper. Diapers are noisy and changing in a public restroom may make you uncomfortable. You should figure out the quietest and quickest way to change your diaper when you are at home. This will help you feel more comfortable changing your diaper when you are at school. You may feel more comfortable just pulling down your wet or soiled brief rather than undoing noisy plastic tapes. Since you won't be able to wrap it tight to throw away, bring a bag for sure."
    },
    {
      "title": "Develop thick skin.",
      "content": "Develop thick skin. Some people may make fun of you for wearing diapers or ask you personal questions. If you are being bullied, you need to let your parents, teachers and principal know. You should also stand up for yourself if someone is teasing you. If someone politely asks you about wearing diapers, you should explain to them that you have a medical condition. It’s also helpful to challenge messages or biases that are rooted in ableism and marginalization and work to increase more inclusivity of all body types and needs."
    },
    {
      "title": "Change your diaper quickly if you have an accident.",
      "content": "Change your diaper quickly if you have an accident. A wet diaper is difficult to hide, and other people may notice. Changing your diaper as soon as it is wet will prevent the diaper from sagging and showing through your clothes. Soaked diapers will also smell if they are not changed quickly."
    },
    {
      "title": "Join a support group.",
      "content": "Join a support group. Talking to other people who also wear diapers to school can be a source of comfort. You can also get tips and ideas about how other people manage wearing diapers to school. Support groups can be online or in person. There are many online support groups and discussion boards. [3] X Research source The National Association for Continence also has a list of resources to help you connect with other people."
    },
    {
      "title": "Identify what type of incontinence you have.",
      "content": "Identify what type of incontinence you have. There are three major types of incontinence: urinary [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source , fecal [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source , and stress. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Urinary continence is when you do not have control over your bladder. You may leak urine or not make it to the bathroom in time when you feel the urge. Fecal incontinence is when you do not have control of your bowel movements. Stress incontinence is when certain movements or activities (coughing, sneezing, running, jumping) put stress on your bladder and causes you leak urine."
    },
    {
      "title": "Keep a diary.",
      "content": "Keep a diary. Try keeping a diary to learn what your triggers are. Information you should include in your diary are: the foods and drinks you are consuming; how often you go to the bathroom; the types of activities that cause you to leak. You should make your diary as detailed as possible. The information in your diary will also be helpful to your doctor. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get professional help.",
      "content": "Get professional help. A doctor will be able to help to identify the cause of your incontinence and create a treatment plan that is just for you. It is important that you talk openly with your doctor. You should not feel embarrassed because your doctor is used to helping people who have the same problem you have. Your doctor may send you to a physical therapist, prescribe medications, or even talk to you about the possibility of surgery. Your doctor will take a medical history, do a physical exam, talk to your parents, discuss a treatment plan, and run some tests. The National Association for Continence maintains a list of specialists across the United States."
    },
    {
      "title": "Create a voiding strategy.",
      "content": "Create a voiding strategy. Voiding is a part of bladder training that teaches you to go to the bathroom at specific times. [8] X Research source You should discuss a voiding strategy with your doctor before you begin one. Scheduling bathroom visits helps to strengthen your bladder muscles and decrease the need to use diapers. If you are a child, your parents can help you with your bladder training. Start by measuring how often you use the bathroom. If you need to go to the bathroom every 20 minutes, try to increase the time between 5 and 20 minutes. You should slowly increase the time between your bathroom visits until you can go 90 to 120 minutes. If you are older, you can increase the time between bathroom visits by 15 minute increment."
    }
  ]
}