{
  "url": "https://www.wikihow.com/Do-Your-First-Pull-Up",
  "title": "How to Do Your First Pull Up",
  "steps": [
    {
      "title": "Do dead hangs to improve your form and grip strength.",
      "content": "Do dead hangs to improve your form and grip strength. [1] X Expert Source Adam Shuty Certified Strength & Conditioning Specialist Expert Interview. 26 August 2020. Use a sturdy pull-up bar that’s tall enough for you to hang with your arms fully extended. Grab the bar and position your hands slightly wider than shoulder-width apart. Lift your feet off of the ground and try to bring your shoulder blades together to activate your back muscles. Hold the position for as long as you can before relaxing your body. Try to hold your dead hang for at least 10 seconds at a time and repeat the exercise for 10 reps. [2] X Research source Work your way up to holding your dead hang for a full minute so you get used to the grip and form. You can also try draping a towel over the bar. Bunch up the ends of the towel and hold onto it instead of the bar. The towel’s uneven surface will make it more difficult to hang, but will make your grip better. [3] X Research source"
    },
    {
      "title": "Try assisted pull-ups with a resistance band to help lift your bodyweight.",
      "content": "Try assisted pull-ups with a resistance band to help lift your bodyweight. [4] X Expert Source Adam Shuty Certified Strength & Conditioning Specialist Expert Interview. 26 August 2020. Use a resistance band that forms a closed loop. Drape the band over your pull-up bar and feed one end through the loop. Pull the end down to secure the band to the pull-up bar. Place your foot in the resistance band and hold onto the bar so your hands are shoulder-width apart. Pull yourself up so your chin is over the bar. Hold the position for 1 count before lowering yourself back down. Try doing about 1–2 sets of 5–10 assisted pull-ups. [5] X Research source The resistance band will lower the resistance needed to lift your bodyweight so you can do pull-ups easier. Switch to bands with lower resistance as you get more comfortable lifting your bodyweight. Once you feel comfortable using the lowest resistance band, you can probably try doing a pull-up without one."
    },
    {
      "title": "Practice lowering yourself from the bar doing negative pull-ups.",
      "content": "Practice lowering yourself from the bar doing negative pull-ups. Stand on a chair or box so your head is already over the pull-up bar. Keep your hands slightly wider than shoulder-width and hold tightly onto the bar. Step off of the chair and slowly straighten your arms to lower your body down. When your arms are fully extended, let go of the bar. Do 1–2 sets that are around 8–10 reps each. [6] X Research source Negative pull-ups isolate your movements so you can practice the last half of the pull-up even if you can’t lift your bodyweight just yet. Once you feel comfortable doing 2–3 sets, try doing a full pull-up."
    },
    {
      "title": "Jump onto the bar to boost yourself up during the pull-up.",
      "content": "Jump onto the bar to boost yourself up during the pull-up. [7] X Expert Source Adam Shuty Certified Strength & Conditioning Specialist Expert Interview. 26 August 2020. Stand underneath the bar or on a chair so you can reach it. Try to jump straight up and grab onto the bar so your hands are shoulder-width apart. Use your momentum to pull your chin over the bar and hold the position for 1 count. Slowly lower yourself back down so your arms are fully extended again. Try doing as many jumping pull-ups as you can. [8] X Research source Jumping pull-ups can also help strengthen your muscles since you’re doing more explosive exercises. As jumping pull-ups get easier, don’t jump as high to make them more challenging."
    },
    {
      "title": "Attempt a partial pull-up to improve your range of motion.",
      "content": "Attempt a partial pull-up to improve your range of motion. Hang from the bar with your arms shoulder-width apart and your feet off of the ground. Touch your shoulder blades together and bend your elbows to pull up your bodyweight. Try to pull yourself up as far as you can in a slow and controlled motion. When you feel like you can’t lift yourself up anymore, straighten your arms and relax. Try to do as many partial pull-ups as you can. [9] X Research source Doing partial pull-ups are a great way to check your progress so you can see how much stronger you’ve gotten. One day, you may even try a partial pull-up and end up doing your first full one! You may also try doing chin-ups, where you hang onto the bar with your palms facing you instead of away from you. Chin-ups may be easier for you since you keep your hands closer together and use your biceps more."
    },
    {
      "title": "Exercise 4–5 days every week to get stronger.",
      "content": "Exercise 4–5 days every week to get stronger. Set aside 30-minute sessions throughout the week for you to work out. Plan on working your upper body and back during your workouts to improve your pull-up strength. It doesn’t matter which days you choose, but take at least 2 rest days so you don’t strain your muscles. General exercise will also help you lose weight, which means you’ll have less bodyweight to lift. [10] X Research source You can also incorporate other muscle groups into your routine so you aren’t doing the same thing every day. For example, you may work your upper body and chest one day and then exercise your back and legs the next day. Try choosing a few days each week to do cardio exercises, such as biking, running, or swimming, to help improve your stamina."
    },
    {
      "title": "Use a lat pull-down machine to strengthen your back.",
      "content": "Use a lat pull-down machine to strengthen your back. Lat pull-down machines simulate the motion you’ll use during a pull-up but you can choose the weight you're lifting. Slide the pin into a comfortable weight and reach up to grab the bar. Pull the bar on the machine down so it’s below your chin and hold it for 1 count. Raise the bar back up slowly to the starting position. Try doing 8–12 lat pull-downs per set for 1–2 sets. [11] X Research source Increase the weight as you get more comfortable on the machine. Try to work all the way up to your bodyweight so you’re prepared to do your first pull-up. You can also use an assisted pull-up machine, which helps you improve your form but uses counterweights so you don’t have to lift as much."
    },
    {
      "title": "Practice dumbbell curls to work your upper arms.",
      "content": "Practice dumbbell curls to work your upper arms. Keep your arms straight and your palms face-up by your hips. Hold a barbell or dumbbells and slowly bend your elbow to start your curl. Bring the weight up to your shoulders and hold it for a count. Lower the weight back down until your arms are straight again to complete your rep. Practice doing around 10 reps for 2–3 sets. [12] X Research source Choose a weight you’re comfortable with and doesn’t cause a lot of strain. As lifting that weight gets easier, you can use something heavier. Avoid swinging the weights up or down since you won’t work your biceps properly and you could injure yourself. As soon as you can finish your sets using 25 lb (11 kg) weights, attempt doing a pull-up."
    },
    {
      "title": "Work out your back and arms with dumbbell rows.",
      "content": "Work out your back and arms with dumbbell rows. Stand in front of a workout bench with your feet shoulder-width apart and your knees slightly bent. Bend at the knees so you’re leaning over the bench and support your weight with one of your arms. Hold a dumbbell in your other hand and let your arm hang straight down. Slowly lift the weight up to your chest. Hold it there for a count before lowering it back to the starting position. [13] X Research source Try doing about 3 sets that are 8–12 reps each. [14] X Research source Dumbbell rows help work out your back muscles and shoulders. Once you can comfortably row with 25 lb (11 kg) dumbbells, start trying to do pull-ups. Keep the rest of your body still while doing dumbbell rows, or you may work the wrong muscles."
    },
    {
      "title": "Try lifting your bodyweight doing inverted body rows.",
      "content": "Try lifting your bodyweight doing inverted body rows. [15] X Expert Source Adam Shuty Certified Strength & Conditioning Specialist Expert Interview. 26 August 2020. Set a barbell on a rack so it’s at waist-height. Lie on your back underneath the bar and grab onto it so your hands are shoulder-width apart. Keep the legs and body straight as you pull yourself up toward the bar. Hold your chest against the bar for 1 count before slowly lowering yourself back down. Try to do at least 10 reps for about 1–2 sets. [16] X Research source If you want more of a challenge, try putting the bar at knee-height instead. Inverted body rows help improve your back form and helps you get used to lifting your bodyweight. Once you can finish your sets without getting winded, you may be ready to perform your first pull-up."
    },
    {
      "title": "Perform farmer’s carries with kettlebells to work on your grip strength.",
      "content": "Perform farmer’s carries with kettlebells to work on your grip strength. Hold a heavy kettlebell in each hand and grip the handle tightly. Keep your back in a neutral position and your arms at your sides. Hold the kettlebells for at least 60 seconds before lowering them back down to the floor. Rest for a few counts before picking the kettlebells up again. Complete 5 or 6 reps of farmer’s carry during your workout. [17] X Research source If you want to make your farmer’s carry more difficult, try holding onto the kettlebells while you walk 50–100 feet (15–30 m). Reader Poll: We asked 268 wikiHow readers how they liked to refuel after a workout, and 51% of them said protein shake. [Take Poll]"
    },
    {
      "title": "Grip the bar with your hands shoulder-width apart.",
      "content": "Grip the bar with your hands shoulder-width apart. Stand on a chair, workout bench, or box so you can reach the pull-up bar. Position your hands so they’re slightly wider than your shoulders with your palms facing away from you. Avoid gripping the bar any wider, or else it will be more difficult and affect your form. [18] X Research source If you have trouble holding onto the bar, wear exercise gloves to improve your grip. You can also jump up onto the bar, but you may have to adjust your grip while you’re hanging."
    },
    {
      "title": "Let your body hang from the bar.",
      "content": "Let your body hang from the bar. Step off of the chair or bench so your feet are off the ground. Try to make your body into an arched banana shape so you don’t swing around. Look straight ahead and keep your arms straight. [19] X Research source If you don’t have room to fully straighten your legs, it’s okay to bend your knees while performing a pull-up."
    },
    {
      "title": "Bring your shoulders together to engage your muscles.",
      "content": "Bring your shoulders together to engage your muscles. Try to lower your shoulders away from your ears to activate your latissimus dorsi, which is your upper back muscle. Move your shoulder blades closer to your spine to help engage the muscles so it’s easier to lift your bodyweight. [20] X Research source Once you engage your shoulders and back, keep your body straight since it will be easier to control your movements."
    },
    {
      "title": "Pull your body up to lift your chin over the bar.",
      "content": "Pull your body up to lift your chin over the bar. Bend your elbows and engage your biceps to lift your bodyweight. Use slow and controlled movements so you maintain your form and reduce the risk of injury. Bring your chin up past the bar. [21] X Research source It may help to have a friend or workout partner to help encourage you. Having them cheer you on may give you enough extra push to complete your pull-up. If you feel shoulder or back pain or if you’re unable to finish the pull-up, lower yourself back down slowly and let go of the bar so you don’t strain yourself."
    },
    {
      "title": "Hold your head over the bar for 1 count.",
      "content": "Hold your head over the bar for 1 count. Maintain your position so your muscles stay engaged. Don’t forget to breathe while you’re at the top of your pull-up, or else you may feel more winded. If you feel like you can’t keep holding your head over the bar, lower yourself back down slowly. [22] X Research source"
    },
    {
      "title": "Lower yourself back down so your arms are straight.",
      "content": "Lower yourself back down so your arms are straight. Slowly straighten out your arms and bring your head back below the bar. Keep your body rigid so it doesn’t swing or move around during the exercise. Once you straighten your arms, relax your shoulders again to finish your rep. [23] X Research source Take a second to congratulate yourself and celebrate completing your first pull-up."
    }
  ]
}