{
  "url": "https://www.wikihow.com/Find-Out-if-You-Have-ADHD",
  "title": "How to Find Out if You Have ADHD",
  "steps": [
    {
      "title": "Be aware of the probable causes of ADHD.",
      "content": "Be aware of the probable causes of ADHD. While researchers have yet to totally narrow down the roots of ADHD, there are some factors that stand out. For one, ADHD is prevalent in children from all walks of life and ethnic backgrounds. Several genes appear to be linked to ADHD and it runs in families. Other potential culprits that may lead to ADHD are: diets heavy in food additives, which might exacerbate symptoms diets low in omega-3 fatty acids maternal smoking and drinking complications at birth or low birth weight environmental exposure to toxins or lead brain injury"
    },
    {
      "title": "Search for a cluster of symptoms that indicate ADHD.",
      "content": "Search for a cluster of symptoms that indicate ADHD . ADHD is as unique as the individuals it affects. Nonetheless, there are a range of symptoms that typically present in children who suffer from this disorder. These symptoms interfere with a child's ability to function at school, at home, or in friendships. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Teachers and school administrators may alert you to problems in your child that may not be identifiable at home. Symptom presentation must be recognizable within the first 12 years of life and kids with ADHD must experience at least six symptoms, such as: [4] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source frequently forgetting things fidgeting or squirming being easily distracted losing books, toys, or other possessions act impatiently frequently interrupt others' conversations talk/sing/hum too much demonstrate trouble following instructions require extensive instructions to begin tasks having trouble taking turns run around a lot constantly switch back and forth between tasks"
    },
    {
      "title": "Understand the different subtypes of ADHD.",
      "content": "Understand the different subtypes of ADHD. Kids with ADHD generally receive one of three diagnoses. These subtypes depend on how symptoms are exhibited. Children with ADHD may experience changes in their symptom presentation over time; therefore, their diagnosis may change types. The three subtypes of ADHD are: [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Predominantly inattentive type. Children with this type are easily distracted, forgetful, lose things often, do not seem to be listening when spoken to, avoid or dislike tasks that require longer spans of concentration or mental effort, and are disorganized for the past 6 months. Predominantly hyperactive-impulsive type. Children with this type talk excessively, fidget and squirm when seated, seem to always on the go, blurt out answers to questions, have difficulty awaiting their turn, and demonstrates restlessness by climbing or jumping at times when it's inappropriate to do so for the past 6 months. Combined type . This ADHD subtype is diagnosed when both the criteria for inattentive type and hyperactive-impulsive type are equally present for the past 6 months."
    },
    {
      "title": "Figure out if problems at work or school point to a bigger problem.",
      "content": "Figure out if problems at work or school point to a bigger problem. Many adults with ADHD may not recognize that they have a problem. More than likely, you do not have ADHD if your symptoms began only recently or are present in only one area of your life (diagnosis in adulthood depends on symptom presentation throughout life). Adults with ADHD may change jobs regularly, never quite finding fulfillment in a specific position. These individuals may not have any particular career aspirations and rarely receive career-related accolades. Other work or school-related signs of adult ADHD may include: [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source [7] X Expert Source George Sachs, PsyD Licensed Psychologist Expert Interview. 5 March 2021. difficulty finishing tasks problems maintaining focus or concentration forgetfulness (e.g. meetings, deadlines, etc.) disorganization procrastination tardiness"
    },
    {
      "title": "See if emotional issues are suggestive of adult ADHD.",
      "content": "See if emotional issues are suggestive of adult ADHD. Adults with ADHD frequently have co-morbid diagnoses of other mental disorders such as depression or anxiety . Adults with ADHD may demonstrate low frustration tolerance, meaning the slightest mistake or criticism can greatly impact their emotional stability. [8] X Research source Such adults might easily blow up at others or sink into a depressive state. Adults with ADHD may also self-medicate their mood disturbances using alcohol or drugs, making substance abuse another common co-morbid problem. People with ADHD may also have low self-esteem and feel a lot of shame. [9] X Expert Source George Sachs, PsyD Licensed Psychologist Expert Interview. 5 March 2021."
    },
    {
      "title": "Take a closer look at your relationship difficulties.",
      "content": "Take a closer look at your relationship difficulties. Many people experience problems in their relationships that might resemble those who suffer from ADHD. However, adults with ADHD may encounter these issues to a greater extent. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Parents, siblings, friends, or partners may feel ignored or undervalued due to your constant talking over them, forgetting important engagements, and becoming easily bored in conversation. Plus, adults may exhibit impulsivity that results in them making poor decisions such as cheating, gambling, or abusing drugs or alcohol that interferes with their relationships."
    },
    {
      "title": "Take an online quiz.",
      "content": "Take an online quiz. [11] X Research source PsychCentral is one website that provides a preliminary assessment that helps you determine if the problems your are experiencing are suggestive of an attention disorder. Keep in mind that any test completed online without the guidance of a health care provider can only provide tentative results. You will need to see a trained professional who can interview you and look at your symptoms in relation to your medical and academic history."
    },
    {
      "title": "Visit your primary care physician.",
      "content": "Visit your primary care physician. Explain to your doctor that you are concerned that you may be experiencing symptoms similar to ADHD and would like to be examined. If you think you might not know what to say when you get there, write down on a piece of paper your areas of concerns. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Your doctor may be able to diagnose ADHD based on previous experience with the disorder. However, most physicians will refer you for further assessment with a psychologist or psychiatrist."
    },
    {
      "title": "Have a full medical check up.",
      "content": "Have a full medical check up. In order to be sure you have ADHD and not some other problem, you must get a range of tests to rule-out other conditions. Tests must include a blood test to rule out thyroid problems, lead poisoning or hypoglycemia. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you want a thorough diagnosis also have a hearing and vision test, a brain scan and an EEG. These tests help rule out other possible problems that may seem to be ADHD."
    },
    {
      "title": "Expect to answer questions about your life and symptoms.",
      "content": "Expect to answer questions about your life and symptoms. Answer these questions as honestly and fully as you can. Bring copies of school reports or letters of when you were suspended or expelled, sent to court, traffic violations and so on as examples of problem areas. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In some cases, in addition to self-report questionnaires, you might also be requested to complete a battery of psychological assessments. Such tests are designed to comprehensively examine your symptoms, personality, and any other co-existing conditions you might have."
    },
    {
      "title": "Have the psychologist interview others close to you.",
      "content": "Have the psychologist interview others close to you. These people might be your parents, spouse or teacher who can give a report on the areas you are struggling with. If this is not available they can fill out a questionnaire given by the doctor. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Talk to your health care team about treatment options.",
      "content": "Talk to your health care team about treatment options . There are effective treatments for children, teens, and adults who are diagnosed with ADHD. Many people attempt to relieve ADHD symptoms with natural remedies such as lifestyle changes (i.e. diet, sleep, exercise), developing routines, school or work accommodation and keeping distractions to a minimum. Research demonstrates that both children and adults show better results when they receive a combination of medication and therapy to treat ADHD. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Always discuss any treatment approaches with your doctor before starting a new regimen or stopping an existing one."
    }
  ]
}