{
  "url": "https://www.wikihow.com/Deal-With-Losing-Your-Wallet",
  "title": "Where Is My Wallet? How to Protect Your Money & Find a Misplaced Wallet",
  "steps": [
    {
      "title": "Check the places it’s most likely to be first.",
      "content": "Check the places it’s most likely to be first. Once you’re calm, search around the places you normally store your wallet. Check your pants and jacket pockets, or look inside the purses you’ve used recently. Search the surrounding areas too, like the floor under your nightstand or between the couch cushions where you were sitting earlier. [1] X Research source"
    },
    {
      "title": "Retrace your steps from where you last had your wallet.",
      "content": "Retrace your steps from where you last had your wallet. Physically move through your home or local spot if you think it’s there, or mentally imagine yourself walking or riding through the city if it’s somewhere else. Remind yourself of your thoughts and feelings during your steps to trigger your context-dependent memory. [2] X Research source Picture every detail you can to put yourself in the same frame of mind you were in when you last had your wallet. Eventually, you may remember something that makes a lightbulb go off in your head and jogs your memory of where you put it."
    },
    {
      "title": "Call or visit any places you went recently where you had your wallet.",
      "content": "Call or visit any places you went recently where you had your wallet. Check with any stores, bars, restaurants, or shops you visited where you may have used your wallet. Ask if an employee placed any lost wallets in the lost and found, or if another customer picked up the wallet and turned it in. [3] X Research source Brainstorm other places where you may have taken it out of your pocket, like if you wanted to show a friend your new license photo."
    },
    {
      "title": "Take a deep breath and try not to panic about your missing wallet.",
      "content": "Take a deep breath and try not to panic about your missing wallet. Do some deep breathing exercises to calm yourself down and refocus your mind. This tones down the chaotic “fight or flight” response our bodies and brains default to when we’re faced with a sudden, stressful situation. [4] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source When you’re panicked, you might forget important information or miss obvious clues that will help you locate your wallet."
    },
    {
      "title": "Look in less likely places where it normally wouldn’t be.",
      "content": "Look in less likely places where it normally wouldn’t be. Check high traffic areas in your home or office, like hallways or patios, or other drawers or bowls you may have absentmindedly put your wallet in by mistake. Search around doorways, bathrooms, the kitchen, or any place you may have been interrupted while using your wallet. [5] X Research source Gradually increase your search radius from the places your wallet should be. If you truly just misplaced it, it shouldn’t be far from its normal spots."
    },
    {
      "title": "Assume your wallet is stolen if you can’t find it by the end of the day.",
      "content": "Assume your wallet is stolen if you can’t find it by the end of the day. Since your identity and financial information are at stake, take action to cancel and replace your cards within 24 hours or so to prevent fraud. [6] X Research source Alert your credit and debit card issuers before someone else uses your cards to stay off the hook for any charges they make. Under federal law, you aren’t liable for any fraudulent charges made after reporting the card missing or stolen. [7] X Research source"
    },
    {
      "title": "Check for fraudulent charges online right away.",
      "content": "Check for fraudulent charges online right away. Look at your card statements on a browser, check your card's mobile app, or call your credit card company and bank to look for you. Check for charges you don’t recognize after the time you suspect your wallet got lost or was stolen. If there are charges, your wallet is likely stolen. If not, it may just be missing. [8] X Research source Contact your credit card issuer right away to report any credit card fraud you notice on your account."
    },
    {
      "title": "Tell your bank to freeze missing debit or ATM cards and checks.",
      "content": "Tell your bank to freeze missing debit or ATM cards and checks. Alert them right away so they can freeze your cards—this gives you a few days to keep searching for your wallet if you’re sure it’s just misplaced. If it turns up, have your bank unfreeze your cards. If it doesn’t, cancel your debit cards and request replacement ones. [9] X Research source If you use mobile banking, check your debit card app to see if you can freeze, unfreeze, or report missing cards without having to call the bank. Update any automatic payments you have scheduled with your new card information once it arrives to stay current on your bills. Replacement debit cards can take several business days to arrive, so use your passport as an ID to withdraw some money to see you through. Some bank branches can print a new debit card for you right away. Call ahead to see if your local branch has this feature."
    },
    {
      "title": "Report your credit cards as missing or stolen instead of canceling them.",
      "content": "Report your credit cards as missing or stolen instead of canceling them. Say your card is missing and request a new one with a new account number to keep your balance, rewards, miles, and other data the same (canceling does not preserve these). Request new cards as soon as possible by reporting them through your mobile banking app. [10] X Research source The phone numbers for the major companies are: Mastercard : 1-800-627-8372 (US) or 1-636-722-7111 (Global) Visa : 1-800-8472-911 (US) or 1-303-967-1096 (Global, call collect) Amex : 1-800-528-4800 Discover : 1-800-347-2683 Under federal law, you aren’t liable for any fraudulent charges made after you report your card missing or stolen. [11] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source If you report within 2 days of theft, you’re only liable for up to $50 of charges. Reporting 3-60 days after theft makes you liable for up to $500. Leaving the theft unreported or reporting after 60 days may leave you liable for all fraudulent charges."
    },
    {
      "title": "Call a major credit bureau to request fraud alerts on your credit line.",
      "content": "Call a major credit bureau to request fraud alerts on your credit line. If you had your social security card in your wallet, contact Experian , Equifax , or TransUnion online or by phone right away. Call any one of them to request fraud alerts—by law, any bureau must notify the other two to do the same. [12] X Research source Read the free credit report that each bureau will send you after your request. Check for any unfamiliar activity or suspicious new lines of credit. A fraud alert on your credit line warns lenders to take extra precautions to vet applications for new credit cards, mortgages, or loans in your name."
    },
    {
      "title": "Contact the DMV",
      "content": "Contact the DMV and apply for a new driver's license or ID. Call or visit the DMV office nearest to you to report your license or ID is missing or stolen (they may ask you to file a police report as well). Follow their instructions for obtaining a new license, since these vary from state to state. [13] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Try requesting a new license online (go to your state’s official website ending in “.gov”). You’ll get a temporary ID until your new one arrives in the mail. [14] X Research source Your new ID will have the same number as your old one. If you discover your old ID is being used to commit fraud, request to have the number changed. There is typically a small fee to have a license reissued or replaced. Depending on your state, you may also need to replace your vehicle registration (however, getting the new license is a bigger priority)."
    },
    {
      "title": "Request a new card from your health insurance company.",
      "content": "Request a new card from your health insurance company. Explain to a customer service representative that your card was stolen so it’s on record in case someone else tries to use it at a doctor’s office. Ask to have your account number, user ID, or group number changed on the new card, if possible."
    },
    {
      "title": "Replace your Social Security",
      "content": "Replace your Social Security card if you kept yours in your wallet. Contact the Social Security Administration and explain that your card is missing or stolen. They’ll advise you to fill out an application for a new card online or in person at an SSA office and ask you to provide proof of identification. [15] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Provide original copies of your birth certificate to verify your age and citizenship, plus your license, ID, or passport for identification. [16] X Trustworthy Source US Social Security Administration Independent U.S. government agency that administers Social Security and related information Go to source If you have your SSN memorized, you probably don’t need to have a replacement card. The new card is free, but the application process can be a pain."
    },
    {
      "title": "Change your locks at home if you kept a house key in your wallet.",
      "content": "Change your locks at home if you kept a house key in your wallet. Contact a locksmith or change the locks yourself to prevent a home robbery. If your wallet was taken or found by a criminal, they may note your address on your ID and use the key to break in. [17] X Research source It’s possible that a criminal might make a copy of your key, even if they turn in your wallet with the original key in it."
    },
    {
      "title": "File a police report",
      "content": "File a police report for a lost or stolen wallet. Call or visit a local precinct to get a report on record. That way, you have evidence of theft in case someone tries to use your information for fraud or identity theft (keep a copy of the report for your own records just in case). Include the following information in your report: [18] X Research source Where and when you think you lost your wallet Everything that was in the wallet (ID, credit cards, amount of cash) A description of the wallet Possible suspects or descriptions of suspicious people if it was stolen"
    },
    {
      "title": "Keep photocopies or pictures of your cards in case you lose your wallet.",
      "content": "Keep photocopies or pictures of your cards in case you lose your wallet. Make copies of the fronts and backs of everything in your wallet and store them in a secure space at home or in a safety deposit box. Include your Social Security card, passport, and birth certificate as well. [19] X Research source Copy the backs of your cards to have customer service numbers, CVV numbers, and credit card or account numbers on hand for identity verification. Most of the information you need, like account numbers or banking contact information, can also be found in your online or mobile banking accounts. Never carry your Social Security card in your wallet. Include only your ID or license, credit and debit cards, and health insurance card."
    },
    {
      "title": "Make a list of everything that you keep in your wallet.",
      "content": "Make a list of everything that you keep in your wallet. Include every single item—credit and debit cards, health insurance cards, gift cards, blank checks, your ID or license, and anything else you had in there. Then, use your list to prioritize which items to replace and who to contact first if your wallet goes missing. [20] X Trustworthy Source National Conference of State Legislatures Bipartisan, nongovernment organization serving the members of state legislatures and their constituents Go to source Tackle the most urgent replacements first, like credit and debit cards, your ID, or your Social Security card (if you had it in your wallet)."
    },
    {
      "title": "Keep your contact information in your wallet in case someone finds it.",
      "content": "Keep your contact information in your wallet in case someone finds it. People are more likely to return a wallet if it seems easy to do, so leave a card with your email address or phone number in it. Don’t leave your home address in case it gets stolen by a potential burglar (although your address is likely on your ID already). If you’re traveling abroad, write your contact information in a local language so the kind person that found it won’t have to translate anything to reach you."
    },
    {
      "title": "Put your wallet in the same place every time you’re home.",
      "content": "Put your wallet in the same place every time you’re home. Make a routine of placing your wallet in the same bowl, drawer, or countertop whenever you walk in the door so you don’t forget where you set it down. This way, you’ll never lose it in your own home and panic that it’s gone missing somewhere else. Think mindfully about where to leave it if you’re storing it somewhere during an activity (like if you’re putting it in a glove compartment during a hike)."
    },
    {
      "title": "Consider buying a small tracking device to keep in your wallet.",
      "content": "Consider buying a small tracking device to keep in your wallet. Purchase a Bluetooth- or RF-based tracker that allows you to locate your wallet when you misplace it. Often, there’s an accompanying app on your phone that will alert you when your wallet travels too far and pinpoint its location for easy retrieval. [21] X Research source Most wallet trackers range from $25 to $70 and are a worthy investment compared to the hassle of canceling and replacing every card you have."
    }
  ]
}