{
  "url": "https://www.wikihow.com/Enter-a-Beauty-Pageant",
  "title": "How to Enter a Beauty Pageant",
  "steps": [
    {
      "title": "Search different beauty pageants to find the ones you are eligible for.",
      "content": "Search different beauty pageants to find the ones you are eligible for. Use the online magazine www.tftj.com as a reliable resource for finding legitimate pageants for girls and women looking to participate in the teen, Miss, and Mrs. category divisions. Or, check out pageant planet for more opportunities. [1] X Research source You might be eligible to enter more than one kind of contest. For example, some married women, looking to participate in a beauty contest, can not only enter the beauty pageant aimed towards married women but may also be eligible to enter beauty pageants such as ‘beauty after 30’ and so on. Compare and contrast different pageant details to measure which options offer the most opportunity. Make sure that the pageant you are eligible for and trying to enter offers prizes and/or scholarships you deem worthy before you pay any entry fees."
    },
    {
      "title": "Beware of any prerequisite requirements.",
      "content": "Beware of any prerequisite requirements. There are some pageants that are only open to participants that have won pageants and held titles previously. There are state pageants who require you to have never participated for a previous national title. Some pageants consider contestants who have been married, had a marriage annulled, or who have ever been pregnant ineligible for competing. So make sure you are applying to pageants that align with your status."
    },
    {
      "title": "Create your pageant resume.",
      "content": "Create your pageant resume. Similarly to what a resume does for people in a workforce, pageant resumes explain to pageant judges why you should be considered for the state or national titleholder. Follow the formatting instructions for your resume to a t, making sure that it all fits on one page. Be prepared to include your platform issue, your talent, your scholastic honors, leadership roles, accomplishments, interesting facts about you, and employment on your resume. Margins should be set for 1” for all four sides of the Word document. The font has to be Times New Roman in the font size 10-12. Set the justification to “left,” type “Name:” in bold, followed by hitting the space bar twice and then typing your name as you want the judges to know it. For example, Name: Candace Young. Move to the next line and type “Title:” in bold. Hit the space bar twice and then type your state title. Repeat this action when you move to the next line and type “Hometown:” in bold as well. Depending on the pageant, you may be asked to include answers to 2-3 open-ended questions in your resume. Those questions might be, “How has the world you come from shaped your dreams and aspirations?” or “What social issue, other than your platform, will have the greatest issue on your generation and why?”"
    },
    {
      "title": "Decide on what your platform statement will be.",
      "content": "Decide on what your platform statement will be. Keep in mind that your platform statement is the cause or issue that you choose to dedicate your time and bring awareness to. An example of a platform statement is America’s need to embrace cultural diversity and inclusiveness. Another sound example of a platform statement is poverty levels and homelessness. Think of efforts you hope to align yourself through volunteering and implementing strategy to resolve. Choose an issue you see your nation is facing or one that affects lives globally that really resonates with you."
    },
    {
      "title": "Write your platform statement.",
      "content": "Write your platform statement. This one page, single-spaced document explains to the judges what your chosen platform will be and why it is important for someone vying for the title to embrace your platform. Also explain how the platform you stand by will further the brand of the overall pageant to the public. The word document should have margins set to 1” on all four of its sides and have a font style Times New Roman with a size between 10 and 12 inches. Set the justification to the left. Focus on what you think is critical that the judges know about your platform and why it’s necessary that you are the person who does the job and promotes the issue. Also consider elaborating on a plan on creating awareness of the platform, your marketing strategy, media plans, and/or the way you will change behaviors regarding the issue."
    },
    {
      "title": "Start your application.",
      "content": "Start your application. The first step to entering the beauty pageant is submitting your application (submission form, platform statement, and pageant resume), a photo (typically a headshot), and an entry fee. [2] X Research source Applications can be written or electronic. Pay special attention to the photo that you submit to pageants because it is the photo that will end up in the pageant program book and will represent you to judges as their first impressions of you. The pageant director will review the application you send over and decide whether or not to consider you as a finalist to compete in the pageant alongside the other participants. Be sure to include all of the components of your application at one time to ensure that everything is submitted by the deadline."
    },
    {
      "title": "Submit your entrance fee.",
      "content": "Submit your entrance fee. After reviewing your application and doing your phone interview with the judges, you will be contacted if you’re chosen. When you’re officially accepted to compete, your entry fee is due. Pageant fees can be as much as $1800 depending upon the state or level of beauty pageant you’re entering."
    },
    {
      "title": "Set a timeline and task list of what you have to do leading up to the pageant.",
      "content": "Set a timeline and task list of what you have to do leading up to the pageant. Once you have been approved to enter the contest and have been named a finalist, you must start preparing for the pageant. Keep it simple and don’t go overboard by spending a lot of money. Incorporate a dance class once or twice during the week and workout to tone and strengthen your body for the competition. [3] X Research source Take care of your nails by getting them cleaned and manicured regularly, especially before the pageant. Judges will notice your nails during the interview portion of the pageant so it is important that they are polished and well-kempt. [4] X Research source Consider whitening your teeth. It doesn’t have to be an extensive or expensive dentist office visit; there are plenty of over the counter options that will add sparkle and whiteness to your smile as well."
    },
    {
      "title": "Put your pageant looks together.",
      "content": "Put your pageant looks together. Choose age appropriate options, but if you find yourself stumped about where to go, err on the side of caution and go the traditional route. For example, a great evening gown color choice is white. Choose hair, makeup, and shoes that coordinate with that palette. [5] X Research source Decide on a hairstyle for the pageant. Hairstyles should be neat, polished, elegant, and away from the face. Have a trim before the competition and make sure your hair is the lustrous picture of health. [6] X Research source Practice different makeup looks and settle on one that best fits your features and your look. The goal for your makeup look should be “less is more”. Appearing too caked on will make you look false, but appearing on stage completely bare faced may make you look washed out underneath the lights. Wear a lip color bold enough to stand out and contour if you feel comfortable with it due to the bright nature of stage lighting, or a translucent setting powder to prevent shine on stage, Stay away from wearing lots of jewelry, accessories, and/or hats because it draws attention away from you instead of toward you. [7] X Research source"
    },
    {
      "title": "Take care of your health.",
      "content": "Take care of your health. A strong emphasis is placed on beauty and believe it or not, beauty is health. A daily beauty regimen, focused on diet and exercise, will increase your chances of success at any beauty event. [8] X Research source Participating in a beauty pageant is as competitive as any other sport or contest. This requires equal amount of hard work and determination to succeed."
    },
    {
      "title": "Prepare yourself mentally.",
      "content": "Prepare yourself mentally. Have confidence in yourself and your ability to give the pageant your all. Preparation is the key to feeling confident about your capabilities. [9] X Research source Practice the interview portion of the pageant with sample questions with friends and family members to get comfortable with answering questions on your feet with ease. Be creative and positive when you make your answers to put your best foot forward. [10] X Research source Read up on current events so that you are not afraid to voice your opinions on certain topics. Stand firmly behind your beliefs as you answer some controversial subject matters. Memorize your introduction so that it will become second nature to you when you introduce yourself to the judges. Most of the time, your introduction is your name, age, and hometown. Add personality by including a famous quote by someone you admire or something witty. [11] X Research source"
    },
    {
      "title": "Project your voice to speak loudly while on stage.",
      "content": "Project your voice to speak loudly while on stage. You want to be sure that you speak loudly and clearly and that the judges hear your confidence and your passion for the title you’re trying to win. Know why you want the title and how you will use it to make your community better. [12] X Research source Be prepared to answering questions about what makes you a great role model, your favorites, ambitions, and your career goals. Whenever you’re asked a question, follow it up by offering a brief explanation of why you feel the way you feel. This adds another layer to your answer and infuses it with your character and beliefs."
    },
    {
      "title": "Consider hiring a pageant coach.",
      "content": "Consider hiring a pageant coach. Hiring a coach is the quickest way to give you the upper hand in a beauty pageant. Coaches are not only well-versed in knowing the traits and qualities that judges are looking for, but they are adept at the ins and outs of pageantry. [13] X Research source"
    },
    {
      "title": "Train consistently to do the work to get better.",
      "content": "Train consistently to do the work to get better. [14] X Research source Practice is the closest way to get to perfection. Practice your talent, walking, public speaking, your modeling stance, and facial expressions. Practice smiling in the mirror to understand the look of your facial expressions."
    },
    {
      "title": "Pay attention to the details.",
      "content": "Pay attention to the details. Make sure that all of the components of your look are presentable for competition. The dress/outfit should look good and feel good while you’re wearing it. When you’re comfortable in what you’re wearing, you see it on your face and it helps maintain confidence. [15] X Research source Inspect your outfit for snags, sag, bulges, or dragging. Make sure that everything fits like a glove. Inspect your hair and makeup to make sure that there are no flyaways, strands out of place, or makeup on your teeth."
    },
    {
      "title": "Walk with confidence and elegance.",
      "content": "Walk with confidence and elegance. It is important to maintain great posture while you walk because bad posture can ruin your chances of winning a pageant. Walk with your shoulders back, take appropriately sized steps, and lightly swing your arms as you glide against the stage. Focus on looking relaxed, but not too relaxed. [16] X Research source The pageant director will provide further detail about what pattern you’re walking on, so get the foundation of a great walk and the rest will surely follow. Always smile as you walk and be aware of where the judges are stationed to make eye contact with them as you hit your marks while you walk."
    },
    {
      "title": "Excel at the production number.",
      "content": "Excel at the production number. A pageant is usually preceded by a production number, or an opening dance number. Although you are certain to have ample rehearsal time to get the routine down, if you are still feeling shaky about it, enroll in a dance class to help you improve so that you’re confident when it’s time to perform. [17] X Research source"
    },
    {
      "title": "Participate in other competitions within the pageant.",
      "content": "Participate in other competitions within the pageant. There might be a point in the pageant where you model your favorite outfit, model a casual outfit, perform a dance routine, memorize a speech, etc. These are typically optional because they don’t add or subtract from winning the actual pageant title, but they do offer different prizes. [18] X Research source"
    },
    {
      "title": "Have confidence to truly shine.",
      "content": "Have confidence to truly shine. Walking around in front of a large crowd of people agreeing to be judged for the sake of owning a coveted title can be a scary moment, but feel the fear and do it anyway. The more you participate in pageants and own the room you’re a part of, the more confident you will be because pageantry will be second nature. [19] X Research source"
    }
  ]
}