{
  "url": "https://www.wikihow.com/Discuss-Your-Lesbian-or-Bisexual-Interest-in-a-Friend",
  "title": "How to Discuss Your Lesbian or Bisexual Interest in a Friend",
  "steps": [
    {
      "title": "Make your orientation clear.",
      "content": "Make your orientation clear. If she doesn’t know that you’re bisexual or a lesbian, there’s no way she’ll be able to guess you like her. Once she knows, she’s more likely to pick up on subtle cues that you’re interested. If you’re not out of the closet to her, you can casually say something that indicates your sexuality. You could mention an ex-girlfriend or say something like, “It feels so great to be able to be out at my new job.” Sharing your orientation with her may prompt her to say something about her sexuality, but not necessarily. If you feel comfortable, you could say something like, “Do you think you could ever try being with a woman?”"
    },
    {
      "title": "Keep your crush under control.",
      "content": "Keep your crush under control. You may be dying on the inside, but try to keep a cool outside. You’re still trying to get a feel for if she’s interested or not. If you’re too overwhelmed by your feelings, you won’t be a very good observer of hers. [1] X Research source Spend time with friends or doing activities that will take your mind off your crush. Don’t put your friend on a pedestal. Focus on the things that make her human—not an idealized version of herself."
    },
    {
      "title": "Spend more time with her.",
      "content": "Spend more time with her. The better you get to know her, the more you’ll be able to read her feelings. This will also give her a chance to get to know (and like!) you better. [2] X Research source Notice if she also initiates spending time together. If you’re always the one to suggest hanging out, she might not be interested. Notice the quality of your time together. Are you always in a large group? Does she seem distracted by her phone or someone else? These could be signs that she’s not feeling romantically toward you."
    },
    {
      "title": "Look for signs of interest.",
      "content": "Look for signs of interest. People show their interest in a number of ways. Look for some classic behaviors that could indicate that she’s into you. [3] X Research source Friends aren’t usually awkward around each other. So if she’s acting shy or awkward around you, that could be a good sign. Does she text or message you just for fun? Does she remember little bits of your conversations and reference them? Does she do thoughtful little gestures for you? These are great indicators that she could have feelings for you."
    },
    {
      "title": "Ask a mutual friend.",
      "content": "Ask a mutual friend. Find someone who is trustworthy. Even if you don’t confess your crush, your mutual friend will probably get the idea. However, if you have a friend whom you know can keep a secret, ask for their advice. They might know more about your crush’s dating history or current status. You can ask your mutual friend if they know more about your crush’s sexual orientation. If you feel very comfortable, you can confess your crush and ask your mutual friend for advice. However, don’t take anyone’s advice too seriously. Always trust your own intuition."
    },
    {
      "title": "Prepare for the worst.",
      "content": "Prepare for the worst. Confessing a crush on a friend often alters the relationship. Be honest with yourself. How will you feel if your friend feels really awkward or freaked out? Is that something you’re ready to deal with? Understand that you may lose this friendship by confessing your crush. However, that can sometimes be less painful than keeping your feelings bottled up."
    },
    {
      "title": "Send some signals.",
      "content": "Send some signals. Start with subtle signals and see if you get a response. This is a great way to let your feelings show without being too vulnerable at first. If your friend notices the messages you’re sending, she’ll likely start considering that you may have a crush on her. She’ll likely be at least flattered. [4] X Research source Eye contact is a great flirting tool. When the two of you make eye contact, hold it just a second too long and then look away. This is often read as a sign of romantic interest. Initiate casual touch. It’s best to touch someone in a way that still seems friendly—not romantic. You can touch her on the arm or shoulder when you ask her how she’s doing. Or give her a hug before you part ways. If she begins to initiate touch too, that could indicate interest."
    },
    {
      "title": "Choose a place and time to confess your feelings.",
      "content": "Choose a place and time to confess your feelings. Be thoughtful when planning this. Consider that your friend might feel awkward when you tell her. She might not know how to respond. Choose a time and place where you can be alone and have time to fully discuss both of your feelings without distractions. [5] X Research source Invite her to go for a walk. Choose a place that you can both feel comfortable and enjoy. Invite her over to your house—as long as it’s easy enough for her to leave, should the conversation become uncomfortable."
    },
    {
      "title": "Be up front.",
      "content": "Be up front. Don’t dance around your feelings, but stay collected. She doesn’t need to know how many times you’ve looked at her Instagram, or how long you’ve been pining for her. Simply let her know that you’re interested. [6] X Research source Rather than telling her exactly how you feel, you could simply ask her out on a date. Be clear that it’s a date, though. If you usually say, “let’s hang out next week,” be more explicit. Say, “I’d really like to take you on a date. Would you be open to that?” Let her know that you don’t need her to feel the same way. You can say, “So, I actually have a crush on you. I’m not sure if you could tell. But I wanted to let you know. And I totally understand that you might not feel the same way.” Give her the space to think about it on her own. You can say something like, “I know this might surprise you, but I’ve had feelings for you for a while. And I felt like I needed to say something. But please don’t feel like you need to say something right away.” Reader Poll: We asked 715 wikiHow readers who've told their friend they have a crush on them, and 55% of them agreed that their goal for doing so is to see if there’s a chance for a romantic relationship. [Take Poll] Don’t be afraid to tell her how you feel—it could work out in your favor!"
    },
    {
      "title": "Allow her to respond genuinely.",
      "content": "Allow her to respond genuinely. She might be surprised and need some time to think about it. Or she might have questions for you. If she wants to talk, be honest and keep communication flowing. [7] X Research source If she expresses interest in you, that's great! Let her know that you're happy to hear that she feels the same way. If she returns your feelings, you may want to initiate a more romantic form of touch, such as holding hands. You can also let her know that you're happy to take things slowly. If her response is hurtful to you, let her know. There are ways she can let you know she’s not interested without being cruel or insensitive. Be graceful when she responds. Let her know that you understand her position, even if it’s hard for you."
    },
    {
      "title": "Define where things stand.",
      "content": "Define where things stand. If she returns your feelings, you'll likely be making steps toward romance. If she doesn't, make sure you're both invested in remaining friends. Either way, communicate about where you'd like things to go from here. If you're going to become romantic, you could say something like, \"If things don't work out, I hope we can still remain friends afterward.\" If she doesn't return your feelings, it's okay if you need to take a break from the friendship while you get over her."
    },
    {
      "title": "Tell her the friendship is important to you.",
      "content": "Tell her the friendship is important to you. When a friend confesses a crush, we often assume they only like us because they’re interested in us sexually. Assure her that you value her as a friend and a person. You can say, “I understand that you’re not interested in me romantically, but I really hope we can keep this friendship intact. I really value having you as a friend.”"
    },
    {
      "title": "Take responsibility for the situation.",
      "content": "Take responsibility for the situation. Acknowledge that your feelings have clearly changed things between you. Let her know that you want to do what’s necessary to get the friendship back on track. You can say, “I understand that telling you my feelings may have made things awkward between us; but it was important for me to do. Now that I know how you feel, I really want to do what I can to get our friendship back to how it was."
    },
    {
      "title": "Take whatever time you need.",
      "content": "Take whatever time you need. If your crush was pretty intense, you might need to take some time away from your friend. You won’t be able to stay friends with her unless you’re really over her. Be honest with her if you need some time. You can tell her that you respect her feelings, but you need some time for yours to heal. Let her know if you’d prefer for her to not contact you. You can simply say, “I think I need some time to get over you. Would you mind letting me do the reaching out for a while? I’m not sure if I’m ready to keep hanging out yet.”"
    },
    {
      "title": "Don't take it personally if she's not interested.",
      "content": "Don't take it personally if she's not interested. Most likely, your friend simply isn’t interested in women, even if she thinks you’re an awesome friend. Don’t take the rejection personally. Spend time with other friends whom you feel good around. This can help boost feelings of self love. Say positive affirmations to yourself. Tell yourself that you're a great person, and that you've got a lot to offer."
    },
    {
      "title": "Move on.",
      "content": "Move on. There are plenty more fish in the sea. The longer you dwell on this one case of rejection, the longer your heartache will be. If there’s someone else who strikes your fancy, shift your energy towards them. Experiment with online dating. You’re likely to meet other people who share your sexual orientation, and who are outside of your social circle. If you’re not ready for dating, spend time with family or friends."
    },
    {
      "title": "Make efforts toward friendship when you’re ready.",
      "content": "Make efforts toward friendship when you’re ready. Eventually, you’ll be over your crush. You’ll likely want to reach out. Let her know that you’re excited to see her again. Ask her if she’d like to get together as friends. Try not to hold out hope that she'll have changed her mind. When you do see each other, avoid anything that could be read as flirting. Maintain good boundaries."
    }
  ]
}