{
  "url": "https://www.wikihow.com/Cope-With-a-Condescending-Spouse",
  "title": "How to Cope With a Condescending Spouse",
  "steps": [
    {
      "title": "Determine the best time to approach your spouse.",
      "content": "Determine the best time to approach your spouse. During the heat of the moment may not be the best time to have the conversation, since tempers are charged and either of you might say something regrettable. [1] X Research source Meet soon after the condescending action occurs. If you allow too much time to pass, the incident will be forgotten and the details will become blurry. Try to sit down with your spouse within a few days of the incident in order to address it while it is still fresh. Find a calm setting where you two can be alone. Presenting your case in front of friends will make you look wounded and your spouse like a jerk. Talk with your spouse after they've had time to relax and unwind from work. Wait until the kids are in bed and after you’ve both had a chance to unwind."
    },
    {
      "title": "Present your case with a non-threatening tone.",
      "content": "Present your case with a non-threatening tone. Don’t take the blame for your spouse's behavior, but try to communicate how you feel in a non-threatening way. [2] X Expert Source Michelle Shahbazyan, MS, MA Life Coach, Author, and Speaker Expert Interview. 18 March 2020. Say that you feel sad/upset/hurt when your spouse is condescending towards you. For example, you might say something like, \"I feel sad when you talk to me in that tone of voice.\" Or, \"I feel angry when you undermine my intelligence.\" Avoid saying that your spouse makes you feel a certain way because this phrasing may put your spouse on the defensive."
    },
    {
      "title": "Use examples to illustrate your point.",
      "content": "Use examples to illustrate your point. It may be helpful to provide specific examples when you talk to your spouse about their behavior. Choose a recent instance and be specific about what was said and done. For example, you might say, \"Last night during dinner you made a remark that was pretty condescending. You said that it would be a waste of time to try to explain your new project to me because I wouldn't be able to understand.\" Avoid choosing an example where you and/or your spouse were intoxicated, as the details may not be as clear."
    },
    {
      "title": "Ask your spouse why they are being condescending.",
      "content": "Ask your spouse why they are being condescending. Your spouse might respond to you in condescending ways due to insecurity or a sense of inadequacy. [3] X Research source Learning the motivation for your spouse's bad behavior can make it easier for you to empathize with your spouse and get your spouse to start behaving in a more respectful manner. Try asking your spouse to tell you what is really going on by saying something like, \"I feel like you might be upset about something other than me. What is going on?\" For example, if your spouse becomes angry and talks down to you when you ask about their work, your spouse may be feeling insecure about their ability to perform well. Although your spouse's behavior is still inappropriate, knowing what is really going on behind the condescension may help you figure out a better way of living together."
    },
    {
      "title": "Set consequences.",
      "content": "Set consequences. Make it clear that condescending behavior is not acceptable and that you will not tolerate it. Stand your ground and do not change your mind if your spouse further belittles you or tries to make light of the situation. [4] X Expert Source Michelle Shahbazyan, MS, MA Life Coach, Author, and Speaker Expert Interview. 18 March 2020. One example of a consequence you could set is to say something like \"if you speak to me in that tone, I will leave the room. If you continue putting me down in front of others, I will take steps to end our relationship.\""
    },
    {
      "title": "Use humor to shrug it off.",
      "content": "Use humor to shrug it off. Don't let your spouse's condescension get to you. Next time your spouse is condescending, think about what is funny about the situation. Make a joke or laugh it off by pretending to think that your spouse must be joking. By using humor, your spouse loses some of the power they are trying to wield through being condescending. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source The exact humor that you use is highly context specific but it may be best to avoid self-deprecating humor since they are already being condescending and putting you down."
    },
    {
      "title": "Turn the spotlight around.",
      "content": "Turn the spotlight around. One way to stop condescending remarks in their tracks is to turn the spotlight onto the person making the comments. [6] X Research source To do this, ask questions that are relevant to the context. For example, if your spouse is being condescending about your parenting skills, you might ask \"how would you do it better?\" or \"what is the evidence for doing it the way you would like to?\""
    },
    {
      "title": "Assess when the condescension began.",
      "content": "Assess when the condescension began. Think back as to whether your spouse has recently become condescending or whether this has been going on during your entire relationship. You can do this by asking yourself some questions: Did you originally marry someone who came into the relationship with a condescending attitude, or did it develop later in the marriage? Determining if this is a new behavior or an attitude that they already held can help you figure out how best to handle his inappropriate behavior. Did your spouse completely change after marriage? Is it possible that you didn’t see your spouse for the person they really are or were they putting on a game face before marriage to seal the deal? Could a new job be influencing your spouse's behavior? From on-the-job stress to feeling heady about being promoted to a lofty position, job influences can have a powerful impact on even the most unflappable personality. While this information can help you figure out more about why your partner is being condescending, when you confront your spouse, be sure to keep the conversation focused and on the present. [7] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source"
    },
    {
      "title": "Determine whether the behavior is context specific.",
      "content": "Determine whether the behavior is context specific. You can get a sense of whether the condescension is motivated by something you may have done by looking at when the condescending remarks are likely to occur. Do they only occur in certain contexts, such as in parenting discussions? Or, are they more widespread? Nailing down a specific time and circumstance will help you determine if your spouse has a trigger behavior or context. However, keep in mind that sometimes people don't know their own motivations for their behaviors, so don't get stuck on this step if it is not helpful for you personally. If your spouse is condescending to you in the context of being around their work colleagues, does the behavior occur in front of the boss, equals or subordinates (or everyone at work)? What kinds of comments are delivered? Does your spouse talk down to you when you try to weigh in on what’s happening at work? One possibility is that your spouse feels intimidated or even embarrassed by your job and covers up their true feelings with catty, rude remarks. If this is the case, you can focus on addressing the condescending behavior within this specific context. Do you find that you are always keeping your guard up when you and your spouse are around your family and friends? Or do you feel that you are constantly being “put in your place” by your spouse when around their family and friends?"
    },
    {
      "title": "Examine if your spouse is aware of their behavior.",
      "content": "Examine if your spouse is aware of their behavior. In some cases, your spouse has been chronically condescending to the point where the behavior is part of their personality. That said, people aren't always aware of their own behaviors. Your spouse may not know that that they are behaving inappropriately. Also, if your spouse is overcompensating due to an insecurity, they may be so determined to muster confidence that they may not realize their behavior is offensive. [8] X Research source Does your spouse continue talking with you after a condescending remark, acting as though nothing happened? If this is the case, they may not be aware that the remarks are rude and inappropriate. Does your spouse seem to speak to everyone around them in the same manner or are you the only target? A sarcastic person may believe that condescension is just part of “their charm.” They may not realize that instead of being funny, the comments are mean-spirited and hurtful."
    },
    {
      "title": "Watch for signs of psychological abuse.",
      "content": "Watch for signs of psychological abuse. Abuse can take many forms and it is not always easy to spot an abusive person. Some subtle signs of emotional or psychological abuse include: [9] X Research source saying things to make you feel guilty humiliating you on purpose being extra critical of you ignoring you having affairs or flirting with the opposite sex in obvious ways talking to you in a sarcastic voice or making fun of you saying “I love you, but…” trying to control you using isolation, money, or threats constantly texting or calling you when you are not around"
    },
    {
      "title": "Protect your children.",
      "content": "Protect your children. If your spouse is also emotionally abusive and condescending to your children, you should take extra steps to protect them during this fragile stage of development. To do this, you can: [10] X Research source Be extra kind to your children to make up for the abuse that they suffer. Tell them how much you love them and treat them especially well. Explain to them that when people get angry, they say things that they don't really mean. Make it clear that what people say about them, even a parent, isn't necessarily true. What matters is how they feel about themselves. Alert social services to ask for help if the emotional abuse is severe or persistent. Tell your spouse that emotionally abusing the children is not appropriate and that if it doesn't stop you will take steps to end the relationship and get custody of your children. [11] X Expert Source Michelle Shahbazyan, MS, MA Life Coach, Author, and Speaker Expert Interview. 18 March 2020."
    },
    {
      "title": "Talk to your friends and family.",
      "content": "Talk to your friends and family. Friends and family can offer excellent support and advice during a relationship crisis. Try talking to your friends and family about what has been going on. Ask for suggestions about what to do next or where to get help. You may even be able to stay with a friend or family member until you can figure things out and find a place of your own. This may be the best thing for you to do. If you have children, then getting them away from an abusive spouse will benefit them as well."
    },
    {
      "title": "Seek counseling.",
      "content": "Seek counseling. Tell your spouse you want you both to go to couple's therapy. Couples therapy can be effective at helping you both to change your dysfunctional relationship dynamic. [12] X Research source This can be an effective way for you to, in a safe space, make it clear that condescending behavior is inappropriate and that it needs to change. To get your spouse to see how important this counseling is to you, consider saying that if they are unwilling to try this, then you will take steps to end the relationship. To find a qualified mental health professional in your area, try this site: http://locator.apa.org/"
    },
    {
      "title": "Speak to a counselor on your own.",
      "content": "Speak to a counselor on your own. Counseling can help you to become more assertive and to determine whether or not you want to stay in the relationship or move on. If your partner won't do couples counseling with you, then you should still speak to a counselor on your own. Try to find a counselor who has experience dealing with situations similar to yours."
    }
  ]
}