{
  "url": "https://www.wikihow.com/Get-Rid-of-Jowls",
  "title": "How to Get Rid of Jowls",
  "steps": [
    {
      "title": "Make a fake smile.",
      "content": "Make a fake smile. This exercise involves making a fake smile and then jutting your jaw forward so that you can touch the center of your lips together. You should try to use the muscles in the back of your jaw to push your jaw forward. Your lips should only touch in the center. On your last repetition, do the exercise, and hold the position for 20 seconds before releasing. [1] X Research source When doing these exercises to get rid of jowls, do your best to focus all of your attention on the muscles around your mouth and around your jaw. You can place each index finger on each side of your mouth to help yourself isolate the muscles in your jaw."
    },
    {
      "title": "Make a squished smile.",
      "content": "Make a squished smile. Another way to work on the muscles around the jaw line involves making a close-lipped smile and then pushing the jaw forward to contract the muscles underneath the lips and along the jaw line. [2] X Research source You can be sure you’re doing this correctly by gently placing 2 or 3 fingers from each hand on either side of your mouth, just underneath and to the sides of your lips. With this exercise, it is a good idea to look in the mirror while you do it. This is because you want to try and keep the rest of your muscles in your face as relaxed as possible while you do the exercise. As with the first exercise, when you are on your final repetition, you should hold the exercise for 20 seconds."
    },
    {
      "title": "Change up the exercises.",
      "content": "Change up the exercises. When you are just starting out, you can pick one exercise to focus on for 2 or 3 weeks, and then switch to a different exercise. This will help target the muscles differently in order to help you get rid of your jowls. You can start with just doing 15 repetitions of each exercise once per day, and move up to doing more repetitions as you feel yourself progressing."
    },
    {
      "title": "Don't look for scientific evidence supporting facial exercises.",
      "content": "Don't look for scientific evidence supporting facial exercises. At present, there are little to no scientific studies examining the effectiveness of facial exercise as a means of reducing saggy skin. However, just because these studies don’t exist does not mean it won’t be useful for you. [3] X Research source It may work, but it will likely take time and dedication to doing the exercises consistently. Don’t expect an overnight fix with this method."
    },
    {
      "title": "Understand what it is.",
      "content": "Understand what it is. Radiofrequency treatment is a non-surgical method for tightening the skin. It is best for people who have mild or moderate sagging of the skin, and may not be as effective if you have deep lines and lots of sagging. [4] X Research source This method of treatment works well on people of all skin colors and tones. Generally, this method is suitable for people between the ages of 40-50. After the age of 60, you may experience some results with this method, but you may not get the results that you would get from a surgical procedure, such as a facelift."
    },
    {
      "title": "Learn about the costs.",
      "content": "Learn about the costs. In most cases, this is not a procedure that will be covered by insurance. Ask your treatment professional about installment plans if you cannot afford to pay the full amount all at once. Prices will vary based on the specific radiofrequency machine used. Some of the newer radiofrequency machines need only one session to achieve great results, but these prices will be much higher. [5] X Research source Businesses using an older machine are still effective, and may cost less; however, you will need to go for several sessions to get the results you hope for. Regardless of the machine used, this method does not pose a permanent solution to the problem. You will have to go for follow-up sessions every 3 to 6 months to maintain your tightened skin."
    },
    {
      "title": "Prepare for the procedure.",
      "content": "Prepare for the procedure. Before you undergo the procedure, you will want to avoid irritating your skin as much as possible. For example, you will especially want to avoid getting a sunburn as this will make the procedure more painful than it needs to be. In some cases, your skin care professional may ask you to reschedule your treatment if you have a sunburn or otherwise irritated skin on your face. [6] X Research source You may experience a bit of redness after the treatment is complete, but this is normal. Generally, you should be able to resume your normal activities right away. Some professionals may recommend soothing gels or creams that you will apply to your skin. If you do experience discomfort after the procedure, you can apply a cold compress to the skin or mist your skin with cool water to help soothe it."
    },
    {
      "title": "Understand the risks.",
      "content": "Understand the risks. When receiving the treatment from a trained professional, this method is quite safe. However, it can be somewhat uncomfortable for some people because heat is being applied directly to the skin. [7] X Research source If you are worried about the pain, be sure to ask about any pain medication you can take, or whether or not they will apply a cream to your skin that will help numb the skin some. Some people experience swelling, bumps, and/or blisters around the treatment area. If you experience these symptoms, it may be a good idea to give your practitioner a call, but it is generally nothing to worry about. The most serious potential complication can occur if the professional applying the treatment heats an area of the skin too much. This can cause what is called a “depression,” which is a sunken area of the skin. Be sure to look into your treatment professional’s credentials before undergoing this treatment."
    },
    {
      "title": "Understand the cost.",
      "content": "Understand the cost. As of 2014, the average cost of a neck lift in the United States was around $4,300. However, the price can vary significantly. While this procedure is expensive, this is because it is a surgery that should be done by a board certified plastic surgeon. [8] X Research source Unless you can demonstrate to your insurance company that you need a neck lift for a medical reason, it likely will not be covered."
    },
    {
      "title": "Learn about the surgery.",
      "content": "Learn about the surgery. A neck lift is not a minor surgery. You will be sedated, and the surgery will generally last two to three hours. Excess skin will be removed around the jaw area, and the surgeon may also alter the muscles to give you the appearance you want. [9] X Research source If you have medical issues such as diabetes, alcoholism, heart disease, high blood pressure, or depression, you may not be a good candidate for cosmetic surgery. Additionally, smokers are sometimes not good candidates for cosmetic surgery."
    },
    {
      "title": "Prepare for surgery.",
      "content": "Prepare for surgery. As this is a major surgery, you will need to undergo a thorough medical examination. You may have to stop taking certain medications, and if you smoke, you will need to quit . Your doctor will advise you on the risks to be aware of, as well as how to take care of yourself during recovery time. [10] X Research source Before the surgery, you should avoid taking aspirin or other anti-inflammatory drugs because they can cause excess bleeding. Be sure to arrange transportation home from the surgery. As you will undergo general anesthesia, it will not be a good idea to try and drive yourself."
    },
    {
      "title": "Be aware of the recovery time.",
      "content": "Be aware of the recovery time. As this is an invasive surgery, you will need time to recover. You will likely be asked to refrain from exercising for at least three weeks. During recovery, you may experience discomfort around your jaw. For example, you might experience swelling and bruising, a pulling sensation, tingling, or even burning. [11] X Research source As with all surgeries, infection is a risk. As you are recovering, keep an eye on your temperature. If you develop a fever, contact your doctor right away."
    },
    {
      "title": "Use makeup.",
      "content": "Use makeup. Makeup applied correctly can be a good way to camouflage jowls. You can do this by applying foundation as you normally would. Apply highlighter to your jowls using a concealer brush, which will make them less obvious. [12] X Research source Apply a lightweight concealer on top of the highlighting powder to remove some of the shimmer. Finish by applying the rest of your makeup as usual, and finish the look with a setting powder to keep it in place. If you want to, you can look for a foundation that is formulated to plump and hydrate, which will help lines look less obvious."
    },
    {
      "title": "Grow a beard.",
      "content": "Grow a beard. If you are a man, you can easily hide jowls by growing a beard . Beards are very trendy these days, so no one will find it strange if you decide to grow a big beard. If you do grow a beard, be sure to maintain it well to keep it looking neat and fresh."
    },
    {
      "title": "Wear clothing that will hide jowls.",
      "content": "Wear clothing that will hide jowls. Wearing a turtleneck or a scarf is one way that you could hide your jowls if you feel self-conscious about them. In summer, look for light, flowing scarves so you don’t get too hot. In winter, you can try warm turtlenecks and fluffier scarves if you live somewhere cold."
    }
  ]
}