{
  "url": "https://www.wikihow.com/Escape-from-Being-Tied-Up",
  "title": "How to Escape from Being Tied Up",
  "steps": [
    {
      "title": "Position yourself to avoid being tied tightly.",
      "content": "Position yourself to avoid being tied tightly. The more loosely you’re bound, the easier it will be for you to escape. Resist letting your captors tie you as tightly as possible. For example, if your wrists are being tied in front of you, hold your knuckles from both hands together, and pull your hands in towards your chest. Although it looks like you’re cooperating, this gesture will create a gap between your wrists. [1] X Research source Alternatively, you can present your hands to be tied with both hands in front of you, crossed at the wrist. Rotate your lower wrist about 45 degrees while you’re being tied, so that, once the ropes are tight, you can straighten out your wrist and loosen the rope. [2] X Research source Make a lot of noise. Most people deep down do not want to inflict more discomfort or suffering than necessary. Cry out in pain--even if you are not. Complain. Let the tears flow. Talk to them and try to manipulate them. Make it mentally more difficult to tighten those bonds tighter. Make the task difficult. Most people are not experts in rope tying, knots, and techniques. Usually the average person without formal training (such as a person proficient in working with cattle) does not do an adequate job. If you are thrashing around, resisting, and generally being a physical challenge the task is all that much more difficult."
    },
    {
      "title": "Tense all of your muscles while you are being tied up.",
      "content": "Tense all of your muscles while you are being tied up. If more than just your wrists or ankles are being bound, this will help you escape. When your muscles are tensed, they expand and take up more room than when they’re relaxed. This will make your body larger, while your captors are tying you tightly. Consequently, when you relax your muscles, your body will shrink slightly and the ropes will be looser, giving your more room to move and eventually escape. This is a technique used by most escape artists and allows the ropes to be slightly looser when you relax you muscles. If captors are tying a rope around your chest, take a deep breath and expand your lungs as much as possible. [3] X Research source If you can make a loose spot big enough to do so, slip out of it."
    },
    {
      "title": "Wriggle out of the ropes around your hands.",
      "content": "Wriggle out of the ropes around your hands. Once your captors have turned their backs or left the room you’re in, rotate your wrists back and forth to loosen them. You can also use your teeth to pull on one strand of the rope to make it looser. [4] X Research source As the ropes continue to loosen, you may be able to wriggle out of them. If your hands are tied to your torso or sides, wriggle your hands until they’re at a narrower part of your body (such as directly in front of you). The ropes will be looser here, and you’ll be able to slip out. [5] X Research source If your arms are pinned to your stomach, chest or torso, bend one arm upwards and try lifting the bonds. If the rope is at all lose, you may be able to slip it off over your head."
    },
    {
      "title": "Try to cut the ropes around your wrists.",
      "content": "Try to cut the ropes around your wrists. You need your hands to untie any other ropes, so always begin by freeing your hands. Ropes (and also phone and electrical cords) can be cut through with friction, so you’ll need to find a hard object to rub the binding ropes against. [6] X Research source Look for surfaces like an exposed corner of a cement wall, a table edge, or a granite countertop. If you’re alone in a room, look around for a sharp object, such as a knife, scissor blade, etc. If you use one of these objects to cut the rope while your hands are tied, take care not to cut or injure yourself. If you have a key or small knife in your pocket, try to get it out without anyone noticing. If you can cut the ropes quickly, you’ll be well on your way to escaping."
    },
    {
      "title": "Kick off your shoes before you free your feet and legs.",
      "content": "Kick off your shoes before you free your feet and legs. If your hands are impossible to free, you may need to free your feet first. Kick off your shoes, as it will be easier to slip the ropes if you are just wearing socks. Then, see if the rope is loose enough to wriggle out of—if it’s not, bend over and try untying the knot with your teeth. Once your feet are free, use your tied hands to pull the leg bonds down until they have gone off over your feet."
    },
    {
      "title": "Plan your moment of escape carefully.",
      "content": "Plan your moment of escape carefully. Don’t plan to run out the door as soon as you’re free; you’ll need to make a tactical exit. You should bide your time and pick the best possible moment to escape. When your captors have turned their backs or left the room, make your break. [7] X Research source Get far away as quickly as you can. If you expect to be pursued by your captors, try to blend in or hide in your environment, and arm yourself (for example, with a piece of rebar) if needed. Also, you can gather information about your captors that could help the police track them down. Pay attention to their looks and physical appearance, any tattoos and scars, and the sound of their voices."
    },
    {
      "title": "Break the locking mechanism on the zip ties.",
      "content": "Break the locking mechanism on the zip ties. This is the weakest point on the zip tie, and will be the easiest to break. To break the ties, form your hands into fists with the knuckles pressed together Raise your bound hands above your head, then bring them down sharply. At the same time, pull your elbows apart and press your wrists hard into your abdomen. [8] X Research source This should exert enough pressure to snap the lock mechanism on the zip ties. If your hands are bound in front of you, tighten the zip tie as much as possible, as it will be more fragile when fully taut. A looser zip tie will be harder to break free from."
    },
    {
      "title": "Cut through the zip ties with friction.",
      "content": "Cut through the zip ties with friction. If you can maneuver yourself to a hard surface, rub the band of the zip ties over the surface repeatedly to build up friction and, eventually, cut through the zip ties. [9] X Research source Paracord or Kevlar string are heat resistant and can be used to create enough friction to cut through zip ties or rope. If you’re concerned you may be tied up, or traveling in a dangerous area, consider replacing your shoelaces with paracord or Kevlar string. [10] X Research source To escape, tie your shoelaces from both feet together, with the knot between your bound wrists. Then use a “bicycle” motion to create friction and cut your zip ties off."
    },
    {
      "title": "Slip out from the zip ties.",
      "content": "Slip out from the zip ties. When you’re being tied, clench your fists tightly to expand the muscles in your wrists. This will make your wrists larger, and make your bonds looser once you’ve relaxed your hands. [11] X Research source If you do this correctly, you should be able to wriggle your hands out of the zip ties, without injuring yourself. If you’ve been tied tightly, rotate your hands and move your wrists back and forth against each other. This may loosen the plastic zip cords, and create enough room for you to slip your hands free. [12] X Research source This may take time, so make sure your captors don’t observe you trying to escape."
    },
    {
      "title": "Break the tape in front of you.",
      "content": "Break the tape in front of you. Although duct tape is incredibly adhesive, it is still vulnerable to tears and breaks. If your hands are bound in front of you, raise them above your head, and then bring them down quickly against your abdomen, pulling your elbows apart at the same time. [13] X Research source Unlike zip ties, breaking duct tape in this method is unlikely to cut your wrists."
    },
    {
      "title": "Chew through the duct tape.",
      "content": "Chew through the duct tape. Since duct tape is not quite as sturdy as rope, it can be bent and torn more easily. Use this to your advantage. You may be able to chew through it, or use your teeth to tear the tape, and then pry the tape apart. [14] X Research source If you can’t break the tape with your teeth, try to peel it away from your skin with your teeth or mouth. This will give your more space to wriggle out of the tape."
    },
    {
      "title": "Get the duct tape wet in order to loosen it.",
      "content": "Get the duct tape wet in order to loosen it. Like any other type of tape, duct tape loses nearly all of its adhesive quality when it is wet. If you are near water bottles or a natural water source (even if there’s water on the floor or in a sink of the room where you’re tied), get to the water and moisten the tape. [15] X Research source After a period of time, the tape will loosen and you’ll be able to pull your hands or feet out. If you can lick or spit on the duct tape, even saliva from your mouth will help loosen the adhesion."
    }
  ]
}