{
  "url": "https://www.wikihow.com/Delete-All-Images-in-Excel",
  "title": "How to Quickly Delete All Images in Excel in 3 Steps",
  "steps": [
    {
      "title": "Open your workbook in Excel.",
      "content": "Open your workbook in Excel. You can open Excel then click File > Open to open your workbook or you can right-click the file in your file manager and select Open with > Excel . [1] X Research source"
    },
    {
      "title": "Navigate to the worksheet that has the images you want to remove.",
      "content": "Navigate to the worksheet that has the images you want to remove. The sheets are separated by tabs at the bottom of your screen. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It's at the top of your screen in the editing ribbon. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Find & Select.",
      "content": "Click Find & Select . You'll find this in the \"Editing\" grouping. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Go To Special.",
      "content": "Click Go To Special . It's near the middle of the menu that dropped down from \"Find & Select.\" [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click to fill in the circle next to Objects and click OK.",
      "content": "Click to fill in the circle next to Objects and click OK . This will prompt Excel to locate and select all the objects in your current worksheet. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Not only will Excel select all the images in your sheet, but it will also select any objects in the sheet including charts, shapes, screenshots, icons, 3D models, and SmartArt. If there are objects you don't want to select, click them to unselect them."
    },
    {
      "title": "Press Delete on your keyboard.",
      "content": "Press Delete on your keyboard. Pressing this will instantly delete and remove all the selected objects from your Excel sheet."
    }
  ]
}