{
  "url": "https://www.wikihow.com/Get-Back-to-Blonde-from-Dyed-Brown-Hair",
  "title": "How to Get Back to Blonde from Dyed Brown Hair",
  "steps": [
    {
      "title": "Wash your hair with a clarifying shampoo to remove buildup.",
      "content": "Wash your hair with a clarifying shampoo to remove buildup. Get your hair wet and lather the shampoo into your roots, then carry it down to the ends of your hair. Rinse it out thoroughly with lukewarm water to get rid of any product buildup or grease. Clarifying shampoo will also help to open up your hair cuticle to get it ready for the color remover. [1] X Research source You can find clarifying shampoo at most beauty supply stores. Make sure it says “clarifying” on the bottle somewhere. Clarifying shampoo can make your hair feel a little dry, but don’t use conditioner just yet! Wait until you’re done with the color removing process."
    },
    {
      "title": "Dry your hair with a hair dryer and brush it out.",
      "content": "Dry your hair with a hair dryer and brush it out. Use a towel to get the excess water out of your hair, then brush it out. Use a hair dryer to dry your hair completely, making sure it’s knot and tangle-free as you go. [2] X Research source Color remover works much better on dry hair, which is why you need to dry it fully after you wash it. If you want to give your hair a little break from the heat, you can let it air dry instead."
    },
    {
      "title": "Split your hair into 4 even sections.",
      "content": "Split your hair into 4 even sections. Separate your hair into 4 sections: 1 on either side of your face, and 2 in the back of your head. This will help you work on your hair in chunks so you can really saturate it well. Use hair clips or hair ties to keep the sections separated so you can work on them one at a time. [3] X Research source If your hair is shorter than shoulder-length, you don’t need to worry about sectioning it. If you have really long or really thick hair, do 6 sections instead."
    },
    {
      "title": "Paint color remover onto one section of your hair.",
      "content": "Paint color remover onto one section of your hair. Grab a bottle of color remover and squirt some out into a plastic bowl. Use a hair color brush to paint it onto one section of your hair from the ends to the roots, making sure all of your hair gets fully saturated. This may take a while, but it will be worth it! [4] X Research source If you have short hair, put on gloves and scoop the color remover directly onto your hair."
    },
    {
      "title": "Keep going section by section until all of your hair is covered.",
      "content": "Keep going section by section until all of your hair is covered. Keep using your hair coloring brush to cover all of your hair from the ends to the roots, saturating every strand. Double check the back of your head with a mirror to make sure you didn’t miss any spots before moving on. [5] X Research source Color remover works to shrink the artificial color molecules in your hair, making them easier to wash out. It won’t affect your natural hair color, which is why you can put it all over your head, even onto spots that aren’t dyed."
    },
    {
      "title": "Cover your hair with a shower cap or a plastic bag.",
      "content": "Cover your hair with a shower cap or a plastic bag. Tuck all of your hair onto the top of your head and put on a plastic shower cap or a plastic bag. This will help trap in the heat from your scalp and make the color remover work faster. [6] X Research source If you have a hooded dryer, like the ones at a salon, you can sit under that to help the color remover process faster."
    },
    {
      "title": "Rinse the color remover out with lukewarm water after 20 minutes.",
      "content": "Rinse the color remover out with lukewarm water after 20 minutes. Head over to the sink and rinse out the product completely, making sure you get it out of your hair all the way. You may notice that your hair has lightened just a little bit, and it may look orange or yellow at first. That’s okay! You can fix it in the next few steps. [7] X Research source As the lightening process goes on, you’ll be able to counteract any orange shades in your hair. Although color remover can shrink the brown color molecules in your hair, it may not be enough to completely remove the dye. That’s why you need to do both color remover and bleach."
    },
    {
      "title": "Mix bleach with 20 volume developer for the darker spots.",
      "content": "Mix bleach with 20 volume developer for the darker spots. In a plastic bowl, scoop out 1 part bleach and 2 parts of 20 volume developer. Mix it together with the back of a hair color brush until the bleach is creamy without any lumps. [8] X Research source The higher volume developer will counteract the darker spots of your hair, and it will work on any natural growth you have. You can find bleach and developer at most beauty supply stores. If all of your hair is previously dyed, meaning you don’t have any root grow out, stick with a 10 volume developer for your whole head to avoid any unnecessary damage. You'll have to use bleach to change your hair color, as you cannot lift your current hair shade with a different, lighter hair dye. You'll only damage your hair if you do this. [9] X Expert Source Charlie Adams Professional Hair Stylist & Board Certified Haircolorist Expert Interview. 21 July 2021."
    },
    {
      "title": "Mix bleach with 10 volume developer for the lighter spots.",
      "content": "Mix bleach with 10 volume developer for the lighter spots. In a separate plastic bowl, scoop out 1 part of bleach and 2 parts of 10 volume developer. Stir the two together with the back of a hair color brush until they’re smooth and creamy. [10] X Research source This lower developer mixture will be less harsh on the hair that was previously dyed, so it won’t be as damaging. You may want to label each bowl so you don’t get them confused when it’s time to use them."
    },
    {
      "title": "Separate your hair into 4 even sections.",
      "content": "Separate your hair into 4 even sections. Brush through your hair again and make sure it’s dry and clean without any tangles. Section it into 4 vertical sections, 1 on either side of your face and 2 in the back, and keep them separated with clips or hair ties. [11] X Research source If you have super short hair, you don’t need to section it out before you start."
    },
    {
      "title": "Pick out a thin piece of 1 section and place a foil underneath it.",
      "content": "Pick out a thin piece of 1 section and place a foil underneath it. Unclip one section and start from the very bottom of your hair. Using the back of your hair color brush, pick out a section of hair that’s about 1 cm (0.39 in) thick, then use a clip to pin up the rest of the section. Place a strip of aluminum foil underneath the small section of hair you just picked out. [12] X Research source Taking small sections of hair will take a super long time, but it will ensure that your hair gets fully saturated in bleach for an even color."
    },
    {
      "title": "Paint the lower developer onto the ends of your hair.",
      "content": "Paint the lower developer onto the ends of your hair. Put on gloves to protect your hands and scoop out the bleach mixed with 10 volume developer with a hair color brush. Paint it onto the ends of your hair where it’s lighter and more damaged, being sure to saturated all of the strands completely. [13] X Research source Sometimes, the ends of your hair are actually darker than the middle or the top. If that’s true for you, you can use a higher developer on the ends and a lower developer on any spots that are lighter. Putting the lower developer on first will give it more time to process and lighten your hair."
    },
    {
      "title": "Use the higher developer on the roots and darker spots.",
      "content": "Use the higher developer on the roots and darker spots. Sticking with the same section of hair on the foil, use a different hair color brush to paint on the 20 volume developer mixture onto the darker spots of your hair. Try not to get the bleach onto your roots just yet, since those process faster than the rest of your hair. [14] X Research source Try not to put any of the higher developer mixture onto lighter spots. If you do, you could damage or break your hair."
    },
    {
      "title": "Fold the hair into the foil.",
      "content": "Fold the hair into the foil. Grab the end of the foil and fold it upward so the hair is trapped in the middle. Crease the edge of the foil so that it stays put on its own to trap in the heat and make the hair process faster. [15] X Research source Foils will also help you keep track of what hair you’ve already put bleach on."
    },
    {
      "title": "Continue working through each section with the bleach.",
      "content": "Continue working through each section with the bleach. Now you can continue to pick out very thin sections of hair, using foils and the 2 bleach mixtures on each one. Work all the way around your head from the back to the front until your hair is fully saturated in bleach. [16] X Research source Depending on how long and thick your hair is, this could take up to 1 hour or more. If you’re having trouble seeing the back of your head, set up 1 mirror in front of you and 1 in back."
    },
    {
      "title": "Go back and cover your roots with the 10 volume mixture.",
      "content": "Go back and cover your roots with the 10 volume mixture. Using a hair coloring brush again, paint the lower volume bleach onto your roots to lighten them up as well. Since your roots lighten fairly quickly, they don’t need the strong bleach. [17] X Research source If you bleach your roots along with the rest of your hair, they could lighten way faster, leading to lighter roots and darker ends, or “hot roots.” If you were planning on leaving your roots your natural color, you don’t have to bleach them. This can help you achieve a more natural or grown out look, if that’s what you’re going for."
    },
    {
      "title": "Rinse the bleach out with lukewarm water after 30 to 45 minutes.",
      "content": "Rinse the bleach out with lukewarm water after 30 to 45 minutes. Head to the sink and take out all of the foils from your hair. Rinse your hair in lukewarm water until you can’t feel the bleach on your hair anymore. [18] X Research source Try not to leave the bleach on your hair for longer than 45 minutes, or you could damage your hair. Since your hair is previously lightened, the bleach will probably work very quickly. Check on your hair every 10 minutes to see when you need to rinse it out."
    },
    {
      "title": "Do another round of bleach if your hair is still really dark.",
      "content": "Do another round of bleach if your hair is still really dark. Sometimes, one round of bleach might not be enough to fully remove the brown from your hair. If your hair is still orange or brown, try doing a second bleach process with the same application you did before. However, if your hair feels extremely dry, brittle, or damaged, do not bleach it again to avoid getting breakage. [19] X Research source Remember: the more you bleach your hair, the more damaged it will be. If you aren’t sure that your hair can handle another round of bleach, don’t do it. [20] X Expert Source Charlie Adams Professional Hair Stylist & Board Certified Haircolorist Expert Interview. 21 July 2021."
    },
    {
      "title": "Paint on a root shadow color for a natural look.",
      "content": "Paint on a root shadow color for a natural look. Mix together 1 part beige toner, 1 part ash toner, and a 5 volume developer. Paint this formula onto the first 1 to 2 inches (2.5 to 5.1 cm) of your hair to give your color more depth and make your hair look fuller. [21] X Research source You don’t have to add a root shadow, but it will make your blonde look a little more natural and blend the grow out over time."
    },
    {
      "title": "Cancel out the orange or yellow tones in your hair with an ash toner.",
      "content": "Cancel out the orange or yellow tones in your hair with an ash toner. Pour 1 part ash toner and 1 part developing lotion into a plastic bowl, then mix the two together. Paint the toner onto your hair from the ends to the roots, stopping when you hit your root shadow color. [22] X Research source Toner helps to counteract any brassy tones in your hair, leaving you with a cool, more platinum blonde. Toners often have different levels. The darker your hair is, the lower the level you should buy. For example, if your hair is orange, go for a level 5 toner. If it’s yellow, try a level 7 or 8 toner."
    },
    {
      "title": "Rinse the color out of your hair after 20 minutes.",
      "content": "Rinse the color out of your hair after 20 minutes. Head to the sink again and rinse your hair out with lukewarm water. Make sure all of the toner and root shadow color is out of your hair before moving on. [23] X Research source Your hair will look darker when it’s wet, so don’t assess the color until it’s fully dry."
    },
    {
      "title": "Use a hair mask or a deep conditioner to repair any damage.",
      "content": "Use a hair mask or a deep conditioner to repair any damage. Bleach can be very dry and damaging to your hair, so use a moisturizing hair mask or a deep conditioner on the ends of your wet hair to counteract it. Leave the mask or conditioner in for about 1 hour, then rinse it out with lukewarm water. [24] X Research source If you’re going to use heat styling tools on your hair, make sure you use a heat protectant spray to keep your hair from getting damaged."
    }
  ]
}