{
  "url": "https://www.wikihow.com/Dress-when-You%27re-a-Teacher",
  "title": "How to Dress when You're a Teacher",
  "steps": [
    {
      "title": "Pair a dress shirt with dress pants and a blazer.",
      "content": "Pair a dress shirt with dress pants and a blazer. This is a good go-to outfit, especially if you’re short on time in the morning and need to go to school early for your classes. You can swap out a different top or a different blazer to go with the dress pants. You can also try wearing a brightly colored blazer or top with a dark-colored pair of pants. [1] X Research source Wear flats or dress sneakers with this outfit for a comfortable, easy look. Some teachers like wearing a tie or a bowtie with a dress shirt for a more formal option."
    },
    {
      "title": "Pair leggings with a long dress or tunic.",
      "content": "Pair leggings with a long dress or tunic. Leggings are a good option if you are looking for a comfortable bottom that washes easily. Make sure the leggings are covered with a polished looking dress or tunic that has short or long sleeves. Wearing leggings with a simple t-shirt on top may appear unprofessional. [2] X Research source"
    },
    {
      "title": "Wear a knee-length skirt with a long sleeve top.",
      "content": "Wear a knee-length skirt with a long sleeve top. For a more put-together look, you may opt for a skirt in a dark color with a long sleeve top in a lighter color or a pattern. Make sure the skirt hits at least your knees so it is appropriate for the classroom. The long sleeve top should not be low cut or show off too much skin."
    },
    {
      "title": "Opt for jeans and a dress shirt, if allowed.",
      "content": "Opt for jeans and a dress shirt, if allowed. Some schools will allow teachers to wear blue jeans as long as they are not ripped or expose too much skin. Find out if this is allowed at your school and if so, embrace the policy by wearing jeans with a dress shirt or a nice top. Go for jeans in a dark wash or black for a more put-together look. [3] X Research source Avoid low cut jeans or jeans that expose your legs or stomach, as they may not be appropriate."
    },
    {
      "title": "Consider athletic outfits if you are teaching gym or physical education.",
      "content": "Consider athletic outfits if you are teaching gym or physical education. Most schools will allow you to wear exercise pants or leggings with a loose top or a sweater if you are teaching a class where you have to move and sweat with your students. If this is the case, you may go for athletic outfits and running shoes that still look polished, clean, and put together. [4] X Research source For example, you may invest in matching pants and top set for teaching gym or you may go for high-quality exercise pants and a nice sweater."
    },
    {
      "title": "Dress up for formal events at school.",
      "content": "Dress up for formal events at school. If you are chaperoning a school dance or speaking at a school event, you may put extra effort into your outfit for that day. Opt for dress pants and a dress shirt with a tie or a business casual dress and a cardigan. You may also go for dress shoes like heels or loafers."
    },
    {
      "title": "Find out if your school has a set dress code.",
      "content": "Find out if your school has a set dress code. Some schools will have a standardized dress code for teachers that outlines what you can and cannot wear. Speak to the school principal or a school administrator to get a copy of the official dress code for teachers. [5] X Research source Even if there is no official dress code, most schools will provide a list of suggestions for teachers on what is appropriate and inappropriate to wear."
    },
    {
      "title": "Invest in staple items like comfortable dress pants and blazers.",
      "content": "Invest in staple items like comfortable dress pants and blazers. You can’t go wrong with long dress pants in dark colors like black, blue, and gray. Blazers that have quarter or long sleeves and lapels are also a good go-to. Investing in a few pairs of pants and several blazers in different colors can make getting dressed for teaching easy. [6] X Research source"
    },
    {
      "title": "Look for dress shirts and tops made of breathable fabrics.",
      "content": "Look for dress shirts and tops made of breathable fabrics. Shirts and tops made of cotton, linen, rayon, and denim are all good for the classroom, as they are not too constricting and feel comfortable on your skin. They also wash easily and are relatively easy to maintain. Look for collared shirts, blouses, and t-shirts in these fabrics. [7] X Research source Get 4-5 tops to add to your wardrobe so you can rotate them and pair them with dress pants or a blazer."
    },
    {
      "title": "Go for clothing that is easy to wash and clean.",
      "content": "Go for clothing that is easy to wash and clean. As a teacher, you may not have the time, or income, to dry clean or hand wash your clothing. Go for clothes that you can throw in the washer and dryer, or hang dry, and wear the next day. Avoid clothing that has a “Dry clean” or “Hand wash only” label as well as any fabrics that are delicate and cannot withstand a lot of wear. [8] X Research source If you teach younger students or do crafts in your class, clothing that is easy to wash is a must. Getting clothing that you do not mind getting a little dirty or messy will save you a lot of headaches when it comes time to do laundry."
    },
    {
      "title": "Avoid low cut or skin-revealing clothing.",
      "content": "Avoid low cut or skin-revealing clothing. Present a professional face to students by opting for clothing that fits well, but does not show too much skin. Go for tops that hit you at the neck and that cover your midriff. Opt for bottoms that hit just above or below the knee and are high waisted or cover your waist."
    },
    {
      "title": "Go for close-toed shoes with good support.",
      "content": "Go for close-toed shoes with good support. As a teacher, you will be on your feet a lot in the classroom, sometimes for several hours straight. Most schools will suggest that teachers avoid wearing flip flops or shoes that expose their toes or feet. Close-toed shoes like dress sneakers or dress flats are a good option. [9] X Research source Look for close-toed shoes with support soles or insoles that have cushioning and are breathable. You could also put supportive inserts in your shoes to make them more comfortable. Avoid wearing heels in the classroom, as your feet may start to hurt after several hours or feel sore at the end of the day."
    },
    {
      "title": "Wear statement jewelry to add personality to your outfits.",
      "content": "Wear statement jewelry to add personality to your outfits. Add a bit of style to your outfits by wearing a statement necklace with a nice top or statement earrings with a dress. You can also wear a bracelet or a ring. Try wearing 1 statement item per outfit to keep your look polished and put together. If you wear eyeglasses, you may swap out the frames on your glasses to make them a statement piece. A nice watch can be a good staple item to add to your outfits and serve a practical use as well. Go for a watch with a larger face if you tend to glance it often and want it to be easy to read."
    },
    {
      "title": "Style your hair in an easy to maintain way.",
      "content": "Style your hair in an easy to maintain way. Make sure your hair looks clean and polished so you look professional to your students. If you have long hair, try a french braid , a high bun , or a ponytail . If you have short hair, brush your hair and use styling gel to keep it looking clean and put together. [10] X Research source You may also have a go-to hairstyle like a bun or a braid that you wear everyday to simplify your routine."
    },
    {
      "title": "Keep your makeup minimal and simple.",
      "content": "Keep your makeup minimal and simple. Simple makeup like foundation, blush, and mascara can make getting ready to teach much easier and quicker. You can add a bit of eyeshadow or lipstick to your look as well."
    }
  ]
}