{
  "url": "https://www.wikihow.com/Do-a-Pop-Sound-With-Your-Mouth",
  "title": "How to Do a Pop Sound With Your Mouth",
  "steps": [
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Clean your hands thoroughly. Make sure that you wipe off every speck of dirt. You don't want end up getting sick because of this! You’re going to be sticking your hands in your mouth. Therefore, try to make sure you don’t have any type of residue on your fingers."
    },
    {
      "title": "Create a hook-shape with your finger.",
      "content": "Create a hook-shape with your finger. Twist your hand and turn your palm away from your face. Your thumb should be pointed downwards and tilted away from your face. Make a hook shape by curling your index finger. One way to make this shape is to pick up a bag with one finger. Your finger will naturally make a curve. [1] X Research source Without this hook shape, it will be difficult to make a noise. If this is too difficult to do with an index finger, you can try using your other fingers. Some people even use their thumbs to make this noise."
    },
    {
      "title": "Lubricate your lips.",
      "content": "Lubricate your lips. Get a glass of water and drink it. This will ensure that your lips aren’t too dry. Putting more moisture on your lips will make it easier to make a pop sound. You can use chap-stick or lip balm as well. You want to prevent dryness at all costs. Parched lips can be split quite easily!"
    },
    {
      "title": "Create an \"O\" with your lips.",
      "content": "Create an \"O\" with your lips. To do this, attempt to pronounce a word like toot or fruit. This is a good way to get your lips in the right place.The \"o\" shape should be big enough for your finger. Tighten your muscles. Make sure that your mouth and cheek muscles are taut. You shouldn't be able to move them around too easily. [2] X Research source"
    },
    {
      "title": "Put your finger in your mouth.",
      "content": "Put your finger in your mouth. Place your finger gently in your mouth. You want to try to push toward the inside of your cheek. Don't stick your finger in too far!"
    },
    {
      "title": "Wrap your lips around your finger.",
      "content": "Wrap your lips around your finger. Tighten your lips around your finger. Keep a hold on your finger with your lips. Keep the position. Try to keep your lips in the same place. If you start to tire, stop for a moment. If your mouth position is incorrect, then it will be hard to make a sound. You may want to practice this before you start to do the trick. A good way to maintain this posture is to pretend that you are holding something inside your mouth already."
    },
    {
      "title": "Pull out your finger.",
      "content": "Pull out your finger. Yank your finger out of your mouth. Be careful not to do this too quickly. You don't want to hurt yourself! You may have to do this a few times before a sound is produced. If no sound is coming out, try blowing out of your mouth while you do this."
    },
    {
      "title": "Entertain a group of friends.",
      "content": "Entertain a group of friends. This is a great way to annoy and amuse your friends. Walk up to your friends, greet them, and then make the sound. Be prepared to hear laughter or cries to stop! You can also do this individually. Sneak up behind one of your friends, and get next to their ears. Make the sound and run away. They will be completely confused."
    },
    {
      "title": "Make music.",
      "content": "Make music. Once you’ve mastered this trick, you can use it to make a melody. Just repeat the sound till you have a consistent rhythm. Body sounds have been used in music for a long time! For example, beatboxers make sounds with their mouths in order to imitate percussion. [3] X Research source Try “playing” with one of your friends. You can make the sound and they can rap along. You both can also try making the sound at the same time."
    },
    {
      "title": "Amuse your family.",
      "content": "Amuse your family. Ask one of your relatives if they want to see a fun trick. If they say yes, make the sound for them. They might be surprised or grossed out. You won’t know until you try it out! If they say no, you can still do the trick, but you might get in trouble!"
    }
  ]
}