{
  "url": "https://www.wikihow.com/Fix-a-Jean-Zipper",
  "title": "How to Fix a Jean Zipper",
  "steps": [
    {
      "title": "Remove the top stops on both sides.",
      "content": "Remove the top stops on both sides. The top stops are metal pieces at the top of the zipper that prevent the zipper from coming completely off of the track. Use pliers to remove the top stops. Pry the top stops apart to loosen them and then pull them off the zipper fabric. This will allow you to fix your zipper and get it back on the track on both sides. [1] X Research source Move the zipper slider all the way to the bottom of the zipper before you do this. [2] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Pull off 2 or 3 teeth on both sides.",
      "content": "Pull off 2 or 3 teeth on both sides. Next, use the pliers to pull off 2 or 3 teeth from each side of the top of the zipper. Pry the teeth apart to loosen them and then pull them away from the zipper fabric. Removing these zipper teeth will make it easier to put the zipper back on the track. [3] X Research source Make sure to pull off the same amount of teeth on each side of the zipper. Discard these zipper teeth. You will not need them."
    },
    {
      "title": "Take off the zipper pull.",
      "content": "Take off the zipper pull. After you have removed the zipper teeth, you will be able to slide the zipper pull completely off of the track. Remove the zipper pull and set it aside. [4] X Research source"
    },
    {
      "title": "Close the zipper teeth with your fingers.",
      "content": "Close the zipper teeth with your fingers. Next, begin to reconnect the zipper teeth with your fingers. Press the teeth together as if you are zipping the zipper up from the bottom. Make sure that all of the teeth are interlocked with the teeth across from them. Connect the teeth all the way to the top of the zipper. [5] X Research source"
    },
    {
      "title": "Replace the zipper pull.",
      "content": "Replace the zipper pull. When all the teeth are interlocked, slide the zipper pull back onto the zipper at the top. As you do this, some of the teeth may come apart. Reconnect them if they do. Then, begin sliding the zipper pull down the length of the zipper. The teeth should open as you do this and this means that the zipper is back on the track. [6] X Research source"
    },
    {
      "title": "Replace the top stops.",
      "content": "Replace the top stops. Take the zipper top stops that you removed earlier and use your pliers to reconnect them to the zipper fabric. Replace each of the zipper stops right above the zipper teeth by squeezing them closed around the zipper fabric. There should be no gaps between the zipper teeth and top stops. [7] X Research source"
    },
    {
      "title": "Check the location of the broken zipper teeth.",
      "content": "Check the location of the broken zipper teeth. Adding a new bottom stop will prevent the zipper from sliding over broken teeth and getting stuck or coming off the track. If the broken zipper teeth are more than halfway down the fly, then you can fix the zipper by adding a new bottom stop. If the broken teeth are higher up on the zipper, then you will need to replace the entire zipper ."
    },
    {
      "title": "Remove the top stops and zipper pull.",
      "content": "Remove the top stops and zipper pull. Take off the top stops using a pair of pliers. Pry each of the top stops apart using the pliers and then remove them from the zipper fabric. Then, slide the zipper pull off of the zipper. [8] X Research source Set the top stops and zipper pull aside."
    },
    {
      "title": "Close the zipper teeth with your fingers.",
      "content": "Close the zipper teeth with your fingers. Next, use your fingers to manually close the zipper teeth. Start from the bottom of the zipper and work upwards. Press the teeth together a few at a time. They should be easy to lock into place. [9] X Research source Line up the spot with the broken or missing teeth as well as you can."
    },
    {
      "title": "Place a bottom stop above the broken teeth.",
      "content": "Place a bottom stop above the broken teeth. A bottom stop is a square metal piece with two prongs extending from the back of it. Press these prongs into the zipper fabric on both sides of the zipper teeth where the teeth are broken or missing. Then, turn use pliers to press the prongs down on the back side of the zipper. [10] X Research source If you don't want to use a new zipper bottom stop, then you can also sew over the area with the broken teeth. However, you will need to sew over the area completely to prevent the zipper pull from going into this area and coming off the track."
    },
    {
      "title": "Replace the zipper pull and top stops.",
      "content": "Replace the zipper pull and top stops. Next, take the zipper pull and slide it back onto the track at the top of the zipper. Make sure that the teeth are still closed and close any that open up as you are getting the zipper pull back on. Then, use your pliers to replace the top stops. Put them back onto the zipper fabric where they were before. [11] X Research source"
    },
    {
      "title": "Fix the zipper track if it's broken at the bottom.",
      "content": "Fix the zipper track if it's broken at the bottom. Use scissors to snip the zipper welt between the teeth, just above where the zipper pull begins to feed onto the teeth. Then, feed the znipped side into the top of the zipper pull and zip the zipper. [12] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020. Sew the snipped area by stitching across the zipper from side to side with a needle and thread, which will keep the zipper on track. [13] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020. If there are any teeth missing, this will shorten your zipper. [14] X Expert Source Margo West Professional Tailor Expert Interview. 7 December 2020."
    },
    {
      "title": "Use wax or grease to unstick a zipper.",
      "content": "Use wax or grease to unstick a zipper . If the zipper is stuck, then rubbing wax or grease onto the zipper may help to loosen it and make it easier to open and close. Get a candle or some Crisco and rub it along the length of the zipper on both sides. Then, try to open and close the zipper. The zipper pull should move easily now. Be careful not to get the wax or grease onto the surrounding fabric."
    },
    {
      "title": "Add a keyring or safety pin to prevent a zipper from unzipping.",
      "content": "Add a keyring or safety pin to prevent a zipper from unzipping . If you have a zipper pull that simply will not stay up, then attaching a keyring or safety pin to the zipper pull can help to keep it in place. If you use a keyring, then you can loop the keyring around the jeans button when the zipper is up. If you use a safety pin, then you can insert the pin through the fabric near your zipper when the pull is up. Another option is to spray some hairspray onto your zipper to prevent it from sliding down as easily. Spray hairspray along the length of the closed zipper teeth. This should make them tacky enough that the zipper will not keep sliding down."
    },
    {
      "title": "Replace a zipper",
      "content": "Replace a zipper that is beyond repair. If the zipper is so broken that you cannot fix it, then you will likely need to replace it. Get a replacement zipper that is the same size and color as the original. Then, remove the old zipper with a seam ripper and sew in the new zipper ."
    }
  ]
}