{
  "url": "https://www.wikihow.com/Find-Ghosts-in-Your-House",
  "title": "How to Find Ghosts in Your House",
  "steps": [
    {
      "title": "Ask the ghost what their business is.",
      "content": "Ask the ghost what their business is. If you suspect that your home is host to an otherworldly being, take the direct approach and attempt to speak to them. Ask them who they were, what they want and why their spirit is trapped in your home. While a ghost is unlikely to engage you in conversation, you may receive signs of its presence in other ways, such as doors opening or closing on their own, or manipulation of the environment that provides clues to what the ghost's intentions are. [1] X Research source Some good questions you might ask are “what is your name?” “why are you here?” “what do you want?” and “how did you die?” Be sure you can handle a reply before you start asking questions."
    },
    {
      "title": "Commune with the spirit realm using an Ouija board.",
      "content": "Commune with the spirit realm using an Ouija board. Though it's often thought of as a silly toy or gimmick, the Ouija board has long been used to establish a connection to parts unknown. Have a friend join you in trying to make contact with the other side. First, each of you will place both hands on the wooden planchette. Then, you will pose questions for the ghost and await its response. If you feel the planchette begin to move, it may mean the ghost is trying to tell you something. The ghost can answer “yes” or “no” by sliding the planchette over the words, while the individual letters on the board can be used to spell out more articulate responses. Take it seriously. Don't cheat by moving the planchette on your own, and ask your friend to do the same. You'll never know whether you have a true haunting if you play around."
    },
    {
      "title": "Hold a seance.",
      "content": "Hold a seance. Assuming you're reasonably sure that your house is haunted, the next step is to carry out a seance. Seances are ceremonies used to invite the dead to speak to the living. To perform a seance, you must gather with other believers around someone who is receptive to spiritual energies. A seance is a more formal method of contacting ghosts than simply attempting to speak with them. They are most effective when led by an experienced spiritualist or medium. [2] X Research source Lower the lights, join hands and sit in silence while you wait for a ghost to show itself. In order for a seance to be effective, skeptics should be asked to leave the room. Spiritualists claim that their negative attitudes act as a distraction and make spirits reluctant to interact."
    },
    {
      "title": "Interpret troubling dreams.",
      "content": "Interpret troubling dreams. Sometimes, ghost visitations occur in dreams, where it is said that the wall separating our world from the next is most permeable. When you have vivid, unsettling dreams, write down what you saw and experienced in them. Encountering people you don't recognize or receiving cryptic messages in your dreams could be a spirit's way of reaching out to you. If you're stumped about the meaning of a dream, consult with a spirit medium. These experts are commonly trained in dream analysis in addition to their other talents."
    },
    {
      "title": "Pay attention to strange occurrences.",
      "content": "Pay attention to strange occurrences. Take notice of bizarre things that happen around you. This could include anything from thinking you saw something moving out of the corner of your eye or heard a whisper when you're alone to witnessing appliances turn on and off on their own. When hunting for ghost activity, your first line of research should be your own senses and intuition. [3] X Research source Investigate as soon as you see, hear or feel something so you'll have a better chance of catching paranormal events in the act. Don't be fooled into believing that every bump or rattle is a ghost. The explanation may be a creaky floor, a draft, a playful pet or just your imagination."
    },
    {
      "title": "Photograph different parts of the house.",
      "content": "Photograph different parts of the house. Once every few days, take a picture of each room of your home. Frame the photo so that you can see as much of the room as possible. Some theories hold that ghosts exist as a kind of residual energy and that it's possible to capture a snapshot of this energy under the right conditions. Some signs to look for in photographs are strange lights or orbs, shadowy smudges and streaks of pale, smoke-like vapors. [4] X Research source To avoid confusion, make sure that the lens of your camera is clean and that there isn't a glare in the room. Concentrate on rooms where the most phenomena have occurred."
    },
    {
      "title": "Set up a video camera to catch ghost movements.",
      "content": "Set up a video camera to catch ghost movements. Like with ghost photography, spirits have been known to appear on video. Set up a camcorder in the areas of your house where you feel the presence most strongly. With a video, you're essentially taking 24-30 pictures per second, which will increase your chances of spotting an evasive ghost if you look closely enough. Be on the lookout for anything out of the ordinary in the video, especially odd disturbances and hints of movement. A ghost may only appear on film for a split second. To be sure of what you've seen, it may be necessary to pause the footage often or run through some segments frame-by-frame."
    },
    {
      "title": "Record unheard voices.",
      "content": "Record unheard voices. Run an audio recorder while questioning a possible ghost, then play back the recording later and see if it contains any sounds you didn't hear it person. EVP, or electronic voice phenomenon, describes ghostly voices that are caught on tape. These voices are usually discovered at extremely low frequencies, which means the human ear can't detect them, but sophisticated audio equipment can. Due to these low frequencies, you'll probably have to turn your recording device up quite loud in order to hear any voices it's picked up. Write down any words or phrases you hear that are clear enough to interpret. If you're lucky, you may be able to decipher a message and discover the source of the ghost's unrest."
    },
    {
      "title": "Work with paranormal investigators.",
      "content": "Work with paranormal investigators. If you feel like you're in over your head, consider getting in touch with a local paranormal investigation group. The members of these groups are usually supernatural and occult enthusiasts with a good deal of knowledge about ghost history, folklore, science, and myth. They will be able to offer expertise, equipment and other resources that can help you in your search. Be sure to provide an in-depth description of the phenomena you've been experiencing so that the paranormal expert can determine whether or not they'll be able to help. Working alongside a specialist can take away some of the fear of looking into ghost activity on your own. A good paranormal investigator will also know the best way to question and deal with a spirit that is reluctant to move on."
    },
    {
      "title": "Understand that you're in no danger.",
      "content": "Understand that you're in no danger. A ghost that is inhabiting your home most likely doesn't want to hurt you. In life, they were normal people, just like yourself. With this in mind, it may be possible for you to live with a ghostly presence without feeling the need to get rid of it. The spirit may believe that your home is still its own—activity that is frightening to you are just the essence of the deceased reenacting the events of its daily life. Incidents of ghosts actually harming people are rare. When activity is observed, it's usually in the form of minor disturbances. If you believe in ghosts, then you know they can be almost anywhere. It shouldn't come as a surprise that one or two may occasionally make themselves known in your home."
    },
    {
      "title": "Burn sage.",
      "content": "Burn sage. Burning the leaves of the sage plant is said to purify the air in your home and cleanse it of negative and evil influences. This may serve you well if you fear that the entity residing in your home is a malevolent one. Take a bundle of dried white sage and let it smolder as you walk through the various rooms of your house, focusing your mind on bringing peace to your surroundings. Burning herbs like sage can pacify restless spirits and help you feel relaxed. Sage has long been used as a medicinal herb, and is believed to offer protection for both the body and soul. Use sage in conjunction with sprinkling holy water, asking prayers for protection and requesting that the spirit pass on. [5] X Research source"
    },
    {
      "title": "Encourage the entity to leave.",
      "content": "Encourage the entity to leave. During a seance or solitary communication, gently demand that the lingering spirit depart from your home. Ghosts are often understood to have “unfinished business” that keeps them tethered to a certain place. Put your unearthly visitor at ease and inform them that there's nothing they can do by staying. Hopefully, they'll understand and be able to move on to a new, peaceful plane of existence. In a compassionate but firm voice, ask the ghost to leave. Use entreaties like \"this is my home now—you have no business here,\" or \"don't be afraid to pass on. There is no longer a reason for you to stay.\" It may help to know some details of the suspected ghost's former life in order to connect with them and guide them onward. [6] X Research source Try not to take a hostile tone. An angered ghost may become vengeful."
    },
    {
      "title": "Commission an exorcism.",
      "content": "Commission an exorcism. If you're being plagued by wicked, mischievous or disruptive ghosts, there may come a time when enough is enough. In this case, an exorcism may be necessary. Seek out a Church official qualified to perform a proper exorcism and ask them to visit your home to get a sense of the spirit's power and intent. A well-trained exorcist will know the right invocations and ritual practices to successfully dispel spectral intruders. [7] X Research source Usually, an exorcist will be a member of the Catholic clergy who has received special education in dealing with supernatural forces. However, other religious orientations also have priests and shamans who are capable of conducting exorcisms. [8] X Research source You may be asked to leave or remain in the house during the exorcism, depending on the exorcist's methods."
    }
  ]
}