{
  "url": "https://www.wikihow.com/Do-Mosaics",
  "title": "How to Do Mosaics",
  "steps": [
    {
      "title": "Pick the base to glue the mosaic tiles on.",
      "content": "Pick the base to glue the mosaic tiles on. You can make a mosaic on nearly any surface. It should be strong enough to handle the weight of your mosaic pieces and the glue and grout. Tables, planters, bird baths, or walking stones are all great options. [1] X Research source Be sure to clean off any dirt or debris from your base before you use it. Use a damp sponge to scrub off any stubborn debris. Dry the base completely before you start applying the mosaic pieces to it. Your base can be any shape, but be careful with very extreme curves because you will need very small mosaic tiles to fill the curves. The best mosaic base for outdoor mosaics is concrete because it is the most weather-resistant. You can find thin concrete boards at your local building material store. A mesh metal pizza tray works especially well for making decorative glass gem mosaics. Terracotta bases are more risky for outdoor mosaics since they can be susceptible to freezing damage. If you want to make a mosaic on a terra cotta pot, for example, either take the pot inside in cold weather or apply several coats of sealant when you are finished to protect it from the elements."
    },
    {
      "title": "Select the material you want to use to make your mosaic design.",
      "content": "Select the material you want to use to make your mosaic design. The small pieces of material used in a mosaic art are called tesserae. They can be glass, stones, porcelain, seashells, or anything else you can find. If you don’t have any material lying around your house, try buying mosaic tiles in your local arts and crafts store. [2] X Research source Consider the size of your mosaic base when collecting your mosaic pieces. If you are unsure, scatter the pieces across the base. They should be able to cover it fully. If you are reusing materials for your mosaic, be sure to clean off any dirt or debris with soap and water. Let them dry completely before you begin the project. You can also add other objects or decorations to your mosaic, like small ceramic flowers. You can also used smashed china plates as mosaic tiles. Break one plate at a time with a hammer inside a plastic bag. Use a tile nipper to break the plates for more control over the sizes and shapes of the pieces. You will need 5-7 plates for a medium-sized mosaic, about 20 by 24 inches (51 cm × 61 cm). Cups don’t work as well for mosaics because they don’t end up making flat pieces so they are harder to arrange and glue down. [3] X Research source Round glass gems are a kid-friendly mosaic tile because you won’t have to worry about sharp edges. You can find the gems in your local craft store. They are available in many different colors and sizes. [4] X Research source"
    },
    {
      "title": "Sketch your design on the base.",
      "content": "Sketch your design on the base. Copy a mosaic pattern from a coloring book or make your own simple sketch. Remember that the more detailed the design, the smaller your mosaic tiles will have to be. [5] X Research source If you’ve sketched something on paper first, transfer your design onto your base using tracing paper ."
    },
    {
      "title": "Lay your mosaic pieces over your design before gluing them down.",
      "content": "Lay your mosaic pieces over your design before gluing them down. Place your mosaic pieces over the design to arrange them how you’d like and preview how they will look before you glue them on. Make sure the pieces are clean of any dirt or debris before laying them out. You can further break your pieces with a hammer or tile nipper if need be."
    },
    {
      "title": "Choose the right adhesive for the materials you are using.",
      "content": "Choose the right adhesive for the materials you are using. The traditional mosaic adhesive is cement-based mortar. It is made by mixing cement, sand, and water. But you can also use acrylic based adhesives, epoxy resins, or construction adhesives. Find the right adhesive for you at your local craft supply or hardware store. Start by looking at the “Applications” section on the label. You will need an adhesive that works well for your base and decoration materials. [6] X Research source If you are making an outdoor mosaic, make sure your adhesive label states that it is water-resistant. For mosaics that will regularly get wet, like shower floors, use thinset mortar. [7] X Research source Acrylic-based adhesives are easy to use and very strong and good for slippery surfaces like ceramic and glass. Epoxy resins work well on metals, but they can be messy to use and smelly."
    },
    {
      "title": "Mix your adhesive per manufacturer recommendations, if necessary.",
      "content": "Mix your adhesive per manufacturer recommendations, if necessary. Check the label on your adhesive to find out if you need to mix it before applying. Mortar will need to be mixed beforehand, as will epoxy resins. A tube of acrylic adhesive is ready to use right away. If you have a powdered adhesive, mix it up outside and wear a dust mask so you don’t inhale the dust particles."
    },
    {
      "title": "Spread the adhesive on the base with a trowel or spatula.",
      "content": "Spread the adhesive on the base with a trowel or spatula. Wear rubber gloves when handling adhesives to keep your hands from getting glued. Spread the adhesive over the whole surface of the base. [8] X Research source You can also put the adhesive directly on each mosaic tile as if you are buttering it like a piece of toast. Apply the buttered piece directly to the foundation and press down to affix it in place. This also works well if you have an adhesive that comes in a squeezable tube."
    },
    {
      "title": "Arrange the mosaic pieces on top of your design.",
      "content": "Arrange the mosaic pieces on top of your design. While the adhesive is still wet, gently affix the mosaic tiles by pushing them into the mixture. Apply tiles starting in one corner of the design and work across in rows. Make sure the gaps between the tiles are about 1 ⁄ 8 inch (0.32 cm) or less. [9] X Research source If you are using concave mosaic pieces, like shells, coat the underside of the shell with adhesive and fill the body of the shell with adhesive before you place it on the base."
    },
    {
      "title": "Let the adhesive set.",
      "content": "Let the adhesive set. The time needed varies depending on the type of adhesive you used and where your mosaic will be, so check the label on your adhesive and follow the directions stated there. Once the adhesive is set, wipe the mosaic tiles with a damp sponge to clear away any extra adhesive material that may have risen to the top. [10] X Research source Try to wipe the excess mortar as soon as possible after its set. If you wait until the adhesive cures completely (usually another 24 hours after it is set), it will be very difficult to wipe off the excess from the tiles. If you used traditional mortar, 24 hours is usually enough time for indoor mosaics. Outdoor mosaics will need to set for 72 hours. Acrylic adhesives and epoxy resins usually take between 12-24 hours to set completely."
    },
    {
      "title": "Choose your grout.",
      "content": "Choose your grout. Adding grout, a fine textured version of cement mortar, will fill in the spaces between your mosaic pieces. It also unifies and enhances the design. Grout comes in many colors and you can even color the grout yourself to get the perfect match for your mosaic. It looks best if you pick a contrasting color so your design will stand out. [11] X Research source If you used very textured or porous pieces, like shells or very uneven stones, you don’t need to grout your mosaic. If you are in doubt about the grout color, black is usually the best choice, and pure white often drowns out the mosaic design. If you want a lighter color, try a cream-colored grout."
    },
    {
      "title": "Prepare the grout mixture.",
      "content": "Prepare the grout mixture. Mix the grout by following the instructions provided by the manufacturer. It’s best to mix the grout outside, since it can be a messy and dusty process. Wear rubber gloves, safety goggles, and a dust mask to protect yourself when mixing the grout. [12] X Research source"
    },
    {
      "title": "Apply the grout using a spatula.",
      "content": "Apply the grout using a spatula. Lay newspaper down on your work surface and place the mosaic on it. Cover the whole mosaic with grout, spreading it with a spatula and filling in the creases between the tiles. The grout should cover the mosaic enough to fill the gaps. Do this outside or in a well ventilated area. [13] X Research source"
    },
    {
      "title": "Let the grout set and wipe away the excess.",
      "content": "Let the grout set and wipe away the excess. Check the label on your grout to see how long it will need to set. It should be set in about 20 minutes. Then, wipe the mosaic with a clean sponge and warm water. Rinse out the sponge regularly as you wipe away grout from the surface of the tiles. [14] X Research source If there is any stubborn grout residue left on the mosaic, or if you wait too long after it sets to wipe it off, clean the excess grout off with a clean lint free cloth or a piece of crumpled newspaper. Remove big pieces of grout stuck to the mosaic pieces with a non-scratch nylon scouring pad or a small wooden stick."
    },
    {
      "title": "Apply sealant to the mosaic to protect it.",
      "content": "Apply sealant to the mosaic to protect it. This will coat the tiles and safeguard against damage, especially for outdoor mosaics subjected to fluctuating temperatures and adverse weather conditions. It also will give a high gloss shine that will make the colors stand out. Let the sealant dry before using the mosaic. You can also get a matte finish sealant if you don’t want your mosaic to have a glossy sheen. Apply at least 2-3 coats of sealant to protect outdoor mosaics. Let the sealant dry between coats."
    }
  ]
}