{
  "url": "https://www.wikihow.com/Deal-With-Exclusion",
  "title": "How to Deal With Exclusion",
  "steps": [
    {
      "title": "Accept what happened.",
      "content": "Accept what happened. Exclusion is not your fault, and a friendship breakup does not mean that you’re a failure or that you’re doomed to never have friends again. The good thing about the high emotionality of exclusion is that it is a relatively temporary condition. [2] X Research source This means that once you accept your feelings of exclusion they will evaporate shortly, leaving you with a clear mind to act in response. Acknowledge feeling of anger and hurt toward whoever excluded you, but try not to dwell on them for too long. To help acceptance, remind yourself that these feelings are not permanent, but that they are teaching you something meaningful about the social world. The pain of exclusion temporarily interferes with your ability to connect well with others, so the sooner you let yourself feel the full range of your exclusion feelings, the sooner you can get safely back in the game to do something about them. However, the sting of rejection should not be ignored. Even though it is painful, it can send you a strong push to look elsewhere for connection or tell you that you should give up on a particular person or prospect."
    },
    {
      "title": "Put the event in perspective.",
      "content": "Put the event in perspective. Sometimes events can truly clue you in to parts of your behavior that are problematic for other people. Usually though, we take rejection much too personally. Upsets like not getting the job you want or being rejected by someone you want to date actually has very little to do with the unchanging parts of your personality. Don’t make the experience into a catastrophe. Even if you have experienced exclusion or rejection before, understand that exclusion is not a negative judgment of your character. In reality, it's a sign of perceived incompatibility. If reflection tells you that you really did do something to merit the exclusion you experienced, try apologizing. Giving a simple apology for your behavior is a good fix that can help you heal more quickly. It works well because you'll feel as though you've done something social that also addresses the issue."
    },
    {
      "title": "Look at your options.",
      "content": "Look at your options. After the initial pain of rejection, most people move into an “appraisal stage,” in which they take stock and formulate their next steps. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Acting to relieve this pain is natural, so what can you do to feel more included? Exclusion actually makes you more sensitive to potential signs of connection, more attentive to social cues, and more willing to please. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Take advantage of this special moment of sensitivity to new connections! Ask yourself the following to see if you really want to make it work with the people who excluded you: Was this a \"fluke\" incident where I felt excluded even despite my friends' best efforts to include me? Are these excluders people with whom I am certain that I have a true, fulfilling connection? Would it help me get over what happened to have a talk about it? If so, would others be willing to explain their perspectives?"
    },
    {
      "title": "Resist responding by lashing out.",
      "content": "Resist responding by lashing out. Another temptation that arises when dealing with exclusion is the urge to become angry and aggressive toward your excluders. Some people try to force others to pay attention to them in attempts to reassert a sense of control over the situation. [5] X Research source C. N. DeWall, B. J. Bushman. Social Acceptance and Rejection: The Sweet and the Bitter. Current Directions in Psychological Science, 2011; 20 (4): 256 DOI: 10.1177/0963721411417545 Try learning techniques to control anger to use if these impulses creep up. When you're around people who trigger the pain of the exclusion, monitor your body for signs of anger and take steps to release it without hurting or snapping at others. Responding by lashing out can begin a vicious cycle. People who act aggressively tend to have an even harder time gaining social acceptance."
    },
    {
      "title": "Seek inclusion elsewhere.",
      "content": "Seek inclusion elsewhere. Whatever you decide about your excluders, it is always good to have different groups of friends to avoid putting all your eggs in one basket. People often respond to rejection by seeking inclusion elsewhere to recharge self-esteem. [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Consider the people in your life who make you feel included. Gaining confidence through connection is important for getting back on your feet, even if you still hope to branch out and eventually continue to make new friends, too. For example, even though your family cannot replace your social life, try spending some concentrated time with a loving parent or relative."
    },
    {
      "title": "Play the role of the organizer.",
      "content": "Play the role of the organizer. If you find that the exclusion was not severe enough to stop trying to socialize with the person or people, make an effort to regain feelings of inclusion with them. You can do this without forcing it by organizing a fun day out or inviting them somewhere that you know you will feel comfortable and able to socialize (like your home or a cafe that you frequent)."
    },
    {
      "title": "Report exclusion that is also bullying.",
      "content": "Report exclusion that is also bullying . If you are being excluded over and over again by the same person (or group of people), it may count as bullying. Bullying is a serious offense that can escalate quickly, so it's important to reach out to your teachers, parents, or counselors who will address the problem with you. Look for signs that the exclusion is a form of bullying, and seek help if it is: The exclusion involves other malicious acts like making threats, spreading rumors, and launching physical or verbal attacks. This behavior happens on an ongoing basis and shows no signs of letting up. The excluder(s) is dangerous to you by having significantly more physical strength, popularity, or access to information that would harm you if it spread."
    },
    {
      "title": "Let yourself grieve.",
      "content": "Let yourself grieve. Exclusion is not just embarrassing or stigmatizing, but actually quite painful. The pain of exclusion triggers the same part of your brain that physical pain does, meaning that ostracism is not just a blow to your ego. Understand that you will feel uncomfortable feelings and that letting yourself grieve in this situation is as important as keeping a broken arm in a sling. You wouldn't be out the very next day pitching a baseball game, would you? Try taking a day to yourself to process what happened. Don't be afraid to burst out sobbing, listen to sad music that matches your mood, or yell into a pillow if you feel angry and frustrated. These feelings will pass if you express them."
    },
    {
      "title": "Foster fulfilling relationships.",
      "content": "Foster fulfilling relationships. [7] X Research source Focus your efforts on making friends and developing relationships that you feel comfortable falling back on. For example, try finding a confidant--someone who you can trust to listen and be understanding when you need to talk about serious personal issues (and vice versa). This way, even if you venture out and take some risks socially, you know that you will never be left without anyone to turn to."
    },
    {
      "title": "Choose to value quality over quantity.",
      "content": "Choose to value quality over quantity. Some of the pain of rejection comes from the fact that many of us have rigid standards and \"shoulds\" for what a social life should look like. Remember that it's not always realistic to expect to be a social butterfly with tons of different groups clamoring for your time. Satisfying social lives come in many forms, and it is the quality of relationships, not how many you have, that makes you feel connected and included For many people, having one or two deep friendships with lots of care and time involved is more fulfilling than having many friends who are hard to connect with one-on-one."
    },
    {
      "title": "Focus on self-confidence",
      "content": "Focus on self-confidence . When you are confident in yourself, fewer and fewer social encounters really feel like exclusions (even if you get just as many invites as you did before developing your confidence!) Confidence is a state of mind that involves understanding that regardless of how you feel now, there will always be a place for you and all of the unique gifts that you bring to the table. Trust in the fact that the cards fall the way they do in order to teach you something meaningful. The hard part is dropping your expectations and beliefs about how things \"should\" turn out. [8] X Research source Focus on past successes and the qualities that you have that contributed to that success. Use these qualities to improve other parts of your life, like making new friends. One common reaction to exclusion is to play the role of the victim by pouting and moping in excess. But, being a victim signals to other people that you expect to be befriended. This is typically not an attitude that draws people in, and it can make you put less effort into making friends without you even realizing it."
    },
    {
      "title": "Remove reminders of the excluders.",
      "content": "Remove reminders of the excluders. [9] X Research source If you have been excluded consistently in one domain (like school or work) or by the same group of people, do whatever you can to avoid painful reminders of exclusions. Of course, this can't be done completely--nor should you dedicate too much energy to escaping the memory. Just make efforts not to engage with specific people or return to the scenes of exclusion when possible. Since exclusion is such an emotional event, memory triggers can still bring painful feelings well after you make peace with what happened. For example, if your excluders are your peers at school you might not be able to avoid them in class. However, try to have as little face time as possible at lunch and after classes. If the person who’s excluded you is a current or former friend, it’s probably best to walk away from that friendship if your friend shows no signs of changing. Reader Poll: We asked 1019 wikiHow readers who've been excluded by a friend, and 49% of them agreed that they would respond by cutting that person off . [Take Poll]"
    },
    {
      "title": "Get active.",
      "content": "Get active. The endorphins that are released during cardiovascular exercise are notoriously helpful for elevating mood. [10] X Research source Especially if feeling excluded is contained to one event, this can help you deal with the immediate emotional aftermath. Try to integrate brisk walks into your routine, at the minimum, or try activities like running, cycling, swimming, and high intensity yoga."
    },
    {
      "title": "Consider taking over-the-counter pain medication.",
      "content": "Consider taking over-the-counter pain medication. You may want to consider taking the suggested dose of acetaminophen (like Tylenol) at night when you go to sleep and in the morning waking up. Doing this can help diminish the hurt feelings that usually arise with social rejection because it lowers the sensitivity of our neural censors for pain. [11] X Research source OTC medications such as acetaminophen have a risk of side effects. You should check with your doctor before taking any medication, especially if you plan to use acetaminophen for an \"off label\" purpose (off label meaning that you are taking the drug for reasons other than what the FDA has approved it for treatment of a condition, the conditions that are listed on the label). [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Seek therapy.",
      "content": "Seek therapy. When exclusion occurs frequently or one instance stays on your mind for a long period of time, you can feel seriously devastated. Since depression, substance abuse, and suicide are common for people dealing with long-term ostracism, take steps to get a handle on your feelings as soon as possible. [13] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Psychologists can help you talk through these feelings and make behavioral modifications that will be more likely to bring about success socially."
    }
  ]
}