{
  "url": "https://www.wikihow.com/Get-Rid-of-Bed-Bug-Stains",
  "title": "How to Get Rid of Bed Bug Stains",
  "steps": [
    {
      "title": "Locate the nesting area(s).",
      "content": "Locate the nesting area(s). If you don't get rid of the bed bugs, the stains will continue to plague you. [1] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. Look for bugs and eggs in and around your bed, in the drawers of nightstands and dressers, behind and under furniture, and in curtains. A flashlight can help you spot bugs and their eggs more clearly. Bugs will be light brown and small. Eggs are often laid together in groups. Bed bugs love to hide in cracks, corners, and recessed areas. Carpets, clothing, and other fabric items can become infested with bed bugs. [2] X Research source"
    },
    {
      "title": "Kill bed bugs",
      "content": "Kill bed bugs with heat and cold. Fabric items must be a laundered at 122 °F (50 °C) to kill bed bugs, and it'll likely take several washings before the bugs are completely removed. Fabric kept at or below 32 °F (0 °C) for 2 weeks will also kill the bugs. Small and large items can be encased in special bed bug killing covers. These can be bought at most convenience and grocery stores. Severe infestations may require chemical treatments or the services of bed bug removal experts. [3] X Research source"
    },
    {
      "title": "Blot the spots with cold water immediately upon discovery.",
      "content": "Blot the spots with cold water immediately upon discovery. [4] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. Blood stains, bed bug stains, and fecal matter stains all have one thing in common: they're all organic. [5] X Research source Cold water loosens the organic matter so it doesn’t set in the fabric. Warm water, on the other hand, will set bed bug stains. [6] X Research source"
    },
    {
      "title": "Monitor hot spots to prevent reinfestations.",
      "content": "Monitor hot spots to prevent reinfestations. A missed egg or bed bug could result in the return of this pest. Beg bugs tend to congregate in certain areas, so keep an eye on the places the infestation was the worst so you can take action if your problem is on the rebound. [7] X Research source"
    },
    {
      "title": "Pre-treat stains with an enzyme based fabric stain remover.",
      "content": "Pre-treat stains with an enzyme based fabric stain remover. Spray the stain remover directly onto the spots. Check the label of your stain remover to confirm the amount of time you should allow the cleaner to sit. Most products recommend waiting no more than 30 minutes before washing the fabric. These kinds of stain removers can be bought at most general retailers and grocery stores. [8] X Research source"
    },
    {
      "title": "Wash the fabric as you would normally on the “Cold” setting.",
      "content": "Wash the fabric as you would normally on the “Cold” setting. [9] X Expert Source Alicia Sokolowski Green Cleaning Specialist Expert Interview. 15 September 2020. Add your normal amount of detergent and bleach to the washing machine, then insert the fabric and run a complete cycle. The cold setting will keep the proteins in the organic stains loose, increasing the chances of them coming out. [10] X Research source"
    },
    {
      "title": "Spot treat remaining stains with hydrogen peroxide and ammonia.",
      "content": "Spot treat remaining stains with hydrogen peroxide and ammonia. Before you apply hydrogen peroxide, bear in mind that it can sometimes lighten the color of fabric. If stains remain after the washing, apply equal parts peroxide and ammonia directly to the stains and blot them with a clean rag until gone. To prevent unnecessary stress on the fabric, only blot at stains for about 10 to 15 minutes. Any longer may damage the fabric. [11] X Research source"
    },
    {
      "title": "Air dry the fabric, then repeat the cleaning process as necessary.",
      "content": "Air dry the fabric, then repeat the cleaning process as necessary. Keep the fabric out of the sun and away from heat. Once dry, if necessary, clean the fabric same as before: blot stains with cold water, pre-treat them with an enzyme cleaner, wash the fabric on “Cold,” spot treat, then stains will likely be gone. Stains that are especially bad or have set may be impossible to entirely remove. You might be able to lift stains further with another round of cleaning, but this may be rough on the fabric."
    },
    {
      "title": "Dry your laundry on low heat, alternatively.",
      "content": "Dry your laundry on low heat, alternatively. Set your dryer to the lowest heat setting if air drying the fabric isn't an option. Once dry, it’s ready to be put away. Treat bed bug stains in this fashion as soon as possible to prevent them from becoming permanent."
    },
    {
      "title": "Use a dry washcloth to scrub the spots on your mattress dry.",
      "content": "Use a dry washcloth to scrub the spots on your mattress dry. If the stains are fresh and damp, a dry washcloth (or, better yet, a microfiber cloth) will pull up moisture from the stain. Along with the moisture will come blood and bed bug fecal matter, making the stains easier to clean."
    },
    {
      "title": "Spot clean light stains with cold water and hand soap.",
      "content": "Spot clean light stains with cold water and hand soap. You may be able to lift light stains by blotting them with a clean rag dampened with cold water and a dab of hand soap. As the stains lift, switch to a clean portion of rag so it doesn’t spread. [12] X Research source"
    },
    {
      "title": "Treat stubborn stains with hydrogen peroxide and ammonia.",
      "content": "Treat stubborn stains with hydrogen peroxide and ammonia. Mix equal amounts of peroxide and ammonia in a spray bottle and thoroughly mist stains, then blot them with a clean terrycloth rag. Limit peroxide/ammonia treatments to 10 to 15 minutes to prevent damage to the mattress. Sprinkle a fine layer of dry borax on stains that remain following your spray treatment. Rub the borax into the stains lightly with a clean terrycloth rag. [13] X Research source"
    },
    {
      "title": "Reapply the cleaning process as necessary.",
      "content": "Reapply the cleaning process as necessary. Allow the mattress to air dry completely in a shaded area with good airflow. If stains remain when the mattress is dry, spot clean it again with cold water and hand soap, then treat it with peroxide and ammonia until the stains are gone. [14] X Research source Cleaning the stains again in this fashion more than twice could take a toll on the fabric and cause it to fade color or deform. Good airflow will help prevent your mattress from picking up a musty odor and will shorten the amount of time it takes to dry. If you’re in a hurry to dry your mattress, point a fan at it or use a blow dryer set to “Cool.” Always avoid heat when treating bed bug stains. [15] X Research source"
    }
  ]
}