{
  "url": "https://www.wikihow.com/Dress-Like-a-Sixties-Hippie-Girl",
  "title": "How to Dress Like a Sixties Hippie Girl",
  "steps": [
    {
      "title": "Get flowing tops or tie-dye.",
      "content": "Get flowing tops or tie-dye. Find shirts that have full sleeves and drape over the body in a very comfortable and loose-fitting style, like tunics and caftans. Alternatively, go for tie-dye shirts and tank tops, as well as turtlenecks. Choose tops in white or earth tones like brown, green, and tan. It generally wasn’t until later in the hippies movement and the next decade that colors and patterns were brighter. [1] X Research source Try wearing a leotard, undershirt, or other garment meant as activewear or underwear as a top. [2] X Research source Consider going without a bra underneath your shirt, as it was very popular for female hippies to abandon this item of clothing."
    },
    {
      "title": "Go for long or mini skirts and dresses.",
      "content": "Go for long or mini skirts and dresses. Opt for a mini skirt in a shift or a-line cut for a ‘60s look. Or wear a longer, flowing skirt made from cotton or another light material. Choose dresses that are also light and flowing, in earth tones or floral patterns. If you wear a mini skirt, try it with black, colored, or patterned tights on underneath. Floor-length flowing maxi dresses were a popular style, as well as shorter caftan-style dresses with full sleeves. Try dresses and skirts in floral, paisley, or animal print patterns."
    },
    {
      "title": "Pick out denim bellbottoms or corduroys.",
      "content": "Pick out denim bellbottoms or corduroys. Go for bellbottoms with the classic wide leg at the bottom, or simply regular jeans in a relaxed fit. Try pants made of corduroy or crushed velvet as well. Look for earthy colors or jewel tones in pants, like brown, dark green, yellow, or maroon."
    },
    {
      "title": "Find fringe jackets and vests.",
      "content": "Find fringe jackets and vests. Top your outfit with a large vest or suede jacket with fringe on the sleeves and back. Look for nylon, velvet/velveteen, batik, satin, fur, chiffon, hemp, and polyester as popular material for jackets, coats, and tops as well. For warmer layers, try a long maxi coat or poncho. Or for the look that many used to protest and ironize the military in the ‘60s, don a green or camo army jacket."
    },
    {
      "title": "Wear a headband or headscarf.",
      "content": "Wear a headband or headscarf. Fasten a headband or a colorful scarf around your head so that it comes horizontally across your forehead. Use beads, a garland of flowers, braided cord or leather, or anything else you can tie around your head as a headband."
    },
    {
      "title": "Wear a few statement pieces of jewelry.",
      "content": "Wear a few statement pieces of jewelry. Stick to the classic “love beads” and peace symbol trends of the ‘60s, or just go for colorful and bold pieces made of natural materials like wood and leather. Put on an ankle bracelet with bells for a fun and musical addition that was popular in this decade. When in doubt, wear jewelry with a peace sign on it!"
    },
    {
      "title": "Grow out your hair and wear it naturally.",
      "content": "Grow out your hair and wear it naturally. Aim for a goal of the most low-maintenance and natural hairstyle possible, even bordering on messy. Keep it down or in small braids, and grow it out if you can. If you have straight or wavy hair, grow it out as long as possible, part it in the middle, and consider bangs. If you have curly or kinky hair, let it achieve as much volume as possible, whether that’s an afro or a wild mane of curls. Stick a real flower into your hair or create a garland of flowers for your head to finish the look. [3] X Research source"
    },
    {
      "title": "Don some round shades and a big hat.",
      "content": "Don some round shades and a big hat. If you’re out in the sun, go for some big, round sunglasses. Top your head with a kerchief, a wide and floppy sunhat, or a top hat à la Stevie Nicks. Even if you aren’t in the sun, try the John Lennon style of round glasses, which often came in light colors like pink or orange and were less of a functional shade from the sun and more of a fun accessory."
    },
    {
      "title": "Add a large belt.",
      "content": "Add a large belt. Pick a wide leather belt or a chain belt to wear with pants, dresses, or skirts of all kinds. If you don’t have a belt or want to try something different, try using a thin scarf as a belt."
    },
    {
      "title": "Choose leather sandals, boots, or moccasins.",
      "content": "Choose leather sandals, boots, or moccasins. Wear a pair of leather sandals or boots, including cowboy boots. Choose comfortable moccasin flats or boots with plenty of fringe detail. Or, wear no shoes at all! Go barefoot for a true carefree hippie look."
    },
    {
      "title": "Opt for minimal or no makeup.",
      "content": "Opt for minimal or no makeup. Skip the makeup altogether for an easy going hippie look. If you do choose to wear some makeup, stick to an eyeliner pencil to line your eyes and mascara on both top and bottom lashes. Avoid lipstick or heavy foundation, as these are too heavy for the light and natural look of the hippie. Stay away from most perfumes and artificial fragrances. Stick to essential oils like patchouli and sandalwood if you want to wear a scent."
    },
    {
      "title": "Search vintage and thrift stores.",
      "content": "Search vintage and thrift stores. Keep your eye on stores with used clothing or ones that specifically curate vintage clothing from the ‘60s and other decades. If you care to find perfectly authentic items from the decade, do some research into the brand and style to find out when it was made, or ask an expert on vintage clothing to help you authenticate it. Check out garage sales, estate sales, and flea markets for other great options and potential hidden gems."
    },
    {
      "title": "Look online at private sellers.",
      "content": "Look online at private sellers. Check sites like eBay and other online stores where individual sellers advertise their vintage clothing or personal pieces that they’ve held onto since the ‘60s. There are also a number of online stores like ModCloth that bring very retro styles, including hippie style, into modern-day clothing."
    },
    {
      "title": "Make your own tie dye items.",
      "content": "Make your own tie dye items. Tie dye your own shirt , headband, or any other clothing item or accessory using rubber bands or string to tie up white fabric and create patterns with different colored dyes. Create all kinds of patterns with tie dye, like a spiral, stripes, polka dots, or rosettes."
    },
    {
      "title": "Sew your own clothes and accessories.",
      "content": "Sew your own clothes and accessories. If you enjoy making your own clothes or want to learn how, you can pick up your own fabrics in earth tones and floral patterns and use them to follow sewing patterns for the items you want to make, like bellbottoms or mini skirts. Some fabric stores may sell retro sewing patterns, or you can check out online shops or antique malls for those that sell truly vintage patterns straight from the ‘60s!"
    },
    {
      "title": "Modify existing clothes.",
      "content": "Modify existing clothes. Add fringe, embroidery , patches, or beading to the hems, sleeves, and seams of nearly any piece of clothing to give it some extra hippie flair. Make any pair of pants into bellbottoms by cutting open the seam along the outside of the calves and sewing in a triangular piece of fabric. [4] X Research source You can also add fun wide sleeves to a top with a circle of fabric attached to the end of each existing sleeve. If you don’t want to buy clothes or modify your clothes, simply pair different textures, colors and patterns in your wardrobe that you would never ordinarily think to put together. Hippie style means anything goes, as long as you like it!"
    },
    {
      "title": "Emulate a ‘60s icon.",
      "content": "Emulate a ‘60s icon. Get ideas for what to buy and how to wear it by studying some of the women that made hippie fashion popular in the 1960s. Look up images of icons online or in books to get a sense of their styles. Try out the look of tousled hair and big round glasses that Janis Joplin wore, the natural afro and maxi dresses of Marsha Hunt, or the shawls and flowing shirts of Stevie Nicks. Finding a fashion icon can help you narrow down the specific type of hippie style you want to emulate, be it peasant folk singer, blues rocker, or psychedelic babe."
    }
  ]
}