{
  "url": "https://www.wikihow.com/Fish-in-Minecraft",
  "title": "How to Fish in Minecraft",
  "steps": [
    {
      "title": "Make a fishing rod",
      "content": "Make a fishing rod . You'll need three sticks and two pieces of string . Place the sticks in a diagonal line. Place the strings in a vertical line, underneath the sticks."
    },
    {
      "title": "Consider enchanting the rod",
      "content": "Consider enchanting the rod . There are three enchantments that enhance a fishing rod. Unbreaking increases durability, Lure speeds up fishing, and Luck of the Sea increases the chance of getting treasure instead of junk. [1] X Research source Unbreaking is much more common than the other two. Your chance of getting either Lure or Luck of the Sea is about 35% at level 15, and about 53% at level 30. [2] X Research source"
    },
    {
      "title": "Look for a rainy area if possible.",
      "content": "Look for a rainy area if possible. If it's raining over your fishing bobber, it takes about 20% less time to catch something. Unless your rod has Lure, this means you'll catch something every 20 seconds on average, instead of every 25. [3] X Research source Rain falls in all temperate biomes at once. [4] X Research source As long as you've checked one forest, swamp, or plains, you know whether or not it's raining anywhere. If cheats are enabled, enter /weather rain to start a downpour. [5] X Research source"
    },
    {
      "title": "Break everything directly over the block of water.",
      "content": "Break everything directly over the block of water. Once you've chosen a spot to fish in, break all blocks directly above it. If anything blocks sunlight or moonlight from hitting the water, fishing will take twice as long. Anything non-transparent (including leaves) will block light, and anything that blocks movement will block rain. [6] X Research source"
    },
    {
      "title": "Find water.",
      "content": "Find water. It doesn't matter which body of water you fish in. You can even dig a hole and pour a bucket of water in it. It does help to make the hole at least two blocks wide and two deep, so it's easier to cast the line without hitting a solid block. [7] X Research source"
    },
    {
      "title": "Use the rod on the water.",
      "content": "Use the rod on the water. Equip the fishing rod and use it on the water (right-click on the computer edition). The string will fly out with a bobber attached to the end of it. The bobber can hook onto objects and mobs, so watch your aim. If this happens, it takes durability off of your fishing rod."
    },
    {
      "title": "Watch for small splashes.",
      "content": "Watch for small splashes. Initially the bobber will sink, then it will rise to the surface of the water. Watch and listen closely. When you see small splashes around the bobber and hear a splashing noise, immediately use the fishing rod again to reel in the catch. If successful, a fish or other item will fly out of the water and land near your character, along with an experience orb. [8] X Research source You will not see the splashes if particle effects are set to \"minimal\" in your settings. If you miss your chance, the fish will escape. You can leave the bobber in the water to try again."
    },
    {
      "title": "Pick up the item.",
      "content": "Pick up the item. If the item doesn't land nearby, look around. If it hit a solid block when reeled in, it could be off at a right angle somewhere. Here's your chance of getting each type of item with an unenchanted fishing rod: [9] X Research source 85% chance of fish. This is usually just the \"raw fish\" item, but you can also get salmon, clownfish, and pufferfish. Careful: pufferfish are poisonous. 10% chance of junk. These are miscellaneous items like damaged leather boots, tripwire hooks, or ink sacs. 5% chance of treasure. There are six possibilities, all equally likely: a damaged, enchanted bow; a damaged enchanted fishing rod; an enchanted book; a name tag; a saddle; or a lily pad. The items are the same on all editions, but the percentages are only confirmed for Java Edition."
    }
  ]
}