{
  "url": "https://www.wikihow.com/Fill-Gas-in-Canada",
  "title": "How to Fill Gas in Canada",
  "steps": [
    {
      "title": "Look for a gas station when your tank is around half full.",
      "content": "Look for a gas station when your tank is around half full. Keep an eye on your fuel gauge to see how much gas you have left. Start looking for a gas station when your tank is about half full so you have a chance to shop around for the best deal and you aren’t worried about potentially running out of fuel. Check out a few of the stations around you and choose the best option. There are also gas tracking apps such as Gas Buddy, Waze, and the Canadian Automobile Association (CAA), that list stations around you as well as their prices."
    },
    {
      "title": "Park next to a pump and turn off your vehicle’s engine.",
      "content": "Park next to a pump and turn off your vehicle’s engine. Look for an open pump at the gas station and drive up to it. Park so your gas tank is facing the pump and then turn off your vehicle’s engine. If you aren’t sure which side your gas tank is on, look near the gas gauge on your vehicle’s dashboard. There’s a triangle-shaped arrow that points to the side of the car where the gas tank is located. Turning off your engine ensures there isn’t any fire or safety hazard while you refuel. If you’re riding a motorcycle or motorbike, flip out your kickstand after you turn off the engine and fully dismount from your bike so you can safely and easily refuel your bike."
    },
    {
      "title": "Leave your phone in your vehicle and avoid smoking.",
      "content": "Leave your phone in your vehicle and avoid smoking. Never smoke near a pump while you’re filling up so there isn’t a fire hazard. Additionally, cell phones are electrical devices and could be a potential ignition source for the gas fumes, so keep it stowed away while you pump. [1] X Research source It usually only takes a few minutes to fill up, so give the pump your full attention. You can always check your phone when you’re finished!"
    },
    {
      "title": "Insert your credit or debit card if you want to pay at the pump.",
      "content": "Insert your credit or debit card if you want to pay at the pump. If you want to go ahead and just pay for your gas at the pump, take out your credit or debit card and slide it into the appropriate slot. Follow the on-screen instructions to complete the payment process and activate the pump. [2] X Research source Keep in mind you can’t prepay a set amount at the pump. You’ll need to stop pumping yourself or wait until the pump stops on its own once your gas tank is full."
    },
    {
      "title": "Prepay or pay with cash by paying inside the gas station.",
      "content": "Prepay or pay with cash by paying inside the gas station. If you’re paying with cash, or you want to pay a specific amount for gas, head on inside the gas station. Talk to the clerk and tell them how much gas you want and what pump you want it on. Then, you can use a credit card, debit card, or cash to pay for it. For instance, you could say something like, “Can I get $20 on pump 3, please.” You have to prepay a specific amount if you pay for your gas inside."
    },
    {
      "title": "Open up your vehicle’s gas cap.",
      "content": "Open up your vehicle’s gas cap. Locate the cover that conceals your vehicle’s gas cap, which is usually on 1 side of the rear of your vehicle. Open the cover and unscrew the gas cap so you can pump gas into the tank. [3] X Research source You may need to release the gas cap cover from inside your vehicle. If that’s the case, check near the driver’s side door for a lever with a gas symbol on it (it looks like a gas pump). Some modern vehicles have gas caps that open when you open the cover. So there isn’t anything to unscrew."
    },
    {
      "title": "Pick up the nozzle and select your fuel grade.",
      "content": "Pick up the nozzle and select your fuel grade. Grab the handle of the gas nozzle and pick it up out of the pump. Then, press a button to select the type of fuel you want to fill your vehicle with. [4] X Research source There are usually 3-4 types of gas: premium (the most expensive), midgrade, regular, and sometimes diesel. Most cars use regular gas just fine, but some sports cars and SUVs need midgrade or premium (your vehicle’s gas cap should tell you what type of gas to use). [5] X Research source If you have a diesel engine, you have to use diesel fuel or you could damage the engine."
    },
    {
      "title": "Stand by the pump while you refuel.",
      "content": "Stand by the pump while you refuel. Slide the nozzle into the gas tank opening once you’ve selected your fuel type. Squeeze the handle to begin pumping gas into your vehicle. Keep pumping until you’ve pumped enough gas or until your vehicle is full. If you prepaid inside, the pump will slow down and stop on its own. Don’t walk away from the pump until you’re finished to prevent any potential spills or accidents. Some pumps have a latch you can use to keep the gas flowing without having to hold the handle."
    },
    {
      "title": "Replace the nozzle and close your gas cap when you’re finished.",
      "content": "Replace the nozzle and close your gas cap when you’re finished. Slide the nozzle out of the gas tank and replace it back on the pump. Screw your gas cap back on, close the cover until it clicks shut, and you’re all set! [6] X Research source If your gas cap doesn’t screw on, you only need to close the gas cover and you’re good to go. Once you replace the nozzle, the pump will print a receipt if you used a credit or debit card to pay at the pump."
    }
  ]
}