{
  "url": "https://www.wikihow.com/Face-Pull",
  "title": "How to Face Pull",
  "steps": [
    {
      "title": "Find a cable pulley machine.",
      "content": "Find a cable pulley machine. The best equipment for a face pull is a cable pulley machine, which should be available at any local gym. [1] X Research source A cable pulley machine is a tall piece of exercise equipment with a series of weights attached to an adjustable pulley designed for exercising muscles in your arms and back. It will allow you to easily adjust the size of the weight you’ll be lifting, as well as the height of the pulley mechanism. [2] X Research source If you don’t have access to a cable pulley machine, you can use a long resistance band attached to something sturdy a little above the height of your head. [3] X Research source This will be less customizable than the cable pulley machine but may be easier to access on a regular basis."
    },
    {
      "title": "Equip the rope attachment.",
      "content": "Equip the rope attachment. The rope attachment for the cable pulley machine is a short length of rope with a weight on either end and a point to attach it in the middle. Open the carabiner on the machine and clip on the rope attachment. [4] X Research source Always take care of the equipment you’re using. If there’s a different attachment already on the machine, make sure to put it back with the other attachments when you equip the rope attachment."
    },
    {
      "title": "Adjust the pulley to be a little above the height of your head.",
      "content": "Adjust the pulley to be a little above the height of your head. There will normally be a handle or some other mechanism on the side of the pulley rig that you can disengage and engage to adjust the height of the pulley. [5] X Research source Shift the pulley so that it is just above the height of your head before locking it in place."
    },
    {
      "title": "Equip a weight around 30 pounds.",
      "content": "Equip a weight around 30 pounds. Face pulls don’t require a heavy weight in order to get the workout you need. [6] X Research source Adjust the pin on the weights so that you can easily lift them with only the movement of your arms.The right weight will change from person to person, so start around 30 pounds (14 kg) and add more weight as needed. If you try and do a face pull with too much weight equipped, you’ll end up engaging muscles in your arms and lower back and increase the risk of injury."
    },
    {
      "title": "Grasp one end of the rope in each hand.",
      "content": "Grasp one end of the rope in each hand. Firmly grasp the ends of the rope so that the weights on either end face toward you. [7] X Research source Take a few steps backward until your arms are fully extended toward the machine."
    },
    {
      "title": "Stand with your feet shoulder width apart and your knees bent.",
      "content": "Stand with your feet shoulder width apart and your knees bent. Find a firm stance with your knees slightly bent so that you won’t be pulled around by the machine. Lean back around 20 degrees so all of the work is being done by your arms and shoulders rather than your back. [8] X Research source If you find this stance difficult to maintain or start feeling pain in your lower back as you exercise, you might need to adjust your stance. Try shifting to a slightly staggered stance with one foot behind the other. [9] X Research source"
    },
    {
      "title": "Pull the ropes towards your face.",
      "content": "Pull the ropes towards your face. Pull the two ropes toward your face, separating your hands and moving them around the side of your head as they get close. [10] X Research source Don't raise or pinch the shoulders together—instead, broaden your shoulders as your elbows drive back. When holding onto the ropes, rotate your arms at a 90-degree angle. Your elbows should be positioned at shoulder height as you pull the ropes. Always keep your elbows high and your wrists above your elbows when pulling the rope backward. Straying too much from this can change the muscles being targeted by the exercise. [11] X Research source"
    },
    {
      "title": "Reverse the movement and repeat.",
      "content": "Reverse the movement and repeat. Hold the ropes on either side of your face for around 1 second, before slowly returning to your initial position by reversing the pulling movement. [12] X Research source Take about 8 seconds to the control the negative when returning the ropes to the beginning position. As face pulls are designed to slowly exercise your muscles with lighter weights, you should do two sets of 20 reps at the end of a back workout. [13] X Research source Over time, you may need to add more weight, but you shouldn't need to add more reps or sets."
    },
    {
      "title": "Exercise your rear deltoids and trapezius muscles.",
      "content": "Exercise your rear deltoids and trapezius muscles. Face pulls are designed to work the muscles in and around the shoulder blades, so you should be feeling the exercise here rather than anywhere else. If you are working your biceps or lower back instead, revisit your posture, stance and underhand grip until you feel it in your shoulders. [14] X Research source"
    },
    {
      "title": "Move slowly for each rep.",
      "content": "Move slowly for each rep. It’s more important to move slowly and make sure you are exercising the right muscles than to power through quickly and risk injury. Do a set of around 20 reps slowly, making sure to pull the ropes all way back and fully stretch your rear delts each time. [15] X Research source"
    },
    {
      "title": "Lean backward rather than forward.",
      "content": "Lean backward rather than forward. As you work through your face pulls, you might feel yourself starting to lean forward while you pull. [16] X Research source This might indicate that you have equipped too many weights or are working the wrong muscles. Always make sure you are leaning slightly backward rather than forward."
    },
    {
      "title": "Check that your form is correct.",
      "content": "Check that your form is correct. To make sure your form stays correct as you face pull, get a friend or trainer to keep an eye on you and make sure you’re not making any mistakes. You can also set up a camera or leave your phone to record you exercising. You can then review the footage after each set and see where you might be able to revise your form."
    }
  ]
}