{
  "url": "https://www.wikihow.com/Get-Soft-Hands",
  "title": "How to Get Soft Hands",
  "steps": [
    {
      "title": "Moisturize your hands with lotion.",
      "content": "Moisturize your hands with lotion. Lotion is the easiest and most important way to keep your hands soft. At the store, lotion is available in dozens of scents and styles to meet your personal needs. Moisturize your hands every time you wash them. Keep small bottles at regular places around the house, so you always have some on hand. [1] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 Look for lotions that contain shea butter, B vitamins, and retinol. These ingredients keep your skin soft long after you’ve applied the lotion. Mineral oils and lanolin help to trap water in the skin. Lotions with lactic acid and urea have soothing qualities, as well. Glycerin and dimethicone help to moisturize, while hyaluronic acid can help retain that moisture."
    },
    {
      "title": "Treat your hands with natural oils.",
      "content": "Treat your hands with natural oils. If you don't want to buy lotion, you can also use natural oils to rub into your hands, just as you would regular lotion. [2] X Research source A very small amount goes a long way, as well, making this a cheap alternative. All of the following natural oils are used in cooking, but are nourishing and healthy for skin, nails, and hair when applied regularly: Avocado Almond Aloe vera gels Coconut Cocoa butter Sunflower Olive"
    },
    {
      "title": "Make your own sugar scrub.",
      "content": "Make your own sugar scrub. Exfoliant scrubs are usually just moisturizing lotion with some grit in it, included to help scrub off dead skin. These are available in most beauty supply and drugstores, but you can make your own for cheap at home: Combine a few tablespoons of white sugar with olive oil or coconut oil to form a paste, and rub it into your hands for two minutes. Rinse with warm water, and you should be left with hands that are much softer than prior to your scrub. [3] X Research source If you like, add a few drops of peppermint or lavender essential oil to add a nice smell to the lotion. If you don't want to use sugar, use grated beeswax or salt."
    },
    {
      "title": "Condition your hands every few weeks in winter.",
      "content": "Condition your hands every few weeks in winter. When the temperature drops, your skin suffers. If you live in a cold area, use a deep-conditioning treatment with an old pair of socks to keep your hands soft. It's simple and effective: Heat of a pair of clean socks in the microwave for 15 seconds. Put a generous amount of your favorite lotion on your skin, but don't rub it in. Put the socks on your hands, and let your hands soak it all in for 10-20 minutes. Remove the socks and continue rubbing in the remaining lotion. You can do this and leave the socks on overnight to help with extra dry skin. While it might seem weird, socks are usually better and easier to clean than gloves."
    },
    {
      "title": "Use deep-conditioning salve when necessary.",
      "content": "Use deep-conditioning salve when necessary. If your hands are peeled and cracking, bring out the big guns. Use a conditioning hand salve, like Bag Balm, or a similar product. These are gel-like creams used for healing deeply dry skin. Rub it into your knuckles, palms, and other problem spots for several days until your skin has softened."
    },
    {
      "title": "Take a moisturizing supplement.",
      "content": "Take a moisturizing supplement. A recent study revealed that flax and borage supplements helped increase moisture and decrease roughness in skin. These fatty acids are found in most well-balanced diets, but if you're struggling with extremely dry skin, a supplement of flaxseed, borage oil, or evening-primrose might be effective in helping to control it. [4] X Research source"
    },
    {
      "title": "Avoid petroleum jelly and lemon juice.",
      "content": "Avoid petroleum jelly and lemon juice. It's a common home remedy to use petroleum jelly or lemon juice on to dry skin to soften it up, but both of these should generally be avoided when you're treating dry skin, in favor of other more nourishing remedies. Neither is recommended by the medical community. [5] X Research source Petroleum jelly actually acts as a moisture-barrier, not a moisturizer. While it is effective in preventing chaffing and \"locking moisture in,\" it's not a moisturizer, and won't treat dry hands alone. There's some controversy about whether or not lemon juice can be used to exfoliate skin and soften it, or whether or not the citric acid in the lemon juice acts more as an irritant. [6] X Research source Never apply lemon juice if you're going to be exposed to the sun, because it makes your skin prone to burning."
    },
    {
      "title": "Use gentle, natural hand soaps.",
      "content": "Use gentle, natural hand soaps. Washing your hands regularly is beneficial for good hygiene, but it can also seriously dry your skin out. Find soaps that are skin-sensitive and contain moisturizing ingredients such as jojoba or olive oil, which nourish and heal dry hands. [7] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 Avoid alcohol and glycerine-based hand sanitizers, which dry out the skin on your hands. Sub out regular body wash or soap for something with moisturizing ingredients as well, so that you aren’t damaging your hands in your regular showers."
    },
    {
      "title": "Avoid extremely hot water.",
      "content": "Avoid extremely hot water. Very hot water can actually burn your skin and dry out your hands. [8] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 It might not be recognizable as a \"burn,\" but if your skin turns slightly red in the sink or bath, the water is too hot."
    },
    {
      "title": "Use dish gloves when you wash dishes.",
      "content": "Use dish gloves when you wash dishes. Dish soap is one of the most aggressive and irritating forms of soap for your hands. When you wash dishes, especially in the wintertime, it's a good idea to use a pair of yellow dish gloves to keep your hands dry. This is very true if you're submerging your hands in the water."
    },
    {
      "title": "Wear gloves outside.",
      "content": "Wear gloves outside. If you’re outside a lot, do what you can to keep your skin soft even when facing nasty weather. In the fall and winter months, wear gloves to protect your hands from the wind."
    },
    {
      "title": "Wear sunscreen.",
      "content": "Wear sunscreen. Your hands are just as susceptible to the damages of the sun as the other parts of your body that are exposed. While most people don't want to wear gloves in the summer time, go for sunscreen instead. [9] X Research source Go for as high an SPF rating as you can get. If you're out in the sun, there's little point in wasting time with anything rated less than 20."
    },
    {
      "title": "Stay well hydrated.",
      "content": "Stay well hydrated. If you're not getting enough water, your skin will dry out. Diet plays a big role in your skin health, making it important that you get at least 8 glasses, or around two liters of water each day. [10] X Research source Alcohol can dehydrate you, which can in turn result in dryer skin. If you struggle with dry skin, avoid the overconsumption of alcohol."
    },
    {
      "title": "Mix together a bit of hair shampoo, conditioner and lotion in a bowl or in your hand.",
      "content": "Mix together a bit of hair shampoo, conditioner and lotion in a bowl or in your hand."
    },
    {
      "title": "Add in a bit of handwash or liquid soap and stir using your finger or a spoon.",
      "content": "Add in a bit of handwash or liquid soap and stir using your finger or a spoon."
    },
    {
      "title": "Put the mixture into your hands and rub until it is evenly distributed.",
      "content": "Put the mixture into your hands and rub until it is evenly distributed."
    },
    {
      "title": "Using a towel, get as much as you can off of your hands.",
      "content": "Using a towel, get as much as you can off of your hands. Remember to wash the towel once you're done."
    },
    {
      "title": "Leave your hands like that for half an hour.",
      "content": "Leave your hands like that for half an hour."
    },
    {
      "title": "After the time has passed, you hands should feel weird and a bit sticky.",
      "content": "After the time has passed, you hands should feel weird and a bit sticky. Go to the sink."
    },
    {
      "title": "Put some lotion and hand-wash in your hands and rub.",
      "content": "Put some lotion and hand-wash in your hands and rub."
    },
    {
      "title": "Wash your hands and then pat them down with a towel.",
      "content": "Wash your hands and then pat them down with a towel."
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy!"
    }
  ]
}