{
  "url": "https://www.wikihow.com/Dua-for-when-in-Pain",
  "title": "The Best Duas for Pain Relief",
  "steps": [
    {
      "title": "Dua for pain anywhere in your body",
      "content": "Dua for pain anywhere in your body If you’re feeling general pain in your body, place your hand on the area where you feel the pain. Say (3 times) بِسْمِ اللهِ and (7 times) أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ Pronunciation: “Bismallah” 3 times and “A’udhu billahi wa-qudratihi min sharri ma ajidu wa-uhaziru” 7 times. [1] X Research source In English, this translates to “In the name of Allah, I seek refuge with Allah and with His power from the evil that I find and that I fear.” [2] X Research source The Dua invocation emphasizes the belief that faith and trust in Allah can heal suffering. Muslims are encouraged to recite these prayers with faith and hope, affirming their trust in Allah's mercy and divine assistance. [3] X Research source"
    },
    {
      "title": "Dua for tooth pain",
      "content": "Dua for tooth pain First, perform the Islamic ritual of ablution, a cleansing washing. Then, place your hand on the area of pain and recite: ذْهِبِ الْبَأْسَ رَبَّ النَّاسِ اشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاوُكَ شِفَاءٌ لَا يُغَادِرُ سَقَمَاً Pronunciation: “Azhibi al-ba’sa Rabb an-naas ishf Anta ash-Shaafi, laa shifa’a illa shifa’uka, shifa’an laa yughadiru saqaman.” In English, this translates to “O Lord of the people, remove this pain and cure it. You are the one who cures, and there is no healing except Your healing—a healing that leaves no ailment behind.” Gently massage the painful area in circular motions while reciting the dua to enhance the effectiveness."
    },
    {
      "title": "Dua for stomach pain",
      "content": "Dua for stomach pain For pain inside or around the stomach, recite: یَا اَﷲُ، یَا اَﷲُ، یَا اَﷲُ، یَا رَحْمٰنُ، یَا رَحِیْمُ، یَا رَبَّ الْاَرْبَابِ یَا اِلٰہَ الْاٰلِہَۃِ یَا مَلِکَ الْمُلُوْکِ یَا سَیِّدَ السَّادَاتِ اشْفِنِیْ بِشِفَآئِکَ مِنْ کُلِّ دَآءٍ وُ سُقْمٍ فَاِنِّیْ عَبْدُکَ وَابْنُ عَبْدَیْکَ فَاَنَا اَتَقَلَّبُ فِیْ قَبْضَتِکَ [4] X Research source This dua translates to:”O Allah! O Allah! O Allah! O the Beneficent! O the Merciful! O the Lord of the Lords! O the Master of the Masters! O the King of the Kings! O the chief of the Chiefs! Cure me from all the diseases and grant me strength from all the ailments by Your cure, that I am Your creature and son of Your Creature and I walk and move by Your power.” [5] X Research source"
    },
    {
      "title": "Dua for headaches",
      "content": "Dua for headaches In the hadith recorded in Sahih Muslim (2202), it was narrated that Uthman Al-Thaqafi complained to the Prophet (peace be upon him) about a specific pain. The Prophet then instructed him to place his right hand on the site of the pain and recite the following specific supplication (dua): أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ [6] X Research source"
    },
    {
      "title": "Dua for ear pain",
      "content": "Dua for ear pain In the Quran, Yunus b. Zabyan said he complained to Abu 'Abd Allah about pain in one of his ears (al-udhun). Abu 'Abd Allah instructed him: \"Place your hand over it, and say seven times: 'I take refuge in Allah, in Whom trust that which is on the land and in the sea, in the heavens and the earth; and He is All-hearing, All-knowing.' It will be cured, Allah, the Exalted, willing.\" [7] X Research source"
    },
    {
      "title": "Dua for pain in the eye",
      "content": "Dua for pain in the eye A passage in the Quran states that man sought the counsel of Abu 'Abd Allah al-Sadiq, complaining of navel (al-surra) pain. Al-Sadiq advised the man to place his hand on the painful area and recite the following verse three times: \"Surely it is a Book Sublime. Falsehood comes not to it from before it nor from behind it. A revelation from One All-wise, All-laudable\" (41:41-42). [8] X Research source"
    },
    {
      "title": "Dua for pain in the back",
      "content": "Dua for pain in the back Back pain in covered in the Quran when a man from Hamdan complained to Amir al-Mu'minin of a painful back that was causing him sleepless nights. The man said, \"Put your hand on the area that pains me and recite the following three times: \"It is not given to any soul to die save by the leave of God, at an appointed time. Whoever desires the reward of this world, We will give him of this. Whosoever desires the reward of the other world, We will give him of that. We will recompense the thankful' (3:145).\" [9] X Research source"
    },
    {
      "title": "Dua for sciatica",
      "content": "Dua for sciatica From Amir al-Mu'minin, it was reported that one of his companions had complained to him about sciatica (known as 'irq al-nisa'). In response, Amir al-Mu'minin provided the following supplication to be recited three times: \"In the Name of the Merciful, the Compassionate. In the Name of Allah, and by Allah, I take refuge in the Name of Allah, the Great, and I take refuge in the Name of Allah, the Mighty, from the evil of every throbbing blood vessel ('irq nuqqar), and from the evil of the heat of the fire.\" [10] X Research source"
    },
    {
      "title": "Dua for when you’re sick",
      "content": "Dua for when you’re sick Whenever you are feeling sick or suffering from pain from an illness, a great dua goes as follows: رَبُّنَا اللَّهُ الَّذِي فِي السَّمَاءِ تَقَدَّسَ اسْمُكَ أَمْرُكَ فِي السَّمَاءِ وَالأَرْضِ كَمَا رَحْمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الأَرْضِ اغْفِرْ لَنَا حُوبَنَا وَخَطَايَانَا أَنْتَ رَبُّ الطَّيِّبِينَ أَنْزِلْ رَحْمَةً مِنْ رَحْمَتِكَ وَشِفَاءً مِنْ شِفَائِكَ عَلَى هَذَا الْوَجَعِ فَيَبْرَأُ [11] X Research source Pronunciation: “Rabbuna Allahul-ladhi fissamaa'i taqaddas ismuka. Amruka fissamaa'i wal-ard, kamaa rahmatuka fissamaa'. Faj'al rahmataka fil-ard. Ghfir lanaa houbanaa wa khataayaana. Anta Rabbut-tayyibeen. Anzil rahmatan min rahmatika wa shifa'an min shifaa'ika 'ala hadhal waja' fa yabra'u.” [12] X Research source English translation: “Whoever among you is facing any ailment, say: 'Our Lord is Allah, who is in heaven, hallowed be Your name. Your command prevails in heaven and earth, and Your mercy in heaven, extend Your mercy to the earth. Forgive our sins and mistakes. You are the Lord of the righteous. Send down healing from Your mercy and a cure from Your remedies upon this pain so that it may be healed.”"
    },
    {
      "title": "Dua for protection from disease",
      "content": "Dua for protection from disease Disease and illness can come with a lot of pain, so to protect yourself from disease, say, اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الأَسْقَامِ [13] X Research source Pronunciation: “Allahumma inni a’uzubika minal baros, wal junuun wal juzzam, wa min sayyi’il-asqam.” [14] X Research source English translation: “O Allah, I seek refuge in You from leprosy, madness, elephantiasis, and evil diseases.” [15] X Research source"
    },
    {
      "title": "Protection from any kind of harm",
      "content": "Protection from any kind of harm The Messenger of Allah said to recite three times every morning and evening: بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ [16] X Research source “Pronunciation: “Bismillahil-ladhi la yadurru ma'as-mihi shai'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.” English translation: “In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All-Knowing nothing will harm him.\""
    },
    {
      "title": "Dua for anxiety",
      "content": "Dua for anxiety When dealing with anxiety, recite: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحُزْنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ [17] X Research source Pronunciation: \"Allaahumma ‘innee ‘a’oothu bika minal-hammi walhazani, wal’ajzi walkasali, walbukhli waljubni, wa dhala’id-dayni wa ghalabatir-rijaal.\" English Translation: \"O Allah, I take refuge in you from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being overpowered by men.\""
    },
    {
      "title": "Dua for anger",
      "content": "Dua for anger For anger, an excellent dua to recite is: اللَّهُمَّ أَذْهِبْ غَيْظَ قَلْبِي [18] X Research source Pronunciation: \"Allahumma azhib Gaydha Qalbee.\" English translation: \"Oh Allah, remove anger from my heart.\""
    },
    {
      "title": "Dua for depression",
      "content": "Dua for depression To combat depression, recite: اللهم اخرجني من الظلمات إلى النور [19] X Research source Pronunciation: \"Allahumma Akhrijnee min aldulumaat ilaa alnur.\" English translation: \"Oh Allah take me out of darkness and into the light.\""
    }
  ]
}