{
  "url": "https://www.wikihow.com/Cook-Spam",
  "title": "How to Cook Spam",
  "steps": [
    {
      "title": "Choose a flavor of spam to cook.",
      "content": "Choose a flavor of spam to cook. You're probably familiar with the salty flavor of classic spam, but did you know that there are other spam products to pick from? Consider cooking with any of these flavors: [1] X Research source Bacon Oven-roasted turkey Hickory smoke Hot and Spicy Jalapeno Teriyaki Black pepper Chorizo"
    },
    {
      "title": "Keep cans of spam in the pantry and refrigerate opened spam.",
      "content": "Keep cans of spam in the pantry and refrigerate opened spam. If you haven't opened your can of spam, store it in the pantry at room temperature and use it before the expiration date listed on the package. Once you open the can, refrigerate the spam and use it within 3 to 5 days. You should also refrigerate any leftover spam that you've baked, fried, or cooked. Use them within 3 to 5 days."
    },
    {
      "title": "Cut or slice the spam for most recipes.",
      "content": "Cut or slice the spam for most recipes. Open the can and slide the spam out onto a cutting board. Then use a knife and carefully cut the spam into slices or cubes. You can slice or chop the pieces into any size you like. [2] X Research source If you're going to bake the spam, consider leaving it whole. Then you can roast it and slice it once it's hot throughout."
    },
    {
      "title": "Heat the spam for up to 5 minutes.",
      "content": "Heat the spam for up to 5 minutes. If you're slicing or chopping the spam, it will reheat quickly. You can microwave or stir-fry the spam until it's hot throughout. This should take up to 5 minutes if you're heating spam on the stove. If you're microwaving it, heat the spam for 30-second increments until it's hot."
    },
    {
      "title": "Scramble eggs with cubed spam for a quick breakfast.",
      "content": "Scramble eggs with cubed spam for a quick breakfast. Whisk 4 eggs with 1 ⁄ 4 cup (59 ml) of milk and pour it into a skillet. Heat the eggs over medium-high heat and stir occasionally until they set. Then scoot the eggs to one side of the skillet and add a can of diced spam to the empty side of the skillet. Cook the spam for a few minutes so the spam gets hot. Serve the eggs and spam with toast or biscuits. [3] X Research source You could use sliced spam instead of cubed spam. For garnish, sprinkle chopped chives over top."
    },
    {
      "title": "Cook spam, eggs, and cold rice to make spam fried rice.",
      "content": "Cook spam, eggs, and cold rice to make spam fried rice. Heat a little oil in a skillet over medium-high heat and cook a can of diced spam along with your choice of vegetables. Stir in 2 cups of cooked rice and cook the mixture until the rice is hot throughout. Drizzle a little soy sauce over the fried rice just before serving. [4] X Research source For extra protein, add 2 beaten eggs and scramble them until they're as cooked as you like."
    },
    {
      "title": "Stir-fry spam with garlic and noodles for a simple meal.",
      "content": "Stir-fry spam with garlic and noodles for a simple meal. Slice 1/2 of a can of spam into strips and cook them in a skillet over medium-high heat for 3 to 4 minutes. Stir in 1 clove of minced garlic and fry it for about 30 seconds. Then toss in 1 pound (450 g) of cooked ramen. Season the noodles with garlic oil and soy sauce according to your taste. [5] X Research source You can easily double this recipe if you'd like to make 2 servings."
    },
    {
      "title": "Toss stir-fried green beans with spam for a filling side dish.",
      "content": "Toss stir-fried green beans with spam for a filling side dish. Heat a drizzle of oil in a skillet over medium-high heat. Cook and stir 1 can of cubed spam along with a little ground or fresh ginger. Then mix in trimmed string beans and cook them for 3 to 5 minutes so the beans soften. Instead of seasoning the stir-fry with salt, use soy sauce."
    },
    {
      "title": "Make twice-baked potatoes with spam.",
      "content": "Make twice-baked potatoes with spam. Bake about 6 russet potatoes in the oven until they're soft in the center. This should take about 1 hour at 375 °F (191 °C). Then remove the potatoes and cut them in half lengthwise. Scoop out the centers and mash them with salt and pepper. Stir in a can of diced spam and fill the potato skins with the mixture before serving them. [6] X Research source For extra flavor, sprinkle the tops of the filled potatoes with shredded cheese, such as cheddar or pepperjack."
    },
    {
      "title": "Wrap dough around spam and roast it to create spam wellington.",
      "content": "Wrap dough around spam and roast it to create spam wellington. Instead of using expensive beef and puff pastry, push 2 whole spams on a baking sheet so they're touching. Sprinkle about 1/2 cup (100 g) of brown sugar over them and cover the spam with a can of biscuit dough. Bake the spam wellington at 350 °F (177 °C) for 30 minutes. [7] X Research source The spam wellington should be golden brown once it's finished cooking. Let the spam wellington rest for 10 minutes so the hot glaze doesn't burn you."
    },
    {
      "title": "Add chopped spam to your favorite casserole.",
      "content": "Add chopped spam to your favorite casserole. For a flavorful pasta dish with more protein, dice a can of spam into small pieces and stir it into your prepared noodles. Consider using the spam in tuna noodle casserole, macaroni and cheese, or carbonara. [8] X Research source Stir diced spam into cold noodle dishes as well. For example, add it to cold pasta salad."
    },
    {
      "title": "Bake a filling breakfast pizza with spam and eggs.",
      "content": "Bake a filling breakfast pizza with spam and eggs. Lay refrigerated pizza dough into a deep-dish pizza pan or skillet and bake it for 10 minutes at 350 °F (177 °C). Then whisk 5 eggs with 1 ⁄ 4 cup (59 ml) of milk and pour it into the baked crust. Bake it for another 10 minutes so the eggs set. Sprinkle diced spam and your choice of toppings over the breakfast pizza and bake it for 3 to 5 minutes. [9] X Research source For toppings, try shredded cheese, sliced tomatoes, chopped onion, or sliced olives."
    },
    {
      "title": "Slice spam to make a classic spam sandwich.",
      "content": "Slice spam to make a classic spam sandwich. One of the simplest sandwiches to make with spam is spam between 2 pieces of buttered bread. Slice the spam and warm it in the microwave or in a skillet until it's hot throughout. Then butter 2 pieces of bread and layer the spam in between them. [10] X Research source If you prefer, you don't have to heat the spam since it's already cooked. Try adding a slice of spam to your next grilled cheese sandwich."
    },
    {
      "title": "Replace eggs, chicken, or tuna to make a spam salad sandwich.",
      "content": "Replace eggs, chicken, or tuna to make a spam salad sandwich. Instead of making a cold egg, chicken, or tuna salad sandwich, replace the protein with a can of diced spam. Mix the diced spam with pickle relish, mayonnaise, and your favorite seasonings before spreading it on bread. You can also serve the spam salad with crackers or vegetable sticks."
    },
    {
      "title": "Grill sliced spam to create a spamburger.",
      "content": "Grill sliced spam to create a spamburger. Instead of grilling a ground beef patty, open a can of spam and slice it into 4 equal pieces. Heat your gas or charcoal grill to medium-high and lay the spam slices on the grate. Grill the spam for 5 to 7 minutes and use tongs to turn them about halfway through the cooking time. Then arrange 1 slice between a hamburger bun and serve it with your favorite condiments. [11] X Research source Try classic burger condiments, such as ketchup, mustard, relish, and cheese. You can also top the burger with flavorful ingredients such as sauerkraut or kimchi."
    },
    {
      "title": "Create a Hawaiian spamburger with pineapple and hot sauce.",
      "content": "Create a Hawaiian spamburger with pineapple and hot sauce. For a burger with salty-sweet flavor, grill 4 slices of spam until they're hot throughout. While the spam is grilling, spread mayonnaise and a squirt of hot sauce, such as sriracha, on a bun. Then place a hot slice of spam on it. Top it with a piece of Swiss cheese and press the other bun on top. [12] X Research source For spamburger that's even more filling, you can also put a standard ground beef patty between the buns."
    }
  ]
}