{
  "url": "https://www.wikihow.com/Discuss-the-Negative-Aspects-of-Religion",
  "title": "How to Discuss the Negative Aspects of Religion",
  "steps": [
    {
      "title": "Understand what religion is.",
      "content": "Understand what religion is. Religion is a system that establishes symbols, narratives, and traditions that relate humanity to spirituality and moral values. The word religion is often used interchangeably with faith or belief in God, but religion differs from personal belief in that it has a public aspect. Basic belief in the God of Abraham would be theism. Catholicism would be the religion."
    },
    {
      "title": "Don't open a discussion about religion without ensuring you have a good understanding of how organized religion works.",
      "content": "Don't open a discussion about religion without ensuring you have a good understanding of how organized religion works. At the very least you should have an understanding of the main Christian religious ideologies (Catholicism, Presbyterianism/Protestantism, Immersionism) and hold an understanding of Islam and Judaism as these are the most discussed religions."
    },
    {
      "title": "Purchase books and reference material for research; Books like God is Not Great by Christopher Hitchens, The Moral Landscape by Sam Harris, Breaking the Spell:",
      "content": "Purchase books and reference material for research; Books like God is Not Great by Christopher Hitchens, The Moral Landscape by Sam Harris, Breaking the Spell: Religion as a Natural Phenomenon by Daniel Dennett, and others. Having an understanding of the history of various religions and counter arguments to points about morality is important."
    },
    {
      "title": "Understand some of the basic arguments against organized religion.",
      "content": "Understand some of the basic arguments against organized religion. General Religion: Lack of personal thought: When you subscribe to a religion, you substitute group-think for focused, independent thought. Instead of learning to discern truth on your own and formulate your own beliefs, you’re told what to believe. Fixed perspective: By saying “I am a Catholic” or “I am a Buddhist” you rob yourself of spiritual depth perception and attach blinders that do not allow you to see all realities. Lack of power: Religions are authoritarian hierarchies where power is heaviest at the top and lightest at the bottom where the majority of believers are. Religions are very good at turning human beings into sheep. They operate by eroding your trust in your own intellect and gradually convince you to put your trust into some external entity, such as a deity, or great book, convincing you that without these you would be lost. Wasted time: Religions often dictate that you have to pray, attend church, and read religious texts regularly. Some people take this even further with memorization of religious texts or other time consuming activities. Forgo intelligence or become a hypocrite: When you subscribe to an organized religion, you have only two options: You can forgo intelligence, or you can become a hypocrite. You either willingly believe everything decreed to you by the religion (for example, believing that the earth is only 6,000 years old) or you can recognize that many parts of religion are nonsense but believe it to be infallible all the same. Where you're born has a lot to do with your religion: Born in North America? Chances are you follow a Judo-Christian religion. Born in India? Maybe you're a Hindu. Born in Tibet? Could be a Buddhist. If you were born somewhere else, to some different set of circumstances do you think you still would have found your way to your religion? Or are your current beliefs really just a by-product of your environment and not a conscious choice you made. Religion rules with fear: Fear of hell, fear of excommunication, fear of disappointing one's parents, fear of abandoning the community, fear of being different. When you practice organized religion instead of conscious decision making, you live under a constant fear. Eventually you forget it's even there. Christian Religions: Pick and choose your morality: Christian morality changes over time and is interpreted differently by different Christian sects. Individual Christians disagree among each other over what they think is God's moral law. [2] X Research source Most Christian religions take their morality from the Bible but like the pick and choose what is relevant and what can be ignored. Homosexuality? Wrong, the gays are going to hell because the book of Leviticus says so. [3] X Research source Leviticus 18:22 Poly-cotton T-Shirts? The book of Leviticus says those are bad too but that was a different time, it's not relevant any more. [4] X Research source Leviticus 19:19 Intolerance is rampant: Far too many Christians assume that atheists can’t be moral or are morally defective. After a former Christian deconverts long standing Christian friends or family members occasionally decide without reason the former Christian isn't or can't be moral any more. [5] X Research source Violence: Although many atrocious acts have been carried out by individual believers violence in Christianity has also been sanctioned by religions as a whole. From the crusades to the inquisition to witch hunts, many lives have been taken in the name of God and Christianity. Forced teaching of religious ideas: Nowhere is this more prevalent then in the USA where to this day debates still rage about whether or not evolution should be taught in public schools. Specific to Catholicism: AIDS and unwanted pregnancy are God's will: In parts Africa where there is a serious AIDS problem (in some cases as many as three out of every four people) and many families are unable to care for the children that they already have The Catholic Church continues to maintain their position that condoms are bad putting further lives at risk and bringing more impoverished children into the world. Sexual abuse scandals: Among the morally questionable activities of some of the catholic clergy have been the physical and sexual abuse of persons in their custody. For decades the church covered up the abuses. Abuse victims were told to keep quiet or be excommunicated and the abusers were in most cases moved to other locations. [6] X Research source Rachel Donadio. \"Vatican Revises Abuse Process, But Causes Stir.\" The New York Times. July 16, 2010, A1, A3 [7] X Research source Islam: Violence: Although the majority of adherents are peaceful, those who do choose to commit acts of violence and terror in the name of Allah will find ample justification for their actions in the Qur'an and the sayings and examples of the prophet Muhammad. [8] X Research source Human rights issues: The greatest obstacle to human rights under Political Islam is its strong adherence to Sharia law. Many aspects of the Sharia are at odds to the ideas enshrined in the Universal Declaration of Human Rights. In an Islamist state no individual or group can have any rights that do not conform to the tenets of the Sharia. Death for Apostates: \"Apostasy in Islam (Arabic: ارتداد, irtidād or ridda‎) is commonly defined in Islam as the rejection in word or deed of their former religion (apostasy) by a person who was previously a follower of Islam.\" [9] X Research source Freedom of belief is enshrined in Islamic texts however there is disagreement among Muslim scholars as to the limits of that freedom. For example, Afghan Abdul Rahman, who converted to Christianity, faced the death penalty for his apostasy and it was not an isolated incident. [10] X Research source Women's Rights: Muslim proponents never tire of telling everyone that will listen that Islam has given more rights to women than any other religion. Certainly, if by \"Islam\" they mean \"Qur'anic Islam\" the rights that it has given to women are impressive. However, Islamic Law is not derived solely from the Quran and many of Muhammad's extra-Quranic sayings (the Hadith) appear to curtail women's Human Rights severely. For example, Muslims who practice female genital mutilation cite authentic ahadith to support the practice (Muhammad encouraged it as he believed it was 'more pleasurable for the husband'). Furthermore, a review of Muslim history will bring to light many areas in which - Qur'anic teaching aside - women continue to be subjected to diverse forms of oppression. Muslim societies, in general, appear to be far more concerned with trying to control women's bodies and sexuality than with their human rights."
    },
    {
      "title": "Be aware that there are a number of positive contributions made to society by religion.",
      "content": "Be aware that there are a number of positive contributions made to society by religion. Religion enhances local communities in which human relationships can flourish, religious communities make massive contributions through deeds of charity and social action, and religion can give people a sense of community and make people feel welcome."
    },
    {
      "title": "Respect other people's views and opinions.",
      "content": "Respect other people's views and opinions. Before all else, enter the discussion with respect for all parties involved. The majority of theists will assume that an attack on religion is an attack on their god or gods. Make it clear that you wish to discuss aspects of organized religion only and are not questioning their belief in a personal god."
    },
    {
      "title": "Proceed gently into the discussion.",
      "content": "Proceed gently into the discussion. Religion is a touchy subject for a lot of people and is generally not considered \"polite conversation.\" Always ensure that everyone present is open to discussing religion."
    },
    {
      "title": "Let the conversation follow its own course, and listen to what everyone has to say.",
      "content": "Let the conversation follow its own course, and listen to what everyone has to say."
    },
    {
      "title": "Be open to counter arguments and differing opinions.",
      "content": "Be open to counter arguments and differing opinions. There are plenty of positive points in favour of religion that are perfectly valid."
    },
    {
      "title": "Don't enter the conversation thinking you are going to convert anyone.",
      "content": "Don't enter the conversation thinking you are going to convert anyone. No simple discussion is going to pull anyone away from their religion, the purpose of the discussion to broaden everyone's horizons, including your own."
    },
    {
      "title": "Be respectful at all times and walk away if the conversation is no longer constructive.",
      "content": "Be respectful at all times and walk away if the conversation is no longer constructive. Although debate can be positive if the conversation degenerates into an argument be prepared to walk away."
    }
  ]
}