{
  "url": "https://www.wikihow.com/Extract-Juice-from-an-Onion",
  "title": "How to Extract Juice from an Onion",
  "steps": [
    {
      "title": "Peel the skin.",
      "content": "Peel the skin. Use a sharp serrated knife to cut a small slice, no larger than 1/2 inch (1.27 centimeters), from the root end of the onion. Slice through the onion until you reach the skin on the other side, but do not cut through the skin. Grab the partially cut end and pull it down, past the length of the onion, to draw back a portion of the skin. Grab the remaining skin with your thumb and first two fingers and draw it back to remove it."
    },
    {
      "title": "Cut off the other end.",
      "content": "Cut off the other end. [1] X Research source Use the same knife to remove another slice, about 1/2 inch (1.27 centimeters), from the other end of the onion. Doing so will make it easier to cut or chop the onion, so this step is especially important if extracting juice using a blender or juicer. If extracting juice using a grater, you may skip this step. Keeping the opposite end intact may actually make it easier to grate the onion."
    },
    {
      "title": "Rinse the onion.",
      "content": "Rinse the onion. Run the peeled onion under a lukewarm tap to remove any small specks of skin or dirt. Dry it with a clean paper towel."
    },
    {
      "title": "Chop the onion.",
      "content": "Chop the onion. Use a sharp serrated knife to rough chop the onion into medium pieces. You do not need to mince or finely chop the onion, but small to medium pieces work better in a blender than large pieces do."
    },
    {
      "title": "Put the onion pieces into a blender and blend.",
      "content": "Put the onion pieces into a blender and blend. [2] X Research source Use a medium-high to high speed and blend the chopped onion for about 1 minute, turning the onion into a thick puree."
    },
    {
      "title": "Repeat blending as necessary.",
      "content": "Repeat blending as necessary. Blending the onion for 1 minute should be enough to puree the onion, but every blender works a little differently. If you still have notable pieces of onion in your blender, stop the blender, open the lid, and push the pieces down toward the blades using a rubber spatula. Replace the lid and continue blending at 30 second intervals at high speed until completely blended."
    },
    {
      "title": "Position a strainer over the mouth of a bowl.",
      "content": "Position a strainer over the mouth of a bowl. The strainer should be small enough to fit inside the bowl, but if possible, large enough to rest on the lip of the bowl. Otherwise, hold the strainer over the mouth of the bowl with one hand."
    },
    {
      "title": "Lay a piece of cheesecloth inside the strainer.",
      "content": "Lay a piece of cheesecloth inside the strainer. The thinness of the cheesecloth will make it easier to filter out the juice while trapping the solid pulp."
    },
    {
      "title": "Press the blended onion through the cheesecloth and the strainer.",
      "content": "Press the blended onion through the cheesecloth and the strainer. [3] X Research source Transfer the onion from the blender into the center of the cheesecloth. Use a spoon or rubber spatula to push the onion pulp into the cheesecloth and the strainer and into the bowl. Continue pressing the pulp until you no longer see juice dripping out from the bottom of the strainer."
    },
    {
      "title": "Place a box grater inside a shallow bowl or pan.",
      "content": "Place a box grater inside a shallow bowl or pan. You need a container with sides, but the mouth must be wide enough for you to fit a box grater, also called a cheese grater or flat bottomed grater, and at least one of your hands inside since you will need to grate the onion inside it."
    },
    {
      "title": "Hold the top handle of the grater with one hand.",
      "content": "Hold the top handle of the grater with one hand. Press down on the grater using even pressure to keep it steady, preventing it from sliding around as you attempt to grate the onion."
    },
    {
      "title": "Rub the whole onion against the fine side of the grater.",
      "content": "Rub the whole onion against the fine side of the grater. [4] X Research source Grab the rounded end of the onion, if left intact, with your free hand. Press the flat end that once attached to the root to the top of the fine side of the grater. Move the onion in a downward motion over the holes to grate it. Continue to press the onion against the grater, moving it up and down over the holes, until you have grated the entire onion."
    },
    {
      "title": "Rest a strainer on top of a medium to large bowl.",
      "content": "Rest a strainer on top of a medium to large bowl. This bowl should have higher sides but must have a wide enough mouth to accommodate the entire diameter of the strainer. If possible, rest the strainer over the lip of the bowl. If the strainer is too small, however, hold it with your hand."
    },
    {
      "title": "Press the onion pulp through the strainer.",
      "content": "Press the onion pulp through the strainer. Place the grated pulp from the other container into a fine mesh strainer. Use a spoon or rubber spatula to push the pulp into the strainer, separating most of the juice while keep the majority of the solid pulp out of the second bowl. Continue pressing until most of the juice has been separated, but do not press so much that you begin pushing the pulp through the strainer."
    },
    {
      "title": "Put the remaining pulp inside a square of cheesecloth.",
      "content": "Put the remaining pulp inside a square of cheesecloth. [5] X Research source Place the pulp into the center of the cheesecloth and bring all the corners of the cloth together, effectively wrapping the pulp inside. Push down on the pulp to squeeze out more juice into the second bowl. Continue pressing and pushing until no further juice drips out."
    },
    {
      "title": "Cut the onion into quarters.",
      "content": "Cut the onion into quarters. A whole onion will be too large for many juicers to work with, but small chunks or chopped onion will be too small for you to push through. Use a sharp serrated knife to cut your onion into quarters, lengthwise, for the best results."
    },
    {
      "title": "Choose the right type of juicer.",
      "content": "Choose the right type of juicer. Use an electric centrifugal juicer with a chute and a spout. A hand juicer, or a juicer that requires you to press the fruit or vegetable against a bump to extract the juice, only works with soft fruits like lemons, oranges, and limes. To extract juice from hard vegetables like onions, you need a juicer with a spout that you can feed pieces of the vegetable into."
    },
    {
      "title": "Place a bowl under the spout of the juicer.",
      "content": "Place a bowl under the spout of the juicer. Some juicers come with a glass collection container, but for many strainers, you will need to place a bowl or drinking glass beneath the dispensing spout before you begin since the juice will pour out as you work."
    },
    {
      "title": "Press each quarter through the juicer.",
      "content": "Press each quarter through the juicer. Wait until each quarter has finished being juiced before inserting the next quarter into the chute. The juice should automatically filter out through the spout while the pulp will be collected into a separate compartment. No additional straining should be necessary."
    }
  ]
}