{
  "url": "https://www.wikihow.com/Find-Shimmer-Terraria",
  "title": "Shimmer in Terraria: Find, Use, and Transport Guide",
  "steps": [
    {
      "title": "Shimmer can be found in the Aether biome pre-Hardmode.",
      "content": "Shimmer can be found in the Aether biome pre-Hardmode. This biome only generates once per world and always on the same half of the world as the Jungle. [1] X Research source Find the Jungle biome first, and then tunnel through that half of the underground until you reach the Aether. [2] X Research source The Aether contains Gem Trees, a dark background with stars, and a big pool of Shimmer in the middle."
    },
    {
      "title": "Decide what to transform.",
      "content": "Decide what to transform. Generally, crafted items will transform it into its crafting materials, but some items have unique outputs. If NPCs interact with Shimmer, they'll transform into their Shimmered form and take on a new sprite. Most monsters will transform into Faeling which can be captured with any Bug Net."
    },
    {
      "title": "Drop the item into the Shimmer.",
      "content": "Drop the item into the Shimmer. Stand at the edge of the Shimmer pool and drag the item out of your inventory. You can also build a small platform above the Shimmer, stand on it, and drop it from there. If your character falls into the Shimmer, the Shimmering debuff will be applied. You'll be unable to move or use items, and you'll phase through all tiles below you until you reach an opening or the Underworld."
    },
    {
      "title": "Collect the transmuted item.",
      "content": "Collect the transmuted item. When the item or entity is dropped into the Shimmer, it will sink for a moment and then float back up once it has transformed. [3] X Research source"
    },
    {
      "title": "Obtain a Bottomless Water Bucket.",
      "content": "Obtain a Bottomless Water Bucket. Shimmer can't be transported using a regular bucket. You'll need a Bottomless Water Bucket to carry it with you once you've found it in the Aether. [4] X Research source A Bottomless Water Bucket is given as a reward for completing one of the fishing quests from the Angler NPC. This is rewarded randomly, so you may need to finish a few fishing quests before getting one."
    },
    {
      "title": "Drop the Bottomless Water Bucket into the Shimmer.",
      "content": "Drop the Bottomless Water Bucket into the Shimmer. Stand at the edge of the Shimmer pool and drag the item out of your inventory. You can also build a small platform above the Shimmer, stand on it, and drop it from there."
    },
    {
      "title": "Collect the Bottomless Shimmer Bucket.",
      "content": "Collect the Bottomless Shimmer Bucket. When the Bottomless Water Bucket is dropped into the Shimmer, it will sink for a moment and then float back up once it has transformed into the Bottomless Shimmer Bucket. You can now use the Bottomless Shimmer Bucket to create Shimmer ponds anywhere. Alternatively, if Moon Lord has been defeated, players can create a Bottomless Shimmer Bucket by crafting it at an Ancient Manipulator with a Bottomless Water Bucket and 10 Luminite Bars."
    },
    {
      "title": "Shimmer is a liquid that can transmute submerged items and entities.",
      "content": "Shimmer is a liquid that can transmute submerged items and entities. When certain items are dropped into the Shimmer, they can transform back into other items or decraft into their crafting materials. When NPCs touch the Shimmer, their sprite will change. If certain enemies touch the Shimmer, they will be transformed into other enemies. Players can find Shimmer in the Aether (pre- Hardmode ). The Aether is a biome that generates only once per world in the Underground or Cavern layer. [5] X Research source"
    }
  ]
}