{
  "url": "https://www.wikihow.com/Evolve-Graveler",
  "title": "How to Evolve Graveler",
  "steps": [
    {
      "title": "Find someone you can trade with, or use another Game Boy and game.",
      "content": "Find someone you can trade with, or use another Game Boy and game. You need to trade Graveler with someone who has a game from the same Generation. For example, you can trade between Red and Blue (Generation I) or Diamond and Pearl (Generation III). You cannot trade between Blue and Pearl. You cannot use a DS to trade between Generation III games. This is due to the lack of a link cable port on the DS. If you are playing on an emulator, click here."
    },
    {
      "title": "Put Graveler in your party.",
      "content": "Put Graveler in your party. This is required for trading in Generations I-IV. In Generation V and later, you can select any of your Pokémon. Make sure Graveler is not holding an Everstone. This prevents evolutions."
    },
    {
      "title": "Connect to the second system.",
      "content": "Connect to the second system. How you connect varies depending on the system. Game Boy, Game Boy Color, Game Boy Advance - Use a link cable to connect two of the systems. You cannot connect different versions of the Game Boy. Nintendo DS - You can connect wirelessly within 30 feet (9.1 m). Generation V games can also connect via IR built-in to the cartridge. Use the C-Gear in the game. Click here for a guide on trading with the DS . Nintendo 3DS/2DS - Press the L and R buttons and select Player Search System. This will allow you to trade with the other nearby system. You can also connect to the internet and trade online. Make sure that your partner trades the evolved Golem back to you. [1] X Research source"
    },
    {
      "title": "Trade your Graveler to your trade partner.",
      "content": "Trade your Graveler to your trade partner. It will evolve into Golem as soon as it is traded. Graveler's level doesn't matter. See if your friend has a Pokémon that evolves through trading as well. That way you can knock them both out at once. Pokémon that require trades include Clamperl, Electabuzz, Feebas, and more. [2] X Research source bulbapedia.bulbagarden.net/wiki/Category:Pokémon_that_evolve_through_trading"
    },
    {
      "title": "Trade back for your Golem.",
      "content": "Trade back for your Golem. Your new Golem will be on the other system. Have your friend trade it back to you to get your Golem."
    },
    {
      "title": "Understand the process.",
      "content": "Understand the process. Since it's not possible to trade using an emulator, you'll need to use a workaround to evolve Graveler (and other Pokémon that rely on trading to evolve). If you're playing Diamond, Pearl, Platinum, HeartGold, or SoulSilver, you can use a fan-made hack to change Graveler into a Pokémon that evolves when it reaches Level 50. This only works on the US versions of these ROM files."
    },
    {
      "title": "Download the ROM editor.",
      "content": "Download the ROM editor. You'll need to download the custom ROM editor from this forum . Follow the link at the top of the first post to download the editor, which is a very small file. Extract the files from the ZIP once you've downloaded it."
    },
    {
      "title": "Run the editor.",
      "content": "Run the editor. Run NitroExplorer2b.exe to start the editor. You may be prompted to install the .NET Framework files if they aren't already installed on your computer."
    },
    {
      "title": "Load your ROM file.",
      "content": "Load your ROM file. Press the \"Load ROM\" button and browse for your Pokémon ROM file."
    },
    {
      "title": "Select the proper file.",
      "content": "Select the proper file. The file you need to select varies depending on the game you are modifying: Diamond, Pearl, and Platinum - Open the \"poketool\" folder, and then open the \"personal\" folder. Select the \"evo.narc\" file. HeartGold, SoulSilver - Open the \"a\" folder, then the \"0\" folder, followed by the \"3\" folder. Select the \"4\" file."
    },
    {
      "title": "Click the \"Reinsert\" button.",
      "content": "Click the \"Reinsert\" button. This will open the file browser."
    },
    {
      "title": "Select the \"4\" file that came in the ZIP.",
      "content": "Select the \"4\" file that came in the ZIP. there should be a \"4\" file in the same folder as NitroExplorer2b.exe. Select this file to insert into the ROM."
    },
    {
      "title": "Close the editor and start your emulator.",
      "content": "Close the editor and start your emulator. After replacing the file, you can start up your emulator and play your game. Graveler will now evolve into Golem at Level 50. [3] X Research source"
    },
    {
      "title": "Understand the process.",
      "content": "Understand the process. You normally cannot trade between emulators, making it difficult to get Graveler to evolve. There is a special version of the VBA emulator called VBALink that allows you to run up to four instances of it at once. This lets you trade between the instances, but requires a bit of work to get going."
    },
    {
      "title": "Create a new folder somewhere easy to access.",
      "content": "Create a new folder somewhere easy to access. You'll find this process much easier if you keep everything you need in one spot. Create a folder called \"vbalink\" or something similar on your Desktop."
    },
    {
      "title": "Download VBALink.",
      "content": "Download VBALink. You can download the VBALink emulator from vbalink.info . Download the \"1.72\" file and extract the contents into your new folder."
    },
    {
      "title": "Download the fan-made INI files.",
      "content": "Download the fan-made INI files. These configuration files will make the trading process much smoother. Download the ZIP containing the three INI files from this forum thread . Extract the files into the same \"vbalink\" folder that the emulator files are in."
    },
    {
      "title": "Copy your ROM file into the \"vbalink\" folder.",
      "content": "Copy your ROM file into the \"vbalink\" folder. Copy the ROM file you normally use into the \"vbalink\" folder."
    },
    {
      "title": "Copy your saved game files into the \"vbalink\" folder.",
      "content": "Copy your saved game files into the \"vbalink\" folder. You'll need a saved game that is far enough in the game to allow for trading. The requirements for trading vary depending on the game."
    },
    {
      "title": "Make two copies of your saved game and paste them in the same folder.",
      "content": "Make two copies of your saved game and paste them in the same folder. Copy the \".sav\" file and paste it twice into the \"vbalink\" folder. This will leave you with the original and two copies."
    },
    {
      "title": "Change the extension for the copied saved games.",
      "content": "Change the extension for the copied saved games. Right-click the first copied saved game and select \"Rename\". Change the extension from \".sav\" to \".sa1\". Repeat the process for the second file, changing the extension to \".sa2\". You should now have a \".sav\", a \".sa1\", and a \".sa2\" file in the \"vbalink\" folder. If you don't see file extensions, click the \"View\" tab in Explorer and check the \"File name extensions\" box."
    },
    {
      "title": "Start VBALink and drag the window to the left side of your screen.",
      "content": "Start VBALink and drag the window to the left side of your screen. Double-click the \"VisualBoyAdvance.exe\" program to start the emulator. Click \"File\" → \"Open\" and select your ROM file from the \"gbalink\" folder."
    },
    {
      "title": "Navigate your character to a Pokémon Center.",
      "content": "Navigate your character to a Pokémon Center. Walk upstairs and stand in front of the lady who will start the trade process. Do not talk to her yet. The controls for the first window are W A S D to move, Q for A, E for B, and Z for Select."
    },
    {
      "title": "Click the Options menu and select \"Emulator\".",
      "content": "Click the Options menu and select \"Emulator\". Make sure that \"Pause when inactive window\" is not checked."
    },
    {
      "title": "Start a new instance of VBALink.",
      "content": "Start a new instance of VBALink. Double-click \"VisualBoyAdvance.exe\" again to start another instance of VBAlink in another window. Drag this window to the right side of your screen. Click \"File\" → \"Open\" and select the same ROM file as you did before."
    },
    {
      "title": "Navigate the character in the second window to the Pokémon Center.",
      "content": "Navigate the character in the second window to the Pokémon Center. The controls for this window are different. Press T F G H to move, R for A, Y for B, and V for Select. Move the character to the Pokémon Center and stand in front of the trade lady."
    },
    {
      "title": "Press Q to speak to the lady on the left screen.",
      "content": "Press Q to speak to the lady on the left screen. The game may hang for a few seconds, just be patient and avoid hitting more keys. Choose the \"Trade\" option from the menu."
    },
    {
      "title": "Press R as soon as the left window displays \"Please Wait\".",
      "content": "Press R as soon as the left window displays \"Please Wait\". This will make the character on the right screen speak to the trade lady. Select the \"Trade\" option. After a few moments, the trade interface should appear on both screens."
    },
    {
      "title": "Trade your Graveler to either the left or right screen.",
      "content": "Trade your Graveler to either the left or right screen. You'll only be keeping one of the save files, so pay attention to which screen you trade it to. Graveler will evolve into Golem as soon as it is traded."
    },
    {
      "title": "Close the emulators after the games are saved.",
      "content": "Close the emulators after the games are saved. After trading, you'll receive a notification that your game has saved. You can close your emulators at this point."
    },
    {
      "title": "Copy the save file you want back to your original emulator.",
      "content": "Copy the save file you want back to your original emulator. Select the save file you want to keep. If you are keeping the save file from the left screen, select the \".sa1\" file. If you are keeping the save file from the right screen, select the \".sa2\" file. Copy and paste the selected file back into your original emulator's directory."
    },
    {
      "title": "Backup your original save file.",
      "content": "Backup your original save file. Copy and paste the \".sav\" file in your emulator directory to somewhere else in case the new file doesn't work. You can move your old save back if something goes wrong."
    },
    {
      "title": "Rename the new save file.",
      "content": "Rename the new save file. Change the extension of the \".sa1\" or \".sa2\" file to \".sav\"."
    },
    {
      "title": "Load the game in your regular emulator.",
      "content": "Load the game in your regular emulator. You should be able to load your game from your new save file with your newly-evolved Golem. If your game doesn't work, copy the \"vba.ini\" file from the \"gbalink\" folder into your regular emulator folder."
    }
  ]
}