{
  "url": "https://www.wikihow.com/Fill-in-Eyebrows",
  "title": "How to Fill in Eyebrows",
  "steps": [
    {
      "title": "Remove stray hairs.",
      "content": "Remove stray hairs. Tweeze stray hairs below your natural eyebrow, including any hairs in between your two brows. Don’t do precise tweezing right now, just pluck away the prominent stray hairs. Avoid tweezing the hair above your eyebrow, as this can create an unnatural shape and make your eyes look smaller."
    },
    {
      "title": "Trim the excess hair.",
      "content": "Trim the excess hair. If any of your eyebrow hairs are longer than the natural shape of your brow, consider brushing those hairs upward using a spoolie (it looks like a clean mascara applicator), and trimming them. Trim the hairs by placing small eyebrow scissors horizontally above your brow (mimicking as close as possible the shape of your brow), and carefully cutting the hairs that reach beyond the top of your brow line. For very uncooperative eyebrow hairs, consider using a spoolie to also brush the hairs downward, and use the same technique to cut the hairs that extend below your natural eyebrow shape. Be very careful to not over trim! Cut the hairs about 1 ⁄ 8 inch (0.32 cm) above the edge of the brow. It’s very easy to cut your eyebrow hairs too short, so always trim less initially and then trim more if need be."
    },
    {
      "title": "Fill out the shape underneath your brow.",
      "content": "Fill out the shape underneath your brow. Use soft, short hair-like strokes beneath your brow to thicken and define the natural shape. your brow. You don’t want the line to look too dramatic, and you can always add on more strokes. You want the underside of your brow to be clearly defined and sharper looking, while allowing the top part and the rest of your brow to look naturally inexact and free flowing. If the line looks intense,use the spoolie to blend the makeup upwards. Don't pick a shade that matches your brow color exactly. Just like the head on your hair, your eyebrow hairs have different pigments and hues. Using a color that matches your brow color exactly might make your brows look too intense. Instead, opt to use a lighter shade for underlining and filling in. For example, if you have dark brown hair, consider using a lighter brown. [1] X Research source"
    },
    {
      "title": "Measure your inner brow.",
      "content": "Measure your inner brow. Place your eyebrow brush (or any straight object) vertically so that the tip almost touches the tear duct of one eye. Slide the brush up so that it intersects with the line of your eyebrow. This is about where your eyebrow should start, so you can remove any hair extending past that point. You can also use the “ala” of your nose, or the area of your nose where your nostrils begin to flare, as a starting point for your eyebrows. Keep in mind that everyone’s face shape is different, along with the positioning of their eyes, and width of their nose, so this method might not work best for everyone."
    },
    {
      "title": "Mark your starting point.",
      "content": "Mark your starting point. Make a light mark (a dot) with some eyeliner to keep track of the place where your hair should start, removing any hair before that mark (meaning toward the space between your brows). It works best to tweeze these hairs for a more accurate removal. Be sure not to tweeze past the inside corner of your eye. If your skin is irritated and red after tweezing, try using aloe vera gel or cortisone cream to soothe and calm your skin."
    },
    {
      "title": "Find the end of your brow.",
      "content": "Find the end of your brow. Place your eyebrow brush (or your straight object) on a diagonal starting from the outside corner of your nostril, extending to the outside crease of your eye. You can even extend of as far your brow bone. This is the place where your eyebrow should end. [2] X Research source Any hair extending past that straight object toward the side of your face should be removed. Be careful not to tweeze the end hairs that make up the thicker part of your natural brow. Those hairs rarely grow back. Only tweeze the straggler hairs."
    },
    {
      "title": "Find your natural arch.",
      "content": "Find your natural arch. Place your eyebrow brush (or straight object) on a diagonal starting from the outside corner of your nostril, to the outside of your iris (the colored part of your eye). [3] X Research source The point where your straight object extends and reaches the top of your eyebrow is where the high point in your arch should be. Underneath your brow is where you’ll tweeze away the most hair. However, that doesn’t mean that you will be tweezing lots of hairs; you may find you only need to remove a few here and there."
    },
    {
      "title": "Keep your arch low and angular.",
      "content": "Keep your arch low and angular. A high arch can make your face look angry. Tweeze a bit around the top of your arch if you need to lower it, going for a low, natural look. Make sure it’s crisp and angular, rather than rounded. [4] X Research source"
    },
    {
      "title": "Consider your skin tone.",
      "content": "Consider your skin tone. Just like how you used a lighter color to underline the bottom of your brow, your skin tone should also influence the color you use to fill in your brows. [5] X Expert Source Melissa Jannes Licensed Esthetician Expert Interview. 30 August 2019. For example, if you have darker skin tones, try using a color that has a little bit of red tint to it. [6] X Research source It could help with making your brows look more natural. If you have a lighter skin tone but darker hair, try using a light brown shade of brow filler with ash undertones. [7] X Research source If you’re not sure what color to start with, go to a cosmetic store and try a few different shades on in-person to see what looks best. You can ask clerks for their help too."
    },
    {
      "title": "Start filling in your brow using a powder.",
      "content": "Start filling in your brow using a powder. [8] X Expert Source Melissa Jannes Licensed Esthetician Expert Interview. 30 August 2019. Touch your brush (a small, angled eyebrow brush is recommended) in the brow powder, tap off some excess powder on the side of the powder container, and start to lightly fill in the top and bottom edges of your brow. When filling in, follow in the direction of your hair growth. Stay in the margins of your natural brow shape; you don’t want to over extend, and apply powder past where your brow hair actually is. Try starting at your arch, and working your way down on both sides. Brow powder is perfect if you just need a light fill or you want to darken the color of your brows, and it only takes about a minute to do. [9] X Expert Source Alicia D'Angelo Makeup Artist Expert Interview. 10 April 2020. If you like the look of thinner brows, use a small-tipped brow pen to mimic the appearance of your natural brow. [10] X Expert Source Alicia D'Angelo Makeup Artist Expert Interview. 10 April 2020. If you want to soften bold features or a strong jawline, create a softly rounded brow shape. If you’d rather sharpen up a round face and small features, flatter them with a crisp, angular brow."
    },
    {
      "title": "Use a brow stencil to get the perfect shape.",
      "content": "Use a brow stencil to get the perfect shape. You can buy brow stencil packs online or at beauty stores. Choose the shape you want and line it up over your natural brow, pressing it to your face with two fingers so that you can still see the outline of the stencil. Carefully shade in your brow along the edges of the stencil. [11] X Research source When you’re done with one brow, simply wipe off the stencil with a paper towel and flip it around to complete the other!"
    },
    {
      "title": "Fill in the rest of your brow.",
      "content": "Fill in the rest of your brow. Moving from the arch, continue filling to the very edge of your brow with light brush strokes. Without adding more product to the brush, focus on adding powder and creating volume on the outside edge of your brow rather than layering powder in the middle area of your brow. Focusing on the edge of your brow gives your brows a more natural, full look. [12] X Expert Source Melissa Jannes Licensed Esthetician Expert Interview. 30 August 2019. Avoid outlining beyond the natural edge of the brow. Remember, you can always add more, but if you start with heavy make-up, it’s harder to take off if you mess up."
    },
    {
      "title": "Brush out the color.",
      "content": "Brush out the color. Use a spoolie brush to spread the colored powder and disperse it evenly throughout your brow hairs. This can help make your brow look less harsh and naturally defined. You can continue to add powder and brush it out until you get the intensity and shade you want. Brushing the product through your brows will make them look softer, more natural, and less dense. [13] X Expert Source Alicia D'Angelo Makeup Artist Expert Interview. 10 April 2020."
    },
    {
      "title": "Check your work.",
      "content": "Check your work. Place your brush on a diagonal starting from the ala or outside corner of your nostril, and check the starting point of your eyebrow. Also check the end edge of your eyebrow and your arch point, using the same steps you used to shape your eyebrow in Part 1. Use your brush and your eye as a guide to see if your brow is too short and needs to be extended, or too long and needs to be taken off a bit. Make sure the arch start and end point of both brows are about parallel. Your natural brows will never be perfectly identical, but you want to get them as close as possible."
    },
    {
      "title": "Set your brows.",
      "content": "Set your brows. Use a clear brow setting formula to keep all your hairs and color in place. Starting in the middle of your brow, brush the middle hairs straight up, and then pull the brush toward the outer section (the tail) of your brow.Use a concealer around your brows to give them more definition. [14] X Research source You can also use a tinted setting gel, but it’s a safer bet to use a clear gel to refrain from adding multiple different colors to your eyebrows."
    },
    {
      "title": "Use a brow gel and white liner for a natural, relaxed look.",
      "content": "Use a brow gel and white liner for a natural, relaxed look. Apply a brow gel with an angled brush to sculpt your brows naturally and imitate the appearance of natural hairs. Then, apply a bit of white eyeshadow along your brow bone to create a subtle highlight, giving you a full and naturally-balanced look. [15] X Research source If you have fuller eyebrows, brushing on brow mascara will fill them in instantly without changing their shape. [16] X Expert Source Alicia D'Angelo Makeup Artist Expert Interview. 10 April 2020."
    },
    {
      "title": "Apply a matte powder with a feathery finish for a high fashion style.",
      "content": "Apply a matte powder with a feathery finish for a high fashion style. Brush a bit matte texture powder under each hair in an upwards sweep. To make your brows even more feathery, brush them upwards with a spoolie. Apply powder highlighter through the top of your brows to create a smoky, feathery look. [17] X Research source"
    },
    {
      "title": "Go for bold, night-out brows with a squarer brow shape.",
      "content": "Go for bold, night-out brows with a squarer brow shape. Using a simple powder pencil, move in a straight line from the inner edge of your brow to the arch. Rather than rounding the front of your brow, keep it squarer and crisp. [18] X Research source Balance out your bold brows with a dramatic smoky eye. For a more understated look, simply apply eyeliner to your upper lash line."
    }
  ]
}