{
  "url": "https://www.wikihow.com/Get-Slime-Out-of-Hair",
  "title": "How to Get Slime Out of Hair",
  "steps": [
    {
      "title": "Take a warm shower and apply conditioner to the hair.",
      "content": "Take a warm shower and apply conditioner to the hair. You can also just dip the hair in warm water if the slime is near the ends.Massage the conditioner in with your fingers, going the same direction as the hair growth. Use your fingers to break up the slime as much as possible. [1] X Research source"
    },
    {
      "title": "Use a comb to help break up the slime.",
      "content": "Use a comb to help break up the slime. Let the water run over the area, massaging it to loosen and pull out the slime. Run a comb through it gently, as you don't want to yank hair out in the process. [2] X Research source"
    },
    {
      "title": "Rinse out the conditioner.",
      "content": "Rinse out the conditioner. Once the slime is mostly gone, run more warm water over the hair. Use your fingers to rinse the conditioner out of the hair. [3] X Research source"
    },
    {
      "title": "Massage shampoo into the hair.",
      "content": "Massage shampoo into the hair. Apply shampoo to the area with your fingers, going the same direction as hair growth. The shampoo will help remove the last of the slime from the hair. [4] X Research source"
    },
    {
      "title": "Rub a dollop of oil into the hair.",
      "content": "Rub a dollop of oil into the hair. Apply the oil as you would shampoo, massaging it into the area with the slime. Use your fingers to work the oil fully into the hair, moving in the same direction as the hair growth. [5] X Research source You can use any oil-heavy product, including mayonnaise, peanut butter, olive oil, vegetable oil, or coconut oil. You can even use baby oil. [6] X Research source Check out more ways to get slime out of hair on wikiHow’s “How do I get slime out of hair and clothing?” forum ."
    },
    {
      "title": "Comb the hair out with a fine-tooth comb.",
      "content": "Comb the hair out with a fine-tooth comb. Brush or comb the hair, pulling out the slime as you do. Be gentle, as you don't want to pull any hair out. [7] X Research source"
    },
    {
      "title": "Wash the hair with shampoo and conditioner.",
      "content": "Wash the hair with shampoo and conditioner. Once the slime is mostly gone, hop in the shower to finish the job. The warm water, shampoo, and conditioner will get the last of the slime out of the hair. [8] X Research source Plus, you may have lingering odors from the oil you used, which you'll want to wash out."
    },
    {
      "title": "Remove as much slime as you can.",
      "content": "Remove as much slime as you can. If there are big globs of slime, try to gently pull them out first. If they don't come out easily, just move on to the next step. [9] X Research source"
    },
    {
      "title": "Put goggles on the person to protect their eyes.",
      "content": "Put goggles on the person to protect their eyes. Vinegar can sting quite a bit, so goggles can help solve that problem. Just be sure not to put the strap over the area where the slime is. The person or child may have to hold the goggles on their face. [10] X Research source Have the person stand in the tub or shower while you apply the vinegar, as it will drip."
    },
    {
      "title": "Rub a mixture of 2/3 vinegar and 1/3 warm water into the hair.",
      "content": "Rub a mixture of 2/3 vinegar and 1/3 warm water into the hair. You can dip the hair into the mixture if the slime is near the ends. Otherwise, pour the mixture on the hair. Massage it in with your fingers to loosen the slime. [11] X Research source Keep dipping the hair or pouring on vinegar as needed. You can use white distilled vinegar or apple cider vinegar."
    },
    {
      "title": "Use conditioner to rinse out the remaining slime.",
      "content": "Use conditioner to rinse out the remaining slime. Hop into the shower, and apply conditioner to the area. Use a comb to gently break up the remaining slime in the hair, then wash the hair like you normally would. [12] X Research source"
    }
  ]
}