{
  "url": "https://www.wikihow.com/Funny-Numbers-to-Call",
  "title": "Funny Numbers to Call When You’re Bored or Want to Prank Someone",
  "steps": [
    {
      "title": "Give this number to someone to “Rick roll” them via phone call.",
      "content": "Give this number to someone to “Rick roll” them via phone call. When the caller hears “Never Gonna Give You Up” start to play, they’ll groan as they realize you’ve Rick rolled them. Rickrolling is a term for pranking someone by sending them unsuspecting video/audio of Rick Astley’s mega-80s “Never Give You Up” music video. Since this prank is usually enacted online, the caller will never guess you’ve set them up by phone! [1] X Research source"
    },
    {
      "title": "Listen to the fastest dial tone recording.",
      "content": "Listen to the fastest dial tone recording. There’s something about hearing normal conversations sped up that can get almost anyone laughing. Calling the wrong number and getting the dial tone is common, but this sped-up version is much funnier than the one you’re used to hearing. [2] X Research source"
    },
    {
      "title": "Dial this hotline to play Hall & Oates tunes.",
      "content": "Dial this hotline to play Hall & Oates tunes. After calling this number, you’ll be greeted by a British woman who offers to play a selection of songs by the 70’s pop-duo Hall & Oates. There are no jokes involved, but the simplicity of this fun hotline can easily cause a chuckle. [3] X Research source Give this number to a friend or family member who’s a Hall & Oates fan to make their day — and hopefully bring them a laugh."
    },
    {
      "title": "Call Jenny for a throwback music reference.",
      "content": "Call Jenny for a throwback music reference. Up until 2017, 867-5309 was the most-called phone number after being made famous by Tommy Tutone’s 80’s hit of the same name. [4] X Research source If you call the number now, it’s probably no coincidence that you’ll reach an automated message for Retro Fitness, an 80’s themed gym chain. [5] X Research source Jenny may not pick up the phone, but it’s likely that “867-5309” is a staple on the gym’s playlist!"
    },
    {
      "title": "Give Santa your Christmas list months in advance with this number.",
      "content": "Give Santa your Christmas list months in advance with this number. While it obviously can’t actually connect you to Santa Claus, you can still call this hotline to chat with a fake Saint Nick any time of the year. Another option would be to prank someone with this number; either give it to a friend as a joke, or give it to anyone you don't want to share contact information with and let them be surprised!"
    },
    {
      "title": "This one-of-a-kind number recites thoughtful poetry when you call it.",
      "content": "This one-of-a-kind number recites thoughtful poetry when you call it. If you’re looking for some easy entertainment, the Beautiful Phrases hotline plays a variety of spoken lines from all different speakers. They’re actually Harvard Sentences; phrases designed by the Institute of Electrical and Electronics Engineers to measure speech quality, and they make for a truly memorable prank call! [6] X Research source"
    },
    {
      "title": "Call Saul Goodman if you need a lawyer.",
      "content": "Call Saul Goodman if you need a lawyer. In season 3, episode 6 of Better Call Saul, a commercial for Saul Goodman Productions featured this working phone number. If you call it, you’ll reach a recording from Saul asking you to leave a message if you need a lawyer. [7] X Research source"
    },
    {
      "title": "Call the Loser Line, and you might be on the radio.",
      "content": "Call the Loser Line, and you might be on the radio. Seattle radio station MOViN 92.5 created the Loser Line so listeners who had a bad experience with a rude suitor could give them a fake number — and embarrass them in the process. If the caller decides to leave a message that’s rude or harassing, the station will play the message on-air so the loser can learn their lesson. [8] X Research source Give this number to a jerk you rejected or someone you think should be held publicly accountable for their nasty behavior."
    },
    {
      "title": "Initiate a funny call by using a prank-call website.",
      "content": "Initiate a funny call by using a prank-call website. If you want to send someone a hilarious recorded message instead of listening to one yourself, use a prank-call website. These websites call the person of your choosing with realistic recordings that can put the receiver in funny or uncomfortable scenarios, from a fake pizza delivery guy calling with their order to a fictional angry caller who is mad the receiver hit their car. PrankDial US PrankHotline Be kind when initiating a prank call . Remember: something that seems funny to you may hurt the person's feelings on the receiving end of the call, so always use your best judgment when pranking a friend."
    }
  ]
}