{
  "url": "https://www.wikihow.com/Crack-Your-Upper-Back",
  "title": "How to Crack Your Upper Back",
  "steps": [
    {
      "title": "Use a chair to crack your back.",
      "content": "Use a chair to crack your back. If you need to crack your back quickly at work or school, you can do so while seated. This works best if you are sitting in a chair with a short back. While seated, slide your butt toward the front edge of the chair. Then, lean back until your back is touching the back of the chair. Place your palms on your forehead and exhale slowly. This will cause your head and shoulders to sink down behind the chair. Eventually, you should hear a crack. Do not lean back past the point where it feels uncomfortable to you. If it hurts or feels uncomfortable, then stop."
    },
    {
      "title": "Lie on the floor.",
      "content": "Lie on the floor. If you're struggling to crack your back while seated or standing, you can try doing it while lying on the floor. However, this exercise will require some more range of motion. You need to be able to grab your toes. Do not attempt this exercise if it is painful for you to reach your feet. If you feel pain or discomfort when you attempt the stretch, then stop immediately."
    },
    {
      "title": "Try to crack your back while standing upright.",
      "content": "Try to crack your back while standing upright. This is a fairly safe means of cracking your back, and it can be done at your convenience during the day. However, you do need some range of motion with your arms to do this stretch because you need to place both hands on the center of your back. To start, place your hands behind your back, one on top of another, at the center of your spine. [1] X Research source Press both hands against your spine, and as you do so, lean backward. Keep going until you hear and feel a slight pop. However, do not lean back past the point where it feels uncomfortable to you. If you feel pain or discomfort, then stop."
    },
    {
      "title": "Lay face down on a firm surface.",
      "content": "Lay face down on a firm surface. To have someone else crack your back, you will need to lay down on a firm surface. The floor or a firm mattress work well. Lay on your stomach and place your arms at your sides. Have the person who is helping you stand just in front of your head. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Have them apply pressure to your spine.",
      "content": "Have them apply pressure to your spine . The other person should place one hand over the other, and then, they should place their hands in the middle of your shoulder blades. Have them apply just a light amount of pressure to start. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ask the person to apply pressure as you exhale.",
      "content": "Ask the person to apply pressure as you exhale. Make sure that the person can hear your breathing. They should only push down once you have exhaled. It may be a good idea to have the other person instruct you when to breathe out and in, just to make sure. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You will not hear a pop yet. The other person will have to gradually move down your back to produce a popping noise."
    },
    {
      "title": "Instruct your friend to move down your back.",
      "content": "Instruct your friend to move down your back. The other person should keep moving their hands downward. Repeat the process of having them apply pressure as you exhale. The two of you should eventually find a spot that will produce a few good cracks. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Be very careful having someone else crack your back. It can be dangerous as the other person cannot gauge your comfort level. Communicate with the person throughout the process. If you feel discomfort or pain at any time, ask the person to stop immediately."
    },
    {
      "title": "Use an exercise ball.",
      "content": "Use an exercise ball . An exercise ball can be a great way to stretch your back, and it may also result in some cracking as well. To start, sit on an inflated exercise ball. Then, slowly walk your feet out in front of you and lower yourself onto the exercise ball so that your back is resting over it. Allow yourself to completely relax on the ball. Slowly bend and extend your knees to move your body forward and backward over the ball, so the ball rolls over different parts of your back. [6] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source This stretch is not guaranteed to crack your back, but your back may crack on its own while you lay on the ball. Try to be patient though because it might take a few minutes. Just relax on the ball and enjoy the stretch."
    },
    {
      "title": "Do the leg-over-leg back stretch.",
      "content": "Do the leg-over-leg back stretch . Sit down on a mat with your back straight and your legs flat on the ground. Bring your right leg gently up and, keeping it bent, rest it over the left leg. Your left leg should be flat on the ground, and the right leg should have only the foot resting on the ground, near the left hip. Bring your left arm across your body and wedge it on the right side of your right leg. You should feel the tension already. Using your left arm to push off of your right knee, twist your spinal cord gently back and to the right. Once you have felt a pop, release the pose, loosen out some of the tension, and repeat, using the opposite leg."
    },
    {
      "title": "Stretch using your bed.",
      "content": "Stretch using your bed. Lie down on the bottom of a bed, with everything above your shoulder blades hanging off the edge of the bed. Relax and slowly let your upper back and arms sink towards the floor. After you've fully stretched downward, do a full sit-up to bend your spine in the opposite direction, going back downward, sliding your shoulder blades farther and farther off the edge of the bed each time."
    },
    {
      "title": "Perform a rocking stretch.",
      "content": "Perform a rocking stretch. This is a Pilates stretch used to loosen the muscles in the spinal column. Lie down on a mat and bring both knees to your chest, hugging them with your hands. Slowly rock forward and backward on the mat, building momentum as you go. Aim to feel each piece of your spine on the mat as you rock back and forth."
    },
    {
      "title": "Try the floor crack.",
      "content": "Try the floor crack. Lay down face-up on some hard flooring (not carpet), with your arms stretched out. With your feet flat on the floor, bend your knees about 45 degrees, or enough to rotate your hips so that your lower spine is flat against the floor. You're trying to get your entire spine aligned with the floor. Put your hands on the back of your head and push your head forward, so that your chin goes in the direction of your chest. If you feel pain or discomfort, then stop right away!"
    },
    {
      "title": "See a doctor if you have persistent back pain.",
      "content": "See a doctor if you have persistent back pain . Cracking your back can temporarily relieve back pain. However, persistent back pain should be evaluated by a medical professional. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Back pain can come in response to sitting in an uncomfortable position or strain during exercise. In most cases, it goes away on its own with time. However, back pain that persists beyond a few weeks should be evaluated by a doctor. Depending on the cause of your back pain, your doctor will recommend a treatment. Back pain is usually treated with things like physical therapy and possibly medication. In rare cases, surgery may be required for back pain."
    },
    {
      "title": "Do not crack your back too often.",
      "content": "Do not crack your back too often. Cracking your back can be fine once in a while to alleviate discomfort. However, cracking your back constantly can unnecessarily stretch out the muscles in your back. This can result in a condition known as hyper-mobility . [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It's a good idea to check with a physical therapist to ensure it's safe to crack your back. [9] X Expert Source Karen Litzy, PT, DPT Physical Therapist Expert Interview. 27 August 2020. Avoid cracking your back at all if you have conditions like osteoarthritis, osteopenia, or neurological issues. [10] X Expert Source Karen Litzy, PT, DPT Physical Therapist Expert Interview. 27 August 2020. If you feel the need to constantly crack your back due to pain, see a doctor instead of repeatedly cracking your back."
    },
    {
      "title": "Opt for stretches over cracking you back.",
      "content": "Opt for stretches over cracking you back. Stretching is usually better than cracking your back to alleviate mild pain. To stretch your back, flex forward and then backwards. Then, bend from side to side. This should relieve some tension."
    }
  ]
}