{
  "url": "https://www.wikihow.com/Fix-Highlights-That-Are-Too-Light",
  "title": "Best Ways to Fix Highlights That Are Too Light or Blonde",
  "steps": [
    {
      "title": "Figure out what level your highlights are by referring to a color chart.",
      "content": "Figure out what level your highlights are by referring to a color chart. It's best to look at a color chart for the company whose hair dye products you're going to be using to be sure you pick the right color. Hold your highlighted hair up to the picture, seeing which color most closely resembles your hair. [1] X Research source Most color charts go from 1-10 or 1-12, with one end of the scale being the darkest black and the opposite end being a light blonde or lightest blonde. Type the brand you'll be using and then \"hair color chart\" into an online search engine to find the correct chart. Referring to a color chart for your specific brand of hair products is important because all hair product companies have a slightly different color scale. If your highlights are too light, they're most likely in the 10 range."
    },
    {
      "title": "Choose the level you'd like your highlights to be.",
      "content": "Choose the level you'd like your highlights to be. This should be about 2 or 3 shades darker at most. Make a note of what level it is so you don't forget when you go to pick out your hair toner . Most brands mark their products with the level to let you know what hair colors it works on. [2] X Research source For example, if your highlights are currently a level 10, you might want them to be a level 7 or 8. If you want to cover the lighter hair completely, Miranda recommends choosing a hair color that is the closest to your natural color. Leave it on your hair for 30 minutes, and then wash it out. [3] X Expert Source Janet Miranda Professional Hair Stylist & Makeup Artist Expert Interview. 11 February 2021."
    },
    {
      "title": "Visit a beauty supply store to pick out the correct color toner.",
      "content": "Visit a beauty supply store to pick out the correct color toner. It's best to do this in person in case you need help from an employee. Choose a toner at the level you'd like your hair to look, making sure to purchase the same brand as the color chart you referred to. [4] X Research source Demi-permanent toners are popular as they only deposit color on top of the hair instead of seeping into the hair follicle. The toner will help neutralize the intense color of your hair, so it isn't so light."
    },
    {
      "title": "Purchase a 10-volume developer to mix with your toner.",
      "content": "Purchase a 10-volume developer to mix with your toner. A 10-volume developer combines with the toner to deposit color on your hair. You'll be able to purchase developer at the beauty store along with your toner. [5] X Research source Try to stick with the same brand for your developer as well."
    },
    {
      "title": "Mix 2 parts developer with 1 part toner in a small bowl.",
      "content": "Mix 2 parts developer with 1 part toner in a small bowl. While the ratio is usually 2:1, refer to the instructions that come with your hair toner to confirm how much developer to use. Use a hair dye application brush to mix the developer and toner together in a small- or medium-sized bowl. [6] X Research source The toner and developer mix to create a relatively thick consistency that's gel-like."
    },
    {
      "title": "Brush the mixture onto sections of your hair using the brush.",
      "content": "Brush the mixture onto sections of your hair using the brush. Apply the toner mixture to only the highlighted sections if you have a steady hand. If you have enough toner and developer, put it on all of your hair. Use the application brush to spread the toner over strands evenly, starting at the roots and working your way down to the ends. [7] X Research source Section off your hair using a clip to separate hair you've already dyed to help you spread the toner more evenly. Don't worry if you get toner on darker sections of your hair, as it won't really affect it."
    },
    {
      "title": "Use a comb to distribute the mixture through your hair.",
      "content": "Use a comb to distribute the mixture through your hair. Combing the toner mixture is an easy way to spread it more evenly through your hair. Make sure you comb through each section of hair, starting at the roots and going down to the ends, to spread the toner down each strand. [8] X Research source Rinse the comb after you're finished to make sure there's no toner or developer left on it."
    },
    {
      "title": "Leave the mixture on for 20-30 minutes, depending on your toner.",
      "content": "Leave the mixture on for 20-30 minutes, depending on your toner. Check the instructions that come with your toner for specific recommendations for how long to wait before rinsing out your hair. It usually falls between 20-30 minutes, but watch your hair as it develops. Once you notice it's reached the correct level, wait 2-5 more minutes before calling it done. [9] X Research source Set a timer so you don't forget how long the toner has been in your hair. Avoid leaving the toner in your hair for more than 30 minutes."
    },
    {
      "title": "Rinse your hair out using cold water.",
      "content": "Rinse your hair out using cold water. Step into the shower and thoroughly rinse out your hair, massaging your scalp to get rid of the toner and developer. Once it's all rinsed out, you're ready to enjoy your new hair. [10] X Research source Be aware that shampooing your hair right after you rinse out the developer and toner may lighten the effects."
    },
    {
      "title": "Spray a colored dry shampoo over your hair for a quick fix.",
      "content": "Spray a colored dry shampoo over your hair for a quick fix. If your highlights are too light against your regular hair color, look for a colored dry shampoo that helps deposit color to even out the overall tone. Spray the dry shampoo all over your hair, using your fingers to rub it onto your roots. Brush through your hair after you've sprayed to make sure it's evenly distributed. [11] X Research source Dry shampoo that's colored comes in shades for blondes and brunettes . Look for tinted dry shampoos at your local beauty or big box store, as well as online. Shake the dry shampoo thoroughly before spraying it on your hair."
    },
    {
      "title": "Try a colored gloss treatment to subtly deepen highlights.",
      "content": "Try a colored gloss treatment to subtly deepen highlights. This works especially well if you have light highlights. A hair gloss is basically a demi-permanent hair dye, which is somewhere between permanent and semi-permanent. A colored gloss treatment tones the hair by coating it with color instead of lifting or lightening the natural color, so it’s less damaging. It’s also a subtle change that’s easy to do at home with a hair glossing kit, so you don’t have to head to the salon. [12] X Research source Gloss treatments are also great for adding shine to get healthier-looking hair. Try a gloss for freshening up fading hair color, too!"
    },
    {
      "title": "Use a color-depositing shampoo to correct a brassy tone.",
      "content": "Use a color-depositing shampoo to correct a brassy tone. Purple shampoos are great for dealing with brassy highlights, whether they're light red, orange, or yellow. When you use the purple shampoo, your hair will absorb some of the purple color, which helps counteract the brassy tones, says Miranda. [13] X Expert Source Janet Miranda Professional Hair Stylist & Makeup Artist Expert Interview. 11 February 2021. Use purple shampoo once a week, leaving it in for five minutes before rinsing it out. [14] X Research source Miranda recommends leaving the shampoo on up to 15 minutes to darken the highlights even more. [15] X Expert Source Janet Miranda Professional Hair Stylist & Makeup Artist Expert Interview. 11 February 2021. Purple shampoos work best with yellow brassy tones. Use a blue toning shampoo for orange brassy tones. Correct red brassy tones with a green color toning shampoo . [16] X Research source Color-depositing shampoo can dry your hair out if you use it too often. However, there are also color-depositing conditioners that help restore moisture while still toning your hair."
    },
    {
      "title": "Visit a salon if you're still not happy with your highlights.",
      "content": "Visit a salon if you're still not happy with your highlights. If you've tried a bunch of different methods and you still think your highlights look too light, it's time to book an appointment with your hairdresser. They'll be able to give you an expert opinion and hopefully fix your hair so that it's exactly how you'd like it to look, says Miranda. [17] X Expert Source Janet Miranda Professional Hair Stylist & Makeup Artist Expert Interview. 11 February 2021. Book your appointment with someone who has experience with color correcting or fixing highlights that are too light. Ask about services like root smudging, shadow roots, or color melting, which are different methods for adding a darker color to help tone down too-bright highlights to get natural-looking results. [18] X Research source"
    },
    {
      "title": "Take precautions to avoid too-light highlights in the future.",
      "content": "Take precautions to avoid too-light highlights in the future. This includes preventative action like asking for balayage instead of highlights, meaning your hair is colored by hand. If you do choose to highlight, try doing it in smaller strips. Always try to bleach your hair for a shorter time than you think is necessary—you can always make it lighter, but you can't un-bleach it. If your highlights are too light due to your salon experience, let your hairdresser know so that the same thing doesn't happen again. For example, if you highlighted your hair in 0.5 cm (0.20 in) strips, try doing 0.25 cm (0.098 in) strips instead."
    }
  ]
}