{
  "url": "https://www.wikihow.com/Cure-Diarrhea",
  "title": "How to Treat & Prevent Diarrhea at Home",
  "steps": [
    {
      "title": "Drink water and other fluids to restore vitamins and minerals.",
      "content": "Drink water and other fluids to restore vitamins and minerals. When you have diarrhea, your body sheds fluids that contain needed vitamins and minerals. It is important to get those minerals back in fluids, especially water and sports drinks. [4] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.). Combatting dehydration is your primary medical concern with diarrhea. If you are vomiting in addition to having diarrhea, be sure to take frequent, small sips of liquid instead of drinking lots of liquid at a time. Other liquids that you can consume to combat dehydration include chicken or beef broth, flavored mineral waters, or rehydration solutions such as Pedialyte. [5] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Caffeine-free liquids are best. Caffeine is a mild diuretic, meaning that it can have a dehydrating effect. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If suffering from diarrhea, stick to liquids that don't have the possibility of dehydrating you even more."
    },
    {
      "title": "Get extra sleep.",
      "content": "Get extra sleep. Not so much a remedy as a common sense treatment supplement, sleep is very necessary when it comes to treating diarrhea. Since diarrhea is a symptom, it is a good indicator that your body is trying to fight off a problem such as a virus. Sleep and rest are among the best ways to help your immune system."
    },
    {
      "title": "Switch to the BRAT diet.",
      "content": "Switch to the BRAT diet. If you’re no longer vomiting (or your symptoms never included vomiting), then you can start taking advantage of the BRAT diet-bananas, rice, applesauce, and toast. These are all low-fiber foods that will help to increase the firmness of your stools. [7] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source They’re also fairly bland in a way that won’t risk further upsetting your stomach. The bananas in this diet also help replace potassium your body has lost through diarrhea. [8] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "Complement the BRAT diet with other options.",
      "content": "Complement the BRAT diet with other options. Though effective as a base to help treat diarrhea , the BRAT diet is not a well-balanced diet. [9] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.). Saltine crackers, boiled potatoes, clear soups, skinless baked chicken, cooked carrots, and other somewhat bland food choices can also help while you’re still experiencing an upset stomach. [10] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source [11] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Some people may also try yogurt. However, the lactose in yogurt can be hard on your stomach while you have diarrhea. If you turn to yogurt, choose a probiotic variety (with live bacterial cultures) to help return helpful bacteria to your stomach and assist with your recovery. [12] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid foods that can worsen symptoms.",
      "content": "Avoid foods that can worsen symptoms. Knowing what not to eat can be just as important as knowing what to eat. In general, you should avoid greasy, spicy, or sweet foods, as well as those high in fiber. [13] X Research source v Milk and other dairy products can also be difficult for some people to digest while experiencing diarrhea. [14] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Also avoid: Gum with sorbitol. Sorbitol is a laxative. Spicy foods, fruits, and alcohol until at least forty-eight hours after diarrhea has subsided. [15] X Research source Anything containing caffeine can speed up your digestive tract and cause diarrhea. [16] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Take a zinc supplement.",
      "content": "Take a zinc supplement. Studies have shown that zinc supplements can improve the outcome when treating diarrhea. [17] X Research source Walker CL, Black RE. Zinc for the treatment of diarrhoea: Effect on diarrhoea morbidity, mortality and incidence of future episodes. Int J Epidemiol. 2010;39(Suppl 1):i63–i69. Zinc is a micronutrient that aids in the synthesis of protein and the transport of both water and electrolytes in the intestines. The World Health Organization recommends taking zinc supplements by mouth—10 mg daily for children under six months, 20 mg daily for children over six months of age. Adults should take according to the manufacturer’s suggested dosing."
    },
    {
      "title": "Resume your normal diet.",
      "content": "Resume your normal diet. Roughly twenty-four to forty-eight hours after your symptoms have subsided, you can return to your normal diet. [18] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Reintroduce foods slowly to see the best result. Use common sense. Start with mild fish or chicken instead of a spicy plate of seasoned pulled pork."
    },
    {
      "title": "Take an over-the-counter, anti-diarrheal absorbent.",
      "content": "Take an over-the-counter, anti-diarrheal absorbent. Absorbents are medicines that bind to the walls of the intestine and colon and absorb water so that your stools are less watery. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Follow package directions for dosage. If using an absorbent, it is important not to take any medication within several hours of taking the absorbent. Absorbents can cause the medication to bind to the intestine and colon, diminishing their medicinal power. For best results, take absorbents and medications separately."
    },
    {
      "title": "Take an OTC medication containing bismuth compounds.",
      "content": "Take an OTC medication containing bismuth compounds. Bismuth compounds, found in common products such as Pepto-Bismol, are reputed to have antibiotic-like properties that counteract the bacteria that produce diarrhea. [20] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source It's not exactly known how bismuth compounds combat diarrhea. They may only be beneficial for patients suffering from traveler's diarrhea or those battling the H. pylori bacterium."
    },
    {
      "title": "Try taking an anti-motility medication.",
      "content": "Try taking an anti-motility medication. Anti-motility medications cause a slowdown in the movement of the intestine and colon. This slowdown relaxes the bowel organs, which gives the organs more time to absorb water, resulting in a less watery stool. Two common anti-motility medications include loperamide and diphenoxylate. Loperamide is available without prescription in various forms (such as Imodium A-D). [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Individuals with infectious diarrhea (such as from E. coli) should avoid anti-motility medications. [23] X Research source Domino, F. (n.d.). The 5-minute clinical consult standard 2015 (23rd ed.)."
    },
    {
      "title": "See a doctor for antibiotics.",
      "content": "See a doctor for antibiotics. If the medications you're taking, in conjunction with bland food and plenty of water, don't seem to improve your case of diarrhea after seventy-two hours, see your doctor. [24] X Expert Source Dale Prokupek, MD Board Certified Internist & Gastroenterologist Expert Interview. 16 April 2020. They may prescribe an antibiotic medication, which will help treat diarrhea caused by a bacterium or parasite. Antibiotics will not help diarrhea caused by a virus. [25] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It is very important to see your doctor if OTC options have proven ineffective because diarrhea from bacterial or parasitic infections can actually worsen due to these medications. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Your doctor will determine the specific antibiotic to prescribe for your symptoms after using a stool culture to identify the bacteria causing the symptoms."
    },
    {
      "title": "See your doctor.",
      "content": "See your doctor. For diarrhea caused by certain types of infections, herbal remedies can actually worsen instead of improve your symptoms. [27] X Research source Consult your doctor before turning to an herbal remedy."
    },
    {
      "title": "Eat probiotics.",
      "content": "Eat probiotics. The living bacteria in some probiotics boost the number of healthy bacteria in your gut, which are often lost due to diarrhea. By reintroducing these healthy bacteria, your digestive tract can get back to normal functioning more quickly. [28] X Expert Source Dale Prokupek, MD Board Certified Internist & Gastroenterologist Expert Interview. 16 April 2020. There are a lot of different probiotics out there designed to help with different issues. Some of them may work better for diarrhea than others. [29] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Probiotics are available as supplements, and they’re also found in probiotic brands of yogurt."
    },
    {
      "title": "Drink chamomile tea.",
      "content": "Drink chamomile tea. Chamomile tea has traditionally been used to treat inflammation, including in the GI tract. Drink up to three cups a day, sipping in small quantities to help your body absorb the liquid. [30] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Note that chamomile can lead to reactions in those allergic to ragweed, and it can also interfere with some medications, including hormonal medications."
    },
    {
      "title": "Try psyllium husk.",
      "content": "Try psyllium husk. Psyllium husk is a soluble fiber (meaning that it absorbs water). It can lead to firmer stool while experiencing diarrhea. Always drink psyllium husk with a large glass of water. [31] X Expert Source Dale Prokupek, MD Board Certified Internist & Gastroenterologist Expert Interview. 16 April 2020. Speak to your doctor before taking psyllium husk if you have inflammatory bowel disease."
    },
    {
      "title": "Try a marshmallow root supplement.",
      "content": "Try a marshmallow root supplement. Marshmallow has also traditionally been used as an inflammation-reducing herb. Follow the manufacturer’s directions for a supplement. [32] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also cold brew this herb as a tea by putting two tablespoons in one quart of water overnight. Strain before drinking. This herb can interfere with some medications—such as lithium—so consult your doctor before taking."
    },
    {
      "title": "Drink a mix with slippery elm powder.",
      "content": "Drink a mix with slippery elm powder. Slippery elm powder has also been used traditionally to soothe inflamed GI tracts. Follow the manufacturer’s instructions. [33] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Steep four grams of the powder in two cups of boiling water, and allow it to steep for three to five minutes. You can drink this up to three times each day while you have diarrhea. Some herbalists believe that slippery elm can lead to miscarriage. Consult with your doctor before taking slippery elm if you’re pregnant or breastfeeding."
    },
    {
      "title": "Try apple cider vinegar.",
      "content": "Try apple cider vinegar. Apple cider vinegar may be good for your gut in small amounts. If you want to give it a shot as a treatment for diarrhea, try stirring 2 teaspoons (9.9 mL) into a cup of warm water. You can drink this mix several times a day. It may not have a huge impact, but there’s evidence it could help. [34] X Research source"
    },
    {
      "title": "Try using an astringent herb.",
      "content": "Try using an astringent herb. Astringent herbs are believed to help dry out the mucous membranes located in the intestines, helping to reduce the amount of loose stool. Most of these options are available as supplements or teas. [35] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source They include: Blackberry leaf Raspberry leaf Carob powder Extract of bilberry Agrimony"
    }
  ]
}