{
  "url": "https://www.wikihow.com/Cope-with-Feeling-Stupid",
  "title": "How to Deal with Feeling Stupid and Improve Your Self-Esteem",
  "steps": [
    {
      "title": "If you often feel stupid, think back to your earliest memory of this hurtful feeling.",
      "content": "If you often feel stupid, think back to your earliest memory of this hurtful feeling. You might have had a relative tell you that you were dumb or maybe you grew up with parents who made you feel bad. Some people who have low self-esteem or anxiety might feel stupid. It's important to identify why you feel this way so you can address it. [1] X Research source Even if you make a silly mistake and feel stupid, you might find that you feel this way because you were embarrassed in front of classmates or co-workers."
    },
    {
      "title": "Being afraid to make mistakes can make you feel stupid, but you're not.",
      "content": "Being afraid to make mistakes can make you feel stupid, but you're not. Wanting to succeed is a natural desire, but you won't always do things right on the first try. Just because you need to fix something or do something again doesn't mean you're not smart. Tell yourself that it's alright to make mistakes and that it doesn't make you less intelligent. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source This is especially important if your fear of feeling stupid is stopping you from trying new things or you're turning down opportunities."
    },
    {
      "title": "If you make a mistake or don't know something, don't feel ashamed.",
      "content": "If you make a mistake or don't know something, don't feel ashamed. Acknowledge that you may need to learn something or do something different in the future, but don't take it to heart. Look for the humor in the situation—after all, no one's perfect. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, if you trip while walking up to your desk, instead of quietly thinking to yourself how stupid you are, make a joke ! You might say, \"Sorry everybody, this is my first time walking.\" A joke can break the tension and you can move on."
    },
    {
      "title": "You're probably your own biggest critic so stop beating yourself up!",
      "content": "You're probably your own biggest critic so stop beating yourself up! When you notice yourself thinking, \"I'm so stupid. I can't believe I did that,\" immediately stop yourself. Then, ask yourself if you'd say that to someone else. If you wouldn't, then don't be so harsh on yourself! Instead, move on with a positive mindset. [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source For example, if accidentally did the wrong assignment and turned it in, just tell yourself that you got some extra practice with that lesson. Then, move on and do the one you were supposed to."
    },
    {
      "title": "It's easy to feel stupid if you don't test well or get high marks.",
      "content": "It's easy to feel stupid if you don't test well or get high marks. The critical thing to remind yourself is that being smart isn't simply a number. Intelligence is about getting new information and skills—essentially, it's the learning process. Part of being smart is learning so you get what you want out of life. [5] X Research source Instead of saying, \"I'm too stupid to get that job,\" you might sign up for a course so you're qualified for the position."
    },
    {
      "title": "Make a list to remind yourself of your skills and great qualities.",
      "content": "Make a list to remind yourself of your skills and great qualities. Whenever you're feeling bad about yourself, read through the list. This is a simple, but really effective way to turn the focus from your negative feelings to an encouraging, supportive mindset. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, you might write that you're really great at leading people or that you make friends easily. If you're having trouble coming up with things, ask your friends and family to share ideas. You might try to add something positive to the list every time you read it."
    },
    {
      "title": "Don't try to muddle through a project—ask for clarification.",
      "content": "Don't try to muddle through a project—ask for clarification. Have you ever gotten an assignment or project and felt totally confused? You're probably not alone—maybe your boss or teacher didn't give enough detail or they spoke too quickly for you to follow. It's completely fine to ask them to repeat and explain what they're looking for. It doesn't mean you're dumb, you just need clarification! [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Think of it this way—it's better to spend a few seconds getting a thorough overview of the project before you start rather than spending time re-doing it or fixing mistakes later."
    },
    {
      "title": "Follow a simple checklist or guideline so you remember what to do.",
      "content": "Follow a simple checklist or guideline so you remember what to do. Everyone gets distracted or makes mistakes and this can make you look stupid. If you frequently mess up and feel like it's reflecting poorly on you, come up with a checklist or list of facts that help you. [8] X Research source For example, if you work in a coffee shop and have to clean equipment, it can help a lot if you've got a step-by-step cleaning list. Say you need a quick reminder about how to place an order for your company. Set a list with a few key bullet points near your computer for easy reference."
    },
    {
      "title": "If there's a gap in your knowledge that's bothering you, learn about it.",
      "content": "If there's a gap in your knowledge that's bothering you, learn about it. By taking charge of what you don't know, you're empowering yourself. Sure, you'll probably forget things or mess up along the way, but don't let that stop you. Studies show that if you approach learning without being afraid of errors, you'll learn more effectively. [9] X Research source For example, if you fail a test, go over it later to see what you missed and how you can do better next time. The better prepared you are, the less nervous you'll be next time. [10] X Expert Source Donna Novak, Psy.D Licensed Clinical Psychologist Expert Interview. 8 December 2020."
    },
    {
      "title": "If you're still struggling with feeling unintelligent, talk with a therapist.",
      "content": "If you're still struggling with feeling unintelligent, talk with a therapist. You may need to tackle your low-self esteem , anxiety , or another mental health issue and they can help! Many therapists use cognitive behavioral therapy where you challenge negative thoughts and recognize why you have them in the first place. [11] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Even just talking with friends or family members can help, too. They'll be able to reassure you of your great qualities."
    }
  ]
}