{
  "url": "https://www.wikihow.com/Decarboxylate-Cannabis",
  "title": "How to Decarboxylate Cannabis",
  "steps": [
    {
      "title": "Prepare the cannabis.",
      "content": "Prepare the cannabis. If you have cannabis that you want to use in cooking, decarboxylation is a vital part of the process. Start by breaking up the cannabis into small pieces. Then put the cannabis onto a baking tray, and spread it across the tray as you would whatever you were cooking."
    },
    {
      "title": "Heat the oven.",
      "content": "Heat the oven. To decarboxylate cannabis, you need to heat it to around 240 degrees Fahrenheit. This is the temperature at which decarboxylation occurs. Heat your oven to this temperature, before placing your baking tray of cannabis into it."
    },
    {
      "title": "Put the cannabis in the oven.",
      "content": "Put the cannabis in the oven. When the oven is up to temperature, place your tray of cannabis in there. To achieve the maximum amount of decarboxylation, you need to heat it until the bubbling dissipates. There is no fixed amount of time you should leave it in there for, but around an hour is generally considered to produce the best results. Keep an eye on it, and give it a quick stir every ten minutes or so. Cannabis with a higher moisture content may take longer than an hour, but you should never raise the temperature above 240 degrees Fahrenheit."
    },
    {
      "title": "Allow it to cool.",
      "content": "Allow it to cool. After around an hour, you should remove the cannabis from the oven and allow it cool. You will notice that the colour will have changed, and become a medium brown. You will also notice it has dried and it should have quite a crumbly texture. Once it has cooled you can grind it in a food processor so that is in made into a small enough powder to use easily in cooking. Store it in an airtight container like your other herbs and use as appropriate."
    },
    {
      "title": "Know what decarboxylation is.",
      "content": "Know what decarboxylation is. The marijuana flower contains THCA, which in its natural state, is not psychoactive. The psychoactive THC is only created through the process known as decarboxylation. By heating the THCA, that THC is activated and can then be absorbed when consumed."
    },
    {
      "title": "Recognise why to do it.",
      "content": "Recognise why to do it. The main reason to decarboxylate cannabis is to achieve the maximum potency and efficiency for oral consumption, rather than for medicinal purposes. A separate process of decarboxylation is not necessary when cannabis is smoked or vaporized, because the heating involved releases the THC without needing any prior decarboxylation. [1] X Research source"
    },
    {
      "title": "Act responsibly.",
      "content": "Act responsibly. Decarboxylation can greatly increase the potency of cannabis. If you are cooking something and are going to include decarboxylated cannabis, be sure to act sensibly and recognise just how potent it might be. It can easier to consume a larger amount of cannabis in food than by smoking. The difference between the edible and the topical approach to CBD is that the topical application is more concentrated and focused on a particular area. Consuming it orally has more of a systemic effect. It depends on what you want to use it for. Some people use it for both purposes. For example, people with chronic pain may take it orally and apply it on their neck and lower back."
    }
  ]
}