{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Cold-Sore-Fast",
  "title": "How to Get Rid of a Cold Sore Fast",
  "steps": [
    {
      "title": "Apply topical cold sore cream to combat pain and symptoms.",
      "content": "Apply topical cold sore cream to combat pain and symptoms. There are a lot of over-the-counter options you can go with, but your doctor could prescribe a stronger treatment. Creams help with redness, soreness, and inflammation, and may speed up healing time. Some topical treatments you can try include: [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Docosanol (Abreva), which is FDA-approved and available over-the-counter. Topical Acyclovir (Zovirax) and Penciclovir (Denavir), which may be prescribed to you by your doctor. Creams with 1% topical ointment of lemon balm oil or 0.5% aloe vera extract, which may help a cold sore heal when you first notice it. [2] X Expert Source Andrea Rudominer, MD, MPH Board Certified Pediatrician & Board Certified Integrative Medicine Doctor Expert Interview. 6 May 2020. 5 drops of eucalyptus essential oil, 3 drops of bergamot, and 2 drops of tea tree essential oil in 1 ounce of a carrier oil work well for cold sores as well. [3] X Expert Source Andrea Rudominer, MD, MPH Board Certified Pediatrician & Board Certified Integrative Medicine Doctor Expert Interview. 6 May 2020."
    },
    {
      "title": "Relieve pain with ibuprofen or acetaminophen.",
      "content": "Relieve pain with ibuprofen or acetaminophen. While they won't make your cold sore go away, these medications will help you deal with any discomfort or swelling. Take the recommended dosage on the packaging and wait for your pain to subside. Just remember to keep being careful since the sore is still contagious even when it’s not causing pain. [4] X Research source Avoid using ibuprofen if you have asthma or stomach ulcers."
    },
    {
      "title": "Apply a gel patch to hide the sore while it’s healing.",
      "content": "Apply a gel patch to hide the sore while it’s healing. Cold sore patches have hydrocolloid gel that creates a tight seal around the wound so it heals faster. Look for a patch that’s large enough to cover your cold sore at your local pharmacy and press it tightly on against your skin. [5] X Research source"
    },
    {
      "title": "Try taking lysine.",
      "content": "Try taking lysine. Lysine is a building block of protein, and has been shown in studies to effectively treat and prevent cold sores. Pick up some lysine from your local health food store or the supplement section of your nearest pharmacy. Aim to take around 3 grams of lysine every day to help reduce your symptoms. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Talk to your doctor before taking lysine if you have cardiovascular or gallbladder disease since it may have adverse effects."
    },
    {
      "title": "See your doctor for prescription antiviral pills.",
      "content": "See your doctor for prescription antiviral pills. These can help decrease the duration of your cold sores, but you'll need to get a prescription from your doctor. Schedule an appointment with them and let them fill out the prescription. Start the medications as soon as you can following your doctor’s orders. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Start Acyclovir (Xerese, Zovirax) before cold sores fully flare up. Take it 5 times a day for 5 days. Take Valacyclovir (Valtrex) at the first sign of a cold sore and then 12 hours later. Famciclovir (Famvir) can be given as a single dose of medicine."
    },
    {
      "title": "Apply aloe vera to treat pain and prevent spread.",
      "content": "Apply aloe vera to treat pain and prevent spread. Aloe reduces pain and has antiviral properties, so it's a really good thing to use to help heal your cold sore. Put aloe gel with a 0.2–5% concentration onto a cotton swab and dab it onto the cold sore for instant relief. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Use aloe about 2–3 times a day, or whenever you need relief. Avoid touching your cold sore directly with your hands so you don’t accidentally spread the virus. Only dab the aloe gel onto the sore. If you rub it in, you could irritate your skin."
    },
    {
      "title": "Use a cold compress to bring down redness.",
      "content": "Use a cold compress to bring down redness. Wet a towel with cool water or grab an ice pack and hold it against your cold sore. Keep it there for 5–10 minutes as many times as you want during the day. The cold temperature might help promote healing, but it will definitely get rid of crusty skin and make the sore less noticeable. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can instead wet the towel with warm water to treat pain from cold sore blisters."
    },
    {
      "title": "Apply petroleum jelly to prevent cracked skin.",
      "content": "Apply petroleum jelly to prevent cracked skin. Dip the end of a cotton swab into a tub of petroleum jelly and gently dab it onto your cold sore. If the skin around your sores looks dry or cracked, apply more petroleum jelly there too. Sores heal faster when they’re moist, so the petroleum jelly will prevent it from drying out and may make your sore disappear sooner. [10] X Research source"
    },
    {
      "title": "Suck on ice for pain relief, burning, or itching.",
      "content": "Suck on ice for pain relief, burning, or itching. Put a couple of ice cubes in your mouth and run them over your lips to help cool down your sore. The cold temperatures will help ease pain around your sore and make it a little more manageable. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source While this doesn’t necessarily make your cold sore heal faster, it will make it a lot easier to live with while it goes away."
    },
    {
      "title": "Apply propolis to speed up healing.",
      "content": "Apply propolis to speed up healing. Propolis, also known as synthetic beeswax, may shorten the length of your cold sore. Look at your local pharmacy for a 3% propolis ointment and apply it to your cold sore with a cotton swab. Use the propolis up to 5 times a day. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Try using rhubarb and sage as a natural antiviral.",
      "content": "Try using rhubarb and sage as a natural antiviral. Look for a cream that contains rhubarb and sage extract at your local pharmacy or online. Apply the cream directly to your cold sore with a cotton swab. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Some studies have found that cream may be as effective as a prescription. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Keep your lips protected from the sun at all times.",
      "content": "Keep your lips protected from the sun at all times. Getting too much sun can irritate your skin and could cause a cold sore to pop up. Apply lip balm with sun protection of at least SPF 15 when you go out in the sun. Reapply it frequently throughout the day so your lips stay protected. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you do overexpose your lips to the sun, try to ice them as soon as possible for several minutes."
    },
    {
      "title": "Avoid sharing items or kissing to stop the spread of the virus.",
      "content": "Avoid sharing items or kissing to stop the spread of the virus. Cold sores are caused by the herpes simplex virus, and it usually spreads through bodily fluids. It could be present on an infected person’s lip, even if there’s no obvious sore. Never share eating utensils or beverages with anybody, especially when you have an active cold sore. Even towels, razors, and toothbrushes can spread cold sores so never use anyone else’s. Kissing also spreads cold sores, so be mindful of who you’re with. [16] X Research source Avoid sharing lipstick, lip balm, lip gloss, or other lip products. Oral sex, especially during an outbreak, can transmit the herpes virus from lips to the genitals or vice versa."
    },
    {
      "title": "Avoid cold sore triggers.",
      "content": "Avoid cold sore triggers. Since the cold sore virus lies dormant in your skin, there’s a possibility that your cold sores will recur. A lot of things can cause a cold sore to come back, including hormonal changes, fatigue, injuries, or even another viral infection. Try your best to stay away from anything that may cause a new cold sore to emerge. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Menses and pregnancy can cause a cold sore to act up."
    },
    {
      "title": "Practice stress relief.",
      "content": "Practice stress relief. Stress may trigger cold sore outbreaks, so do everything you can to relax. Set some time aside each day to meditate , take deep breaths, or take a hot bath at the end of the night. Whenever you’re feeling stressed out, take a moment to clear your mind and calm down. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Maintain a healthy diet and lifestyle.",
      "content": "Maintain a healthy diet and lifestyle. Getting sick weakens your immune system and could lead to a breakout. [19] X Research source Make sure you're getting all your necessary vitamins. Eat lots of dark leafy greens, colorful vegetables, nuts, lean meats, and fruit. Limit the amount of fat, sugar, and processed food in your diet as well. [20] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source Be sure to set aside 30 minutes a day to get physically active and exercise since it also helps your body fight against disease. [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Drink white and green tea since they’re rich in antioxidants that strengthen your immune system and cleanse your body of toxins. Stay hydrated throughout the day by drinking water whenever you’re thirsty. Try to sleep for at least 8 hours each night so your body has time to recover."
    },
    {
      "title": "Identify cold sores before they surface.",
      "content": "Identify cold sores before they surface. Know the signs so you can act before your cold sore has a chance to form. If you feel tenderness, tingling, burning, itching, numbness, and pain around your lips, it may mean a cold sore is forming. When you first start getting a cold sore, you’ll develop red, irritated skin around the area. Then, a blister forms, bursts, and crusts over before it starts healing. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You may get fevers and other cold and flu symptoms when you get cold sores."
    },
    {
      "title": "Know that cold sores are caused by several variations of the herpes simplex virus (HSV).",
      "content": "Know that cold sores are caused by several variations of the herpes simplex virus (HSV). Despite the name, cold sores aren’t caused by colds. The herpes simplex virus type 1 (HSV-1) is most often the cause. It's really common, and you get it from contact with an infected person’s skin or body fluid. Although you can't eliminate the virus, you can reduce how often you have outbreaks. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Cold sores form as the virus reproduces and damages your skin. The herpes virus hides in nerve cells between outbreaks so it can never be fully cured. Once your skin turns itchy and red, the virus is present and you can spread it. You’re most contagious when you have blisters, especially just after they burst. You can’t spread the virus skin-to-skin once they’ve healed. However, you can pass it through your saliva at any time."
    }
  ]
}