{
  "url": "https://www.wikihow.com/Create-an-Apple-ID-Without-a-Credit-Card",
  "title": "How to Make an Apple ID Without Entering Your Credit Card Info",
  "steps": [
    {
      "title": "Yes, you can make an account with no payment method.",
      "content": "Yes, you can make an account with no payment method. While adding a payment method to your account makes it easier to do things like purchasing apps in the App Store , buying music in the iTunes store, or making in-app payments, it isn’t required to set up a new Apple Account. You can simply select “None” when prompted for a payment method during setup. You can always add a payment method later if you like. If you do add a credit card or other payment method when setting up your account, you won’t be charged unless you make a purchase."
    },
    {
      "title": "Sign out of the current Apple Account.",
      "content": "Sign out of the current Apple Account. If you aren't signed into an Apple Account at all, skip this step. To sign out: Open Settings Tap your name card at the top of the page. Scroll down and tap Sign Out Enter your Apple ID password to confirm."
    },
    {
      "title": "Open the App Store.",
      "content": "Open the App Store. It's the blue app with a white \"A\" on it. You'll be able to create a brand-new Apple Account from here. [1] X Research source Alternatively, you can select Create New Apple Account by going to Settings > Apple Account > Don’t have an Apple Account? to get started creating a new account. If you’re setting up a new iPhone or iPad, you’ll be prompted to sign in or create a new account during the setup process. The steps for creating your account might vary slightly depending on which method you choose, but none of these methods require you to provide a credit card number."
    },
    {
      "title": "Tap the account icon.",
      "content": "Tap the account icon. It looks like a simplified icon of a person’s head and shoulders. You’ll see it in the top right corner of the screen."
    },
    {
      "title": "Tap Create New Apple Account.",
      "content": "Tap Create New Apple Account . You’ll see this option in the new menu that opens up."
    },
    {
      "title": "Enter your Apple Account information.",
      "content": "Enter your Apple Account information. Follow the prompts to provide the following information: The email address that you want to use for your Apple Account. A strong password. Your country and region. Your agreement to the Terms and Conditions (toggle the switch On)."
    },
    {
      "title": "Select None when prompted for your payment information.",
      "content": "Select None when prompted for your payment information. When you are prompted to supply a payment method, select None . You can always provide a payment method later if you want to make a purchase in the App Store."
    },
    {
      "title": "Confirm your phone number.",
      "content": "Confirm your phone number. Follow the prompts to confirm the number associated with your account. Tap Next when you’re done."
    },
    {
      "title": "Verify your email address.",
      "content": "Verify your email address. Once you’ve completed the setup, you should receive an email at the address you provided. Follow the instructions in the email to verify your address. Once you’ve done that, you can sign in and start using your new Apple Account!"
    },
    {
      "title": "Open System Settings.",
      "content": "Open System Settings. Click the Apple Menu at the top left corner of your screen and select System Settings . From there, you can set up a new Apple Account. [2] X Research source If you’re already signed into an Apple Account, click your Apple Account name at the top left side of the System Settings window, scroll down, and click Sign Out… . To make a new Apple Account without signing out of your current one, use the Apple Account website instead."
    },
    {
      "title": "Click Sign in.",
      "content": "Click Sign in . This option will appear at the top of the lefthand menu bar in the System Settings window."
    },
    {
      "title": "Select Don’t Have an Account?.",
      "content": "Select Don’t Have an Account? . This button is in the lower right corner of the window."
    },
    {
      "title": "Fill in the requested info.",
      "content": "Fill in the requested info. On the next screen, you’ll be asked to provide basic info such as your birthdate, the email address you’d like to use for your account, a strong password, and your country or region."
    },
    {
      "title": "Select None when prompted for payment info.",
      "content": "Select None when prompted for payment info. After you fill out your account information, you’ll be asked to provide a payment method and billing address. Choose None , then click Continue ."
    },
    {
      "title": "Finish setting up your account.",
      "content": "Finish setting up your account. Provide and verify a phone number, then follow the prompts to verify your email address. You can now sign in and start using your new Apple Account."
    },
    {
      "title": "Open the Apple Account site.",
      "content": "Open the Apple Account site. Go to https://account.apple.com/ . This will open the login page. You can use this method to set up an Apple Account on any device, and you will not be prompted to provide any credit card information using this method. If this opens a current Apple Account page, log out before continuing."
    },
    {
      "title": "Click Create Your Apple Account.",
      "content": "Click Create Your Apple Account . It's a link in the upper-right corner of the page. Doing so will open the Apple Account creation form."
    },
    {
      "title": "Enter your account information.",
      "content": "Enter your account information. On the next page, enter your name, country or region, birthday, email address, password, and phone number. Choose how you’d like to verify your number (with a text or phone call) and whether you’d like to receive communications from Apple. Complete the Captcha challenge, then click Continue ."
    },
    {
      "title": "Verify your email address and phone number.",
      "content": "Verify your email address and phone number. Follow the prompts on the screen to finish setting up your account. You may be prompted to enter a code that is texted to your phone number and click a verification link in an email that’s sent to your address."
    },
    {
      "title": "Open iTunes on a Windows computer.",
      "content": "Open iTunes on a Windows computer. If you’re using Windows, you can use this method to create an Apple Account from your desktop. [3] X Research source"
    },
    {
      "title": "Click Account.",
      "content": "Click Account . This option is in the menu bar at the top of the app window."
    },
    {
      "title": "Select Sign In > Create New Apple Account.",
      "content": "Select Sign In > Create New Apple Account ."
    },
    {
      "title": "Fill in your account information.",
      "content": "Fill in your account information. Enter your email address, password, and region."
    },
    {
      "title": "Choose None as your payment option.",
      "content": "Choose None as your payment option. In the section asking for your payment method and billing information, select None . Click Continue to move to the next step."
    },
    {
      "title": "Verify your email address.",
      "content": "Verify your email address. You should get a message at the email address you provided. Follow the instructions in the email to verify your account. You can now sign in with your new Apple Account."
    }
  ]
}