{
  "url": "https://www.wikihow.com/Get-Enough-Protein-on-a-Raw-Food-Diet",
  "title": "How to Get Enough Protein on a Raw Food Diet",
  "steps": [
    {
      "title": "Select a variety of fruit.",
      "content": "Select a variety of fruit. Many types of fruit contain 4 – 8% protein. This is less than many other high-protein plant sources, but eating a variety of high-protein fruits can boost your protein intake and ensure you get other vital nutrients. The following is a list of the fruit with the highest amount of protein: [1] X Research source Avocado, 4 g each Guavas, 1.4 g each Passion Fruit, 5.2 g per cup Pomegranate, 4.7 g each Mulberries, 2 g per cup Blackberries, 2 g per cup Apricots, .5 g each Raspberries, 1.5 g per cup Nectarines, 1.5 g each Oranges, 1.3 g each White Grapefruit, 1 g per 1/2 fruit Peaches, 1.4 g each Cantaloupe, 0.9 g per wedge Strawberries, 1.1 g per cup (sliced)"
    },
    {
      "title": "Enjoy some leafy greens.",
      "content": "Enjoy some leafy greens. Many vegetables contain protein, but leafy greens in particular pack a punch of this nutrient. Incorporate some leafy greens into each meal of your day to increase the amount of protein in your raw diet. The leafy greens with the highest amount of protein per cup are: Kale, 4 g Collard greens, 2 g Mustard greens, 1.5 g Turnip greens, 1.2 g Cabbage, 1 g Spinach, 0.86 g Swiss chard, 0.7 g"
    },
    {
      "title": "Add some bonus veggies.",
      "content": "Add some bonus veggies. Although leafy greens often have more protein, many other vegetables also have this nutrient. Adding some other vegetables to your leafy greens can help you get a broad range of vital nutrients and boost your protein intake . The vegetables with the highest amount of protein per cup are: Broccoli, 2 g per cup Peas, 4 g (per ½ cup) Asparagus, 2 g (per five spears) Beets, 2 g Carrots, 2 g Cauliflower, 2 g Bell peppers, 1 g Celery, 1 g Cucumber, 1 g Onion, 1 g (per ½ cup)"
    },
    {
      "title": "Crunch on nuts and nut butters.",
      "content": "Crunch on nuts and nut butters. There is a reason you often see nuts in things like trail mix and energy bars: they are nutritional powerhouses. The same holds true for raw nut butters. Eat a variety of nuts in addition to your healthy raw diet. The following are the nuts and nut butters highest in protein per ounce: [2] X Research source [3] X Research source Peanuts, 7 g Pine nuts, 7 g Almonds, 6 g Pistachios, 6 g Mixed nuts, 4 g"
    },
    {
      "title": "Enjoy seeds and seed butters.",
      "content": "Enjoy seeds and seed butters. Seeds are another ingredient you might also see in trail mix and energy bars. This is because they're nutritional powerhouses like nuts. You can add seeds and seed butters to any food you like. They're also a nice alternative if you don't like nuts. The following are the seeds are high in protein: [4] X Research source Pumpkin seeds, 8.5 g per ounce Flaxseed, 7.5 g per ¼ cup Sunflower seeds, 5.5 g per ounce Chia seeds, 4.7 g per ounce"
    },
    {
      "title": "Boost a smoothie with spirulina.",
      "content": "Boost a smoothie with spirulina. Spirulina is a blue-green algae that can increase your daily protein intake. You can add a teaspoon to your favorite smoothie for a boost of protein. One teaspoon of spirulina has 2 g of protein and a tablespoon has 6 g. Throw in a handful of leafy greens like spinach or kale, which won't alter the taste of your smoothie."
    },
    {
      "title": "Try sashimi or ceviche.",
      "content": "Try sashimi or ceviche. Although many people who follow a raw diet are vegans, both vegetarians and omnivores also follow the raw food diet. If you are an omnivore, you can enjoy raw fish dishes such as sashimi and ceviche. Both of these are high in protein and can provide a much needed boost to your plant-based protein sources. Choose sashimi, which is usually thinly sliced fish. In most cases, salmon and tuna are the types of fish used. [5] X Research source Salmon sashimi has 5.6 g per ounce and white tuna has 7.2 g per ounce. You can also try sashimi made from eel at 6.7 g per ounce or sardine, which has 7 g per ounce. [6] X Research source Make ceviche, which is a Latin American dish of raw fish or seafood marinated in citrus juice. [7] X Research source A ¼ cup of ceviche has 13 g of protein."
    },
    {
      "title": "Try carpaccio.",
      "content": "Try carpaccio. Carpaccio is an Italian delicacy that is made of thin slices of raw meat such as beef. A 3 ounce serving of beef carpaccio has 25 g of protein. [8] X Research source Keep in mind that eating raw or undercooked meat can cause serious illness or even death. [9] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Consider raw dairy products.",
      "content": "Consider raw dairy products. Milk, cheese, and other dairy products such as yogurt are all very high in protein, but for many raw dieters, they're off limits because the process of pasteurization heats dairy to remove pathogenic bacteria. [10] X Research source If you would like to boost your protein, consider trying raw dairy products. Animal milks have 8 g of protein per 8 ounces. [11] X Trustworthy Source Dairy Council of California Resource center focused on providing nutrition education to help consumers make healthy choices about eating and lifestyle habits. Go to source Locate local farms and stores that sell raw milk and milk products by using an online sites. A Campaign for Real Milk can also help you find local farms that sell unpasteurized dairy products at http://www.realmilk.com/real-milk-finder/ . Raw, unpasteurized milk is illegal in some states. [12] X Research source Vary your dairy options by choosing different milks and milk products such as cow, goat, and sheep. Keep in mind that consuming unpasteurized dairy products can expose you to dangerous bacteria including Salmonella , E. coli , and Listeria . All of these can cause serious illness. [13] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Pregnant people are strongly discouraged from consuming raw dairy."
    },
    {
      "title": "Speak to your doctor.",
      "content": "Speak to your doctor. Before starting any diet, schedule an appointment with your doctor. They can advise you if you are healthy enough for the raw diet. Ask your doctor for a referral to a registered dietitian who may can help you create a meal plan to make sure you're getting enough protein on a raw diet. Be honest with your doctor about your plans to be on a raw diet as well as the reasons why. Ask any questions you may have about the diet's safety for your personal health."
    },
    {
      "title": "Figure out how much protein you need.",
      "content": "Figure out how much protein you need. Every individual needs protein to maintain his or her health and wellbeing. It helps you build muscle and make things like hair, blood, connective tissue, and antibodies. The Recommended Daily Allowance (RDA) of protein for an individual is 0.8 g per kilogram body weight. Aim to get your personal RDA every day. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Calculate how much protein you need by using an online protein calculator, such as this one from United States Department of Agriculture: https://www.nal.usda.gov/human-nutrition-and-food-safety/dri-calculator . Keep in mind that the RDA is for a sedentary adult. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Keep your diet varied.",
      "content": "Keep your diet varied. For any person, it's important to vary his or her food choices. This ensures you get the broad range of vital nutrients to maintain your health and wellbeing. As someone on a raw food diet, eating a variety of foods is especially important because there are many things you can't eat. Aim to incorporate as many different (naturally) colored foods as you can at each meal. Try having a smoothie for breakfast with an avocado, some fresh berries, a handful of spinach or kale, and some spirulina. You can mix this with either fresh pressed juice or ice. For lunch, have a big mixed salad with foods like watercress, carrots, cucumbers, tomatoes, some pumpkin seeds and almonds. You can have sashimi for dinner with a cold soup such as gazpacho. If you don't eat meat or dairy, have some peanut butter and a selection of cut fruits and vegetables."
    }
  ]
}