{
  "url": "https://www.wikihow.com/Get-Rid-of-Dandruff-(Natural-Methods)",
  "title": "How to Get Rid of Dandruff (Natural Methods)",
  "steps": [
    {
      "title": "Mix tea tree oil into your shampoo to moisturize your scalp and fight fungus.",
      "content": "Mix tea tree oil into your shampoo to moisturize your scalp and fight fungus. Dandruff can be caused by an overgrowth of fungus on your scalp. The natural antimicrobial and antifungal properties of tea tree oil may help combat this problem. Purchase a shampoo with a 5% concentration of tea tree oil, or put 5-10 drops of tea tree oil into the bottle with your regular shampoo and shake it up thoroughly, then wash your hair as usual. Continue using this treatment until your dandruff improves. [1] X Research source Tea tree oil is toxic when swallowed. Never use it in or near your mouth. If you accidentally get tea tree oil in your eyes, rinse them immediately with warm water and call your doctor if you experience redness or irritation. Don’t apply undiluted tea tree oil directly to your scalp, since it can cause itching and irritation. Stop using any products containing tea tree oil if you experience an allergic reaction, such as a rash, itching, stinging, or burning. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use lemongrass oil mixed into shampoo to soothe inflammation.",
      "content": "Use lemongrass oil mixed into shampoo to soothe inflammation. Like tea tree oil, lemongrass oil has antimicrobial properties that may be helpful for treating some types of dandruff. It can also reduce inflammation of the scalp. Get a 10% lemongrass oil shampoo, or add a few drops of lemongrass oil to your regular shampoo or conditioner. [3] X Research source You may need to use the lemongrass oil treatment for 2-3 weeks for the best results. Don’t apply undiluted lemongrass oil directly to your scalp, since it may cause irritation."
    },
    {
      "title": "Massage some aloe vera gel into your scalp for a soothing treatment.",
      "content": "Massage some aloe vera gel into your scalp for a soothing treatment. To treat dandruff, rub a generous amount of pure aloe vera gel directly into your scalp and let it sit for up to 1 hour. When you’re done, wash your hair with a mild shampoo and rinse your hair and scalp thoroughly. Use this treatment 2-3 times a week until your symptoms improve. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Aloe vera gel is rich in antioxidants and amino acids, and its moisturizing and anti-inflammatory properties may promote faster healing of damaged or irritated skin. It also has antifungal and antimicrobial properties. All these factors make aloe an excellent natural dandruff treatment. [5] X Research source You can either purchase aloe vera gel or collect some directly from the cut leaf of a live aloe plant. Some people find aloe gel irritating, so dab a small amount on your wrist and watch for a reaction before applying it to your scalp. Ideally, you should wait a full 24 hours to see if there’s a reaction, but you’ll likely notice something sooner. Stop using aloe if you experience symptoms such as a rash, itching or irritation, or increased sensitivity to sunlight (i.e., your skin burns more easily than usual)."
    },
    {
      "title": "Try a coconut oil treatment to reduce inflammation and add moisture.",
      "content": "Try a coconut oil treatment to reduce inflammation and add moisture. While there’s not a lot of research on the effectiveness of coconut oil for treating dandruff, there’s some evidence that it can help with related skin conditions, such as atopic dermatitis.To use coconut oil, rub 2 tablespoons (30 mL) of the oil directly into your scalp and let it sit for 5-10 minutes before rinsing it out. [6] X Research source You can also put a shower cap over your hair and leave the coconut oil on your scalp overnight if you wish. Rinse the oil out with warm water when you get up in the morning. You may need to warm up the coconut oil by rubbing it between your hands for a few minutes or mixing it with a small amount of warm water before you can spread it over your scalp. Another option is to purchase shampoo that contains coconut oil. Look for pure coconut oil in your local grocery store or health food store."
    },
    {
      "title": "Wash your scalp with baking soda for a deep, exfoliating clean.",
      "content": "Wash your scalp with baking soda for a deep, exfoliating clean. Baking soda can scrub away dandruff flakes and may also help fight the fungus that sometimes causes dandruff. To clean your scalp and hair with baking soda, make a paste using 3 ⁄ 4 cup (180 mL) of water and 4 tablespoons (58 g) of baking soda. Work the mixture into your scalp and hair and let it sit for 1-3 minutes before rinsing it out. [7] X Research source If you like, you can also add a few drops of tea tree oil for extra dandruff-fighting benefits. Using baking soda on your hair too frequently can dry out your hair and irritate your scalp. Try using this approach no more than once a week, and stop if you experience irritation or notice that your hair is becoming dull and dry. You can offset some of the harsh effects of baking soda by following up with a moisturizing conditioner containing coconut or argan oil."
    },
    {
      "title": "Add crushed aspirin to your shampoo for a homemade salicylic acid wash.",
      "content": "Add crushed aspirin to your shampoo for a homemade salicylic acid wash. Aspirin contains salicylic acid, a compound that occurs naturally in the bark of willow trees. Because it can help clear oily skin and reduce inflammation, salicylic acid is a common ingredient in dandruff treatments. Try crushing up 1-2 uncoated aspirin tablets and mixing them with 1 tablespoon (15 mL) of your shampoo next time you wash your hair. Shampoo your hair as usual, but leave the shampoo on your hair for 2-3 minutes before rinsing it out. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also purchase a salicylic acid dandruff shampoo. Stop using this treatment if you experience irritation, redness, burning, or signs of an allergic reaction, such as itching, hives, or swelling. [9] X Research source Try using this treatment twice a week for up to 4 weeks, or until your symptoms improve. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Incorporate more omega 3 fatty acids into your diet.",
      "content": "Incorporate more omega 3 fatty acids into your diet. Omega 3s are a type of healthy fat that may improve your skin and hair’s health, among other benefits. If you struggle with dandruff, try eating more foods that are rich in omega 3s, such as fatty fish (like salmon, mackerel, and tuna), nuts, seeds, and seed oils. [11] X Research source You can also get omega 3 fatty acids from supplements, such as fish oil tablets. Aim to eat 1.1 to 1.6 grams of omega 3 fatty acids each day."
    },
    {
      "title": "Eat a diet rich in fruits and vegetables to reduce your risk of skin disorders.",
      "content": "Eat a diet rich in fruits and vegetables to reduce your risk of skin disorders. Studies show that people who eat plenty of fruits and vegetables are less likely to develop skin conditions related to dandruff, such as seborrheic dermatitis. Try eating a rainbow of fruits and vegetables each day so that you get a variety of essential nutrients, vitamins, and minerals. [12] X Research source Good vegetable options include leafy greens, beans and peas, cruciferous vegetables (such as broccoli and cauliflower), and colorful veggies like carrots, radishes, peppers, and purple sweet potatoes. You can also get a range of vitamins and minerals by eating a wide variety of fruits, including berries, apples, citrus fruits, bananas, grapes, and melons. Aim to eat 5 servings of vegetables and 4 servings of fruit each day. Check a chart like the one here to determine how large a single serving is for various kinds of veggies and fruits: https://www.heart.org/en/healthy-living/healthy-eating/eat-smart/nutrition-basics/what-is-a-healthy-diet-recommended-serving-infographic ."
    },
    {
      "title": "Consume more biotin-rich foods to support healthy skin and hair.",
      "content": "Consume more biotin-rich foods to support healthy skin and hair. Biotin is an essential B vitamin that can help improve the health of your hair, skin, and nails. Talk to your doctor about taking biotin supplements, or get it from food sources, such as: [13] X Research source Egg yolks Nuts Salmon Liver Nutritional yeast, which you can use as a topping in place of butter or cheese, or stir into creamy soups or egg dishes."
    },
    {
      "title": "Talk to your doctor about taking zinc to boost healthy cell growth.",
      "content": "Talk to your doctor about taking zinc to boost healthy cell growth. Zinc is an important dietary mineral that plays a role in keeping your immune system healthy. It may also promote faster healing and help prevent conditions that affect your skin, hair, and scalp. Talk to your doctor about whether zinc supplements might be helpful to you. [14] X Research source You can also get zinc from dietary sources, such as red meat, shellfish, legumes (such as chickpeas and lentils), nuts and seeds, eggs, dairy products, whole grains, and potatoes. [15] X Research source"
    },
    {
      "title": "Do stress-relieving activities to improve your overall health.",
      "content": "Do stress-relieving activities to improve your overall health. The relationship between stress and dandruff isn’t clear, but some studies show that people with high levels of stress and anxiety are more likely to have skin conditions like atopic dermatitis. If you already have dandruff, it’s possible that stress can make it worse. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you’re stressed, try to minimize it by: Doing relaxing activities, such as yoga or meditation Spending time with friends and family Engaging in hobbies and creative activities that you enjoy Listening to peaceful music Getting plenty of good-quality sleep"
    },
    {
      "title": "See your doctor if you notice signs of infection in your scalp.",
      "content": "See your doctor if you notice signs of infection in your scalp. Dandruff doesn’t usually require medical treatment, but sometimes it can be associated with more serious conditions. There’s no need to see your doctor if you have some flakes with no other symptoms. However, you should make an appointment if you have dandruff accompanied by symptoms such as redness, tenderness, or swelling in your scalp. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Symptoms like these could also indicate that you have another skin condition, such as seborrheic dermatitis."
    },
    {
      "title": "Get medical treatment if your dandruff is severe or doesn’t respond to home care.",
      "content": "Get medical treatment if your dandruff is severe or doesn’t respond to home care. If you have very heavy dandruff or if home treatments aren’t helping, it may be time to see a doctor. You should also call your doctor if you have severe itching and discomfort along with dandruff. They can identify the cause of your dandruff and prescribe an appropriate treatment. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For example, if your dandruff is caused by an inflammatory disease, a corticosteroid treatment or immune response inhibitor might help. For persistent fungal infections of the scalp, your doctor might prescribe a strong antifungal shampoo or medication."
    },
    {
      "title": "Seek medical attention if you have dandruff with a weakened immune system.",
      "content": "Seek medical attention if you have dandruff with a weakened immune system. If you have a condition that weakens your immune system, such as an inherited immune deficiency disorder, HIV/AIDS, cancer, or diabetes, call your doctor if you develop dandruff. Your doctor can check if the dandruff is caused by an infection in your scalp, and treat it if it is. Some medications, such as steroids and chemotherapy drugs, can also weaken your immune system. See your doctor if you develop dandruff while taking one of these medications. Untreated skin infections can lead to serious complications if you have a weakened immune system, so don’t hesitate to get it checked out."
    }
  ]
}