{
  "url": "https://www.wikihow.com/Get-Relaxer-Out-of-Hair",
  "title": "How to Get Relaxer Out of Hair",
  "steps": [
    {
      "title": "Look for short hairstyles that will flatter your face.",
      "content": "Look for short hairstyles that will flatter your face. Since you'll be cutting off all of the relaxed hair, your hair will end up pretty short. That doesn't mean it can't be beautiful, though! Go online or look in magazines for pictures of people with very short hair. Try to find a haircut you like on a person that has a similar face shape to give you an idea of what the style will look like on you. For instance, choose a celebrity haircut like Halle Berry's. Bring a picture to the salon so your stylist knows what you're looking for."
    },
    {
      "title": "Wash your hair and allow it to dry naturally.",
      "content": "Wash your hair and allow it to dry naturally. Use shampoo and conditioner in the shower and rinse it out with cool water. Allow your hair to air dry fully. Depending on the length and thickness of your hair, this could take a few hours. Do not use any sort of heat styling tools on your hair. [1] X Research source Seeing your natural texture is important when you cut off your relaxed hair. This will help the stylist to see where your natural hair ends and the relaxed hair starts."
    },
    {
      "title": "Visit a hairstylist that has experience with natural hair.",
      "content": "Visit a hairstylist that has experience with natural hair. Unfortunately, not every stylist knows how to deal with relaxed hair or how to cut it off the best way. Research salons in your area before visiting one to see if they know how to cut your hair type. Look at reviews or call them to ask about their services. [2] X Research source When you call a salon, ask something like, “Have you helped clients transition from relaxed hair to their natural texture before?”"
    },
    {
      "title": "Ask the stylist to cut off all of your relaxed hair and give you a short style.",
      "content": "Ask the stylist to cut off all of your relaxed hair and give you a short style. Since relaxer cannot be stripped from your hair, the only way to get rid of it right away is to cut it all off. This haircut, often called the big chop, removes all of your relaxed hair and leaves your natural hair to grow out on its own. Make sure your stylist knows what your hair goals are and why you are cutting off the majority of your hair. [3] X Research source Often, the big chop method only removes the relaxed hair and leaves your natural hair to lay in whatever position it has grown in. That's why you'll want to have a style idea in mind when you head to the salon. [4] X Research source"
    },
    {
      "title": "Allow your relaxer to revert if it wasn’t a thermal relaxer.",
      "content": "Allow your relaxer to revert if it wasn’t a thermal relaxer. Some relaxers, like lye-based relaxers, are not fully permanent, meaning that your hair will revert back to its natural texture over time. Depending on the type of relaxer you got, this could take 6 to 8 weeks. [5] X Research source If you got a thermal relaxer, your hair will not revert back to its natural texture. [6] X Expert Source Tiffany Pate Licensed Cosmetologist Expert Interview. 9 November 2021."
    },
    {
      "title": "Wait for your hair to grow out before cutting off the relaxed parts.",
      "content": "Wait for your hair to grow out before cutting off the relaxed parts. If you’d like to have some length before you cut off your relaxed ends, you can wait for your hair to grow out some before you remove any length. [7] X Expert Source Tiffany Pate Licensed Cosmetologist Expert Interview. 9 November 2021. Depending on how fast your hair grows and how much length you would like, this can take anywhere from a few months to over a year. [8] X Research source The new hair that grows in will be your natural texture while the ends will still be straight."
    },
    {
      "title": "Wear your hair in a protective style to prevent breakage.",
      "content": "Wear your hair in a protective style to prevent breakage. Braids, weaves, and wigs are all great hairstyles to wear while you grow your hair out. [9] X Expert Source Tiffany Pate Licensed Cosmetologist Expert Interview. 9 November 2021. Get a professional to put your hair into a protective style. Make sure they know that you are trying to grow out your relaxed hair and prevent damage and breakage. [10] X Research source Add moisture to your scalp and roots by using hair oils to keep your hair healthy as it grows out in these styles."
    },
    {
      "title": "Make your relaxed hair curly with Nubian knots.",
      "content": "Make your relaxed hair curly with Nubian knots. Section all of your hair into small, 1 in (2.5 cm) pieces on your head. Separate one chunk of hair into 2 even pieces. Apply a protective hair cream to the pieces of hair with your fingers. Twist the pieces of hair around each other so that they are tightly secured. Wrap the twisted hair up onto your head to create a small bun. Secure the bun with a clip or hair tie. Let the cream in your hair dry completely for 1 to 2 hours and then undo the knots. [11] X Research source Protective hair cream helps to prevent breakage. You can find it at most beauty supply stores. This hairstyle will last about 1 week before your relaxed hair becomes straight again."
    },
    {
      "title": "Apply a wavy perm to your hair if it isn’t too damaged.",
      "content": "Apply a wavy perm to your hair if it isn’t too damaged. Reverse the process of relaxing your hair by getting a curly perm in a salon. If you have been relaxing your hair for a long time or your hair is dry and damaged, do not get a wavy perm. It can cause your hair to become brittle and break off. [12] X Research source Talk to a professional hairstylist before you decide to perm your hair—it may be too damaged to handle the chemicals."
    },
    {
      "title": "Avoid using heat on your hair to prevent further damage.",
      "content": "Avoid using heat on your hair to prevent further damage. As your relaxed hair grows out, you may be tempted to use heat styling tools on your hair to make the transition easier. Limit the amount of heat that you use on your hair as much as you can to encourage it to grow faster and healthier. [13] X Research source The healthier your hair is, the faster it will grow. If you do use heat styling tools on your hair, be sure to apply a heat protectant to your hair first."
    },
    {
      "title": "Trim away your relaxed hair as your natural hair grows out.",
      "content": "Trim away your relaxed hair as your natural hair grows out. Since your goal is to remove all of your relaxed hair, you can trim off the relaxed ends as soon as you feel comfortable doing so. Go to a professional hairstylist to get the best cut for you and to continue your journey toward natural hair. [14] X Research source There is no timeline for going natural. Everything depends on how healthy your hair is and how short you are comfortable cutting it."
    }
  ]
}