{
  "url": "https://www.wikihow.com/Describe-a-Person%27s-Physical-Appearance",
  "title": "How to Describe a Person's Physical Appearance",
  "steps": [
    {
      "title": "Identify them as male or female when appropriate.",
      "content": "Identify them as male or female when appropriate. In many cases this will be immediately obvious, and will likely be the first thing you’ll take note of. However, not everyone conforms to these categories, and it’s typically best not to make assumptions unless necessary. [1] X Research source For instance, if you’re trying to describe a suspect to the police, you may have to say something like, “They looked like a man to me, but I can’t be certain.” In other cases, you may be able to simply skip ahead to other descriptive elements."
    },
    {
      "title": "Take note of their skin color, and guess a race or ethnicity if needed.",
      "content": "Take note of their skin color, and guess a race or ethnicity if needed. Here again, there’s a difference between describing someone for the police and doing so for other reasons. In the first case, you may need to make assumptions—like, “he looked Irish” or, “she was Korean, I think”—that may be insensitive or offensive in other cases. [2] X Research source You can stick to just describing the color of their skin, using terms like “olive,” “pale,” “dark brown,” and so on. Leave it to others to make assumptions if they wish. With the exception of \"olive\" and \"peach\", you shouldn't compare someone's skin color to food. This is commonly used to objectify people of color."
    },
    {
      "title": "Estimate their age range within 5 or 10 year increments.",
      "content": "Estimate their age range within 5 or 10 year increments. In many cases, you’ll be able to pick someone out as “around 25” or “probably 60.” Consider providing an age range that is as narrow as you are comfortable giving—this will make it easier for others to visualize the person you’re describing. [3] X Research source For instance, identifying someone as looking 30-35 instead of 30-40 gives a clearer picture to others. This is especially important with younger people—a 10 year old looks very different from a 20 year old, after all!"
    },
    {
      "title": "Give their height either descriptively or by estimating.",
      "content": "Give their height either descriptively or by estimating. If you only get a quick glimpse of someone, the best you’ll probably be able to do is put them in a general height category like “very tall, “tall,” “average,” “short,” or “very short.” These vague terms become slightly more useful when the person can be categorized as male or female, or as a child. [4] X Research source If you’re able to give a more specific estimate of their actual height, try to do so in 2 inch or 5 centimeter increments—for instance, “she’s between 5’4” and 5’6”,” or, “he was 180-185 cm tall.”"
    },
    {
      "title": "Describe their weight with terms like “thin,” “average,” and “large build.",
      "content": "Describe their weight with terms like “thin,” “average,” and “large build. ” It’s usually much more difficult to estimate weight accurately than it is to estimate someone’s height. Therefore, stick to giving fairly vague categorizations of a person’s overall “build”—saying things like, “she was very thin” or, “he has a very large build.” Describing a person’s size and/or weight can make you seem insensitive, so unless you must do it as accurately as possible (e.g., describing a missing person), stick to describing their “build”—“thin build,” “average build,” etc. [5] X Research source Some descriptive terms can be more insensitive in some variations of a language than others. For instance, calling a woman “plump” is somewhat more polite in British English than American English, where it’s better to stick with “large” or perhaps “curvy.” If you’re estimating a specific weight, try to do it within 20 pound or 10 kilogram increments if possible."
    },
    {
      "title": "Mention their overall appearance as tactfully as possible.",
      "content": "Mention their overall appearance as tactfully as possible. Beauty is in the eye of the beholder, after all, so your idea of a “gorgeous” person might not line up with someone else’s. Give your opinion, but do with tact—for instance: [6] X Research source Call a person you find unattractive “ordinary” or “plain,” not “ugly.” Use “scruffy” or “unkempt” instead of “messy.” Use “attractive” to denote good-looking, instead of “beautiful,” “gorgeous,” or possibly even “handsome.” “Flabby” isn’t ideal, but it may be the best way to describe someone who is the opposite of “fit,” “toned,” or “well-built.”"
    },
    {
      "title": "Note their hair color, length, style, and appearance.",
      "content": "Note their hair color, length, style, and appearance. Use general terms that are fairly easy for most people to visualize. For example: Color: brown, black, blonde, sandy, red, gray Length: shaved, short, medium, long, shoulder-length, etc. Style: straight, curly, wavy, afro, ponytail, dreadlocks, bun, mohawk, etc. Appearance: messy, thinning, frizzy, glossy, clean, slicked, and so on."
    },
    {
      "title": "Mention their eye color, eye shape, eyebrows, and glasses.",
      "content": "Mention their eye color, eye shape, eyebrows, and glasses. As with hair characteristics, stick to simple terms that most people can picture in their head. For instance: Color: black, brown, grey, blue, green, hazel Shape: wide, narrow, bulging, deep set, squinting, etc. Eyebrows: color plus qualities like bushy, thin, connected, and so on Glasses: note the color, shape, material, thickness, and any tinting"
    },
    {
      "title": "Take note of other facial features, like their nose, ears, and lips.",
      "content": "Take note of other facial features, like their nose, ears, and lips. For ears, “large,” “average,” or “small” will usually do, while for lips, “thin,” “average,” and “plump” will probably work. A person’s nose might be “short,” “long,” “wide,” “thin,” “pointy,” “rounded,” “hooked,” “bent,” and so on. Their face overall might be described as “long,” “round,” or “flat.” If you're filing a police report, you may want to mention if they have “rosy cheeks,” “bags under their eyes,” or a “double chin.” Otherwise, be polite and skip these details!"
    },
    {
      "title": "Identify distinguishing features like scars and tattoos.",
      "content": "Identify distinguishing features like scars and tattoos. These are especially important if you are describing someone to the authorities—for instance a missing person or a crime suspect. Check for permanent features like these and describe them in detail. Instead of saying, “he has a tattoo on his arm,” say, “he has a black and red, heart-shaped tattoo with “Mother” in cursive on his right biceps.” If you’re going for a more general description, calling someone “tattooed” will probably get the point across that they have widespread body art. [7] X Research source"
    },
    {
      "title": "Look for unique characteristics like their posture and nervous tics.",
      "content": "Look for unique characteristics like their posture and nervous tics. Do they have a “slouchy” posture or a “hunchback?” Do they tilt their head to one side, or blink a lot while they talk? Do they bounce their knee up and down incessantly while seated? Small details like these can make it easier to visualize the person you’re describing. Some of these characteristics bridge the gap between physical appearance and personality traits, but they can help provide a fuller picture of the person you’re describing physically. [8] X Research source"
    },
    {
      "title": "Describe their clothing, or at least their overall “look” or style.",
      "content": "Describe their clothing, or at least their overall “look” or style. If you’re describing someone to the authorities, try to be as detailed as possible about every item of clothing the person has on—pants, shirt, jacket, shoes, hat, etc. For a more general description of a person, indicate their overall style or fashion sense. In British English (more so than American English), calling someone “smart” indicates that they are well-dressed and well-groomed. [9] X Research source"
    },
    {
      "title": "Use figurative language alongside descriptive details.",
      "content": "Use figurative language alongside descriptive details. Rely on language that evokes the person’s physical appearance as much as you do on strictly descriptive phrases. This is the creative part of creative writing! [10] X Research source Instead of writing, “she had long, red hair,” you might write, “her hair licked and lapped in the breeze like a crackling fire.” Stating that a person “stood like a mighty oak” conveys quite a bit about their physical appearance and the way they carried themselves in only a few words."
    },
    {
      "title": "Describe the person in a way that matches the tone of the writing.",
      "content": "Describe the person in a way that matches the tone of the writing. If, for instance, you’re writing in a humorous tone, utilize humorous language to describe the person. If, however, the scene is tense and dramatic, skip the silly metaphors in your descriptions. [11] X Research source Consider the difference, for instance, between describing “knife-blade slits for eyes” and “squinty eyes like Popeye’s first cousin.”"
    },
    {
      "title": "Mention actions that reveal physical characteristics.",
      "content": "Mention actions that reveal physical characteristics. By using the things that a character does to infer details about their appearance, you can cut back on direct descriptions. Combine this with figurative language to help a reader visualize the individual. [12] X Research source For example: “he barreled through the crowd of people like a wave through a sand castle built at low tide.” Or: “she worked her way through the crowd unnoticed, like water filtering through the cracks in a sidewalk.”"
    },
    {
      "title": "Leave something to the reader’s imagination.",
      "content": "Leave something to the reader’s imagination. Don’t feel the need to describe characters to the smallest detail! Create a loose outline of some key physical characteristics, and let the reader fill in the blanks with their own imagination. [13] X Research source The less vital a physical attribute is to a character, the less vital it is for you to mention it. If it doesn’t really matter if your character is tall or short, or has brown or black hair, leave it up to the reader to decide!"
    }
  ]
}