{
  "url": "https://www.wikihow.com/Descale-a-Magimix-Coffee-Machine",
  "title": "How to Descale a Magimix Coffee Machine",
  "steps": [
    {
      "title": "Throw away used capsules and water.",
      "content": "Throw away used capsules and water. Remove the coffee capsule if present. Pour out water from the drip tray. Lower the lever to move the capsule container back into place."
    },
    {
      "title": "Pour water and descaling liquid into the water tank.",
      "content": "Pour water and descaling liquid into the water tank. [1] X Expert Source Francesca Ortega Cleaning & Organization Expert Expert Interview. 3 March 2022. You'll need 0.5 liters (17 oz) of water, and one Nespresso descaling liquid packet. Take care not to get the descaling liquid on your skin or clothing. The Citiz & Co. model with two nozzles requires 1 liter (34 oz) of water and two descaling packets. [2] X Research source You can make your own descaling liquid by mixing 5g citric acid into 95mL water. This approach is not approved by the manufacturer, but citric acid is the active ingredient in its descaler."
    },
    {
      "title": "Place a container under the nozzle.",
      "content": "Place a container under the nozzle. Choose one large enough to hold all the liquid in the water tank. On a Citiz & Co. model, repeat each step of this process for the second nozzle."
    },
    {
      "title": "Turn on the machine.",
      "content": "Turn on the machine. Wait until the lights stop blinking before you continue."
    },
    {
      "title": "Hold both cup buttons down for three seconds.",
      "content": "Hold both cup buttons down for three seconds. Once the lights start blinking, your machine is in descaling mode. On the Magimix U model, the slider must be closed for this step. After the machine beeps, open the slider and hold both buttons down again until a second beep."
    },
    {
      "title": "Press the large cup button to start descaling.",
      "content": "Press the large cup button to start descaling. Leave the machine alone until the water tank is empty. This can take anywhere from 90 seconds to several minutes. On the Magimix U model, just close the slider to start descaling. Do not press any buttons."
    },
    {
      "title": "Descale again with the same liquid.",
      "content": "Descale again with the same liquid. Pour the liquid that went through the machine back into the water tank. Press the large cup button again. Let the machine run again until the liquid is gone from the tank."
    },
    {
      "title": "Repeat with drinking water.",
      "content": "Repeat with drinking water. Pour out the descaling solution. Rinse the water tank thoroughly, then fill it with ordinary water. Press the large cup button to run the machine through descaling mode one more time."
    },
    {
      "title": "Return to normal mode.",
      "content": "Return to normal mode. Once the water tank is empty, the descaling process is complete. Hold both cup buttons down for three seconds. The machine is now ready for brewing, although it may take thirty seconds to heat it up."
    },
    {
      "title": "Empty the capsule container and drip tray.",
      "content": "Empty the capsule container and drip tray. Remove the coffee capsule and pour water out of the drip tray."
    },
    {
      "title": "Rinse the machine.",
      "content": "Rinse the machine. Fill the water tank and place a container under the nozzle. Turn on the machine. Press the coffee button, let water run through for about a minute, then press the coffee button again to stop. If you have the Essenza Automatic model, instead let the water run until it stops, and repeat until you've pressed the coffee button six times. [3] X Research source If no water comes through at all, stop the machine and lift the lever. Start the machine again, then lower the lever once you see water reach the nozzle. If this still doesn't work, Essenza models (but not Essenza Automatic) have another option you can try. While the machine is off, press and hold the power button while you press the coffee button three times. Flip the lever open, hold it there for three seconds, and close it again. The machine should shut down and attempt to repair itself. It will not be usable for thirty minutes."
    },
    {
      "title": "Pour water and descaling liquid into the water tank.",
      "content": "Pour water and descaling liquid into the water tank. Measure out 0.5 liters (17 oz) of water and pour it into the tank. Add one packet of Nespresso descaling liquid. The descaling liquid is a strong irritant, so keep it away from skin and the casing of your machine. Alternatively, buy citric acid from the supermarket and dilute 5g of it in 95mL water to make your own descaling liquid."
    },
    {
      "title": "Insert the filter if there is a slot for it.",
      "content": "Insert the filter if there is a slot for it. The official Nespresso descaling kit comes with a filter. Lift the lever and look for a slot to fit the filter in. Close the lever afterward. If there is no slot, just skip this step."
    },
    {
      "title": "Put a large container under the nozzle.",
      "content": "Put a large container under the nozzle. Make sure it can hold all the liquid you added."
    },
    {
      "title": "Hold down both buttons for three seconds.",
      "content": "Hold down both buttons for three seconds. Hold down the power and coffee buttons until they start to flash. The machine is now in descale mode."
    },
    {
      "title": "Press the coffee button.",
      "content": "Press the coffee button. Leave the machine alone until all the descaling liquid has gone through the machine."
    },
    {
      "title": "Descale again with the same liquid.",
      "content": "Descale again with the same liquid. Pour the collected liquid back into the water tank. Press the coffee button and let it run through a second time."
    },
    {
      "title": "Remove the filter and rinse.",
      "content": "Remove the filter and rinse. Take out the filter if you used it. Rinse the water tank and collection container thoroughly to remove traces of descaling liquid. Fill the water tank with drinking water. Press the coffee button one more time and let it run through."
    },
    {
      "title": "Exit descaling mode.",
      "content": "Exit descaling mode. On an Essenza Automatic or a Le Cube machine, hold the power and coffee buttons down for three seconds. On an ordinary Essenza model, just turn the machine off and on again."
    },
    {
      "title": "Prepare the machine.",
      "content": "Prepare the machine. Before you begin descaling, take care of the following: Remove any coffee capsules. Empty the drip tray. Remove the steam nozzle and place a cloth under the hole. You may need to unclog the steam nozzle separately with a needle or a special nozzle cleaning tool."
    },
    {
      "title": "Fill the tank with water and descaling solution.",
      "content": "Fill the tank with water and descaling solution. Pour in 500 mL (17 oz) of water and one 100mL (3.4oz) packet of Nespresso descaling solution. You can make a cheaper descaling solution with a 20:1 mix of citric acid and water. Never use vinegar."
    },
    {
      "title": "Let the liquid pass through the machine.",
      "content": "Let the liquid pass through the machine. Place a large container under the nozzle. Start the descaling process as follows: Magimix 200: Turn on the machine and set the switch to hot water. Magimix 200A: Turn on the machine. Once it's warmed up, press and hold the two coffee buttons simultaneously for three seconds. Press the coffee button whenever the water runs out, until the tank is empty (about five presses)."
    },
    {
      "title": "Descale the coffee system.",
      "content": "Descale the coffee system. If using the 200 model (not 200A), pour the collected liquid back into the water tank. Move the switch to \"Coffee\" and let the tank empty again."
    },
    {
      "title": "Rinse the machine.",
      "content": "Rinse the machine. Rinse the tank thoroughly and fill with fresh water. Run the water through the machine until the tank is empty. Magimix 200A: Turn the machine off and on again to return to brew mode."
    }
  ]
}