{
  "url": "https://www.wikihow.com/Dress-Like-a-Little-Kid-for-Halloween",
  "title": "How to Dress Like a Little Kid for Halloween",
  "steps": [
    {
      "title": "Narrow down a look.",
      "content": "Narrow down a look. Are you going for a “dirty from playing outside” look or one that says “trying to look like a grownup”? Put some thought into exactly how you want your costume to look. Kids get themselves into some pretty ridiculous situations, so be creative. You could cover your face and hands in Halloween makeup to make it look like you've been playing in the mud, or deck yourself out in a frilly pink tutu and tiara to play dress-up princess. [1] X Research source If you want an even more elaborate costume, dress up like a kid who is dressing up for Halloween! For example, put a cheap cowboy vest and hat on over your kid clothes and tote a couple cheap toy pistols with a juice-stained mouth."
    },
    {
      "title": "Wear clothes that are too big for you.",
      "content": "Wear clothes that are too big for you. Nothing makes you look more like a child than clothes that swallow you up. After you've zoned in on a look for your costume, start picking out the clothes you plan to use in a couple sizes larger than what you'd normally wear. This look will be especially effective with oversized dresses, collared shirts, dress pants and shoes, and might be part of a “dressing like mommy/daddy” costume. [2] X Research source Wearing clothes that don't fit is a popular dress trend these days, so try to select clothes that play into the kid theme and don't just make you look like you're trying to be hip."
    },
    {
      "title": "Wear something with cartoon characters on it.",
      "content": "Wear something with cartoon characters on it. Head down to Goodwill and pick up a brightly colored t-shirt or backpack emblazoned with a Disney princess or little yellow minion. Kids love wearing clothes with their favorite characters on them, and it's a staple of their dress. It might be tough to find clothes with a kiddy look in your size, but these types of products often get made in adult sizes as well. There are constantly movies and TV shows coming out that manufacturers use to sell clothes. Take a look at places like Walmart and Toys 'R' Us for this kind of thing. Chances are, you'll be able to find something that fits you."
    },
    {
      "title": "Find a skirt, romper or leggings.",
      "content": "Find a skirt, romper or leggings. The more childish, the better. Denim skirts, ruffly overall dresses and brightly-colored tights are all fair game. Look for floral print or designs that feature animals or wacky patterns. If you're aiming for a normal little girl costume, a knee-length skirt and tights pairing will look just right. You might even be able to find a jumper or set of full-length footie pajamas to wear."
    },
    {
      "title": "Go vintage.",
      "content": "Go vintage. Think back on the types of clothes and accessories you used to wear as a kid. You might pull off a little kid costume better if you're not wearing the same clothes that are trendy today. Put together an outfit consisting of the brands, styles and pop culture references that were popular when you were growing up, and finalize the look with era-appropriate accessories. [3] X Research source Be sure to style your hair the way people used to in the decade you select for your throwback look. This can mean perms, mullets or big, feathery teased 'dos. Rock the look from head to toe and have fun with it! Accessories like slap bracelets, fanny packs, Moon Shoes, and sunglasses in funky shapes all have a dated look and can help clue people in on what time period your costume is meant to represent. If you want, you could even dress up like a kid from a bygone era like the 30s or 50s. Getting this look right will require more thought, but will definitely make for a unique costume. Run a quick image search for some inspiration. [4] X Research source"
    },
    {
      "title": "Pair your outfit up with sneakers or buckle shoes.",
      "content": "Pair your outfit up with sneakers or buckle shoes. Grab some adolescent footwear to accentuate the clothes you've picked out. Velcro shoes are often worn by little kids because they don't know how to tie their shoes, which makes them a good choice, or you can use a basic pair of colored Converse low-tops. Try to find something chunky or multicolored and be sure to wear them with plain white or character-printed socks. If you're not able to find Velcro shoes, some Mary Jane flats with tall white socks will work for a more dressy look."
    },
    {
      "title": "Accessorize for your costume.",
      "content": "Accessorize for your costume. Pick out accessories that match the look of your outfit that will make you look more like a kid. This can be anything: a colorful backpack, hula hoop, lollipop or doll will make a perfect prop and help spell out the intention of your costume. Think of accessories that play into the particular look you've chosen. If you're dressing as a little girl in a princess outfit, for example, you could make a magic wand, or a boy in grass-stained clothes might carry a baseball and bat. You can probably find most of these props around your house or garage. If not, try making them yourself."
    },
    {
      "title": "Get dirty.",
      "content": "Get dirty. Kids' clothes are rarely in pristine condition, so soiling or tearing your costume in the right places can enhance your chosen look. Take shorts and shirts outside and rub them in the dirt, or else use makeup effects to simulate mud, finger paints and milk mustaches. Dab a little grape juice onto plain white t-shirts to give them a lived-in authenticity. Dirty clothes will be much more convincing as part of a little kid costume than plain-looking clean ones. [5] X Research source Make sure that your clothes don't smell bad if you dirty them up with actual dirt or food."
    },
    {
      "title": "Mismatch your outfit.",
      "content": "Mismatch your outfit. Little kids who dress themselves don't pay much attention to whether or not their clothes match, and neither should you. This kind of small detail can make your costume much funnier. Pair together tacky combinations of patterns and fabrics, and go crazy with the layers. If you end up looking like you've just thrown together whatever you found in your closet, you've succeeded."
    },
    {
      "title": "Wear excessive makeup.",
      "content": "Wear excessive makeup. Get heavy-handed with the lipstick, blush and eyeshadow if you're dressing like a little girl. You'll look as though you did your own makeup for the first time, which will make a great detail for a dress-up “glamour” costume. In addition to makeup, you might heap on loads of fake jewelry. [6] X Research source"
    },
    {
      "title": "Fix up your hair.",
      "content": "Fix up your hair. Mess up short hair if you're a boy or give yourself an intentional cowlick. Girls can put long hair in braids or pigtails. If you're wearing some kind of headgear as an accessory, think of creative ways of styling your hair with it, like putting it in curlers as part of a “makeover with mommy” costume or leaving it hanging over your eyes underneath a baseball cap. [7] X Research source Girls can also tie ribbons or bows in their hair."
    },
    {
      "title": "Dress up like Alfalfa.",
      "content": "Dress up like Alfalfa. Even people who never watched The Little Rascals know the Alfalfa character for his humorous suspenders-and-bowtie combo and trademark cowlick. An Alfalfa costume would be quick and easy to throw together with one trip to a thrift shop, and you'll be able show up dressed as a kid character that everyone can identify. If you and your friends are celebrating Halloween together, put together group-themed costumes and recreate the entire Little Rascals gang. [8] X Research source This costume should be simple. A checkered shirt, suspenders, clip-on bowtie, tall socks and gelled cowlick or cowlick wig should be all you need. Use a brown felt-tip marker to dot fake freckles on your cheeks for extra detail."
    },
    {
      "title": "Go as Wednesday Addams.",
      "content": "Go as Wednesday Addams. Wednesday is one of the most popular kid characters in all pop culture and one of the most recognizable. Creating Wednesday's signature look will be similar to compiling a schoolgirl costume, only darker. You'll need a long-sleeved black dress to layer over a white collared shirt, black buckle shoes, black or striped knee-high socks and pigtail braids. Remember not to smile too much—it's part of the look! [9] X Research source If you don't happen to have long, black hair, use a wash-out temporary dye, or buy a cheap black wig and braid it yourself. Bring along a rubber hand prop to be accompanied by “Thing.”"
    },
    {
      "title": "Be Kevin from “Home Alone.”",
      "content": "Be Kevin from “Home Alone.” This costume will be all about the accessories. Grab some khakis, a dress shirt and a Christmas sweater and you've got the clothing down, but Kevin McCallister's most distinguishing feature was his engineering mischief, not his wardrobe. Deck yourself out with a clothing iron, hair dryer, BB gun and even a fake tarantula and see if your friends can guess who you are. If they need a hint, just slap both cheeks and scream. It's perfectly legal to own and carry a BB gun, but might be unsafe if it's loaded or looked down upon in certain settings. Make sure the props you bring are appropriate for where you are and what you're doing. [10] X Research source"
    },
    {
      "title": "Create a North West costume.",
      "content": "Create a North West costume. No one is off limits for a Halloween costume, not even the children of famous entertainment moguls. North West has recently become famous in her own right not just for being the daughter of Kanye and Kim, but because of the ultra-hip modern fashion her forward-thinking parents routinely swathe her in. Modify this look however you want: jogger pants, hoodies, stylish sneakers, a fur coat. Finish it off with a pacifier and an endearingly bewildered look and you might be mistaken for the real thing. [11] X Research source To avoid just looking like a particularly fashionable adult, utilize some childlike accessories, like a cartoon character backpack or pigtail braids with beads, or have a friend go as Kim or Kanye and hold their hand."
    }
  ]
}