{
  "url": "https://www.wikihow.com/Create-Unique-Lyrics-for-a-Song",
  "title": "How to Create Unique Lyrics for a Song",
  "steps": [
    {
      "title": "Avoid overused phrases.",
      "content": "Avoid overused phrases. There are many different phrases that are used frequently in song lyrics. Using these phrases may seem harmless, but some are so overdone that they may make your lyrics sound corny or meaningless to others. To keep your lyrics fresh and original, reflect on each line as you write it and ask yourself if you’ve heard the phrase before. If you aren’t sure, look the phrase up online to see if it comes up frequently. Some common phrases in songs include: [1] X Research source “I’m down on my knees and begging please…” “Can’t you see…” “I don’t know where I’m going but I know where I’ve been…”"
    },
    {
      "title": "Don’t pair obvious rhymes together.",
      "content": "Don’t pair obvious rhymes together. As you’re writing, avoid creating rhymes out of the first or second rhyming word you think of. Easy, simple rhymes have shown up in songs time and time again, so if you want your lyrics to be truly unique, you’ll need to brainstorm a few different options and go with the one that’s most original. Try to stay away from rhyming the following words: Fire and desire Fly, high, and sky See and me Heart and apart Together and forever"
    },
    {
      "title": "Deviate from simple rhyme schemes.",
      "content": "Deviate from simple rhyme schemes. It may feel natural to go with an AABB or ABAB rhyme scheme that contains only perfect rhymes, but this may make your songs sound familiar or even a little boring. Try to get creative with how you rhyme. Throw a slant rhyme in your lyrics every now and then, go with a more advanced rhyme scheme like ABCB, or combine two different rhyme schemes to put an original spin on your song. Slant rhyme is when two words are rhymed together that are very similar, but have slightly different sounds. For example, Emily Dickinson uses slant rhyme when she rhymes “soul” and “all” in one of her poems: “‘Hope is the thing with feathers/That perches in the soul/And sings the tune without the words/And never stops at all.” The song “Juicy,” by Notorious B.I.G. is unique because it uses an inconsistent rhyme scheme and also incorporates internal rhymes, which are rhymes within lines. For example, “Now I’m in the limelight ’cause I rhyme tight/Time to get paid, blow up like the World Trade, Born sinner, the opposite of a winner/Remember when I used to eat sardines for dinner.”"
    },
    {
      "title": "Stay away from pronouns.",
      "content": "Stay away from pronouns. It may feel natural to refer to your girlfriend as “she” or your dad as “he” in your lyrics. To give your song a unique touch, include their actual names, their nicknames, or descriptive phrases of who they are. The Beatles make use of names in their song entitled “Eleanor Rigby.” Some of the lyrics include the lines, “Father McKenzie, writing the words/Of a sermon that no one will hear/No one comes near.” In “Lucy in the Sky with Diamonds,” the Beatles use a descriptive phrase instead of a pronoun to refer to someone: “The girl with kaleidoscope eyes.”"
    },
    {
      "title": "Listen to genres that you don’t normally listen to.",
      "content": "Listen to genres that you don’t normally listen to. If you only listen to pop country, your songs will likely resemble pop country songs because that’s the style that you’re most familiar with. If you want to come up with your own unique style and sound, listen to several different genres of music, even ones you don’t particularly like. Think about what songs within the same genre have in common and how they’re different from songs in other genres."
    },
    {
      "title": "Listen to songs with unique lyrics.",
      "content": "Listen to songs with unique lyrics. As you start listening to different types of music, pick out songs that have especially interesting lyrics and listen to them. Look for example songs that have strange imagery, poetic language, and memorable choruses. You may listen to: “Life on Mars” by David Bowie “Subterranean Homesick Blues” by Bob Dylan “Both Sides, Now” by Joni Mitchell “Pedestrian at Best” by Courtney Barnett “Landslide” by Fleetwood Mac “Get Your Freak On” by Missy Elliott “Stan” by Eminem"
    },
    {
      "title": "Combine different influences.",
      "content": "Combine different influences. Identify what aspects of different songs you like and don’t like. If you get stuck while writing lyrics, reflect back on what you like about different types of music and try to incorporate those aspects into your lyrics. This will help you develop your own style instead of mimicking one specific one that already exists. [2] X Research source For example, you might find that you like the relatable storytelling of country and the fast-paced rhyming of rap. Try combining these two when you write lyrics."
    },
    {
      "title": "Experiment with different song structures.",
      "content": "Experiment with different song structures. While most music you hear on the radio is in Verse/Chorus form, there are many great songs that use other structures. If you like your lyrics but the song still sounds unoriginal to you, try rearranging them into Strophic (AAA) or Ballad (AABA) form. Strophic songs have the same melody for each successive stanza, while ballads have two identical stanzas, a unique third stanza, and a final one that sounds just like the first two. “Amazing Grace” is an example of a song that’s written in strophic form. “Can’t Help Falling in Love” by Elvis Presley is an example of a ballad. “Yellow” by Coldplay is an example of a Verse/Chorus song."
    },
    {
      "title": "Come up with a cohesive, authentic story.",
      "content": "Come up with a cohesive, authentic story. Before you start writing, decide what you want to write about. You can pick nearly any topic and still create solid lyrics, as long as the topic is something that you care about and that’s on your mind. To improve your chances of having original lyrics, reflect on something real while you write instead of forcing yourself to write about something common, like romantic struggle. [3] X Research source Are you currently upset about that mean thing your best friend did yesterday? Are the fall leaves making you feel a heightened appreciation for nature? Are you frustrated about your writer’s block? Use those real emotions to write your lyrics."
    },
    {
      "title": "Take a different approach to a familiar theme.",
      "content": "Take a different approach to a familiar theme. Most songs are written about familiar themes like “love,” “loss,” “family,” and “heartbreak.” Take a familiar theme and put a unique twist on it. Think about how you can make a well known theme different or specific to you. [4] X Research source For example, if you’re feeling inspired by a recent break-up, reflect on what was unique about the relationship and its end, and focus on writing lyrics that specifically express those unique details."
    },
    {
      "title": "Write a surprising first line.",
      "content": "Write a surprising first line. The first lines of your song should include a “hook” that draws your listener in and keeps them listening. Create first lines that catch the listener off guard and pique their interest. Instead of starting with something familiar, come up with a statement or image that listeners may perceive as slightly odd or unclear. For example, The Rolling Stones’ “Sympathy for the Devil” starts off with the words, “Please allow me to introduce myself/I’m a man of wealth and taste.” This opening piques the curiosity of listeners because it doesn’t clearly reveal what the song will be about."
    },
    {
      "title": "Use metaphors and similes.",
      "content": "Use metaphors and similes. Metaphors compare one thing to another. Similes use “like” or “as” to compare one thing to another. Both literary devices are great for adding specific detail to your lyrics. Use them to describe your feelings and emotions in a unique way. For example, in “Both Sides, Now” by Joni Mitchell, the chorus uses the metaphor of clouds to discuss the singer’s conflicting feelings about love: “I've looked at clouds from both sides now/From up and down and still somehow/It's cloud's illusions I recall/I really don't know clouds at all.” [5] X Research source"
    },
    {
      "title": "Paint a picture with imagery.",
      "content": "Paint a picture with imagery. If your lyrics provide a certain image or scene, then the song will more likely stand out to listeners and also be remembered by them. Lines that vaguely express what happened, like, “We spent our time together/and got to know each other well,” may come off as boring to readers. Instead, get more detailed and creative about how you communicate to the listener. For example, Tim McGraw creates imagery for this topic in the song, “BBQ Stain:” “I had a BBQ stain on my white T-shirt/She was killing me in that miniskirt/Skipping rocks on the river by the railroad tracks.”"
    },
    {
      "title": "Use stream of consciousness to write lyrics.",
      "content": "Use stream of consciousness to write lyrics. To add spontaneity to your lyrics, try singing whatever comes to mind in the moment. Play a melody and sing your thoughts as they come. Choose words that fit the melody and write them down. For example, you may end up with a song about life on Mars because you simply let your imagination run wild and jotted down lyrics as they came. You can then look over them later and decide which lyrics you’d like to keep."
    },
    {
      "title": "Impose limitations and constraints on your lyrics.",
      "content": "Impose limitations and constraints on your lyrics. Maybe you challenge yourself to write the song using only certain words or phrases. Or perhaps you try writing each verse about a different period in your relationship with your former lover. Take a concept and apply it to the song so you have to write within specific limitations or rules. This may inspire you to think more creatively. [6] X Research source For example, you may challenge yourself to write a song about loss where you do not use common words like “cry,” “sad,” or “goodbye.”"
    },
    {
      "title": "Adopt a perspective that is different than your own.",
      "content": "Adopt a perspective that is different than your own. Think about how your past romantic partners might view you now and write from their perspective. Or try writing song lyrics from the perspective of someone who has completely different political or social views than you. Adopting a different perspective can challenge you to think outside of your comfort zone. [7] X Research source You can also try sitting in a public space and thinking of song lyrics from the perspective of strangers around you. Or you may write from the perspective of a parent, peer, or close friend."
    },
    {
      "title": "Try the cut up technique.",
      "content": "Try the cut up technique. This was a popular songwriting technique for artists like David Bowie and David Byrne. Make photocopies of pages in your diary or journal and cut out different words or phrases. Then, rearrange them to form interesting lyrics for your songs. You can also cut words out of magazines and newspapers to form lyrics."
    },
    {
      "title": "Write with a partner.",
      "content": "Write with a partner. You may find it easier to collaborate with a friend, family member, or peer to write the lyrics. Ask a close friend or peer to help you come up with unique lyrics for the song. Maybe you each contribute a stanza to the song, writing about a common theme from your individual perspectives. You can also try writing a song that is a duet with someone else. You may both decide to sing your own verses and the chorus together."
    },
    {
      "title": "Sing the lyrics out loud.",
      "content": "Sing the lyrics out loud. Listen to how the lyrics sound when spoken or sung aloud. Notice if they are unique and particular to your perspective, or the point of view of someone else. Make sure you use metaphor, simile, and imagery to make the song come alive for the listener. Also, make changes to parts of lines that feel awkward, too wordy, or too short. This will improve the flow of the song. [8] X Research source You should also make sure there are no spelling, grammar, or punctuation errors in the song when you sing it aloud. If you are writing from the point of view of someone who has bad grammar or spelling as part of their character, it may be fine to leave them in."
    },
    {
      "title": "Show the lyrics to others.",
      "content": "Show the lyrics to others. Get friends, family, and peers to give you feedback on the song. Ask them if they feel the song is unique or different from other songs. Have them give you suggestions on how you can improve the song. Be open to constructive criticism, as this will make it stronger and better in the end."
    },
    {
      "title": "Set the lyrics to music.",
      "content": "Set the lyrics to music. Play guitar or piano along to the lyrics or use an existing digital recording for the song. This can add the final component to the lyrics to make them feel complete. If you do not play any instruments, you can ask friends who are musicians to set the lyrics to music for you. If you’re very familiar with an instrument, you might find that it’s easier to write the instrumental music first, determine the vocal melody, and then write the lyrics."
    }
  ]
}