{
  "url": "https://www.wikihow.com/Frighten-a-Narcissist",
  "title": "How to Frighten a Narcissist: 13 Tactics to Use",
  "steps": [
    {
      "title": "There’s nothing a bully fears more than consequences.",
      "content": "There’s nothing a bully fears more than consequences. If this person’s behavior is driving you nuts, make it clear to them that you aren’t going to put up with it. Calmly lay out which specific behavior you want them to stop doing, and explain what will happen if they choose to ignore you. This is a threat to a manipulative person’s power, and it’s sure to keep them on alert. [2] X Research source An example of a boundary might be, “You cannot tell me how to raise my children.” The consequence might be, “I won’t let you babysit if you can’t stop criticizing my parenting.” If you really value your relationship with this person, this is probably the healthiest and most productive way to handle them. Do not negotiate. Do not argue. Make it clear that your boundaries are non-negotiable. Reader Poll: We asked 264 wikiHow readers for their most effective way to protect themselves from love bombing, and 55% of them said, recognizing and setting healthy boundaries. [Take Poll] Beware of a narcissist turning on the charm to get what they want. Stick to your boundaries to thwart their attempts at love bombing you."
    },
    {
      "title": "Avoid letting things slide with a toxic person.",
      "content": "Avoid letting things slide with a toxic person. If they outright lie, insult you, or cross a serious boundary, do not let them get away with it. Bullies tend to assume nobody is ever going to stop them. Coming after them when they’re trying to pull a fast one will keep them from getting too ambitious when it comes to their nasty impulses. [3] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. For example, if you’re at lunch and this person says something like “Oh, that’s not a healthy option” when you order your food, you might say back, “It’s really not up to you what I eat. Worry about yourself.”"
    },
    {
      "title": "As uncomfortable as it may be, don’t let them talk over you.",
      "content": "As uncomfortable as it may be, don’t let them talk over you. If they speak over you or interrupt, shut them down fast and keep speaking up. Manipulative people feel most comfortable when they’re able to control a conversation, so take that away from them by sticking to your guns and saying precisely what you want to say. [4] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Do not hesitate to say, “Excuse me, I’m not done talking,” or, “Oh, I’m not done yet,” if they interrupt you. Confronting a narcissistic person when they cross the line can lead to some volatile reactions, but they need to know you mean business and won't tolerate bad behavior."
    },
    {
      "title": "Egotistical people get a lot of mileage out of provoking people.",
      "content": "Egotistical people get a lot of mileage out of provoking people. When you express strong feelings, it vindicates their sense of control. They use sly, passive-aggressive comments to get under your skin, and they may even insult you outright to try and get you to lash out. Just play it cool and keep your emotions to yourself. As annoying as it may be, you’re going to win the long game if you stay level-headed. [5] X Expert Source Adam Dorsay, PsyD Licensed Psychologist & TEDx Speaker Expert Interview. 11 April 2019. This applies to positive feelings as well; if they think it’s easy to get you to smile, shout for joy, or thank them, they’re going to feel like they’re in the driver’s seat. This isn’t to say that you shouldn’t stand up for yourself or express displeasure at all. Just don’t do it by yelling or spinning out of control."
    },
    {
      "title": "Refuse to bend to their version of reality.",
      "content": "Refuse to bend to their version of reality. People with inflated egos usually have a warped understanding of the world, and they refuse to admit that there are alternative perspectives. When they’re being unreasonable, stick to the facts. If they try to bend the truth or play fast and loose with logic, stick to an unemotional and measured response. [6] X Expert Source Adam Dorsay, PsyD Licensed Psychologist & TEDx Speaker Expert Interview. 11 April 2019. If they complain about someone breaking a promise, you might point out how it doesn’t make any sense for that person to just totally change their behavior based on everything you know about them. If they tell a wild story about how everyone at work is out to get them, you might say, “I feel like most of your coworkers just focus on themselves. I’m sure they’re not out to get you.”"
    },
    {
      "title": "Manipulators need you to play along, so refuse to engage.",
      "content": "Manipulators need you to play along, so refuse to engage. Did they send you an obviously manipulative text message? Ignore it. Did they criticize you in front of others in an unfair way? Hit them with some side-eye and keep it moving. The less power you give to their devious tactics, the more uncomfortable they’ll be. [7] X Research source Sometimes, it’s better to call out these mind games—especially if you’re in public and they’re crossing a line. However, if they’re doing something innocuous or obviously meant to provoke you, it’s often better to ignore them."
    },
    {
      "title": "A little unreliability will keep a controlling person on edge.",
      "content": "A little unreliability will keep a controlling person on edge. Toxic people often behave the way they do because it gets them attention. Withholding that attention will be a serious blow to their ego. So take your time responding to text messages. Don’t show up exactly on time. Wait a day or two before calling them back. All of this will keep them from acting out with confidence. [8] X Research source This is especially productive if they think they have some kind of power over you when they actually don’t. A bossy coworker or annoying uncle won’t have any recourse."
    },
    {
      "title": "People with fragile egos don’t take kindly to teasing.",
      "content": "People with fragile egos don’t take kindly to teasing. We’re not saying to be mean, but some subtle teasing may remind them they’re not in control and humble them a bit. If they do try to slide in a manipulative comment or they become passive-aggressive, tell them you’re joking around. [9] X Research source For example, if they complain about not getting enough attention from you, you might say, “Oh, you really do need love! I’m sorry, I’ll try checking in on you every night before bed,” with a chuckle. If you’re too cruel or pointed, they’ll just use it as an opportunity to play the victim card. Keep it lighthearted."
    },
    {
      "title": "People with control issues hate to think they aren’t independent.",
      "content": "People with control issues hate to think they aren’t independent. The average egoist thinks they’re the bee’s knees. If you regularly offer to guide or help them, they may start wondering if they’re actually as capable as they think they are. The upside here is that you have plausible deniability, since you can always play it off like you’re just trying to lend a helping hand. [10] X Expert Source Jay Reid, LPCC Licensed Professional Clinical Counselor Expert Interview. 7 August 2020. For example, if they keep humble-bragging about how everyone wants their money, you might say, “I can always help you budget if you need some help,” or, “I typically don’t have any trouble turning leeches down if you ever need advice.”"
    },
    {
      "title": "Make them say “thank you” to those who lend a hand.",
      "content": "Make them say “thank you” to those who lend a hand. It’s difficult for someone with a big ego to express gratitude because it implies that they benefited from something they had no hand in. If someone does something nice for a narcissistic person, point it out and play it up in a super positive way. They’ll feel out of control, and you’ll spread love to others at the same time. [11] X Research source For example, if someone brings them a gift or does them a favor, you might say, “Oh wow! That’s so nice of you, Bryan—that’s an awesome gift. Isn’t that nice of them?”"
    },
    {
      "title": "Being present and active will keep a toxic person at bay.",
      "content": "Being present and active will keep a toxic person at bay. Narcissists can be a lot like schoolyard bullies—they’re less likely to target you if they think you’re a force to be reckoned with. Do not shy away from controlling a conversation or standing in the middle of the party. This may scare them off from getting out of line. [12] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Pay attention to your body language around them. Do not lean away from them, fidget, or defer eye contact. Face them directly and make eye contact . Show them you’re not intimidated by them."
    },
    {
      "title": "Try to get your mutual friends/family on your side.",
      "content": "Try to get your mutual friends/family on your side. Do this directly by pulling mutual friends and family members aside and telling them that this person needs to be stood up to, or by indirectly guiding social interactions so that more people agree with you. Ask them to support you the next time you call this person out, or encourage people to stand up to them. [13] X Research source It’s best to directly tell mutual friends and family what you’re up to if this person is obviously out of line. You’re better off being indirect if they’re too much of a chameleon to really cross the line in clear and obvious ways."
    },
    {
      "title": "If they're toxic, you're better off without them.",
      "content": "If they're toxic, you're better off without them. People with narcissistic tendencies usually suffer from pretty low self-esteem, so they have a constant need for attention from others. As a last resort, block their phone number, unfriend them on social media , and don’t even acknowledge their presence if you’re ever in the same room with one another. If you’ve given the relationship your best shot and you just can’t do it anymore, there’s nothing wrong with moving on. [14] X Research source"
    }
  ]
}