{
  "url": "https://www.wikihow.com/Deal-With-Being-Rejected-by-Your-Parent",
  "title": "How to Deal With Being Rejected by Your Parent",
  "steps": [
    {
      "title": "Share your disappointment with your parent.",
      "content": "Share your disappointment with your parent. Odds are, if your parent rejected you, you may not have gotten the opportunity to fully tell your side of things. If so, find a way to express your feelings to your parent. You might do this by asking to meet in person, calling them, or composing a letter or email. Tell them how disappointed and hurt you feel about their rejection in as much detail as you can. If they are open to listening, you might use this opportunity to share your story. For example, if they rejected you because of your religious choices, you might explain why you chose a specific religion. How you choose to share your feelings depends on your ongoing relationship with your parent. If you have become estranged, a letter or email may be the best method. [1] X Research source"
    },
    {
      "title": "Grieve.",
      "content": "Grieve. Being rejected by a parent hurts. Pretending like it doesn’t will only delay your recovery. Allow yourself to feel those feelings however they come. You might need to cry, journal, listen to music, or watch a movie that matches the emotions you’re experiencing. [2] X Research source If you don’t want to spend too much time wallowing, give yourself a deadline. For instance, you might say, “In a week, I will try to pull myself together.” Setting a deadline doesn’t mean you will have fully processed all your grief. It simply pushes you to return to your life despite the pain."
    },
    {
      "title": "Talk to someone you trust.",
      "content": "Talk to someone you trust. Ask for the ear of someone who cares about you. Maybe that’s a friend, a sibling, a teacher, or your other parent. Tell this person how you’re feeling. [3] X Research source If you’re not sure how to approach the subject, you might start with something like, “Hey, Randy. Can we talk? I’ve been feeling really rejected by dad and I thought maybe you would understand.”"
    },
    {
      "title": "See if you can stay with other family.",
      "content": "See if you can stay with other family. If you're living with a parent who rejects you, staying with them may only complicate matters. They may treat you unfairly or ignore you completely. Talk to your other parent, other relatives, and friends and see if you can bunk with someone else for a short while. [4] X Research source If you are being physically abused, you may be able to locate a shelter in your community for adolescents and young adults who need to leave home. If you are an adult, you might choose to get distance from a parent who rejects you by moving to another city or further away from your hometown. Your chosen family, whomever they may be, can offer an opportunity to build a new, happier, healthier, and more emotionally stable life. Always refrain from any situation where love is conditional, limited, or based on negative judgement."
    },
    {
      "title": "Find an outlet for anger.",
      "content": "Find an outlet for anger. Children and adults who are rejected by their parents may deal with anger problems and aggression. Counteract these negative effects by finding positive ways to manage your anger. [5] X Research source You might pick up a new physical activity, such as running or boxing. Other ways to express anger might be through creative pursuits like dancing, painting, or writing. [6] X Research source"
    },
    {
      "title": "Own your story.",
      "content": "Own your story. Rejection can make you question yourself and your decisions. You might also feel ashamed. Work to overcome this by taking ownership of your story and your experience. Don’t feel like you need to hide or change who you are because of the rejection. Start by writing a narrative. Detail all the events that led up to the rejection and how they have affected you. Try to include any thoughts and feelings relating to the event. Write the narrative through your own eyes as opposed to your parent’s. [7] X Research source Once you’ve written your story, share it with others. Try starting with a best friend, a favorite teacher, or a school counselor. If you're an adult, share your story with a partner or close pal. [8] X Research source"
    },
    {
      "title": "Repeat loving affirmations.",
      "content": "Repeat loving affirmations. You’ll have many relationships throughout your lifetime, but the most constant relationship you’ll ever have is with yourself. That’s why self-love can be a powerful tool for dealing with rejection. Try repeating a loving affirmation daily, such as “I am at peace with all that has happened and all that will happen because everything is working towards my greatest good.” [9] X Research source When you repeat affirmations that reinforce self-love, it may feel strange at first. However, over time, you might find yourself reciting them more loudly and confidently. You might even come to believe them."
    },
    {
      "title": "Don’t take responsibility for the rejection.",
      "content": "Don’t take responsibility for the rejection. After being rejected by a parent, you might experience a great deal of insecurity in your relationships and life in general. One way to overcome insecurity is by boosting your optimism and learning to look on the bright side of things. One trick for developing optimism is recognizing that you aren’t always responsible for how things turn out. [10] X Research source Do your best to remind yourself that any rejection or judgement is more about the person who rejected you. If a parent has been critical or rejects you, stop trying to gain their approval. Instead, let them come to you if they want to build a relationship later in life. For example, you can’t control how your parent acts; you can only control your own behavior. In other words, don’t blame yourself for how they treated you. It’s a parent’s job to be loving and accepting. If they don’t do their job, it’s not your fault. [11] X Research source"
    },
    {
      "title": "Build healthy ways of relating to others.",
      "content": "Build healthy ways of relating to others. The insecurity that follows parental rejection can affect the way you relate to friends, other family, and future romantic partners. You might be tempted to isolate or push others away out of fear of being abandoned or rejected. [12] X Research source Firstly, don’t depend on others to build your self-worth . Whether someone calls or doesn’t calls, likes you or not, you are always worthy. Remembering this will reflect positively on your relationships. Secondly, take your relationships slowly. Give them time to naturally develop without you assuming anything or trying to force them to be something they’re not. Be mindful of your relationships with others and cut off needy behaviors as soon as you notice them. [13] X Research source"
    },
    {
      "title": "Build community with others like you.",
      "content": "Build community with others like you. One of the best ways to deal with rejection is to find your tribe. Identify others who share your interests, values, and beliefs and forge relationships with these people. When you do this, you will feel more confident about yourself and your story. Connect with others by joining clubs and organizations in your local community and online."
    },
    {
      "title": "Reach out to other family members.",
      "content": "Reach out to other family members. Just because one person in your family rejected you, doesn’t mean everyone will. Get in touch with your other parent (unless they rejected you, also), siblings, aunts, uncles, and grandparents. If these people are willing to support you, let them. [14] X Research source"
    },
    {
      "title": "Join a support group.",
      "content": "Join a support group. As hard as it is to believe, there are others who have gone through similar experiences as yours. Search online or in your local area for support groups that help you connect with these people. You may find a new support system and an outlet for coping by meeting with others who’ve gone through what you have. For instance, if your parent rejected you because of your sexual orientation, you might search for a support group for youths who recently came out of the closet . [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "See a therapist.",
      "content": "See a therapist. There are a range of negative effects from parental rejection, such as anger, insecurity, or depression. In the weeks, months, and years that follow, you may need help coming to terms with the rejection and owning your story. A professional mental health therapist can help you do this. [16] X Research source Ask your family doctor or the members of your support group for suggestions of therapists in your area. If you are a student, you might also talk to your school counselor."
    }
  ]
}