{
  "url": "https://www.wikihow.com/Create-a-Beast-Boy-Costume",
  "title": "How to Create a Beast Boy Costume",
  "steps": [
    {
      "title": "Purchase a black unitard.",
      "content": "Purchase a black unitard. Use purple fabric paint to draw and color in the purple square on his chest. You may want to consider using Lycra fabric for a more authentic look. Lycra provides a four-way stretch, ensuring the suit fits snugly to your body."
    },
    {
      "title": "Buy a utility belt, or make one using this DIY method.",
      "content": "Buy a utility belt, or make one using this DIY method. Purchase grey and black craft foam and a silver material. Cut out and hot glue together little squares out to the craft foam, and attach the material on top. Make a grey circle and a smaller black one; glue the smaller one on top for a 3D effect. Attach these onto a grey belt."
    },
    {
      "title": "Get grey gloves and using fabric paint or black craft foam, attach a stripe going horizontal on the glove.",
      "content": "Get grey gloves and using fabric paint or black craft foam, attach a stripe going horizontal on the glove. Get a pair of black combat boots and paint them purple, and add black stripes on the front and grey around the edge."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. For the makeup, you will need: Green face paint (water-based is recommended) Translucent setting powder Elf ears A set of Vampire teeth"
    },
    {
      "title": "Attach on the elf ears, and paint your face, ears, and neck green.",
      "content": "Attach on the elf ears, and paint your face, ears, and neck green. It helps if someone helps you do it."
    },
    {
      "title": "Set your face paint with the translucent powder.",
      "content": "Set your face paint with the translucent powder."
    },
    {
      "title": "Take the of the vampire teeth, and using a dental adhesive, attach it onto your bottom incisors.",
      "content": "Take the of the vampire teeth, and using a dental adhesive, attach it onto your bottom incisors."
    },
    {
      "title": "Spray your hair green with temporary spray, or purchase a green wig online.",
      "content": "Spray your hair green with temporary spray, or purchase a green wig online."
    }
  ]
}