{
  "url": "https://www.wikihow.com/Form-a-Band",
  "title": "An Expert-Backed Guide to Starting a Band",
  "steps": [
    {
      "title": "Rock bands often include a guitarist, bassist, drummer, and keyboardist.",
      "content": "Rock bands often include a guitarist, bassist, drummer, and keyboardist. You’ll also need a singer, who may or may not also play a musical instrument in the band. Depending on what kind of band you want to be or the music you want to play, you don’t necessarily need all of those instruments right away. Attract potential bandmates by posting flyers in cafes, music shops, and car windows. [1] X Research source Post advertisements in other places you like to hang out, like pubs and open mic nights, where you’ll probably find like-minded people. Ask friends and family if they know anyone who plays an instrument or would be interested in starting a band. Post on social media pages, like local Facebook groups for musicians, or even on your Instagram story. Word of mouth is a great way to find new band members. Post or browse on websites like Bandmix where fellow musicians search for bandmates. Be selective about who’s in your band. Prioritize musicians who seem friendly and reasonable and share your interests—not someone whose rockstar ego may break up the band further down the line."
    },
    {
      "title": "Your bandmates’ interests will help build your band’s sound and genre.",
      "content": "Your bandmates’ interests will help build your band’s sound and genre. Have everyone contribute their favorite playlist or bring their favorite record to your first practice session. Listen to each one to get an idea of everyone’s preferred genres and styles! Discuss each other’s musical inspirations and favorite artists, and find commonalities or mix genres to make a new sound that’s all yours! Your first few jam sessions will also help you determine how you naturally flow together as a band. If you have a singer in your group, try songs that fit their vocal range and style. If you have someone in your group who’s already been writing songs , play through those and see how they sound. Many great bands and artists have successfully shifted genre over time, so your band’s sound isn’t set in stone. Alanis Morissette, Taylor Swift, and the Bee Gees have all pulled off genre shifts."
    },
    {
      "title": "The most memorable bands all have a signature look.",
      "content": "The most memorable bands all have a signature look. Choose a look that ties in with your overall genre, as well as the audience that you’re trying to connect with. Your look should be consistent and identifiable across all your members. However, each of you should also have a personal touch that sets you apart. A standard look will help you get gigs, fans, and publicity. Some bands, like Kiss, Abba, and Destiny’s Child, have worn almost matching outfits. Your look may evolve naturally as your sound and brand develop. Start with something simple for your group look and be open to it changing over time."
    },
    {
      "title": "Choose a catchy name that will stick in people’s minds.",
      "content": "Choose a catchy name that will stick in people’s minds. Pick something meaningful or something that sounds cool. Make a list of potential names that your band members come up with, then Google them to make sure they haven’t been taken. Your band name should also be searchable, meaning it won’t lead to websites for things that have nothing to do with your band. [2] X Research source The best names are usually short and easy to read and spell, which makes them easier to remember. Your name is a big part of your brand and marketing strategy! Later on, you’ll have to trademark your band name so no one else can take it. If you get stuck on a name, have everyone come up with 5 adjectives and 5 nouns, then try to agree on a band name using one of each. Your band should unanimously agree on the name. Consider band names that easily translate into fandom names, like “Directioners” for One Direction."
    },
    {
      "title": "Bands are a big commitment and a lot of work.",
      "content": "Bands are a big commitment and a lot of work. A “contract” can help protect every band member’s interests if one person (or persons) decides to leave the band. Your band agreement can be a written contract or an informal discussion. At the very least, you and your bandmates should agree on: [3] X Research source Time commitment: How many hours per week will your band rehearse? Which nights? Do you need to be available for weekend or weekday travel to attend gigs? Responsibilities: Who is in charge of public relations, booking gigs, or communicating with promoters? Who’s running the social media? Who will handle bookkeeping and taxes? Ownership: Who will own the rights to the song? Will publishing royalties and performance cuts be equally divided or split by music ownership? These conversations can feel uncomfortable in the moment but can save a lot of pain later on. Make sure everyone in the band writes and agrees on the contract together."
    },
    {
      "title": "Each band member should be responsible for their own instrument.",
      "content": "Each band member should be responsible for their own instrument. However, you may need to invest in additional equipment as a band, such as performance microphones or amps . A portable PA system may also be helpful for venues that can’t provide one for you. [4] X Research source It’s also worth investing in some basic recording equipment so you don’t have to pay for studio time. Depending on studio quality, studio time can cost from $40 to $200 an hour, says string instrument expert Nicolas Adams. Adams asserts that “you get what you pay for…You want to get somebody that knows what you're playing, makes it easier to record, so it'll cost you less in the long run.” Music producer Timothy Linetsky produces his tracks on his own using “a digital piano, an audio feature [called] the Focusrite 2i2, and Yamaha HS8 [studio monitors].”"
    },
    {
      "title": "Find a practice space.",
      "content": "Find a practice space. Ask your bandmates if they have a garage or basement that you could set up in. If not, look around for local spaces that you could rent out or otherwise negotiate to practice in. Sometimes, local businesses only open during the day will let you practice there in the evenings. You won’t know if you don’t ask! If you can’t keep your equipment in your practice spaces, decide how each of you will store and transport your equipment and equipment belonging to the band."
    },
    {
      "title": "Remember that your first songs don’t have to be hits.",
      "content": "Remember that your first songs don’t have to be hits. Write as many songs as you can and learn from what works and what doesn’t. You can start by playing cover songs to build up a set list and finetune your playing as a band. [5] X Research source You’ll need at least 11 songs to headline a show and 4-5 to play as an opening or supporting act. Even if you have a really strong songwriter in your group, make sure everyone can work collaboratively and give input. You also may want to copyright your music. Fill out a PA (performing rights) form at copyright.gov ."
    },
    {
      "title": "Demos help you get gigs, record deals, and promote your work to fans.",
      "content": "Demos help you get gigs, record deals, and promote your work to fans. Record your demo at home or in a studio and release it on online platforms like Apple Music and Spotify . Send the demo to music agents, managers, and venues that you want to play at. [6] X Research source Use social media sites like Instagram, TikTok, and Twitter to post and promote your demo. Professional guitarist Nicolas Adams recommends Amazon as the easiest site to promote your music on, “because you can just sell your CD on Amazon as your own retail shop.” However, Adams maintains that Apple Music and Spotify give you more streaming opportunities, while companies like Soundrop or SoundBetter will put everything together for you. Even if you only record one full song as your demo, consider recording a small snippet of a few other songs to include so industry professionals and fans can get a better idea of your overall sound."
    },
    {
      "title": "An EPK is crucial to getting booked and promoting the band.",
      "content": "An EPK is crucial to getting booked and promoting the band. Use an EPK template from websites like Adobe Spark or Wix . Once you’ve finished your EPK, create a public Dropbox link that you can send to promoters and venues. Your EPK should clearly present: [7] X Research source Links to your music , whether on Spotify, SoundCloud, or YouTube. Links to your band’s social media accounts , where you should be working hard to cultivate an engaged fan base that you can bring along with you to shows. A link to your website , which should include more in-depth information about your band. Professional band photos that are set in high resolution and can be used for dynamic and eye-catching promotional posters. High-quality video(s) of your band performing live, edited for maximum impact and to provide information about your band. A PNG image of your band logo that venues can use to promote the event you’re playing at. An artist biography that lists your band’s notable achievements, performances, or endorsements. Give a general background of the band, e.g., where you’re from, how you came together, and your musical influences. A recent press quote or testimonial about your band, if you have one. Contact details for every band member, including agents and managers. Specify at least two individuals as the preferred point of contact. Optionally, include a free download of one of your best songs."
    },
    {
      "title": "Playing for any audience can help your band gain exposure.",
      "content": "Playing for any audience can help your band gain exposure. Contact local venues, charity organizations, or community hangouts and ask if they have any performance opportunities. Ask your local coffee shop, pizza place, mall, bar, or university. In the meantime, busk around parts of your city where lots of people are out and about! Whenever you’re busking or playing at a local venue, put out a sign with your band name or a QR code that connects to your social media. Interested fans can find you and start following your music! Don’t worry about headlining shows or playing big concert venues right away. Once you’ve had time to practice playing in front of a crowd, you can branch out into playing festivals and other live events. Remember that you'll never know if you don’t ask. There’s no harm in (politely!) asking festival managers and club owners about upcoming gigs and sending them your demo. The worst they can say is no!"
    },
    {
      "title": "Getting your name out there will help you find opportunities to play.",
      "content": "Getting your name out there will help you find opportunities to play. Create social media pages on TikTok, Instagram, Twitter, YouTube, and Facebook. Post videos of your band and snippets of your songs. Ask friends and family to share your account on their social media pages. Submit your music to popular blogs or local music magazines. [8] X Research source Make flyers and post them around your work, school, local stores, or eating establishments. Start a mailing list that interested fans can join for updates on upcoming music releases and performances. Look into general merchandise, like stickers, business cards, apparel, and decals. Bring them along to gigs and either pass them out or sell them. Music manager Timothy Linetsky recommends Discord and YouTube collaborations to grow his online audience. Collabs with other producers can help you “bolster your own influence [and] siphon their audiences away from them.”"
    },
    {
      "title": "Eventually, you may need help managing the business side of the band.",
      "content": "Eventually, you may need help managing the business side of the band. Look for accountants, managers, and other professionals you may need in the future. Cultivating relationships and networking with industry professionals can make the transition from garage band to featured performer a lot easier. [9] X Research source Considering hiring a consultant. They can point you in directions you may have yet to think of and narrow down what's feasible and what's not. Look to friends and connections that have found success in the music industry. They'll have invaluable advice that you don't even have to pay for (well, maybe just the cost of a beer)."
    },
    {
      "title": "",
      "content": "Generate your own band name in seconds. Do you need an awesome band name? Whether you're indie, metal, rock, or anything else, this generator will help you find the perfect band name. All fields are optional, but providing more info will give better results. Genre Band Description See ad to Generate Names Customize Names: Randomize Again Try the full Band Name Generator or check out all of our generators ."
    }
  ]
}