{
  "url": "https://www.wikihow.com/Fortnite-Error-Code-91",
  "title": "How to Troubleshoot Error Code 91 in Fortnite: 10 Best Solutions",
  "steps": [
    {
      "title": "Fortnite’s error code 91 means you can’t join a party in the game.",
      "content": "Fortnite’s error code 91 means you can’t join a party in the game. It’s a fairly common issue that typically occurs when players try to join parties. Error code 91 means that the game has failed to connect to the party or lobby session, and the player experiencing it can’t join group activities. [1] X Research source You might also see messages like \"Unable to join party\" or \"Party services are currently experiencing technical difficulties” along with this error."
    },
    {
      "title": "Check Fortnite’s server status.",
      "content": "Check Fortnite ’s server status. If there’s an issue with the game and its servers, there’s nothing to be done on your end—just wait for Epic Games to fix the problem. Head over to the Epic Games status page at https://status.epicgames.com/ to verify that all aspects of the game are currently operational."
    },
    {
      "title": "Restart your game.",
      "content": "Restart your game. Restarting Fortnite can help create a fresh connection with the game’s servers and hopefully allow you to join parties again. Close the game on your computer or console completely. Wait a few seconds, then restart the game."
    },
    {
      "title": "Check your internet connection and restart your router.",
      "content": "Check your internet connection and restart your router. Ensure your computer or console is connected to the internet. If there’s an issue with your internet connection, disconnect your gaming device from the internet. Then, unplug your router or modem from its power source. Plug it back in after at least a minute to restart it, and wait for all its lights to come back on. [2] X Research source Once you’ve fully restarted your router or modem, reconnect your device to the internet and test its connection (either by restarting Fortnite or going to a webpage you use often)."
    },
    {
      "title": "Invite friends to join your party.",
      "content": "Invite friends to join your party. If your game and internet connection seem to work, try sending invites to your friends, asking them to join your party. You can do this by launching Fortnite and clicking on the plus sign located above the empty slots next to your character. This will allow you to see your friends list; just select a friend’s gamertag and choose to send them an invite. If your friend can join your party, error code 91 may be resolved!"
    },
    {
      "title": "Verify your game files on a computer.",
      "content": "Verify your game files on a computer. If you’re playing Fortnite on a computer, verifying its game files will ensure nothing is broken or corrupted—and fix any files that are. It also won’t affect your existing save data. To verify your game files, follow these steps: [3] X Research source Open the Epic Games Launcher on your computer and find Fortnite in your Epic Games library. Click on the three dots located to the right of the game's title. Select Manage from the dropdown menu, then click the Verify button. Wait for the verification process to complete. This may take a while, so be patient!"
    },
    {
      "title": "Clear your cache if you’re on a console.",
      "content": "Clear your cache if you’re on a console. Clearing your console’s cache removes any temporary data and files from the cache, allowing it to download and store new ones when the console reboots. This can help games run smoother—and if you’re getting error code 91, it may fix the error. [4] X Research source Playstation instructions: Turn off your PlayStation via the Power menu and wait for its lights to shut off. Press and hold the console’s power button until you hear a second beep (which takes about 7 seconds). Connect your controller to the console with the USB cable and press the PS button. Go to Clear Cache and Rebuild Database , then select Clear System Software Cache . Select OK, wait for the console to restart fully, then launch the game. Xbox instructions: Turn off your Xbox, then unplug it. Unplug all connected accessories as well. Leave it unplugged for at least 2 minutes. Press and hold the Xbox’s power button while unplugged, then reconnect the power cord. Turn the Xbox back on and launch the game. Nintendo Switch instructions: Select the Home menu. Navigate to System Settings > System > Formatting options > Clear Cache . Choose the user whose cache you want to clear and follow the instructions that appear. Restart your Switch, then launch the game."
    },
    {
      "title": "Ensure crossplay is enabled on a console.",
      "content": "Ensure crossplay is enabled on a console. If crossplay is disabled for any reason, this will prevent you from joining parties—so make sure it’s turned on. Note that this is just a potential issue for PlayStation and Xbox users; you can’t disable crossplay on a computer or Nintendo Switch. [5] X Research source Playstation instructions: While in the game's lobby, press Start and scroll to the gear icon to access the Menu. Navigate to Settings > Account and Privacy , then scroll down to Gameplay Privacy . Under Allow Cross Platform Play , set it to Yes to enable crossplay. Xbox instructions: Press the Xbox button on your controller and navigate to Profile & system > Settings > Account . From there, select Privacy & online safety > Xbox privacy > View details and customize > Communication & multiplayer . On this page, you can change settings for several options, including joining multiplayer games and cross-network play. Set both options to Allow (rather than Block)."
    },
    {
      "title": "Fix your device’s NAT type if necessary.",
      "content": "Fix your device’s NAT type if necessary. NAT (Network Address Translation) issues can affect the game's ability to connect you to other players and cause error code 91. To fix this, ensure your computer or console’s NAT type is set to Open. You can do this with port forwarding or UPnP; simply follow our instructions on changing NAT types here . [6] X Research source You may also need to check your router’s manual for specific port forwarding instructions. A restrictive NAT type can prevent successful connections, potentially causing error code 91 in Fortnite."
    },
    {
      "title": "Reinstall Fortnite on your device.",
      "content": "Reinstall Fortnite on your device. On a computer, you can uninstall the game and then reinstall it through the Epic Games launcher; just navigate to your Library, find Fortnite , click the three dots next to its title, and select Uninstall from the dropdown menu. When that’s done, reinstall Fortnite the same way—by selecting Install from the dropdown menu instead. Xbox : In My Games & Apps, navigate to the Fortnite icon, press the Menu button on your controller, and select Uninstall from the dropdown menu. Then, go to My Games & Apps > Full Library , click on Fortnite , and select Install All . Playstation : Find Fortnite in your Library, press the Options button on your controller, and select Delete from the dropdown menu. Then, navigate to Purchased games in your Library, click on Fortnite , and select Download . Nintendo Switch : Navigate to System Settings > Data Management > Manage Software . Select the Fortnite icon, then select Delete Software to uninstall it. To reinstall it, simply download Fortnite from the Nintendo eShop."
    },
    {
      "title": "Contact Epic Games support if the problem isn’t fixed.",
      "content": "Contact Epic Games support if the problem isn’t fixed. Finally, if you can’t seem to get error code 91 fixed on your own, you can always outsource the issue to Epic Games. Go to the Contact Us page at https://www.epicgames.com/help/en-US/contact-us ; from there, you can log into your account (which you should have if you play Fortnite ) and submit a help ticket. On the form page where you can fill out and submit the help ticket, you can also opt for a live chat by scrolling to the bottom of the form and clicking START A LIVE CHAT ."
    },
    {
      "title": "Fortnite Error Code 91 is usually related to network connection issues.",
      "content": "Fortnite Error Code 91 is usually related to network connection issues. It’s most often caused by connectivity problems (meaning your internet connection is unstable or keeps getting interrupted) or server problems (meaning the Fortnite servers themselves are malfunctioning). Additionally, the game client might have a bug causing the problem. [7] X Research source The error code can also result from your security settings; your computer or network may have a firewall blocking Fortnite from connecting successfully."
    }
  ]
}