{
  "url": "https://www.wikihow.com/Eat-Ramen-Noodles-Without-Making-Soup",
  "title": "How to Eat Ramen Noodles Without Making Soup",
  "steps": [
    {
      "title": "Boil ramen noodles in water.",
      "content": "Boil ramen noodles in water. Boil 4 cups (946 ml) of water in a medium sized saucepan. When boiling, insert your ramen into the pan. After 3 minutes, or when the noodles are tender, remove the pan from the heat. [1] X Research source The seasoning packets for the ramen can be thrown away or used for another purpose."
    },
    {
      "title": "Drain and rinse the noodles.",
      "content": "Drain and rinse the noodles. Position your strainer in the sink. Hold the saucepan over the strainer and pour the noodles into the strainer. When the water has completely drained, rinse the noodles with cold water. Allow the water to drain again, and set the noodles aside. [2] X Research source"
    },
    {
      "title": "Whisk the sauce ingredients in a bowl.",
      "content": "Whisk the sauce ingredients in a bowl. In a medium sized mixing bowl, add the peanut butter, water, vinegar, teriyaki sauce, garlic, and crushed red pepper. Use a whisk to mix these ingredients together until the mixture is smooth throughout. [3] X Research source If you dislike spicy food, leave out the crushed red pepper. Add slightly more peanut butter to thicken the sauce and make it creamier."
    },
    {
      "title": "Combine noodles with the sauce and enjoy.",
      "content": "Combine noodles with the sauce and enjoy. Transfer the noodles to the mixing bowl with the sauce. Add the chopped carrots and scallions to the same bowl. Use a wooden spoon or similar kitchen implement to toss the salad and enjoy. [4] X Research source"
    },
    {
      "title": "Boil the frozen veggies and ramen noodles together.",
      "content": "Boil the frozen veggies and ramen noodles together. Fill a medium sized pot halfway with water. Boil the water over high heat. Insert the frozen veggies into the pot. Keep the heat set to high so the water reaches a boil again. Add ramen to the boiling water. Cook the veggies and noodles about 3 minutes. Your veggies and noodles may cook in under 3 minutes. When the veggies and noodles are both tender, remove the pot from the heat. [5] X Research source"
    },
    {
      "title": "Drain water from the pot ingredients.",
      "content": "Drain water from the pot ingredients. Place a strainer in your sink. Take the pot from the burner and pour the veggies and noodles into the strainer to drain the water from them. Keep the veggies and noodles in the strainer and set it off to the side. Return the pot to the stovetop."
    },
    {
      "title": "Add water, seasoning packets, and cheese to the pot.",
      "content": "Add water, seasoning packets, and cheese to the pot. Set the pot’s burner to medium heat. Combine water, the ramen seasoning packets, and the French onion cheese with a whisk in the pot. Stir the mixture continuously until it is smooth. [6] X Research source"
    },
    {
      "title": "Combine the cheese mixture with the noodles and veggies.",
      "content": "Combine the cheese mixture with the noodles and veggies. Shake the veggies and noodles while they are still in the strainer slightly back and forth over the sink to remove any remaining water from them. Then pour the veggies and noodles back into the pot. Stir the ingredients until they are well distributed and the veggies and noodles are coated with the sauce. [7] X Research source"
    },
    {
      "title": "Stir in pimientos and enjoy.",
      "content": "Stir in pimientos and enjoy. Use a wooden spoon to stir in the pimientos. Cook all ingredients for about 3 minutes. When the ingredients are hot and evenly covered in the sauce, the veggie ramen primavera is completed. Serve and enjoy. [8] X Research source"
    },
    {
      "title": "Preheat your oven.",
      "content": "Preheat your oven. Set your oven to 400°F (204°C). Normally, ovens preheat in 10 to 15 minutes, though this time may vary depending on your oven. To make the most of your time, move on in this recipe while your oven preheats. [9] X Research source"
    },
    {
      "title": "Boil the frozen peas and ramen in water.",
      "content": "Boil the frozen peas and ramen in water. Fill a medium sized pot halfway with water. Turn the heat on the burner to high and bring the water to a boil. Insert your peas and allow the water to come to a boil again. Add the ramen noodles to the water. Cook this for about 3 minutes until the noodles and peas are tender. [10] X Research source"
    },
    {
      "title": "Drain the water.",
      "content": "Drain the water. Position your strainer in your sink. Pour the peas and noodles from the pot into the strainer to drain the water. When all the water has drained, pick up the strainer and shake it lightly to remove any excess water. [11] X Research source"
    },
    {
      "title": "Prepare the frittata mixture.",
      "content": "Prepare the frittata mixture. Add the ricotta and Parmesan cheese, eggs, milk, pepper, and two ramen seasoning packets in a large mixing bowl. Use a whisk to mix these until they are well blended. With a wooden spoon, stir your peas and noodles into this mixture. [12] X Research source"
    },
    {
      "title": "Pour the frittata mixture into a baking dish.",
      "content": "Pour the frittata mixture into a baking dish. Coat the bottom of the baking dish with a non-stick cooking spray. Pour the frittata mixture into the baking dish. Use a wooden spoon to scrape excess mixture from the bowl into the baking dish and spread it in an even layer. [13] X Research source"
    },
    {
      "title": "Bake the frittata and top it with tomatoes.",
      "content": "Bake the frittata and top it with tomatoes. Insert your baking dish into the preheated oven. Bake the mixture for roughly 20 minutes. When the mixture has set and is firm but not hard, remove it from the oven. Heat the tomatoes in a microwave safe bowl until they are hot, then layer them on top of the frittata. [14] X Research source Serve your frittata immediately and enjoy. Transfer leftovers to a covered container. Refrigerate these within two hours of cooking. They will stay good for 3 to 4 days. [15] X Research source"
    }
  ]
}