{
  "url": "https://www.wikihow.com/Draw-a-Coyote",
  "title": "How to Draw a Coyote",
  "steps": [
    {
      "title": "Draw a slightly slanted vertical oval for the head.",
      "content": "Draw a slightly slanted vertical oval for the head. Draw it lightly because you'll need to erase it afterwards."
    },
    {
      "title": "Draw a longer horizontal oval below (yet intersecting) the first one.",
      "content": "Draw a longer horizontal oval below (yet intersecting) the first one."
    },
    {
      "title": "As a guide for the ears, draw two medium sized ovals on top of the first oval.",
      "content": "As a guide for the ears, draw two medium sized ovals on top of the first oval. Make it slimmer and slightly slanting as well."
    },
    {
      "title": "Draw a small oval below to serve as the neck, followed by a bigger oval for the torso.",
      "content": "Draw a small oval below to serve as the neck, followed by a bigger oval for the torso."
    },
    {
      "title": "Add circles for his shoulders and joints; ovals for his arms.",
      "content": "Add circles for his shoulders and joints; ovals for his arms."
    },
    {
      "title": "Draw pairs of stretched ovals to form his legs and feet.",
      "content": "Draw pairs of stretched ovals to form his legs and feet."
    },
    {
      "title": "Using these guide shapes, trace the outline of Coyote's head.",
      "content": "Using these guide shapes, trace the outline of Coyote's head."
    },
    {
      "title": "Continue tracing Coyote's outline.",
      "content": "Continue tracing Coyote's outline. don't forget to add a fluffy tail at his backside."
    },
    {
      "title": "Add more details.",
      "content": "Add more details."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    },
    {
      "title": "Draw a circle for the head.",
      "content": "Draw a circle for the head."
    },
    {
      "title": "Draw another sphere below and behind the first circle to serve as its neck.",
      "content": "Draw another sphere below and behind the first circle to serve as its neck."
    },
    {
      "title": "Draw a U-shaped curve on the first circle, with its bottom pointing diagonally to the right.",
      "content": "Draw a U-shaped curve on the first circle, with its bottom pointing diagonally to the right. This will serve as the coyote's nose."
    },
    {
      "title": "Remove unnecessary lines.",
      "content": "Remove unnecessary lines."
    },
    {
      "title": "Draw a larger oval below and behind the second oval.",
      "content": "Draw a larger oval below and behind the second oval. This will serve as its body."
    },
    {
      "title": "Below the large oval, draw stretched ovals for its legs.",
      "content": "Below the large oval, draw stretched ovals for its legs. The front pairs straight and the back pairs with joints. Add circles below for the feet."
    },
    {
      "title": "Using the guide lines as reference, draw the outline and ears of the coyote's head (To make a furry impression, use zigzag lines).",
      "content": "Using the guide lines as reference, draw the outline and ears of the coyote's head (To make a furry impression, use zigzag lines). Below the largest oval near the farthest leg, trace a slightly wavy line to as a guide for the tail."
    },
    {
      "title": "In-between the ears, draw three vertical lines going down towards the nose.",
      "content": "In-between the ears, draw three vertical lines going down towards the nose. Draw a horizontal line intersecting these three lines to serve as guides where to place the eyes."
    },
    {
      "title": "Using the above guide lines, draw details of its eyes, nose, mouth, etc.",
      "content": "Using the above guide lines, draw details of its eyes, nose, mouth, etc."
    },
    {
      "title": "Add inside details of the coyote's ears.",
      "content": "Add inside details of the coyote's ears."
    },
    {
      "title": "Begin tracing the front of the coyote's body and legs.",
      "content": "Begin tracing the front of the coyote's body and legs."
    },
    {
      "title": "Continue tracing the rest of the coyote's body, legs and tail.",
      "content": "Continue tracing the rest of the coyote's body, legs and tail."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Add further \"furry\" details by using small line dashes.",
      "content": "Add further \"furry\" details by using small line dashes."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    }
  ]
}