{
  "url": "https://www.wikihow.com/Copy-Wii-Games",
  "title": "How to Copy Wii Games",
  "steps": [
    {
      "title": "Assemble the items you’ll need.",
      "content": "Assemble the items you’ll need. In order to softmod the Wii and backup games, you’ll need a few things. You’ll need an SD card to copy hack files from your computer to your Wii and install the Homebrew Channel. You’ll also need an external hard drive big enough to store multiple games. Game sizes range from around 1GB all the way up to 6GB per game, so a drive with at least 250GB is recommended to store your library. To run the USB backup system, you will need to mod your Wii system. It is done completely through software and no special tools are required. This guide will run you through the steps."
    },
    {
      "title": "Find your Wii version number.",
      "content": "Find your Wii version number. In order to install the right hack, you need to know which version of the Wii operating system you are using. To do so, turn on the Wii, open the Wii Options menu, and then click \"Wii Settings\". Your Wii version number will appear in the top-right corner."
    },
    {
      "title": "Download the appropriate hack for your version.",
      "content": "Download the appropriate hack for your version. For system version 4.2 or lower, download the correct Bannerbomb hack. If you have system version 4.3, you will need the correct official game and save hack. For this guide, we will use LEGO Star Wars: The Complete Saga and the “Return of the Jodi” save hack."
    },
    {
      "title": "Download the correct Bannerbomb hack.",
      "content": "Download the correct Bannerbomb hack. Download the HackMii installer as well."
    },
    {
      "title": "Insert an SD or SDHC card into your computer.",
      "content": "Insert an SD or SDHC card into your computer. If you are using an SD or SDHC card that the Wii has already used, rename the \"Private\" folder to avoid conflicts."
    },
    {
      "title": "Copy the files.",
      "content": "Copy the files. Copy the contents of the Bannerbomb zip file to the SD or SDHC card, preserving the file structure. Copy the \"installer.elf\" file from the HackMii installer zip file to the SD or SDHC card, and rename it to \"boot.elf\"."
    },
    {
      "title": "Remove the SD or SDHC card from your computer and insert it into the Wii.",
      "content": "Remove the SD or SDHC card from your computer and insert it into the Wii. Turn it on, open the Wii Options menu, click \"Data Management\", then \"Channels\". Select the SD tab."
    },
    {
      "title": "Confirm the pop-up.",
      "content": "Confirm the pop-up. A window will appear when the SD tab is selected in the Wii Channel Management page with the message “load boot.dol/elf?” Select \"Yes\" to proceed with the softmod."
    },
    {
      "title": "Install the Homebrew Channel and DVDx.",
      "content": "Install the Homebrew Channel and DVDx. Use the direction pad to navigate the menus, and the A button to make selections. The Homebrew Channel will allow you to install custom software, and the DVDx utility will allow your Wii to play DVD movies."
    },
    {
      "title": "Finish the installation.",
      "content": "Finish the installation. After a few moments, you should receive a Success message letting you know that Homebrew has been successfully installed. You can return to the Wii menu and access Homebrew anytime from the Channels."
    },
    {
      "title": "Download the correct Bannerbomb hack.",
      "content": "Download the correct Bannerbomb hack. Download the HackMii installer as well."
    },
    {
      "title": "Insert an SD or SDHC card into your computer.",
      "content": "Insert an SD or SDHC card into your computer. If you are using an SD or SDHC card that the Wii has already used, rename the \"Private\" folder to avoid conflicts."
    },
    {
      "title": "Copy the files.",
      "content": "Copy the files. Copy the contents of the Bannerbomb zip file to the SD or SDHC card, preserving the file structure. Copy the \"installer.elf\" file from the HackMii installer zip file to the SD or SDHC card, and rename it to \"boot.elf\"."
    },
    {
      "title": "Remove the SD or SDHC card from your computer and insert it into the Wii.",
      "content": "Remove the SD or SDHC card from your computer and insert it into the Wii. Turn it on and press the SD card icon to open the SD menu."
    },
    {
      "title": "Confirm the pop-up.",
      "content": "Confirm the pop-up. A window will appear when the SD menu is opened with the message “load boot.dol/elf?” Select \"Yes\" to proceed with the softmod."
    },
    {
      "title": "Install the Homebrew Channel and DVDx.",
      "content": "Install the Homebrew Channel and DVDx. Use the direction pad to navigate the menus, and the A button to make selections. The Homebrew Channel will allow you to install custom software, and the DVDx utility will allow your Wii to play DVD movies."
    },
    {
      "title": "Finish the installation.",
      "content": "Finish the installation. After a few moments, you should receive a Success message letting you know that Homebrew has been successfully installed. You can return to the Wii menu and access Homebrew anytime from the Channels."
    },
    {
      "title": "Download the \"Return of the Jodi\" save hack.",
      "content": "Download the \"Return of the Jodi\" save hack. Extract the contents of the zip file to an SD card that is 2GB or smaller, keeping the file structure intact."
    },
    {
      "title": "Insert the SD card into the Wii.",
      "content": "Insert the SD card into the Wii. Turn it on, open the Wii Options menu and select \"Data Management\". Open the \"Save Data\" menu, select \"Wii\", then the SD tab. Copy the \"Return of the Jodi\" save that matches your region."
    },
    {
      "title": "Start LEGO Star Wars.",
      "content": "Start LEGO Star Wars. Load the saved game. After the game loads, walk to the bar on the right and switch characters. Select the character named “Return of the Jodi.” This will begin the hack process."
    },
    {
      "title": "Install the Homebrew Channel and DVDx.",
      "content": "Install the Homebrew Channel and DVDx. Use the direction pad to navigate the menus, and the A button to make selections. The Homebrew Channel will allow you to install custom software, and the DVDx utility will allow your Wii to play DVD movies."
    },
    {
      "title": "Finish the installation.",
      "content": "Finish the installation. After a few moments, you should receive a Success message letting you know that Homebrew has been successfully installed. You can return to the Wii menu and access Homebrew anytime from the Channels."
    },
    {
      "title": "Download the necessary software.",
      "content": "Download the necessary software. In order to install the backup software, you will need to install a few more tools for the Wii now that it is softmodded. Download the latest version of DOP-Mii as well the cIOS installer ."
    },
    {
      "title": "Extract DOP-Mii onto the SD card inserted into your computer.",
      "content": "Extract DOP-Mii onto the SD card inserted into your computer. Keep the file structure intact."
    },
    {
      "title": "Insert the SD card into the Wii and open the Homebrew Channel.",
      "content": "Insert the SD card into the Wii and open the Homebrew Channel. Run DOP-Mii from the list of programs and select “Install IOS36 (v3351) w/ FakeSign”. Select \"Yes\" when asked to Apply NAND permissions and download the patches from the internet server. Select \"Yes\" again when it prompts you to restore. When it completes, it will drop you back at the Homebrew Channel."
    },
    {
      "title": "Place the SD card back in your computer, then extract the cIOS installer into the Apps folder.",
      "content": "Place the SD card back in your computer, then extract the cIOS installer into the Apps folder. Keep the file structure intact."
    },
    {
      "title": "Insert the SD card back into the Wii and open the Homebrew Channel.",
      "content": "Insert the SD card back into the Wii and open the Homebrew Channel. Launch the cIOS installer from the list of programs. Select IOS36 from the version options, then select Network Installation and press A. After installing successfully, the program will ask you to press any button to restart the Wii. Once it is done restarting, you will back in the Homebrew Channel."
    },
    {
      "title": "Prepare your external hard drive.",
      "content": "Prepare your external hard drive. Plug your external hard drive into your computer. You will need to download a program that will format your hard drive to match the file system of the Wii. WBFS (Wii Backup File System) Manager is a free, open-source program that will properly format the drive. Run WBFS Manager with your external hard drive connected and select it from the dropdown menu in the program. Be sure to select the right drive because all data will be lost when it is formatted. After formatting, remove the external hard drive from your computer and plug it into the bottom USB port of the Wii."
    },
    {
      "title": "Install USB Loader GX.",
      "content": "Install USB Loader GX. Insert the SD card into your computer. Download the latest version of USB Loader GX free from the website . The site offers an executable file for download that will automatically put the files into the right section of the SD card."
    },
    {
      "title": "Launch USB Loader GX.",
      "content": "Launch USB Loader GX. Once the files are placed on the SD card, insert it into the Wii and open the Homebrew Channel. Select USB Loader GX from the list of programs, then click \"Load\"."
    },
    {
      "title": "Insert a game into your Wii.",
      "content": "Insert a game into your Wii. With USB Loader GX open, click \"Install\" and then \"OK\". Depending on the size of the game, this could take up to several minutes. Once the game is finished copying, it will appear in the main window of USB Loader GX. At that point, you can eject the disc from the Wii. Repeat this step for as many games as you want to copy."
    },
    {
      "title": "Download cover art.",
      "content": "Download cover art. Press 1 on the Wii remote to open the Cover download menu. You can choose between several different types of images, including cover images and disc images."
    },
    {
      "title": "Play a game.",
      "content": "Play a game. You can select any game from the list to begin playing. You can also change the way games are listed by using the top buttons in USB Loader GX."
    }
  ]
}