{
  "url": "https://www.wikihow.com/Deal-with-an-Existential-Crisis",
  "title": "How to Deal with an Existential Crisis",
  "steps": [
    {
      "title": "Identify your crisis triggers by examining your recent actions and thoughts.",
      "content": "Identify your crisis triggers by examining your recent actions and thoughts. It’s very likely that a particular moment or event prompted you to feel as if you are in crisis. For some people, this can be a meeting at your work that doesn’t go the way you planned. Or, you may have had a lovely couples’ dinner that reminded you how much you want a partner. Knowing your triggers lets you plan to avoid or counter situations that may push you into crisis. For example, you might plan group gatherings instead of dinners where you’ll feel like a third-wheel. Triggers can include major life events, such as the death of a loved one, losing your job, or getting a divorce."
    },
    {
      "title": "Know when to just leave your crisis moment alone.",
      "content": "Know when to just leave your crisis moment alone. You might be the type of person who has a series of existential crises and actually thrives off of them. Or, at the very least, they may pass without really upsetting your mental state for very long. See if you can discern a pattern to your crisis moments and experiment with what happens if you just ignore it and move on. [1] X Research source If you feel overwhelmed with negative thoughts, then you may need to take action. Talking with a therapist might be a good start."
    },
    {
      "title": "Create a mental catalog of the people who love you.",
      "content": "Create a mental catalog of the people who love you. Sit down and think about all of the people you’ve had contact with over your life. Identify those people who you’d consider to be friends and family. Out of that category, separate out those people who you know truly love you. Do this exercise often and you’ll see how extended your support network actually is. [2] X Research source Don’t assess the final category based on how many people end up there. Instead, focus on the quality of these positive feelings."
    },
    {
      "title": "Imagine one of your idols giving you advice.",
      "content": "Imagine one of your idols giving you advice. Think about someone who you admire, even if you’ve never met them. Then, envision telling them how you are feeling and what they’d say in response. This is a great way to give yourself advice, but in a more detached sense. [3] X Research source For example, you might express your concerns to imaginary Oprah Winfrey and guess what she’d tell you to do."
    },
    {
      "title": "Dig deeper beyond the surface of the problem.",
      "content": "Dig deeper beyond the surface of the problem. This is when talking things out with another person can really help. You may think that you are depressed about a particular incident that took place that day, but it’s likely a much larger issue. Keep asking yourself, “What else is bothering me?” [4] X Research source For example, as a parent, you might not just get frustrated at the constant stream of laundry at home, but also the inability to spend time with your friends as easily as you did before having children."
    },
    {
      "title": "Force yourself to go out and spend time with other people.",
      "content": "Force yourself to go out and spend time with other people. When you are experiencing a crisis, the last thing you’ll want to do is socialize with others. But, that is exactly what you need to do. Perhaps start off small by going to see a movie, then build up to a social gathering. [5] X Research source Being around other people will help you to keep yourself busy and fight off the feelings of loneliness. Avoid comparing yourself with others when you go out. This can make you feel worse."
    },
    {
      "title": "Use the crisis to learn what you want to improve in your life.",
      "content": "Use the crisis to learn what you want to improve in your life. An existential crisis may indicate that you are dissatisfied or frustrated with a certain part of your life. Try thinking about what the cause of your crisis was, and see if you can find ways to improve that element of your life. For example, if you feel stuck in a dead-end job, it could be a sign that you need to get a new job. Set manageable goals for yourself, like teaching yourself a new skill or applying for a certain number of jobs each week. If you're uncertain about what to do, considering talking to a friend or a mental health professional."
    },
    {
      "title": "Remove the focus from yourself and place it on others.",
      "content": "Remove the focus from yourself and place it on others. When you are in the midst of an existential crisis, it can feel as if you are all alone in the world with your problems. To take yourself out of this mindset, go out and pay attention to other people. Try to see if you can identify a problem they are having and how you might help. In addition to putting your problems in perspective, helping others will make you feel happy. For example, if you see someone accidentally drop some items on the floor at a store, you might rush over and help them pick them up."
    },
    {
      "title": "Stop comparing yourself to others.",
      "content": "Stop comparing yourself to others. This is a road that will only lead to negativity and crises, because someone else will always appear to have it better than you. If you find yourself thinking enviously about that celebrity or coworker, tell yourself “no.” Then, force yourself to think about what you actually have in common with that person. [6] X Research source For example, instead of being jealous that a coworker gets to take a ski vacation, focus on the fact that they enjoy being outdoors like you do."
    },
    {
      "title": "Clean up your room and surroundings.",
      "content": "Clean up your room and surroundings. A chaotic or dirty environment can help to spawn angry, negative feelings. Take charge of your space by organizing, mopping, vacuuming, and cleaning it. You might even go out and buy a new piece of furniture for the space. [7] X Research source Invite other people over to help you organize. This will reduce the possibility of loneliness, too."
    },
    {
      "title": "Talk it out with a friend or family member.",
      "content": "Talk it out with a friend or family member. Reach out to someone who you trust and who will keep whatever you say confidential. Then, meet with them in a quiet place where you will not be disturbed. Tell them how you are feeling, being as descriptive and detailed as you can. Remind them that you are not looking for advice necessarily, just someone to listen. [8] X Research source For example, you might say, “I’ve not felt comfortable with my career life for the past 6 months or so.”"
    },
    {
      "title": "Reach out to a therapist.",
      "content": "Reach out to a therapist. A severe existential crisis can sometimes spiral into feelings of anxiety or depression. If you are worried that this might be your situation, then reach out to your primary care physician for a therapy referral. Many therapists offer a free first visit or reduced rates to counter the expense. This is an especially good option if you feel as if you have no one in your life to air your thoughts out with."
    },
    {
      "title": "Attend a support group.",
      "content": "Attend a support group. A therapist might also be able to recommend a support group aimed at targeting whatever seems to be prompting your feelings of crisis. The group might meet on a weekly or even monthly basis. Most groups gather in a central, accessible location, such as a hospital or community center. For example, if your crises seem to stem from the loss of loved ones, then a grief support group could be helpful."
    },
    {
      "title": "Call a hotline or emergency services if you have thoughts of self-harm.",
      "content": "Call a hotline or emergency services if you have thoughts of self-harm. If your crisis deepens to the point at which you feel hopeless or if you even contemplate harming yourself, go ahead and call a suicide prevention hotline. This will give you a chance to talk through your emotions with a trained professional. Alternatively, you can also reach out to directly to emergency services in your area for assistance. For example, in the United States or Canada, you can call or text 988 to reach a suicide crisis helpline."
    }
  ]
}