{
  "url": "https://www.wikihow.com/Find-the-Right-Pixie-Cut",
  "title": "How to Find the Right Pixie Cut",
  "steps": [
    {
      "title": "Draw an outline around your hairline, cheeks, and chin.",
      "content": "Draw an outline around your hairline, cheeks, and chin. Look in a mirror to get a straight-on view of your face. Use an eyeliner pencil to mark a dotted line around the outside edges of your face. Start at your forehead, drawing the dotted line across at your hairline, and then extend it down to trace the outside edges of your cheeks and jaws. Continue the line around the base of your chin. [2] X Research source You can snap a photo of your face, print it out, and trace around your face on the print-out, if you prefer. [3] X Research source Consider having someone else take your photo from a few steps away, instead of using a selfie which distorts your facial proportions."
    },
    {
      "title": "Compare the widths of each part of your face to determine your face shape.",
      "content": "Compare the widths of each part of your face to determine your face shape. You can make the comparisons visually, or use a tape measure to get the exact proportions. First, determine which part of your face is the widest (forehead, cheekbones, or jaw). Then look at the shape of your chin and jawline (rounded, square, or pointed). Lastly, check whether your face is longer than it is wide, or wider than it is long. This will help you determine which of the face shapes you have: round, oval, square, rectangular, heart, or diamond."
    },
    {
      "title": "Identify a round or oval face by wide cheekbones and a rounded chin.",
      "content": "Identify a round or oval face by wide cheekbones and a rounded chin. You have a round face if your cheekbones are the widest part of your face, your chin features soft curves in a rounded shape, and your face is wider than it is long. [4] X Research source If your face is longer than it is wide, you have an oval face."
    },
    {
      "title": "Look for a broad, strong jaw and chin as evidence of a square or rectangular face.",
      "content": "Look for a broad, strong jaw and chin as evidence of a square or rectangular face. Your face is square-shaped if your jaw is the widest part of your face. You have a strong, square jawline and your face is wider than it is long. [5] X Research source However, if your face is longer than it is wide, you have a rectangular-shaped face."
    },
    {
      "title": "Note a narrow tapered chin as the hallmark of a heart-shaped or diamond face.",
      "content": "Note a narrow tapered chin as the hallmark of a heart-shaped or diamond face. Your face is likely heart-shaped if your forehead or cheekbones are wider than your jaw. The signature feature of a heart-shaped face is a chin that tapers down to a point. Usually, your face will be wider than it is long if it’s heart-shaped. [6] X Research source If your face is longer than it is wide, and your forehead is narrower than your cheekbones, you have a diamond-shaped face."
    },
    {
      "title": "Decide if you want your pixie cut to show off or balance out your face shape.",
      "content": "Decide if you want your pixie cut to show off or balance out your face shape. As long as you have confidence, you can pull off any haircut! [7] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. But you might not love just any haircut if it doesn’t deliver the effect you intended. Then think about whether you want to use your hair to highlight your features or soften them. For example, if you have a short and wide round face, you might want to elongate it with sweeping bangs. Or, you might want super-short fringe that emphasizes your cute, compact features. [8] X Research source Search online for photos of celebrities with your face shape to see how different haircuts transform their faces."
    },
    {
      "title": "Emphasize oval or heart-shaped facial features with crown volume.",
      "content": "Emphasize oval or heart-shaped facial features with crown volume. If you want to enhance the elfin beauty of your heart-shaped face, get a cut with plenty of volume up top. Try short baby bangs to make your chin seem smaller and your eyes lower-set on your face. [9] X Research source To draw attention to the length and elegance of your oval face, keep your hair short on the sides and add volume at the top. [10] X Research source Oval and heart-shaped faces naturally lend themselves to a variety of pixie cuts, so feel free to experiment! [11] X Research source The narrow chin of a heart-shaped face and the long proportions of an oval face, especially if paired with sculpted cheekbones, can balance out lots of volume up top but can also feel balanced under buzz-cut style pixies. [12] X Research source"
    },
    {
      "title": "Try a boyish cut to highlight the sculpted features of rectangular or square faces.",
      "content": "Try a boyish cut to highlight the sculpted features of rectangular or square faces. A tousled schoolboy-style haircut cut will play up your sculpted cheekbones and jawline. Keep it voluminous and use a gel or pomade product to hold your choppy locks in place. [13] X Research source This kind of boyish look can be especially fun when contrasted with feminine style choices."
    },
    {
      "title": "Keep plenty of volume and texture at the top to lengthen short faces.",
      "content": "Keep plenty of volume and texture at the top to lengthen short faces. By adding length and volume at your crown and roots, you’ll lengthen out your overall face shape. This is especially effective on square and round faces. You can keep the hair off of your forehead to add even more length. Consider a pixie with choppy texture framing your face and adding volume all over. This kind of style will break up the soft round curves of a round face and will emphasize the angular contours of a square face. [14] X Research source A sleek, long side bang tucked behind your ear will mirror the roundness and shortness of your face. You can avoid this style if you’d rather balance out your proportions, but it can be a chic way to emphasize your facial structure. [15] X Research source"
    },
    {
      "title": "Add choppy texture at the top and sides to balance out long faces.",
      "content": "Add choppy texture at the top and sides to balance out long faces. Oval, diamond, and rectangular faces tend to be longer and leaner than other face shapes. If you’d rather make your long face appear shorter, add a sweeping side bang and maintain some layers and volume at the sides of your face to widen it out. [16] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Since diamond-shaped faces are narrower at the forehead, they can benefit from choppy tendrils at the top and around the sides for added width. [17] X Research source"
    },
    {
      "title": "Balance the width of wider faces with angular, asymmetrical cuts.",
      "content": "Balance the width of wider faces with angular, asymmetrical cuts. Opt for a deeper side part and a dynamic, asymmetrical style to play up your angular features. If your hair conceals your broader forehead and cheekbones, it will help your chin appear narrower. [18] X Research source Consider adding angular pieces in front of your ears to mask the width of your cheekbones and emphasize your strong bone structure. You can go an extra step and keep one side of your hair (with the sideswept bangs) fuller and more voluminous, while chopping the other side shorter. [19] X Research source By playing with face-framing texture and bangs that distract from the width of your face, you can make your chin and jawline appear narrower and more angular."
    },
    {
      "title": "Aim for chin-length styles to soften narrow, pointed chins.",
      "content": "Aim for chin-length styles to soften narrow, pointed chins. Not all diamond and heart-shaped faces end in a sharp pointed chin, but if yours does you can downplay this with a longer pixie. Avoid top-heavy styles and get a cut that keeps some hair around your chin. Try an angled bob, which involves longer hair in the front and a shorter crop in the back. This can be a fun and flattering style. A choppy bob can serve as a great starting point that you can eventually shift to a shorter pixie style."
    },
    {
      "title": "Choose face-framing bangs to conceal taller foreheads on long faces.",
      "content": "Choose face-framing bangs to conceal taller foreheads on long faces. If you have a rectangular, diamond, or oval face and want to distract from the height of your forehead, and the overall length of your face, keep some hair over your forehead in the form of soft sideswept bangs. [20] X Research source Baby bangs and lots of volume at the top can highlight the length of your forehead, but this attention-grabbing style isn’t for everyone."
    },
    {
      "title": "Incorporate longer layers into your pixie if you have naturally curly hair.",
      "content": "Incorporate longer layers into your pixie if you have naturally curly hair. Curly and wavy hair can result in an array of dynamic, beautifully textured pixie styles, as long as you maintain enough length for your curls to take shape. [21] X Research source Get layers to make your hair feel lighter, rather than weighed down. Layers wil add plenty of volume, movement, and texture to your cut. [22] X Research source If you’re not sure how your curls will perform in a short crop, you can try going for a bob first. Observe the habits of your shorter curls and master a few styling tricks before going in for the pixie."
    },
    {
      "title": "Keep thick hair shorter at the sides and longer at the crown.",
      "content": "Keep thick hair shorter at the sides and longer at the crown. Unless you want to add width to balance out a narrow face, you should stick to a pixie with shorter trimmed sides. Consider getting a cut that tapers down in around the back and bottom as well to manage your hair’s texture and volume. But keep plenty of fullness and layers at the top of your style, to take advantage of your voluminous tresses. [23] X Research source Avoid getting a blunt pixie cut if you have thicker hair. It won’t provide as much movement and might not feel balanced."
    },
    {
      "title": "Create choppy layers and edgy bangs to give dimension to fine hair.",
      "content": "Create choppy layers and edgy bangs to give dimension to fine hair. While fine hair can feel limp in a heavy, long haircut, it can be light and voluminous when chopped short. Add plenty of layers so your hair looks nice and full. Choppy, asymmetrical cuts look especially great with fine hair. Try bangs that are graduated from short to long. Or go straight for baby bangs!. You may want to avoid a heavy side bang since it could get weighted down and start looking a little limp. For even more depth and dimension, consider adding lowlights and highlights that will emphasize your pixie’s volume. [24] X Research source"
    },
    {
      "title": "Find texturizing and volumizing products to boost and hold fine hair.",
      "content": "Find texturizing and volumizing products to boost and hold fine hair. If you have fine hair, develop an arsenal of products that will add dynamism and movement to your pixie. Try a variety of styling mousses and pomades, texturizing sprays, and hairsprays and see which ones you like best. Dry shampoo will be handy for keeping next-day styles fresh and lively. [25] X Research source Work these products into your roots to keep your style choppy and voluminous. Try teasing your roots as well for extra lift. [26] X Research source"
    },
    {
      "title": "Opt for long angled bangs to do sideswept and coiffed styles.",
      "content": "Opt for long angled bangs to do sideswept and coiffed styles. Angled side bangs can frame your face and emphasize your cheekbones. But you don’t always need to style them in front of your face! Long bangs can be brushed back off your face and arranged into an edgy, masculine coif. [27] X Research source A coif involves arranging your bangs up and off of your forehead so that they add height and texture to your pixie. You can add curls or waves, or go for a spikey effect. Use styling pomade to add volume at the roots and hold your hair in place in a coif."
    },
    {
      "title": "Keep length and layers at the front if you plan to add curls or waves.",
      "content": "Keep length and layers at the front if you plan to add curls or waves. If your hair holds a curl, this instantly broadens your pixie styling potential. Whether you plan to liven up your straight hair with glamorous retro finger waves or soft, tousled curls, get a slightly longer pixie cut with layers. [28] X Research source For maximum pixie curling potential, get a long pixie that borders on bob territory. Alternatively, you can keep your pixie shorter at the back and longer towards the front to add in just a few face-framing curls."
    },
    {
      "title": "Choose a sleek cut with more length at the front for slicked-back styling.",
      "content": "Choose a sleek cut with more length at the front for slicked-back styling. Do you want to try the gelled, slicked-back look? If so, keep your hair long enough to tuck behind your ears, and aim for a cut that’s sleek at the back and neat around the nape of your neck. [29] X Research source Choppier cuts won’t hold this style as well. Textured layers will be hard to keep down smoothly."
    }
  ]
}