{
  "url": "https://www.wikihow.com/Dye-Fabric-with-Beets",
  "title": "How to Dye Fabric with Beets",
  "steps": [
    {
      "title": "Peel 3 to 4 beets",
      "content": "Peel 3 to 4 beets , then cut them into large chunks. The size of the chunks doesn't really matter, but something between 1 and 2 inches (2.5 and 5.1 cm) would work great. Don't use whole beets, because they won't release enough dye. [1] X Research source You don't want to cut the beets too small. If you do, the pieces will be harder to remove later on."
    },
    {
      "title": "Place the beets into a pot, then fill the pot with water.",
      "content": "Place the beets into a pot, then fill the pot with water. How much water you use will depend on the size of the pot. Use enough water to fill the pot 1 to 2 inches (2.5 to 5.1 cm) from the rim. [2] X Research source You will be boiling the water shortly, so the temperature does not matter."
    },
    {
      "title": "Place white cotton or linen fabric into a separate pot.",
      "content": "Place white cotton or linen fabric into a separate pot. The pot needs to be large enough for the fabric to be able to move around freely. For best results, use something made from white cotton or linen. [3] X Research source It would be a good idea to wash and dry the fabric beforehand. This will remove any chemicals that might prevent the dye from adhering. Natural dye does not stick well to synthetics, so use natural fibers, such as cotton or linen. You can use this method to dye articles of clothing as well, as long as they are made from white cotton or linen."
    },
    {
      "title": "Fill the clothing pot with a 1-to-4 ratio of vinegar-to-water.",
      "content": "Fill the clothing pot with a 1-to-4 ratio of vinegar-to-water. Fill the pot about a quarter of the way with vinegar first. Push the fabric into the vinegar to ensure that it's soaked through, then fill the remaining three-quarters of the pot with water. [4] X Research source You are only doing this for the pot that has the fabric in it. Don't add anything to the pot with the beets in it. The vinegar will act as a fixative and help the dye adhere better to the fabric. Alternatively, use 1/2 cup (150 g) of salt for every 8 cups (1.9 L) of water."
    },
    {
      "title": "Bring both pots to a boil on the stove.",
      "content": "Bring both pots to a boil on the stove. Set each pot down on a separate burner. Turn the heat up to medium or medium-high, then wait for the water to come to a boil. This may take a few minutes. [5] X Research source Wait for both pots to come to a boil before moving on to the next step."
    },
    {
      "title": "Reduce the heat to low, then let both pots simmer for 1.5 to 2.5 hours.",
      "content": "Reduce the heat to low, then let both pots simmer for 1.5 to 2.5 hours. Again, you want this to happen simultaneously for both pots. Turn the knobs for both burners to low, then wait for the water to reduce to a simmer. Set the timer for anywhere between 1.5 and 2.5 hours. [6] X Research source The longer you let the water simmer, the brighter the color will be."
    },
    {
      "title": "Empty the water from the fabric pot.",
      "content": "Empty the water from the fabric pot. Use a wooden spoon, or something similar, to hold the fabric in place as you pour out the vinegar water. Don't worry if there is some liquid left in the pot. [7] X Research source Don't empty the water from the dye pot."
    },
    {
      "title": "Remove the beets from the dye pot.",
      "content": "Remove the beets from the dye pot. You can use a regular spoon to do this, but a slotted spoon would work even better. Discard the beets or save them for a recipe. [8] X Research source Save the red dye leftover from the beets. Don't dump this out."
    },
    {
      "title": "Pour the dye into the fabric pot, then stir the dye.",
      "content": "Pour the dye into the fabric pot, then stir the dye. Be sure to pour the dye slowly so that it doesn't splash. Next, stir the pot to ensure that everything is submerged; you may have to poke the folds of fabric to get them to stay down. [9] X Research source You won't be able to fill the fabric pot all the way. This is because some of the beet water evaporated while you cooked it."
    },
    {
      "title": "Soak the fabric off-heat in the dye for 12 to 24 hours.",
      "content": "Soak the fabric off-heat in the dye for 12 to 24 hours. There is no need to soak it for longer than that. Make sure that the fabric is fully submerged, however, or it may not dye evenly. If you need to, weigh the fabric down with a plate, bowl, or jar. [10] X Research source Take the pot off the stove for this. Don’t let the dye bath keep simmering for these 12 to 24 hours."
    },
    {
      "title": "Remove the fabric from the dye bath and squeeze it.",
      "content": "Remove the fabric from the dye bath and squeeze it. Do not rinse the fabric, or you may lose some of that beautiful, vibrant color. Just pull the fabric out and gently squeeze the excess dye from it. [11] X Research source It might be a good idea to wear plastic gloves for this step. The beet water may stain your hands for a few days. [12] X Research source If you don't mind a lighter shade of pink, you can rinse the fabric in cool water."
    },
    {
      "title": "Dry the fabric in the hot sun or in a dryer.",
      "content": "Dry the fabric in the hot sun or in a dryer. Heat is key to setting the dye into the fabric. If you live in a warm, sunny climate, drying the fabric outside work the best. Otherwise, toss the fabric into the dryer, and dry it on a low-heat setting. [13] X Research source If you are drying the fabric outside, keep a pot or bucket under it to catch any drips of dye. [14] X Research source"
    },
    {
      "title": "Iron the fabric for 5 minutes to further set the dye.",
      "content": "Iron the fabric for 5 minutes to further set the dye. Adjust your iron to a no-steam, low-heat setting. Place the fabric on the ironing board, then iron it for about 5 minutes. Not only will this help further set the dye into the fabric, but it will also smooth out wrinkles. [15] X Research source Even though your fabric is made from cotton or linen, you should still use a low-heat or warm setting on your iron. Don't use the cotton or linen setting. There is a chance that some of the dye may transfer to the ironing board. Consider covering the board with an old, clean cloth first."
    },
    {
      "title": "Hand wash the fabric in cold water only when necessary.",
      "content": "Hand wash the fabric in cold water only when necessary. Even with the added vinegar, this is a natural dye. It is safer for the environment than regular dye, but it is not permanent. To help preserve the color, hand wash the fabric in cold water only when necessary; avoid using a washing machine, if possible. [16] X Research source If you choose to use a washing machine, use a cold water setting. Wash the dyed fabric separately to avoid color transfer. [17] X Research source"
    }
  ]
}