{
  "url": "https://www.wikihow.com/Do-Oblique-Crunches",
  "title": "How to Do Oblique Crunches",
  "steps": [
    {
      "title": "Lie on your back with your knees bent.",
      "content": "Lie on your back with your knees bent. To begin this exercise, you should lie flat on your back with your knees bent and your feet firmly planted on the ground. [1] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source Try to lie on a yoga mat or a carpeted area to ease the strain on your back during the exercise."
    },
    {
      "title": "Place your hands behind your head.",
      "content": "Place your hands behind your head. Bring both hands up behind your head, with your elbows out. Lightly touch the back of your head with your fingertips. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Be very careful not to pull on your head with your hands during the exercise as this will put unnecessary strain on your neck, and minimize the effectiveness of the crunches. If you are worried about neck strain, you can fold your arms across your chest instead."
    },
    {
      "title": "Lower both knees to the left side.",
      "content": "Lower both knees to the left side. Keeping your hips firmly on the ground, lower your knees down to the ground on the left side of your body. Your legs should remain together, one on top of the other, while you maintain this position. [3] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source Once you have done a set of repetitions on your left side, you can lower your legs on the right side of your body and repeat the exercise. Start with 5-10 repetitions on each side, then increase to 15-20 repetitions as your muscles get stronger."
    },
    {
      "title": "Lift your shoulder blades up.",
      "content": "Lift your shoulder blades up. Contract or squeeze your abdominal muscles as you slowly lift your shoulder blades off of the ground. [4] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021. Due to the side position of your legs, you will be engaging the oblique muscles on the side of your abdomen. You don't have to raise up very high – just a few inches for each repetition. Hold the contraction while you are in the raised position for several seconds before lowering back down to the ground. [5] X Research source Alternatively, you can raise only one side of your body at a time – it should be the opposite side from your legs. For example, if your legs are lowered on the right side of your body, you should place your left hand behind your head and elevate that side of your body. If you don't squeeze your abdominal muscles during the exercise, the movement will not be nearly as physically beneficial for you. [6] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021. Remember that you should be using your core strength to do this, not pulling your head up with your arm strength or jerking yourself upward. [7] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021."
    },
    {
      "title": "Synchronize your breathing.",
      "content": "Synchronize your breathing. Syncing your breaths will help you get the most out of your oblique crunches. You should inhale while you are lowering your body, and exhale while you are raising up off the ground. [8] X Research source Exhaling during the elevation will help your abdominal muscles contract even more, which will aid in working these muscles more effectively."
    },
    {
      "title": "Raise your legs.",
      "content": "Raise your legs. It's possible to get more intensity from your oblique crunches by raising your legs during the exercise. Bending at the hips while keeping your shins parallel with the floor will make this exercise more difficult, and therefore, more effective. [9] X Research source Make sure your keep your back down flat on the floor or mat."
    },
    {
      "title": "Do more repetitions.",
      "content": "Do more repetitions. An obvious way to get more out of your oblique crunches is by doing more repetitions. Start by doing ten reps on each side. Then increase your reps to twenty on each side. As you get stronger, you can increase the number further. [10] X Research source Be careful not to push yourself too hard. You don't want to strain your muscles."
    },
    {
      "title": "Increase your core strength.",
      "content": "Increase your core strength. The obliques can be a difficult muscle group to work out directly, with this being one of the most effective targeted exercises. These muscles work together with your other abdominal muscles to create your core strength, so it's important not to overlook them during workouts. [11] X Research source If you forego oblique exercises, you will end up with disproportionately strong middle abdomen muscles, while your outer obliques remain weaker."
    },
    {
      "title": "Prevent back injury.",
      "content": "Prevent back injury. A strong core means a stronger, healthier body. Working on your core may help prevent back injuries and the resulting back pain from them. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Oblique crunches primarily work to strengthen your hips, pelvis, and core – all of which can work together to prevent back injuries in the future."
    },
    {
      "title": "Improve your lateral stability.",
      "content": "Improve your lateral stability. Your oblique muscles are responsible for helping your body with rotation and lateral stability. This means that these muscles help you remain upright, turn around, and lean from side to side. Exercising these muscles will increase your stability and mobility. [13] X Research source This can also help increase ligament function, balance, and overall flexibility. Reader Poll: We asked 147 wikiHow readers which type of crunches they found most effective for building ab muscles, and 54% of them said elbow-to-knee crunches. [Take Poll] They also work oblique muscles, so they're a good option if you want to change things up."
    }
  ]
}