{
  "url": "https://www.wikihow.com/Crudo-Meaning",
  "title": "“Crudo” Meaning in Spanish Slang & on a Seafood Menu",
  "steps": [
    {
      "title": "Crudo is Spanish slang for a hangover.",
      "content": "Crudo is Spanish slang for a hangover. It's often used to describe a bad hangover from drinking too much. “Crudo” literally translates to “raw” and is used all over Latin America, but especially in Mexico. [1] X Research source ​​"
    },
    {
      "title": "In the food world, crudo refers to raw seafood dishes.",
      "content": "In the food world, crudo refers to raw seafood dishes. The first time the word “crudo” appeared on an American menu was in 2000, at Mario Batali’s flagship seafood restaurant, Esca. Since then, crudos have seemingly continued to soar in popularity, featured on nearly every upscale seafood menu in recent years. An Italian-inspired raw seafood dish, crudos can highlight raw fish, like halibut, sea bass, and snapper, or raw shellfish, like scallops, razor clams, and oysters. [2] X Research source What really makes it a crudo is how the seafood is prepared, using traditional Italian seasonings like citrus, vinegar, and olive oil."
    },
    {
      "title": "Crudo can also mean “harsh” or \"crude.”",
      "content": "Crudo can also mean “harsh” or \"crude.” In places like Mexico, calling someone “crudo” or “cruda” depending on their gender, means that they have no filter and are behaving rudely and/ or making harsh comments. It’s possible that this meaning is related to the “rawness” of brutal honesty, which can sting. This connotation is clearly negative, so it should only be used cautiously and with the knowledge that you will likely offend the person in question. Similarly, you can apply this definition to problematic situations. [3] X Research source"
    },
    {
      "title": "Use “crudo” to describe a hangover.",
      "content": "Use “crudo” to describe a hangover. Since “crudo” can be used as both a noun and an adjective in reference to hangovers, it’s important to note which way is which. One major difference is that the noun version should always be feminine, i.e., “cruda.” The adjective version can be either feminine or masculine. Here are two examples for each version: “Cruda” as a noun: “Esta cruda me hace sentir como si me estuviera muriendo,” meaning, “This hangover makes me feel like I’m dying!” “La cruda peor de mi vida fue despues de mi ultimo cumpleaños,” meaning, “The worst hangover of my life was after my last birthday.” “Crudo” as an adjective: “Estoy completamente crudo,” meaning, “I’m so totally hungover.” “No pude salir de la cama este fin de semana, estaba crudo,” meaning, “I couldn’t get out of bed this weekend, I was hungover.”"
    },
    {
      "title": "Use “crudo” to speak about a raw seafood dish.",
      "content": "Use “crudo” to speak about a raw seafood dish. Perhaps the most popular and universal usage of the word, “raw” in terms of seafood dishes is used by Spanish speakers and non-Spanish speakers alike. Here are some examples so that you can join them: [4] X Research source “I love a scallop crudo as an appetizer, such a delightful kick-off to the meal!” “The crudo bar at this place is really what makes it so special.” “If I see a yellowtail crudo on a menu, I’m ordering it!” “I like my crudo very lightly seasoned, so I can really taste the freshness of the fish.”"
    },
    {
      "title": "Use “crudo” or “cruda” in reference to a rude person.",
      "content": "Use “crudo” or “cruda” in reference to a rude person. On top of using it to describe a man or woman who is rude or uncouth, “crudo” and “cruda” respectively, you can also use this term to describe a harsh, unpleasant, or difficult situation. Here are some examples of how to do it: “Ella es una persona muy fea y cruda,” meaning, “She is a very ugly and crude person.” “Los niños del barrio estaban haciendo chistes crudos,” meaning, “The neighborhood kids were making crude jokes.” “La verdad es cruda, pero necesaria,” meaning, “The truth is harsh, but necessary.” “Su castigo fue demasiado crudo, no se lo merecia,” meaning, “His punishment was too hard, he didn’t deserve it.”"
    },
    {
      "title": "Popular crudo dishes include scallop crudo, tuna crudo, and hamachi crudo.",
      "content": "Popular crudo dishes include scallop crudo, tuna crudo, and hamachi crudo. For a delicious, melt-in-your-mouth bite, all a scallop crudo really requires is the freshest protein, bright lemon, and excellent olive oil. A tuna crudo might consist of sushi-grade slices of the fatty fish, with a citrus caper vinaigrette and herbs. Same for a hamachi crudo, plated on a bed of microgreens for adding color and texture. However, “crudo” does simply mean “raw,” so don’t be afraid to replace seafood with vegetables! Here are some other crudo preparations: [5] X Research source Sea bream crudo White albacore crudo Hamachi crudo Shaved zucchini crudo Carrot crudo Melon and avocado crudo [6] X Research source"
    },
    {
      "title": "Tartare, sashimi, and carpaccio are all raw food dishes.",
      "content": "Tartare, sashimi, and carpaccio are all raw food dishes. A crudo is the Italian variation of a raw food dish, and almost every region of the world has one! From Europe to America to Asia, lots of people eat and enjoy raw food in their diet, ranging from seafood to large land animals, like camel in North Africa and reindeer in Norway. Here are some other classic raw food preparations for the hungry and adventurous eater: [7] X Research source ​​ Sashimi: Sashimi is Japan’s interpretation of crudo, featuring thinly and expertly sliced raw fish, prepared in a simple marinade and sometimes garnished. Tartare: Not limited to seafood, tartare consists of finely minced meat typically prepared with a sauce, a binder, and seasoning. Carpaccio: This raw preparation involves thinly sliced and pounded meat drizzled in an oil or vinaigrette and garnished with herbs or other greens. Ceviche: A Peruvian variation of the crudo, ceviche includes raw marinated seafood typically cut into chunks and then cured, or lightly “cooked”, in citrus juice for an extended period of time to really transform the flavor. Tiradito is similarly prepared to ceviche, except the seafood is cut into slices instead of chunks and only cures for about 20 minutes."
    }
  ]
}