{
  "url": "https://www.wikihow.com/Get-Kingambit",
  "title": "Pokémon Scarlet & Violet: How to Evolve Your Bisharp into Kingambit",
  "steps": [
    {
      "title": "Get a Bisharp.",
      "content": "Get a Bisharp. You cannot catch Kingambit in the wild, so you must first get a Bisharp. There are a couple of ways you can do this: Evolve Pawniard. Pawniard evolves into Bisharp at level 52. You can catch Pawniard in South Province Area Five, East Province Area Three, and North Province Area Two. Catch a Bisharp in the wild. If you want Kingambit, the most efficient method is to catch a specific Bisharp in the wild, as you need the Leader's Crest to evolve it. Bisharps that lead a group of Pawniard will always hold a Leader's Crest. Bisharps can be found in North Province Area Two, specifically the Bamboo Forest. [1] X Research source"
    },
    {
      "title": "Obtain a Leader's Crest from a Bisharp leading a group of Pawniard.",
      "content": "Obtain a Leader's Crest from a Bisharp leading a group of Pawniard. If you see a Bisharp in the wild with a few Pawniard around it, you'll either need to catch that Bisharp and take its Leader's Crest or use the move Thief on it. Thief can be taught to many Pokémon via TM018 (including Bisharp), but Bombirdier learns it at level 7. [2] X Research source If you caught a Bisharp that already holds a Leader's Crest, you can skip this step. If you don't have a Pawniard for your Pokedex, you can easily catch one of the Pawniards surrounding the Bisharp with the Leader's Crest."
    },
    {
      "title": "Give your Bisharp the Leader's Crest.",
      "content": "Give your Bisharp the Leader's Crest. If you caught a Bisharp holding a Leader's Crest and that's the Bisharp you plan to evolve into Kingambit, you can skip this step."
    },
    {
      "title": "Defeat three Bisharps with Leader's Crests while holding the Leader's Crest.",
      "content": "Defeat three Bisharps with Leader's Crests while holding the Leader's Crest. You'll need to defeat three Bisharps that hold Leader's Crests, which are the ones surrounded by a pack of Pawniards. [3] X Research source To make this easier, teach your Bisharp a Fighting-type move. Bisharps are Dark- and Steel-type, and Fighting-type moves are super effective against both types. Bisharp can be taught Low Kick, Low Sweep, Brick Break, and Focus Blast via TM, which are all Fighting-type moves. If you use a Fighting-type move against the other Bisharp, you should be able to knock them out in one hit, as Fighting-type moves do four times the damage to Bisharp. [4] X Research source"
    },
    {
      "title": "Level up your Bisharp once after defeating the three specific Bisharp.",
      "content": "Level up your Bisharp once after defeating the three specific Bisharp. You can either level it up with experience, experience candy, or rare candy. After leveling, Bisharp will evolve into Kingambit."
    }
  ]
}