{
  "url": "https://www.wikihow.com/Format-a-Flash-Drive",
  "title": "2 Simple Ways to Erase and Format a USB Flash Drive",
  "steps": [
    {
      "title": "Connect the USB flash drive to your computer.",
      "content": "Connect the USB flash drive to your computer. Plug the USB into one of your PC's USB ports, which resemble thin, rectangular slots on your computer's housing. [1] X Research source If you have any files stored on your flash drive, transfer the data to a computer. Formatting a flash drive will delete all its contents and give it a new file system."
    },
    {
      "title": "Open the File Explorer",
      "content": "Open the File Explorer and click This PC . You can find this option in the left panel, next to a monitor icon. [2] X Research source On Windows 7, click Computer on the right side of the Start window."
    },
    {
      "title": "Right-click the flash drive's icon.",
      "content": "Right-click the flash drive's icon. It's beneath the \"Devices and drives\" heading in the middle of the page. This will bring up a drop-down menu."
    },
    {
      "title": "Click Format….",
      "content": "Click Format… . This option is near the middle of the drop-down menu. Doing so opens the Format window."
    },
    {
      "title": "Click the \"File System\" box.",
      "content": "Click the \"File System\" box. It's below the \"File System\" heading near the top of the page. A drop-down menu will appear with the following options: NTFS - The default Windows operating system format. If you're using your drive as a secondary Windows drive, you'll need to choose this option. FAT32 - The most widely compatible format. Works with most computers and gaming consoles. exFAT - Similar to FAT32 , but designed for external hard drives (e.g., flash drives) and quicker use. It's a universal format that is most common across Windows, Linux, and Mac."
    },
    {
      "title": "Click a format option.",
      "content": "Click a format option. The option you pick will depend on what you plan on using the drive for. For example, choose FAT32 if you're formatting the flash drive for use with a gaming console , or choose NTFS if you're creating a Windows-only backup drive . If you've formatted your drive before and you're positive that it isn't broken, you can also check the Quick Format box."
    },
    {
      "title": "Click Start, then click OK.",
      "content": "Click Start , then click OK . Windows will begin formatting the flash drive."
    },
    {
      "title": "Click OK when prompted.",
      "content": "Click OK when prompted. Your flash drive has successfully been formatted."
    },
    {
      "title": "Connect the USB flash drive to your computer.",
      "content": "Connect the USB flash drive to your computer. To do so, plug it into one of your Mac's USB ports, which resemble thin, rectangular slots on your computer's housing. Formatting a flash drive will delete all its contents and give it a new file system. Be sure to transfer any files to your computer or a new USB if you want to keep them. Some Macs don't have USB ports, so you'll need to purchase an adapter."
    },
    {
      "title": "Click Go.",
      "content": "Click Go . It's a menu item in the top-left side of the menu bar. If you don't see Go , you can use the Finder , which resembles a blue face in your Mac's dock."
    },
    {
      "title": "Click Utilities.",
      "content": "Click Utilities . This option is in the Go drop-down menu."
    },
    {
      "title": "Double-click Disk Utility.",
      "content": "Double-click Disk Utility . You'll likely find this option in the middle of the Utilities page. [3] X Research source"
    },
    {
      "title": "Click your flash drive's name.",
      "content": "Click your flash drive's name. It's on the far-left side of the Disk Utility window."
    },
    {
      "title": "Click the Erase tab.",
      "content": "Click the Erase tab. This option is at the top of the Disk Utility window. [4] X Research source"
    },
    {
      "title": "Click the \"Format\" box.",
      "content": "Click the \"Format\" box. It's in the middle of the page. This will bring up a drop-down menu with the following options: Mac OS Extended (Journaled) Mac OS Extended (Journaled, Encrypted) Mac OS Extended (Case-sensitive, Journaled) Mac OS Extended (Case-sensitive, Journaled, Encrypted) MS-DOS (FAT) ExFAT"
    },
    {
      "title": "Click a format option.",
      "content": "Click a format option. You'll generally use one of the Mac OS options for a Mac-only flash drive (e.g., a backup drive), though you'd choose MS-DOS (FAT) or ExFat for greater compatibility. [5] X Research source"
    },
    {
      "title": "Click Erase, then click Erase again when prompted.",
      "content": "Click Erase , then click Erase again when prompted. This will begin the formatting process. Once the formatting is complete, you'll see an icon for your flash drive appear on your Mac's desktop. [6] X Research source"
    }
  ]
}