{
  "url": "https://www.wikihow.com/Draw-Footprints",
  "title": "How to Draw Footprints",
  "steps": [
    {
      "title": "Draw a circle for the end of the foot.",
      "content": "Draw a circle for the end of the foot."
    },
    {
      "title": "Draw a diagonal rectangle on top of it.",
      "content": "Draw a diagonal rectangle on top of it."
    },
    {
      "title": "Add an oval to the left side of the rectangle.",
      "content": "Add an oval to the left side of the rectangle."
    },
    {
      "title": "Draw 5 small circles above the oval for the toes.",
      "content": "Draw 5 small circles above the oval for the toes."
    },
    {
      "title": "Ink in the drawing, erase the sketch.",
      "content": "Ink in the drawing, erase the sketch."
    },
    {
      "title": "Color the drawing the way you want it and you are done!",
      "content": "Color the drawing the way you want it and you are done!"
    },
    {
      "title": "Draw the first footprint using two ovals.",
      "content": "Draw the first footprint using two ovals. They should be spaced slightly apart, but not so far as to suggest that they come from different feet. Follow the images on the right for guidance."
    },
    {
      "title": "Connect the sides of the ovals with curves.",
      "content": "Connect the sides of the ovals with curves. These will form the body of the foot. Add five ovals at the end of each oval for the toes."
    },
    {
      "title": "Repeat the process.",
      "content": "Repeat the process. Remember, though: this time the footprint has to look like it is reflected on a mirror."
    },
    {
      "title": "Draw a few more to make the drawing look more realistic.",
      "content": "Draw a few more to make the drawing look more realistic. Simply continue to repeat the steps you've already done, and hopefully your footprints will improve."
    },
    {
      "title": "Color in your footprints.",
      "content": "Color in your footprints. Use blue or purple to make it look like someone stepped on ink by accident, or color the background like sand and have the footprints in shadow to give the impression of a beach scene."
    }
  ]
}