{
  "url": "https://www.wikihow.com/Get-Rid-of-Stretch-Marks-on-Your-Back",
  "title": "How to Get Rid of Stretch Marks on Your Back",
  "steps": [
    {
      "title": "Use a heavy moisturizer.",
      "content": "Use a heavy moisturizer. Rich moisturizing creams are generally favored as a home treatment for stretch marks. [2] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 Have a trusted friend or spouse help you apply the moisturizer on your back, focusing on the area with stretch marks. If you cannot get someone to help, you can purchase a long-handed lotion brush from most drug stores or home goods stores. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source While there is little scientific data backing the efficacy of moisturizing creams, many people with stretch marks report fading after a few weeks to a few months. Those with stretch marks report particularly beneficial results from thick moisturizing lotions such as body butters with ingredients such as collagen, shea butter, or cocoa butter. Moisturizers are claimed to be more effective when the stretch marks are new, and still a bright red or purple color."
    },
    {
      "title": "Use a tretinoin treatment.",
      "content": "Use a tretinoin treatment. Tretinoin is commonly used to treat stretch marks and scars such as those caused by acne. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Generally, a topical tretinoin cream will be prescribed by a doctor. Schedule an appointment with your doctor and let them know that you are interested in trying a tretinoin treatment. Tretinoin is not recommended for those who are pregnant or breastfeeding. [5] X Research source Tretinoin is generally applied as a topical cream, and can be applied on the back using hands or a lotion brush. Lower dosage retinoid creams can be purchased over the counter at most pharmacies and markets. Their diluted formulas may compromise their efficacy, though."
    },
    {
      "title": "Give them time to fade.",
      "content": "Give them time to fade. One of the most effective home treatments for stretch marks is simply allowing them to fade. Help your stretch marks by making sure you put sunscreen on them whenever they may be exposed to sunlight, and just allow them time. [6] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source Some stretch marks may never disappear completely, but over the course of a few months to a few years, they can drastically decrease in visibility."
    },
    {
      "title": "Look at laser therapy.",
      "content": "Look at laser therapy. Laser therapies can sometimes be performed by your general practitioner, but are often undertaken by a cosmetic surgery specialist or a dermatologist. Several types of laser therapies exist to help reduce the appearance of stretch marks. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Pulse dye laser treatment is a nearly painless treatment that is best used in the early stages of a stretch mark while it is still a bright red or purple. Fractional laser therapy is used on stretch marks that have faded or gone white. It is often more painful, as it causes controlled, intentional small injuries to the skin. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Laser therapy is generally not covered by insurance, and typically needs more than one session for effective treatment. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Book a microdermabrasion treatment.",
      "content": "Book a microdermabrasion treatment. Scientific studies have reported some amounts of success using microdermabrasion as a treatment for stretchmarks. You may be able to book a microdermabrasion treatment at a local spa, but for areas as large as the back it may be better to contact a dermatologist. [10] X Research source Do not expect changes from a single microdermabrasion treatment. Those who report success with the treatment seek it at least once a week over the course of several weeks or months."
    },
    {
      "title": "Visit a homeopath.",
      "content": "Visit a homeopath. Alternative medicine has had limited quantifiable success in helping to treat stretch marks. Visit a homeopath to speak with them about creating natural or home remedies that may help treat your stretch marks. If you are pregnant or breastfeeding, it is recommended that you speak with your doctor before using any alternative treatments."
    },
    {
      "title": "Control rapid change in body size.",
      "content": "Control rapid change in body size. Stretch marks on areas like the back are especially common among individuals who gain mass in either the form of fat or muscle. If you are looking to intentionally add size, try to do so in a controlled fashion over the course of many months rather than packing it all on as quickly as possible. [11] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 If you are specifically looking to build muscle, it may help to work with a trainer who can help you pace out your muscle growth."
    },
    {
      "title": "Keep skin hydrated.",
      "content": "Keep skin hydrated. Using a lotion or skin oil regularly helps keep it hydrated and encourage new tissue growth. While new tissue can’t prevent stretch marks, it may help reduce the time it takes them to fade, which in turn may help you feel more comfortable with their appearance. [12] X Research source Apply a moisturizing lotion every morning and again right before bed using a lotion brush to reach all the areas of your back."
    },
    {
      "title": "Maintain a healthy lifestyle.",
      "content": "Maintain a healthy lifestyle. A balanced diet and regular exercise can help control rapid change in body size and provide your body with the nutrients it needs to encourage healthy skin growth. Try to eat a diet rich in protein and healthy fats, and with limited amounts of carbohydrates, saturated fats, and transfats. [13] X Research source Moderate exercise for thirty to fifty minutes four to five times a week is also encouraged to help maintain a healthy body and prevent stretch marks on the back."
    }
  ]
}