{
  "url": "https://www.wikihow.com/Get-Epona-in-Ocarina-of-Time",
  "title": "How to Unlock & Get Epona in Ocarina of Time",
  "steps": [
    {
      "title": "Find Lon Lon Ranch.",
      "content": "Find Lon Lon Ranch. After you have met Zelda at the palace and are escorted out by Impa, you're standing right in front of the drawbridge. Instead of heading over immediately to Death Mountain like Impa tells you, look straight ahead of where you are standing. There should be what looks like a group of houses on top of a hill. This is Lon Lon Ranch."
    },
    {
      "title": "Enter Lon Lon Ranch.",
      "content": "Enter Lon Lon Ranch. This is where Talon (the man you woke up at the palace to access the path) and his daughter live. Run straight in between the two buildings when you first enter and you will find yourself in a place that looks like a ranch, with a sort of circular racetrack."
    },
    {
      "title": "Learn \"Epona's Song.",
      "content": "Learn \"Epona's Song. \" Enter the pen where the horses are running around and you will see a small girl standing in the middle, singing. Talk to her. She will thank you for waking up her father, and go on about the song she is singing. Take out your ocarina and learn “Epona’s Song.”"
    },
    {
      "title": "Leave Lon Lon Ranch and go to Death Valley.",
      "content": "Leave Lon Lon Ranch and go to Death Valley. Play out the next two dungeons as planned. After the dungeons are complete, go to the Temple of Time to become grown up."
    },
    {
      "title": "Go back to Lon Lon Ranch after you have grown up.",
      "content": "Go back to Lon Lon Ranch after you have grown up. You will see that it is no longer the happy wonderful place it was when you were a kid. Now the farm has been taken over by Ingo, who has pledged allegiance to Ganondorf. You’ll see that the ranch is now used for a horse riding game. Pay Ingo the money to get in, and choose any horse and ride around. You cannot do this on the first go, so don’t try. After the time runs out, he will kick you out."
    },
    {
      "title": "Pay to get in again, pull out your ocarina, and play Epona’s song.",
      "content": "Pay to get in again, pull out your ocarina, and play Epona’s song. Epona will run over to you. Get on her and ride over to the entrance where Ingo is standing. While on the horse ‘Z’ target him and press the ‘A’ button to talk. He will challenge you to a race, betting you 50 rupees. Accept the terms of the wager. Practice riding Epona first. Move the joystick in the direction that you want to go; riding her is really as simple as that. Press the ‘A’ button to feed Epona a carrot for a burst of speed. Epona will go faster, but you'll lose a carrot. Only use these from time to time."
    },
    {
      "title": "Steer Epona onto the inside track of the loop.",
      "content": "Steer Epona onto the inside track of the loop. Ingo will try to keep you from getting inside position, but he won't be completely successful at it. When he gives up inside position, press 'A' for a burst of speed and speed past him on the inside track."
    },
    {
      "title": "After winning the race, know that Ingo will freak out and challenge you once again.",
      "content": "After winning the race, know that Ingo will freak out and challenge you once again. He’ll turn red and scream about Ganondorf. Then, rather unfairly, he'll challenge you to a second race. If you win, you will get Epona."
    },
    {
      "title": "Using the same tips as before, race him again.",
      "content": "Using the same tips as before, race him again. Ingo’s going to end up being a lot faster than last time, but there isn’t much you can do about it. Just give it your best and keep trying. Once you get inside position, don't give it up. It'll take Ingo a lot of effort to pass you on the outside, so just remember to hold position and you should be fine. Don't over-feed Epona with carrots right away. Although some people can beat Ingo without using very many carrots at all, it's best to use just a few. Don't use too many in the beginning or you won't have any left when you really need them — at the end of the race."
    },
    {
      "title": "Once you finally do end up beating Ingo, know that he will be insanely angry.",
      "content": "Once you finally do end up beating Ingo, know that he will be insanely angry. He says that you can keep the horse, but you can’t leave the ranch. He shuts the gate and laughs like an idiot. Seems like all is lost, right? Wrong!"
    },
    {
      "title": "Find a way to jump out of the fence.",
      "content": "Find a way to jump out of the fence. Know that Ingo's locked the gate to the inside of the Lon Lon corral, you have two choices. The hard way: Run straight at Ingo and jump the gate. It will have to be perfect though or else all you will end up doing is running into him. The easy way: On the left side of the ranch there is a wall. Heading from the entrance towards the wall, run at an angle. It doesn’t have to be perfect, Epona can jump over it either way."
    },
    {
      "title": "Land on the other side of the wall and enjoy the freedom and speed of Epona.",
      "content": "Land on the other side of the wall and enjoy the freedom and speed of Epona. Now you can enjoy all of the benefits that comes with having a horse. Mostly that includes being able to cross the world in about thirty seconds, rather than the three minutes it would take without her. Epona isn’t an essential part of the game. You really don’t “need” her for anything, but she is really a big help, so try to get her if you can."
    }
  ]
}