{
  "url": "https://www.wikihow.com/Get-Over-Someone-You-Have-to-See-Every-Day",
  "title": "How to Get Over Someone You Have to See Every Day",
  "steps": [
    {
      "title": "Acknowledge the loss.",
      "content": "Acknowledge the loss. Relationships are important and allow us to experience emotional highs and the lows, learn about ourselves, and learn how to love and be loved. [1] X Research source These are crucial elements for living a fulfilling life. Whether you initiated the break-up or not, there is a grieving process that occurs. Tell the person, “I just want to acknowledge that ending this relationship didn't feel good. I know it's going to be hard and awkward to see each other for a while. I will do my best to respect your boundaries and I would appreciate you doing the same.” This may lead to further discussion at which time you can reinforce your expectations. It is important to acknowledge the relationship was important to your personal development, regardless of how short or involved it was. If you deny the feelings associated with the break-up and pretend that it wasn't important, you won't learn from the experience."
    },
    {
      "title": "Grieve the loss.",
      "content": "Grieve the loss. Most people are taught how to acquire things, but very few people are taught how to lose something. Whether the loss is a relationship, a loved one, a job, a physical ability, or trust in someone, the damage created must be understood and managed. Grief is a complex emotion that manifests in different ways. There are stages to the grieving process that can be used as a guide to understanding your own unique experience with grief: denial, numbness and shock; bargaining; depression; anger; acceptance. [2] X Research source Start a grief journal and write about the feelings you are having in each stage. Grief is an individual journey. Everyone experiences it differently. You may spend more time in one stage versus another. Don't rush yourself and don't allow others to rush you through your grief. There is a time to grieve and it is essential to the healing process."
    },
    {
      "title": "Pull yourself together.",
      "content": "Pull yourself together. Breaking up feels like an emotional setback. It's going to take your full attention and effort to carry you through the journey. Find a way to give yourself a running start at the challenges ahead. It is a normal response to fall apart to a certain degree, and each time you pull yourself together you build self-confidence. Tell yourself, “I can do this. I can work around this guy because I'm strong and I'm going to be okay.”"
    },
    {
      "title": "Anticipate possible scenarios.",
      "content": "Anticipate possible scenarios. Run through as many potential social interactions in your own mind or in discussion with a trusted friend. Choose someone you trust who will not gossip to others. You don't want to add fuel to the fire. Practicing your verbal and physical responses ahead of time will lessen your anxiety and allow you to access those rehearsed skills when you need them. Be friendly if you see the person. Try saying something like “Hi! How are you?\" because the friendliness will keep your interactions smooth. You can try to avoid the person if there is a way, though."
    },
    {
      "title": "Don't rush the process.",
      "content": "Don't rush the process. Emotions don't respond well to being hurried or brushed aside. Healing from the loss of a relationship takes time, and you might get tired or impatient. Redirect your energies toward an activity that helps you escape your thoughts. Participating in an activity that you enjoy will help you pass the time and will help balance the intense emotions you might be feeling. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Take a break from your worries by watching movies or binge-watch TV shows. Stay away from romantic comedies and love stories that might add to your struggle. Play board games or join a book club to redirect your time and attention."
    },
    {
      "title": "Create movement by taking action.",
      "content": "Create movement by taking action. The most obvious and straightforward response to dealing with this issue is to change jobs, apartments, or class schedules. It might be the most practical thing to do. However, there are some people who must keep their jobs, stay in the living arrangement, or the class. Create an artificial “moving away” experience to distance yourself. Take a different route when you come into the work environment. Work around a person's daily routine so you don't cross paths. Sit across the room or out of sight in class. Do what you have to in order to create space between you and the person. This will give you a sense progress toward adjusting to the situation. Don't wait for him to move away from you. You need to distance yourself from him, so do it as soon as possible."
    },
    {
      "title": "Make the most of the situation.",
      "content": "Make the most of the situation. Change can be good. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Perhaps the relationship was emotionally taxing and causing you more stress than reward. Recognize the freedom you now have, which brings about new opportunities. Feel the relief of not having to worry about the other person or be concerned with the drama they brought into your life. Spend time outside of work developing healthy relationships with friends, and others who could become romantic interests."
    },
    {
      "title": "Stay positive if you come in contact.",
      "content": "Stay positive if you come in contact. Keep things “light and airy”, which means: stay away from deep thoughts, discussions, troubles or complaints. Portray a sense of calm and optimism that can't be pulled down by the negativity or awkwardness of the situation. Focusing on the positive will guard against being pulled into negative discussions. [5] X Research source No one can take your power away from you if you remain positive. Reacting to an agitating remark will give your power to the other person. You are in control and responsible for your feelings. It is an important job."
    },
    {
      "title": "Avoid being judgemental.",
      "content": "Avoid being judgemental. [6] X Research source Be accepting of yourself. If you are feeling guilty or remorseful about having a relationship with someone in the work place, at school or with your roommate, you will need to forgive yourself. It doesn't mean that you forgive and “forget” what you did, and then do it again. Forgive with the intent of learning from your mistakes and stopping any attempts to self-sabotage yourself in the future."
    },
    {
      "title": "Fake it 'til you make it.",
      "content": "Fake it 'til you make it. [7] X Research source Actors get paid to pretend. You may not be an actor, but there might be a time when you need to pretend that you are doing fine when you really aren't. It is a way of protecting yourself from further hurt. Get yourself through an awkward interaction in any way that you can. Discuss it later with a trusted friend or family member, which will allow you to process the feelings that were stirred up. Venting your feelings is a legitimate way of processing feelings and will probably make you feel better."
    },
    {
      "title": "Use silence to your benefit.",
      "content": "Use silence to your benefit. Many people are not comfortable with silence. [8] X Research source They feel compelled to put words into the air as if they will ease the tension in the situation. Develop a level of comfort with silence. When you don't know what to say in a situation, say nothing. Choose to be comfortable with silence, and you won't feel as awkward in situations that come up. Silence isn't being rude. Remember, a lot of people are uncomfortable with silence so they may say things or ask you things. Answer them in a manner that you see fit."
    },
    {
      "title": "Learn from your mistakes.",
      "content": "Learn from your mistakes. If you feel you made a painful mistake by having the relationship, allow the pain to stop you from making the same mistake in the future. There are reasons for certain rules in life. Following them will steer you toward pleasure and away from pain. [9] X Research source Follow this simple yet profound principle to ensure a bright future."
    },
    {
      "title": "Be self-reliant in your coping strategies.",
      "content": "Be self-reliant in your coping strategies. Relying on yourself will help you cope with the dissolution of a relationship. [10] X Research source You know what makes you happy, so participate in activities that increase positive feelings."
    },
    {
      "title": "Seek professional help to identify the behaviors you would like to change if you are struggling with doing it yourself.",
      "content": "Seek professional help to identify the behaviors you would like to change if you are struggling with doing it yourself. Psychologists and Psychiatrists are available in your local area and can be located through the American Psychological Association [11] X Research source and the American Psychiatric Association."
    },
    {
      "title": "Stand up for yourself and the life you want.",
      "content": "Stand up for yourself and the life you want. You are here to live life and enjoy it. Standing up for yourself will remind you that you deserve to be happy, and the world will notice. When you reach a level of healing after a bad experience, other people perceive a positive change. You sent up a flare to signal that you are ready for good things to happen. People might say things like, “Did you do something different? You look great.” Your response can be, “Thank you. Yes, I decided to be happy and it is working for me.”"
    }
  ]
}