{
  "url": "https://www.wikihow.com/Create-a-Filter-in-Yahoo!-Mail",
  "title": "How to Create a Filter in Yahoo! Mail",
  "steps": [
    {
      "title": "Log into your Yahoo!",
      "content": "Log into your Yahoo! Mail account."
    },
    {
      "title": "Create a new folder.",
      "content": "Create a new folder. On the left panel, you can find a \"Folders\" menu; click on it to show all your current folders. Click on the icon beside it to create a new folder."
    },
    {
      "title": "Name the new folder.",
      "content": "Name the new folder. Make it short but descriptive. You would want to know what’s inside the folder just by looking at its name."
    },
    {
      "title": "Create more folders.",
      "content": "Create more folders. Repeat steps 2 and 3 as needed."
    },
    {
      "title": "Go to \"Settings.",
      "content": "Go to \"Settings. \" There’s a bolt icon beside your name on the upper right-hand side of the screen. Click on it, and then choose \"Settings.\""
    },
    {
      "title": "Go to \"Filters.",
      "content": "Go to \"Filters. \" In the \"Settings\" menu, click on \"Filters\" from the left panel."
    },
    {
      "title": "View existing filters.",
      "content": "View existing filters. The Filters screen will display all your current filters. Click on one to see what rules are built inside a filter."
    },
    {
      "title": "Add a filter.",
      "content": "Add a filter. Click on the \"Add\" button found on top."
    },
    {
      "title": "Name the filter.",
      "content": "Name the filter. Set a unique filter name. Make it short but descriptive."
    },
    {
      "title": "Set the filter’s rules.",
      "content": "Set the filter’s rules. Define what the filter will look for. Parameters that can be set include the following: Sender Recipient Subject E-mail Body"
    },
    {
      "title": "Identify the destination folder.",
      "content": "Identify the destination folder. This is the folder where e-mails that pass the filter’s rules will go. Select the appropriate folder from the drop-down list."
    },
    {
      "title": "Save your changes.",
      "content": "Save your changes. Click on the \"Save\" button once you’re done."
    },
    {
      "title": "Create more filters.",
      "content": "Create more filters. Repeat steps 3 to 8 to create additional filters. Just make sure these filters complement, not contradict, one another."
    },
    {
      "title": "Sort all filters.",
      "content": "Sort all filters. Use the up and down arrow icons to sort your filters. The one on top will take priority before the one under it, and so on and so forth, until it reaches the last filter."
    },
    {
      "title": "Exit.",
      "content": "Exit. Click on the \"Save\" button to exit the \"Settings\" menu and return to your inbox."
    }
  ]
}