{
  "url": "https://www.wikihow.com/Everybody-Dies-in-Their-Nightmares-Lyrics-Meaning",
  "title": "What Does “Everybody Dies in Their Nightmares” Mean? A Lyrical Deep Dive",
  "steps": [
    {
      "title": "The speaker is struggling to stay alive.",
      "content": "The speaker is struggling to stay alive. In the song’s intro, XXXTentacion samples Shiloh Dynasty’s “Don’t Go to Sleep,” using the lyrics “Ooh, ahh, ahh, ahh / Don’t go, don’t go to sleep / Don’t go, stay up and / Don’t.” These lines may be from the perspective of a loved one or X’s own inner voice, encouraging him to keep living, with sleep being a metaphor for death. The lines could also show that sleep is no longer an escape for X and that he wants someone to stay awake with him to reassure him."
    },
    {
      "title": "The speaker feels trapped and depressed.",
      "content": "The speaker feels trapped and depressed. In the chorus, XXXTentacion repeats, “Tired of feeling like I’m trapped in my damn mind / Tired of feeling like I’m wrapped in a damn lie / Tired of feeling like my life is a damn game / N**** really wanna die in the nighttime.” These lyrics are straightforward, expressing how X is trapped in a constant negative thought process. The chorus loops repeatedly, reflecting this cycle. [1] X Research source"
    },
    {
      "title": "X believes being vulnerable will only lead to pain.",
      "content": "X believes being vulnerable will only lead to pain. In the verse, X says, “Only time I feel pain, when I’m feeling love / That’s why it’s tatted on my face that I’m damn numb.” Here, he acknowledges the paradox of human emotions, that being in love and being open can cause you to get hurt. When he doesn’t feel that pain, however, he only feels numb. [2] X Research source These lines likely reference X’s real experiences, as he once went to jail for allegedly assaulting his girlfriend Geneva. X also experienced emotional pain after his friend, Jocelyn, took her own life. X had the word “Numb” tattooed under his right eye in red ink."
    },
    {
      "title": "The speaker surrounds himself with people to distract himself.",
      "content": "The speaker surrounds himself with people to distract himself. XXXTentacion raps, “Only tell you ‘bout my mind when I’m all alone / That’s why I’m never really alone in the nighttime.” This suggests that X feels his most vulnerable and depressed when he is by himself. He surrounds himself with people to try to suppress his suicidal thoughts. [3] X Research source"
    },
    {
      "title": "X doesn’t want to get attached to a woman.",
      "content": "X doesn’t want to get attached to a woman. He says, “Change hoes like clothes, I can’t get attached / ‘Cause those hoes fire starters like lit matches / I’ve been feeling really lost, duckin’ all attachments.” Because XXXTentacion had a bad relationship with his ex-girlfriend, he doesn’t want to get attached and have his heart broken again. Instead, the lyrics suggest he prefers hookups or short-term relationships with no commitment. [4] X Research source These lyrics again allude to his relationship with Geneva, who was the “fire starter” because she accused him of assault. X was often spotted with multiple women after that relationship."
    },
    {
      "title": "X wants to escape life’s chaos.",
      "content": "X wants to escape life’s chaos. In the final lines of the verse, X says, “I don’t really go outside ‘cause I hate traffic / I don’t wanna go outside, get caught in traffic, traffic.” This could be a metaphor for several things. X wants to avoid life’s chaos and meaningless interactions with other people. Traffic could also represent reality, and X prefers to stay in his own mind rather than face the truth. [5] X Research source The second line could also mean that X doesn’t want to get “caught” or confronted by an opposition, like another rapper."
    },
    {
      "title": "Mental anguish",
      "content": "Mental anguish The most prominent theme in “Everybody Dies in Their Nightmares” is mental anguish, as XXXTentacion struggles with depression and suicidal thoughts. He feels trapped and alone, and he struggles to come to terms with these feelings, preferring to avoid them by surrounding himself with people and staying busy. [6] X Research source"
    },
    {
      "title": "Escapism",
      "content": "Escapism Throughout the song, X repeats that he’s tired of feeling trapped, hurt, and numb. He longs to escape these feelings, even if he thinks the only way of escaping is through death. In the song, sleeping is both a way of escaping your problems and a metaphor for death. [7] X Research source"
    },
    {
      "title": "Existentialism",
      "content": "Existentialism In “Everybody Dies in Their Nightmares,” XXXTentacion faces his repetitive thoughts of death. Though it isn’t directly stated in the lyrics, X could be dealing with an existential crisis, as he questions his existence and identity."
    },
    {
      "title": "Vulnerability",
      "content": "Vulnerability Throughout the song, XXXTentacion talks about how being in love and forming attachments only leads to pain and that he prefers to avoid vulnerability. However, by telling us how he feels, he is actually being vulnerable with listeners. This allows him to connect with fans on a deeper level, as some may relate to what he’s going through."
    },
    {
      "title": "Repetition",
      "content": "Repetition In “Everybody Dies in Their Nightmares,” XXXTentacion successfully uses repetition to get his point across. He rapidly repeats the chorus, “Tired of feeling like I’m trapped in my damn mind / Tired of feeling like I’m wrapped in a damn lie / Tired of feeling like my life is a damn game / N**** really wanna die in the nighttime,” showing that his suicidal thoughts are a dangerous cycle he cannot escape."
    },
    {
      "title": "Metaphor",
      "content": "Metaphor While most of the song’s lyrics are direct and to the point, XXXTentacion also uses metaphors to explore his feelings. In the intro, sleep is used as a metaphor for death. At the end of the verse, he says, “I don’t really go outside ‘cause I hate traffic / I don’t wanna go outside, get caught in traffic, traffic.” Here, he doesn’t mean literal traffic, but is instead using it as a metaphor to describe his feelings toward the chaos of life. [8] X Research source"
    },
    {
      "title": "Fans say the song has helped them with their own depression.",
      "content": "Fans say the song has helped them with their own depression. While not all XXXTentacion fans relate to “Everybody Dies in Their Nightmares,” several fans have publicly stated that listening to the song has helped them feel better during their struggles with depression. Fans also appreciate the song’s composition and sound."
    },
    {
      "title": "Hope",
      "content": "Hope Released as a part of XXXTentacion’s second album, ? , “Hope” is dedicated to the victims of the Parkland high school shooting. The song speaks about the subject of survivor’s guilt that those who survived the shooting may have experienced. The song’s cover features a message from X that reads, “I could never say I understand how you all are feeling, nor can I find the right words to say to you, but I do want you all to know, you are not alone. The words at the end of this song are dedicated to you, Douglas High. Sincerely, XXX.” [9] X Research source"
    },
    {
      "title": "Look at Me!",
      "content": "Look at Me! “Look at Me!” is X’s debut commercial single, released on SoundCloud on December 30, 2015, before becoming available for digital download as a single on January 29, 2016. The song became a sleeper hit in January 2017 and later served as the lead single from X’s commercial mixtape Revenge . It peaked at No. 34 on the US Billboard Hot 100 and went certified platinum on August 14, 2017. [10] X Research source"
    },
    {
      "title": "SAD!",
      "content": "SAD! “SAD!” is the lead single from XXXTentacion’s second album, ?, released on March 2, 2018. The song is one of X’s biggest hits to date and discusses his experiences with depression, thoughts of suicide, and regrets about the past. Following his death on June 18, 2018, the song peaked at No. 1 on the Billboard Hot 100. On August 13, 2021, the single was certified diamond in the US. [11] X Research source"
    },
    {
      "title": "Revenge",
      "content": "Revenge Originally titled “Garette’s Revenge,” this song was released on May 18, 2017, as a part of XXXTentacion’s debut album, 17 . The song was first previewed on Twitter on May 9 of that year and was later dedicated to X’s friend Jocelyn Flores, after she committed suicide on May 14. The song’s SoundCloud description reads, “I love you Garette, rest in peace Jocelyn, I will have my revenge upon the world.” [12] X Research source"
    }
  ]
}