{
  "url": "https://www.wikihow.com/Etch-Wood",
  "title": "How to Etch Wood",
  "steps": [
    {
      "title": "Find an object to etch.",
      "content": "Find an object to etch. You can etch just about anything, from coat racks to hammer handles, plaques to signs. If you are just starting out, a simple plaque or sign would be the easiest. [1] X Research source"
    },
    {
      "title": "Consider the type of wood you'd like to work with.",
      "content": "Consider the type of wood you'd like to work with. There are different types of wood: softwood and hardwood. Softwood, such as fir and white pine, is cheaper and easier to work with, but it comes in only a few choices. Hardwood comes in a greater variety, but it is more expensive and harder to work with. The easiest types of hardwood to engrave include: alder, basswood, cherry, Philippine Mahogany, and walnut. [2] X Research source"
    },
    {
      "title": "Remove previous varnish if desired.",
      "content": "Remove previous varnish if desired. You can do this with sandpaper or a solvent. [3] X Research source If your piece has wood stain on it, consider leaving the stain on. The carving will remove the dark color and reveal the light color underneath. Solvents are also called \"liquid sandpaper.\" Each brand will be a little different, so read the directions on the label carefully."
    },
    {
      "title": "Sand the surface smooth, if needed.",
      "content": "Sand the surface smooth, if needed. This will help even out the wood grain and make it easier for the tools to glide across it. Use medium-grit sandpaper for this and go with the grain. [4] X Research source If you bought your piece from a craft store, it may already be sanded smooth for you. It would still be a good idea to inspect the piece, and smooth out any rough patches."
    },
    {
      "title": "Wipe away the sawdust with a tack cloth.",
      "content": "Wipe away the sawdust with a tack cloth. If you do not have a tack cloth, you can use a soft, damp cloth instead. You should do this even if you will be carving into the wood."
    },
    {
      "title": "Choose your design.",
      "content": "Choose your design. You can etch just about anything onto wood, from pictures to symbols to words and phrases. Create your design on a sheet of paper or print it off of the computer. If you are just starting out, a simple design with lots of straight lines will be the easiest to engrave. [5] X Research source Transfer the design to your project using one of the methods listed below."
    },
    {
      "title": "Trace designs using stencils if you want something easy.",
      "content": "Trace designs using stencils if you want something easy. You can design and cut your own stencil , or you can buy one from the store. Place the stencil over the wood where you want the design to go. Secure it with painter's tape, then trace the designs with a pencil. Put the stencil away when you are done. You can cut stencils out of blank stencil plastic, quilter's template plastic, contact paper, cardstock, or even freezer paper."
    },
    {
      "title": "Use graphite paper if you want to transfer a custom design.",
      "content": "Use graphite paper if you want to transfer a custom design. Place the graphite paper onto the wood, graphite-side-down. Secure it with painter's tape, then sketch out your design on top of the paper. Remove the graphite paper hen you are done; your design should be imprinted on top of the wood. [6] X Research source If you printed your design from the computer, coat the back of the paper with graphite, then use it as directed above."
    },
    {
      "title": "Draw your design directly onto the wood with pencil if you are a good artist.",
      "content": "Draw your design directly onto the wood with pencil if you are a good artist. This is the quickest and easiest way to transfer your design onto the wood . It requires a precise and steady hand, however. While it is possible to erase mistakes from wood, the less erasing you have to do, the better. [7] X Research source"
    },
    {
      "title": "Use a wood chisel if you want to carve straight lines.",
      "content": "Use a wood chisel if you want to carve straight lines. You will need to cut each line twice to create a V-shaped groove. Hold the tool at a 20 to 30-degree angle to your pencil mark. Rock the tool back and forth to make a 1/16 to 1/8 inch (1.6 to 3.2 millimeters) deep cut. Brush away the wood slither, then make the next cut to complete the V-shape. [8] X Research source Do all of the lines that run perpendicular to the wood grain first, then do the lines that run parallel to the grain. This reduces chipping."
    },
    {
      "title": "Use a wood gouge if you want to carve straight or curved lines.",
      "content": "Use a wood gouge if you want to carve straight or curved lines. Hold the gouge at a 20 to 30-degree angle to the pencil mark. Gently tap it from behind as you push the tip into the wood. Make each cut 1/16 to 1/8 inch (1.6 to 3.2 millimeters) deep. Brush away the slithers as you work. [9] X Research source You can use this in combination with wood chisels. Wood gouges are also called \"wood carving tools.\" Wood gouges have all sort of tips, including: chisel, curved, or V-shaped."
    },
    {
      "title": "Use dremels",
      "content": "Use dremels if you want to lightly etch a design onto the surface. Choose a dremel tip that suits your design; a sanding or engraving tip would work well. Hold the dremel like a pencil and over thin lines. If you have thick designs (like block letters), outline the design with a fine tip first, then fill it in with a larger one. This method works well on surfaces coated with wood stain. You can also use smaller engraving tools in a similar way."
    },
    {
      "title": "Use wood burning",
      "content": "Use wood burning tools to create dark lines. Most wood burning tools come with a chisel-like tip. You use the thin edge to make thin lines and the wide edge to make thick lines—like a calligraphy pen. [10] X Research source Some wood burning tools also come with shaped tips, such as letters, that you can use to stamp or brand designs onto the wood instead. [11] X Research source"
    },
    {
      "title": "Lightly sand any carved surfaces.",
      "content": "Lightly sand any carved surfaces. Fold a piece of 120-grit sandpaper into a thin strip. Wrap it around your finger, then lightly sand the inside edges of the carved line. This removes any chips or splinters. [12] X Research source Skip this step if you etched the surface with a wood burning tool or a dremel."
    },
    {
      "title": "Wipe the sanding dust away with a tack cloth.",
      "content": "Wipe the sanding dust away with a tack cloth. You should do this if you etched the wood using a chisel, gouge, or dremel. Any dust left on the wood may get trapped in the topcoat during the next step. If you don't have a tack cloth, use a soft, damp cloth instead. Skip this step if you etched the surface with a wood burning tool."
    },
    {
      "title": "Apply a top coat, if desired.",
      "content": "Apply a top coat, if desired. You can leave your etched wood as-is, or you can give it a finished look with topcoat. Choose a topcoat in a finish that appeals to you (matte, satin, or glossy), then apply a thin coat. Use lacquer for pieces that will be kept inside, and weather-resistant polyurethane for pieces that will be kept outside. [13] X Research source Apply spray-on topcoats using a sweeping motion, overlapping each stroke. Apply brush-on topcoats with a flat, wide paintbrush. Go with the grain and overlap each stroke."
    },
    {
      "title": "Allow the top coat to dry before applying another coat.",
      "content": "Allow the top coat to dry before applying another coat. For indoor or decorative pieces, you could get away with just one coat. If the piece will be kept outside or used often, you might want to apply one or two more light coats. Allow each coat to dry before adding the next one. Don't apply the coats too quickly or too soon, otherwise they may turn out tacky."
    },
    {
      "title": "Let the top coat dry and cure completely before using the piece.",
      "content": "Let the top coat dry and cure completely before using the piece. How long this takes depends on the type of topcoat you are using. Some are completely dry and ready to use in several hours. Others, especially outdoor types, often require several days in which to cure. Read the label on your can or bottle of topcoat. Keep in mind that things like humidity, weather, and temperature may also affect drying and curing times."
    }
  ]
}