{
  "url": "https://www.wikihow.com/Drain-Ground-Beef",
  "title": "How to Drain Ground Beef: The Best Cooking Tips",
  "steps": [
    {
      "title": "Cook the ground beef on medium-low for 10 minutes.",
      "content": "Cook the ground beef on medium-low for 10 minutes. Break up the ground beef in a large nonstick pan and place it on your stovetop. Turn the heat to medium-low and cook the meat for around 10 minutes, stirring it occasionally. [1] X Research source The meat should brown as you cook it. Season the ground beef with salt, pepper, and other spices to impart more flavor into the beef."
    },
    {
      "title": "Push the ground beef to one side of the pan.",
      "content": "Push the ground beef to one side of the pan. Use a fork or spoon to push the meat to one side of the pan. Tilt the pan towards the empty side so that the grease pools in one corner of the skillet. [2] X Research source Don’t tilt the pan too much or you may spill some of the grease out."
    },
    {
      "title": "Spoon the grease into a bowl or spare can.",
      "content": "Spoon the grease into a bowl or spare can. Use a large metal spoon to remove the grease in the pan. For easier cleanup, spoon the grease into a spare aluminum can that you can throw away later. If you don’t have a spare can, line a bowl or cup with aluminum foil and spoon the grease into it. [3] X Research source Lining the bowl or glass with tin foil makes it easier to clean up later but isn’t necessary."
    },
    {
      "title": "Suck up the grease with a turkey baster rather than using a spoon.",
      "content": "Suck up the grease with a turkey baster rather than using a spoon. Squeeze the bulb of the baster and place the tip of the baster into the grease. Release the bulb to suck the grease up through the baster. [4] X Research source Make sure that hot grease doesn’t go into the bulb of the baster or it may melt it."
    },
    {
      "title": "Absorb the grease with paper towels for easy cleanup.",
      "content": "Absorb the grease with paper towels for easy cleanup. Take 2-3 paper towels and dab the grease. If there’s still grease in the pan, get more paper towels and continue dabbing the grease. Make sure not to touch the metal part of the pan with your hands or you could burn yourself. [5] X Research source Let the paper towels cool for 1-2 minutes and then throw them into the trash."
    },
    {
      "title": "Freeze the fat if you put the grease in a bowl or can.",
      "content": "Freeze the fat if you put the grease in a bowl or can. Let the grease cool for 10-20 minutes and then place it in the freezer. The grease should solidify within 1-2 hours. If you froze the grease in the can, you can just throw away the can. If you froze the grease in a bowl, spoon it out into the trash. [6] X Research source You can also use the frozen grease as a replacement for butter or lard when you cook."
    },
    {
      "title": "Brown the beef on the stovetop for 10 minutes.",
      "content": "Brown the beef on the stovetop for 10 minutes. Break up the ground beef into a skillet and place it on your stovetop on medium-low heat. Stir the meat until it browns. This usually takes around 10 minutes. [7] X Research source"
    },
    {
      "title": "Pour the ground beef into a colander with a glass bowl under it.",
      "content": "Pour the ground beef into a colander with a glass bowl under it. Place a colander over a glass or ceramic bowl and pour the ground beef and grease into the colander. The colander will drain the grease and the beef will remain on the top. [8] X Research source Grease may melt a plastic bowl. You can pour hot water over the ground beef to remove the remaining grease, but be forewarned that this will remove all the flavor in the process. If you do this, be sure to add flavor to the meat afterward."
    },
    {
      "title": "Wait for the grease to cool for 10-20 minutes, then chill it in the refrigerator.",
      "content": "Wait for the grease to cool for 10-20 minutes, then chill it in the refrigerator. Let the grease sit on your counter for 10-20 minutes and then place it in the refrigerator for 1-2 hours. The fat will solidify and create a layer of hard grease over the water. [9] X Research source Don’t take the grease out of the refrigerator until it’s hardened."
    },
    {
      "title": "Skim the fat off the top of the bowl and place it in the trash.",
      "content": "Skim the fat off the top of the bowl and place it in the trash. Use a spoon to skim the grease off the water and throw it away. Once all the grease is gone, you can pour the water down the drain. [10] X Research source"
    }
  ]
}