{
  "url": "https://www.wikihow.com/Download-Files-Using-VLC-Media-Player",
  "title": "How to Download Video Files with VLC Media Player",
  "steps": [
    {
      "title": "Go to the video you want to download.",
      "content": "Go to the video you want to download. In a web browser, go to the website that hosts the video you want to download. You can start playing the video to ensure it's the correct video. Unfortunately, this process no longer works with most YouTube videos, though you may occasionally find one that will download. If you want to download YouTube videos, check out How to Download YouTube Videos ."
    },
    {
      "title": "Copy the video's URL.",
      "content": "Copy the video's URL. Right-click the video and select Copy video URL or similar. If you don't see this option, try highlighting the address of the video at the top of your browser and pressing Ctrl + C on Windows or ⌘ Command + C on a Mac to copy it."
    },
    {
      "title": "Open VLC.",
      "content": "Open VLC. It's the app with the icon of an orange traffic cone. If you don't have it already, you can download VLC for free at https://www.videolan.org . VLC is an open-source video player with a lot of beneficial features for playing all kinds of files."
    },
    {
      "title": "Open a new Network Stream.",
      "content": "Open a new Network Stream. On Windows: Click Media , then click Open Network Stream . On Mac: Click File , then click Open Network ."
    },
    {
      "title": "Paste the video's URL into the field.",
      "content": "Paste the video's URL into the field. Make sure the entire URL was copied."
    },
    {
      "title": "Click the arrow next to the \"Play\" button and select Convert.",
      "content": "Click the arrow next to the \"Play\" button and select Convert . This opens an option for converting the streaming video to a format you can save to your computer. [1] X Research source"
    },
    {
      "title": "Specify the destination file.",
      "content": "Specify the destination file. Click Browse and choose a folder to save your downloaded video in. End the name of the file you're creating with \".mp4\". Then, click Open or OK to return to the Convert window."
    },
    {
      "title": "Select the H.264 + AAC (MP4) codec.",
      "content": "Select the H.264 + AAC (MP4) codec. It should be selected by default next to \"Profile,\" but if not, select it now."
    },
    {
      "title": "Click Start to convert and save the video.",
      "content": "Click Start to convert and save the video. This will download the video over the network and save it as an MP4 file. The longer the video, the longer this will take. If you get an error, you won't be able to download that particular video using VLC Media Player."
    }
  ]
}