{
  "url": "https://www.wikihow.com/Crush-Peanuts",
  "title": "How to Crush Peanuts",
  "steps": [
    {
      "title": "Shell some peanuts and put them in a freezer for several hours.",
      "content": "Shell some peanuts and put them in a freezer for several hours. Make sure they’re cold so they have an easier time getting crushed in the food processor. [1] X Research source"
    },
    {
      "title": "Pour 1 cup (.2 liters) of the cold peanuts into a food processor.",
      "content": "Pour 1 cup (.2 liters) of the cold peanuts into a food processor. Crush one cup of peanuts at a time to avoid unevenly-sized pieces. [2] X Research source"
    },
    {
      "title": "Put the lid on the food processor and hold down the pulse button.",
      "content": "Put the lid on the food processor and hold down the pulse button. Only hold down the pulse button for a few seconds; the goal is to crush the nuts in short bursts, not all at once. After a few seconds of pulsing, release the pulse button and let the peanuts rest for 2 - 3 seconds. [3] X Research source"
    },
    {
      "title": "Alternate between pulsing and resting until the peanuts are crushed.",
      "content": "Alternate between pulsing and resting until the peanuts are crushed. Pulse the peanuts for longer for more finely crushed pieces. [4] X Research source Avoid over processing the peanuts or they will release their natural oils and become too oily. [5] X Research source"
    },
    {
      "title": "Empty the crushed peanuts into a dish and repeat with more peanuts.",
      "content": "Empty the crushed peanuts into a dish and repeat with more peanuts. Continue crushing 1 cup (.2 liters) of peanuts at a time until you’ve crushed your desired amount."
    },
    {
      "title": "Fill a small plastic bag with 1 cup (.2 liters) of unshelled peanuts.",
      "content": "Fill a small plastic bag with 1 cup (.2 liters) of unshelled peanuts. Make sure the bag isn’t overflowing with peanuts or they might fall out as you’re crushing them. Twist or zip the bag closed. [6] X Research source"
    },
    {
      "title": "Place the bag on a cutting board and gently beat it with a rolling pin.",
      "content": "Place the bag on a cutting board and gently beat it with a rolling pin. Hold the rolling pin like a hammer and continue to beat the bag until the peanuts inside have flattened into one single layer. [7] X Research source"
    },
    {
      "title": "Use both hands to roll the rolling pin over the bag of peanuts.",
      "content": "Use both hands to roll the rolling pin over the bag of peanuts. Press down on the rolling pin as you roll it across the bag to help crush up the nuts. [8] X Research source"
    },
    {
      "title": "Dump the peanuts out of the bag and onto the cutting board.",
      "content": "Dump the peanuts out of the bag and onto the cutting board. Use your hand to spread the peanuts out in a single, concentrated layer at the center of the board. [9] X Research source"
    },
    {
      "title": "Use the rolling pin to press down on the peanuts and crush them.",
      "content": "Use the rolling pin to press down on the peanuts and crush them. Carry the rolling pin across the layer of peanuts, stopping and pressing down on each row until you feel the peanuts crush underneath. Lift and press the rolling pin, don't roll it. Continue doing this until you’re satisfied with how crushed the peanuts are. [10] X Research source"
    }
  ]
}