{
  "url": "https://www.wikihow.com/Delete-Tracking-Cookies",
  "title": "How to Delete Tracking Cookies",
  "steps": [
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. It's a red, yellow, green, and blue circular icon."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . You'll see this icon in the top-right corner of the Chrome browser."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's near the bottom of the drop-down menu."
    },
    {
      "title": "Scroll down and click Advanced.",
      "content": "Scroll down and click Advanced . This link is at the bottom of the page."
    },
    {
      "title": "Click Clear browsing data.",
      "content": "Click Clear browsing data . It's the last option under the \"Privacy & security\" heading."
    },
    {
      "title": "Make sure the \"Cookies and other site and plugin data\" box is checked.",
      "content": "Make sure the \"Cookies and other site and plugin data\" box is checked. You can uncheck every other box on this page if you like, but the \"Cookies and other site and plugin data\" box must be checked."
    },
    {
      "title": "Make sure the beginning of time is selected.",
      "content": "Make sure the beginning of time is selected. In the box near the top of the window, you'll see a box with a time span (e.g., \"the past hour\") listed. If this box doesn't display the \"the beginning of time\" option, click the box and then select it."
    },
    {
      "title": "Click CLEAR BROWSING DATA.",
      "content": "Click CLEAR BROWSING DATA . It's in the bottom-right corner of the window. Doing so will remove all of your browser's cookies."
    },
    {
      "title": "Open Safari.",
      "content": "Open Safari. It's a blue, compass-shaped app on your Mac's Dock."
    },
    {
      "title": "Click Safari.",
      "content": "Click Safari . This menu is in the far-left corner of your Mac's menu bar."
    },
    {
      "title": "Click Clear History.",
      "content": "Click Clear History . It's near the top of the drop-down menu. Doing so invokes a pop-up menu."
    },
    {
      "title": "Select a time frame.",
      "content": "Select a time frame. To do so, click the box next to \"Clear:\" in the middle of the pop-up window, then click a time (e.g., all history )."
    },
    {
      "title": "Click Clear History.",
      "content": "Click Clear History . Doing so will remove all cookies, search history, and website data from Safari."
    },
    {
      "title": "Open Microsoft Edge.",
      "content": "Open Microsoft Edge. It's a white \"e\" on a blue background."
    },
    {
      "title": "Click ….",
      "content": "Click … . This icon is in the top-right corner of the Edge window."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's at the bottom of the pop-out menu."
    },
    {
      "title": "Click Choose what to clear.",
      "content": "Click Choose what to clear . This option is below the \"Clear browsing data\" heading about halfway down the Settings menu."
    },
    {
      "title": "Make sure the \"Cookies and saved website data\" box is checked.",
      "content": "Make sure the \"Cookies and saved website data\" box is checked. This is the option that will clear your Edge browser's cookies; you can uncheck every other box on this menu if you like."
    },
    {
      "title": "Click Clear.",
      "content": "Click Clear . It's below the different types of data. Doing so will clear your browser's cookies."
    },
    {
      "title": "Open Internet Explorer.",
      "content": "Open Internet Explorer. It's a light-blue \"e\" icon."
    },
    {
      "title": "Click ⚙️.",
      "content": "Click ⚙️. This icon is in the top-right corner of the Internet Explorer window. Clicking it prompts a drop-down menu."
    },
    {
      "title": "Click Internet options.",
      "content": "Click Internet options . You'll find it toward the bottom of the drop-down menu."
    },
    {
      "title": "Click Delete….",
      "content": "Click Delete… . It's below the \"Browsing history\" heading near the middle of the Internet Options window."
    },
    {
      "title": "Make sure the \"Cookies and website data\" box is checked.",
      "content": "Make sure the \"Cookies and website data\" box is checked. You can uncheck every other box on this page, but the \"Cookies and website data\" box must be checked in order to delete your cookies."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . This button is at the bottom of the window. Doing so will delete your Internet Explorer cookies."
    },
    {
      "title": "Click OK to exit Internet Options.",
      "content": "Click OK to exit Internet Options. Your browser's cookies have been cleared."
    },
    {
      "title": "Open Firefox.",
      "content": "Open Firefox. Firefox resembles a blue globe with an orange fox wrapped about it."
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . It's in the top-right corner of the Firefox browser window."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . This button has a gear icon above it. On Mac, click Preferences ."
    },
    {
      "title": "Click the Privacy tab.",
      "content": "Click the Privacy tab. It's on the left side of the page (PC) or at the top of the window (Mac)."
    },
    {
      "title": "Click remove individual cookies.",
      "content": "Click remove individual cookies . This link is below the \"History\" heading in the middle of the page. If you're using custom settings for your Firefox history, you won't have the remove individual cookies option; instead, click the Show Cookies button on the right side of the page."
    },
    {
      "title": "Click Remove All.",
      "content": "Click Remove All . It's at the bottom of the Cookies window. Doing so will automatically delete your Firefox cookies."
    },
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. This app is white with the Google Chrome icon on it."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . It's in the top-right corner of the screen."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . This option is at the bottom of the drop-down menu."
    },
    {
      "title": "Tap Privacy.",
      "content": "Tap Privacy . It's in the \"Advanced\" section of options near the bottom of the page."
    },
    {
      "title": "Tap Clear Browsing Data.",
      "content": "Tap Clear Browsing Data . It's the last option on this page."
    },
    {
      "title": "Make sure Cookies, Site Data is checked.",
      "content": "Make sure Cookies, Site Data is checked. You can uncheck every other item on the Clear Browsing Data page if you like, but this option must be checked in order to clear your browser's cookies."
    },
    {
      "title": "Tap Clear Browsing Data (iPhone) or Clear Data (Android).",
      "content": "Tap Clear Browsing Data (iPhone) or Clear Data (Android). This option is below the browsing area. On Android, tapping this option will immediately clear your browser's cookies."
    },
    {
      "title": "Tap Clear Browsing Data when prompted (iPhone only).",
      "content": "Tap Clear Browsing Data when prompted (iPhone only). If you're using an iPhone, this last step will confirm your decision and delete your Chrome browser's mobile cookies."
    },
    {
      "title": "Open your iPhone's Settings .",
      "content": "Open your iPhone's Settings . It's a grey app with gears that you'll likely find on the Home Screen. This process will also work on an iPad or an iPod touch."
    },
    {
      "title": "Scroll down and tap Safari.",
      "content": "Scroll down and tap Safari . It's roughly a third of the way down the Settings page."
    },
    {
      "title": "Scroll down and tap Clear History and Website Data.",
      "content": "Scroll down and tap Clear History and Website Data . This option is near the bottom of the page."
    },
    {
      "title": "Tap Clear History and Data when prompted.",
      "content": "Tap Clear History and Data when prompted. It's at the bottom of the screen. Doing so will clear your Safari cookies and other web data. This option removes your on-device search history as well. If you just want to delete cookies, instead tap Advanced at the bottom of the page, tap Website Data , tap Remove All Website Data , and tap Remove Now ."
    },
    {
      "title": "Open Firefox.",
      "content": "Open Firefox. It's the blue globe with an orange fox icon."
    },
    {
      "title": "Tap ☰ (iPhone) or ⋮ (Android).",
      "content": "Tap ☰ (iPhone) or ⋮ (Android). This option is in either the bottom-center of the screen (iPhone) or the top-right corner of the screen (Android)."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's on the right side of the pop-up menu."
    },
    {
      "title": "Scroll down and tap Clear Private Data.",
      "content": "Scroll down and tap Clear Private Data . This option is in the \"Privacy\" group of settings."
    },
    {
      "title": "Make sure the switch next to \"Cookies\" is on (iPhone) or the box next to \"cookies and active logins\" is checked (Android).",
      "content": "Make sure the switch next to \"Cookies\" is on (iPhone) or the box next to \"cookies and active logins\" is checked (Android). If it isn't, tap the switch or tap the box to include cookies when the private data is deleted. You can disable every other type of data on this page if you only want to clear cookies."
    },
    {
      "title": "Tap Clear Private Data (iPhone) or Clear Data (Android).",
      "content": "Tap Clear Private Data (iPhone) or Clear Data (Android). It's at the bottom of the screen. On Android, tapping this option will immediately clear your on-device cookies and other website data."
    },
    {
      "title": "Tap OK when prompted (iPhone only).",
      "content": "Tap OK when prompted (iPhone only). If you're using an iPhone, this last step will remove all of your cookies from Firefox."
    }
  ]
}