{
  "url": "https://www.wikihow.com/Find-Books-in-a-Library",
  "title": "How to Find Books in a Library",
  "steps": [
    {
      "title": "Find a computer in the library.",
      "content": "Find a computer in the library. Today, most libraries have electronic catalogues available on computer terminals throughout the library. Find a computer and access the library's homepage. On the homepage there should be a search option for books, articles, magazines, newspapers and editorials. It is usually located at the top of the web page. [1] X Research source The computers should have the library's homepage set as the computer's homepage. If not, type the library's web address into the computer's internet browser."
    },
    {
      "title": "Do a title search.",
      "content": "Do a title search. Do this if you know the title of the book you are looking for. Type the title of the book into the search box. Omit any a's or the's at the beginning of the title when you type it into the search box. [2] X Research source [3] X Research source For example, if the title of the book is “The Fall of the Roman Empire,” then type in “Fall of the Roman Empire.”"
    },
    {
      "title": "Search by the author.",
      "content": "Search by the author. Do this if you cannot remember the book's exact title, but you know the author's name. [4] X Research source Authors are usually listed by their last names, so either type in the author's whole name, or just the last name. All of the works written by the author that the library has available will be listed. [5] X Research source In addition to books, newspaper articles, conferences, and other books associated with the author will be listed. You can narrow down the search results by filtering the list. Filter the results by clicking on books. You can also use this method if you are interested in other books by a specific author. Type in the author's name and look through the books that come up in the search engine."
    },
    {
      "title": "Do a subject search.",
      "content": "Do a subject search. Do this if you do not have a specific book or author in mind, but you are interested in a particular subject. When searching by subject, use key words to narrow down your search. [6] X Research source For example, if you are interested in immigration, then type in the search box “U.S. immigration,” “European immigration,” or “Mexican immigrants.”"
    },
    {
      "title": "Click on the book's title.",
      "content": "Click on the book's title. Do this once you have found a book. You will be redirected to a new page that contains specific information about your book, like the book's status and where it is located. To access this information, you may need to input an ID and password if you are at a private library, like a university library. If you are a student of the university or member of the library, then input your information. [7] X Research source If you are at a public library, then you may not need to input an ID and password. If you do, then ask the librarian for this information."
    },
    {
      "title": "Write down the book's location, call number and status.",
      "content": "Write down the book's location, call number and status. These are the three most important pieces of information that you need to write down. This information tells you where the book is located in the library and if it is available. [8] X Research source For example, write down, location: Anderson Library Stacks, call number: QA 600.K57 2009, and status: available/unavailable. If your book is located in the “stacks,\" then it is a circulating book that can be checked out for a certain period of time like four weeks. If your book is in the “reserves,” a reference book, or in the “special collections,” then it can be checked out, however, it cannot be taken outside of the library."
    },
    {
      "title": "Use the call number guide.",
      "content": "Use the call number guide. Do this if your book is available (not checked out or missing). Identify the first two letters of the call number. Then find them on the guide. The guide will tell you which wing of the library the book is in and on what floor. [9] X Research source For example, a book starting with QA may be in the blue wing on the fourth floor. Look for call number guides around the computers, or at the library's main desk."
    },
    {
      "title": "Look at the library's map.",
      "content": "Look at the library's map. Do this if you are unsure where the blue wing is, for example. You can find maps at the main desk of the library. The map will outline how to get to the different wings of the library, using the main desk as the reference point. [10] X Research source Alternatively, you can ask a staff member to direct you to the wing."
    },
    {
      "title": "Look at the labels at the end of the bookshelf.",
      "content": "Look at the labels at the end of the bookshelf. The bookshelf labels are organized alphabetically. Use these labels to locate which bookshelf your book is on. The labels typically contain a range of letters and numbers, for example, QA 100.74.B50 to QA 300.70.A30. If your book's call number falls within the range, then begin looking through that bookshelf. [11] X Research source For example, if your book's call number is QA 200.86.S50, then it falls within the range and your book is located on that shelf."
    },
    {
      "title": "Look at the numbers on the books' spine.",
      "content": "Look at the numbers on the books' spine. The books are also organized alphabetically, so use the call number to locate the book. The call number is typically located at the bottom of the book's spine. The book's call number should match the call number in the system identically. [12] X Research source Since books are organized by topic using the Library of Congress Classification System, try browsing the other books in the section you found your book in if you want more books on your topic."
    },
    {
      "title": "Ask a staff member.",
      "content": "Ask a staff member. Do this if you cannot find the book, but the system says it is available. The book may be misplaced, or perhaps you are looking in the wrong place. After all, most libraries are huge and it is easy to get confused. The staff member will go and look for the book for you. [13] X Research source Tell the staff member, “I went to look for a book in the blue wing, but I could not find it. The system said it was available, but it was not there when I went to go look for it. Could you check for me?”"
    },
    {
      "title": "Request an interlibrary loan.",
      "content": "Request an interlibrary loan. If the librarian confirms that the book is missing or unavailable, then request an interlibrary loan. You or the librarian will need to fill out a request form detailing the name of the book, author and year it was published, as well as your contact information. It usually takes five to seven days for a book to arrive. [14] X Research source An interlibrary loan allows you to check out a book from another library where the book is available."
    }
  ]
}