{
  "url": "https://www.wikihow.com/Disable-a-Fire-Alarm",
  "title": "How to Disable a Fire Alarm",
  "steps": [
    {
      "title": "Find the activated unit.",
      "content": "Find the activated unit. Look around your house for the activated fire alarm unit. In addition to the alarm sound itself, this is typically indicated by a rapidly flashing red light on the front of the unit. Because the alarm is free standing, it should not have activated other alarms, meaning you only have one to worry about. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Be aware that some battery-powered smoke alarms may also be interconnected wirelessly to others or to a fire alarm panel."
    },
    {
      "title": "Reset the alarm.",
      "content": "Reset the alarm. For most modern battery-powered fire alarms, you can do this by pressing or holding a button on the front of the device for a few seconds. If you have an older model, you may need to unscrew your alarm from the wall or ceiling and hold down a button on the back. [2] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For some models, pressing for more than two seconds may trigger a programming mode rather than a silencing mode."
    },
    {
      "title": "Replace or remove the batteries if the alarm won’t reset.",
      "content": "Replace or remove the batteries if the alarm won’t reset. If resetting the detector doesn’t turn off the alarm, there may be an issue with the batteries. Unscrew your detector from the wall or ceiling and replace the batteries. Then, reset the device. If the alarm is still active, remove the batteries entirely. [3] X Research source Newer alarms may have a non-removable 10-year battery. Do not attempt to remove such a battery. You will need to replace the entire unit, if it is defective. If the alarm is chirping occasionally instead of giving a full, rapid alarm, it is a sign that the batteries are dying or that the unit has become defective."
    },
    {
      "title": "Replace malfunctioning smoke detectors.",
      "content": "Replace malfunctioning smoke detectors. If, after several days, the alarm still goes off whenever you put in batteries, it may be time to get a new device. Battery powered smoke detectors are available from most supermarkets and home improvement stores. Depending on the quality of the unit, they typically cost between $10 and $50. [4] X Research source Many fire codes require replacement of residential smoke alarms at intervals no more than ten years, or whatever shorter time may be listed in the manufacturers' instructions. [5] X Research source Check with your local fire department or Red Cross to see if they offer free or discounted smoke detectors. Be sure to install units that are compatible with your existing units, to avoid confusion, especially if they are wirelessly interconnected."
    },
    {
      "title": "Reset each alarm.",
      "content": "Reset each alarm. Since hardwired smoke alarms may be connected to each other, one going off may cause the rest to follow suit. To silence them, you’ll need to reset at least one of them by pressing or holding down a button located on the front, side, or back of the device. For some alarm models, you may need to unscrew the unit from the wall or ceiling to reach the reset button. [6] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Most interconnected smoke alarms also indicate which sensor initiated the alarm, often using a rapidly flashing red or green light on that unit. Resetting the alarm may result in losing that information, although some models also have an \"alarm memory\" function. If only one alarm is active, it may be a sign that the unit is malfunctioning. A short chirping sound would indicate a low battery or \"end-of-life\" condition on most units. If your hardwired unit is controlled by a keypad, consult your user manual for a deactivation code."
    },
    {
      "title": "Flip your circuit breakers if resetting the alarms didn’t work.",
      "content": "Flip your circuit breakers if resetting the alarms didn’t work. If your alarms are all routed to a specific breaker, you’ll only need to flip that one. If not, you may need to flip multiple breakers corresponding to different parts of your house. Circuit breakers are typically found in a garage, basement, or maintenance closet. If you’re cutting off power to entire rooms, unplug any appliances in the area to keep them from experiencing unnecessary power surges. Some fire codes prohibit installation of all smoke alarms on the same circuit, thus providing some amount of continued safety from remaining units if one circuit breaker is accidentally tripped."
    },
    {
      "title": "Disconnect each smoke alarm.",
      "content": "Disconnect each smoke alarm. If the alarms are still active, you may need to disconnect them entirely. To take down a unit, twist the alarm counter-clockwise and pull it off the wall or ceiling. Remove the cord connecting the unit to the house and, if necessary, remove any backup batteries. Repeat this for every unit. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Many user manuals instruct you to first shut off the power before attempting to disconnect the plug powering a unit. This may help avoid the risk of shock if there is a problem with the connector or the high-voltage wiring."
    },
    {
      "title": "Call your apartment manager or the fire department if necessary.",
      "content": "Call your apartment manager or the fire department if necessary. If you’re trying to turn off a hardwired fire alarm in a commercial building, apartment complex, or dorm, there’s a very good chance you won’t be able or authorized to do it yourself. In these cases, call your apartment manager or the local fire department’s non-emergency hotline and ask them to shut it off. [8] X Research source Though most system alarm shut-offs can be done remotely, some buildings may require a physical, in-person reset. For safety of others, some fire codes prohibit silencing of alarms by anyone not specifically authorized by the fire department for that incident."
    },
    {
      "title": "Repair or replace damaged smoke alarms.",
      "content": "Repair or replace damaged smoke alarms. If your alarms go off when no fire is around, you may need to replace the individual units or repair the wiring connecting them. Replacement units generally cost between $10 and $50, and you can purchase them from supermarkets or home improvement stores. If your new units malfunction as well, you may need to hire a local electrician to inspect your wiring. [9] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source Make sure your replacement units are compatible with the hardwiring or interconnection of the remaining units. Otherwise, replace all units at the same time with the same model."
    },
    {
      "title": "Press the silence button if you have a modern alarm.",
      "content": "Press the silence button if you have a modern alarm. In recent years, many companies have enhanced their alarms by adding silence buttons to them. These will temporarily disable your alarm, allowing you to cook, smoke, or do other actions that would normally set them off. Look for a button on your alarm that is either unmarked or listed as ‘Silence,’ ‘Hush,’ or something similar. Many silence buttons are combined with a test alarm button. The \"hush\" or silence features will not work on some models unless the alarm is going off. Most silence buttons deactivate the alarm for 10 to 20 minutes."
    },
    {
      "title": "Remove the power source from your alarm to fully deactivate it.",
      "content": "Remove the power source from your alarm to fully deactivate it. If your alarm does not have a silence button, or if you need it off for a significant amount of time, try removing its power source. Twist your alarm counter-clockwise, then pull it off the mounted base. If your smoke detector is hardwired, pull out the cable attaching it to the wall or ceiling and remove any backup batteries. If your alarm is an independent unit, simply remove its batteries. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source In some alarms, the batteries may be hidden behind a sliding or screw-mounted panel. Newer alarms may have a non-removable 10-year battery. Do not attempt to remove such a battery. You will need to replace the entire unit, if it is defective."
    },
    {
      "title": "Consult your user manual if necessary.",
      "content": "Consult your user manual if necessary. Every smoke detector is different, and many are designed so you can’t easily or accidentally disable them. If you can’t find your alarm’s power button or power source, look for model-specific information in your user manual. If you no longer have the physical copy, many companies keep digital user manuals on their websites."
    },
    {
      "title": "Locate the fire alarm control panel.",
      "content": "Locate the fire alarm control panel. Typically, fire alarm systems for large commercial buildings are controlled by a primary panel. These panels are often located in a breaker room or janitor’s closet."
    },
    {
      "title": "Access the control panel.",
      "content": "Access the control panel. If a panel is covered by a protective box, you’ll first need to use a key to open the box and access the controls. Once the controls are exposed, you may need to punch in a verification code or insert a small control key into the panel. This will allow you to actually use the controls. [11] X Research source"
    },
    {
      "title": "Follow your panel instructions to disable the fire alarm.",
      "content": "Follow your panel instructions to disable the fire alarm. Every commercial fire alarm system is different, meaning each one will have a unique shut-off process. However, this will typically involve selecting a fire zone or addressable alarm head and pressing a ‘silence’ or ‘reset’ button. Other systems require silencing the entire system."
    }
  ]
}