{
  "url": "https://www.wikihow.com/Copyright-Your-Writing-for-Free",
  "title": "How to Copyright Your Writing for Free",
  "steps": [
    {
      "title": "Know the purpose of a copyright.",
      "content": "Know the purpose of a copyright. The primary purpose of copyright law is to promote the progress of science and useful arts. In order to promote knowledge (scientific or otherwise), copyright laws give you a temporary monopoly on the work you create. This is intended to encourage you to produce even more. Therefore, while copyright law does grant you and other creators protection of your rights to the work you have already produced, the primary purpose is to encourage a continuing expression of new ideas."
    },
    {
      "title": "Determine if your work can be copyrighted.",
      "content": "Determine if your work can be copyrighted. Copyright laws apply to \"original works of authorship.\" [1] X Research source This phrase includes: Literary works; Musical compositions; Dramatic works; Sound recordings; and Architectural works. [2] X Research source"
    },
    {
      "title": "Recognize the rights associated with a copyright.",
      "content": "Recognize the rights associated with a copyright. When you own a copyright to an original work of authorship, you have the exclusive right to distribute, reproduce, perform, license, and display your work, and also to prepare secondary works based on your work. [3] X Research source Your rights to a copyrighted work are limited by the \"fair use\" doctrine, among other things. [4] X Research source That means that other people can use some or all of your original work for various limited purposes including: Criticism; Commentary; News reporting; Teaching (in a non-profit school); Scholarship; and Research. [5] X Research source Your rights are also limited by \"first sale\", meaning you cannot prevent others from reselling copies of your works, once you have sold them. Many software products are therefore not actually \"sold\", but rather \"licensed\" to end-users, often restricting the right of further resale. Your right to prevent distribution of copies or public performances are subject to other limitations, by statute. For instance, you may not use copyright laws to prevent performance of your non-dramatic songs in a church ceremony, or a certain non-profit performances. You cannot use copyright law to prevent someone from making a backup copy of computer software, provided they follow the rules."
    },
    {
      "title": "Understand the time limit associated with a copyright.",
      "content": "Understand the time limit associated with a copyright. When you own a copyright it does not last forever. The length of time your copyright protections last will depend on when your work was created and whether it was published. For purposes of copyright, a writing is considered published when you make it available to the public on an unrestricted basis. [6] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source Works published in the USA prior to 1923 have no US copyright, other than certain sound recordings covered by state laws until 2067. For writings created after 1977, a copyright will last for the life of the author (or last surviving author of a joint work) plus another 70 years. [7] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source If your writing was a work for hire (meaning a writing specifically commissioned under a written contract or completed as part of an employment agreement) or is published anonymously, the copyright will last either 95 years from publication or 120 years from creation. [8] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source If your work was published after 1922 but before 1978, it will be protected for 95 years from the date of publication, assuming it was published with the required copyright notice and (if prior to 1964) was properly renewed in the Copyright Office in its 28th year. [9] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source However, if the work was created in this period but not published, the copyright will last for the life of the author plus 70 years. [10] X Research source Note that copyright duration in other countries varies, but is generally not less than 50 years from publication or from the death of the author, by treaty. Some may be 95 or 100 years after the authors' deaths. [11] X Research source"
    },
    {
      "title": "Create an original work of authorship.",
      "content": "Create an original work of authorship. Copyrightable written material includes not just literature (novels, poems, essays, etc.) but also any work expressed in words, numbers, or other symbols. [12] X Research source In order to create something, it does not have to be written down (or \"fixed\"). You can create an original work by simply thinking or speaking about it. Mere creation, however, does not make something copyrightable."
    },
    {
      "title": "\"Fix\" your original work.",
      "content": "\"Fix\" your original work. As part of the creation process, you will need to fix your original work in order for it to be copyrightable. [13] X Research source In order to fix something, you must express it \"in a tangible form that is perceptible by the human senses either directly or with the aid of a machine.\" [14] X Research source Furthermore, it must be permanent or stable enough to allow for it to be \"perceived, reproduced, or otherwise communicated for a period of more than transitory duration.\" [15] X Research source For example, a writing will be fixed when it is printed on paper or when it is stored on a computer. [16] X Research source Examples of works that are not fixed include speeches that are not transcribed and live, unrecorded performances of music. [17] X Research source In general, all you need to do is create a work of authorship and write it down or otherwise record it somewhere. This will automatically create copyright protections. In theory, you do not need to own the original copy in order to own the copyright. For example, if you publicly perform some original music and an audience member records it, you own the copyright of that recording."
    },
    {
      "title": "Make sure you understand the limits of your copyrighted original work of authorship.",
      "content": "Make sure you understand the limits of your copyrighted original work of authorship. Some works or pieces of works are not able to be copyrighted, such as the following: Ideas; Facts; Works whose copyright term has expired; Works of the United States Government; Laws; Works that authors have clearly and irrevocably dedicated to the public; Procedures; Processes; Systems; Methods of operation; Concepts; Principles; and Discoveries. [18] X Research source [19] X Research source For example, you might write a book that describes a new system of bookkeeping. [20] X Research source Your copyright protection would extend to your description of the system but not to the system itself . [21] X Research source Similarly, you may be the author of an original computer program, including an HTML web page, but you only own the copyright for the parts that are \"creative\" and \"original\", not the standard segments necessary for the basic operations of the system."
    },
    {
      "title": "Determine when your original work is officially copyrighted.",
      "content": "Determine when your original work is officially copyrighted. Copyright protections will attach to your writing as soon as it is fixed. [22] X Research source No copyright registration is needed to protect your writing, and no fee is required. Although registering your copyright is voluntary, there are reasons you might want to take that step. [23] X Research source For example, you must have registered your US copyright if you want to bring a copyright-infringement suit against someone who is unlawfully using your work. [24] X Research source You can register your copyright at any time during the copyright period. [25] X Research source Early copyright registration provides additional rights related to statutory damages, allowing you to claim some amount of damages without actually proving any."
    },
    {
      "title": "Learn about obsolete U.S.",
      "content": "Learn about obsolete U.S. formalities of copyright notices and renewals. Before 1989, you would have been required to provide notice on your written work in order for it to be copyright-protected. [26] X Research source This notice was typically the copyright symbol (\"©\") followed by a date of publication and the author's name. [27] X Research source Lack of a proper copyright notice, including intentional misstatement of the publication date, resulted in the immediate loss of copyright. Similarly, failure to file a renewal notice in the proper year, if published prior to 1964, resulted in loss of copyright at the end of that year. This is one reason the \"Happy Birthday\" song became public domain. U.S. law no longer requires copyright notice upon publication. [28] X Research source A written work, whether published or not, is now presumed to be copyrighted unless the author or copyright owner clearly indicates to the contrary. [29] X Research source [30] X Research source Technically, such a work remains copyrighted, by law, but the owner has waived the right to enforce it to varying extent. To indicate that you will not enforce your copyright, you can note on the work that it can be \"freely copied\" or words to that effect. [31] X Research source As noted in the cited reference, such a disclaimer is effectively a license for the public use, whether or not restricted by its terms (e.g., only for non-commercial use)."
    },
    {
      "title": "Complete an application.",
      "content": "Complete an application. If you want to register your copyright, you must complete an application online or by mail with the United States Copyright Office. [32] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source The easiest and most efficient way to register is online. To complete an online application, log in to the eCO website. [33] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source You will be prompted to answer a series of questions until the application is complete. [34] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source The United States Copyright Office website has a great tutorial you can utilize, which gives you step-by-step instructions on how to complete the application. [35] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source"
    },
    {
      "title": "Make the required payment.",
      "content": "Make the required payment. Once your application is complete, you will be prompted to check out. [36] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source Before doing so you will be required to pay a fee, which is calculated based on your registration preferences. [37] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source The basic online registration fee ranges from $35 to $55. [38] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source Specialized registrations will cost between $25 and $400, as explained on the Copyright Office website. [39] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source"
    },
    {
      "title": "Send in the work you are registering.",
      "content": "Send in the work you are registering. In addition to filing your registration application with the Copyright Office, you will be required to submit to them a copy of your writing. [40] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source In the online process, you will be prompted to upload a copy of your writing once you have paid the fee. [41] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source"
    },
    {
      "title": "Wait for your application to be processed.",
      "content": "Wait for your application to be processed. Once it's submitted, you can expect a response from the Copyright Office in approximately eight months. [42] X Trustworthy Source United States Copyright Office Part of the Library of Congress, responsible for maintaining copyright records Go to source Once your application has been processed, barring any problems, your writing will be registered with the United States Copyright Office."
    }
  ]
}