{
  "url": "https://www.wikihow.com/Edit-Audio-on-iPhone",
  "title": "How to Edit Audio on iPhone with GarageBand, Voice Memos, iMovie, and More",
  "steps": [
    {
      "title": "Open GarageBand on your iPhone.",
      "content": "Open GarageBand on your iPhone. You'll find it in your app list. If you don't have GarageBand installed on your iPhone, you can download it for free from the App Store. [1] X Research source You can use GarageBand on your iPhone to add effects to and trim songs from your music library, as well as other AIFF, WAV, CAF, Apple Loops, AAC, MP3, and MIDI files saved to your phone."
    },
    {
      "title": "Swipe through the options and select Audio Recorder.",
      "content": "Swipe through the options and select Audio Recorder . You can swipe either left or right across the options until you see Audio Recorder, which has a large microphone icon. Once you're there, tap it to create a new project. If you’re in the GarageBand file browser, tap the microphone icon at the top right side of the screen to start a new project."
    },
    {
      "title": "Tap the Tracks View icon.",
      "content": "Tap the Tracks View icon. It's in the upper-left corner of the screen and looks like three horizontal lines that are broken into pieces. This puts Garage Band into Tracks View. [2] X Research source"
    },
    {
      "title": "Tap the Loop Browser button.",
      "content": "Tap the Loop Browser button. It's in the upper-right corner and looks like a loop of string."
    },
    {
      "title": "Browse for the audio track you want to edit.",
      "content": "Browse for the audio track you want to edit. Tap Music if the song is in your Music library. You can then browse by album, artist, genre, playlist, or view the song list. You may not be able to edit tracks that are copyright-protected. Tap Files if you downloaded the song from the web or copied it to another location on your iPhone. Then tap Browse items from the Files app at the bottom, select Browse , and locate the audio track."
    },
    {
      "title": "Drag the audio file left or right to bring it into Tracks View.",
      "content": "Drag the audio file left or right to bring it into Tracks View. Tap and hold the file, then drag it to bring it into the Tracks View screen. Drag it directly to the first track and then lift your finger to place it there. [3] X Research source Align the beginning of the song with the beginning of the track."
    },
    {
      "title": "Drag the bars on either side of the track to trim the audio.",
      "content": "Drag the bars on either side of the track to trim the audio. If you want to cut off the beginning or end of the audio track, tap and drag one or both bars until the part(s) you don't want is removed. [4] X Research source Tap the play button (the triangle) at the top to hear a preview. Tap the curved arrow at any time to undo the last action."
    },
    {
      "title": "Adjust other track settings (optional).",
      "content": "Adjust other track settings (optional). GarageBand has many tools you can use to further work with your audio file. Here are a few things you can do: Tap the FX button at the top right side of the screen to open a panel of DJ tools. This will allow you to remix your track. [5] X Research source Tap the Edit button (it looks like a series of sliders) to access controls like echo, reverb, compressor, treble, and bass."
    },
    {
      "title": "Double-tap the track header to access additional controls.",
      "content": "Double-tap the track header to access additional controls. Tap the track twice to open a context menu. This will allow you to do things like: [6] X Research source Delete, cut, copy, or rename the track. Split the track (as opposed to trimming off the beginning or end). Set the track to loop. Access additional settings, such as gain, looping, and reverse."
    },
    {
      "title": "Tap the down arrow to close the file.",
      "content": "Tap the down arrow to close the file. This arrow is located in the top left corner of the screen. When you've edited the track as desired, tap this and select My Songs . This will take you to your recent files."
    },
    {
      "title": "Rename the project file.",
      "content": "Rename the project file. Your new edit will be saved with a generic name like \"My Song 1.\" To change its name, tap and hold the file, select Rename , enter a new name, and tap done ."
    },
    {
      "title": "Save the new audio file.",
      "content": "Save the new audio file. Here's how: [7] X Research source Tap and hold the file and select Share . Tap Song . Select an audio quality—High Quality is selected by default. Scroll down and edit the info, such as artist, composer, and album, if you'd like. You can also add a cover image. Tap Share at the top-right corner. Tap Open In . Select Save to Files to save the song to your phone, or choose an app you'd like to use to listen to the file. If you save it to your phone, choose a saving location (it can be on your iCloud drive if you want) and tap Save ."
    },
    {
      "title": "Open Voice Memos on your iPhone.",
      "content": "Open Voice Memos on your iPhone. If you've recorded a voice memo using the Voice Memos app, you can easily edit your recording from within the app. [8] X Research source"
    },
    {
      "title": "Tap the audio you want to edit.",
      "content": "Tap the audio you want to edit. This expands some controls below the audio file."
    },
    {
      "title": "Tap the Edit icon.",
      "content": "Tap the Edit icon. It’s below the track on the right side and looks like a series of vertical lines of different heights. This will open the editing menu. You can also tap the ••• at the top right corner of the track and select Edit Recording ."
    },
    {
      "title": "Tap ••• and select Trim.",
      "content": "Tap ••• and select Trim . This will allow you to trim your track."
    },
    {
      "title": "Drag the yellow bars to surround the part of the audio you want to keep.",
      "content": "Drag the yellow bars to surround the part of the audio you want to keep. You can hear a preview at any time by tapping the triangle (the play button) at the bottom center."
    },
    {
      "title": "Tap Trim.",
      "content": "Tap Trim . This trims the ends off of the file, retaining only the portion surrounded by the yellow lines. You can also tap Delete to discard the portion of the file between the yellow bars."
    },
    {
      "title": "Tap Apply.",
      "content": "Tap Apply . It's at the top-right corner. This saves your changes to the file. [9] X Research source"
    },
    {
      "title": "Tap the Enhance button to enhance the sound (optional).",
      "content": "Tap the Enhance button to enhance the sound (optional). To access this option, tap the icon at the top left side of the screen that looks like a series of sliders, then toggle on Enhance Recording . You can also use this menu to adjust the playback speed or skip silent parts of the recording. When you’re done, tap the X to close the menu. [10] X Research source If you don’t like the result of your edits, tap ••• and select Undo ."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It's at the bottom-right corner. [11] X Research source Select Save Recording to save your changes, or select Save as New Recording to keep both the original version and the edited file."
    },
    {
      "title": "Open the movie project you’d like to edit.",
      "content": "Open the movie project you’d like to edit. iMovie is a movie editing app that comes with iOS. To edit audio clips within the app, open iMovie and tap one of the movies under the Projects header. Tap the Edit button under the movie. [12] X Research source"
    },
    {
      "title": "Tap an audio clip in the timeline to select it.",
      "content": "Tap an audio clip in the timeline to select it. Background music clips are green, while other audio clips are blue or purple."
    },
    {
      "title": "Drag the yellow bars on either side of the clip to trim it.",
      "content": "Drag the yellow bars on either side of the clip to trim it. When you select a clip, it will be outlined in yellow. Touch and drag the yellow bar on either end of the clip to trim off some of the beginning or end."
    },
    {
      "title": "Touch and hold the clip to move or delete it.",
      "content": "Touch and hold the clip to move or delete it. When you touch and hold an audio clip, it will pop loose from the timeline. Drag it to a new location and release it to drop it there. To delete a clip, drag it up above the timeline until you see an icon that looks like a puff of smoke, then release it."
    },
    {
      "title": "Use the Actions tool to make additional edits.",
      "content": "Use the Actions tool to make additional edits. Tap the clip to select it, then tap the Actions tool at the bottom of the screen, which looks like a pair of scissors. You’ll see some new options appear above the toolbar. To split an audio clip, scroll through the clip until the playhead (the vertical white bar) is positioned over the part of the clip you want to split. Then, tap Split . To toggle a clip between foreground and background audio, tap the text that says either Foreground or Background . You can also separate audio from a video clip with the Actions menu. Tap the video and select Detach Audio ."
    },
    {
      "title": "Search for free music editing apps in the App Store.",
      "content": "Search for free music editing apps in the App Store. The App Store has a ton of audio editing apps. If the built-in apps don’t have the features you want, you may be able to find a free third-party app that suits your needs. Some popular options include SoundLab, WavePad, and Audio Editor – Music Editor."
    },
    {
      "title": "Consider a paid app for more advanced features.",
      "content": "Consider a paid app for more advanced features. Apps like Cubasis 3 and n-Track Studio Pro offer a lot more bells and whistles than the free alternatives. These apps are designed to be full-featured music studios on your iOS device. Look into one of these options if you want to do professional-quality audio editing."
    }
  ]
}