{
  "url": "https://www.wikihow.com/Get-Super-Skinny",
  "title": "How to Get Super Skinny",
  "steps": [
    {
      "title": "Begin your research.",
      "content": "Begin your research. Start to take note of your daily activity and diet. Learn your starting weight and begin to think of a goal weight. Talk to a doctor. You shouldn’t make any drastic changes before you check with your health care provider. Along with a doctor, you can find a dietician or trainer to help you in this process. Any of these people can run tests to make sure you’re healthy enough to begin a new diet change or new workout regimen. Learn how many calories you’re consuming per day. There are many helpful sites to get you started: SparkPeople is free and easy for beginners. Make a tangible goal. Don’t just think “I want to be super skinny.” Instead, set a goal of “I want to lose 30 pounds.” Your doctor can help you determine if you’re goals are obtainable and good for your health."
    },
    {
      "title": "Make a plan and write it down.",
      "content": "Make a plan and write it down. After seeing your doctor, sit down and make a plan to fit your lifestyle that will help you lose weight. Buy a journal and rediscover the diet changes and exercise goals you discussed with you doctor. Make sure your goals are tangible, and fill the journal with anything that will help you reach them. Know how many calories you need to burn. In order to lose a pound a week, you need to burn 3,500 more calories than you take in during the week. Therefore, you need to either burn or cut out 500 calories a day. This can come from simple changes, such as smaller portions, or cutting sugary drinks out of your diet. Calories are listed on the side of everything that you buy at the grocery store. [1] X Research source Start with some simple changes. Choosing the stairs over the elevator is an easy fix to help you burn calories during the day. If you find yourself sitting for hours on end, take a break and take a walk around the office or house. This will help you burn calories and keep your metabolism awake without breaking a sweat and are key in getting super skinny. Wearing a fitness tracker can help you keep track of how many calories you burn throughout the day. Fitbit, Garmin, and Jawbone are some of the best and easiest fitness trackers available."
    },
    {
      "title": "Find your motivation.",
      "content": "Find your motivation. Come up with some kind of reward system to help keep you motivated. Reward yourself. For every pound lost, place a dollar amount (that you thought of ahead of time) in a jar. Once you reach a goal, spend the money on something you’ve been wanting—maybe a new shirt to show off your progress. Give yourself a cheat. Don’t go overboard, but once you reach a goal, enjoy a bit of “forbidden food” or take a day off of working out. Create a positive body image. Even though you have goals of becoming super skinny, you should love the body that you’re in the entire time. Give yourself daily body image compliments. Even if you have to start small, you’ll gain confidence in your body. This will help you stay strong through the process."
    },
    {
      "title": "Eat the right amount.",
      "content": "Eat the right amount. You don’t necessarily need to eat less to lose weight. Sometimes, in fact, you need to eat more. If you want to see a drastic change in your body, the fastest way to do so is by eating right. Eat throughout the day. This helps your metabolism speed up. Get on an eating schedule and stick to it. You should be eating 5 times a day instead of 3, so remember to do so in smaller portions than you normally would. Cook (meal prep) healthy snacks. These should be used to eat between meals, because you should eat at least every 4 hours. This will help you avoid snacking on candy bars or anything else available quickly. If you have prepared snacks, you’re more likely to make a better choice."
    },
    {
      "title": "Eat the right foods.",
      "content": "Eat the right foods. Just because you watch your caloric intake doesn’t mean you’re sure to get the results you want. Know what kind of calories you should be consuming throughout the day. Fill up on protein. Proteins are your best friend. Proteins help you feel fuller longer. Also, it helps to fuel fat burning. This happens because your body burns both fat and muscle when you’re getting super skinny. Therefore, eating protein with help preserve your lean muscle which burns calories. [2] X Research source Include vegetables in every meal. Adding vegetables to your meals will help fill you up without burning through the calories you’re allowed while dieting. Most vegetables are primarily water, which is incredibly helpful for weight loss. Embrace the right carbs. Yes, avoid the sugary, starch filled carbs like white bread and potatoes. But brown rice and sweet potatoes are carbs that will keep your energy level up while you diet. [3] X Research source"
    },
    {
      "title": "Eat at the right times.",
      "content": "Eat at the right times. Eating throughout the day is going to keep your metabolism going. Try to avoid large meals late in the day because you won’t burn them off before you fall asleep. Eating bigger meals in the morning and smaller meals at night is key if you want to get (and stay) skinny. Have a big breakfast. Breakfast is the most important meal of the day. Eating within an hour of waking up gets your metabolism going and keeps you from mindless snacking before lunch. Here are some ideas for a healthy and big breakfast: 3 scrambled eggs and whole wheat toast 1/2 cup of oatmeal, ½ cup of fresh fruit, 2 hard-boiled eggs 2 baked eggs in ½ avocado and ½ cup grits Cut out carbs from your last meal. Try to eat your carbs early in the day and pack dinner with protein and vegetables. Cook every meal at home. When you cook at home, you’re aware of what you’re putting into your meals. “Meal prep” is a necessary part of becoming skinny. Measure out your food depending on your goals and pack your meals ahead of time. Always have healthy options with you to avoid making bad choices."
    },
    {
      "title": "Drink “lots” of water.",
      "content": "Drink “lots” of water. Staying hydrated is key to losing weight. Staying hydrated keeps your metabolism going which burns fat, and water acts as a natural appetite suppressant. Always start your day off with a full glass of water. Switch sugary soda drinks to water with meals and keep drinking water throughout the day. Buying an oversized water bottle and marking goals on it by the hour will help keep you hydrated. But how do you figure out these goals? Find out your body weight in pounds. Drink between half an ounce and ounce of water per pound each day. Mark the side of a bottle (put a line for each hour) to help you stay on track through the day."
    },
    {
      "title": "Start with cardio.",
      "content": "Start with cardio. Cardio has many forms: Walking, running, biking, swimming, rowing, etc. All of these are considered long distance exercise. Discuss with your doctor which ones are going to be best for you. Swimming is low impact and doesn’t stress your joints, whereas running might cause knee problems. Do the right amount of cardio. In order to get the most out of cardio, you should do between 30 and 50 minutes per cardio session. This time frame is where you’ll be in the “fat burning” portion of your workout. Count calories. If you’re using a cardio machine at the gym, most will have calorie trackers for you to keep track of the amount of calories you’re burning while exercising. Reader Poll: We asked 174 wikiHow readers they found cardio and aerobic exercises effective for fat loss, and 68% of them said yes. [Take Poll]"
    },
    {
      "title": "Try HIIT (High Intensity Impact Training).",
      "content": "Try HIIT (High Intensity Impact Training). This is a newer form of working out which requires very little time but very difficult exercises ranging over every muscle in the body. In 30 minutes you can easily burn over 500 calories if you correctly perform your HIIT workout. These are typically in circuit style and designed for maximum caloric burn. For example doing one minute of each of the following for 6 rounds without stopping: Box jumps Renegade Rows Jump Rope Leg Lifts Lunge jumps"
    },
    {
      "title": "Learn to lift weights.",
      "content": "Learn to lift weights. Weight lifting is more goal oriented than any other exercise. It burns more calories than cardio if done properly, but can be dangerous if performed incorrectly. Hire a personal trainer to teach you how to lift properly. Many people that lift have goals such as gaining a higher vertical leap, or wanting to perform pull ups without help. Use a fitness tracker. Whereas cardio machines have calorie trackers, it is hard to tell how many calories you burn during your lifting session. Therefore, a fitness tracker (mentioned earlier) can be very helpful."
    },
    {
      "title": "Go for low impact (Yoga/Pilates).",
      "content": "Go for low impact (Yoga/Pilates). Although low impact exercises will not burn as many calories, they can still be beneficial if you’re trying to get skinny. Things as simple as stretching keep your metabolism boosted throughout the day and burns extra calories while you do it. Look up local classes offered in your area. Many places will give you free first sessions to see if the class is something you’re interested in before buying a package. If you don’t have time to get to a class, buy a fitness program. You can find top rated DVDs on Amazon.com."
    },
    {
      "title": "Find an accountability partner.",
      "content": "Find an accountability partner. Find someone who you can count on to share you triumphs and tribulations with. This process doesn’t happen overnight and having someone to discuss it with will help you get super skinny. Make it count. Be sure your accountability partner is someone you are comfortable with and someone who will be honest with you. It will only make the process harder if you aren’t open with them. Find someone who can relate. If possible, find an accountability partner who is also trying to lose weight or has done so in the past. It will be much easier to relate to them if they are going through the same thing you are."
    },
    {
      "title": "Make mini goals.",
      "content": "Make mini goals. Weigh yourself at least once a week if not more. These mini goals will help keep you on track and make you aware of any changes you might have to make. Keep it consistent. Each time you check your weight, do so with consistency. This means if you first weigh yourself when you first wake up, do so at the same time for every weight-check. [4] X Research source Keep mini goals written down. Use rewards, as mentioned in Method 1, to keep you focused."
    },
    {
      "title": "Make monthly goals.",
      "content": "Make monthly goals. Each month, be sure that you’re reaching the weight you want to reach. From here, make adjustments as necessary. Learn your body. If you aren’t seeing the changes that you want, don’t be afraid to make adjustments. Not everyone has the same body, so no everyone’s body reacts the same to diet and exercise. Change it up. Weight loss is likely to hit a plateau if you don’t change it up. It doesn’t mean that you’ve been doing the wrong thing—just that your body has adjusted to your new lifestyle. So change it again, and surprise your body into losing more weight. [5] X Research source"
    }
  ]
}