{
  "url": "https://www.wikihow.com/Get-Drunk-Fast",
  "title": "How to Get Drunk Faster: Best Ways",
  "steps": [
    {
      "title": "Consume beers, wines, and ciders with a higher percentage of alcohol.",
      "content": "Consume beers, wines, and ciders with a higher percentage of alcohol. Different beers, ciders, and other hard drinks have different alcohol content. You can usually see the alcohol content on the side of a bottle. A higher percentage means the drink is likely to get you drunk faster. [2] X Research source Look for beers with 15-18% alcohol for the quickest buzz. They may come from smaller, more independent breweries as opposed to larger companies. Even beers with around 7-11% alcohol content are quite potent. If you can't find something in the 15-18% range, see if you can find anything at around 11% alcohol. Remember your limits. A few strong beers can really set you over the edge. Slow down the pace of you're drinking when you feel buzzed. If you start to feel dizzy or sick, this is a sign you need to stop drinking."
    },
    {
      "title": "Drink hard liquors and mixed drinks instead of beer.",
      "content": "Drink hard liquors and mixed drinks instead of beer. Hard liquors can get you drunk faster than beer or wine, as they have a higher alcohol content. Doing shots can be particularly useful, as you'll be absorbing high alcohol products very fast. It’s not that hard liquors get you drunker than beer per se, just that you don’t have to drink as much liquid to catch a buzz so people tend to drink more. [3] X Research source Keep in mind, depending on the bar, drinks will be stronger or weaker. Some bartenders may, for example, give you considerably more than a single serving of liquor in a mixed drink. You can also ask for a double of something. This gets you two shots of hard liquor in a single drink. Liquor has a very high alcohol content. Overdoing it on liquor can land you sick. Try to stick to only one or two hard drinks."
    },
    {
      "title": "Opt for a diet mixers paired with hard liquors.",
      "content": "Opt for a diet mixers paired with hard liquors. Mixing spirits with diet mixers, like diet soda, gets you drunk faster. This may be because regular sodas are recognized as food, slowing down the body's absorption of alcohol. The body may not treat diet soda as food, allowing the alcohol to be absorbed quicker. [4] X Research source People do not necessarily notice they're getting drunk faster when mixing spirits with diet mixers. If you're mixing liquor with diet soda, make sure to be aware you may be drunker than you realize."
    },
    {
      "title": "Count your drinks!",
      "content": "Count your drinks! Drinking a safe amount requires tracking just how much you drink. Keep track of how many beers, glasses of wine, shots, or cocktails you’ve had. This way, you can cross-check your number of drinks against how you’re feeling to determine whether or not you’re over your limit. [5] X Research source A good way to count drinks is to just text yourself every time you get a drink and include what the drink is. This way, you can track the type of drink and when you ordered it based on the timestamp."
    },
    {
      "title": "Eat a meal at least 1-2 hours before you start drinking.",
      "content": "Eat a meal at least 1-2 hours before you start drinking. You should never drink on an empty stomach. This is very dangerous. However, do not eat a huge meal before a night of drinking . Food slows down your body's ability to absorb alcohol. If you start drinking just after a large meal, it may take you longer to get drunk. [6] X Research source Have a light meal a few hours before drinking. Go for something like a salad with chicken, a light sandwich, a serving of fish, or a small serving of pasta."
    },
    {
      "title": "Drink with other people around to ensure you stay safe.",
      "content": "Drink with other people around to ensure you stay safe. If you're drinking with friends, you're more likely to drink fast. People finish their drinks quicker when in a large group. Drinking faster gets you drunk quicker, and also increases the amount you'll drink throughout the night. All of this can result in achieving a greater buzz faster and you’ll have people looking out for you while you do it. [7] X Research source Be sure to still track your drinks. It's easy to accidentally overdo it when drinking in a group, especially if you're around people with a higher alcohol tolerance. Be aware of how you're feeling when you drink. If you start feeling uncomfortable, it's time to stop even if your friends want to drink more."
    },
    {
      "title": "Check your medications before drinking.",
      "content": "Check your medications before drinking. Alcohol can interfere with certain medications. If you're going to be getting drunk, check the labels of all your medications. Make sure they do not interact poorly with alcohol. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Avoid taking painkillers after a night of drinking. These can interact poorly with alcohol and cause damage to your liver and other organs. Painkillers with acetaminophen can be particularly dangerous. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Know (or learn) your limits when it comes to alcohol.",
      "content": "Know (or learn) your limits when it comes to alcohol. If you want to get drunk fast, you need to know your limits so you can avoid getting sick. Always be aware of how much you can drink and keep yourself in check. You want to remain in control of the situation, even if you're drunk. This can be harder to do if you're attempting to get drunk fast. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You may know your limits from previous experiences drinking. For example, you know you start to feel sick and lose memory around the four-drink mark. If you're new to drinking, you may be unsure of your limits. If you start to feel physically ill, or very dizzy, this is a sign you should stop. You can also ask a friend to look out for you, and let you know when you seem to be losing control. If you feel yourself becoming very inebriated, take a break for a bit. You don't need to keep chugging alcohol all night to keep your buzz going. Stop drinking once you feel drunk."
    },
    {
      "title": "Never drink on a completely empty stomach.",
      "content": "Never drink on a completely empty stomach. Many people avoid food before drinking in order to get drunk faster. This is never a good idea. Always eat something, even something small, prior to drinking. You could also snack throughout the night. Go for high protein foods, like nuts or cheeses. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Reader Poll: We asked 191 wikiHow readers, and 63% agreed that the best way to prepare when going out drinking is to eat well beforehand . [Take Poll]"
    },
    {
      "title": "Remember:",
      "content": "Remember: beer before liquor, never been sicker. This common adage is good advice. While 0.01% BAC of liquor is identical to 0.01% BAC of beer, people tend to drink beer slower. This means that the alcohol takes longer to kick in. As a result, if you have 2-3 beers you may not “feel it” completely for 1-2 hours. Adding shots to that will radically and dangerously impact how quickly you get drunk. [12] X Research source “Liquor before beer, you’re in the clear” is the reverse. If you drink the stuff that hits you quickly first, you’ll have a more accurate sense for how drunk you’re going to be when you switch to beer. You’re also likely to drink beer more slowly if you already have a buzz."
    },
    {
      "title": "Strive for moderation.",
      "content": "Strive for moderation. Getting drunk once in awhile can be fun, especially in a social event. However, in the long run, alcohol abuse can cause damage to your overall health. During most events, stick to one or two drinks. This will keep you safe and healthy. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Tolerance Level",
      "content": "Tolerance Level Perhaps more than any other factor, how much you’ve drank in the past will determine how quickly the alcohol impacts you. If you do not have experience drinking alcohol, take it extremely slowly so that you can monitor how long it takes for a drink to hit you. [14] X Research source A tip from experienced drinkers: You’ll start feeling a drink after about 5 minutes, but it can take up to 30 minutes for the alcohol from a drink to fully cycle through your liver. [15] X Research source As a result, it’s best to stick to one drink an hour to give your body time to process what you drink. [16] X Research source"
    },
    {
      "title": "Age",
      "content": "Age Unless you drink periodically, your sensitivity to alcohol will increase as you age. So, someone who has never drank and starts at 25 will have an easier time processing alcohol than someone who starts at 45. [17] X Research source As a warning, alcohol abuse becomes increasingly worse for your body as you age. The older you are, the worse getting drunk is for your health."
    },
    {
      "title": "Gender",
      "content": "Gender Women technically absorb alcohol a lot faster than men do, although this is likely just due to the differences in average weight between men and women. This is why the National Center for Health Promotion and Disease Prevention have different drink recommendations for men and women. [18] X Research source Ideal recommendations: Women should have no more than one drink a day. Men should have no more than two drinks a day. Binge drinking limits: For women, more than four drinks in a day is considered binge drinking, while it’s five drinks for men. How much is “one” drink? Physiologically, “one” drink counts as one 12 ounce beer, 8-9 ounces of malt liquor, a 5 ounce glass of wine, or a 1.5 ounce pour of hard liquor."
    },
    {
      "title": "Race",
      "content": "Race Your ethnic background appears to have some impact on how your body processes alcohol. Generally speaking, people of East Asian, Native American, and North African descent tend to have a harder time processing alcohol. [19] X Research source"
    },
    {
      "title": "Physical Condition",
      "content": "Physical Condition The healthier you are physically, the easier time your body will have processing alcohol. Someone who is at a healthy BMI will have a smoother experience with alcohol than someone who doesn’t. Your sleep hygiene, hydration level, and body absorption rates will all also have an impact. [20] X Research source"
    },
    {
      "title": "Stomach Contents",
      "content": "Stomach Contents Alcohol’s effects will be more pronounced if you drink on an empty stomach and/or don’t drink any water. You’re also more likely to feel sick if you drink without any food or water in your system, and you can become dehydrated very quickly. [21] X Research source A tip from experienced drinkers: Drink a little water in between each drink you consume if you’re going to drink for a prolonged period of time. You’ll still catch a buzz, but you won’t feel sick to your stomach the next day."
    },
    {
      "title": "Speed of Drinking",
      "content": "Speed of Drinking This one is a bit obvious—the faster you drink, the faster the alcohol will hit you. Give each drink you consume about an hour to fully kick in. [22] X Research source"
    },
    {
      "title": "Drugs and Medications",
      "content": "Drugs and Medications Other substances (like opioids or marijuana) can radically increase the effects of alcohol on your system. Many prescription medications will modify how your body processes alcohol, too. [23] X Research source Key safety tip: If you’re on any kind of medication and you haven’t already talked to your prescriber regarding alcohol, talk to them before you pick up drinking."
    },
    {
      "title": "Genetics",
      "content": "Genetics Some people just seem to naturally have different tolerance levels based on their lineage. If your ancestors were all heavy drinkers, you’re likely to have an easier time processing alcohol. You’ll also be more likely to abuse alcohol though, so keep a tab on your drinking habits if alcoholism runs in your family ."
    },
    {
      "title": "Early Sobriety & Getting Buzzed",
      "content": "Early Sobriety & Getting Buzzed Sobriety will lead to a general calmness as you consume a drink. You’ll still have all of your wits about you and you should feel “normal.” [24] X Research source Blood alcohol content (BAC): 0.01-0.05% How many drinks you need to reach this level: 0-1 an hour. Potential signs you’re this drunk: A light warm feeling or a general sense of calm."
    },
    {
      "title": "Buzzed Euphoria",
      "content": "Buzzed Euphoria You’re generally buzzed once you consume more than one drink in under an hour or so (unless your tolerance is higher). This is generally what people refer to as “tipsy.” [25] X Research source Blood alcohol content (BAC): 0.03-0.08% How many drinks you need to reach this level: More than 1-2 in under 1-2 hours. Potential signs you’re this drunk: Giddiness, a heavier warm feeling, general joy, euphoria, and minor trouble with fine motor skills or complex ideas."
    },
    {
      "title": "Drunk Excitement",
      "content": "Drunk Excitement After 0.08 BAC, you’re legally drunk. At this stage you’re likely noticeable intoxicated to those around you. [26] X Research source Blood alcohol content (BAC): 0.08-0.25% How many drinks you need to reach this level: 2-5 drinks every 1-2 hours. Potential signs you’re this drunk: Minor vision impact, trouble balancing, tiredness, nausea, emotional issues, mood swings, and increased impulsivity."
    },
    {
      "title": "Drunk Confusion",
      "content": "Drunk Confusion If you continue to drink, any excitement and joy is likely to bleed into more overwhelming and confusing feelings. At this stage, you may not feel as much pain as you normally do, which can lead to seriously dangerous situations. [27] X Research source Blood alcohol content (BAC): 0.2-0.3% How many drinks you need to reach this level: 4-5 drinks every 1-2 hours. Potential signs you’re this drunk: Trouble moving, difficulty standing, general confusion, loss of memory, emotional outbursts, and a diminished feeling of pain."
    },
    {
      "title": "Drunk Stupor",
      "content": "Drunk Stupor This is where your health is at serious risk. At this stage, you begin to lose control of your body and you’re likely to vomit. [28] X Research source Blood alcohol content (BAC): 0.25-0.45% How many drinks you need to reach this level: More than 6 drinks in 2-3 hours. Potential signs you’re this drunk: “Blacking out,” inability to walk or move, vomiting, trouble talking, difficulty staying still, cold sweats, total loss of sensation, and skin changes. Some people are prone to seizures at this level."
    },
    {
      "title": "Dangerously Intoxicated",
      "content": "Dangerously Intoxicated If more alcohol is consumed, you may die or end up in a coma. Alcohol is a poison, and consuming this much can lead to life-altering outcomes. [29] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Blood alcohol content (BAC): >0.40% How many drinks you need to reach this level: More than 6-8 drinks in 2-4 hours. Potential signs you’re this drunk: Loss of consciousness, trouble breathing, loss of gag reflex, self-urination, coma, and eventually, death."
    }
  ]
}