{
  "url": "https://www.wikihow.com/Get-Faster-at-Running",
  "title": "How to Get Faster at Running",
  "steps": [
    {
      "title": "Stretch before you run.",
      "content": "Stretch before you run. Stretching is an important part of almost any exercise routine. Running is no exception. When you stretch, you're warming up the muscles in your body and getting them pumped up for the hard work that you're about to do. One good stretch is called \"the Stork.\" Stand up straight. Bring one foot up behind you toward your bottom. Gently grab it with one hand (you can support yourself against a wall with your other hand if necessary). Put light tension on your leg until you feel a stretch in your quadriceps (the front of your thigh). Hold for 30 seconds, then repeat with the other leg. [1] X Research source Focus on stretching your hips, hamstrings, quads, and calves. [2] X Expert Source Francisco Gomez Athletic Trainer Expert Interview. 24 October 2019."
    },
    {
      "title": "Give yourself a chance to warm up.",
      "content": "Give yourself a chance to warm up. Before you run, speed up your heartbeat and get your blood pumping by taking a two-minute jog. You'll get a slight boost of energy and it will be easier to focus on running quickly. As long as your warmup isn't too intense, you won't be too tired to give your run your best effort."
    },
    {
      "title": "Practice consistently.",
      "content": "Practice consistently. For most runners, going on a run every day or every other day is best. The key here is consistency . To see long-term results, you need to stick to your exercise schedule and slowly ramp up the difficulty over time. If you quit or fail to challenge yourself, your performance may plateau or even decrease. [3] X Research source"
    },
    {
      "title": "Use interval training to build speed and endurance.",
      "content": "Use interval training to build speed and endurance. Take 10 minutes each day for an interval run. As you run, follow this pattern: sprint for 10 seconds, then rest by jogging for a minute. Repeat for 10 minutes. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To challenge yourself, every week add a few seconds to your sprinting time and shorten your breaks. Over time, you will be able to run faster and longer."
    },
    {
      "title": "Invite friends to run with you.",
      "content": "Invite friends to run with you. Try competing with a friend slightly faster than yourself. It will give you the motivation of winning, and it will be much more challenging than running by yourself or with someone slower than you. Don't run with someone much faster than you, or you might consider giving up."
    },
    {
      "title": "Use good running form.",
      "content": "Use good running form. Adopt a proper running posture, keeping your back straight and swaying your arms held in a 90-degree angle at the elbow. Run on the balls of your feet, using them to spring off with every step. [5] X Research source Try pushing your legs further back to give yourself a longer stride. You will get a better grip of the ground and allow yourself to bounce off the ground, and it gives you an extra boost in every step. If you ever watch Olympic sprinters, you'll notice that they almost always have very long strides. Your upper body is important too. Put a bend in your arms and pump them up and down sharply with each step. Leave your palms open, with fingers together as if you were stabbing the air. This should help you force yourself forward more easily."
    },
    {
      "title": "Use a sustainable breathing pattern.",
      "content": "Use a sustainable breathing pattern. While you run, you want to be taking in enough oxygen that you can maintain a light conversation. If you can't, you're likely to run out of steam and you'll have to slow down. Deep, steady breathing will help you run more quickly in the long term. [6] X Research source Some people breathe in through their noses for three seconds and exhale for two. See what you're comfortable with — one person's breathing style may not be best for everyone."
    },
    {
      "title": "Give yourself a time goal.",
      "content": "Give yourself a time goal. Use a stopwatch to time yourself every running session. Each time, try to go just a little bit faster on the same route. The added incentive will help you push yourself to the max. Just before you reach your goal, even if it seems impossible, try to force as much power out of your body as you can and put out a burst of speed. You may be surprised by how fast you can actually go when you know you're about to reach your goal. This can improve your time drastically."
    },
    {
      "title": "Keep your eyes on the prize (literally).",
      "content": "Keep your eyes on the prize (literally). Even something as simple as changing the way you look ahead can make you a better runner. Try to focus your eyes on where you want to go, rather than on the area right in front of your feet. Keep focusing on new spots further down the path as you move — you won't ever feel like you're almost done, so you won't give up as easily. For example, if you're running on a straight track and you're coming to the end, try focusing on a spot far ahead of the finish line and push yourself to run there. This can help keep your motivation high until it's actually time to quit."
    },
    {
      "title": "Hydrate!",
      "content": "Hydrate! If you're not meeting your biological needs, you'll have a harder time running as fast as you can. Taking a small drink of water before your run ensures your muscles have the water they need when it counts. It's also a good idea to carry a little water with you so you can take drinks as needed during your run. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There is such a thing as too much water, however. Don't drink a ton of water right before running. Drink small amounts as you go, but try not to take big gulps. This will give you cramps."
    }
  ]
}