{
  "url": "https://www.wikihow.com/Edit-the-Table-of-Contents-in-Word",
  "title": "How to Create and Edit the Table of Contents in Word",
  "steps": [
    {
      "title": "Format the headings of each section of your document.",
      "content": "Format the headings of each section of your document. Word's table of contents builder automatically generates a table of contents based on the headings in your document. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source This means each section that you want represented in your table of contents must have a properly-formatted heading. If a section should appear as a primary section in the table of contents, select its heading, click the Home tab, and then select Heading 1 on the \"Styles\" panel. To add a sub-section to the primary section in the table of contents, give that section a Heading 2 header: Select its heading and choose Heading 2 from the Styles section. You can also use Heading 3, Heading 4, etc., to add even more pages to your table of contents. Make sure any page you want to include in the table of contents has a heading."
    },
    {
      "title": "Click the location where you want to insert the table of contents.",
      "content": "Click the location where you want to insert the table of contents. Typically this will be at the beginning of your document."
    },
    {
      "title": "Click the References tab.",
      "content": "Click the References tab. It's at the top of Word. [2] X Research source"
    },
    {
      "title": "Click Table of Contents on the toolbar.",
      "content": "Click Table of Contents on the toolbar. It's at the upper-left corner of Word. A list of Table of Contents styles will expand. [3] X Research source"
    },
    {
      "title": "Select an automatic style template.",
      "content": "Select an automatic style template. Several style options appear for your table of contents—choose one of the suggested styles to get started. Once selected, this will add a table of contents that lists the page numbers for each of your formatted sections. [4] X Research source"
    },
    {
      "title": "Click the References tab.",
      "content": "Click the References tab. It's at the top of Word. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Use this method if you've made a change (changing a heading, adding/removing pages) to your document and need to update the table of contents to reflect that change. The only way to change the name of a section on the table of contents is to change the name of the corresponding header in the document."
    },
    {
      "title": "Click Update Table on the \"Table of Contents\" panel.",
      "content": "Click Update Table on the \"Table of Contents\" panel. It's in the upper-left corner. Two options will appear. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select an update option.",
      "content": "Select an update option. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Select Update page numbers only if you want to refresh the page numbers without applying any changes you've made to the headings. Select Update entire table to apply all heading and page number changes."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The table of contents is now up-to-date."
    },
    {
      "title": "Click the References tab.",
      "content": "Click the References tab. It's at the top of Word. [8] X Research source"
    },
    {
      "title": "Click Table of Contents on the toolbar.",
      "content": "Click Table of Contents on the toolbar. It's at the upper-left corner of Word. A list of Table of Contents styles will expand."
    },
    {
      "title": "Click Custom table of contents on the menu.",
      "content": "Click Custom table of contents on the menu. This opens the Table of Contents dialog box. [9] X Research source"
    },
    {
      "title": "Adjust your general preferences.",
      "content": "Adjust your general preferences. The \"Print Preview\" box at the upper-left corner shows you how the printed table of contents will appear, while the \"Web preview\" box displays how it will look on the web. [10] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Use the checkbox next to \"Show page numbers\" to show or hide page numbers. If you just want to hide page numbers on the web version of the table of contents, check the box next to \"Use hyperlinks instead of page numbers.\" Use the checkbox next to \"Right align pages numbers\" top adjust the alignment. To change the style of the line or pattern that separates the heading title and the page number, make your selection from the \"Tab leader\" menu. To choose another theme, select something from the \"Format\" menu. To adjust how many heading levels are displayed in the table, select an option from the \"Show levels\" menu (the default is 3)."
    },
    {
      "title": "Click the Modify button.",
      "content": "Click the Modify button. It's in the lower-right corner of the window. This is where you can change the properties of the text on the table of contents page. [11] X Research source If you don't see this button, click the \"Formats\" menu and select From template . It should appear then."
    },
    {
      "title": "Select a style and click Modify.",
      "content": "Select a style and click Modify . The styles you can change appear in the \"Styles\" box on the left side of the window. When you click a style (e.g., TOC 1 ), you'll see the font size, spacing, and other details—clicking Modify allows you to change these details. [12] X Research source"
    },
    {
      "title": "Make your changes and click OK.",
      "content": "Make your changes and click OK . You can choose different fonts, alignments, colors, and numerous other details for each selected style. Alternatively, you can keep the defaults, which come from the table of contents template you selected. [13] X Research source"
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The style changes you've made will apply to your table of contents immediately. [14] X Research source"
    }
  ]
}