{
  "url": "https://www.wikihow.com/Get-Rid-of-Bushy,-Wavy-Hair",
  "title": "How to Get Rid of Bushy, Wavy Hair",
  "steps": [
    {
      "title": "Use a cream hydrator as a styling product to lock in moisture.",
      "content": "Use a cream hydrator as a styling product to lock in moisture. After shampooing and conditioning, apply a cream hydrator from the roots of your hair to the tip. Warm the product between your palm and fingers and wrap your curls around your fingers to shape them. [2] X Research source If you have a hair diffuser attachment for your blow dryer, use it to dry your hair. Set it for a low speed and point it away from your roots to keep from frizzing your hair. [3] X Research source You could also use an anti-frizz serum. Just apply it from about 1 ⁄ 4 in (0.64 cm) from your scalp all the way down to the ends of your hair."
    },
    {
      "title": "Protect your hair from heat.",
      "content": "Protect your hair from heat. Blow drying too often can damage your hair and lead to unnecessary frizz. You can protect your hair by purchasing a heat protecting spray. If you want to make your hair straight and smooth, wait until your hair is about 75% dry, then blow dry it with a brush or comb attachment. For curlier hair, use a diffuser and start blow drying while your hair is still wet. [4] X Expert Source Shun Pittman Master Cosmetologist, Global Salon Educator & Author Expert Interview. 2 December 2021. Try drying just the ends of your hair to add more volume near your scalp. [5] X Expert Source Shun Pittman Master Cosmetologist, Global Salon Educator & Author Expert Interview. 2 December 2021."
    },
    {
      "title": "Avoid products with isopropyl alcohol.",
      "content": "Avoid products with isopropyl alcohol. A lot of styling products like hairspray contain alcohol because it helps the product dry faster once it's on your hair. That's not necessarily a bad thing! But if you're struggling with dry or frizzy hair, you may do better choosing products that don't contain isopropyl alcohol. [6] X Expert Source Shun Pittman Master Cosmetologist, Global Salon Educator & Author Expert Interview. 2 December 2021. Not all alcohols are bad for your hair! Some alcohols, like cetyl and stearyl alcohol, are actually derived from fats, and are essential for creamier curl-friendly products."
    },
    {
      "title": "Put an egg in your hair.",
      "content": "Put an egg in your hair. Crack an egg in a bowl and mix it with a little cool water. Massage it into your scalp and let it sit for around 20 minutes before shampooing it out of your hair. Eggs contain lots of protein and fat making them natural moisturizers. For especially brittle hair, use more egg yolk than white for your rinse. You can do an egg rinse about once a month. [7] X Research source Make sure you shampoo and rinse with cool water. Otherwise, you'll cook the egg into your hair. [8] X Research source"
    },
    {
      "title": "Rinse your hair with apple cider vinegar.",
      "content": "Rinse your hair with apple cider vinegar. Mix 1-2 tablespoons of apple cider vinegar with 1 cup of water. Start with a small dose of vinegar and work your way up until you find what works for your hair. After shampooing, rinse your hair with the vinegar mixture. Then, follow up with a frizz-fighting styling product. [9] X Research source Massage the mixture into your scalp and let it sit for a few minutes for the best results. [10] X Research source Try doing this once or twice a week to keep your hair healthy. Apple cider vinegar can also help balance your hair's pH as well as treat dandruff and an itchy scalp. [11] X Research source Apple cider vinegar is a good clarifying treatment for removing buildup on your hair, but it can promote frizz. That's why it's important to follow up with a styling product. [12] X Expert Source Shun Pittman Master Cosmetologist, Global Salon Educator & Author Expert Interview. 2 December 2021."
    },
    {
      "title": "Make an avocado hair mask.",
      "content": "Make an avocado hair mask. For added protection against frizzy hair and split ends, make a hair mask. Mix one avocado with 2 tablespoons of coconut oil and make a paste. Apply the mixture to your hair and let it sit for about 30 minutes before you shampoo and condition your hair. You can try adding other ingredients to the mask for more moisturizing power. Add 1-2 tablespoons of eggs, sour cream, or even mayonnaise. Play around with the combinations and find what works best for you. [13] X Research source Another method is using a combination of bananas and honey. Take one ripe banana, 2 tablespoons of olive oil, and 1 tablespoon of honey and blend them together. As with the avocado, work it into your hair and let it sit for half an hour before shampooing."
    },
    {
      "title": "Use coconut oil to fight frizz.",
      "content": "Use coconut oil to fight frizz. Warm up as much coconut oil as you need to cover your scalp. Massage the warm oil into your hair and let it sit anywhere between 20 and 40 minutes. The coconut oil will condition your hair and scalp, and may reduce frizzy hair."
    },
    {
      "title": "Make your own conditioner with coconut milk and lime.",
      "content": "Make your own conditioner with coconut milk and lime. Coconut and lime both have lots of vitamins and minerals that improve hair health. Making your own conditioner requires a little cooking, but may be worth your while. Whisk together 1 can of coconut milk and 2 tablespoons of olive oil in a saucepan over medium heat. Add 4 tablespoons of lime juice and 2-3 tablespoons of cornstarch. Whisk constantly. The cornstarch will thicken the mixture until it resembles conditioner. Add more cornstarch if the mixture seems too thin. [14] X Research source Allow the mixture to cool and then work the conditioner into your hair. Work in sections and make sure every strand is covered. [15] X Research source Cover your hair with a plastic cap and sit under a hooded dryer. If you have access to a heat thermal cap, you could use that instead. Let the treatment sit for 30 minutes before rinsing and shampooing your hair. [16] X Research source Try this variation for a natural detangler. Mix the following ingredients until smooth: 1 cup of coconut milk, 1 tablespoon of coconut oil, 1 tablespoon of olive oil, and 1 cup of plain non-fat yogurt. Apply the mixture to your hair, working in sections. Cover your hair and wait 45 minutes before rinsing. [17] X Research source"
    },
    {
      "title": "Shampoo a minimum of once a week.",
      "content": "Shampoo a minimum of once a week. Instead of shampooing your hair every day, try shampooing every two or three days. Shampooing too often removes the natural oils in your hair and leads to frizz. Try switching shampoos. Look for something with glycerin near the top of the ingredient list. Glycerin protects the hair and moisturizes it from the inside out, both of which can fight frizz. [18] X Research source Look for a shampoo that is sulfate free. Sulfates are foaming agents used in a lot of shampoos. While sulfates are not necessarily bad for your hair, some people find them harsh. You might find that a milder shampoo helps keep the frizz down. [19] X Research source If you can't bear the thought of dirty hair after a few days without washing, try using a dry shampoo."
    },
    {
      "title": "Use conditioner.",
      "content": "Use conditioner. Each time you wash be sure to apply conditioner. Conditioner protects your hair, keeping it from pulling moisture from the air. For the best results leave it in for at least 5 minutes (following the manufacturer's instructions). Search for a conditioner that has glycerin and other hydrating ingredients in it. Shea butter is common, as is coconut oil. [20] X Research source Some conditioners have protein in them, which help tame frizz and add to your hair's shine. [21] X Research source If you have curly hair, try co-washing, where you skip the shampoo and only use conditioner on your hair. Do this a few days a week to prevent over-drying the ends of your hair , or using only conditioner on your hair. [22] X Research source"
    },
    {
      "title": "Avoid roughly towel drying your hair.",
      "content": "Avoid roughly towel drying your hair. Roughly towel drying your hair can keep your hair from lying flat, contributing to frizz. Try pressing your hair dry with a microfiber towel. After pressing the water out of your hair, wrap your hair in a towel. Lean over and let your curls fall into a towel. Wrap the towel around your hair and then pull it up as if it were a turban. Leave your hair like this for at least 20 minutes to add some shape to your curls and keep your hair from frizzing. [23] X Research source"
    },
    {
      "title": "Brush your hair with your fingers.",
      "content": "Brush your hair with your fingers. You may find it better to separate tangles and knots in your hair with your fingers than with a brush. Brushes tend to break your hair and that leads to frizz. [24] X Research source After your shower, add a little leave-in conditioner to your fingers as you work your hair. [25] X Research source Don't use a comb or styling brush on dry hair. If you need to tend to your hair when it's dry, just wet your hands and start finger-combing. [26] X Research source"
    }
  ]
}