{
  "url": "https://www.wikihow.com/Get-8-Pack-Abs",
  "title": "How to Get 8 Pack Abs",
  "steps": [
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. Before beginning any attempts to get 8 pack abs, you should consult a medical professional. This is especially important if you suffer from preexisting medical conditions like a heart condition or chronic back pain. Your doctor will help you figure out what types and intensities of abdominal exercises are right for you."
    },
    {
      "title": "Do 2 ab workouts each week.",
      "content": "Do 2 ab workouts each week. In order to get 8 pack abs, you will need to dedicate yourself to a workout regimen. Aim for 2 abdominal strengthening sessions each week. Each session can be anywhere from 15 to 30 minutes long. Make sure you take a couple of rest days in between ab workouts so your muscles have time to recover. [1] X Expert Source Monica Morris ACE Certified Personal Trainer Expert Interview. 18 November 2019. Try fitting in your ab workouts after doing 30 minutes of cardio like spinning, running, or hiking."
    },
    {
      "title": "Aim for 2-3 cardio sessions a week.",
      "content": "Aim for 2-3 cardio sessions a week. It is important that you are supplementing your abdominal workouts with cardio. This will help you burn calories and create a calorie deficit which will, in turn, help you burn body fat. Aim for 2-3 30 minute cardio sessions a week such as running, spinning, or Zumba. [2] X Research source"
    },
    {
      "title": "Do traditional crunches",
      "content": "Do traditional crunches . Crunches can firm and strengthen your abdominal muscles, and help you get an 8 pack. [3] X Expert Source Monica Morris ACE Certified Personal Trainer Expert Interview. 18 November 2019. Lie with your back on the floor, knees bent, and feet flat on the floor. Cross your arms over your chest and lift your shoulders toward the ceiling using your abdominal muscles. [4] X Research source Repeat the crunch 15-20 times, and then do a second set of traditional crunches. Rest for 30 seconds between sets. Try to exhale slowly for 5 seconds as you're coming up and inhale slowly for 5 seconds while you're coming down. Slow, controlled crunches will be more effective. [5] X Expert Source Monica Morris ACE Certified Personal Trainer Expert Interview. 18 November 2019."
    },
    {
      "title": "Try side crunches",
      "content": "Try side crunches . Prepare as though you were going to do a traditional crunch. Instead of lifting both shoulders off the ground at the same time, lift one shoulder at a time toward the opposite knee. Alternate sides until you complete the crunches. [6] X Research source Do 2 sets of 15-20 crunches each."
    },
    {
      "title": "Use a bench for crunches.",
      "content": "Use a bench for crunches. You can mix up your crunches by taking advantage of a flat bench at the gym or in your own home. Lie on the floor and put your legs up on the bench so that the backs of your knees are nearly touching the bench’s edge. With your hands behind your ears, crunch forward. [7] X Research source Complete 2 sets of 15-20 bench crunches. Rest for 30 seconds between sets. Reader Poll: We asked 331 wikiHow readers for their favorite ab workout to target and strengthen core muscles, and only 11% of them said bird dogs. [Take Poll] However, bird dogs are great for working your core when you have back pain. So if crunches are hurting your back, try switching to bird dogs."
    },
    {
      "title": "Lie on a bench.",
      "content": "Lie on a bench. You will need a flat bench to perform this exercise. Lie flat on the bench. Make sure your legs are parallel to the floor and that the ends of your legs are off the bench. [8] X Research source If you do not have a bench, you can lie on a mat or towel on the floor."
    },
    {
      "title": "Position your hands.",
      "content": "Position your hands. Next you will need to place your hands on both sides of your head. Grab the top edge of the bench with your hands. You will continue holding on to the top of the bench while you do the leg raises. [9] X Research source If you are lying on the floor, keep your hands beside your hips."
    },
    {
      "title": "Use your abs to raise your legs.",
      "content": "Use your abs to raise your legs. While keeping your legs as straight as you can, use your abdominal muscles to slowly raise your legs. Raise your legs as high as is possible, while making sure your back is completely flat on the bench. Slowly lower your legs down to the start position. [10] X Research source Repeat 20 times, and then do a second set of 20 leg raises. You can also do 3 sets of 10 leg raises each."
    },
    {
      "title": "Prepare your workout space.",
      "content": "Prepare your workout space. Grab an exercise mat and place it on a hard flooring surface like tile, wood, or linoleum. Alternatively, you can place a towel on a carpeted or hard floor. Make sure you will have enough room to fully extend your legs on the towel or mat. [11] X Research source You can also do knee-ins while seated on the edge of a flat bench."
    },
    {
      "title": "Sit on the mat or towel.",
      "content": "Sit on the mat or towel. Sit on the floor with your legs and knees extended in front of you. Your legs should be straight and your toes pointing toward the ceiling. Make sure your toes and knees are aligned in a straight line. Place your hands under your buttocks."
    },
    {
      "title": "Bring your knees to your chest.",
      "content": "Bring your knees to your chest. Slowly bring your knees to your chest while keeping your legs together. Then slowly extend your legs back to your starting position. Make sure your back remains straight while you are doing the knee-ins. Repeat 12 to 15 times, and then do a second set of seated knee-ins. You can also do 3 sets of 10 knee-ins each."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. As you build and tone muscle, it is important that you keep your body hydrated. Begin each day with 8-16 ounces (0.2-0.5 liters) of water. Throughout the day make sure you are consuming water regularly, aiming for at least 64 ounces (2 liters) each day. [12] X Research source"
    },
    {
      "title": "Eat a balanced diet.",
      "content": "Eat a balanced diet. Good nutrition is an important part of getting 8 pack abs. Make sure your diet includes lots of fresh fruits and vegetables, lean proteins, and whole grains. Try to get at least 20% of your calories from high quality protein sources like dairy products, fish, poultry, grass fed beef, organic soy, and protein-rich vegetables like beans, peas, nuts, and seeds. Stay away from fried foods, processed foods, and sugar."
    },
    {
      "title": "Start each day with breakfast.",
      "content": "Start each day with breakfast. Aim for a breakfast that contains at least 250 calories but ideally no more than 500 calories. Try to eat within an hour of waking up each morning. Great breakfast options include Greek yogurt with berries and granola, scrambled eggs with fruit and whole wheat toast, or oatmeal with a scoop of whey protein. [13] X Research source"
    },
    {
      "title": "Avoid happy hour.",
      "content": "Avoid happy hour. Drinking alcohol can slow down your metabolic process, which can make it difficult to strip away the fat covering your 8 pack. Alcohol can also increase your appetite, which can lead to consuming more calories than you are burning. [14] X Research source"
    }
  ]
}