{
  "url": "https://www.wikihow.com/Develop-a-Slightly-Raspy-Singing-Voice",
  "title": "How to Develop a Slightly Raspy Singing Voice",
  "steps": [
    {
      "title": "Warm up your voice",
      "content": "Warm up your voice . Before you attempt to sing in a slightly raspy voice, you should warm up appropriately. Try starting with breathing exercises, and then move on to scales. After that you can continue warming up with trills and hums."
    },
    {
      "title": "Tense your neck while singing.",
      "content": "Tense your neck while singing. A raspy sound occurs when there is incomplete contact between vocal chords. You can get a raspy singing voice by tensing your neck and exuding a lot of air as you sing. This will prevent your vocal chords from coming into complete contact and result in a slightly raspy singing voice. It is okay to sing or record a couple of songs with this technique, but you should not sing or record an entire album or concert as this can cause long-term damage to your vocal chords."
    },
    {
      "title": "Imitate a coughing sound for lower range vocals.",
      "content": "Imitate a coughing sound for lower range vocals. If you are singing near the bottom of your vocal range, you can combine your singing voice with the edginess of a cough. Try coughing a few times. Notice the grinding deep in your throat that is responsible for the cough. Now recreate this grinding as you sing. [1] X Research source"
    },
    {
      "title": "Use your saliva.",
      "content": "Use your saliva. One way to produce a raspy voice is to create a significant amount of saliva and/or phlegm in the back of your throat.Then begin singing in a growl-like voice. Tighten the muscles in your throat just enough so that the airflow is restricted by the phlegm. Your throat should feel like it does when you make a low-pitched growling noise. [2] X Research source"
    },
    {
      "title": "Hire a vocal coach",
      "content": "Hire a vocal coach . Singing in a slightly raspy voice can damage your vocal chords. To ensure you don't end up with long-term damage, you should enlist the help of a professional that can guide your explorations in raspy singing. Research vocal coaches in your area, ask them about their teaching methodologies, and set up an initial voice lesson."
    },
    {
      "title": "Use technology.",
      "content": "Use technology. You don't need to ruin your voice to get that slightly raspy sound you're looking for. Try using technology instead. For example, you can record a song in your normal voice and then have an audio engineer augment the recording so that your voice sounds raspy. This will protect your vocal chords while giving you the raspy recording you desire."
    },
    {
      "title": "Understand you can damage your vocal chords.",
      "content": "Understand you can damage your vocal chords. Singing in a raspy voice can cause long-term damage to your vocal chords. This is especially true if you are singing in a raspy voice, which can strain your vocal chords. Voice problems like vocal nodules and vocal polyps can develop if you abuse or overuse your voice."
    },
    {
      "title": "Know when to stop.",
      "content": "Know when to stop. It is important that you keep your vocal chords safe when you are trying to develop a slightly raspy singing voice. If your throat is sore or dry, you should not sing. You should also stop singing in a raspy voice if your voice seems fatigued. [3] X Research source You can remedy a dry throat by drinking at least 8 glasses of water a day, resting your voice, and drinking warm water with lemon."
    },
    {
      "title": "Sing within your vocal range.",
      "content": "Sing within your vocal range . Using the extremes of your vocal range, such as singing too high or too loudly, can put your vocal chords at risk. This is also true if you attempt to sing too low or too softly. Instead, sing within your natural range. [4] X Research source Just like athletes, singers shouldn't use 100% of the abilities all the time, since it's not healthy or sustainable long term."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Making sure your body is hydrated is an important part of singing safely. Be sure to drink eight glasses of water each day. Limit your consumption of alcohol and caffeine as both can dry out and irritate your vocal chords. You can also use a humidifier in your home. [5] X Research source"
    }
  ]
}