{
  "url": "https://www.wikihow.com/Fit-Two-Twin-Beds-in-a-Small-Room",
  "title": "How to Fit Two Twin Beds in a Small Room",
  "steps": [
    {
      "title": "Sketch the rough outline of your room’s shape on paper.",
      "content": "Sketch the rough outline of your room’s shape on paper. [1] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020. As you sketch, add doors, windows, and the directions that they open, and all arches and coves. Having a sketch of the fixtures in the room will allow you to organize furniture based on how many doors there are and so on. You don’t want to put beds or a desk right in front of a closet door or the exit! [2] X Research source Make note of how big the doorway is so you know how large of an item you can move into the space. Mark where the air vents are in your room if you have any so you don’t cover them."
    },
    {
      "title": "Make a sketch of each wall on separate paper.",
      "content": "Make a sketch of each wall on separate paper. This is so you can include the position of things such as windows, radiators, electrical outlets, air vents, and any other fixed objects that would be obstacles to placing twin beds in the room. You need to be able to work around those fixtures when placing beds and other furnishings. [3] X Research source"
    },
    {
      "title": "Add dimensions to your sketches.",
      "content": "Add dimensions to your sketches. [4] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020. Measure between each fixed point in the room. So measure the distance from the doorframe archway to the corner of the room, the corner of the room to the window reveals, and so on. [5] X Research source Pick a starting point and work clockwise from it, so you don’t leave anything out. Don’t forget to measure the room’s height and all vertical distances until the whole room is mapped out onto your sketches. It’s helpful to know the height because you might be thinking about getting a bunk bed. Measure the size and dimensions of all fixed objects, and record them on your sketches as you go."
    },
    {
      "title": "Draw the location of current furniture in your sketch.",
      "content": "Draw the location of current furniture in your sketch. If there are dressers and a desk, measure the spaces between them and record that on your sketch. This prevents any complications when fitting the two beds into the room. [6] X Research source A standard twin bed’s measurements are 39 by 74 inches (99 by 188 cm). This is the minimum size where a person using it can still be comfortable. [7] X Research source The best size room to fit two twin beds is 10 by 10 feet (3.0 by 3.0 m). [8] X Research source"
    },
    {
      "title": "Buy or build a corner unit twin beds with storage.",
      "content": "Buy or build a corner unit twin beds with storage. With this design, kids can get the exact same amount of storage space and the same sized beds. Both beds are one unit and are fit together in the shape of an L to fit nicely into a corner. They allow each person to have a sense of ownership over their own space. [9] X Research source Both beds have the same amount of space for storage underneath, and they make the most use of space in a small room. This configuration may give you the most floor space since both beds are pushed against the wall."
    },
    {
      "title": "Install a bunk bed with two twin-size mattresses.",
      "content": "Install a bunk bed with two twin-size mattresses. Also called a twin over twin bunk bed, these are just two twins stacked on top of each other, and they’ll save you a lot of room. But make sure you measure the height of the room before buying a bunk bed. [10] X Research source Most twin over twin bunk beds are 68 by 42 by 80 inches (170 by 110 by 200 cm) in height, width and length. Make sure your children are comfortable climbing in and out of a bunk bed."
    },
    {
      "title": "Attach bed risers to each of the beds to make space.",
      "content": "Attach bed risers to each of the beds to make space. These elevate the beds a couple feet off the ground to create storage space underneath. You can put flat storage under bins the beds to store seasonal clothes that aren’t in use. This will free up space in the closet and dresser. [11] X Research source"
    },
    {
      "title": "Make both beds into lofts for more space.",
      "content": "Make both beds into lofts for more space. A loft raises the bed up high enough to create more space under the bed where you can fit a desk, reading nook or more storage space. You can put shelves under a loft bed to store books and collectibles or anything that makes a small room more cluttered. [12] X Research source Set up a desk and chairs with computers to create a small study area under each bed. [13] X Research source This setup works best for older children and teenagers."
    },
    {
      "title": "Decide where you want to put furniture.",
      "content": "Decide where you want to put furniture. Based on the size and shape of the room, you will need to place the beds to get the most out of your space. [14] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020. Place beds parallel to each other in a square room. In a long room, place two beds lengthwise against the wall, because a long, narrow room fits the proportion of twin beds better than a square room. For a room that’s L-shaped, put beds on opposite ends of the L shape to maximize privacy for the inhabitants. [15] X Research source In a square room, keep space between the beds for a desk, and enough space on opposite sides for nightside stands. Include one dresser or wardrobe on the other side of the room across from the beds. [16] X Research source Put two beds lengthwise against the wall in a long room. Twin beds will fit better in a long and narrow room together because this shape fits their proportions better than a square bedroom does. Include a small table, chest of drawers, bookshelf, or wardrobe between the beds to create privacy for each inhabitant. Put the two dressers next to each other against the longest wall of an L-shaped room. Place each desk against the wall parallel to each bed. Make sure you have enough room to walk around, open doors, and make the bed."
    },
    {
      "title": "Add storage units to the ends of the beds.",
      "content": "Add storage units to the ends of the beds. The more you utilize the beds as storage space, the less clutter there will be. Put a storage bench, baskets or crates at the foot of each bed to store toys, books, and seasonal clothes. A storage bench would take up about a foot of space at the end of each bed. Some bed frames are designed with storage in mind, so buy one with compartments for keeping bins or baskets underneath. [17] X Research source You can also consider headboard storage by utilizing bins or baskets to organize bedside necessities. Wall shelving above the bed also increases storage space. [18] X Research source"
    },
    {
      "title": "Put combination desk nightstands next to the beds.",
      "content": "Put combination desk nightstands next to the beds. As its name suggests, a desk nightstand serves as both a desk and a bedside table for storing items. Take advantage of its surface area to store bedside essentials and for studying. As a desk, it has room for a small lamp, a pen cup, and a laptop computer. A desk nightstand may have a drawer or two to store phone rechargers and home office items."
    },
    {
      "title": "Use wall space to hang clothing racks and shelves.",
      "content": "Use wall space to hang clothing racks and shelves. If there’s no room for a decently-sized dresser, you can get creative with one or two clothing racks. Using shelves or a storage bench along the wall also maximizes space for shoes, towels, and spare bedding. [19] X Research source One way to make use of wall space is to install a shelf with a rack attached to it, so you can hang clothes on the rack while putting whatever else you need on the shelf. A storage bench along the wall under the shelf and rack unit can hold folded clothes, more shoes, books, and toys."
    }
  ]
}