{
  "url": "https://www.wikihow.com/Fill-Rust-Holes-in-Metal",
  "title": "How to Fill Rust Holes in Metal",
  "steps": [
    {
      "title": "Put on goggles, gloves, and a dust mask for protection.",
      "content": "Put on goggles, gloves, and a dust mask for protection. Protect yourself against the rust flakes released while you’re cleaning the metal. Keep your eyes and mouth well-covered at all times. Wear cut-resistant work gloves to guard against sharp edges. Also, complete your outfit with long pants and a long-sleeved shirt. [1] X Research source Safety glasses won’t fully protect your eyes, so choose goggles instead. Dust masks don’t completely seal over your mouth. For maximum protection, put on a respirator mask instead."
    },
    {
      "title": "Work outdoors or in another well-ventilated area.",
      "content": "Work outdoors or in another well-ventilated area. Working outdoors prevents metal dust and other harmful things from lingering in your home. Most projects can be done outdoors, including car or gutter repair. Keep in mind that you will need a place to plug in power tools, or at least an extension cord to connect to the nearest electrical outlet. If you have to work indoors, do what you can to ventilate. [2] X Research source For example, if you’re indoors, open up nearby doors and windows. If you have a workshop with a strong ventilation fan, use it. Keep other people out of the area until you’re done with the repair. Afterward, use a vacuum and magnets to eliminate any dust in the air."
    },
    {
      "title": "Cover the surrounding metal with masking paper and tape.",
      "content": "Cover the surrounding metal with masking paper and tape. Cut some sheets of masking paper to size with a sharp pair of scissors. Press them flat against the surface of the metal, then secure the edges with masking tape. Leave the rusted area exposed. [3] X Research source Cover up anything nearby that you don’t want to get discolored. For example, if you’re fixing a hole on a car, prevent paint or hot sparks from ruining the finish. Masking paper and tape are available online and at most hardware stores. These sources will also have everything else you might need to make metal look as good as new."
    },
    {
      "title": "Use 80-grit sandpaper to remove all of the paint and rust.",
      "content": "Use 80-grit sandpaper to remove all of the paint and rust. Start with the remaining paint near the hole, since it is easier to remove than the rust. To make the repair as effective as possible, scrub away the paint up to 1 in (2.5 cm) beyond the edges of the hole. Then, go back toward the center of the hole, scrubbing with heavy pressure to eliminate the rust. All of the rust must go. Keep sanding until you’re able to see bare metal. [4] X Research source This part can take awhile, so make things easier by using power tools. For instance, switch to an orbital sander and an angle . You can also use tools like a flathead screwdriver or tin snips to break off rusty sections of metal. Rust makes the underlying metal soft and crumbly, so don’t hesitate to cut it out. You could also use a wire brush to scrub away metal. Use one for an easier way to clean rust from the inner part of a hole."
    },
    {
      "title": "Apply a rust primer or converter over the bare metal.",
      "content": "Apply a rust primer or converter over the bare metal. These products come in spray-on or liquid forms, so the application process will vary a little depending on which one you get. For the spray-on version, hold the canister about 6 in (15 cm) from the clean metal. Point it at the spot, press the button on top of the can, then sweep it across the bare spot at a slow but steady pace. Make sure the entire surface is well-covered with the primer. [5] X Research source If you’re using a liquid primer, spread it with a foam brush. It’s like applying any sort of house paint."
    },
    {
      "title": "Wait 24 hours for the primer to become dry to the touch.",
      "content": "Wait 24 hours for the primer to become dry to the touch. The primer has to be completely dry to ensure that the repair holds. The exact time required can vary from product to product, so be sure to check the manufacturer’s recommendation. If you’re working in cold or humid weather, expect the primer to dry out at a slower rate. [6] X Research source After the primer has finished drying, inspect it to ensure the metal looks ready. If it’s still exposed, rust could set in again and cause more problems. It’s worth recoating the spot a second time to ensure it stays clean. If you’re recoating the metal with additional layers of primers, you may not need to wait the entire 24 hours. Some products let you apply additional coatings within an hour."
    },
    {
      "title": "Select a patch matching the type of metal you’re repairing.",
      "content": "Select a patch matching the type of metal you’re repairing. If you’re using a metal patch, it should be the same type of metal. For example, zinc patches work very well on cars, since most are made with zinc-coated steel. For other objects, such as aluminum gutters, use an aluminum patch instead. The best way to get what you need is by purchasing a repair kit containing the patch and an adhesive. [7] X Research source If you’re unsure what kind of patch to use, get a fiberglass patch. It’s a general-purpose material that bonds well to any type of metal. If you match the wrong metals together, one of them will corrode over time, and then you will be left with a piece of metal needing to be patched all over again."
    },
    {
      "title": "Trim the mesh with scissors so it fits over the hole.",
      "content": "Trim the mesh with scissors so it fits over the hole. Keep the patch about 1 in (2.5 cm) longer on all sides than you think you need. You can always trim it down more later if it’s too big for the hole. Sharp scissors are fine for most cases, but switch to tin snips if you’re having trouble cutting through the material. Make the patch roughly the same shape as the hole as well. [8] X Research source To size the patch, you could tape a piece of wax paper over the hole, then trace the shape of the hole with a permanent marker. Use the tracing as a template to cut an identical patch. It is possible to use several layers of patching material. Layer several fiberglass patches, for instance, to level out a deep hole and make the repair stronger."
    },
    {
      "title": "Mix body filler with a paint stick on a scrap piece of cardboard.",
      "content": "Mix body filler with a paint stick on a scrap piece of cardboard. Use the stick to scoop a golf ball-sized dollop of the body filler out onto the cardboard. Open the separate harder and spread 5 to 8 drops of it across the body filler. Then, stir the body filler until it’s well-mixed. It will turn a uniform color, usually green, although it varies depending on the color of the body filler and hardener. [9] X Research source If you’re using a fiberglass patch, mix a fiberglass resin and hardener together. The mixing process is the same as it is with body filler, so nothing changes! The filler and hardener typically come packaged together in a kit. If you’re buying them separately, make sure you have both products."
    },
    {
      "title": "Insert the metal patch behind the hole.",
      "content": "Insert the metal patch behind the hole. Reach underneath the metal if you’re able to, or push the patch through the hole. Then, spread the patch out so it’s flat against the remaining metal. The patch should completely cover the hole. Keep it stuck in place by spreading a little bit of the body filler around its edges. [10] X Research source Getting the patch in place can be tricky. Try spreading some filler around inside the hole with a paint stirrer. Alternatively, you might be able to pin the patch in place with magnets. If you can’t get a patch to stick, consider using an epoxy filler instead. Epoxy filler is like a putty, so all you have to do is spread it flat on a piece of fiberglass mesh glued over the hole. It’s a simpler way to repair a hole, but it doesn’t last as long as a patch."
    },
    {
      "title": "Cover the patch with a coating of body filler.",
      "content": "Cover the patch with a coating of body filler. Most kits come with a plastic applicator you can use to spread the filler. If you don’t have one, use a paint stick. Apply enough of the filler so it’s about 1 ⁄ 4 in (0.64 cm) higher than the surrounding metal. [11] X Research source You can sand down the filler later so it’s even with the surrounding metal and ready for repainting. If it doesn’t look great now, no worries. It doesn’t have to."
    },
    {
      "title": "Wait about 1 hour for the filler to completely dry.",
      "content": "Wait about 1 hour for the filler to completely dry. Body filler dries quickly, so you won’t have to wait long. Be sure to check the manufacturer’s instructions for the precise drying time. Once the filler is hard to the touch, you can begin blending it in with the old metal. [12] X Research source The patch dries out faster when it’s in an area with good air circulation. During cold or humid days, expect it to dry out a little slower than normal. Once the initial layer dries, you can apply more filler if it is needed to level out the surface or even finish filling in an oddly-shaped area. Sand the patch with 80-grit sandpaper before each coating."
    },
    {
      "title": "Sand the patch smooth with 180-grit sandpaper.",
      "content": "Sand the patch smooth with 180-grit sandpaper. Scrub the entire patch with a light but firm amount of pressure. Sand the entire patch until it’s level and feels smooth to the touch. Use a lighter touch around the edges to blend the patch in well without scratching the metal around it. [13] X Research source Wipe off any dust on the patch before painting it. You can use a tack cloth or a microfiber cloth dampened in warm water."
    },
    {
      "title": "Spray on a paint primer and let it dry for 1 hour.",
      "content": "Spray on a paint primer and let it dry for 1 hour. To quickly paint over the patch, get a quick-drying spray-on primer designed for metal surfaces. Shake the can, then hold it about 6 in (15 cm) from the patch surface. While spraying the primer, sweep the canister from side to side across the patch. Don’t overlap your strokes as you move from left to right, or else the paint could build up unevenly in certain spots. [14] X Research source Painting at the right speed can be a little tough if you have never used spray-on paint or primer before. Practice on a piece of scrap material first, like cardboard. Make sure the primer is completely dry to the touch before painting over it. The patch should also be covered. If it’s still exposed, it could rust, so even it out with a second coat of the primer."
    },
    {
      "title": "Paint over the primer and let it dry for 24 hours.",
      "content": "Paint over the primer and let it dry for 24 hours. If you’re going for a more professional finish, select a spray-on paint that best matches the color of the existing metal. Hold the canister 6 in (15 cm) from the surface and apply it from left to right across the patch. Make sure the coating is consistent. If it isn’t, let it dry, then apply additional coating as needed to restore the metal back to normal. [15] X Research source Doing this is great for hiding damage on a car, but you don’t have to do it for things like unpainted metal gutters."
    },
    {
      "title": "Trace an outline of the hole on a piece of wax paper.",
      "content": "Trace an outline of the hole on a piece of wax paper. Wax paper is slightly transparent, so it’s a sneaky way to get a good idea of what you need to patch over the hole. Hold the paper flat against the metal, then outline the hole with a permanent marker. Cut out the template with scissors afterward. [16] X Research source Make sure the outline is accurate. Cutting it a little bigger than the actual hole is fine. If it doesn't cover the hole, remake it."
    },
    {
      "title": "Use metal-cutting shears to cut a copper backing.",
      "content": "Use metal-cutting shears to cut a copper backing. Place the template over a copper sheet. Take a permanent marker and draw around the outline. Make the backing the same size as the hole. Then, trim it out and set it aside. Some other tools you can use include tin snips, a hacksaw, or a dremel . Hardware stores generally have everything you need for the repair, including welding material and copper sheets. Check online as well for anything you can’t find in a store."
    },
    {
      "title": "Attach the copper panel to the back of the hole with a clamp.",
      "content": "Attach the copper panel to the back of the hole with a clamp. Reach underneath the hole to install the copper panel, if possible. You’re going to need a way to keep it there while you’re welding. Try fitting a clamp around the metal and copper panel to bind them together. If you’re unable to get a clamp in place, use a welder’s magnet instead by placing it on top of the metal. [17] X Research source Make sure the copper backing is the same size as the hole. The edges should be accessible, or else you won’t be able to weld them to the existing metal."
    },
    {
      "title": "Put on a welding mask and other gear to protect yourself.",
      "content": "Put on a welding mask and other gear to protect yourself. Wear a shaded welding mask to protect your eyes against the light from the welding torch. Also, put on heat-resistant welding gloves and an apron. Have a fire extinguisher nearby as well. [18] X Research source Work away from flammable surfaces. If you’re fixing sheet metal, place it on a welding table, for instance. Remember to work in a well-ventilated area! Have other people stay out until you’re done."
    },
    {
      "title": "Install a steel wire into the torch of a MIG welder.",
      "content": "Install a steel wire into the torch of a MIG welder . Since steel won’t stick to wire, it’s perfect for filling in the holes around the copper. Feed it through the tip of the torch, making sure it stays centered. If it feels like it’s stuck, pull it out, clean it, and recenter it. Wipe the wire clean with a dry cloth. If it gets dirty, the weld won’t turn out very strong. [19] X Research source For an inexpensive, all-purpose choice, get a AWS ER70S-3 steel wire. Use AWS ER70S-6 steel wires for a higher-quality repair."
    },
    {
      "title": "Connect the welder to its gas tank and exposed metal.",
      "content": "Connect the welder to its gas tank and exposed metal. Hook the hose adapter to the outlet on top of the gas tank. The hose is on the back of the MIG welder, near where you installed the steel wire. After securing the gas, walk to the front of the machine and take the other black hose there. This one will have a metal clamp at the end. Secure it to a welding table or a bare panel on a car, for example [20] X Research source Shielding gas is used to protect the hot metal so it cools into a strong weld. Try using 100% carbon dioxide for an inexpensive way to complete most projects. A 75% argon, 25% carbon dioxide mix will also work, and is great for welding tough metals like steel. The grounding clamp is for safety. It lets out electricity, especially when something happens that causes the welder to overload."
    },
    {
      "title": "Spot weld every 3 to 4 in (7.6 to 10.2 cm) along the metal.",
      "content": "Spot weld every 3 to 4 in (7.6 to 10.2 cm) along the metal. Turn on the welder, then hold the torch at a 90-degree angle to the metal. Bring the tip of the torch right up against the metal. Hold it there for a couple of seconds to place a 1 ⁄ 2 in (1.3 cm) wide spot of melted steel wire. Do this all the way around the perimeter of where the existing metal and copper backing meet. [21] X Research source Remember to remove your clamp or magnet after the initial few welds cool. They will hold the metal together while you finish the repair. If the hole is small, you can close it just by spot welding. You won’t need to use a bronze backing. The steel from the torch’s wire will fill in the hole."
    },
    {
      "title": "Add more spot welds to fill in the remaining gaps between the metal.",
      "content": "Add more spot welds to fill in the remaining gaps between the metal. Go back to the first spot you made. Once it is cool, weld another spot next to it. Complete more 1 ⁄ 2 in (1.3 cm) welds next to the original set you made. Repeat this until the entire perimeter is filled. [22] X Research source Spot weld next to each of the cooled spots. Position your torch so the spots don't overlap at all. This is called stitch welding since it isn’t one continuous weld. Instead, you will end up with a bunch of metal dots, kind of like US dimes, next to one another."
    },
    {
      "title": "Sand the weld flat with a metal angle grinder or Dremel tool.",
      "content": "Sand the weld flat with a metal angle grinder or Dremel tool. Try using an angle grinder fit with an abrasive flap wheel, for instance. Wait at least 30 seconds for the weld to finish cooling, then hold the wheel up to each spot. Grind them all down until they’re smooth and roughly level with the surrounding metal. [23] X Research source Sanding the weld makes it look much better. It's good if you plan on masking the weld, but you should always do it if you want to paint over it."
    },
    {
      "title": "Prime and paint the metal to give it a more professional look.",
      "content": "Prime and paint the metal to give it a more professional look. If you’re planning on covering over the welded spot, apply a compound, such as a body filler. Cover the entire copper backing, along with the weld, using a wood paint stick. After it finishes drying, level it out with 180-grit sandpaper, then spray on a primer. Apply a coat of paint afterward if you wish to match the repair to the existing metal. [24] X Research source At the very least, cover the weld and apply a primer to seal out rust. Fresh welds are vulnerable to rust, especially before they have had a chance to cool."
    }
  ]
}