{
  "url": "https://www.wikihow.com/Do-a-Cool-Calculator-Trick",
  "title": "4 Mind-Blowing Calculator Tricks",
  "steps": [
    {
      "title": "Tell someone to secretly select a 3-digit number and enter it twice into a calculator.",
      "content": "Tell someone to secretly select a 3-digit number and enter it twice into a calculator. Make sure they don’t show you the calculator’s display. Stand across the room from the person and make it seem like you are trying to read their mind. For example, they could enter “123123.”"
    },
    {
      "title": "Announce that the number can be evenly divided by 11.",
      "content": "Announce that the number can be evenly divided by 11. Dramatically announce this from across the room. Have the person verify this with their calculator and confirm to the audience that you are right. For instance, if they entered “123,123 ÷ 11” into their calculator, they would get 11,193 (a whole number rather than a decimal)."
    },
    {
      "title": "Tell them to divide that result by 13.",
      "content": "Tell them to divide that result by 13. Announce from across the room that the result is divisible by 13. Tell them to crunch the numbers on the calculator to prove it. Example: If their last result was 11,193, then they would divide it by 13 and get 861."
    },
    {
      "title": "Tell them to divide the result by the original 3-digit number.",
      "content": "Tell them to divide the result by the original 3-digit number. Remember that they chose a 3-digit number and entered it twice. Make sure they only divide the result by 3-digits, rather than the 6 they entered at the beginning. Example: If their last result was 861, and the original number was 123, they would divide 861 by 123 to get the number 7."
    },
    {
      "title": "Announce that the final answer is 7.",
      "content": "Announce that the final answer is 7. Tell them without looking at the screen. Have them show the audience, if you have one, to prove that you are right. Want to give this magic trick a fortune-telling twist? To give a “good” fortune, tell the person to divide the final number by 13—this gives them lucky number 7 as a final answer. To give a “bad” fortune, tell the person to divide the final number by 7 instead, which gives them unlucky number 13 as a final answer."
    },
    {
      "title": "Write 73 on a piece of paper, fold it, and set it in front of you.",
      "content": "Write 73 on a piece of paper, fold it, and set it in front of you. Don't let anyone see the number your write down. You'll reveal this secret number at the end of the trick, to your audience's delight. [1] X Research source It doesn’t matter what kind of paper you use. Just make sure you fold it up enough that nobody can see the number."
    },
    {
      "title": "Tell your volunteer to pick a 4-digit number and put it into the calculator twice.",
      "content": "Tell your volunteer to pick a 4-digit number and put it into the calculator twice. Don’t worry—any 4-digit number will work for this trick. Hand the calculator to the volunteer and have them enter the number. [2] X Research source For instance, if your volunteer picks the number “7893,” they would type \"78937893\" into the calculator."
    },
    {
      "title": "State that their number can be evenly divided by 137.",
      "content": "State that their number can be evenly divided by 137. Ask your volunteer confirm this by dividing the 8-digit number in the calculator by 137. Any number made by repeating a 4-digit number twice will be evenly divisible by 137. [3] X Research source Did You Know? Repeating the digits in a 4-digit number twice is equal to multiplying the original 4-digit number by 10,001, which is divisible by 137. For instance, 12,341,234 is equal to 1,234 x 10,001. [4] X Research source"
    },
    {
      "title": "Tell your volunteer to divide the answer by the original 4-digit number.",
      "content": "Tell your volunteer to divide the answer by the original 4-digit number. Your volunteer will get an answer of 73 every time if you've followed the directions correctly. It doesn’t matter which number they started with. [5] X Research source Example: After dividing 78,937,893 by 137 to get 576,189, the volunteer would divide 576,189 by 7,893."
    },
    {
      "title": "Command your volunteer to reveal your prediction.",
      "content": "Command your volunteer to reveal your prediction. Have your friend or volunteer open the folded piece of paper. Be prepared for your audience to go wild when your prediction of 73 is revealed! [6] X Research source Don't reveal the math behind the trick! A good magician knows how to keep their secrets."
    },
    {
      "title": "Tell someone to pick a number from 1-9 without telling you what they chose.",
      "content": "Tell someone to pick a number from 1-9 without telling you what they chose. Explain to them that you are going to identify which number they picked at the end. Put on an act that you are reading their mind while they are thinking of a number. [7] X Research source This is a super easy math trick that’s easy to figure out at the end, but it’s still fun to put on a show!"
    },
    {
      "title": "Ask them to multiply their chosen number on a calculator by 9.",
      "content": "Ask them to multiply their chosen number on a calculator by 9. This gives them either a 1- or 2-digit number."
    },
    {
      "title": "Ask them to multiply this new number by 12,345,679.",
      "content": "Ask them to multiply this new number by 12,345,679. Keep in mind that there’s no 8 in the second sequence of numbers. Make sure that they multiply their new number by 12,345,679 (with no 8) in order for the trick to work. Keep pretending you are reading the person’s mind while they perform the multiplication."
    },
    {
      "title": "Make them show you the results or pass you the calculator.",
      "content": "Make them show you the results or pass you the calculator. Tell them you will divide what number they chose at the beginning from the result on the calculator. Have them hold the calculator to face you so you can see the number or hand it to you so you can look. If you have an audience, don’t let them see the result on the screen in order to create a more dramatic effect. Tip: To keep your secret, you could have the person hit enter or the equals sign and pass you the calculator right away without letting them looking at the result on the screen."
    },
    {
      "title": "Look at the number to determine what their original number was.",
      "content": "Look at the number to determine what their original number was. Whichever number you see repeating on the screen is the number they chose at the beginning. There will only be a string of a single repeating number. For example, if they chose 1, then the calculator will show “111,111,111.”"
    },
    {
      "title": "Type a secret word into your calculator.",
      "content": "Type a secret word into your calculator. Certain numbers, like 4, 3, 1, and 0, bear a striking resemblance to different letters of the alphabet. Take advantage of this by stringing together specific numbers to create certain words: [8] X Research source 0.1134: hello 14: hi 707: LOL 379009: Google 376616: giggle 0637: lego 0.140: Ohio"
    },
    {
      "title": "Flip over your calculator to see your word.",
      "content": "Flip over your calculator to see your word. Turn your calculator upside-down to reveal your message. With any luck, your silly word will be written out in blocky letters across the screen. Warning: This calculator trick works best with older calculators. Newer models use a more modern typeface that doesn’t translate the message as well. [9] X Research source"
    },
    {
      "title": "Use your calculator to pass along secret messages.",
      "content": "Use your calculator to pass along secret messages. The next time you’re feeling bored in math class, type out a secret message on your calculator screen and show it to a friend. With any luck, your calculator word magic will help pass the time!"
    }
  ]
}