{
  "url": "https://www.wikihow.com/Enable-Flash-on-Chrome",
  "title": "How to Enable Flash on Chrome",
  "steps": [
    {
      "title": "Open Chrome on your computer.",
      "content": "Open Chrome on your computer. If you’re using Windows, you’ll usually find it in the Start menu. If you’re using a Mac, it should be in the Applications folder."
    },
    {
      "title": "Click the ⁝ menu.",
      "content": "Click the ⁝ menu. It’s near the top-right corner of Chrome."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It’s near the bottom of the menu."
    },
    {
      "title": "Scroll down and click Advanced.",
      "content": "Scroll down and click Advanced . It’s a link at the bottom of the page. Additional settings will appear."
    },
    {
      "title": "Scroll down and click Content settings.",
      "content": "Scroll down and click Content settings . It’s toward the bottom of the the “Privacy and security” section."
    },
    {
      "title": "Click Flash.",
      "content": "Click Flash . It’s near the middle of the list."
    },
    {
      "title": "Slide the switch to the On position.",
      "content": "Slide the switch to the On position. If the switch is already blue, Flash is enabled and there’s no need to make a change. When this switch is on, websites trying to load Flash content will prompt you to enable the Flash Player. [2] X Research source You can also manually add or block websites on this menu by clicking the \"Add\" button and typing in the website you wish to add or block from using Flash."
    },
    {
      "title": "Open a website that uses Flash.",
      "content": "Open a website that uses Flash. This can be any Flash-enabled site, including many online games and video sites. When the site tries to load its Flash content, you’ll see a message asking you if you’d like to enable Adobe Flash Player."
    },
    {
      "title": "Click Click to enable Adobe Flash Player if you trust the site.",
      "content": "Click Click to enable Adobe Flash Player if you trust the site. A confirmation will appear."
    },
    {
      "title": "Click Allow.",
      "content": "Click Allow . The site’s Flash features should now run. If you see an error that says “The site needs Flash to work,” click the padlock icon (or “i” in a circle) on the left side of the address bar, click Site Settings , click the down-arrow, and then select Allow . When you reload the page, the Flash game, animation, or other content should appear. Chrome resets your Flash settings when you shut down the browser. This means that every time you come back to this website, you’ll have to allow the Flash to run again."
    }
  ]
}