{
  "url": "https://www.wikihow.com/Get-Along-With-Literal-Thinkers",
  "title": "How to Get Along With Literal Thinkers",
  "steps": [
    {
      "title": "Realize that different people have different ways of thinking.",
      "content": "Realize that different people have different ways of thinking. Each person’s brain operates differently. Literal thinkers aren't trying to think literally; it's simply the way their brains are structured. This can cause as much frustration for a literal thinker as it causes for you. [1] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Realize that a literal thinker does not want to be frustrated and that they are not trying to frustrate you either. Think of how you can accommodate a literal thinker, rather than getting upset that they don't think in the same way that you do. Respect and celebrate diverse ways of thinking. We each have our own strengths and challenges. Perhaps one of your friends, a literal thinker, is a great mathematician, while you are a poet. As a society we should celebrate their mathematical brilliance and your artistry with words. Be kind. In addition to celebrating differences, you should be compassionate and generous in your communication with a literal thinker."
    },
    {
      "title": "Identify the strengths of the literal thinker.",
      "content": "Identify the strengths of the literal thinker. Because a literal thinker thinks in concrete terms, they are likely to better at understanding rules, handling concrete information, visualizing information, and working through thoughts and actions that are rule-based, such as math problems, than many other neurotypical thinkers. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source They also don't engage in bad communication habits such as sarcasm, slang, vulgarity, flowery language, or cliche sayings. When you talk to them, notice and play upon these strengths to make it easier to connect."
    },
    {
      "title": "Appreciate the communication style of a literal thinker.",
      "content": "Appreciate the communication style of a literal thinker. Rather than looking down on a literal thinker for thinking in concrete terms, or for missing nuances, sarcasm, or irony, simply accept them for who they are and appreciate the clear and direct communication style that they offer. It may require a little extra work on your part to make sure that the communication between the two of you flows smoothly, but this is an experience that can be both positive and informative. For example, Antonia will be forthright about what is on her mind, because trying to wrap her thoughts in nuances is extremely difficult for her. While her bluntness can be difficult, you also can appreciate you always know exactly what she is thinking and feeling and is clear about it. Another example: Tian has challenges with small talk, conversation and other social interactions with others, in part because she has a difficult time with handling the subtle cues and expectations of social communication. She is not much of a conversationalist at the work lunchroom or the holiday party or with most customers. However, she is amazing at problem solving computers, electronics, and other tasks and an great asset to the workplace."
    },
    {
      "title": "Know that sometimes, literal thinking is a sign of a disability or mental illness.",
      "content": "Know that sometimes, literal thinking is a sign of a disability or mental illness. While this doesn't negate their strengths, it's helpful to work with them and set them up for success instead of failure. Don't expect them to suddenly gain lots of skills they don't have. Here are some conditions that can cause literal thinking: [3] X Research source Autism: Autistic people tend to be sincere, straightforward communicators who may not get jokes and sarcasm. They may not understand social nuances, so it helps for people to be clear and patient with them. Brain injury and dementia: Brain injuries and dementia can make someone take things literally. [4] X Research source [5] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Intellectual disability: Abstract things can be hard for people with intellectual disabilities to understand. You may have to slow down and explain more. Schizophrenia: People with schizophrenia or delusional disorders may take things literally. They may not understand that metaphors are not real, [6] X Research source [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source so it's good to avoid metaphors to help with confusion."
    },
    {
      "title": "Speak plainly.",
      "content": "Speak plainly. Avoid using figures of speech and overly artistic language. Our language is complex and can be challenging at times for even the best speakers. Literal thinkers think in concrete terms and often focus on “the here and now.” [8] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source They can miss the nuances of language and subtext, and they can find it difficult to pick up on verbal and nonverbal cues that would otherwise help them decipher the meaning of a statement or conversation. When engaging a literal thinker, remember to use simple language that is straightforward, which explicitly states what you mean. Avoid using: Metaphors Idioms Puns Exaggeration/hyperbole Euphemisms Personification of inanimate objects/Anthropomorphism Sarcasm/irony Figurative phrases Flowery or artistic language Implied assumptions"
    },
    {
      "title": "Avoid sarcasm.",
      "content": "Avoid sarcasm. State things as they are without relying upon subtext. Often literal thinkers do not understand or even recognize sarcasm. [9] X Research source Explain things plainly and with kindness. If you wanted to use sarcasm for effect, think of a way that you could rephrase your sarcastic response in different terms that the literal thinker could understand. For example, instead of saying \"Oh boy, I'm really loving this,\" when you are waiting in a long line, say something that makes your feelings clear, like \"This is not my idea of fun. I wish we were inside already!\""
    },
    {
      "title": "Be cautious about teasing.",
      "content": "Be cautious about teasing. Literal thinkers can't always tell when you're joking and when you're being serious. So, if you think you're gently teasing, they may mistakenly think you're mad at them and that you don't like them. That isn't fun at all. Consider skipping the teasing or being extra clear. If you start teasing and they look confused or hurt, stop right away. You can say something like \"I'm being silly. I'm sorry if I upset you and that's not my goal. The truth is that I think you're cool.\""
    },
    {
      "title": "Say what you mean.",
      "content": "Say what you mean. Be straightforward with your communication. Hints may sail over the head of a literal thinker. Also, avoid complex nonverbal cues or subtexts when conversing with a literal thinker. [10] X Research source For example, don't say, \"I'm fine,\" when you're not fine, or cough and look at your watch when you want to let the other party know that you need to be going. Instead say, “I’m not okay,” if you are not fine, or say, “I must be going now,” when it is time for you to leave. Being clear will allow the literal thinker to catch the full message, so that they know how to respond. Use “I” statements to handle difficult feelings. For example, instead of \"You're annoying,\" say \"I have a hard time focusing when you tap your pencil on your desk. It distracts me.\" Do not use overly abstract language. Instead, use concrete words. For example, instead of saying, “I'm under the weather today,” you might say, “I'm sick.”"
    },
    {
      "title": "Use visual representations to improve communication.",
      "content": "Use visual representations to improve communication. Many literal thinkers translate words into visual images in their minds, so you might try to play upon that characteristic to help them understand you. Offering visual support of your words helps to make your language concrete for the literal thinker. For example, if you are talking to a literal thinker about your upcoming vacation to a beach with black sand and the literal thinker is confused, you could show them a photo of a beach with black sand."
    },
    {
      "title": "Be open to explaining.",
      "content": "Be open to explaining. If the person doesn't get it the first time, try rephrasing your words into more concrete language. Watch the literal thinker’s expression to see if they are still struggling, or if they get it now. Let the pace of the conversation be fluid, based on each person's needs. Explain what you mean until you are certain that you’ve reached a common understanding."
    },
    {
      "title": "Be patient if they misunderstand you.",
      "content": "Be patient if they misunderstand you. Sometimes, they may think they are doing what you asked when they didn't understand the request. Don't jump to the assumption that they're trying to be rude. Instead, ask them about it. Try to avoid blaming them for something they couldn't control. Work together to clear it up. For example, you might say, \"When I said I would start the task, what I meant is that I wanted you to come over and finish it. Don't feel bad. I know I wasn't clear. I will try to be more specific next time.\""
    },
    {
      "title": "Run interference if you notice a miscommunication between a literal thinker and another person.",
      "content": "Run interference if you notice a miscommunication between a literal thinker and another person. If someone else is trying to be subtle, and your friend is missing the cues, step in to clear things up. You can make a gentle suggestion to the literal thinker, so that they have the information they need to know how to respond. Say something like, \"Joshua seems like he's in a hurry. Why don't we talk about this later?\" or, \"Marisol's sarcasm can be pretty subtle. She's not criticizing you, she's criticizing your professor for being so judgmental.\" It may be worthwhile to take the other person aside and let him know that it helps to be clearer with the literal thinker. For example, \"It can be hard for Maya to decipher subtle hints, and I think she was struggling to guess what was on your mind. Next time, it might help for you to tell her outright how you feel.\""
    },
    {
      "title": "Work on being patient and understanding.",
      "content": "Work on being patient and understanding. Different thinking and learning styles are one part of human diversity, and struggles with nuanced language don't make someone less worthwhile or important. Make it clear that you don't think any less of the literal thinker for having a different style of communication."
    },
    {
      "title": "Recognize that how you communicate is just as important as what you are saying.",
      "content": "Recognize that how you communicate is just as important as what you are saying. This is true for when you are talking to anyone — but applies to literal thinkers in particular — kindness and careful communication can make all of the difference. [11] X Research source When you show a literal thinker kindness and are careful about how you speak to them, you encourage them to trust you, demonstrate respect for them and their communication style, and enhance your communication interactions with that person."
    }
  ]
}