{
  "url": "https://www.wikihow.com/Cut-Corrugated-Metal",
  "title": "How to Cut Corrugated Metal",
  "steps": [
    {
      "title": "Put on a pair of thick gloves and a welding mask.",
      "content": "Put on a pair of thick gloves and a welding mask. While the blade guard will protect you from most of the sparks, you'll want to wear gloves and welding mask for the highest level of protection. [1] X Research source Work in a well-ventilated area, preferably outside. The fumes that come from cutting corrugated metal can be dangerous. [2] X Research source You can use circular saws when you install custom shelves and cut them to size. [3] X Research source"
    },
    {
      "title": "Place your corrugated metal on top of your work surface.",
      "content": "Place your corrugated metal on top of your work surface. You can use a sawing table or a set of sawhorses. Place your corrugated metal on top of your work surface so that there isn't anything blocking your saw blade directly underneath your cutting line. [4] X Research source Measure the area to be cut."
    },
    {
      "title": "Switch out your saw blade for any blade designed for metal.",
      "content": "Switch out your saw blade for any blade designed for metal. Unlock your blade guard and replace the blade if necessary. To do this, loosen the bolt in the center of your blade with a wrench and twist it off. Take the flange off and pull your current blade out to remove it. Slide your new blade into the saw slot and add the flange before tightening the bolt as firmly as possible. [5] X Research source It will say on the side of your saw blade whether or not your blade is designed to cut through metal. Any continuous or sharp-toothed blade that is used for metal cutting will work. A diamond blade will give you the cleanest results, but they're more expensive than a standard circular saw blade."
    },
    {
      "title": "Brace the corrugated metal with your nondominant hand and start to cut.",
      "content": "Brace the corrugated metal with your nondominant hand and start to cut. Press the base plate of your saw against an edge where you want to start cutting. Brace the metal by applying pressure with your nondominant hand, holding it at least 2 feet (0.61 m) away from your saw. Pull the saw's trigger and carefully make your initial incision into the metal. [6] X Research source If you're uncomfortable taking a hand off of the saw, you can weigh the sheet metal down with a heavy object. Clamps won't really work, since the grooves in corrugated metal make it hard to maintain the necessary tension."
    },
    {
      "title": "Guide your saw slowly through the metal.",
      "content": "Guide your saw slowly through the metal. Your circular saw will do most of the work since it will be pulled forward from the traction from your saw blade. Guide the saw slowly through the metal and allow the excess piece that you cut to fall freely to the floor. [7] X Research source Avoid moving your circular saw at an angle as you cut. The grooves in corrugated metal will make it easy to cut a straight line, but if you try to turn your saw you'll risk losing control of it. This method is best for cutting long lengths of straight lines in corrugated metal."
    },
    {
      "title": "Find a pair of heavy-duty snips that work with metal.",
      "content": "Find a pair of heavy-duty snips that work with metal. Aviation snips, which are also known as compound snips or tin snips, are designed to cut metal and come in different shapes and sizes. They are usually color-coded based on what you're trying to do with them. Yellow snips are designed to cut in a straight line, while green snips cut to the left and red snips cut to the right. [8] X Research source"
    },
    {
      "title": "Wear a pair of heavy-duty gloves and put your metal on a flat surface.",
      "content": "Wear a pair of heavy-duty gloves and put your metal on a flat surface. You're going to be handling the edge of the corrugated metal when you cut with snips, so you have to wear a thick pair of construction gloves to make sure that you don't cut yourself. After you've got your gloves on, place your metal on a flat and stable surface. [10] X Research source"
    },
    {
      "title": "Hold the side of the metal sheet and put your snips around the edge.",
      "content": "Hold the side of the metal sheet and put your snips around the edge. Use your nondominant hand to hold the side of the metal. This will not only brace it to keep it in place, but you'll be able to pull it up as you cut. Hold the snips loose in your hand and place the two blades around the edge that you'd like to cut. [11] X Research source"
    },
    {
      "title": "Press and release the snips repeatedly to cut across the metal.",
      "content": "Press and release the snips repeatedly to cut across the metal. Press on the handles of the snips to make a cut into your corrugated metal. Release the handles to free them and push them forward a little bit before repeating the process. As you cut, lift the excess section of metal upwards with your nondominant hand to create space for your dominant hand to continue cutting. [12] X Research source If you're doing it correctly, it will feel like you're cutting with a pair of scissors! Be careful not to drop the section that you're holding in your nondominant hand, or you'll risk losing control of the snips or cutting your arm on the edge. This method works best for cutting smaller sections of sheet metal or cutting at an angle."
    },
    {
      "title": "Attach a continuous diamond wheel to your angle grinder.",
      "content": "Attach a continuous diamond wheel to your angle grinder . Loosen the nut on an angle grinder and remove it. Slip any continuous diamond wheel on top of your angle grinder and tighten the flange nut. Lock it into place with the spindle lock by turning it all the way to the right until it won't go any further. [13] X Research source"
    },
    {
      "title": "Set the section that you're cutting over the edge of your work surface.",
      "content": "Set the section that you're cutting over the edge of your work surface. Set you corrugated metal flat on top of your work surface or sawhorses. If it's heavier sheet metal, you don't need to worry about weighing it down. If it's thinner corrugated metal, weigh it down with a heavy object. Stacking several sheets of corrugated metal on top could work as well."
    },
    {
      "title": "Tighten the grinder blade and put both hands on top of your angle grinder.",
      "content": "Tighten the grinder blade and put both hands on top of your angle grinder. Check your angle grinder's disc to ensure that it's tight by pulling on the lip of the disc to see if it moves. If it budges, lock your disc in place with the spindle-lock button on top. Then, tighten the nut in the middle of your disc with a wrench before releasing the spindle lock. Put both hands on the two handles on top of your grinder. [14] X Research source Make sure that your grinder is off before tightening the disc. Never remove the safety guard from your angle grinder. Never take both hands off of your angle grinder when you're using it."
    },
    {
      "title": "Put on your gloves and welding helmet.",
      "content": "Put on your gloves and welding helmet. Not only are the edges of corrugated sheet metal going to be sharp and jagged, but there will be sparks coming from the angle grinder. Wear a thick pair of gloves and a protective welding helmet before grinding your corrugated metal. [15] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source Wear long sleeves and pants as well for an extra layer of protection against the sparks that will come off of your grinder."
    },
    {
      "title": "Hold the angle grinder at a 45-degree angle towards your metal and turn it on.",
      "content": "Hold the angle grinder at a 45-degree angle towards your metal and turn it on. Flip the safety off and turn your angle grinder on. Wait for it to reach full power and then press it against the area where you want to start your cut. You don't need to apply much pressure. The friction generated from the blade of the angle grinder will pull it slightly forward. [16] X Research source"
    },
    {
      "title": "Push the grinder slowly across the path that you're cutting.",
      "content": "Push the grinder slowly across the path that you're cutting. Move carefully and slowly and keep both hands on the handles of the angle grinder. Guide the angle grinder from above and press it downwards at a 45-degree angle as you cut. Push the grinder all the way through the end of your metal and let the excess piece of metal fall freely to the floor. [17] X Research source You have more control when cutting with an angle grinder, so you can use it to make freeform and round cuts by rotating your grinder slowly as it turns. Using an angle grinder has the added benefit of leave a smooth edge, since the side of your grinder is designed to cut through materials as well."
    }
  ]
}