{
  "url": "https://www.wikihow.com/Do-a-Scorpion-in-Cheerleading",
  "title": "How to Do a Scorpion in Cheerleading",
  "steps": [
    {
      "title": "Warm up with a 10-minute aerobic routine.",
      "content": "Warm up with a 10-minute aerobic routine. It is recommended to complete your choice of aerobic exercise before starting your stretching routine. This will help to loosen your muscles and stretch further. You can complete any exercises that you’re most comfortable with. Try a slow jog, skipping, lunges, or side jumps. If you want, you can do a combination of all 4. Make sure you exercise for at least 10 minutes. Keep in mind that this is just a warm-up to loosen your muscles and prevent injury. You don’t need to push yourself to exhaustion."
    },
    {
      "title": "Stretch your arms, shoulders, and chest for 10 minutes daily.",
      "content": "Stretch your arms, shoulders, and chest for 10 minutes daily. It is important to stretch your upper body on a daily basis until your body is flexible and loose. Start with wide arm circles to loosen up your shoulder joints. Then complete a series of stretches that will stretch your upper body. It’s important to stretch your arms before you attempt the scorpion because a part of the move involves bending your arms back to reach your foot. Aim to hold each stretch for at least 25 seconds. Some popular arm stretches include the following: [1] X Research source Modified dragonfly arms: Bring one of your arms across your body toward your collarbone. Keeping it straight, pull it with your free arm and stretch it for 10 seconds. Repeat this motion with your other arm. Triceps stretch: Reach your arm over your head towards your back so that your hand touches the opposite shoulder blade. Use your other arm to pull your elbow and get a nice stretch. Chest stretch: Keep your arms straight while you bring them behind your back with your palms together. Slowly raise them up as much as you can to do a good chest stretch."
    },
    {
      "title": "Master various splits to increase flexibility in your legs.",
      "content": "Master various splits to increase flexibility in your legs. Mastering various split positions will help you to prepare for a scorpion because it requires you to completely lift your leg. Complete a front split by bringing one leg in front of your body and slowly lowering your body with your other leg stretched behind you. Perform a straddle split by standing in an upright position and slowly pushing your feet outward until your bottom is touching the ground. Make sure your knees are facing the ceiling and your toes are pointed. [2] X Research source For an extra stretch during the straddle split, do side reaches by bending your torso and touching your arms to your toes. Performing a split can be tricky, especially if you’re a beginner. Don’t push yourself too hard and risk injury to your groin muscles."
    },
    {
      "title": "Do backbend holds to practice arching your back.",
      "content": "Do backbend holds to practice arching your back. Doing backbend holds help you to arch your back, which is an important feature of the scorpion move. To complete a backbend, stand up straight with your legs shoulder-length apart. Raise your arms above your head and slowly bend backward as you push your thighs forward. Lock your arms in place as you bend back and plant them firmly on the ground. Arch your back while you’re in this position so that you’re head is completely upside down and you’re looking between your arms. [3] X Research source Make sure to hold this pose for at least 10 seconds. You can add some variation to your backbends by completing a straight leg bridge and moving your legs as close to your head as possible."
    },
    {
      "title": "Stand up straight and lift your leg up behind you.",
      "content": "Stand up straight and lift your leg up behind you. Start with your arms at your sides and look straight ahead. Bend the knee of the leg that you will use as your back leg. Typically, your standing leg will be your dominant leg, so if you’re right-handed, your right leg will be the one holding you up and your left leg will be the one you lift. [4] X Research source Make sure that you're standing on a comfortable surface that isn't too hard. A hard floor will hurt your feet and may make the move more difficult. If you're doing a scorpion for the first time, you should try this move with a spotter, which should ideally be either one of your teammates or your coach."
    },
    {
      "title": "Grab the outer side of your back foot with the hand from that same side.",
      "content": "Grab the outer side of your back foot with the hand from that same side. If your back leg is your left leg, grab it with your left hand. You can do this by twisting your hand and arm outwards and then behind you so that the back of your hand is facing your thigh. [5] X Research source Make sure your palm is facing the inside of your foot. Your back should be slightly flexed backward, and your standing leg should be straight and firmly locked so you don’t buckle. For better balance, keep your free hand at your side or on your hip. You can also temporarily hold on to the wall."
    },
    {
      "title": "Push your back foot up towards the ceiling.",
      "content": "Push your back foot up towards the ceiling. Do not use your hand to pull your leg up. Instead, just try your best to use your leg strength to push it up on its own. The only thing your hand should do at this point is guide the direction of your leg and keep it in position. [6] X Research source"
    },
    {
      "title": "Push your leg higher with your arm as you turn your elbow outward.",
      "content": "Push your leg higher with your arm as you turn your elbow outward. Push your leg as high as it can go while firmly gripping it with your arm. Once your foot is about as high as your ear, turn your elbow outward so that it is pointing forward, in front of your head. Remember to keep your standing leg locked as you do this, or you will buckle. [7] X Research source Always push your leg up, not back. Pushing your leg up will make it easier for you to grab it with your other hand. If you push your leg back too much, it will be hard to reach it with your other hand."
    },
    {
      "title": "Grab your back leg with your other hand.",
      "content": "Grab your back leg with your other hand. As you’re continuing to push your leg higher, start lifting your other hand to get ready to grab your back leg. Reach as far back behind you as you can with your other hand and grab the raised leg behind you. [8] X Research source If you're having trouble reaching the leg, you can start by grabbing the wrist of the hand that's holding your foot, then work your way back to your leg."
    },
    {
      "title": "Use a stunt strap to improve your flexibility and posture.",
      "content": "Use a stunt strap to improve your flexibility and posture. A stunt strap is a long durable strap that can be used to assist with various cheerleading moves. Using a stunt strap is a great tool if you’re having trouble mastering the scorpion. To use the strap, wrap the loop around your foot, then apply the above steps to bring your leg back and up. Hold the other end of the strap with both hands and bring them up over your head until the move is complete. [9] X Research source"
    },
    {
      "title": "Recruit 3 experienced cheerleaders to help you with this stunt.",
      "content": "Recruit 3 experienced cheerleaders to help you with this stunt. To perform a scorpion in the air as a flyer, you’ll need at least 3 other people to assist you. Two of your helpers, called ‘bases,’ will stand on either side of you to lift you up and hold your leg, while the third person stands behind you as your spotter. Make sure to trust your spotter. It’s an important cheer position, and if you fall they will catch you. [10] X Research source Your safety is a priority. You and your helpers should be experienced with cheerleading lifts and stunts before attempting this move in the air."
    },
    {
      "title": "Have your two bases hold your foot to prepare for the lift.",
      "content": "Have your two bases hold your foot to prepare for the lift. With your bases standing on either side of you, lift up your dominant leg so it bends at the knee. This will be your standing leg during the stunt. The bases will hold the bottom of your foot with one hand, and your ankle with their other hand. [11] X Research source Your spotter should stand behind you and hold your waist for extra support. Place your hands on your bases’ shoulders to keep balance."
    },
    {
      "title": "Sink down and push up with your knees and arms to lift yourself in the air.",
      "content": "Sink down and push up with your knees and arms to lift yourself in the air. As the flyer, it is your job to assist with pushing yourself up. Bend at your knees, sink down, then carefully push yourself up. You can also use your arms to push yourself up from your bases’ shoulders. [12] X Research source Your bases will grab your foot and push their arms up to move you up and offer support and balance while you’re in the air."
    },
    {
      "title": "Lock your legs and keep your body tight.",
      "content": "Lock your legs and keep your body tight. While you’re being pushed up, make sure you lock your legs so they are straight. They should not be bent at all. Your upper body should be straight and tight as well. If you bend forward or back at all, you risk falling over. [13] X Research source Make sure your helpers are holding both the bottom of your feet and ankles as well in order to help you keep balance throughout the stunt."
    },
    {
      "title": "Bring your free leg back to complete the scorpion move.",
      "content": "Bring your free leg back to complete the scorpion move. Once stabilized in the air, you can begin to perform your stunt. Use your arm to bring your free leg back and up to do the scorpion. [14] X Research source You need to continue to keep your leg locked in order to stay balanced while doing the move."
    }
  ]
}