{
  "url": "https://www.wikihow.com/Fix-Fudge",
  "title": "How to Fix Fudge",
  "steps": [
    {
      "title": "Add solid chocolate or fat if the chocolate was overcooked.",
      "content": "Add solid chocolate or fat if the chocolate was overcooked. If the temperature of your fudge gets a little too high, the sugars in the chocolate will clump up and separate from the fats. This creates a lumpy mess, but you may be able to save it. Put a few squares of solid chocolate into the bowl with the seized fudge and stir everything together until the solid chocolate melts. That could help reintegrate the fudge. [1] X Research source You might also be able to add a little bit of cocoa butter or vegetable oil to the mixture. There aren't any exact measurements for this—start with maybe 1 ⁄ 4 tsp (1.2 ml) and work your way up from there. You may not get the same perfectly smooth fudge as you would have before, but it's better than wasting all of that yummy chocolate! If the chocolate was scorched, it will have a burnt taste, so just throw it out. [2] X Research source Also, the next time you use that recipe, consider shortening the boiling time. [3] X Research source"
    },
    {
      "title": "Make a fudge sauce if the chocolate seized from liquid or cold.",
      "content": "Make a fudge sauce if the chocolate seized from liquid or cold. Chocolate is finicky. If even a little bit of moisture gets into your bowl, the fudge will seize. The same thing will happen if the chocolate gets cold too quickly. In either case, there's not really anything you can do to save the fudge. However, you can still enjoy the chocolate by adding milk or cream to create a delicious fudge sauce. [4] X Research source Place the fudge over low heat and slowly whisk in about 1 US tbsp (15 ml) of milk or cream at a time. Keep adding liquid and stirring until the fudge sauce is thick, glossy, and smooth."
    },
    {
      "title": "Add 3–4 US tbsp (44–59 ml) of whipping cream and remelt the fudge.",
      "content": "Add 3–4 US tbsp (44–59 ml) of whipping cream and remelt the fudge. If you let your fudge get too hot, the sugars will start to concentrate and the fudge will be crumbly, dull, and hard. [5] X Research source To fix it, put it back into the saucepan and add about 3–4 US tbsp (44–59 ml) of 35% fat whipping cream. Stir the mixture as you heat it until the sugar in the fudge is melted. Then, stop stirring and let the fudge boil until it reaches 237–239 °F (114–115 °C). [6] X Research source Once the fudge reaches the right temperature, take it off the heat and let it cool to 110–122 °F (43–50 °C), then beat the fudge as you normally would."
    },
    {
      "title": "Bring the fudge back to a boil with 1–2 US tbsp (15–30 ml) of cream.",
      "content": "Bring the fudge back to a boil with 1–2 US tbsp (15–30 ml) of cream. If your fudge is soft or runny, it probably didn't come up to a high enough temperature while it was cooking. Put it back into the saucepan and add 1–2 US tbsp (15–30 ml) of 35% fat whipping cream. Stir the fudge as it heats, but only until the sugar in the chocolate is completely melted again. Then, let the fudge come to a boil without stirring it at all. When it reaches 237–239 °F (114–115 °C), take it off the heat and let it cool to 110–122 °F (43–50 °C) before you stir it again. Your fudge also might become soft if it's too humid in your kitchen. If you think that might be the case, add 1 °F (1 °C) to your cooking temperature. [7] X Research source"
    },
    {
      "title": "Maybe—try stirring in whipping cream over low heat.",
      "content": "Maybe—try stirring in whipping cream over low heat. If your fudge came out grainy, there's a good chance that you didn't let it cool enough before you stirred it. Put it back in the pan over very low heat. Break the chocolate up with a spoon and add 2 US tbsp (30 ml) of whipping cream. Stir until the fudge is warm and slightly softened, then take it off the heat and beat the fudge again. [8] X Research source When you beat the fudge while it's too warm, the chocolate develops large crystals—that's what gives it that grainy texture. Re-beating the fudge can help smooth those out, but it won't always work. It's worth a try, though!"
    },
    {
      "title": "It won't set correctly.",
      "content": "It won't set correctly. When you beat the fudge, the sugar in the chocolate starts to crystallize. Letting the chocolate cool first creates small crystals, which is what gives fudge its smooth, creamy texture. However, if you don't beat it at all, the crystals won't form properly, so your fudge won't set. [9] X Research source If you forget to beat the fudge, try heating it back up over low heat, then beat it once it's slightly softened. If you beat the fudge too soon, the crystals will be too large, and the fudge will be grainy."
    },
    {
      "title": "The fudge will become hard.",
      "content": "The fudge will become hard. When you're beating fudge, watch for the chocolate to become thick enough that it can almost hold its shape when you drop it from your spoon. When that happens, it's time to stop stirring. Mix in anything you're adding to the fudge, like nuts, and pour it into the pan to set. [10] X Research source If you accidentally overbeat the fudge and you notice it's starting to get stiff, take it out of the saucepan and put it onto a piece of wax or parchment paper. Knead it with your hands until you can easily shape it. Then, roll it into 1–2 in (2.5–5.1 cm) balls, or shape it into logs that you can slice into fudge rounds."
    },
    {
      "title": "Don't rush this process.",
      "content": "Don't rush this process. Never put fudge in the fridge or freezer to cool quickly. It needs to cool slowly in order to develop that perfect texture. If you get the chocolate cool too fast, the crystals in the fudge will develop too early, and your fudge will be grainy and lumpy. [11] X Research source"
    }
  ]
}