{
  "url": "https://www.wikihow.com/Flirt-with-a-Capricorn-Man-over-Text",
  "title": "How to Flirt with a Capricorn Man over Text: Tips & Examples",
  "steps": [
    {
      "title": "Take initiative since a Capricorn can be cautious and unsure of himself.",
      "content": "Take initiative since a Capricorn can be cautious and unsure of himself. [2] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Send a friendly, polite message to catch his attention, and if he's interested, a response will follow quickly. With a simple first text , you can let your Capricorn know that you like him and help him overcome his insecurities. \"Hi! I know I'm supposed to wait a few days before texting, but I can't help myself. 😉\" \"Hey there! I really enjoyed meeting you the other day. How've you been since then?\""
    },
    {
      "title": "Capricorns like to be in control when it comes to flirting and romance.",
      "content": "Capricorns like to be in control when it comes to flirting and romance. Once you've started the conversation, let him take it from there. Send an open-ended text so he can decide where the conversation goes, and wait for him to initiate the next couple of text conversations. And, since you sent the first text, let him be the one to ask for a first date! [3] X Research source “I’m terrible at starting conversations. Do you want to try? 😉” “You choose: should I start with a cheesy pick-up line, a compliment, or a simple hello?” “I like you. What are you going to do about it?”"
    },
    {
      "title": "Ambitious Capricorn guys need to feel appreciated for their hard work.",
      "content": "Ambitious Capricorn guys need to feel appreciated for their hard work. [4] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Ask him about his career and be sure to compliment all of his successes. Capricorns have the biggest egos of any zodiac sign, so recognizing his achievements will make him feel special and encourage him to flirt back. \"I think it's so cool that you're writing a novel in your spare time. I'll be first in line to read it someday! 🤩\" \"You've worked hard to get to where you are in life, and it shows. Your dedication is inspiring!\""
    },
    {
      "title": "Opinionated Capricorns are drawn to people with similar interests.",
      "content": "Opinionated Capricorns are drawn to people with similar interests. Ask questions to learn about the things your Capricorn is most passionate about, and look for any common subjects that you can talk over in-depth. Don't be afraid to bring up more complicated topics like philosophy and politics because he's intellectual and likely finds them fascinating. \"It's crazy how much you know about classic cinema! Would you show me your favorite film sometime?\" \"I'm so happy that you're interested in true crime too! What's your favorite documentary?\" Text him a link to an article. \"You're into politics, right? I'm interested in hearing your thoughts on this.\""
    },
    {
      "title": "Capricorn guys might come off as serious, but they love to laugh.",
      "content": "Capricorn guys might come off as serious, but they love to laugh. [5] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. This sign has a dry and clever sense of humor, especially when making light of a dark situation. Send your Capricorn a funny text when he's feeling stressed or taking life a little too seriously, and show him that you can make him laugh no matter the situation. \"You know what they say: if at first you don't succeed, blame someone else and seek counseling. 🤪\" Send him a totally deadpan text message and follow it up with a funny GIF, so he knows you're joking. Capricorn guys don't like vulgarity. Make sure you're sticking to clean, witty humor and saving inappropriate jokes for someone else!"
    },
    {
      "title": "Appeal to his love of mystery with pics that don't reveal too much.",
      "content": "Appeal to his love of mystery with pics that don't reveal too much. Send him a selfie that makes you look neat and flirty without showing much skin. Most guys are attracted to visuals and photos, and a Capricorn guy is no exception—but his traditional outlook on romance means he's more intrigued when you leave something to the imagination. [6] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Wear a flattering outfit when you take the picture. Pick simple and classic clothes to impress your Capricorn. Avoid sending photos where you look messy, like post-workout pics or early morning selfies. The more put-together you look, the better. You don't need to be scantily clad to attract a Capricorn! Just look into the camera and give him a flirty smile to catch his eye."
    },
    {
      "title": "Dirty talk will bother an old-fashioned Capricorn.",
      "content": "Dirty talk will bother an old-fashioned Capricorn. Make him smile with sweet-natured flirty texts that only use clean language. Hint that you are looking forward to seeing him or make a flattering comment about his appearance, without being overly suggestive. Your Capricorn will prefer to keep things classy and polite while you're still getting to know each other. \"I loved that pic you posted on Instagram! You look so dashing.\" \"I think you'll like the outfit I'm wearing tonight. I picked it with you in mind! 😉\" \"I've been thinking about you all day. Can't wait to see you tomorrow!\""
    },
    {
      "title": "A practical Capricorn values protocol and routine.",
      "content": "A practical Capricorn values protocol and routine. [7] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Flirt in a way that highlights how reliable you are! Send your Capricorn sweet messages on a regular basis, so that your texts become part of his weekly routine. When you text him to make plans, reply quickly and follow through on every commitment. If he sees how reliable you are, he won't be able to resist you. “Here's a kitten video to help you beat the Monday blues. It’s a weekly dose of cuteness, from me to you! 😁” “Fun fact of the week: otters hold hands when they sleep so they don’t float apart. Cute, right?” “Thanks for inviting me out for a drink! I’ll see you at 6 PM sharp. I’d never keep a guy like you waiting!”"
    },
    {
      "title": "A Capricorn is a negative sign, so he likes being around optimistic people.",
      "content": "A Capricorn is a negative sign, so he likes being around optimistic people. He's prone to being critical and pessimistic, so balance him out with happy thoughts. Send kind and lighthearted texts, and avoid weighing him down with heavy emotions or negativity. He might withdraw if you only text him to complain or get sympathy. [8] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. \"Have a great day at work, handsome! You're going to be amazing. 😘\" \"I know it's been a tough week, but just think about the weekend! We've got a date, and I think it's going to be so much fun. 😁\""
    },
    {
      "title": "Match Capricorn's direct and concise texting style.",
      "content": "Match Capricorn's direct and concise texting style. He doesn't need long, emotional paragraphs filling up his phone screen. Your Capricorn is an efficient communicator, and he'll be more open to flirting with someone who can do the same. [9] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Limit your flirty texts to one or two sentences. Keep them short and sweet to catch his eye! There's a difference between being concise and rude. Make sure every text still feels polite. Add an exclamation or simple smiley face if a text seems cold. For example: if he texts you and asks you out for a coffee, confirm by texting \"Sure. I can't wait!\" rather than \"Yep.\" While it's shorter, the first text is still concise—and kinder too."
    },
    {
      "title": "Too many texts can make a reserved Capricorn feel overwhelmed.",
      "content": "Too many texts can make a reserved Capricorn feel overwhelmed. Even if he takes time to respond, avoid double-texting or sending a stream of follow-up messages. [10] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Send one text and let him respond before sending another. If it's been more than a day, feel free to follow up, but otherwise, take a step back and give him time to text you. Capricorn guys are especially unlikely to respond during work hours because they're so driven and focused. Don't take it personally if you text him in the morning and get a response in the evening! If he's slow to text, ask your Capricorn to call you instead. He'll probably agree; Capricorn isn't the most text-savvy sign and gravitates toward old-school methods of communication."
    }
  ]
}