{
  "url": "https://www.wikihow.com/Dissolve-Kidney-Stones",
  "title": "How to Dissolve Kidney Stones",
  "steps": [
    {
      "title": "Look into medication.",
      "content": "Look into medication. If you have trouble passing small stones on your own, your doctor may prescribe a type of medication called an alpha blocker, which relaxes the muscles in your ureter to help you pass the stones more easily. This should be sufficient for smaller stones, but you may need extra help to pass larger ones. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have uric acid kidney stones, then a course of potassium citrate might be in order so that the stones dissolve on their own. [2] X Research source"
    },
    {
      "title": "Get extracorporeal shock wave lithotripsy (SWL).",
      "content": "Get extracorporeal shock wave lithotripsy (SWL). This procedure uses sound waves to break up large stones, making them easier to pass. Since the procedure can be painful, patients are usually placed under anesthesia during the 30 to 45 minute process of pulverizing the stones. This is an effective treatment, but it can cause bruising and pain as the small pieces of stone eventually pass."
    },
    {
      "title": "See if the stone can be removed with a ureteroscope.",
      "content": "See if the stone can be removed with a ureteroscope. Stones that are too large to be broken up with shock wave therapy, but too small to require surgery may be removed with a scope that is inserted into the ureter. Once the stone is located, it is broken up using small tools. Since the procedure can be painful, it usually requires either local or general anesthesia."
    },
    {
      "title": "Have percutaneous nephrolithotomy surgery.",
      "content": "Have percutaneous nephrolithotomy surgery. For large stones that can't be broken into bits using shock wave therapy, surgery may be required to remove them. A small incision is made in the patient's back, and a tiny instrument is inserted to remove the kidney stone or stones. The surgery requires an overnight stay in the hospital. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "See if thyroid treatment is necessary.",
      "content": "See if thyroid treatment is necessary. In some cases, calcium kidney stones are caused by hyperparathyroidism, which is when the parathyroid glands produce too much parathyroid hormone. This can happen when a small tumor grows on a parathyroid gland, or when a separate condition causes the parathyroid to overproduce parathyroid hormone. Once your doctor has determined the cause of the hyperparathyroidism, he or she will recommend the proper course of treatment to correct the problem."
    },
    {
      "title": "Drink several quarts of water every day.",
      "content": "Drink several quarts of water every day. No matter what type of stone you have, kidney stones smaller than 5 millimeters will usually pass on their own, without the need for medical intervention. If you can feel your kidney stone but it isn't painful enough to require treatment, your doctor will probably advise drinking 2 to 3 quarts of water daily until the stone passes. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Staying extremely well hydrated will help flush the kidney stone from your system. Aim to drink enough water to produce mostly clear urine. Clear urine is an indication that your body is extremely well hydrated. Non-caffeinated, sugar and alcohol free beverages like ginger ale, fruit juice, cranberry juice, or green tea could also help you stay hydrated. Avoid beverages with caffeine, artificial sweeteners, sugar, or alcohol while you're trying to pass a kidney stone."
    },
    {
      "title": "Make dietary changes to shrink stones.",
      "content": "Make dietary changes to shrink stones. Since kidney stones are caused by the buildup of certain minerals, eating fewer foods containing these minerals can help to shrink the stones. This is especially effective if you have either calcium or uric acid stones. If you have calcium stones, cut back on the following foods that make the problem worse: salty foods, dairy products, oysters, tofu, and fatty foods. [5] X Research source If you have calcium oxalate stones, you should avoid foods high in oxalate, like rhubarb, grapes, spinach, sweet potatoes, coffee, and chocolate. If you have uric acid stones, cut back on the following foods containing uric acid: organ meat like liver and kidney, anchovies, sardines, beans, mushrooms, spinach, cauliflower, yeast, and alcohol."
    },
    {
      "title": "Drink beverages containing lemons every day.",
      "content": "Drink beverages containing lemons every day. Whether you drink real lemonade, lemon juice, lemon-lime drinks or just water with a few lemon slices, the acidic nature of citrus helps so that kidney stones do not form. [6] X Research source"
    },
    {
      "title": "Try herbal remedies.",
      "content": "Try herbal remedies. While no herbal remedy has been scientifically proven to remove kidney stones, many have found that consuming certain herbs, especially in the form of tea, can help to shrink the stones so they pass more easily. Try the following herbs in order to treat a mild kidney stone: Birch leaf tea, which is said to help remove waste products from the urinary system. [7] X Research source Black tea, which increases urine flow since it is a diuretic. Nettle leaf, which is also a diuretic and can help flush the kidney stones from your system. Dandelion root, which is said is to be an effective kidney tonic. Apple cider vinegar, which is said to help dissolve stones. You can consume 1 tablespoon (14.8 ml) of apple cider vinegar each day, or mix it with water. Avoid using sorrel, which can cause calcium oxalate kidney stones to worsen. Banana stem juice is a well-known treatment for kidney stones in India."
    },
    {
      "title": "Determine if you really have a kidney stone.",
      "content": "Determine if you really have a kidney stone. While not all kidney stones cause people to have symptoms, even very small stones can cause severe pain. If you've already had a few kidney stones in your life, you might be reasonably sure that's what's going on. However, since the symptoms of a kidney stone overlap symptoms of many other disorders, it's a good idea to receive a diagnosis so you can treat it properly. Here are the most common symptoms of kidney stones: Severe pain in the side and lower back, which often spreads to the abdomen and groin. Pain that comes and goes in waves, and is present during urination. Foul-smelling, cloudy, pink or brown urine. Nausea and vomiting."
    },
    {
      "title": "Visit a doctor to get an imaging test.",
      "content": "Visit a doctor to get an imaging test. Getting an x-ray, CT scan or ultrasound (depending on what your doctor recommends) when you notice the symptoms of a kidney stone is the best way to determine how you should treat the stone. Imaging technology can will reveal the size, shape and number of stones you're dealing with. If you have a stone smaller than 5 millimeters, your doctor will probably advise using at-home methods to help the stone pass. If you have a larger stone or multiple stones, your doctor may prescribe a medication or recommend a different course of medical treatment to pulverize the stones so you can pass them."
    },
    {
      "title": "Figure out what kind of stones you have.",
      "content": "Figure out what kind of stones you have. Kidney stones produce the same symptoms, but they can be caused by several different conditions. Knowing what's causing the formation of your kidney stones will help you reduce their size and prevent them in the future. Your doctor may perform blood or urine tests to figure out what type of stones you have. After you pass a stone, your doctor might send it to a lab for analysis to determine its makeup. Here are the different types of kidney stones: Calcium stones : these are the most common type of stones, and are caused by a high level of calcium combined with another substance, such as oxalate or uric acid. Doctors may prescribe a thiazide diuretic or phosphate containing preparation in order to get rid of these stones. Uric acid stones : these form when the urine contains too much acid. Doctors will prescribe allopurinol, which may help dissolve the kidney stone. Also, they may prescribe potassium citrate to lower the pH of the urine and dissolve the uric acid stone. Struvite stones : these can form after a urinary tract infection. To prevent struvite stones, your doctor might suggest that you keep your urinary tract clean and free of infections. Cystine stones : this type of stone is caused by a rare genetic disease. These are more difficult to treat. Your doctor may have your drink more fluids or prescribe you medication that reduces the amount of cystine in the urine. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}