{
  "url": "https://www.wikihow.com/Find-Out-the-Outcome-of-a-Court-Hearing",
  "title": "How to Find Out the Outcome of a Court Hearing",
  "steps": [
    {
      "title": "Find where the hearing is held.",
      "content": "Find where the hearing is held. If you aren’t a party to the lawsuit, then you will need to find out where the hearing is held. Different courts make this information public in different ways. Some courts, like those in Philadelphia, have a website you can visit. From there, you can search by the defendant’s name, the attorney’s name, date, or by courtroom. [1] X Research source In other courts, you might have to call the court clerk and ask when a hearing is scheduled. You might also ask one of the parties if you know them. They can tell you the courtroom and the date of the hearing."
    },
    {
      "title": "Go to court.",
      "content": "Go to court. Hearings are usually held in open court. [2] X Research source Even if you are not a party to the lawsuit, you can sit in on the hearing. You will then be able to hear for yourself the outcome of the hearing."
    },
    {
      "title": "Send a representative.",
      "content": "Send a representative. You could have someone else sit in on the court hearing for you. This person could then report back to you about the hearing’s outcome. If you are a party to the lawsuit, then you could have a lawyer represent you. The lawyer is authorized to speak on your behalf."
    },
    {
      "title": "Get the date of the hearing.",
      "content": "Get the date of the hearing. Courts that store court documents electronically will ultimately add the judge’s order for the hearing you want to know about. You will log onto the electronic system and pull up the order. However, to search electronically, you will need to know the date of the hearing, otherwise, you could be scrolling through all of the case documents uploaded into the system."
    },
    {
      "title": "Use an online system.",
      "content": "Use an online system. The website https://legaldockets.com has links to electronic court records for states around the U.S. Visit the website and then click on a state or territory. You will then be presented with a list of courts for which legal dockets have links. Click on a link to the court. You will then have to provide sufficient information to perform a search. The amount of information will vary from court to court. For example, to search the Cook County, Illinois Docket Search, you will need the court division (civil, chancery, domestic relations, etc.) and the case number. Or, you may search by defendant or plaintiff name. [3] X Research source A list of results will show up. You should click on the case that is relevant. Scroll down to find the relevant hearing. The website should either tell you the outcome of the hearing or it will provide you with a microfilm number. You can use the microfilm number to pull up the judge’s order itself at the courthouse and find out the outcome."
    },
    {
      "title": "Check PACER for a federal case.",
      "content": "Check PACER for a federal case. In the U.S., the federal court system runs independently of the state court system. PACER collects all of the documents filed in a case, including the judge’s order entered after a hearing. You can visit PACER at www.pacer.gov. You must register for free. [4] X Research source Once you register, you can use the PACER Case Locator to search for cases by party name. From the list of search results, click the lawsuit that you are interested in. Then click “Docket Report” and “Run Report.” From the list, scroll down until you see the hearing. You can click on the number hyperlink to the left, in the “#” column. You can retrieve a PDF of any opinion or order. If you need help, you can call the PACER hotline at (800) 676-6856 from 8:00 am to 6:00 pm, Monday through Friday Central Standard Time. You may also email pacer@psc.uscourts.gov. [5] X Research source"
    },
    {
      "title": "Call the court where your hearing was held.",
      "content": "Call the court where your hearing was held. Depending on the court, you might be able to call the court clerk and ask about the hearing result. Depending on the court's procedure, the clerk may be able to give you the results of your hearing over the phone. However, some courts will be so busy that you may be directed to an electronic system."
    }
  ]
}