{
  "url": "https://www.wikihow.com/Flush-Your-Kidneys",
  "title": "How to Flush Your Kidneys",
  "steps": [
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Long-term dehydration can prevent your kidneys from functioning properly. Drink whenever you feel thirsty, and drink enough to keep your urine the color of straw. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source It's a myth that additional water beyond this baseline will help flush your kidneys, but it will help prevent kidney stones in at-risk groups. [3] X Research source"
    },
    {
      "title": "Balance your diet.",
      "content": "Balance your diet. The foods you eat are very important to your kidney health. When you are trying to flush your kidneys, pay particular attention to your diet. You should always aim to eat healthfully, but it is especially important when you are supporting a major organ like your kidneys. Focus on eating whole grains, fresh fruits, fresh or frozen vegetables, and low-fat or fat-free dairy products. Try to steer clear of foods high in salt and sugar. [4] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source A few good options include apples, plums, grapes, berries, cherries, turnips, onions, eggplant, cauliflower, eggs, lean meat (such as poultry and fish), pasta, unsalted crackers, white bread, bagels, and sandwich buns. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Try adding leafy greens, tomatoes, blueberries, and herbs to your diet as well. [6] X Research source"
    },
    {
      "title": "Reduce your sodium intake.",
      "content": "Reduce your sodium intake. Diets that are high in sodium lead to a greater risk of high blood pressure. This can result in extra strain on the kidneys. Reducing the sodium in your diet is an excellent way to promote overall health, especially for your kidneys. [7] X Research source Eat fresh fruits and vegetables. Fresh varieties contain lower amounts of sodium than canned options. Read labels. Start scanning ingredient lists to make sure the foods you purchase do not have high sodium content. Canned soups are an obvious one to avoid. Compare products to make sure you buy the one with the lowest amounts of sodium. Look for products that are advertised as low-sodium."
    },
    {
      "title": "Drink natural juice.",
      "content": "Drink natural juice. Because your kidneys are your body's filtration system, they can collect some buildup. Drinking natural juice with no added sugars is a good way to stay hydrated while delivering nutrients to your body. Drinking juice is a great way to get nutrients if you aren’t a fan of eating fruits and veggies. Just be sure to choose juices without added sugars. However, if you have kidney disease or failure, or a condition like diabetes, juice might not be the best option for you. Speak to your doctor or dietician before adding juice to your diet. [8] X Research source"
    },
    {
      "title": "Take herbal supplements with caution.",
      "content": "Take herbal supplements with caution. Many herbs are traditionally used to treat kidney problems, but overusing them or taking them in combination with other herbs or medication can end up causing more harm than good. Always talk to your doctor before beginning any dietary supplement. [9] X Research source Dietary supplements are especially risky if you have kidney disease, or if you are taking other medication. [10] X Research source Even beneficial supplements such as vitamin C or cranberry tablets can be harmful if taken in large amounts. [11] X Research source To avoid contaminated products, look for supplements with a seal of approval from an independent organization, such as Consumer Lab, NSF International, or U.S. Pharmacopeia. [12] X Research source"
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Physical exercise can help you avoid weight gain and high blood pressure, both of which put unnecessary pressure on your kidneys. Keeping your body healthy can help your kidneys function properly. Aim to get at least 30 minutes of physical activity each day. [13] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Look for an activity that you enjoy. For example, if you like to walk, recruit a friend and schedule a standing date to explore your neighborhood. If you like to swim, look for a community pool in your area. If you're new to exercise, consult your doctor before beginning any program."
    },
    {
      "title": "Quit smoking",
      "content": "Quit smoking . If you smoke, quitting can help improve not only your overall health, but will greatly benefit your kidneys. [14] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Smoking impedes blood flow to vital organs, including your kidneys. This means that they cannot effectively flush toxins from your body. Quitting smoking is hard, but there are many resources you can use. Ask your doctor about medication or nicotine cessation products such as gum or patches."
    },
    {
      "title": "Take medicines as directed.",
      "content": "Take medicines as directed. While there are many benefits to medications, there can also be side effects. Some prescription medications have been known to cause damage to the kidneys. Make sure to discuss this possibility whenever your doctor issues you a prescription. [15] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Over-the-counter pain killers (especially the NSAIDs such as ibuprofen, Aleve, and Motrin) can also cause damage to the kidneys if taken on a regular basis. They are fine for occasional use, but talk to your doctor about alternatives if you need to treat chronic pain and have concerns about your kidney health. Acetaminophen is generally considered safer. [16] X Research source"
    },
    {
      "title": "Learn why your kidneys are important.",
      "content": "Learn why your kidneys are important. You'll be better able to take care of your kidneys if you understand how essential they are for your health. Your kidneys remove waste from your body—think of it as your filtration system. Without your kidneys, your levels of sodium and potassium could reach harmful levels. [17] X Research source Try to create habits that lead to good overall health. For example, try limiting your caffeine and alcohol intake. You'll see multiple health benefits, and your kidneys will thank you."
    },
    {
      "title": "Know the risks of poor kidney health.",
      "content": "Know the risks of poor kidney health. Chronic kidney disease is the most common kidney ailment. If the condition persists, it can cause your kidneys to fail, meaning waste is not being properly filtered. Some people don’t notice symptoms of kidney disease, or may attribute their symptoms to something else. Things to look out for include fatigue, trouble sleeping, dry or itchy skin, poor appetite, muscle cramps, swollen feet or ankles, increased urination, and bloody or foamy urine. [18] X Research source Chronic kidney disease is typically caused by high blood pressure or diabetes. If you suffer from either condition, have a doctor test your kidney function at least once a year. Kidney stones are another common ailment. These are solid particles, frequently formed by minerals, and can be very painful. Symptoms include pain (sometimes extremely severe and stabbing) in the back, flank, and abdomen, as well as and difficulty and pain during urination."
    },
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. If you suspect you have a kidney ailment, you should seek medical attention. Be sure to describe your symptoms as specifically as possible to your doctor. You can also ask for information about preventing kidney ailments."
    }
  ]
}