{
  "url": "https://www.wikihow.com/Find-Cheap-Flights-Online",
  "title": "How to Find Cheap Flights Online",
  "steps": [
    {
      "title": "Use an online travel agency.",
      "content": "Use an online travel agency. Online travel agencies (OTA) are online booking resources that allow you to conveniently compare airline offerings in one central location just by entering your travel dates and destination. Most OTA's have access to the flight inventory from various airlines which provides a way to view numerous flight options in one location. Because of the large volume of business conducted by the OTA’s they are able to offer you the ability to search for flights without charging you a fee. [1] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020. One of the major benefits of OTAs is that the traveler is often exposed to more options than they knew they had, such as different flights, different routes, or different locations. Perks include low rates on last minute tickets as well as packaged deals that include drastically reduced rates on hotel or car rentals. [2] X Research source It’s important to consider all of your needs and all of your savings options when considering using an OTA. You should never pay more for a ticket on an OTA site than you would from the airline’s direct website. In fact, many airlines guarantee the lowest rate possible. Popular OTA sites include makemytrip.com, Expedia.com, and Booking.com."
    },
    {
      "title": "Compare your results to a supplier website.",
      "content": "Compare your results to a supplier website. A supplier website is a website that is owned directly by the airline, such as American Airlines or Delta. The decrease in use of OTAs over the past few years has seen a resurgence in people booking flights directly through the airline website. The primary advantage is cost, with more airlines offering special packages or resort credits that are otherwise not offered on third-party sites. [3] X Research source Many airlines have spent millions of dollars updating their websites to allow for customization of flight options such as priority boarding or Wi-Fi access. However, these luxuries are often offered at an additional cost. One of the drawbacks to utilizing a supplier website is that comparing prices can be time consuming and cumbersome."
    },
    {
      "title": "Try a metasearch engine.",
      "content": "Try a metasearch engine. Metasearch engines are search engines that pull indices (or the databases of relevant sites) from many search engines such as Google or Bing. [4] X Research source This allows the traveler to access a variety of information regarding airlines, flights, and costs all in one central location. The user can then take advantage of any specials, sales, or promotions being offered by an airline. The traveler is routed to the airline website when they are prepared to book their flight. Popular metasearch engines include Google Flight Search, Hipmunk, and Hopper. [5] X Research source One disadvantage is that not all airlines (especially smaller ones) are part of the metasearch engine’s database. For example, Southwest Airlines has opted out of having their prices displayed on such search engines. [6] X Research source Another disadvantage is that certain airlines pay to have their information listed at the top of the page, so sometimes the information provided by a metasearch engine may appear biased."
    },
    {
      "title": "Use various search tools.",
      "content": "Use various search tools. Though it may be time consuming, it may be worth it to compare prices among OTAs, airline websites, and metasearch engines. By comparing each search, you’ll be able to see if any provider is adding additional fees or if a provider is offering a special promotion. [7] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020. This works well if your travel plans (date/time) are firm. Otherwise, you could get overwhelmed by all of the options presented."
    },
    {
      "title": "Search using incognito or private browsing.",
      "content": "Search using incognito or private browsing. When you visit a website to check flight prices, the information is transmitted to the airline website in the form of a cookie. If a particular flight is repeatedly searched, sites will increase the price of the flight to scare you into booking a flight. Use private browsing to avoid a hike in price. [8] X Research source If using Google Chrome or Safari, enable incognito by hitting Command (Control if using a PC), Shift, “N.” For Firefox or Explorer, active private browsing by hitting Command (Control if using a PC), Shift, “P.” Start with a clean slate for each flight search by closing out the incognito window. Your cookies reset each time your incognito window is closed."
    },
    {
      "title": "Book your flight 6-8 weeks in advance.",
      "content": "Book your flight 6-8 weeks in advance. The best window for booking a flight is 6-8 weeks before your departure. If booking during peak seasons, purchase your flight about 3 months in advance. Avoid booking too early because airlines will often lower fares based on lack of demand. Likewise, avoid purchasing tickets too late because fares typically rise as the departure date approaches. [9] X Research source International flights differ slightly. They typically open up for sale about 335 days prior to departure and the price remains relatively the same for a few months. The price slowly begins to increase until about the 90 day mark when prices jump rapidly. [10] X Research source Research has found that Tuesday around midnight is the cheapest time to purchase your ticket, with the average savings being about 6%. However, it’s only applicable to 1.6% of the US market. The “always book at midnight” advice is a myth. Prices actually increase on days that fall later in the week. Avoid booking later at night and later in the week when the price of tickets has been known to increase. This spike in cost is most likely due to airlines’ sales weeks ending right before the weekend."
    },
    {
      "title": "Use flight points.",
      "content": "Use flight points. Sign up for an airline rewards program that allows you to collect points and rewards as you travel. You can cash in your rewards for free flights, free upgrades, and free companion tickets. Even if you don’t fly often, you can earn rewards by shopping at partner stores, watching for special offers, or getting a credit card which offers rewards. [11] X Research source US based airlines usually partner with other international carriers. For example, a flight on Singapore Airlines could earn you rewards with United Airlines because they are partners. Airlines partner with major companies to offer rewards based on dollars spent. Amazon, Apple, Best Buy, and Target offer anywhere from 2-4 points per dollar spent and even offer bonuses for monthly totals. Newsletters often advertise special offers that aren’t noted on an airline’s website. For example, you may earn points just by installing a search tool bar or double points by flying a particular route. Some credit cards offer travel rewards already. If not, try applying for a travel rewards credit card. Instead of paying cash for bills and other expenses, charge everything to the card to receive rewards for paying bills as usual."
    },
    {
      "title": "Search for discounts.",
      "content": "Search for discounts. Take advantage of discounts offered by clubs or organizations of which you may be a member. For example, there are many discounts codes for students. Never be afraid to ask an agent if discounts are available or to use search engines to find promotional (promo) codes. [12] X Expert Source Amy Tan Travel Planner & Founder, Planet Hoppers Expert Interview. 12 March 2020. Mailing lists are a great way to get “members only” benefits. Because cheap flight deals are usually only advertised for 24 hours, mailing lists help to ensure that you will be aware of all specials."
    },
    {
      "title": "Pick the cheapest day to fly.",
      "content": "Pick the cheapest day to fly. Airline ticket prices vary based on the day of the week, time of the year, and approaching holidays. If your arrival and departure dates aren’t rigid, try flying out during the middle of the week versus weekends. Additionally, try to book early morning or late night flights which are typically much cheaper because few prefer to travel during these times. [13] X Research source Even one day of travel can make a difference. Sometimes the cost of an extra night in a hotel is cheaper than the difference in the cost of flights. Sites like Skyscanner allow you to get a quick visual of prices for the entire month so you can search for the cheapest during any given month. [14] X Research source"
    },
    {
      "title": "Try a budget airline.",
      "content": "Try a budget airline. A few years ago, if you wanted to travel between continents you were forced to choose a “major” airline like Delta or American Airlines. The last few years have seen the emergence of budget airlines that offer long-haul routes between continents. In America, there are only a few budget airlines, but in Europe and Asia there are many (the competition has helped to keep prices low). Try budget companies such as WOW air or Air Asia X to find rates as low as $30 one way. [15] X Research source These airlines tend to offer fewer perks but what you save in price can more than make up for the lack of extras. Be very careful to avoid fees. This is how these smaller airlines make money so be sure to follow the rules to avoid gigantic fees."
    },
    {
      "title": "Take alternative routes.",
      "content": "Take alternative routes. There are many so many budget airlines around the world that sometimes it’s more economical to take a low-cost flight to a nearby city, and then take a budget flight to your destination. For example, instead of choosing a direct flight to Amsterdam, try taking a cheaper flight to London, and an even cheaper budget flight from London to Amsterdam. [16] X Research source This option does take more work than others as you have to review many different routes and airlines. Additionally, this option can increase your total travel time, but many believe the savings are worth it."
    },
    {
      "title": "Be flexible on your destination.",
      "content": "Be flexible on your destination. This option only works for travelers who are looking to go “anywhere but home.” If you are open to various destinations, you can choose a country or city based on great deals. There are always airline deals on wonderful and exotic destinations around the world; if you’re flexible about your destination, you can always score a great deal. [17] X Research source Kayak and Google Flights have features that will show you the cheapest routes and fares based on your airport of departure."
    }
  ]
}