{
  "url": "https://www.wikihow.com/Fairy-5e",
  "title": "Fairy Race in DnD 5e: Characteristics, Abilities, & Best Classes",
  "steps": [
    {
      "title": "Basic Racial Traits",
      "content": "Basic Racial Traits Fairies are one of the many fantastical races you can choose when creating your D&D character. Infused with the magic of the Feywild, the first fairies spoke Elvish, Goblin, or Sylvan, and picked up Common from their encounters with human visitors. If you choose to be a fairy, you have the following racial traits: [1] X Research source Size: You are Small. Speed: Your walking speed is 30 feet. Creature Type: You are a Fey. Languages: You are fluent in Common and one other language. Fey Passage: You can squeeze through a space as narrow as 1 inch wide. Fairy Flight: At level 1, you have a flying speed equal to your walking speed (30 feet) and can hover in the air. This flight is completely magical and doesn’t require you to have or use wings. Fairy Magic: At level 1, you know the druidcraft cantrip. As you level, you’ll pick up the faerie fire and enlarge/reduce spells. You can cast these spells without expending a spell slot once per long rest, using any spell slots you have. Your spellcasting ability for these spells is Intelligence, Wisdom, or Charisma. [2] X Research source Ability score increase: When determining your character’s ability score, you can increase one of those scores by 2 and another by 1, or increase three different scores by 1."
    },
    {
      "title": "Each Fairy has a special physical characteristic that sets them apart.",
      "content": "Each Fairy has a special physical characteristic that sets them apart. Most fairies look like Small elves with insect-like wings, but their individual physical characteristics, behavior, and attitude can vary widely. You can roll a d8 to get a random Fey characteristic, choose an option from the list, or come up with your own if none of these fit your character. [3] X Research source The Fey Characteristics are: 1. Your wings are like those of a bird. 2. You have shimmering, multicolored skin. 3. You have exceptionally large ears. 4. A glittering mist constantly surrounds you. 5. You have a small spectral horn on your forehead, like a little unicorn horn. 6. Your legs are insectile. 7. You smell like fresh brownies. 8. A noticeable, harmless chill surrounds you."
    },
    {
      "title": "Artificer",
      "content": "Artificer Artificers are inventors who see magic as a system waiting to be decoded and controlled and craft permanent and temporary magical objects to channel arcane power. Since they can wear light armor and typically fight from a range, the fairy is a natural pairing for this class. [4] X Research source Benefits: You can use your Fairy Flight to fight at range and use faerie fire to get an Advantage on attacks from Force Ballista arcane turrets. The Alchemist and Artillarist builds work best for artificer fairies, even though Alchemists might not find faerie fire all that useful. Drawbacks: Fairies won’t work with Armorer builds because of the heavy armor requirement or Battle Smiths because of their focus on martial melee combat."
    },
    {
      "title": "Bard",
      "content": "Bard Bards are masters of song, speech, and magic, which makes them a great class to choose as a fairy. As a Bard, you might enjoy the freedom that flight gives you, plus you get a couple of extra spells to use. [5] X Research source Benefits: Fairy Flight gives Bards an extra defensive benefit when spellcasting and the Fairy Magic gives you a few extra spells to use per day. The fairy race works best for the College of Lore Bard build. Drawbacks: Faerie fire is already on the Bard’s spell list, so it might not be as useful as the other spells. Since the Bard benefits most from Fairy Flight, the College of Swords and College of Valor Bard builds, which are more melee-centric, might not be as useful."
    },
    {
      "title": "Cleric",
      "content": "Cleric Clerics are healers and warriors who are imbued with divine magic and act as intermediaries between the mortal world and the gods. [6] X Research source This class is a strong choice, especially for builds that don’t use heavy armor. Benefits: Clerics usually don’t get access to faerie fire , so you not only get an Advantage on attacks, but the spell can cancel all the benefits of invisibility. Drawbacks: Forge Domain, War Domain, and other melee cleric builds don’t get to benefit from the defensive advantage of Fairy Flight."
    },
    {
      "title": "Druid",
      "content": "Druid Druids are drawn to nature and animals and can gain the ability to take on animal forms. [7] X Research source As a spellcasting shapeshifter, druids can be an excellent choice for those who would like to fight from a range. [8] X Research source Benefits: You won’t have to wait until level 8 to fly, which can help compensate for the druid’s poor durability. Drawbacks: Druids can already cast faerie fire , but they gain some extra spellcasting. The Circle of Spores and Circle of the Moon melee druid builds might not benefit from Fairy Flight."
    },
    {
      "title": "Ranger",
      "content": "Ranger Rangers are natural hunters and trackers that later acquire the ability to cast nature-oriented spells. [9] X Research source As a ranged class, the ranger can be a good match with the fairy race, but your damage might not be as high as you would get with other classes. Benefits: You can use your Fairy Flight to hunt your enemies from above, plus you get a few additional spells to add to your list. Drawbacks: You give up the damage boost from Hunter’s Mark (which requires Concentration), and you won’t be able to reliably use a longbow which can severely impact your damage. Bonus Tip: Choose the Sharpshooter or Crossbow Expert feats if you’d like to primarily use faerie fire in battles."
    },
    {
      "title": "Rogue",
      "content": "Rogue Rogues rely on skill and stealth, prioritizing craftiness and deceit over brute strength. [10] X Research source As masters of deception who benefit from bouncing in and out of range, a rogue fairy can be an interesting and powerful combination. Benefits: The fairy’s ability to fly and shrink itself can be a major asset because it allows you to sneak around and stay out of reach of enemies. Plus, faerie fire can be an easy way to get an Advantage on attacks, especially for Arcane Trickster builds who can re-cast it. Drawbacks: Using a crossbow with the Crossbow Expert or Sharpshooter feats may do more damage than shortswords or daggers in combat."
    },
    {
      "title": "Warlock",
      "content": "Warlock Warlocks are seekers of knowledge who unlock magical effects through agreements made with mysterious and powerful supernatural beings. [11] X Research source The fairy’s innate spells don’t really benefit warlocks, but flight could make the combination worth it for some players. Benefits: Flight allows you to dart in and out of range. Drawbacks: You can already get flight and faerie fire with an Eldritch Blast or Smite build, and the spells and abilities of the fairy can be redundant for Archfey Warlock builds."
    },
    {
      "title": "Sorcerer",
      "content": "Sorcerer Sorcerers learn to harness and channel the magic they were born with, allowing you to choose the origin of your power. [12] X Research source The fairy’s extra spells and unique flight ability can be a great asset for any sorcerer class. Benefits: A couple of extra spells and the power of flight can be excellent additions to the sorcerer’s skillset. Drawbacks: Sorcerers already have a few other spells, like Chaos Bolt and Chromatic Orb, that rely on attack rolls, so faerie fire and enlarge/reduce might primarily be used as buffs for the rest of the party."
    },
    {
      "title": "Wizard",
      "content": "Wizard Wizards are scholars who draw on the weave of magic that exists all around them. [13] X Research source As a fairy, the power of flight can help any wizard achieve their ends, but you may not have as many benefits as you’d get with other classes. Benefits: The flight option can be used as an evasion tool to help with the wizard’s lack of durability. Drawbacks: Wizards have a few other spells that rely on attack rolls, so faerie fire and enlarge/reduce might primarily be used as buffs for the rest of the party."
    },
    {
      "title": "Barbarian",
      "content": "Barbarian Barbarians are defined by their rage, which they can use to succeed in the chaos of combat. [14] X Research source The fairy’s flight, spellcasting, and size can make playing a barbarian fairy highly difficult. Benefits: A small fairy who charges into battle with fury might make an amusing addition to your party. You also may be able to stay out of reach using a whip or polearm. Drawbacks: Small creatures can’t use the d12 weapons that most barbarians use, and being locked into melee combat makes flight less useful because it’s difficult to stay out of reach of enemies. The fairy’s spellcasting is also not as useful as it would be with other classes."
    },
    {
      "title": "Fighter",
      "content": "Fighter Fighters are diverse, well-rounded masters of weapons, armor, and combat. [15] X Research source Their melee proficiency might not do as well with the fairy race, even if you choose builds that rely on cantrips or have high Strength or Dexterity ability scores. Benefits: This combination might work with a ranged fighter build, especially if you want to pick up the flight ability at level 1. Drawbacks: The fairy’s Small size restricts the best ranged weapons and it’s difficult to find a build that benefits from both flight and Fairy Magic."
    },
    {
      "title": "Monk",
      "content": "Monk Monks harness the energy that flows in their bodies to create magical effects and exceed their body’s physical capabilities. [16] X Research source The monk’s tendency to want to be up close and personal with their enemies might make a monk fairy a difficult combination. Benefits: A Way of the Kensei, Way of the Astral Self, or Way of the Sun Soul monk build might be able to use the fairy’s flight to fight at range. Faerie fire can also help offset the monk’s poor Dexterity. Drawbacks: As a Small creature, monk fairies might be restricted without access to a longbow. Without spell slots, you’re also unable to cast your innate spells like Faerie Fire more than once per day."
    },
    {
      "title": "Paladin",
      "content": "Paladin Paladins take an oath to stand against the forces of evil and train for years to learn the skills of combat. [17] X Research source Paladins’ heavy armor and weapons can make a fairy paladin a difficult combination to manage, especially in battle. Benefits: The paladin’s high durability can keep a fairy safe high in the sky, and faerie fire can work well with paladin attacks. Drawbacks: Faerie fire requires Concentration, so you can’t use Smite spells alongside it, which makes it difficult to play ranged paladin builds. Bonus Tip: Since you may have to primarily fight melee, consider using weapons like whips or polearms to reach your enemies. You can also use your enlarge/reduce spell to pop up to a larger size once a day to use heavy paladin weapons."
    }
  ]
}