{
  "url": "https://www.wikihow.com/Fake-a-Headache-at-School",
  "title": "How to Fake a Headache at School",
  "steps": [
    {
      "title": "Focus on primary headaches as they are not symptoms of another disease.",
      "content": "Focus on primary headaches as they are not symptoms of another disease. Primary headaches are cluster, migraine, tension, and TAC (Trigeminal autonomic cephalalgia) headaches. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You have a better chance of getting away with this charade if you pay attention to the details. There are many different headaches but it makes the most sense to fake tension, migraines, cluster, or sinus headaches. [2] X Research source Primary headaches can be triggered by things you do in the day including eating habits, sleeping habits, posture, and general stress. [3] X Research source"
    },
    {
      "title": "Understand where the pain comes from.",
      "content": "Understand where the pain comes from. Depending on what type of headache you are trying to fake, the pain will come from different parts of your head. Some headaches may radiate while others are focused. Tension headaches are usually felt at the front, top, or sides of your head. [4] X Research source Migraines can be felt in the entire head, or the pain may be felt shifting from one side of your head to the other. [5] X Research source Cluster headaches provide a very focused pain on one-side of your head that is located around the eye region. [6] X Research source Sinus headaches are felt in the cheekbones, forehead, or the bridge of your nose. [7] X Research source"
    },
    {
      "title": "Describe the pain.",
      "content": "Describe the pain. There is a wide spectrum of pain that a headache can bring. Be sure to fake enough pain to get out of school but not so much that your overall health comes into question. It’s not enough to say that your head hurts because being able to describe the detail will make it seem real. Tension headaches bring about a pressurized band-like pain that you can describe as mild to moderate. Pain can also vary in intensity throughout the day if you’re trying to mimic a chronic tension headache. [8] X Research source Migraines can be very intense with a pounding and throbbing pain. The intensity can be very severe so it may not be wise to choose a headache with such involved symptoms. [9] X Research source Cluster headaches are constantly throbbing with a burning or piercing pain. [10] X Research source Sinus headaches will vary in intensity depending on other sinus symptoms like a runny nose, plugged ears, fever, and facial swelling. [11] X Research source"
    },
    {
      "title": "Schedule your headache.",
      "content": "Schedule your headache. You may have to act out the symptoms several hours in advance If there’s a specific class you are trying to miss. You are more likely to be believed if multiple witnesses have seen you display the same symptoms. Understand how long a headache should last and if it should only occur at certain times of the day. Tension headaches can occur several times a months depending if they are chronic. They can last from 30 minutes to several days. Chronic tension headaches will vary in intensity throughout the day. The pain may also be present as soon as you wake up. [12] X Research source Migraines come with an assortment of symptoms including vomiting and seeing bright flashing dots or wavy lines. [13] X Research source Unless you actually have experienced a migraine, it would be unwise to mimic this type of headache. Cluster headaches can last anywhere from 30 minutes to 90 minutes. They can also recur throughout the day from 3 to as many as 8 times. Cluster headaches also occur very regularly and often at the same time of day. [14] X Research source Sinus headaches occur when you suffer inflammation and congestion usually brought on by a cold or flu. They can also be caused by an allergic reaction, or changes in air pressure. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It would be unwise to try and fake a sinus headache because these symptoms are difficult to mimic."
    },
    {
      "title": "Choose between a tension headache and cluster headache.",
      "content": "Choose between a tension headache and cluster headache. These two types of headaches are more believable because they are less involved as the other primary headaches. However, if you have actually experienced migraines before or are experiencing congestion in your sinuses, it may also work in your favor to fake those types of headaches. You don’t have to actually name your type of headache but you do have to display the distinct characteristics to make it as believable as possible."
    },
    {
      "title": "Complain about the pain in your head as soon as you get to school.",
      "content": "Complain about the pain in your head as soon as you get to school. Both tension headaches and cluster headaches can occur before you get to school. Tension headaches happen as soon as you wake up while cluster headaches can disrupt your sleep. [16] X Research source Rub the front of your head or side of your head as both types of headaches happen in focused areas at the front of your head. Tell classmates who will be with you throughout the day. As well, tell teachers if you have them in both a morning and afternoon class. For example, if you are in high school and you want to skip out of 5th period English, complaining to your 2nd period math teacher won’t help you because there’s no way your English teacher will get the message. Instead, complain to a classmate who will be with you in 5th period English."
    },
    {
      "title": "Talk to the school nurse.",
      "content": "Talk to the school nurse. Immediately establish that you have a headache by alerting the right people. If you do not have a school nurse or health professional, go to the principal’s office and alert the administrator. Agreeing to “tough it out” in the morning sets a precedent for later in the day."
    },
    {
      "title": "Be irritable and easily annoyed.",
      "content": "Be irritable and easily annoyed. When your head is in pain it will be difficult to receive a lot of stimulation. If people are talking too loudly or there is too many things going on around you, act like this is making your headache worse. Become easily agitated if people don’t take you seriously. Don’t take this too far or you may cause a rift between your friends or land in detention rather than the nurse’s office."
    },
    {
      "title": "Don’t participate in physical activity.",
      "content": "Don’t participate in physical activity. Fake being listless to the point that standing or keeping your head up seems to make your pain worse. Tension and cluster headaches don’t last long but can recur during the day so spread out the pain and vary the intensity. If you want to participate in recess or sports during lunch, headaches can also occur because of a poor diet. Wait until after lunch to start faking the symptoms and complain about how your food tasted “off”."
    },
    {
      "title": "Put your head down in class.",
      "content": "Put your head down in class. Laying down is often seen as the best way to relieve the pain from a headache. Make sure to ask permission from your teacher and state that your head hurts and you would like to put your head down for a bit. Your eagerness to stay in class will make the pain seem real as you aren’t immediately trying to just getaway."
    },
    {
      "title": "Drop clues throughout the day.",
      "content": "Drop clues throughout the day. Headaches can be caused by a number of factors including certain foods, changes in sleep, poor posture, missing meals, or stress. Keep this in mind and choose one to tell people. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Don’t overdo it. Say things like, “I didn’t get very much sleep last night” or “I haven't eaten since dinner” to a couple of people who you know will be able to put two and two together."
    },
    {
      "title": "Keep faking your headache until the next day.",
      "content": "Keep faking your headache until the next day. It takes time to get better from a headache and often times they recur. It will be easier for you to fake a headache if you fake the symptoms correctly for a chronic tension headache. You don’t want to fake a headache in the morning and be seen playing sports after school. Prepare to keep up the rouse for the entire day."
    }
  ]
}