{
  "url": "https://www.wikihow.com/Gain-Your-Wife%27s-Trust-Again",
  "title": "How to Gain Your Wife's Trust Again",
  "steps": [
    {
      "title": "Acknowledge that you have lost your wife's trust because of something you did (or did not do).",
      "content": "Acknowledge that you have lost your wife's trust because of something you did (or did not do). You made a choice to do it (or not do it). It comes right back to your impulsive actions or willful inaction, your failure to respect her and your relationship and your willingness to hurt in to pursue something else that you felt mattered only to you. Whether you've had an affair , embezzled the household savings, committed harm against her, sullied her reputation, or whatever, the same issue lies at the heart of your actions––you made a bad choice and you lacked respect."
    },
    {
      "title": "Consider whether you really want to regain your wife's trust.",
      "content": "Consider whether you really want to regain your wife's trust. You must truly want to restore what you had or at least start over. If you feel compelled to do so out of reasons beyond your own wishes (such as being pressured by family or social obligations), then it is possible you haven't learned your lesson and whatever you did will only rear its head again later. Instead, you must want to restore what you both had because it matters to you ."
    },
    {
      "title": "Be prepared to accept your wrongdoing.",
      "content": "Be prepared to accept your wrongdoing. [1] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. You cannot gain back another person's trust when you feel compelled to lay any, some or all of the \"blame\" on that other person. Telling your wife that she seemed \"too busy, too preoccupied, too bored, too shopping addicted, whatever\", you are just making excuses for your behavior. This isn't about how she was failing to meet your expectations; you've destroyed her expectations of you, so this is all about rebuilding a broken foundation. Do not make it seem as if she was the cause, in any way. If you do that, she won't see your attempts to regain trust as genuine. [2] X Research source Reader Poll: We asked 129 wikiHow readers, and 74% agreed that the most important step to take after you have an affair is to take full responsibility for what you did . [Take Poll]"
    },
    {
      "title": "Deal with whatever you did wrong.",
      "content": "Deal with whatever you did wrong. End the affair, get a job to repay the lost funds, get counseling for your violent tendencies, get counseling for your sexual addition or pornography usage, etc. Whatever the problem, seek out and actually put in place the solution needed to stop the reason for the breach of trust. Without this positive sign of your willingness to make changes, she won't have any reason to trust that you have changed and are setting forth a new course. Cease all involvement with anyone that has been an issue. Even if you've been the flirty type when interacting with others, keep the flirting to a minimum."
    },
    {
      "title": "Talk to your wife.",
      "content": "Talk to your wife. Explain what you have done, why you accept the blame for what you have done and set forth exactly what it is that you are now doing to restore her faith in you. This will require courageous honesty on your behalf, as well as a willingness to listen to what she has to say in return. She will probably have a lot to say but even if all she does is listen, respect her choice of reaction and simply be there for her. You cannot fix \"her\" feelings––she is entitled to them, so listen and learn. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Let her know every day that you have time to listen to anything she has to say. No interruption or arguments about what's being said; just listen. If you'd like more guidance, Kelli Miller, a psychotherapist and wikiHow Brand Ambassador, recently wrote an excellent book — Love Hacks — that provides tangible advice for communicating with your wife and addressing infidelity."
    },
    {
      "title": "Expect your wife to feel insecure about you.",
      "content": "Expect your wife to feel insecure about you. Broken trust comes with wondering a lot about the person who broke that trust––questions such as what are you doing, where are going, who are you with, where have you been, are you really doing what you say you're doing are going to be whizzing through her mind a lot. Do what you can to preempt the questions by giving information in advance, that can help her to feel satisfied that you are telling the truth. [4] X Research source [5] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. If she's worried about where you're going and who you'll be with, ask her along. Or, ask her to call you or let her know you'll call her and have your phone on video chat, so that she can actually see where you are and who you're with. Offer to attend something she cares about that you've neglected to become involved in. This might be church, a hobby, a sporting activity, etc. Be more open. Show her your online social networking accounts; show her your friend lists, etc. Show her your phone, open for her to see the contact list. Be willing to pick up the phone when she calls. Don't make her chase you. Keep the clock as your unofficial accountability partner. Don't be late and don't have questionable lapses in the time it should take you to get home."
    },
    {
      "title": "Be attentive.",
      "content": "Be attentive. Be careful about how you display your attentiveness; the modern day woman is wise to the purchase of flowers, chocolates, jewelry, etc., as guilt gifts, especially when these haven't formed part of your behavior since the dating years. While it may feel right to buy her something nice by way of an initial apology, don't think that it will be the salve that solves all; it can only be one thing in your repertoire of dedicated refocusing of attention back to her and your relationship. In actuality, it is important to be fully engaged with her, by listening, explaining clearly and carefully what you are doing and thinking, and apologizing when you have given her any further reasons to feel a lack of trust. Being attentive includes: Spending more time together. Be home instead of at the pub, work or the sports field. If she is going to regain trust in you, it'll only come through attentiveness in the present time, by showing that you are dedicated to being around, spending time with her and being clearly interested in her company. Going through the household needs together. This can be a great time to rearrange who does what to keep the household functioning. Perhaps a new budget, a new chores list, a new way of running the house are in order. Maybe even a new house is in order; moving away from what was to a fresh, clean start can sometimes be just the ticket to restore a relationship. If you have kids, considering whether your parenting approach needs to be improved or changed. Perhaps you have neglected your part of the child raising; if so, you can make changes to spend more time with the kids. Or maybe you only focused on the kids to the exclusion of your wife; once again, you can reorient this skewed slant to be more balanced. Eating supper/dinner at the same table. Do not eat with anything electronic on the table or outside it; such items interfere with your connectedness."
    },
    {
      "title": "Be supportive of your wife's wishes.",
      "content": "Be supportive of your wife's wishes. She may feel that your behavior or actions have undermined her opportunities to do something she believes is important; find ways to help her achieve these wishes or, at the very least, don't be a cause of hindering her. If she suddenly has a desire to go and do relief work in a disaster zone, perhaps she needs the break from you."
    },
    {
      "title": "Be sincere.",
      "content": "Be sincere. If you truly want to regain your wife's trust, you must let her see that you mean everything you say and do. Actions speak louder than words, and she will be watching closely, waiting for slip-ups because she is not sure whether or not you are sincere. This may feel hard for you, as if you're being judged, but it's just one of the realities of trying to win back trust––you are on show, no matter how uncomfortable that seems. You have something to prove, and she is slowly processing whether or not you're managing to prove your reliability as a spouse or partner to her again. [6] X Research source [7] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020."
    },
    {
      "title": "Work at it.",
      "content": "Work at it. Healing a breach of trust takes time, effort and solid evidence of change for the better. You can't expect to win back her trust overnight. You will have to work at it. It could take years. You will need to have the mindset that this is worth it and to accept that you won't give up. Show your wife (partner) that you are really committed to getting her back. Realize that there will be times when you wonder whether you are having any impact. This is normal. However, it is also hard to bear. At such times, talk to someone about your feelings, such as a trusted friend, a therapist or even a parent if you feel okay with that. You may even feel okay about talking to your spouse about your feelings; your genuine distress may help her to see that you are really trying hard and finding it hard too. Just don't use it as a reason to seek her pity though; that won't set your relationship on an even keel, so don't even try. Use your faith as self-support and for couples support too (if she is willing). At least for yourself, you may find that prayer, contemplation, meditation and/or reflection are pathways of healing for you. Read your faith text, read stories about forgiveness, read about people who have managed to restore lost trust. If your wife and/or family are willing, spend time praying or reflecting together."
    },
    {
      "title": "Give your wife space and let time do the healing.",
      "content": "Give your wife space and let time do the healing. She is going through a huge range of emotions, just as you are. Some days it'll seem clearer to her than others. She may find it easier to talk about it with you sometimes but not other times. All of this is normal and part of the healing process. It is important to not rush or push her into reaching decisions about her feelings or her wants for the future; if she feels pressured, the easiest option may be to give up on you for fear of being controlled or manipulated. Space, time and love are the ingredients for helping her to come around to forgiving you, trusting you and starting anew. [8] X Research source"
    }
  ]
}