{
  "url": "https://www.wikihow.com/Cut-Garlic-Scapes",
  "title": "How to Cut Garlic Scapes",
  "steps": [
    {
      "title": "Look for scapes to sprout in early summer.",
      "content": "Look for scapes to sprout in early summer. Garlic plants typically start sending up stalks as the weather warms. In the Northern hemisphere, this will be around early to mid-June, or slightly later, depending on where you live. [1] X Research source It’s possible that your garlic plants may not begin producing scapes until well into July. The scapes can be easily mistaken for leaves, which are often the same color and size, but are firm and rounded like green onions."
    },
    {
      "title": "Wait for the stalks to curl.",
      "content": "Wait for the stalks to curl. Hold off on trimming the scapes from your garlic plants until they begin twisting and looping over on themselves. At this point, they’ll have reached maturity, and will be full of pungent flavor. [2] X Research source Scapes can actually begin to flower if you let them grow long enough. The stalks will still be usable when this happens. [3] X Research source"
    },
    {
      "title": "Cut the scape away from the base of the plant.",
      "content": "Cut the scape away from the base of the plant. Use a pair of sharp scissors or gardening shears to snip the stalk as low down as you can. Be careful not to damage the clove or surrounding leaves in the process, as these are vital to the plant’s growth. [4] X Research source Try to make your cut as clean as possible to avoid crushing the stalk. Once you remove the scape, the plant will direct more of its resources to the bulb. The result is larger, more flavorful garlic cloves. [5] X Research source"
    },
    {
      "title": "Store freshly-harvested scapes in the refrigerator.",
      "content": "Store freshly-harvested scapes in the refrigerator. Wrap your scapes loosely in a plastic bag or damp paper towel and stash them in the crisper drawer. When stored properly, they should stay good for up to 3 weeks without losing their signature flavor or crunch. [6] X Research source Alternatively, you can place the stalks in a glass of cool water (the way you would celery or carrots) and leave them out on the countertop if you plan on using them within a few days. For maximum freshness, be sure to change the water daily."
    },
    {
      "title": "Wash the scapes thoroughly.",
      "content": "Wash the scapes thoroughly. Hold a bundle of stalks under a stream of cool, running water. Use your fingertips to lightly scrub away any dirt and debris clinging to the stalks. Shake off the excess water, then pat the scapes dry with a clean paper towel. If you’re washing a lot of scapes at once, it may be easiest to do it in a colander. Don’t attempt to clean scapes by soaking them. This can cause them to absorb too much water, diluting their flavor and leaving them mushy."
    },
    {
      "title": "Place the scapes on a cutting board.",
      "content": "Place the scapes on a cutting board. A cutting board or mat is essential for protecting your countertops, since you’ll be making a lot of quick cuts. Because of the way scapes curl, and the fact that they tend to vary in size, it’s recommended that you cut them one at a time."
    },
    {
      "title": "Trim the ends off the stalk.",
      "content": "Trim the ends off the stalk. Cut away the tip of the scape just below the bulbous white neck. Do the same for the lower end of the stalk where it starts to become hard and woody. Toss both sections in the trash, or add them to your compost heap. You should be left with just the smooth, light green shaft. [7] X Research source The top and bottom portions of the scape are tough and chewy, so it’s best to just throw them away."
    },
    {
      "title": "Cut the scapes into thin slices.",
      "content": "Cut the scapes into thin slices. Move the blade of your knife up and down along the length of the stalks with a smooth lever action, holding them steady with your free hand. It may be necessary to stop and reposition especially curved stalks as you go. Once sliced, your scapes will lend a burst of aromatic flavor to savory dishes in much the same way as scallions, leeks, or chives. [8] X Research source The exact thickness of each slice will depend on your knife-handling skills and your intended use for the scapes. Toss a handful of sliced scapes into a stir fry or sauté, or sprinkle them onto a salad or loaded baked potato. They also go well in sauces and dips like salsa verde, guacamole, chimichurri, and pesto. [9] X Research source"
    },
    {
      "title": "Leave the scapes in larger pieces for more flavorful cooking.",
      "content": "Leave the scapes in larger pieces for more flavorful cooking. Instead of aiming for a fine slice, cut the stalks into 1-2 inch (2.5-5 cm) sections roughly the same size as broken green beans. In this form, they’ll be perfect for adding a deep, savory note to soups, stews, and marinades. [10] X Research source If you don’t intend to eat the scapes, leave the stalks a little longer so they’ll be easy to pick out of the pot or pan once you’re done cooking. Try adding chopped scapes to a vegetable medley, or steaming them and serving them on their own. When cooked, they have a crunchy texture not unlike asparagus, with a mild onion flavor. [11] X Research source"
    }
  ]
}