{
  "url": "https://www.wikihow.com/Fix-a-Slinky",
  "title": "How to Fix a Slinky",
  "steps": [
    {
      "title": "Put one end of the slinky over your fingers.",
      "content": "Put one end of the slinky over your fingers. Locate the least tangled end of the slinky and put four of your fingers through its center. Keep your thumb on the outside of the loop, so you can grip the end of the slinky and hold it in place. [1] X Research source Extra-long slinkies might be easier to untangle if you keep the \"good\" part over your arm, or over a cardboard paper towel tube."
    },
    {
      "title": "Move your finger and thumb along the edge of the slinky.",
      "content": "Move your finger and thumb along the edge of the slinky. Run your first finger and thumb along the slinky, approaching the first tangled area next to the end you're holding. The \"good\" end of the slinky will collect in a neat stack around your fingers."
    },
    {
      "title": "Find out where the slinky continues through the tangle.",
      "content": "Find out where the slinky continues through the tangle. Slow down as you approach the tangled area and look closely, so you can see exactly where the slinky goes next. Pull the Slinky's tangled area apart if necessary to get a better view."
    },
    {
      "title": "Carefully push the end of the slinky through the tangle.",
      "content": "Carefully push the end of the slinky through the tangle. Take the \"good\" slinky off your hand, and hold it so it stays in a neat stack. Turn the stack at an angle and fit it through a gap in the next tangle, so it joins the next length of slinky where your finger and thumb followed it. Once it's through, put the neat stack back on your fingers. Sometimes, it's easier to hold the stack in place and lift the next loop of the tangle over and around the end of the stack. [2] X Research source"
    },
    {
      "title": "Rotate the slinky at severe bends.",
      "content": "Rotate the slinky at severe bends. If you notice a part of the slinky that's bending in completely the wrong direction, or even looks like its about to snap, try rotating the two tangled areas that are crossing each other. Once the area is under less pressure, you can safely pull apart a gap and move the neat end of the slinky through it, as described above."
    },
    {
      "title": "Repeat until untangled.",
      "content": "Repeat until untangled. Continue following the slinky and collecting it on your hand. Whenever you see a tangle, use the techniques above to get through it."
    },
    {
      "title": "Switch to the other end if necessary.",
      "content": "Switch to the other end if necessary. If you're untangling a long or extra-tangled slinky, at some point it might get too long to easily move through the gap. At this point, you can carefully set down the part you've already untangled, and switch to the other end of the slinky. Repeat the steps above until the entire slinky is untangled."
    },
    {
      "title": "Put your finger either below, or above the tangle.",
      "content": "Put your finger either below, or above the tangle. it doesn't matter which finger."
    },
    {
      "title": "Rotate the slinky making your finger run through the tangled parts.",
      "content": "Rotate the slinky making your finger run through the tangled parts. this forces the tangles to return to their normal position."
    },
    {
      "title": "Run your finger all the way through the tangle.",
      "content": "Run your finger all the way through the tangle. this is important, as stopping half way through isn't the brightest."
    },
    {
      "title": "And, that is all you need to do.",
      "content": "And, that is all you need to do. if this method fails to work, try the other methods stated on this site."
    },
    {
      "title": "Pull the two ends of the slinky apart.",
      "content": "Pull the two ends of the slinky apart. Hold both ends of the slinky, one in each hand. Pull them apart in opposite directions, just enough that you can see exactly where the tangle is. Keep holding them in that position. This method is for slinkies with only a few of its loops tangled. If your slinky is too tangled to form a straight line when pulled apart, you can try this with just one small section of the slinky, or switch to the extremely tangled slinky method instead."
    },
    {
      "title": "Rotate one end of the slinky.",
      "content": "Rotate one end of the slinky. Hold the other end steady as you rotate. Rotating in one direction will make the tangled loops move farther apart; this is the direction you want. If you start rotating and the tangled loops grate tightly together, stop and reverse the direction you're rotating."
    },
    {
      "title": "Lift the tangled loops up to fix them.",
      "content": "Lift the tangled loops up to fix them. Once the tangled loops have some space between them, look closely to see which loop is out of place. Lift that loop up away from the straight line of the slinky. If you keep the slinky stretched apart, the loop should snap back into the correct place as soon as you let go. If it doesn't, pick it up again and guide it carefully back between the right loops, rotating if necessary. This step is easier if you ask a friend to hold one end of the slinky while you do this."
    },
    {
      "title": "Know your chances for plastic or metal slinkies.",
      "content": "Know your chances for plastic or metal slinkies. This method is for slinkies that aren't tangled, but have developed bent coils or \"kinks\" that refuse to line up with the other coils. Some plastic slinky kinks can be molded back into place when heated, but this won't always work and could even melt your toy if you're not careful. Metal slinkies are much harder to bend back, so only try it if you have time to spare and really don't want to buy a replacement."
    },
    {
      "title": "Heat a pot of water.",
      "content": "Heat a pot of water. Fill a pot with enough water to cover the slinky. Heat it on the stove alone, without the slinky in it. [3] X Research source You do not want the water to boil, but keep heating it until it becomes quite hot, perhaps just beginning to steam. You could microwave a bowl of water instead, or heat water in the kettle and pour it into a pot."
    },
    {
      "title": "Turn off the heat.",
      "content": "Turn off the heat. Turn off the heat once the water is hot. Never keep heating the water after the slinky is in it, or the slinky could melt and ruin both itself and the container it's in."
    },
    {
      "title": "While wearing gloves, put the slinky into the hot water.",
      "content": "While wearing gloves, put the slinky into the hot water. Put on rubber gloves to protect your hands, and lower the slinky into the hot water. Leave it there for a couple minutes."
    },
    {
      "title": "Remove the slinky and bend it into place.",
      "content": "Remove the slinky and bend it into place. After a couple minutes in the hot water, take the slinky out while wearing gloves. If the slinky was heated hot enough, you should be able to mold it gently into place, pressing the kinked coil down where it should go. If you have a cardboard tube or other cylinder that's slightly smaller than the slinky, you can wrap the slinky coils around it to get the right position. [4] X Research source"
    },
    {
      "title": "Try again with hotter water if you didn't succeed.",
      "content": "Try again with hotter water if you didn't succeed. If the slinky is still stiff and can't be bent, heat the water hotter and try again. Heating the slinky too much can make it a permanently ruined mess, so increase the temperature slowly and keep a close eye on the water. Never heat the slinky directly."
    },
    {
      "title": "Press the slinky flat with a book.",
      "content": "Press the slinky flat with a book. Immediately after bending it back into place, place the coiled slinky underneath a flat book. Leave it there for several hours, or even overnight, to compress the slinky into position. If the book keeps falling off, try using a large, thin children's book instead. Place a small, heavy object on the center of the children's book, directly over the slinky. Don't use a book that's so heavy or so wide that it knocks the slinky over and crushes it."
    },
    {
      "title": "Heat the slinky in an oven.",
      "content": "Heat the slinky in an oven. If hot water doesn't work to repair the slinky, you could line a baking sheet with tin foil, put the kinked slinky in a stack on top of it and heat it in a 250ºF (121ºC) oven for about 10 minutes. [5] X Research source Use oven mitts to pull it out and bend it back into place, if it hasn't settled on its own. This is risky, as some plastic slinkies could melt."
    },
    {
      "title": "Cut the slinky apart.",
      "content": "Cut the slinky apart. If all else fails, use a pair of wire cutters to cut the slinky at either end of the kink. You can try to reattach the good parts using rubber cement or super glue, but it will be difficult to attach them at the right angle. More likely, you'll end up with two permanently separated smaller slinkies. The cut ends may be sharp. Try covering them with several small pieces of packing tape to protect your fingers."
    }
  ]
}