{
  "url": "https://www.wikihow.com/Fix-Yellow-Hair",
  "title": "How to Fix Yellow Hair",
  "steps": [
    {
      "title": "Wait a few days before toning if you just bleached your hair.",
      "content": "Wait a few days before toning if you just bleached your hair. If your just-bleached blonde hair looks yellow, don’t worry—you can fix it with toner! Toners have ammonia in them, which is pretty harsh on hair. Since bleach is also quite damaging, try to wait 2-3 days after bleaching before you tone your hair to avoid extra stress on your strands. Yellow tones can also show up a few weeks after bleaching your hair blonde. If that’s what happened to you, you can tone your hair immediately. [1] X Research source"
    },
    {
      "title": "Buy an ammonia-based toner at a beauty supply store.",
      "content": "Buy an ammonia-based toner at a beauty supply store. The exact shade you choose will depend on your current shade and your desired results. Go with an ash blonde toner if you want to achieve a cool shade of blonde. For a more neutral option, consider a beige blonde toner. Be sure to choose a purple-based shade, which will be marked on the bottle. Toners can have blue, purple, or green base colors. To fix yellow hair, you want purple. Since yellow and purple are opposite on the color wheel, they neutralize each other when combined. Choose a toner that matches your current hair color level. The level system ranges from 1 to 10 (1 is the darkest and 10 is the lightest). If you go too light, you won’t eliminate the yellow tones. [2] X Research source Toner brands will have a color level chart either on their produce boxes or online."
    },
    {
      "title": "Pick up a 20-volume developer to use with the toner.",
      "content": "Pick up a 20-volume developer to use with the toner. Toner brands have different instructions, so be sure to consult the package directions and follow those instructions. That said, in most cases, the toner will need to be mixed with 20-volume developer before you apply it. Consult the toner’s directions so you know how much developer you need to buy. [3] X Research source"
    },
    {
      "title": "Mix the toner and developer together using the recommended ratio.",
      "content": "Mix the toner and developer together using the recommended ratio. Put on a pair of plastic gloves and an old T-shirt before you open your products. Then, check the package insert for specific instructions. In many cases, the ratio is 2 parts developer to 1 part toner. Stir the ingredients together in a bowl using a wooden spoon or the stirrer provided in your toning kit. [4] X Research source Your toner’s instructions will provide measurements. Don’t make up your own ratio! Avoid mixing toner and developer in a metal bowl. The metal could cause the mixture to oxidize and lose its effectiveness."
    },
    {
      "title": "Separate your hair into 4 sections.",
      "content": "Separate your hair into 4 sections. Toner is applied just like hair dye, so you’re probably very familiar with this process. Part your hair down the middle with a rattail comb to create 2 sections, then again from ear to ear to create 2 sections in the front and 1 section in the back. Clip the 2 front sections out of the way so you can work on the back section first. [5] X Research source"
    },
    {
      "title": "Use the brush applicator to apply thin layers of toner from root to tip.",
      "content": "Use the brush applicator to apply thin layers of toner from root to tip. Your toning kit will come with a brush applicator, which makes it super easy to paint the toner onto your hair. Start at the roots at your bottom hairline and work your way down to the ends, saturating all of your hair with thin layers of toner. Once you finish the first section of hair, clip it out of the way and release 1 of the front sections. [6] X Research source Repeat the same process for each section of hair. You don’t need to rush but work as quickly as you can. You want the toner to be on all sections of your hair for about the same amount of time."
    },
    {
      "title": "Leave the toner on your hair for the specified amount of time.",
      "content": "Leave the toner on your hair for the specified amount of time. Timing varies by brand, but it’s usually about 20-30 minutes. You can use a timer on your phone or just keep an eye on the clock so you don’t lose track of time. The toner may turn dark purple as it sits on your hair—don’t be alarmed! This is normal and it will not make your hair look darker. [7] X Research source Always follow the directions provided in your toning kit when it comes to timing. Over-toning your hair could result in a greenish or greyish cast."
    },
    {
      "title": "Rinse the toner out of your hair with cool water.",
      "content": "Rinse the toner out of your hair with cool water. It’s important to get all of the toner out of your hair, so be thorough! Since the toner is purple, it’s pretty easy to tell when all of it is out of your hair. If the water looks clear after rinsing for a few minutes, you’ve removed all of the toner. [8] X Research source"
    },
    {
      "title": "Shampoo and condition your hair as you normally would.",
      "content": "Shampoo and condition your hair as you normally would. Follow up your rinse with a sulfate-free shampoo, lathering your hair like usual. Rinse out the shampoo and apply your favorite conditioner. If your hair is feeling dry, use a deep conditioner. Let the conditioner sit on your hair for about 5 minutes and rinse it out. [9] X Research source"
    },
    {
      "title": "Measure out water and apple cider vinegar in a 2:1 ratio.",
      "content": "Measure out water and apple cider vinegar in a 2:1 ratio. If you aren't sure how much to use, start with 1 cup (240 mL) of apple cider vinegar and 2 cups (470 mL) of water. Apple cider vinegar is known to make hair soft and smooth, so avoid using other types of vinegar and stick with apple cider vinegar."
    },
    {
      "title": "Transfer the vinegar and water to a spray bottle.",
      "content": "Transfer the vinegar and water to a spray bottle. You don’t have to do this, but it will be much easier and less messy to use a spray bottle to apply the vinegar to your hair. Otherwise, you’ll have to bend over in the tub and pour the vinegar through your hair, which can get a little messy."
    },
    {
      "title": "Shampoo your hair with your usual shampoo.",
      "content": "Shampoo your hair with your usual shampoo. Hop in the shower and use a gentle, sulfate-free shampoo to wash your hair as you normally would. Rinse out the shampoo and squeeze the lengths of your hair to get rid of excess water. For this technique to work, it’s important that you shampoo your hair before you apply the vinegar rather than after you apply it."
    },
    {
      "title": "Saturate your hair with the vinegar.",
      "content": "Saturate your hair with the vinegar. You can step out of the shower for this part or just step out of the way of the shower head. Spray the vinegar all over your hair from root to tip. Be sure to saturate your hair thoroughly so that you don’t miss any spots!"
    },
    {
      "title": "Let the vinegar sit on your hair for at least 15 minutes.",
      "content": "Let the vinegar sit on your hair for at least 15 minutes. Feel free to take care of other stuff, like washing up or shaving, while you wait—just be sure to keep your hair protected from the water! You might want to wear a shower cap over your hair while the vinegar soaks so you can move around freely. [10] X Research source"
    },
    {
      "title": "Rinse out the vinegar and style your hair as you normally would.",
      "content": "Rinse out the vinegar and style your hair as you normally would. Rinse with lukewarm water only and don’t follow up with shampoo. Don’t worry, that vinegar smell will go away once your hair is dry! After rinsing your hair, let it air-dry or blow dry it. Then, style it as you normally would."
    },
    {
      "title": "Pick up a purple shampoo at your beauty supply store.",
      "content": "Pick up a purple shampoo at your beauty supply store. Purple shampoo doesn’t have ammonia in it like chemical toners do, so it is a lot less damaging. The shampoo has strong violet pigments in it that help to neutralize the yellow tones in your hair. [11] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020. The results typically aren’t as vibrant or intense as what you’d get with a toner, but purple shampoos are still quite effective."
    },
    {
      "title": "Rinse your hair with hot water to open up the hair shaft.",
      "content": "Rinse your hair with hot water to open up the hair shaft. Hop in the shower and set the water to the hottest temperature you can stand. If it burns your skin, it’s way too hot! Aim for the same temperature you’d use for a nice, steamy shower. [12] X Research source"
    },
    {
      "title": "Apply a generous amount of shampoo and work it into a lather.",
      "content": "Apply a generous amount of shampoo and work it into a lather. Exactly how much purple shampoo you use depends on the product and the length of your hair, but you’ll probably want to use about a palmful. Apply the shampoo to your hair until it’s well saturated, working from root to tip as you lather it up. [13] X Research source To ensure even coverage, you might want to run a wide-toothed comb through your hair once it’s good and lathered."
    },
    {
      "title": "Let the shampoo sit on your hair for 5 to 30 minutes.",
      "content": "Let the shampoo sit on your hair for 5 to 30 minutes. You might want to clip your hair up or put on a shower cap to protect it from water while you wait. 5-10 minutes is pretty typical, but you can leave the shampoo on your hair for up to 30 minutes. The longer you let it soak, the more your hair will absorb and the better your results will be. [14] X Research source Don’t leave purple shampoo on your hair for longer than 30 minutes to prevent dryness and damage. [15] X Research source"
    },
    {
      "title": "Rinse out the shampoo thoroughly with cold water.",
      "content": "Rinse out the shampoo thoroughly with cold water. Cold water will seal in the color and close the hair shaft, so switch the water over to the coolest temperature you can stand and rinse your hair. Be sure to rinse well, since pigment residue might make your hair look purple after you dry it. If that happens, just jump in the shower and rinse your hair again."
    },
    {
      "title": "Repeat this process 1-2 times per week to maintain your results.",
      "content": "Repeat this process 1-2 times per week to maintain your results. Purple shampoo is strong, so you shouldn’t use it every single day. [16] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020. If you typically shampoo your hair every day, use the purple shampoo once a week. If you wash your hair every few days, use purple shampoo once every other week. [17] X Research source To maintain yellow-free hair, you will need to continue using the purple shampoo regularly."
    }
  ]
}