{
  "url": "https://www.wikihow.com/Get-Longer-Hair-Fast",
  "title": "How to Get Longer Hair Fast",
  "steps": [
    {
      "title": "Change the way you wash your hair.",
      "content": "Change the way you wash your hair. Factors like how often you wash your hair and what water temperature you use can affect the length of your hair. That's because washing your hair too often (think every day) and using super hot water will cause it to dry out and become brittle. That leads to hair breakage, preventing your hair from growing long and thick. The solution? Wash your hair no more than 3 times a week, and use the coldest water you can handle. [1] X Research source At first, washing your hair less often might make it look a little greasy. Wear a hat for a few days until your scalp gets used to producing less oil and things balance out. It shouldn't take long! If you hate showering in cold water, try washing your hair in the sink with cold water separately from your regular showers. When you shower, keep your hair wrapped up in a shower cap."
    },
    {
      "title": "Dry your hair",
      "content": "Dry your hair gently. Do you towel dry your hair roughly, brush it out, and blow it dry? You're breaking your hair! It won't get the chance to grow long and strong, because you're handling it too roughly while it's wet. Think of your hair like a garment made of good fabric; you wouldn't just throw it in the dryer, you'd carefully lay it out to gently air dry. Treat your hair with the same gentle care. After washing, gently pat it dry with a microfiber towel or t-shirt and let it finish air drying. Don't brush your hair while it's wet. Wet hair tends to stretch and break more easily than dry hair. If you need to detangle it, apply a conditioning product, such as a leave-in conditioner. Then, use your fingers and a wide-toothed comb to gently work through the tangles. Don't blow dry your hair except for special occasions. Blow drying often really does cause damage in the form of breakage, frizz and split ends, and it's not easy to repair; you just have to wait for fresh hair to grow out."
    },
    {
      "title": "Don't use harsh chemicals on your hair.",
      "content": "Don't use harsh chemicals on your hair. The shampoo and conditioner you use may be contributing to poor hair growth. Most commercial shampoos contain sulfates, which strip your hair of its natural oils and leave it susceptible to damage. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Conditioners contain silicones that coat the hair with chemicals and need to be washed out with more strong shampoo. This cycle is really damaging to hair! Here's what you can do instead: Give your hair one last wash with a strong shampoo, such as a clarifying shampoo, to get rid of any remaining silicones. Don't condition it this time; just gently detangle it and let it air dry. Give your hair a break for a few days. Don't do anything to it - don't wash it, straighten it, or use any products. Next time you wash your hair, use an all-natural shampoo . Read the label and use a shampoo that contains only natural oils and other cleansers, no chemicals. You could even try going shampoo free ! Condition with diluted apple cider vinegar . This really works, and when it dries you won't smell like vinegar at all. For a deep-conditioning treatment, try using coconut oil. You'll never want to go back to the chemical-laden stuff you used before."
    },
    {
      "title": "Try all-natural hair styling techniques and products.",
      "content": "Try all-natural hair styling techniques and products. In a similar vein, start using gentler methods when it comes to styling your hair. Use heating tools like curling irons, straighteners, and of course hair dryers only sparingly. Switch out chemical-filled hairsprays and gels for natural versions. This gives your hair the chance to grow long and strong, taking on its own unique, beautiful texture. You can make your own hair gel from non-harmful ingredients. To smooth flyaways and frizz, apply a little argan oil or another cosmetic oil to your hair, rather than using an over-the-counter product. Try natural methods to curl your hair without heat or to straighten it without heat ."
    },
    {
      "title": "Use a mask",
      "content": "Use a mask on your hair once every two weeks. This will help repair any damage that's been done to it by replenishing your hair's moisture. Afterward, your hair will feel soft, silky and healthy, and it'll stay healthy long enough to keep growing out. Try a hot oil mask using coconut and almond oil, as coconut oil has high penetration and deep conditioning power while almond oil adds extra shine to the weak dry hair. Massage the oil into your hair and put on a shower cap. Sit under a hooded hair dryer if you have one, or run a warm blow dryer over the cap for about 10 minutes. Then, remove the cap and wash your hair. Alternatively, apply the hair mask and braid your hair then put it in a bun and put a shower cap on. Keep your hair braided for at least day and night for three months and your hair will grow one to three inches more than normal hair growth. You could also try using warm olive oil, cinnamon and honey - this lightens your hair as it conditions it."
    },
    {
      "title": "Protect your hair from external damage.",
      "content": "Protect your hair from external damage. Cover it up when you spend long hours in the sun, swim in a chlorinated pool, or hang out where there's a high level of air pollution. Your hair can get damaged by repeated exposure to these elements, so tie it up in a scarf, wear a hat or swim cap, and make sure to use gentle washing and drying methods afterward to keep it healthy. [3] X Research source"
    },
    {
      "title": "Eat more protein.",
      "content": "Eat more protein. Protein is the foundation of hair, and you need a lot of it for your hair to grow long, shiny and healthy. That doesn't mean you have to eat loads of meat (although you can) - it just means you need to focus on having protein be at the center of most of your meals. [4] X Research source If you're a meat eater, enjoy, beef, chicken, fish, pork, and other types of meat. Eggs and some types of cheese are also high in protein. Beans and other legumes, nuts, and leafy vegetables like spinach have protein, too. If you're a vegetarian, you should live on these!"
    },
    {
      "title": "Eat omega-3 fatty acids.",
      "content": "Eat omega-3 fatty acids. This \"good\" fat contributes to healthy, shiny hair and skin. It's found in a number of delicious foods like avocados, nuts, salmon, flaxseed oil, and more. You can also take fish oil supplements for large bursts of omega-3 if you want an extra boost. [5] X Research source"
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. If you're dehydrated, it'll show in your hair. Your hair will become dry, dull, and more prone to breakage. That's means drinking water is an easy and absolutely essential part of growing longer hair. You'll see a difference in no time! Carry around a water bottle and plan to drink at least 2–3 liters (0.5–0.8 US gal) of water a day. If you have trouble drinking a lot of plain water, drink herbal tea or flavored water, too. Avoid caffeine and alcohol, and don't drink too much soda. Choose water instead."
    },
    {
      "title": "Take hair growth supplements.",
      "content": "Take hair growth supplements. Certain supplements are said to help promote hair growth and lead to longer hair over time. This isn't exactly a quick fix, but if you start taking supplements you might see improved hair growth over the course of a few weeks or months. Give some of these supplements a try to see if they work for you: Biotin is a popular hair growth supplement. It's often taken by pregnant people to make sure their growing babies have enough nutrients, but there's no reason you can't take it if you aren't pregnant. Atlantic cedar oil is a supplement that can be applied directly to the scalp to promote hair growth. [6] X Research source Argan oil can be used the same way. Beta-sitosterol is a plant and seed-based substance that may lead to faster hair growth. You can also try iron and zinc supplements as well as supplements that contain vitamins A, C, and E. [7] X Expert Source Madeleine Johnson Hair Stylist & Hair Extensions Specialist Expert Interview. 18 December 2019."
    },
    {
      "title": "Get clip-in extensions.",
      "content": "Get clip-in extensions. This is probably the fastest way to get longer hair! Go to a beauty supply store and pick out extensions that match your hair's color and texture. Clip them in under the top layer of hair, close to your scalp, so they'll blend in well. [8] X Expert Source Madeleine Johnson Hair Stylist & Hair Extensions Specialist Expert Interview. 18 December 2019. Get enough clip-ins to evenly place around your hair, so one side doesn't look thicker than another. You can get clip-ins made from plastic, real human hair, and other substances. Keep in mind that synthetic clip-ins won’t blend well with your natural hair and they will not last for very long. The more you want to spend, the more realistic they'll look."
    },
    {
      "title": "Get a professional weave or extensions at a salon.",
      "content": "Get a professional weave or extensions at a salon. This is a more expensive, more permanent version of extensions. Extensions made from real human hair or faux hair are woven, sewn, or glued to your hair or scalp. This is a popular method for getting instantly long hair used by celebrities. [9] X Expert Source Madeleine Johnson Hair Stylist & Hair Extensions Specialist Expert Interview. 18 December 2019. It's extremely important to make sure you go to a salon technician who knows what he or she is doing. Do not get extensions or a weave done by an amateur. It can lead to pain, irritation, and hair loss. Only try putting in your own extensions if you're extremely confident in your abilities! Otherwise, you might lose some hair in the process."
    },
    {
      "title": "Try a wig.",
      "content": "Try a wig . Want instantly longer hair? Why not try a wig? You can experiment with all kinds of hair colors and textures, and best of all, you can make your hair as long as you want. Go to a wig store and talk with the representative there to help you pick out one that looks good with your coloring and facial features. You can even have your wig cut and styled at a salon if you want."
    },
    {
      "title": "Get your hair trimmed about once every three months.",
      "content": "Get your hair trimmed about once every three months. You don't want to go too often seeing as you're trying to grow your hair. However it's important to get the damaged bits cut off, otherwise you'll end up with long hair that feels and looks like straw."
    },
    {
      "title": "Massage your scalp with your fingers for better circulation.",
      "content": "Massage your scalp with your fingers for better circulation. Do this for about 5 to 10 minutes to stimulate blood flow to the area. Increased blood flow will mean an increase in the amount of nutrients being transported there, which will increase growth. Lavender oil (pure essential oil) can be massaged on the scalp on alternate days as it is said to be very helpful for promoting hair growth. General exercise will also increase blood flow to your head as it increases blood flow around your whole body. Dry brushing your body is another good way to improve circulation."
    },
    {
      "title": "Reduce stress.",
      "content": "Reduce stress. Stress can lead to hair loss as well as a decrease in the speed in which your hair grows. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you do suffer from stress, try yoga or other types of exercise to help yourself to de-stress. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Get plenty of sleep.",
      "content": "Get plenty of sleep . Eight hours of sleep is essential. Sleep is the main time which your body spends on growth and repair. [12] X Research source If you don't get enough sleep then your body won't have enough time to concentrate on hair growth. [13] X Research source"
    }
  ]
}