{
  "url": "https://www.wikihow.com/Fix-Wet-Suede-Shoes",
  "title": "How to Fix Wet Suede Shoes",
  "steps": [
    {
      "title": "Remove the shoes and let them dry slowly in the open air.",
      "content": "Remove the shoes and let them dry slowly in the open air. Do not put the shoes in sunlight or next to a heater -- excessive heat can cause suede to warp and crack if you're not careful. Simply take them off and place them somewhere dry. Do not try and remove stains while the shoes are still wet, as this can strip the soft, felt-like texture. [1] X Research source"
    },
    {
      "title": "Stuff the shoes gently with tissue or newspaper if they are soaking wet, approximating the shape of your foot.",
      "content": "Stuff the shoes gently with tissue or newspaper if they are soaking wet, approximating the shape of your foot. When leather or suede gets wet, it often contracts. It then dries in this shrunken position, cracking the leather when you later stuff your foot in it. To prevent this, lightly ball up some paper and stuff it into the shoe lightly, so that it looks like there is a foot in the shoe. You don't want it busting at the seems or stuffed to the brim, just enough to absorb the water and help the shoe hold its shape. Make sure you get at least one piece all the way into the toe. Newspaper ink may run on your shoes if it gets wet. This is not a concern for most shoes, as it will stay on the inside, but you should still be careful."
    },
    {
      "title": "Lightly brush off any mud or dirt with a suede brush or gentle nylon brush.",
      "content": "Lightly brush off any mud or dirt with a suede brush or gentle nylon brush. You can also use a nailbrush or a toothbrush if it is all you have around. Gently, working with the nap (the direction of the suede hairs), brush away any major mud stains. Don't worry about getting them perfectly -- you don't want to to scrub suede while it is still wet if you can help it."
    },
    {
      "title": "Know that water will not ruin your suede shoes if you take your time letting them dry.",
      "content": "Know that water will not ruin your suede shoes if you take your time letting them dry. Do not wipe, rub, or scrub your suede vigorously. When the soft, delicate hairs get wet they will tense up and become brittle, making them easy to rip off. When your shoes get stained or wet, resist the urge to start scrubbing until they are fully dry. With a little bit of patience you can fix most damage to suede shoes. You cannot fix suede shoes if you've already stripped away the soft outer layer. Once you've ruined the felt, you cannot get it back. [2] X Research source"
    },
    {
      "title": "Spruce up the dried suede with a suede brush to return the soft texture to normal.",
      "content": "Spruce up the dried suede with a suede brush to return the soft texture to normal. Once the shoes are clean and completely dry, grab a suede brush and massage the fibers back into position. Work in small circles, massaging each area of the shoe until the fibers are soft and glowing. While older shoes will never be completely returned to their former glory, you can still vastly improve the look of your shoes from their sad, damn state."
    },
    {
      "title": "Apply a suede-protecting spray to your shoes to avoid further damage.",
      "content": "Apply a suede-protecting spray to your shoes to avoid further damage. Suede shoes can survive anywhere, as long as you are prepared. Most shoes will need suede-specific sprays or coatings, but the benefits are enormous. A protecting spray will keep your shoes dry, prevent watermarks and stains, and maintain the soft outer coating for years to come."
    },
    {
      "title": "Dry shoes completely before attacking any stains.",
      "content": "Dry shoes completely before attacking any stains. Even though some stain treatments do require a bit of water, you want the whole shoe to be dry before working. Water makes leather (and thus its cousin, suede) a little more pliable, and weaker. Working on wet shoes can lead to warping or cracking. Only add a touch of water when needed for cleaning; otherwise, work on dry shoes."
    },
    {
      "title": "Invest in a suede eraser to remove almost all stains and watermarks.",
      "content": "Invest in a suede eraser to remove almost all stains and watermarks. These simple tools are made to clean suede while still protecting the texture and color, and are invaluable tools for saving suede shoes. Simply rub the eraser gently in a circular motion to lift stains off the shoe, be careful not to scrub violently. When you're done, use a nylon, lint, or suede brush to gently comb the fabric back in the same direction. In general, suede erasers are great for: Watermarks Salt stains Water-based stains (like juices, drinks, etc). In a pinch, a sturdy pencil eraser will actually work similarly to a suede eraser, though not quite as effectively."
    },
    {
      "title": "Remove salt stains with a little white vinegar.",
      "content": "Remove salt stains with a little white vinegar. Mix in equal parts white vinegar and warm water (1/4 cup of each should be more than enough) and use a sponge or tooth brush to gently wipe away the stain with the mixture. Vinegar also works well for colorful stains, such as wine or chocolate, though it does not help much with mud or oil."
    },
    {
      "title": "Remove oil stains with some cornstarch or talcum powder.",
      "content": "Remove oil stains with some cornstarch or talcum powder. If you've spilled some oil on your shoes, you're going to need to adjust your cleaning strategy to save the shoes. Dust the stained area with cornstarch or talcum powder, then let the powder sit overnight. In the morning, take a dry brush and gently wipe away the talcum or cornstarch. You might have to moisten it a bit as well. Finally, use a suede brush to return the nap to its normal direction. [3] X Research source Oil stains are notoriously difficult to remove, so know that it may be impossible to remove without ruining the suede."
    },
    {
      "title": "Remove ink with cotton balls and rubbing alcohol.",
      "content": "Remove ink with cotton balls and rubbing alcohol. Simply blot away the ink with rubbing alcohol, 91% if you can find it. Once you've finished, let the shoe dry and use your suede eraser to remove any other issues."
    }
  ]
}