{
  "url": "https://www.wikihow.com/Date-Shy-Guys",
  "title": "How to Date Shy Guys",
  "steps": [
    {
      "title": "Show interest in little ways.",
      "content": "Show interest in little ways. [1] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Some shy guys need the green light to know that you're interested. Whenever you see him, be sure to smile and say “hi.” [2] X Research source If you see him from across the room, hold eye contact for a little while and smile. Doing so may give him the courage to come over."
    },
    {
      "title": "Approach him one-on-one.",
      "content": "Approach him one-on-one. Even the most outgoing guys can be overwhelmed when you're constantly surrounded by a group of friends. Take the pressure off by stepping away from your pals to chat him up. [3] X Research source A shy guy will be more likely to engage with you one-on-one. If your friends are around, ask them to meet you later so you can talk in private. Then walk up to your shy guy with a huge smile and say \"Hi.\""
    },
    {
      "title": "Ask open-ended questions to keep conversations going.",
      "content": "Ask open-ended questions to keep conversations going. [4] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Greeting one another and making small talk will only get you so far with a shy guy. Take conversations deeper by using open-ended questions that require more than a “yes” or “no” answer. [5] X Research source"
    },
    {
      "title": "Suggest low-key activities to warm up to one another.",
      "content": "Suggest low-key activities to warm up to one another. Once you and Mr. Shy get on friendly terms, suggest a time for you to hang out together. These should be low-key get-togethers under “safe” conditions, using something that connects the two of you. [6] X Research source"
    },
    {
      "title": "Chat side-by-side rather than face-to-face.",
      "content": "Chat side-by-side rather than face-to-face. Guys in general are more receptive during shoulder-to-shoulder activities as opposed to head-on ones. Try to reduce the pressure and help him get comfortable with you by talking and doing activities side-by-side. [7] X Research source"
    },
    {
      "title": "Connect through shared interests.",
      "content": "Connect through shared interests. [8] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Your shy crush will be more relaxed when he's in his “zone,” so find things you have in common. Use these interests to deepen conversations or bring excitement to your time together. For example, if you both like Stranger Things, consider binge-watching the show or going to a convention together. You're more likely to win him over if the interest is genuinely mutual. He'll be able to tell if you're pretending to like something just to get close to him."
    },
    {
      "title": "Invite him out to a no-pressure small gathering.",
      "content": "Invite him out to a no-pressure small gathering. Calling it a “date” just might freak out a shy guy in the early stages, so ask him out to lighter, small group gatherings. Maybe ask him to come with you and friends to a concert or a festival happening in your city. [9] X Research source"
    },
    {
      "title": "Up the stakes by hanging out one-on-one.",
      "content": "Up the stakes by hanging out one-on-one. After you've gotten to know one another, initiate plans for a real date. Plan the date around your personalities, so you both feel comfortable. [10] X Research source Consider going to a movie for a first date with a shy guy, because there's no pressure to talk or make face-to-face chit-chat. If he's not the mushy type, resist the urge to plan a romantic candlelight dinner. Instead, go for something light-hearted and casual, so you can both be yourselves."
    },
    {
      "title": "Get comfortable with some silence.",
      "content": "Get comfortable with some silence. At first, you might be unnerved by the many silences that come with dating a shy guy. You might need to repeat something to yourself, like “Silence is not a bad thing” to avoid rushing in with empty or unnecessary conversation. [11] X Research source Over time, you might find that you enjoy the shared silences between you—it can be a relief to not always have to talk! Silence is perfectly okay and natural in relationships."
    },
    {
      "title": "Give him space as needed.",
      "content": "Give him space as needed. If your boyfriend is shy or introverted, he may need time alone to recharge. Don't take this personally—it's nothing against you. Just establish a way for him to let you know when he needs a little space. [12] X Research source He might put on some headphones when you're together to demonstrate a need to pull away. Or, he might grow quiet and withdrawn. If this happens, you might ask, \"Why don't I go in the other room and give you some space?\" or \"I think I'll go hang out with my friends for a while. Call ya later, okay?\""
    },
    {
      "title": "Allow him time to warm to your friends.",
      "content": "Allow him time to warm to your friends. Avoid situations in which your friends \"grill\" him with questions. This might make him retreat back into his shell. Also, ask him in advance if he's okay hanging out with a group of your pals. He may feel more comfortable if he can bring a friend along, too. Remember, just because you love your friends doesn't mean your guy will. Give him some time to warm up to them instead of assuming that he'll like them since he likes you."
    },
    {
      "title": "Don't draw attention to his shyness.",
      "content": "Don't draw attention to his shyness. You might think it's cute when your crush acts shy or blushes, but he may be mortified inside. Avoid calling out his shyness, whether in a group or when you're alone. Just overlook it and act like whatever he's doing is totally normal. [13] X Research source For example, never say “Aww, you're really shy!” or “You're blushing!” Calling attention to his shyness will make him feel self-conscious and maybe make him not want to hang out with you."
    },
    {
      "title": "Plan to take the lead with intimacy.",
      "content": "Plan to take the lead with intimacy. One of the tough things about dating a shy guy is having to initiate intimacy. Hugs, kisses, and other forms of affection will likely have to be prompted by you in order for them to happen. Your guy may be too shy to make the first move. [14] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. [15] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Dating a shy guy might feel agonizing. You might constantly wonder if you're on the right track. You might also get frustrated when it takes him longer to open up. He will send you signals in his own way to let you know that he's into you. Give it time. [16] X Research source"
    }
  ]
}