{
  "url": "https://www.wikihow.com/Fatten-Up-a-Dog",
  "title": "How to Fatten Up a Dog",
  "steps": [
    {
      "title": "Figure out if there is a logical reason your dog is underweight.",
      "content": "Figure out if there is a logical reason your dog is underweight. If you know why the dog is underweight, such as a bitch that has recently raised a litter of strong, greedy puppies, or a rescue dog has been mistreated, then fattening up the dog will be relatively straight forward. Be sure to monitor the dog who is underweight, so that you can find any issues that might be easy to fix. For example, if you have several dogs, the answer can be as simple as the other dogs stealing your underweight dog's food."
    },
    {
      "title": "Assess the overall health of your dog.",
      "content": "Assess the overall health of your dog. All kinds of illnesses can interfere with the body's ability to process food and get the goodness out of it, leading to weight loss. If this is the case, the dog will almost certainly show some signs including decreased appetite, increased thirst, lack of energy, vomiting, diarrhea, or a change of body shape. Conditions that can cause weight loss include lack of pancreatic enzymes, diabetes mellitus, liver disease, kidney disease, cancer, and inflammatory bowel disease. [1] X Research source Small Animal Internal Medicine. Nelson &amp; Couto. Publisher: Mosby Again, if you notice any of these symptoms then a vet check is for the best."
    },
    {
      "title": "Get your dog checked by a veterinarian.",
      "content": "Get your dog checked by a veterinarian. If you suspect your dog is ill, or if you notice unexplained weight loss, it's best to consult a vet. If your dog suddenly has a poor appetite for no reason, it's also best to consult a professional before the problem gets out of control. Once the vet gives the all clear, and you know you just have a fussy dog, then there are a variety of strategies that can help improve its appetite. [2] X Research source Small Animal Internal Medicine. Nelson &amp; Couto. Publisher: Mosby"
    },
    {
      "title": "Check your dog's actual weight against the breed's ideal weight.",
      "content": "Check your dog's actual weight against the breed's ideal weight. It easy to think that a pet is underweight, whereas the reality could be that he is just less heavy than an obese dog of the same breed that you happen to know. Maybe your dog is actually fine, but it's the other dog that is too fat!"
    },
    {
      "title": "Check the food packaging against your dog's ideal weight.",
      "content": "Check the food packaging against your dog's ideal weight. For dogs that are thin but full of energy and producing formed feces, the first step is to check they are getting enough calories per meal. A dog may lose weight because it uses up more calories than it is eating. This may be straightforward -- as when the dog isn't being fed enough food. If this is the case, then increasing his portion size should do the trick. The simplest way to do this is compare your dog's ideal weight with the suggested feeding amount on the food packaging. If your dog is a specific breed, there is lots of information online about what is that breed's ideal weight. Go with the weight you want the dog to be, rather than the weight it is at the moment. For example, if you own a male Labrador then an average sized dog should weigh up to 40kg."
    },
    {
      "title": "Compare what you have been feeding your dog to what the recommended amount of food is.",
      "content": "Compare what you have been feeding your dog to what the recommended amount of food is. Measure out a typical portion of your dog's daily food allowance by weight. Make a note of the weight of the food and compare it to the recommended amount from the food packaging. It's interesting to note that some of these recommendations are actually 25% above what the dog needs (they tend to be on the generous side, rather than the skimpy side). If you are giving your Labrador 400g of kibble a day, and the packaging advises 500g a day, then your dog is being fed 20% less calories than the recommended and so it will lose weight. This is easily rectified by increasing the amount of his daily allowance."
    },
    {
      "title": "Decide how much to increase your dog's food allowance.",
      "content": "Decide how much to increase your dog's food allowance. This can be a difficult decision because each food contains different amounts of calories and the size of dogs vary so much. As a rule of thumb, increase the food by no more than 10% of the original quantity. So if you were feeding 400g a day, an extra 10% adds another 40g, which you would split into 2 meals of 20g each additional. Feed this for 2 -3 days and check the dog doesn't have diarrhea, at which point you can add another 10% and so on."
    },
    {
      "title": "Gradually increase the amount of food you feed your dog.",
      "content": "Gradually increase the amount of food you feed your dog. Suddenly feeding way more food is a recipe for disturbing the balance of the bowel and causing diarrhea. Much safer is to gradually increase the portion size and monitor the dog's toilet to make sure it is coping. If the difference in ration is not large, then divide the extra between two meals. If the difference is large, then adding in an extra meal (rather than making the existing ones larger) will be more gentle on the bowel. [3] X Research source Small Animal Internal Medicine. Nelson &amp; Couto. Publisher: Mosby If the dog gets diarrhea it is then losing precious nutrition and so your efforts are for nothing."
    },
    {
      "title": "Feed your dog vitamin B-rich foods.",
      "content": "Feed your dog vitamin B-rich foods. Liver is one of the most vitamin B12-rich foods available. You can give your dog cooked beef or chicken liver two or three times a week as a snack in between meals. For example, you would want to feed a 10 kilogram dog 50 to 70 grams of cooked liver. Eggs are also high in B12. In addition they contain a lot of Vitamin A, Riboflavin, Folate, Vitamin B12, Iron, Selenium, and Fatty acids. Give your dog raw eggs, adding one egg three times a week to their dog food. Remember to add these foods gradually, so that they do not upset your dog's stomach."
    },
    {
      "title": "Transition your dog onto high energy dog food gradually.",
      "content": "Transition your dog onto high energy dog food gradually. High energy dog food means they have a high caloric content and can easily be absorbed and assimilated into the body. This will prevent thinning and emaciation, and will aid in giving your thin dog additional weight. Good brands to try include Hill’s Science Diet High Energy ®, and Royal Canin Veterinary Diet High Energy. You can also try transitioning your dog onto a puppy food. Puppy food contains more calories than regular food, because it is designed to serve the high energy needs of growing puppies. The down side is that puppy food tends to be rich, and may upset some dogs' stomachs. Introduce it gradually, adding a spoonful to the existing food, and gradually building up the amount feed over 4 - 5 days. Monitor the dog's feces and if diarrhea develops then stop the new food."
    },
    {
      "title": "Switch wet food to dry food, or vice versa.",
      "content": "Switch wet food to dry food, or vice versa. Imagine yourself eating the same dry food, or the same cereal or soup, day in and day out. You’d probably get bored of it. Dogs can experience a similar boredom with their food. Sometimes switching from dry to wet canned food, or vice versa, will do the trick and get your dog to start eating again. However, be aware that tin food contains a lot less calories than dry food. For the same volume of food, wet food contains just a quarter of the amount of dry kibble, so a little dry kibble is worth a lot of wet food. This is because wet food is 60 - 80% water, so whilst it may be more appetizing, you run the risk of filling the dog's stomach with water and giving it inadequate calories."
    },
    {
      "title": "Feed your dog vet-approved homemade recipes.",
      "content": "Feed your dog vet-approved homemade recipes . Feeding your dog homemade recipes can give variety to your dog’s diet, making it more interested in its food. A sample recipe is from Founder's Veterinary Clinic of Brea, California. This sample recipe is for a 10-kilogram dog that you can divide into two for a 5-kilogram dog, or double the amount for a 20-kilogram dog. The dog food consists of 100 grams of cooked, skinless chicken; 1 cup of cooked brown rice; 1 cup of peas and carrots; 1 tablespoon of vegetable oil; and 1/4 teaspoon of a salt substitute. Cook all of these ingredients and mix them together. Try other recipes like this chicken and rice dog food , or this raw food diet."
    },
    {
      "title": "Give your dog vitamin supplements.",
      "content": "Give your dog vitamin supplements. The B vitamins are mainly involved in enzyme systems that increase your dog’s appetite, and in energy metabolism of fats, proteins, and carbohydrates. In short, they ease the conversion of energy sources like fats, proteins and carbohydrates into energy, providing your pet the energy needed for growth and maintenance. The excess energy brought about by the increase in appetite and consumption will then be converted to fats and will prevent muscle catabolism, or wasting. The best B-complex vitamins include Pet-Tabs® and LC-Vit®. [4] X Research source Be sure to follow the directions on the packaging. For puppies, it is recommended that you use liquid multivitamins like LC-Vit® (3ml daily). Another option is to bring your dog to a vet and have her given a shot of B-complex vitamins, if you do not have time to give it daily vitamin supplements. The regime is one injection, once a week for four weeks. If the dog's appetite has not improved at the end of this time, then further injections are unlikely to be beneficial."
    },
    {
      "title": "De-worm your dog with de-wormer medication.",
      "content": "De-worm your dog with de-wormer medication. It is sensible to regularly deworm your dog because worms compete for food in the dog's bowel and cause poor body condition, silently sucking the nutrition out of your dog. Perversely, a dog with a heavy worm burden is likely to have a potbelly, but the bones of the ribs and hips lose fat cover and become stark. [5] X Research source Small Animal Internal Medicine. Nelson &amp; Couto. Publisher: Mosby Choose a broad spectrum de-wormer that can cover all types of worms. Praziquantel (Canex®) is a good example of a broad spectrum de-wormer. Canex® for Medium Sized Dogs can be used at a dose of 1 tablet per 10 kilograms of body weight. Canex ® for Large Sized dogs can be used at a dose of 1 tablet per 20 kilograms of body weight. For smaller dogs, half a tablet of Canex® for Medium Sized dogs can be used. If it’s the first time that you will de-worm your dog, you can do it three times with a two week interval. From the first time on, de-worming can be done every six months to one year."
    },
    {
      "title": "Give your dog energy supplements.",
      "content": "Give your dog energy supplements. Dogs that are active, working, lactating, frequently travelling, or getting used to a new home tend to become thin and lose appetite. You can give these dogs energy supplements that are packed with easily absorbed carbohydrates and vitamins. A good example of an energy supplement is Nutri-Plus Gel®. You can give your dog 1 to 2 teaspoons per 5 kg body weight or 10 centimeter (3.9 in) of gel per day (using the plastic gel applicator or doser provided)."
    }
  ]
}