{
  "url": "https://www.wikihow.com/Dramatic-Classic-Kibbe",
  "title": "Dramatic Classic Kibbe Body Type: The Ultimate Style Guide",
  "steps": [
    {
      "title": "Dramatic Classic is a body type with angular and balanced features.",
      "content": "Dramatic Classic is a body type with angular and balanced features. In styling, there are 13 body types defined by fashion expert David Kibbe in his 1987 book Metamorphosis: Discover Your Image Identity and Dazzle As Only You Can . Depending on the body's structure and proportions, the types fall within a yin/yang spectrum. [1] X Research source The yin side is the most feminine or romantic, whereas the yang side represents the most masculine or dramatic. The Dramatic Classic ID is near the center of the spectrum, leaning more towards yang and presenting an angular frame with softer, fleshier features. [2] X Research source In women, the Dramatic Classic body type takes on a subtle hourglass figure. In men, it’s an inverted triangle. The Kibbe scale has 3 Classic body types: Dramatic Classics have a cool and sophisticated essence. Pure Classics have a cool and reserved essence. Soft Classics have a polished and gracious essence. Those with a Dramatic Classic body type first gain weight in their hips and thighs. The subtle hourglass or inverted triangle shape transforms into a pear shape as they gain weight on their bottom half. [3] X Research source"
    },
    {
      "title": "",
      "content": "A Dramatic Classic body type is defined by several characteristics. Chances are, if you have these physical attributes, you’re a Dramatic Classic: [4] X Research source Around 5.7 ft (68 in) tall Longer limbs Tapered shoulders that are square and narrow Square face Balanced facial features Small waist Proportionate bust and hips"
    },
    {
      "title": "",
      "content": "A Dramatic Classic body type can also be identified by what it doesn’t have. If you have one or more of these features, you’re likely not a Dramatic Classic: [5] X Research source Shorter or taller than 5.7 ft (68 in) Extremely long or short limbs Contrasting facial features Delicate bone structure Narrow and straight hips Petite frame Curvy figure"
    },
    {
      "title": "Clothing",
      "content": "Clothing Dramatic Classics look best in structured silhouettes with clean lines. [6] X Research source With your subtle feminine figure, waist definition is highly encouraged. Experts also recommend neutral, bold, and deep colors with a sophisticated edge. [7] X Research source Overall, garments that are tailored to the body and have a unique shape add structure to your already angular and proportionate frame. Tops: Turtlenecks, V-necklines, and/or square necklines Bottoms: Straight leg with a defined waist Skirts: Straight and narrow, longer than knee-length, slits Dresses: Coat dresses, sculpted shoulders, longer than knee-length Sweaters: Thin rib knits and longer cardigans Outerwear: Double-breasted, sharp shoulders, cropped streamlined jackets Shoes: Two-toned and narrow"
    },
    {
      "title": "Fabrics",
      "content": "Fabrics High-quality fabrics in moderate weights fit a Dramatic Classic best. If you have this body type, stick with matte-finishes and pliable knits. As a general rule, if the fabric can keep its shape on its own, it’ll sit on your frame perfectly. [8] X Research source Stay away from clingy, lightweight, or ultra-sheer fabrics like chiffon, tulle, and lace."
    },
    {
      "title": "Prints",
      "content": "Prints Classic, symmetrical patterns look best on Dramatic Classics. The sophisticated essence of your physique shines in stripes, plaids, and subtle florals. Stick with prints and patterns that are geometric and timeless to highlight your naturally balanced proportions. [9] X Research source Avoid bold, bright, and loud prints, as they can overpower your natural simplicity. Opt for patterns with neutral, deep tones over monochromatic and bold accents."
    },
    {
      "title": "Accessories",
      "content": "Accessories As a Dramatic Classic, stick with moderate-sized jewelry, bags, and belts. One of the best accessories a Dramatic Classic can have is a belt. Not only do these define your naturally small waist, but it also accentuates your proportionate frame. Along with this, stick with jewelry and bags that aren’t too big or small. Opt for items with a moderate size and structured or asymmetric style. [10] X Research source"
    },
    {
      "title": "Hair",
      "content": "Hair Dramatic Classics rock sleek and defined hairstyles. With your balanced features, you’ll look best with a simple hairdo. Avoid overly feminine or masculine looks, opting for simplicity instead. For instance, opt for loose waves rather than romantic curls. Go with a slicked-back straight hairstyle over a blunt bang."
    },
    {
      "title": "Makeup",
      "content": "Makeup Dramatic Classics glow in simple, balanced makeup looks. If you’re a Dramatic Classic, avoid dramatic looks. Instead, opt for simplicity to showcase your natural elegance and balanced features. [11] X Research source Opt for a natural lipstick, subtle eyeshadow, and angular brow to emphasize your sophisticated bone structure. Try balancing a rep lip with black winged eyeliner and neutral eyeshadow. Soften a more glamorous look with a bronze smokey eye and neutral lip."
    },
    {
      "title": "",
      "content": "These celebrities have been classified as a Dramatic Classic by fashion or Kibbe body type experts. You're likely a Dramatic Classic if you have a similar body type to these famous individuals: Courteney Cox David Beckham Diana Rigg Gena Rowlands Jackie Kennedy Onassis Jane Wyman Jill Biden Justin Timberlake Lana Turner Lizzy Caplan Maggie Siff Maria Shriver Nina Dobrev Olivia Munn Phylicia Rashad Ryan Gosling Suzanne Pleshette Shawn Mendes Tracy Scoggins"
    },
    {
      "title": "You’re probably a Dramatic Classic if you have the main characteristics.",
      "content": "You’re probably a Dramatic Classic if you have the main characteristics. More often than not, if you say, “Yep, that’s me!” when reading this article, you’re likely a Dramatic Classic. This means you have a square face, longer limbs, balanced facial features, and a small waist. Still not sure? No worries! Take a free online assessment to determine your body types, like ones from The Concept Wardrobe or Our Fashion Garden ."
    }
  ]
}