{
  "url": "https://www.wikihow.com/Game-Night-Ideas",
  "title": "24 Creative Game Night Ideas for Family & Friends",
  "steps": [
    {
      "title": "Paper telephone",
      "content": "Paper telephone In this fun paper version of the telephone game, one person writes down a phrase and then passes their paper to the next person who has to draw the phrase they see. When the drawing is done, they fold the paper over to hide the phrase and pass it to the next person to guess what the phrase is based on the drawing. [1] X Research source At the end, everyone unfolds the paper and sees how the original prompt went hilariously wrong! You can also have everyone write phrases on their own pieces of paper. The person next to you will pass you their phrase for you to draw, and then you pass on that paper when you’re finished. This way, everyone has a paper to reveal at the end of the game."
    },
    {
      "title": "Balloon tennis",
      "content": "Balloon tennis Looking for a fun active game to play indoors? Just blow up a colorful balloon and use painter’s tape to draw a line in the middle of the room where the “net” will be. Split up into teams, then swat the balloon back and forth. You can keep score by giving points to the opposite team if the balloon lands on the ground before a team can reach it. You can also use real tennis rackets or plastic fly swatters to bat the balloons to the other side of the room."
    },
    {
      "title": "Indoor hopscotch",
      "content": "Indoor hopscotch Hopscotch isn’t just for playgrounds anymore. Use painter’s tape and scissors to design your own creative hopscotch court in an open area of your house. [2] X Research source For even more fun, make a super long court with tons of boxes and challenge your family to hop as long as they can. If you’d like to draw a traditional hopscotch court, create a line of 8 to 10 boxes, with a couple of squares in pairs along the court. [3] X Research source"
    },
    {
      "title": "Indoor bowling",
      "content": "Indoor bowling Turn a long area in your home into a bowling alley. Just fill 10 empty plastic bottles with small toys, pebbles, or sand, and set them up in a triangular formation at one end of the room. [4] X Research source From the other side of the room, roll a ball along the ground to try and knock over as many pins as possible. If you’d like to keep score, give a point to the bowler for every pin they knock down. The one with the most pins at the end of the game wins! [5] X Research source"
    },
    {
      "title": "Movie night blanket fort",
      "content": "Movie night blanket fort Create a comfy cool blanket fort to watch movies with your family in! Gather all your biggest softest blankets, spare sheets, sofa cushions, and pillows, then make the ultimate blanket fort with all your family members. [6] X Research source Surround your television with the blanket fort, or bring in a laptop to watch a movie you all love together. If you don’t have any furniture tall enough to use for your blanket fort, try hanging a clothesline or yarn across the room and draping your sheets over it. [7] X Research source"
    },
    {
      "title": "Paper plane contest",
      "content": "Paper plane contest Let your family game night take flight with a paper airplane-making contest. Have everyone make their own paper airplane , then throw them down a long hallway and see whose goes the farthest! For an extra challenge, you could have everyone judge each other’s airplane and give points for not only flight power but appearance and overall creativity."
    },
    {
      "title": "Charades",
      "content": "Charades Gather around the couch and play charades , the classic guessing game. Have everyone write down words or phrases on small slips of paper, then place them all into a hat or bowl. Split the family into two teams, flip a coin to see who goes first, then have the first player take a slip and act out the word or phrase without speaking. [8] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source Set a timer for 30 seconds before the player acts out the word, and if the guessers say the correct word or phrase within that time limit, they win the round and get a point. The teams alternate turns and choose new “actors” each time. The team with the most points at the end of the game wins! [9] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source"
    },
    {
      "title": "Salad Bowl",
      "content": "Salad Bowl Salad bowl, or fishbowl, is an easy game that’s similar to charades. To play , divide everyone into 2 teams, then have each player write down 3 words or phrases on 3 slips of paper. Put all the slips of paper into a bowl, then play 1 round of Taboo, 1 round of charades, and 1 round of Password. The team with the most points at the end wins! [10] X Research source To play Password, have 1 person on each team draw a slip of paper. The person who draws has to get the other person on their team to guess the word or phrase by giving them a one-word clue. If the person guesses wrong, the other team gets a turn. [11] X Research source To play Taboo, pick the guesser and have 1 person from the other team draw a slip and write down 4 words similar to the phrase on the paper. The guesser’s teammates have to get the guesser to guess the word without saying the other 4 “taboo” words. [12] X Research source You can also try this fun virtual version of the game ."
    },
    {
      "title": "Spoons",
      "content": "Spoons Spoons is a fast-paced card game that’s great for groups of 6 or more. All you need to play is a deck of playing cards and spoons. The goal is to collect 4 cards of a kind and secretly grab a spoon before the other people in the group notice. The person who hasn't grabbed a spoon at the end is out of the game. Keep playing until all the spoons have been taken. [13] X Research source Place a pile of spoons in the center of the table—1 less than the number of players in the group. Each person gets 4 cards, and the first player takes a card from the deck and decides whether to keep it or pass it to the person on their left. The person to their left decides whether to keep the card or swap out one of their cards for the new card to try to get 4 of a kind. The first player to collect 4 of the same card secretly grabs a spoon."
    },
    {
      "title": "Family Feud",
      "content": "Family Feud Channel your inner Steve Harvey and make your own Family Feud Game at home . Split your family into 2 teams, then write one of these Family Feud questions , in a place everyone can see it. Have members of each team face off to see who can buzz in with the correct answer first. The team with the most points at the end wins! [14] X Research source"
    },
    {
      "title": "Jeopardy",
      "content": "Jeopardy Jeopardy is a classic trivia game that’s great for all ages. Make your own Jeopardy game by creating 3 rounds for Jeopardy , Double Jeopardy , and Final Jeopardy , and choosing 1 person to be the Jeopardy master. Everyone else gets to try to guess the correct answers (in question format, of course). [15] X Research source You can also make your own Jeopardy game using PowerPoint slides . You can also use this virtual Jeopardy board preloaded with family-friendly jeopardy prompts."
    },
    {
      "title": "Chopped",
      "content": "Chopped Show off your incredible cooking skills by pretending you’re all on an episode of Chopped . Split your family into 2 or 3 teams, and choose 1 person to be the host. The host will choose 3 to 4 mystery ingredients to give each team. Each team has to create something delicious in 30 minutes and have everyone else judge their creation. [16] X Research source When the time's up, have the other teams judge the first team on a scale of 1 to 5 points for taste, presentation, and overall creativity."
    },
    {
      "title": "Minute to Win It",
      "content": "Minute to Win It Split up your family into 2 or 3 teams and have them face off in 7 Minute to Win It challenges of your choice. Set a timer for each challenge. Give the first team to finish 5 points, the second team 3, and the third team 1. The team with the most points at the end of all 7 challenges wins! [17] X Research source Here are some examples of challenges you could use: Place a cookie on each player’s forehead and have them use only their facial muscles to get it into their mouth. See who can make the best tower of cards in 10 minutes. Move 6 ping pong balls from one bowl to another on the other side of the room using only a spoon held in your mouth. Wrap one person in your team with toilet paper in 1 minute, then judge who has the best toilet paper outfit. Set up an obstacle course with chairs, pillows, and other household objects and see who can get to the end the fastest. Set up cups on one side of the room and see how many marshmallows or ping pong balls you can throw in them in 3 minutes. Have each player hold a popsicle stick in their mouth and see how many dice they can stack on top of it in 1 minute."
    },
    {
      "title": "Mad Libs",
      "content": "Mad Libs Make your own Mad Libs prompts and have the other people in your family fill in the missing spaces with their own wacky words. All you need for this game is a couple of pieces of paper and pencils. Each person writes down an outrageous story and then chooses 10 to 15 words to erase so that the other people can fill them in. When you erase each word, write the part of speech in or under the space so you know what the other person has to fill it in with. For example, if you erase “dog,” write “noun,” or “walked,” write “verb (past tense).”"
    },
    {
      "title": "Play a board game",
      "content": "Play a board game You can never go wrong with a classic board game. Gather all your favorite snacks, sit at a comfy table, and create hours of fun with these family-friendly board games. [18] X Research source Catan Junior Apples to Apples Ticket to Ride Bananagrams Jenga Exploding Kittens Pictionary UNO Taboo"
    },
    {
      "title": "Bowl of truth",
      "content": "Bowl of truth Break the ice with this fun getting-to-know-you game. Give everyone 3 slips of paper and have them write a different fact about themselves on each one. Put all the slips in the bowl, then take turns reading a slip and trying to guess who the fact is about."
    },
    {
      "title": "Never Have I Ever",
      "content": "Never Have I Ever Gather 5 of your closest friends to play a game of Never Have I Ever . Have everyone hold up 10 fingers, then go around and have everyone say something they haven’t done before, starting with the phrase “Never have I ever...” If one of the other people has done what the player says, they put their finger down. [19] X Research source For example, you could say, “Never have I ever climbed a tree” or “Never have I ever gone skinny dipping.” The person who still has fingers up at the end of the game wins! If you’d like to turn it into a drinking game, have everyone take a sip of their drink instead of putting a finger down."
    },
    {
      "title": "Would You Rather?",
      "content": "Would You Rather? Start a game of Would You Rather? with interesting scenarios and questions you can ask your friends. Choose which person goes first, then have the first player ask a question that begins with “Would you rather?” After they choose which one they’d rather do, continue asking different questions in a circle. The question can pair any funny or serious scenarios together, like “Would you rather be completely hairy all over or be completely bald all over?” or “Would you rather live 1 life that lasts 1,000 years or 10 lives that last 1 year?”"
    },
    {
      "title": "Press conference",
      "content": "Press conference Get your improv on with this interactive game for 3 to 8 players. Have 1 player leave the room and have everyone else pick a celebrity or historical figure for them to be. When the person comes back, ask them questions that might give them a hint of who they could be. If they guess correctly, they win! [20] X Research source The other players are like journalists, which means you can pretend to be like journalists—try taking pictures or fighting with each other about who gets to ask their questions."
    },
    {
      "title": "React and act",
      "content": "React and act In this game, everyone tries to guess what situation the player is in based on the reactions they give. Everyone writes down a situation (like winning the lottery or getting chased by a bear) on a slip of paper and places it into a bowl. The first player takes a slip and tries to act out how they’d react to the situation. The person who correctly guesses what the situation is wins!"
    },
    {
      "title": "The Newlywed Game",
      "content": "The Newlywed Game If you’re looking for a fun game for couples to play, you’re in the right place. Have 1 person from each couple leave the room. Ask the other partners a series of questions and write down their answers. Have the other partners come back, ask them the questions, and see if they can guess their partner’s answer. Here are questions you could ask: [21] X Research source What is one thing your partner has that you’d love to get rid of? What is your partner’s guilty pleasure? Who spends more time in the shower? What’s your partner’s worst habit? Is your partner more like their mom or their dad? Who spends the most money on personal items? What is your partner’s biggest fear? What song would best describe your partner in the bedroom? What is your first memory of your partner?"
    },
    {
      "title": "Drop a hint",
      "content": "Drop a hint In this fun party game, split your group up into 2 teams with at least 4 people each. List a bunch of random words on a piece of paper, cut them out, and put all of the slips in a bowl. In each round, 3 people draw a slip and try to get their teammate to guess a word. The catch is, each team member can only say 1 word at a time. [22] X Research source For example, if your group draws the word “monkey,” they might say “banana,” “gorilla,” or “zoo.”"
    },
    {
      "title": "Mirror Charades",
      "content": "Mirror Charades Try this creative variation of the game charades. Just like the normal game, have 1 person pick a slip of paper with a word or phrase on it. Instead of performing for the group, have them stand behind the group and choose another person to mirror their actions in front of everyone. The first one to guess the correct answer wins! You can choose almost anything to write down as a prompt. Try movie, song, or television titles, or choose something random like “trombone” or “playing basketball.” [23] X Research source"
    },
    {
      "title": "Play a board game",
      "content": "Play a board game Try an adult-friendly board game that everyone will enjoy. Make some tasty drinks, grab your favorite finger foods, and gather around the table for a great game night. Here are a few board/party games you might try: [24] X Research source Jackbox Games (video game) Cards Against Humanity Heads Up! Hunt a Killer What Do You Meme? Codenames Telestrations After Dark Carcassonne Wingspan Wavelength Catch Phrase"
    },
    {
      "title": "Pick games that everyone in your group can play.",
      "content": "Pick games that everyone in your group can play. Based on the size and skill of your group, try to choose a game that you think everyone might have fun playing. If you’re not sure what everyone will like, you can also pick out 2 to 3 games and have your guests pick out what they want to play. [25] X Research source For example, if you have a lot of older teens on your guestlist, it might be best to try a more “adult-oriented” game like What Do You Meme? or Codenames. Reader Poll: We asked 220 wikiHow readers what the most important factor is for a game night, and 72% of them said choosing games that everyone can enjoy. [Take Poll] So make sure to think about the ages, interests, and experiences of all of your guests before settling on one game."
    },
    {
      "title": "Set the mood with lighting, music, and snacks.",
      "content": "Set the mood with lighting, music, and snacks. For a casual game night, turn on a couple of soft lights and put on a playlist of your favorite songs to create a warm and inviting atmosphere. Make sure everyone has comfortable chairs and set out finger foods to snack on like chips, popcorn, or veggies and ranch. [26] X Research source If you’re throwing an adults-only game night, try making an alcoholic party punch and put out a couple of sodas or sweet teas for your sober friends."
    },
    {
      "title": "Give out prizes or awards at the end of the night.",
      "content": "Give out prizes or awards at the end of the night. If you’re hosting a family game night or if your adults-only game night has a fun theme, try giving out unique prizes to whoever wins the game (or the most games) at the end of the night. It could be something as simple as a cookie, or you could go all-out and get them a plastic trophy ."
    },
    {
      "title": "Challenge family or friends to come up with their own game ideas.",
      "content": "Challenge family or friends to come up with their own game ideas. If all goes well at the end of the night, ask your friends or family members if they’d like to make game night a regular event. If you’re playing with family, ask everyone to come up with games for the next game night. If you’re playing with friends, try to take turns hosting each night."
    }
  ]
}