{
  "url": "https://www.wikihow.com/Diagnose-Testicular-Cancer",
  "title": "How to Check Yourself for Testicular Cancer",
  "steps": [
    {
      "title": "Check your testicles once every few months.",
      "content": "Check your testicles once every few months. Regular self-exams can help detect abnormalities due to cancer or other medical issues. Blood vessels, tubes that carry sperm, and other normal parts of your anatomy can feel strange at first. In time, you’ll learn what’s normal for you, and you’ll be able to recognize anything unusual. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you want help understanding your normal anatomy, ask your doctor for guidance at your next check-up."
    },
    {
      "title": "Perform a self-exam after you take a bath or shower.",
      "content": "Perform a self-exam after you take a bath or shower. A warm shower or bath helps relax the skin of the scrotum, or the sac that holds the testicles. It’s easier to perform a testicular self-exam when the scrotal skin is relaxed. [3] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source"
    },
    {
      "title": "Hold 1 testicle between your thumbs and fingers.",
      "content": "Hold 1 testicle between your thumbs and fingers. Check 1 testicle at a time. Hold the testicle with your thumbs and fingertips of both hands. Gently roll your fingers over it and around the surrounding parts of your scrotum. [4] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Look and feel for lumps or changes in size, shape, or firmness.",
      "content": "Look and feel for lumps or changes in size, shape, or firmness. Check for any lumps or changes that you find unusual. Note anything that you don’t remember feeling the last time you performed a self-exam. [5] X Research source After performing a few self-exams, you’ll recognize normal parts of your anatomy. Keep in mind the epididymis, or a small coiled tube on the side of each testicle, feels like a small lump, but is a normal part of your body. It’s also normal for a testicle to be slightly larger or hang lower than the other. It’s not normal, however, for a testicle to suddenly become swollen, develop an unusual lump, or change shape."
    },
    {
      "title": "Note any related symptoms.",
      "content": "Note any related symptoms. Other symptoms could include testicular pain, a sore abdomen, or a feeling of heaviness in the scrotum. Rarely, breasts can grow or become sore due to a hormone produced by some testicular tumors. [6] X Research source Lumps, swelling, pain, and other symptoms can be caused by a variety of conditions. If you experience any of these symptoms, you’ll need to see your doctor for an accurate diagnosis."
    },
    {
      "title": "See your doctor promptly if you notice unusual symptoms.",
      "content": "See your doctor promptly if you notice unusual symptoms. Schedule an appointment as soon as you notice a lump, swelling, or any other unusual changes. Your doctor will perform a physical exam and, if necessary, perform an ultrasound and order blood tests. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Most lumps found in the scrotum aren’t cancerous, but only a doctor can distinguish between cancer and other conditions."
    },
    {
      "title": "Allow your doctor to perform a physical exam.",
      "content": "Allow your doctor to perform a physical exam. It might feel strange to have someone examine your private areas, but remember that your doctor is there to help you. Let them know where you noticed a lump or swelling and if you experience pain or any other symptoms. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source They might hold a small examination flashlight to your scrotum to see if light passes through a lump or swollen area. If light passes through, the lump is probably filled with liquid and could be a hydrocele . It could be cancerous if it blocks light."
    },
    {
      "title": "Have them perform a scrotal ultrasound.",
      "content": "Have them perform a scrotal ultrasound. After the physical exam, your doctor will likely perform an ultrasound. An ultrasound creates an image of the testicles and surrounding anatomy. This will help your doctor determine the abnormality’s size, location, and other details. [9] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source"
    },
    {
      "title": "Get blood marker tests to help confirm the diagnosis.",
      "content": "Get blood marker tests to help confirm the diagnosis. After an ultrasound, your doctor might order blood tests that detect substances produced by cancerous tumors. Testing for tumor markers helps your doctor confirm a cancer diagnosis. It also provides information about the specific type of testicular cancer and stage of progression. [10] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source Even when caught at an advanced stage, testicular cancer is usually curable."
    },
    {
      "title": "Ask your doctor if they recommend imaging scans.",
      "content": "Ask your doctor if they recommend imaging scans. Your doctor might order a CAT scan, MRI, or other tests to check if other parts of your body are affected. Testicular cancer usually doesn’t spread, but treatment options are typically successful even if it does move to other parts of the body. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Unlike other cancers, doctors typically don’t order a biopsy, which is when a tissue sample is extracted for testing. A biopsy could injure the testicle and increase the risk of cancer spreading to other organs."
    },
    {
      "title": "Remember that testicular cancer can usually be cured.",
      "content": "Remember that testicular cancer can usually be cured. Learning that you have cancer is scary. However, testicular cancer is almost always treated without complications. Dealing with health issues is never easy, but remember that up to 99 percent of patients live completely normal lives after treatment for testicular cancer. [12] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source"
    },
    {
      "title": "Ask your doctor about the type of cancer and best treatment option.",
      "content": "Ask your doctor about the type of cancer and best treatment option. There are multiple types of testicular cancer; the best treatment depends on the type of cancer and its stage of progression. Ask your doctor about your particular condition, whether you’ll need radiation or chemotherapy, and the timeline of your treatment. [13] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source"
    },
    {
      "title": "Have the affected testicle surgically removed.",
      "content": "Have the affected testicle surgically removed. In most cases, the first step is to surgically remove the affected testicle. Work with your doctor to schedule surgery, and follow all pre-operative instructions, such as fasting before going to the hospital. You’ll most likely be able to go home a few hours after the procedure. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Applying ice wrapped in a towel for 10 minutes at a time during the first 24 hours will help with bruising, swelling, and soreness. You’ll likely wear a bandage for the first 48 hours, so you won’t be able to bathe during that time. After 48 hours, clean the area according to your doctor’s instructions. Swelling, redness, and soreness should start to get better within a week, but you’ll need to stick to light activity for about a month."
    },
    {
      "title": "Discuss sperm banking if you require radiation or chemotherapy.",
      "content": "Discuss sperm banking if you require radiation or chemotherapy. Having 1 testicle surgically removed doesn’t pose a risk of infertility. However, if both testicles are affected, or if you need chemotherapy or radiation, you might want to consider sperm banking before treatment. Sperm banking is when sperm are frozen and stored for later use. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Radiation or chemotherapy might be necessary if the cancer has spread or if traces of the tumor remain after surgery. In only about 2 percent of cases, both testicles need to be removed. In these rare cases, doctors also recommend testosterone replacement therapy."
    },
    {
      "title": "Perform self-exams and schedule routine check-ups after treatment.",
      "content": "Perform self-exams and schedule routine check-ups after treatment. After treating testicular cancer, you’ll need to continue to monitor for unusual changes. Men who’ve previously had testicular cancer are at a higher risk of developing it in the remaining testicle. You'll also need to see your doctor at least annually for routine testing. [16] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source"
    }
  ]
}