{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Sore-Throat-Fast-and-Naturally",
  "title": "How to Get Rid of a Sore Throat Fast and Naturally",
  "steps": [
    {
      "title": "Use a humidifier.",
      "content": "Use a humidifier. Dry air will only make your sore throat worse with every breath you take. To help keep your throat moisturized and soothed, try to raise the moisture levels in the air. This is especially important if you live in a dry environment. Clean your humidifier every week to prevent bacteria or mold from growing in it. If your throat feels particularly scratchy, try taking a hot shower and spending time in the steamy bathroom."
    },
    {
      "title": "Gargle with saltwater.",
      "content": "Gargle with saltwater. Add about 1 teaspoon of either table salt or sea salt to 8 oz. of warm water and stir to dissolve the salt. Gargle with the solution for about 30 seconds and spit it out. Repeat once every hour. [2] X Research source The salt reduces the swelling by drawing out the water in the swollen tissues."
    },
    {
      "title": "Eat soft foods that won't irritate your throat.",
      "content": "Eat soft foods that won't irritate your throat. Choose items like applesauce, rice, scrambled eggs, well-cooked pasta, oatmeal, smoothies, and well-cooked beans and legumes. Cold foods and drinks like ice pops and frozen yogurt can also soothe your throat. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid spicy foods like chicken wings, pepperoni pizza, or anything with hot peppery, curry, or garlic. Avoid hard or sticky foods that might be hard to swallow. Examples include peanut butter, dry bread, toast or crackers, raw vegetables or fruits, and dry cereals."
    },
    {
      "title": "Chew your food well.",
      "content": "Chew your food well. Cut your food into small pieces with a fork and knife before putting it in your mouth. Make sure to chew it enough to break it down before swallowing. Chewing and letting saliva moisten the food will make it easier for you to swallow. [4] X Research source You might also use a food processor to puree foods for easier swallowing. [5] X Research source"
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. Drinking water prevents dehydration and keeps your throat moist to reduce discomfort. Most people prefer room-temperature water when they have a sore throat. If cold or hot water makes you feel better, though, drink that instead. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try adding a teaspoon of honey to the water. Honey has antibacterial properties and can help soothe and coat the throat. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Have lots of soups and broths.",
      "content": "Have lots of soups and broths. The old tales of treating colds with chicken soup are true! The liquid can help prevent a sinus infection while also soothing your throat, minimizing coughing, and keeping you hydrated. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Enjoy herbal tea.",
      "content": "Enjoy herbal tea. Herbal teas that contain licorice root, sage, ginger root, thyme, oregano, and marshmallow root can soothe your throat and help you relax. They may also help combat bacterial infections due to their antiseptic properties. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Start by brewing a cup of your favorite tea and adding 1 tsp (5 g) of a beneficial herb for a soothing effect. Have 3-5 cups per day for the best results. Add some honey or lemon to your tea for flavor."
    },
    {
      "title": "Get immediate care for difficulty breathing, swallowing, or severe symptoms.",
      "content": "Get immediate care for difficulty breathing, swallowing, or severe symptoms. These are emergency symptoms that require medical attention. Call your doctor for a same-day appointment, or visit an urgent care center or emergency room for treatment. Severe symptoms include the following: [10] X Research source A sore throat that lasts longer than a week or seems severe Difficulty swallowing Difficulty breathing Difficulty in opening your mouth Pain in your jaw joint Joint pain, especially new pains Earache Rash Fever higher than 101 F (38.3 C) Blood in your saliva or phlegm Frequently recurring sore throats A lump or mass in your neck Hoarseness that lasts more than two weeks"
    },
    {
      "title": "See a doctor if your symptoms persist or you may have an infection.",
      "content": "See a doctor if your symptoms persist or you may have an infection. Normally, your sore throat will start to improve within a week. However, your sore throat may be caused by a viral or bacterial infection. If the infection is bacterial, your doctor may prescribe an antibiotic to help you recover. Call your doctor if you notice the following symptoms: Fever Chills Coughing Runny nose Sneezing Body aches Headache Nausea or vomiting"
    },
    {
      "title": "Get a simple physical exam at your doctor’s office.",
      "content": "Get a simple physical exam at your doctor’s office. Your doctor will look at your throat, feel your neck to check for swollen glands, listen to your breathing, and ask you about your symptoms. Then, they may take a throat swab to see if your sore throat is caused by a viral or bacterial infection. Although the throat swab shouldn’t cause you any pain, it may cause some discomfort if it triggers your gag reflex. After the throat swab is tested, your doctor will prescribe the best treatment. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The doctor may also order a CBC (complete blood count) to check for an infection, or they may test you for allergies."
    },
    {
      "title": "Take antibiotics for a bacterial infection, as directed.",
      "content": "Take antibiotics for a bacterial infection, as directed. Your doctor may prescribe an antibiotic if your sore throat is caused by a bacterial infection. The medicine will help your immune system fight off the infection so you can feel better faster. Make sure you take all of the medication as prescribed, even if you start to feel better early. Otherwise, your symptoms may return. [12] X Research source"
    },
    {
      "title": "Take over-the-counter pain relievers for discomfort from a viral infection.",
      "content": "Take over-the-counter pain relievers for discomfort from a viral infection. Unfortunately, there’s no medication for a viral infection. However, you can take pain relievers like NSAIDs or acetaminophen (Tylenol) to help with pain or discomfort. Always take these medications as directed on the label, and check with your doctor first. [13] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Over the counter NSAIDs include ibuprofen (Advil, Motrin) and naproxen (Aleve). Never give aspirin to a child under the age of 16, as it may cause Reye’s Syndrome."
    }
  ]
}