{
  "url": "https://www.wikihow.com/Fix-the-%22This-App-Can%27t-Be-Activated-by-the-Built-in-Administrator%22-Error-in-Windows",
  "title": "4 Ways to Solve the \"This App Can't Be Activated by the Built in Administrator\" Error in Windows",
  "steps": [
    {
      "title": "Click the Start button.",
      "content": "Click the Start button. You can also press ⊞ Win ."
    },
    {
      "title": "Type uac while the Start menu is open.",
      "content": "Type uac while the Start menu is open. This will search for UAC options."
    },
    {
      "title": "Click the Change User Account Control settings option.",
      "content": "Click the Change User Account Control settings option. This will open the User Account Control Settings window."
    },
    {
      "title": "Move the slider up one level.",
      "content": "Move the slider up one level. If UAC was disabled, move the slider up one level to enable basic UAC. If UAC was already enabled, raise the slider to the next security level."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . Click Yes if prompted by UAC to continue."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. You'll need to reboot your computer in order for the new UAC changes to take effect."
    },
    {
      "title": "Try opening the app again.",
      "content": "Try opening the app again."
    },
    {
      "title": "Lower your UAC settings again.",
      "content": "Lower your UAC settings again. If the app is able to launch, you should be able to go back to your UAC settings and lower it to the setting you were using before. You'll need to reboot again after making the changes."
    },
    {
      "title": "Press ⊞ Win+R.",
      "content": "Press ⊞ Win + R . This will open the Run window."
    },
    {
      "title": "Type WSReset.exe and press ↵ Enter.",
      "content": "Type WSReset.exe and press ↵ Enter . You'll see a Command Prompt window appear for a few moments, and then the Windows Store will open."
    },
    {
      "title": "Try opening your app again.",
      "content": "Try opening your app again. Resetting the Windows Store may have fixed the problem you were experiencing. [1] X Research source"
    },
    {
      "title": "Right-click the Start button.",
      "content": "Right-click the Start button. You'll see a list of options appear. If you're using Windows 8 and don't see a Start button, press ⊞ Win + X ."
    },
    {
      "title": "Click Command Prompt (Admin).",
      "content": "Click Command Prompt (Admin) . This will open a Command Prompt window with administrator access."
    },
    {
      "title": "Type SFC /scannow and press ↵ Enter.",
      "content": "Type SFC /scannow and press ↵ Enter . This will begin the System File Checker utility."
    },
    {
      "title": "Wait while the scan completes.",
      "content": "Wait while the scan completes. You can see the scan progress in the Command Prompt window. The scan can take quite a while, especially for slower systems or computers with large amounts of storage. You can cancel the scan at any time by pressing Ctrl + C ."
    },
    {
      "title": "Try running the app again.",
      "content": "Try running the app again. If the scan was able to find and repair any problems, your app may now work."
    },
    {
      "title": "Press ⊞ Win+R.",
      "content": "Press ⊞ Win + R . This will open the Run window. This method should only be attempted if all other methods have failed, as it involved manually editing Windows Registry entries."
    },
    {
      "title": "Type secpol.msc and press ↵ Enter.",
      "content": "Type secpol.msc and press ↵ Enter . If you get a \"Windows cannot find secpol.msc\" message, you are not running a compatible version of Windows. This feature is only available in Pro and Enterprise versions of Windows."
    },
    {
      "title": "Expand the Local Policies folder.",
      "content": "Expand the Local Policies folder. You'll see this in the left frame, and several folders will appear underneath it."
    },
    {
      "title": "Click Security Options.",
      "content": "Click Security Options . You'll see a list of policies appear in the right frame."
    },
    {
      "title": "Find the User Account Control: Admin Approval Mode... entry.",
      "content": "Find the User Account Control: Admin Approval Mode... entry. You may have to scroll to find it."
    },
    {
      "title": "Double-click the entry.",
      "content": "Double-click the entry."
    },
    {
      "title": "Select the Enabled radio button.",
      "content": "Select the Enabled radio button."
    },
    {
      "title": "Click OK.",
      "content": "Click OK ."
    },
    {
      "title": "Press ⊞ Win+R.",
      "content": "Press ⊞ Win + R . This will open the Run window again."
    },
    {
      "title": "Type regedit and press ↵ Enter.",
      "content": "Type regedit and press ↵ Enter ."
    },
    {
      "title": "Expand the directory tree to find the correct entry.",
      "content": "Expand the directory tree to find the correct entry. Expand the directory tree in the left frame to open the following location: HKEY_LOCAL_MACHINE → SOFTWARE → Microsoft → Windows → CurrentVersion → Policies → System → UIPI"
    },
    {
      "title": "Double-click the (Default) item.",
      "content": "Double-click the (Default) item. You'll see this in the right frame after selecting the UIPI folder."
    },
    {
      "title": "Type 0x00000001(1) into the Value data field.",
      "content": "Type 0x00000001(1) into the Value data field."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This will save the changes."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. This will apply your new security policy and registry settings."
    },
    {
      "title": "Try running your app again.",
      "content": "Try running your app again. If your computer's security policy settings were to blame for the app not working, it should work now. [2] X Research source"
    }
  ]
}