{
  "url": "https://www.wikihow.com/Dabke",
  "title": "How to Dabke",
  "steps": [
    {
      "title": "Find the right music.",
      "content": "Find the right music. You can dance dabke to any music, as long as it has a consistent recognizable rhythm. Songs with a faster pace work best for this high-energy dance. Traditional dabke music is performed live using a combination of instruments that usually include hand drums, woodwinds, and the oud. The band may play well-known songs or improvise, sometimes blending the two together. A vocalist also typically performs, singing songs that tell a story or are in some way significant to the event being held. Modern dabke can be done to either live music or a recording. Newer dabke music often blends traditional instruments with electronic beats. Some popular dabke artists make their music entirely digitally. [1] X Research source Vocalists are less common in modern dabke music, with many popular songs having only a small singing part with some completely instrumental. [2] X Research source Even just a large group clapping can be danced to. Clapping can also be used in addition to music to help dancers keep rhythm and as a way for non-dancers to join in. [3] X Research source"
    },
    {
      "title": "Begin at your starting position.",
      "content": "Begin at your starting position. Stand up straight, holding your neighbors' hands. Keep your feet spaced slightly apart with your left foot slightly in front. Try to line your feet up in parallel with your partners'. [4] X Research source"
    },
    {
      "title": "Step to the right with your left foot.",
      "content": "Step to the right with your left foot. Swing your left foot towards your right side. Cross over your right foot with your left to take a step. At this point your legs should now be crossed. [5] X Research source"
    },
    {
      "title": "Return to your starting position.",
      "content": "Return to your starting position. Step further to the right with your right foot. Uncross your legs by moving your right foot one step to the right. You should now be standing a few feet from where you were at the beginning of the dance but in the exact same position. [6] X Research source"
    },
    {
      "title": "Move another length to the right.",
      "content": "Move another length to the right. Repeat the steps you just took. Cross your left leg in front of your right. Follow up by taking a step to the right. This whole sequence is called a \"cross-over\" [7] X Research source and is the basic step of the dabke. Cross-overs may be done many times between other moves. Over the course of the dance, the chain may reverse directions. To accomplish this, simply switch your sides so that your right foot faces towards the front and crosses over your left leg."
    },
    {
      "title": "Kick your left foot forward.",
      "content": "Kick your left foot forward. Swing your foot into a \"low kick.\" Your leg should be straight and form a roughly 45 degree angle to your right leg and the rest of your body. Keep your toes facing either forward or angled up rather than pointing towards the ground. [8] X Research source"
    },
    {
      "title": "Raise your left leg higher.",
      "content": "Raise your left leg higher. Take your leg from a \"low kick\" to a \"raise.\" Simply bend your knee and bring your thigh up as high as you can get it. Your left leg should now be at a nearly 90 degree angle compared to the rest of your body. Your knee should point slightly downward."
    },
    {
      "title": "Stomp down hard on the ground.",
      "content": "Stomp down hard on the ground. Bring your left foot back flat on the ground by straightening your leg and focusing your weight forward slightly. After you stomp down, you should once again be in your starting position. As dabke literally means \"to stomp,\" [9] X Research source this step is often considered the most important part of the dance. [10] X Research source"
    },
    {
      "title": "Repeat these steps as quickly as you can.",
      "content": "Repeat these steps as quickly as you can. Dabke is a very energetic, fast-paced dance. You and your partners should perform these steps as quickly as the music demands. Cross-overs, kicks, and stomps should each be done as fluidly as possible without a major pause in movement. While dabke is generally made up of these two main steps, many dancers incorporate a variety of different types of jumps and footwork."
    },
    {
      "title": "Follow the leader.",
      "content": "Follow the leader. In most styles of dabke, the chain of dancers is led by one person as its \"raas\" (meaning \"head\") or lawweeh (meaning \"waver\"). He or she decides what moves to do and where the chain will go. Some dabke leaders may position themselves at the end of the chain itself, while others dance in an unlinked separate position between the chain and an audience. Watch your lead and try to mimic him or her while in sync with the other dancers. Because of their relatively free position, leads may perform certain moves, such as spins or flips, that are impossible for linked dancers to do. The other dancers are not generally expected to repeat these."
    },
    {
      "title": "Take a turn at the lead.",
      "content": "Take a turn at the lead. Once you've practiced enough and grown confident in your dabke skills, you may ask to take a turn as the leader. Immerse yourself in the music. As the song goes on, make decisions on what moves will look the best together and feel most natural to the dancers you are leading."
    },
    {
      "title": "Hop and jump.",
      "content": "Hop and jump. The occasional synchronized jump or kick adds variation to the dabke. Use them to punctuate every few step cycles. Kick your legs forward. Hop backwards, forwards, or to the side."
    },
    {
      "title": "Change directions.",
      "content": "Change directions. If you aren't dancing in a circle, switching directions will be necessary every time you reach the end of the dance floor. However, you may choose to switch directions more often or turn the line instead. Try to make these changes regularly after a certain time or number of step cycles."
    },
    {
      "title": "Split the line.",
      "content": "Split the line. Splitting a long dabke chain into much smaller ones for a time is another popular move, especially for choreographed dabke teams. These smaller lines can then dance against each other to create beautiful patterns. Splitting may also be done to spotlight solo dancers. [11] X Research source Two almost opposite moves are to move the chain inward to form a semicircle or join the ends for a temporary complete circle."
    },
    {
      "title": "Get a group together on the dance floor.",
      "content": "Get a group together on the dance floor. You will need at least three people for dabke, but the dance works best with five or more. There is no limit to how many people can join in on a single dabke dance. In fact, the world record for the biggest dabke dance consisted of 5,050 dancers. [12] X Research source Get as many people to dabke as you have room for. To gather a dabke group, ask family members and friends if they would like to start one. Some events may have a specific time to dabke planned. If you're curious about when it starts, what kind of music will be playing, or who can join in, try asking the host. You could also put together a dabke team beforehand and ask to perform at the event."
    },
    {
      "title": "Figure out who should take the lead.",
      "content": "Figure out who should take the lead. Usually someone will volunteer to lead, but if you know someone is particularly talented, you can try asking him or her personally. Ultimately, anyone who knows the basics of dabke can lead, no matter the person's age, gender, or skill-level. [13] X Research source [14] X Research source"
    },
    {
      "title": "Form a chain.",
      "content": "Form a chain. An important aspect of dabke is that it symbolizes harmony and togetherness. To do this, the dancers physically link themselves together. Dancers may hold hands, place arms over each other's shoulders, or switch between the two over the course of the dance. A dabke chain can be a straight line, [15] X Research source a semicircle, [16] X Research source or lack a defined shape altogether."
    },
    {
      "title": "Synchronize your moves.",
      "content": "Synchronize your moves. Try to make sure that you and the other dancers are exactly in sync with each other. The more people who stay in perfect time, the more impressive your dabke will look. In addition to looking great, the coordinated moves further drive home the importance of community in dabke."
    }
  ]
}