{
  "url": "https://www.wikihow.com/Gain-an-Inch-on-Your-Hips",
  "title": "How to Gain an Inch on Your Hips",
  "steps": [
    {
      "title": "Use the stair master.",
      "content": "Use the stair master. Cardio exercises, like using the stair master, can help build the muscles around your hips and butt. Incorporating the stair master as a form of cardio can help increase the size of your hips. [2] X Research source Studies have shown that the stair master recruits about 24% of your glutes and hip muscles. Use the stair master 1-2 times a week for at least 30 minutes per session. To make this exercise more challenging and target your hips and butt, lean forward when stepping and do not hold onto the side rails. This forces your body to use your butt muscles more significantly. Also take large steps - almost as if you were taking two at a time. This actives a large portion of those muscles."
    },
    {
      "title": "Hop on the elliptical.",
      "content": "Hop on the elliptical. Another cardio machine that can help tone your butt, hips and increase the size of your hips is the elliptical. It gives you the opportunity to really work those muscles. The elliptical machine recruits about 36% of your butt and hip muscles. This is slightly more than the stair master. Use the elliptical for at least 30 minutes. However, to get a well rounded workout, try doing 15 minutes of the stair master plus 15 minutes on the elliptical. To help target your hip and butt muscles, really focus on pressing down your foot, heel first. Also ease your hips backwards a bit, so that your butt is popping out a bit. This position helps specifically target those muscles."
    },
    {
      "title": "Walk or jog on the treadmill.",
      "content": "Walk or jog on the treadmill. Running is a great cardio exercise. In general, it's a great way to target your butt and hips. However, using a treadmill allows you to use the incline function making this machine a great way to increase your hip size. [3] X Research source Walking or jogging on the treadmill recruits the highest amount of your hip and butt muscles - almost 50%. Walk or jog on the treadmill for at least 30 minutes. Again, doing a combination of multiple cardio exercises can help work your butt and hips in different ways giving a better overall workout. To really target those hips, increase the incline on your treadmill. This places more stress on your glutes and hips and also give your bottom half more definition. Another option is to walk sideways on a treadmill. Set the treadmill on an incline and start at a slow pace. Cross your legs over one another to walk sideways. This will give your hips the tension they need to induce muscle growth."
    },
    {
      "title": "Take a spin class.",
      "content": "Take a spin class. If you want to burn a lot of calories while toning your hips, consider taking a spin class. It's a great exercise to help strengthen and tone your hips, butt and thighs. [4] X Research source Spin classes recruit many of the muscles around your hip and butt. The up and down positioning and varying resistances help make this a great exercise to increase your hip size. To help really target those hips, sit farther back on the bike seat and really focus on pushing down hard on those pedals. You may even want to increase the resistance. If you're in a standing position on your bike, really stick your butt out far behind you. This position is another one that will require you to stabilize your body with your butt and hip muscles."
    },
    {
      "title": "Give yourself time for recovery.",
      "content": "Give yourself time for recovery. Your exercise plan should include at least one day of rest per week, to prevent plateaus and give your body time to recover. Mix up your workouts and their intensity to keep yourself motivated. Consider trying a lower-impact workout like yoga or Pilates on your recovery days. Reader Poll: We asked 188 wikiHow readers and 57% of them said that the fitness class they’d be most interesting in trying is yoga or Pilates . [Take Poll]"
    },
    {
      "title": "Do bridges.",
      "content": "Do bridges. There are a variety of strength training exercises that can help build mass and define both your butt and hips. The bridge exercise or butt lift is a great exercise to include that will recruit both your butt and hip muscles. [5] X Research source Lay down on your back to start this exercise. Keep arms flat on the floor beside you and bend your knees into a 90 degree angle. Your feet should be flat on the floor. With your knees bent, press your pelvis up in the air pushing upwards with your glutes. Stop when your back is in a straight line. Hold this position for as long as you can. Slowly lower your butt back down to the ground and repeat this exercise a few more times."
    },
    {
      "title": "Incorporate squats.",
      "content": "Incorporate squats. Squats are a classic exercise that can help tone your entire lower body. However, squats specifically recruit your glutes and hip muscles. Plus, with a few variations, you can really hone in on your hips. [6] X Research source Stand with your feet shoulder width apart and toes facing out at a 45 degree angle from your body. Squat deeply with your knees, keeping your back straight. Dip down until your thighs are almost parallel to the floor. Your butt should be pushed back out behind you. Hold your squat here for a few seconds and then push yourself back up to the standing position. Try to push using your glute muscles. To make squats more challenging, hold two dumbbells (one in each hand) or hold a barbell over your shoulders. To target your hips even more, add a side leg raise. When you come back up to your standing position, extend one leg straight out to the side. Alternate sides with each squat."
    },
    {
      "title": "Try doing lunges.",
      "content": "Try doing lunges. Like squats, lunges are a classic move that target your butt and hips. The need to help you balance and be stable really requires strength from your hips. [7] X Research source Stand up straight with your feet about hip width apart. While holding weights, step forward with your right leg about 3-4 feet. Dip down so that your right knee bends forward and your left leg knee drops to the floor. Lower down until your right thigh is parallel to the floor. Push back up to the starting position. Make sure to push back up with your right leg - not your left leg. Repeat on the other side and do about 8 lunges per side. A variation of lunges that can help target the hips in a different way are side lunges. Instead of stepping forward, step outwards to the side. Alternate between both legs."
    },
    {
      "title": "Try side leg raises.",
      "content": "Try side leg raises. One particular exercise that really targets your hip muscles are side leg raises. Incorporate this exercise in addition to lunges, squats and bridges. [8] X Research source Lay down on the floor your right side. Place your right arm so that your hand cradles your head and your upper arm is flat on the ground. Your left hand can rest on your hip or the ground in front of you. While tightening your abdominal muscles, slowly lift your left leg up into the air. Keep your leg perfectly straight and your toes flexed. Lift your leg as high as you can comfortably. Hold your leg in this position for a few seconds and then slowly lower back down. Repeat this move 8-10 times on the right leg. Then, roll over and repeat the same exercise on the right side."
    },
    {
      "title": "Increase your calorie intake daily.",
      "content": "Increase your calorie intake daily. In order to gain an inch on your hips, you will need to eat a little more. You need extra calories to help give your body the fuel it needs to increase the size of your hips. Just like with weight loss, you cannot spot treat with weight gain. You will need to gain weight safely and slowly over your whole body to see your hips increase in size. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can do this by adding about 250-500 calories to your typical daily intake. For example, if you currently eat 1,800 calories per day, try increasing your daily caloric intake to 2,050 - 2,300. Try using a food journal or journaling app on your smart phone to calculate your current calorie intake. That way, you'll know what level to aim to gain weight."
    },
    {
      "title": "Eat 3 meals daily plus a snack or two.",
      "content": "Eat 3 meals daily plus a snack or two. In order to increase your total calorie intake, you'll need to increase how much you're eating. You can increase your portion size or eat more frequently throughout the day. One of the easiest and more simple ways to gain weight, is by eating more frequently throughout the day. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try adding in a 4th small meal or adding 1-2 snacks a day in addition to your typical 3 meals per day. [11] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. Eating more frequently can help prevent you from getting overly full from larger meals and keep you feeling energetic throughout the day."
    },
    {
      "title": "Choose nutritious, calorie-dense foods.",
      "content": "Choose nutritious, calorie-dense foods. Another factor you'll need to focus on is the types of foods you eat. You need to add in foods that are higher in calorie so that those extra meals or snacks add up to be the needed 250-500 calories per day. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Calorie-dense foods will help you meet a higher calorie target a little more easily. For example, adding in a small salad as a fourth meal will only add about 100 calories or less. Instead, focus on foods like that are higher in calories. Foods that are higher in protein and healthy fats are a good place to start. Try: nuts, avocados, dairy products, eggs and fatty fish. For example, you can add healthy calories with snacks like: peanut butter and an apple, 2 hard boiled eggs, trail mix, or full fat greek yogurt with nuts. Avoid adding calories with unhealthy foods like sweets, fried foods, fast food and junk food."
    },
    {
      "title": "Focus on protein.",
      "content": "Focus on protein. While increasing your calories, you should also focus on making sure your diet is protein-rich. This is essential as protein is an important nutrient for muscle synthesis and energy. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To ensure you're getting in an adequate amount of protein everyday, include 1-2 servings of protein per meal. Each serving should be measured for accuracy. Measure out about a 1/2 cup or a 3-4 oz portion per serving. [14] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Try foods like: poultry, beef, pork, dairy products, eggs, nuts, beans, tofu and seafood. Protein shakes are another healthy option. [15] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 8 May 2020. While eating a protein-rich diet is important, still eat a wide variety of other foods like fruits, vegetables and whole grains."
    }
  ]
}