{
  "url": "https://www.wikihow.com/Fryd-Extracts-Real-or-Fake",
  "title": "How to Tell if FRYD Vapes are Real or Fake + If They’re Safe",
  "steps": [
    {
      "title": "We can’t confirm if FRYD is a legitimate company.",
      "content": "We can’t confirm if FRYD is a legitimate company. FRYD extracts and vapes are easy to find and buy online, but many people online are concerned the products are fake. Users on the r/fakecartridges subreddit suggest some FRYD vapes are authentic while others say that anything labeled with the FRYD brand is fake. Users claim if a FRYD extracts cart has a Kseal sticker on the bottom, then it’s a real product, but other people are still worried about them being fake."
    },
    {
      "title": "Reddit users claim to have gotten sick from FRYD carts.",
      "content": "Reddit users claim to have gotten sick from FRYD carts. On many Reddit posts, users claim that hitting FRYD disposables and carts have an unpleasant flavor. Others claim that the vapor hurts their throat or gives them headaches after a few hits."
    },
    {
      "title": "Many URLs claim to be the official FRYD website.",
      "content": "Many URLs claim to be the official FRYD website. Multiple sites use the FRYD name and logo, but it’s unclear which one (if any) are the actual product page. The websites all have shops where you can buy vapes, but they don’t have a lot of other information about what’s used in their products or the company. All of the following claim to be the “official” FRYD site: frydofficial.com frydofficialstore.com frydcarts.com frydextracts.store thcfrydextracts.com frydbrand.co Each of these sites also has their own authentication link where you can scan a product QR code or enter a serial number to verify if a vape is real or fake. Because the sites all claim to be official, the authentication may also be inaccurate. FRYD also doesn’t have any public social media pages while many other real vape brands will post regularly."
    },
    {
      "title": "Anyone can buy empty FRYD carts and fill them.",
      "content": "Anyone can buy empty FRYD carts and fill them. If you search for “FRYD empty” online, many results appear where you can buy empty FRYD cartridges in bulk. Because anyone can purchase the empties, it’s hard to know for sure if there are authentic FRYD products on the market."
    },
    {
      "title": "Errors in the printing or packaging",
      "content": "Errors in the printing or packaging Reputable vape brands have correct spelling, no printing errors, and information about the product printed on the packaging. If you notice that images look blurry, words are misspelled, or the printing looks uneven or spotty, then you’re most likely dealing with a counterfeit vape. [1] X Research source"
    },
    {
      "title": "No lab results or information on the package",
      "content": "No lab results or information on the package Real vapes are tested by labs to make sure they’re high-quality and safe to use, and to check THC levels. These results and the name of the lab are usually listed somewhere on the outside of the package. If you don’t see any of this information, then you have a fake. [2] X Research source"
    },
    {
      "title": "Poor craftsmanship on the vape assembly",
      "content": "Poor craftsmanship on the vape assembly Real vape cartridges or disposables have clean manufacturing without any defects or problems with the components. Inspect the vape once it’s opened. If it has rough edges, misaligned or crooked labels, damage, or loose components, then it’s probably a fake. [3] X Research source"
    },
    {
      "title": "Inconsistent vape oil color and consistency",
      "content": "Inconsistent vape oil color and consistency Real vapes typically have oil that’s clear or amber in color and has a thick consistency. If you notice that your vape oil has a different color, changes colors as you use it, or has a looser consistency, then there’s a good chance you have a fake product. [4] X Research source Do the “bubble test” when you get a new vape. Flip your vape cartridge upside-down and watch the bubbles inside the oil chamber. If the bubbles move quickly, then the oil is probably cut with another product."
    },
    {
      "title": "Burnt or harsh flavors when vaping",
      "content": "Burnt or harsh flavors when vaping Authentic vapes have rich flavors and create consistent vapor clouds when you use them. If you have a fake vape, the oil may have a burnt or chemical taste from the additional products added to the cart. Fakes may also have inconsistencies with how much vapor they produce between hits. [5] X Research source If you notice that your vape has a harsh or chemical flavor, avoid hitting it again because it may contain harmful ingredients. Many fake vapes have tested positive for vitamin E acetate or pesticides that can cause respiratory illness. [6] X Research source"
    },
    {
      "title": "Cheaper prices than similar products",
      "content": "Cheaper prices than similar products Compare the prices to similar vape sizes from a dispensary or reputable seller. If the cart has a significantly lower price than its competitors, chances are that the oil inside is lower quality and potentially unsafe to vape. [7] X Research source"
    },
    {
      "title": "Fake vapes are not safe because they may contain harmful ingredients.",
      "content": "Fake vapes are not safe because they may contain harmful ingredients. Fake disposables and cartridges don’t go through the same safety standards and lab testing as official brands. There’s no way to know for sure what’s inside a fake vape cart, and the oils may be mixed with other products that aren’t safe to consume. [8] X Research source Many fake vapes also test positive for pesticides, which can cause chest pain, difficulty breathing, nausea, or vomiting. Vitamin E acetate is a synthetic compound found in some fake vapes that can cause shortness of breath, cough, or chest pain. [9] X Research source"
    },
    {
      "title": "Purchase vapes from a licensed dispensary.",
      "content": "Purchase vapes from a licensed dispensary. Licensed dispensaries have to follow set standards and ensure all their products are properly tested and authentic. Check the dispensaries near you to see what vape carts and disposables they have in stock. If you want to verify they’re licensed, just ask! They shouldn’t have any problems answering your questions. [10] X Research source If the employees have trouble answering questions about their license or products, then it’s probably best to shop at a different dispensary. Real dispensaries are also required to check IDs and have security systems. If a dispensary doesn’t have either of these, avoid buying products from them. [11] X Research source Many states have an official government site listing all the registered dispensaries in the area. Search for “registered dispensaries in” followed by your state and look for a site ending in .gov."
    },
    {
      "title": "Check for a certificate of analysis (COA) on the packaging.",
      "content": "Check for a certificate of analysis (COA) on the packaging. After vapes are lab-tested, they’re given a COA that ensures they’re free from contaminants and are safe to use. The COA information is always printed on the packaging or has a QR code so you can look at the lab results and verify your vape is legitimate. [12] X Research source"
    },
    {
      "title": "Do FRYD disposables have nicotine?",
      "content": "Do FRYD disposables have nicotine? It’s unclear if FRYD extracts contain nicotine because they aren’t lab-tested. Some Reddit users claim counterfeit sellers may add e-liquid that contains nicotine to fill FRYD cartridges instead of only using oil."
    },
    {
      "title": "Do dispensaries sell fake carts?",
      "content": "Do dispensaries sell fake carts? Licensed dispensaries only sell products that have been lab-tested and pass safety standards. If you want to ensure that you get a real vape cart that’s safe to use, then always buy from a reputable seller. [13] X Research source"
    },
    {
      "title": "What are the safest carts to vape?",
      "content": "What are the safest carts to vape? The safest carts are the ones that have been tested and are sold by a reputable dispensary. Because these vapes have to pass several safety standards before they’re sold, they’re not going to have the harmful contaminants that are in fake or black market vapes. [14] X Research source Keep in mind that even though vaping is safer than smoking, it’s still not completely safe. Vaping still exposes your lungs to chemicals that could lead to long-term lung and heart issues. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "What should you do if you get a fake vape?",
      "content": "What should you do if you get a fake vape? If you suspect that your vape is fake, don’t take a hit from it because it could contain harmful contaminants. If you think your vape is a counterfeit of a reputable brand, contact the manufacturer and let them know where you bought it and what codes were listed on the packaging. [16] X Research source Alternatively, contact your local law enforcement and let them know where you purchased the vape."
    }
  ]
}