{
  "url": "https://www.wikihow.com/Draw-a-Bunny",
  "title": "How to Draw a Bunny Step by Step: Easy and Realistic Methods",
  "steps": [
    {
      "title": "Draw two intersecting circles.",
      "content": "Draw two intersecting circles. Add a big oblong shape on one side."
    },
    {
      "title": "Draw a curved line on the side of the top circle to represent the bunny’s nose.",
      "content": "Draw a curved line on the side of the top circle to represent the bunny’s nose. Add curved lines on the bunny’s face to help you determine the position of the eyes, nose and mouth."
    },
    {
      "title": "Add almond shapes over the head for the ears.",
      "content": "Add almond shapes over the head for the ears. Draw the forelegs using vertical curves, the hind legs being thicker can be drawn using circles and oblongs as guide. Add a half circle on the rear for the bunny’s short tail."
    },
    {
      "title": "Add the eyes and whiskers.",
      "content": "Add the eyes and whiskers. The face and ears can be drawn to appear furry using very short slanted strokes."
    },
    {
      "title": "Do the same “furry” effect on the sketched outline of the bunny’s body.",
      "content": "Do the same “furry” effect on the sketched outline of the bunny’s body."
    },
    {
      "title": "Color the drawing.",
      "content": "Color the drawing. Or take a soft pencil and add shading. Another option is to use water-soluble pencils. Roughly shade over an area, and then go back over the pencil with a wet brush."
    },
    {
      "title": "Draw a small circle for the head.",
      "content": "Draw a small circle for the head. Add a bigger one for the body. Sketch a vertical line and a horizontal line crossing each other at the center of the circle to help you determine the position of the eyes, nose and mouth."
    },
    {
      "title": "Sketch two small oblongs on the lower half of the circle for the cheeks.",
      "content": "Sketch two small oblongs on the lower half of the circle for the cheeks. Add two protruding oblong shapes on each side of the head for the ears."
    },
    {
      "title": "Sketch a rough outline for the hands and feet.",
      "content": "Sketch a rough outline for the hands and feet."
    },
    {
      "title": "Draw the eyes using small circles, add the nose by sketching an inverted triangle, sketch the mouth and add the tooth.",
      "content": "Draw the eyes using small circles, add the nose by sketching an inverted triangle, sketch the mouth and add the tooth."
    },
    {
      "title": "Darken the outline of the bunny’s body.",
      "content": "Darken the outline of the bunny’s body."
    },
    {
      "title": "Add the bunny’s whiskers and two short lines on each of the bunny’s limbs.",
      "content": "Add the bunny’s whiskers and two short lines on each of the bunny’s limbs."
    },
    {
      "title": "Color the bunny.",
      "content": "Color the bunny."
    }
  ]
}