{
  "url": "https://www.wikihow.com/Dry-Out-a-Phone-Without-Rice",
  "title": "How to Dry Out a Phone Without Rice",
  "steps": [
    {
      "title": "Pull your phone out of the water immediately.",
      "content": "Pull your phone out of the water immediately. [1] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Whether you’ve dropped your phone in the toilet, bathtub, or a lake, the first step is to get it out of the water ASAP. The longer you leave your phone in the water, the more water it will absorb, and the more potential for damage. [2] X Research source If the phone was plugged in to a charger when it got wet, unplug the charger from both the phone and the wall. Be extremely careful not to get any water near the wall socket or any other electrical devices. Many modern smartphones, including all iPhones beginning with iPhone 7, are actually water-resistant. [3] X Research source However, some models can handle more water exposure than others. Even if your phone is water-resistant, you can still use these methods to dry your phone without harm. Each water-resistant phone has a special rating that describes how much water it can handle: Phones with the IP68 rating can be submerged more deeply for a longer time. [4] X Research source iPhone XS, XS Max, all iPhone 11 models, all iPhone 12 models, Samsung Galaxy S21 Ultra, and Samsung Galaxy S20 FE are rated IP68, and can be submerged for up to 30 minutes at various depths. iPhone XS/Max and iPhone 11 can be submerged in up to 2 meters of water. iPhone 11 Pro and Pro Max can handle being submerged in up to 4 meters of water. All iPhone 12 models can be submerged up to 6 meters. Samsung Galaxy S21 Ultra and Galaxy S20 FE can be submerged in up to 1.5 meters of water. [5] X Research source Phones rated IP67 (iPhone SE 2nd Generation, iPhone SE 3rd Generation, and all models of iPhone 7, 8, X, and XR) can be submerged in up to one meter of water."
    },
    {
      "title": "Power off the phone immediately.",
      "content": "Power off the phone immediately. [6] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Don't try to open apps to see if it's working—just turn it off as quickly as possible."
    },
    {
      "title": "Remove the case, battery, and other components.",
      "content": "Remove the case, battery, and other components. If there's a case on your phone, take it off right away. Then, if you have a removable battery (some phones still do), remove the battery cover and take the battery out. [7] X Expert Source James Bell Phone Repair Specialist Expert Interview. 25 May 2022. Remove your SIM card(s), as well as any SD cards. [8] X Research source Anything that remains connected to your phone can become damaged by water, as well as trap water inside. [9] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. The interior components are crucial to the phone’s functions. If they get saturated with water, the phone won’t work. [10] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022."
    },
    {
      "title": "Use a lint-free towel to dry off as much as you can.",
      "content": "Use a lint-free towel to dry off as much as you can. Wipe every part of the phone with a clean, dry, lint-free towel until you've removed all of the moisture that you can. If water is still dripping off, you could blow it away from the phone with your mouth or shake it back and forth. You should only rely on drying agents to remove residual moisture that’s worked its way into the components of your phone. Take your time—the more water you can remove with a cloth, the better off you'll be. If you don't have a lint-free towel (such as a microfiber rag or eyeglass cleaning cloth), you could use standard paper towels or washcloths. You could also shake the phone rapidly back and forth through the air."
    },
    {
      "title": "Suck additional water out with a vacuum.",
      "content": "Suck additional water out with a vacuum. If you have access to a wet/dry vacuum like a Shop Vac, you can use it to suck additional water out of the phone. Other vacuums may work—just makes sure the vacuum you use won't short out if it gets wet. An air compressor set to a low psi could also be helpful in the absence of a vacuum. [11] X Research source Just don't set the psi too high, as it could damage your phone. If you have a can of compressed air, you can use it to blow water out of cracks and seams in the phone's exterior. Do not use a blow dryer or place the phone in an oven. Excessive heat can damage your phone beyond repair."
    },
    {
      "title": "Crystal-based cat litter.",
      "content": "Crystal-based cat litter. Crystal cat litter is made of silica gel—the same stuff that comes in those packets labeled \"Do Not Eat\" (more on those soon). Silica gel is extremely absorptive and will do an excellent job of pulling residual moisture out of a water-damaged phone. [12] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. You can purchase crystal cat litter at nearly any grocery store or pet-supply shop. [13] X Research source Make sure to get a container that's at least 4 cups, or 1 to 2 quarts. Do not use any other type of cat litter. Clay-based or powdery litters will stick to your phone and turn it into a wet, clay-covered mess."
    },
    {
      "title": "Instant oatmeal.",
      "content": "Instant oatmeal. Instant oatmeal is more absorptive than regular rolled oats and more much absorptive than steel-cut oats. [14] X Research source If you already have instant oatmeal in your home cabinet, it may be the most effective substance you can use to dry your phone. Just be aware that if you use oatmeal to dry your phone components, you may end up with a phone covered in small, gooey bits of oatmeal dust. Purchase a container of unflavored instant oatmeal at your local grocery store. If you don't have instant oatmeal, regular rolled oats could be a decent (yet less effective) substitution. You may need to leave the phone in rolled oats for a day longer than instant oatmeal. Just don't try steel cut, as they take forever to absorb liquid."
    },
    {
      "title": "Synthetic desiccant packets.",
      "content": "Synthetic desiccant packets. Synthetic desiccant packets are those 3 ⁄ 4 in (1.9 cm) packets that come in various commercial items including shoe boxes, dried foods (like beef jerky or spices), pill bottles, and electronics. Yes, the ones that say \"Do not eat!\" The packets are filled with highly absorptive silica beads (just like crystal cat litter), which will pull moisture out of your phone. You do not need to tear open the packets. Simply pile them up on top of your phone and let them pull the moisture out. [15] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. This option will only work if you’ve been saving up silica gel packets in advance for several months, or have purchased bulk packets. One or two packets won't cut it—you'll need enough to cover your phone completely."
    },
    {
      "title": "Instant couscous pearls.",
      "content": "Instant couscous pearls. It's important that if you try using couscous, you're using the instant variety—instant couscous (like instant rice) is pre-steamed, which makes it more porous and able to absorb moisture. [16] X Research source The small, dry grains will work similarly to instant rice, silica beads, and instant oatmeal to pull residual moisture out of your phone. You can buy instant couscous at any grocery store or supermarket. The larger sized couscous pearls (often called \"Israeli couscous\") won't get dust on your phone's components, and are large enough to not get stuck in any ports or openings. If you use standard couscous (the extremely small grains), you risk getting couscous stuck inside of your phone. Be sure to purchase an unflavored and unseasoned variety of couscous."
    },
    {
      "title": "Place your phone and components in a 1–2 qt (0.95–1.89 L) sized container.",
      "content": "Place your phone and components in a 1–2 qt (0.95–1.89 L) sized container. If you’re going to cover your phone with a drying agent, you’ll need quite a bit of the substance you chose. So, look in your cabinets and pull out a large empty pitcher, a big mixing bowl, or a large saucepan. A clean, dry bucket will also work. Set all of the disassembled components of your phone into the bottom. You can leave out the phone's plastic back cover, as it will air dry easily."
    },
    {
      "title": "Pour at least 4 cups (340 grams) of drying agent over your phone.",
      "content": "Pour at least 4 cups (340 grams) of drying agent over your phone. Don’t be stingy with whatever drying agent you choose. You’ll need a substantial amount of it to pull the last remnants of water out of your phone’s electrical components. Put a lid over the container if you’re using an inedible drying agent like silica gel."
    },
    {
      "title": "Leave the phone in the container to dry for 2–3 days.",
      "content": "Leave the phone in the container to dry for 2–3 days. It takes time for your phone to dry out to the point that it’s usable again. Let it sit in the drying agent for at least 48 hours. If you pull the phone out prematurely, you’ll end up reassembling it with water still lodged inside. If you need to use your phone during this time, you could ask a friend if you can briefly borrow their phone—it's really important to wait this process out."
    },
    {
      "title": "Remove your phone from the drying agent after 48-72 hours.",
      "content": "Remove your phone from the drying agent after 48-72 hours. Depending on the drying agent you chose, your phone may be dusty or dirty now. Clean it off with a dry, lint-free cloth, and make sure there's no remaining moisture. If the phone is not dry, wait another 24 hours. Do not continue if the phone is still wet!"
    },
    {
      "title": "Reassemble your phone and try turning it on.",
      "content": "Reassemble your phone and try turning it on. Once the phone is dry, reconnect the battery (if removable), and turn your phone back on. Try it first without the SIM and/or SD cards inserted. If it starts up okay, you can reinsert the SIM and/or SD cards. If the phone won’t turn on after you’ve dried it—or if it turns on but barely works or the screen has been damaged—you’ll need to take it to a professional phone-repair company. [17] X Expert Source James Bell Phone Repair Specialist Expert Interview. 25 May 2022. [18] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022."
    }
  ]
}