{
  "url": "https://www.wikihow.com/Delete-History-on-Your-Computer",
  "title": "How to Delete History on Your Computer",
  "steps": [
    {
      "title": "Click Cortana's Search box.",
      "content": "Click Cortana's Search box. It's on the left side of the taskbar, just right of the Windows logo. Doing so prompts the Cortana window to open. If you don't have this option: right-click the taskbar, select Cortana , and click Show search box ."
    },
    {
      "title": "Click Settings .",
      "content": "Click Settings . It's on the left side of the Cortana window. This will open Cortana's settings in the window."
    },
    {
      "title": "Scroll down and click Clear my device history.",
      "content": "Scroll down and click Clear my device history . It's below the \"My device history\" heading. Doing so clears your on-device search history."
    },
    {
      "title": "Click Search history settings.",
      "content": "Click Search history settings . This link is below the \"My search history\" heading. Clicking this link opens a Bing page with all of your searches listed in chronological order. If you aren't connected to the Internet, you won't be able to access this page."
    },
    {
      "title": "Click CHANGE HISTORY SETTINGS.",
      "content": "Click CHANGE HISTORY SETTINGS . This heading is toward the top of the Bing page. A menu will appear beneath it."
    },
    {
      "title": "Click Clear all.",
      "content": "Click Clear all . It's in the \"Clear search history\" section of the menu."
    },
    {
      "title": "Click Yes when prompted.",
      "content": "Click Yes when prompted. Doing so will clear Cortana's search history entirely, both locally and online."
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen. You can also press the ⊞ Win key on your computer's keyboard."
    },
    {
      "title": "Open File Explorer .",
      "content": "Open File Explorer . Click the folder-shaped icon in the lower-left corner of the Start window."
    },
    {
      "title": "Click View.",
      "content": "Click View . It's a tab in the top-left side of the File Explorer window. A menu will appear below the View tab."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . It's a box-shaped icon on the far-right side of the View menu."
    },
    {
      "title": "Click the General tab.",
      "content": "Click the General tab. It's in the upper-left corner of the Folder Options window."
    },
    {
      "title": "Click Clear.",
      "content": "Click Clear . This option is in the \"Privacy\" section toward the bottom of the window. Doing so will remove your recent searches from the File Explorer. If you pinned any folders or files to the File Explorer, they won't be cleared."
    },
    {
      "title": "Hide your future search history.",
      "content": "Hide your future search history. Uncheck both the Show recently used files in Quick Access and Show recently used folders in Quick Access boxes in the \"Privacy\" section. While optional, doing this will prevent searched items from appearing in the File Explorer search bar."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the Folder Options window. Your File Explorer history should now be clear."
    },
    {
      "title": "Open the Apple Menu .",
      "content": "Open the Apple Menu . Click the Apple logo in the top-left corner of the screen."
    },
    {
      "title": "Select Recent Items.",
      "content": "Select Recent Items . It's near the top of the Apple drop-down menu. A pop-out menu with a list of your recently opened apps and files will appear."
    },
    {
      "title": "Click Clear Menu.",
      "content": "Click Clear Menu . This option is at the bottom of the pop-out list. Doing so will clear the pop-out menu's contents."
    },
    {
      "title": "Open Finder.",
      "content": "Open Finder. It's a blue, face-like app in your Mac's Dock. You can also just click your desktop."
    },
    {
      "title": "Click Go.",
      "content": "Click Go . This menu item is on the left half of your Mac's menu bar, which is at the top of the screen. Clicking Go prompts a drop-down menu."
    },
    {
      "title": "Select Recent Files.",
      "content": "Select Recent Files . It's at the bottom of the Go drop-down menu. A pop-out window will appear to the right of Recent Files with a list of your recently opened folders."
    },
    {
      "title": "Click Clear Menu.",
      "content": "Click Clear Menu . You'll see this button at the bottom of the pop-out menu. This will clear the list of recently visited folders."
    }
  ]
}