{
  "url": "https://www.wikihow.com/Decorate-Diyas-for-Competition",
  "title": "How to Decorate Diyas for Competition",
  "steps": [
    {
      "title": "Check out diya decoration ideas online.",
      "content": "Check out diya decoration ideas online. Run an image search to get your creative juices flowing. Look for homemade diyas with interesting patterns and vibrant color combinations. Additionally, read about the significance of diyas and the festival you're celebrating. For instance, diyas are a key part of Diwali, or the festival of lights. Diwali celebrates the triumph of good over evil, and the diya symbolizes wisdom. The oil inside the lamp represents ignorance, greed, and hatred, which burn away in the lit diya."
    },
    {
      "title": "Learn about the significance of symbols and patterns.",
      "content": "Learn about the significance of symbols and patterns. If your diya competition is related to an upcoming festival, look up related patterns and symbols. For example, it's customary to honor the deity Lakshmi on Diwali. The 8-pointed star, the lotus flower, elephants, and leaves are key symbols associated with Lakshmi. To honor Lakshmi, you could paint a border of 8-pointed stars around the outside of your diya, a pattern of lines and dots around the rim, and a lotus flower inside the bowl. The 8-pointed star represents prosperity, the lotus symbolizes purity, and elephants represent strength and wisdom."
    },
    {
      "title": "Sketch out your design.",
      "content": "Sketch out your design. Taking the time to plan your design can help increase your chances of winning the competition. Grab a pencil and paper, and play with different shapes for your diya. Practice drawing patterns and symbols, and decide which designs you find most appealing. [1] X Research source It's also wise to practice painting your patterns on paper before you actually decorate your diya. Getting a feel for the brush and the paint's consistency can help you avoid making mistakes on the final project. The traditional shape for a diya is a bowl with a point at one end, but you can get creative. Using a stencil and utility knife, you could create a leaf-shaped diya or make one with intricate details around the rim."
    },
    {
      "title": "Come up with meaningful and attractive color combinations.",
      "content": "Come up with meaningful and attractive color combinations. Go for vibrant colors that pop and contrast with each other, like yellow and green. On a sheet of scratch paper, draw or paint various colors next to each other. Choose color combinations that you find beautiful and interesting. Additionally, consider each color's symbolic meaning. Vermilion, which is a deep red hue, is a sacred color in Hinduism, and is associated with Diwali and other festivals. Green, which symbolizes life, is also an important color for festivals. Yellow represents knowledge, and is a great choice for detailed patterns and embellishments. For an eye-catching contrast, you could use vermilion for the base coat, embellish the rim with yellow patterns, and paint green and yellow 8-pointed stars around the outside of the diya. Glitter or metallic paint could also add a lovely sparkle to your diya."
    },
    {
      "title": "Use store-bought air or oven-bake clay, or make your own clay.",
      "content": "Use store-bought air or oven-bake clay, or make your own clay. Find both oven-bake and air clay at the craft store. Oven-bake clay will only take 30 minutes to set, but it's more expensive. Air clay needs 24 hours to dry but, since it doesn't require an oven, it's a good choice for small children. It also tends to shrink slightly, so there's a greater chance that your diya shape will warp. Alternatively, you could make your own traditional diya clay using wheat flour . Add water about a tablespoon at a time to a small bowl of flour, and knead it until you've reached a soft, doughy consistency. [2] X Research source For softer wheat flour clay, add 1 to 2 tablespoons of canola or vegetable oil. [3] X Research source"
    },
    {
      "title": "Mold the clay into a bowl shape with a point at 1 end.",
      "content": "Mold the clay into a bowl shape with a point at 1 end. Make a ball of clay about the size of your fist. Press it into your palm until it's thin and flat, then cup your palm into a bowl shape. Use your fingertips to mold the clay into a teardrop-shaped bowl, then pinch the narrow end into a point. [4] X Research source You can make your diya as large as you want but, measuring from the point to the opposite end, they're usually around 4 to 5 in (10 to 13 cm) in length. If you have trouble shaping the clay with your palm, use a small bowl as a mold. [5] X Research source"
    },
    {
      "title": "Use a stencil for a more elaborate design.",
      "content": "Use a stencil for a more elaborate design. If you want to try a form other than the traditional diya shape, use a cookie cutter or make a stencil out of card stock. To make your own stencil, draw a pattern on the card stock, such as a pointed leaf shape, about 1 ½ times wider than you want your finished diya to be. Cut the stencil out with scissors, place it over a flattened sheet of clay, then cut out the shape using a utility knife. [6] X Research source After cutting out the shape, remove and set aside the excess clay around the edges. Carefully lift the shaped clay and peel off the stencil. Make a cup with your palm, and gently form the clay into a shallow bowl shape. Do your best to keep the clay's stenciled shape as you form it into a shallow bowl. For best results, try not to make the stencil too complicated. For instance, the small points of a leaf would hold their shape, but complex, intricate designs could fall apart when you shape the clay into a shallow bowl."
    },
    {
      "title": "Try carving designs into the soft clay.",
      "content": "Try carving designs into the soft clay. If you'd like, create lines and dots around the diya using a utility knife and toothpick. You could also gently press a stamp, fork, spoon, or similar object around the diya to create an impressed pattern. [7] X Research source The impressed designs will give your diya an additional level of detail. If you're using air clay, make the designs a little deeper and wider, as the clay will shrink a bit as it sets. If you're using air clay, you could also embed beads or craft gems into the soft clay. For instance, try placing embellishments around the diya's rim. Avoid embedding beads or jewels into oven-bake clay, as they'll melt."
    },
    {
      "title": "Allow no-bake air clay to set for 24 hours.",
      "content": "Allow no-bake air clay to set for 24 hours. Leave your diya uncovered at room temperature, and do your best to keep it away from moisture. The clay should set after 24 hours. [8] X Research source If you put your diya on a plate or mat and notice it starts drooping, lightly grease a sheet of aluminum foil with vegetable oil, and mold it into diya-shaped form to support the clay. You could also use a sheet of non-stick foil. Allow the clay to set in the bowl or foil for a couple of hours, then remove it to finish drying on its own. [9] X Research source"
    },
    {
      "title": "Set oven-bake clay in a 300 °F (149 °C) for about 30 minutes.",
      "content": "Set oven-bake clay in a 300 °F (149 °C) for about 30 minutes. Lightly grease a baking sheet with about a teaspoon of oil. Set the diya on the sheet, and place it in a preheated oven. Check it after 10 to 15 minutes to make sure it's holding its shape. If necessary, carefully make corrections with a spoon, but avoid touching the hot clay with your hands. [10] X Research source Non-stick foil or aluminum foil lightly greased with vegetable oil could also help keep the diya's shape if it droops when you place it on the baking sheet. Specific baking directions vary by brand. Read your clay's instructions, and bake it as directed. Once it's set, allow your diya to cool to room temperature before painting it."
    },
    {
      "title": "Prime the diya with a coat of white acrylic paint.",
      "content": "Prime the diya with a coat of white acrylic paint. Start by priming your diya so that your later coats will be brighter. Use acrylic paint and a wide, flat-tipped acrylic paintbrush. Be sure to let each coat dry before adding more paint. [11] X Research source Acrylic paint is compatible with clay and easy to use, so it's the best choice. It also dries quickly, and you should only have to wait 30 to 60 minutes between coats. Clean your brushes promptly after each coat. Since it dries so quickly, acrylic paint can easily ruin brushes. Additionally, use acrylic paint, which is water-based, instead of oil-based paints, which are combustible and pose a fire hazard. Dried acrylic paint is still flammable, but it can safely hold a tea light candle for a short period of time."
    },
    {
      "title": "Add 1 to 2 coats of your base colors.",
      "content": "Add 1 to 2 coats of your base colors. Once the first coat has dried, paint your background colors. For instance, the inside of the diya might be yellow, and the exterior vermilion. Alternatively, you might paint the entire diya 1 solid color, then cover the exterior with elaborate designs in a variety of colors. Use a flat-tipped brush to paint larger areas. You can also try blending colors with a fan brush. Remember to clean your brushes promptly after finishing a coat."
    },
    {
      "title": "Paint intricate patterns on the sides with a fine brush.",
      "content": "Paint intricate patterns on the sides with a fine brush. Switch to thin, pointed brushes to paint designs precisely. If you don't have much experience painting fine details, practice creating designs on scratch paper. [12] X Research source Use a pointed round brush for thin lines and dots, and a detail round brush for your tiniest marks. Have patience! Go slowly to avoid making mistakes, and brace your elbow to help keep your hand steady. If you do slip up, do your best to correct it, but try not to get upset. You can always improvise and turn a mistake into an improvised symbol or pattern. Allow the paint to dry before you switch colors to avoid muddying your designs."
    },
    {
      "title": "Embellish your diya with beads and craft jewels, if desired.",
      "content": "Embellish your diya with beads and craft jewels, if desired. If you used air clay, you might have embedded beads and jewels into the soft clay before it set. If you made your diya with oven-bake clay, use a hot glue gun to attach embellishments after you've baked the clay. Give the paint at least 1 to 2 hours to dry before gluing on the embellishments. [13] X Research source If you add the beads and craft jewels after you've painted the diya, you won't have to worry about accidentally covering them with paint."
    },
    {
      "title": "Place a tea light inside the finished diya.",
      "content": "Place a tea light inside the finished diya. After your diya is dry, light a small votive candle and marvel at your creation's beauty. Traditionally, oil is poured into a diya, and a cotton wick is inserted at the pointed end and lit. While some people use acrylic-painted diyas as oil lamps, this could pose a fire hazard. [14] X Research source Acrylic isn't combustible, so it's safer than oil-based paints. However, it can still ignite if it gets hot enough, and the wick could allow the flame to make contact with the painted surface. A tea light is safer than using a wick, but you shouldn't keep it lit for long periods of time or leave it unattended. Clay doesn't conduct heat very well, but you still don't want to risk letting the painted diya get too hot. For the safest option, place a battery-operated LED flameless tea light inside the diya."
    }
  ]
}