{
  "url": "https://www.wikihow.com/Deal-With-a-Needle-Stick-Injury-at-Work",
  "title": "How to Deal With a Needle Stick Injury at Work",
  "steps": [
    {
      "title": "Encourage bleeding at the site of puncture.",
      "content": "Encourage bleeding at the site of puncture. Do this by running cool water over the bleeding area for several minutes. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source In this way potential infectants are expelled from the wound and washed away, minimizing entry into the bloodstream. Once the virus enters your bloodstream, it may start to multiply, so it is best to keep the virus cells from entering the bloodstream in the first place. Don't squeeze the wound."
    },
    {
      "title": "Wash the wound.",
      "content": "Wash the wound. Gently cleanse the site of the needle stick or sharps entry with plenty of soap after you have bled the wound and flooded the site. This will help to kill viruses and bacteria, removing sources of infection and reducing the chance of infection. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Do not scrub the wound while you're washing it. This can make the injury worse. Never try to suck the wound."
    },
    {
      "title": "Dry and cover the wound.",
      "content": "Dry and cover the wound. Use a sterile material to dry the wound and immediately cover the wound with a waterproof plaster or dressing. [4] X Research source"
    },
    {
      "title": "Flush splashes of blood and needle contents on other parts of your body with water.",
      "content": "Flush splashes of blood and needle contents on other parts of your body with water. If the contents of the needle splashed to nose, mouth, face or other skin areas, wash them well with soap."
    },
    {
      "title": "Irrigate eyes with saline, clean water or sterile irrigants.",
      "content": "Irrigate eyes with saline, clean water or sterile irrigants. Gently flush the eyes if any splashing occurred there."
    },
    {
      "title": "Remove and change potentially contaminated clothing.",
      "content": "Remove and change potentially contaminated clothing. Place clothing in a sealed bag awaiting washing and sterilization. After undressing, wash your hands and parts of the body that were in contact with the potentially infectious clothing, then don fresh clothing. [5] X Research source"
    },
    {
      "title": "Seek medical attention immediately.",
      "content": "Seek medical attention immediately. You will need to explain the circumstances of the injury and discuss possible disease exposures. Your blood may be tested to determine whether further treatment is needed. [6] X Research source In the case of known exposure to other pathogens, immediate treatment will be administered. This could involve antibiotics or a vaccination. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You might need a tetanus shot, depending on your prior history."
    },
    {
      "title": "Determine whether HIV exposure is possible.",
      "content": "Determine whether HIV exposure is possible. Measures should be immediately taken to prevent sero-conversion from occurring. Scientists have proven that sero-conversion due to needle stick injuries for HIV is about 0.03 percent. [8] X Research source This percentage is extremely low, so there is no need to panic. The HIV status of the worker affected and the person whose blood was transferred will be checked. Hospitals and other medical facilities have rapid tests available to give a confirmed HIV status. If exposure is likely, prophylactic medication (known as post exposure prophylaxis, or PEP) should be administered, preferably within an hour. Anti-retroviral drugs can reduce the rate of transmission if given soon after possible infection. [9] X Research source All clinics and hospitals have a protocol in place for prompt action when responding to needle stick injuries."
    },
    {
      "title": "Determine whether other exposures are possible.",
      "content": "Determine whether other exposures are possible. The risk for hepatitis transference is much higher that that for HIV (about 30% for Hepatitis B and about 10% for Hepatitis C), so swift action is essential, as well as preventative measures (i.e., being vaccinated against Hepatitis). [10] X Research source"
    },
    {
      "title": "Report the incident.",
      "content": "Report the incident. Check the reporting procedures of your workplace. It is important to let your workplace know what has happened, and the statistics so gathered can help to improve workplace practices for everyone's future safety. This includes injuries with sterile, \"clean\" sticks."
    },
    {
      "title": "Have follow up testing and medical supervision of your recovery.",
      "content": "Have follow up testing and medical supervision of your recovery. This should be done at required intervals through the window period, the time during which a person exposed to a virus still tests negative, even though the virus is multiplying. Retesting for HIV exposure usually occurs at six weeks, three, six, and 12 months to look for HIV antibodies. Retesting for HCV antibodies usually occurs six weeks after the incident, and again at four to six months."
    },
    {
      "title": "Have a plan of action for next time.",
      "content": "Have a plan of action for next time. If your workplace doesn't already have a protocol in place for dealing with needlestick injuries, create one. This information is freely available on any telephonic helpline or is physically available at pharmacies, hospitals, clinics, and other medical care centers. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Ensure safe working practices in a health care environment at all times.",
      "content": "Ensure safe working practices in a health care environment at all times. The World Health Organization recommends the following for workplaces dealing with needle sharps: [12] X Research source Hand wash after direct contact with patients. Use protective barriers such as gloves, gowns, aprons, masks, and goggles when in direct contact with blood and other body fluids. Collect and dispose of needles and sharps safely. Use puncture- and liquid- proof boxes in each patient care area. Prevent two-handed recapping of needles. Use the one handed needle capping technique. Cover all cuts and abrasions with a waterproof dressing. Promptly and carefully clean up spills of blood and other body fluids with gloves on. Use a safe system for health care waste management and disposal."
    },
    {
      "title": "Ensure safe working practices in other workplace environments.",
      "content": "Ensure safe working practices in other workplace environments. Tattoo parlors, piercing shops, and many other types of workplaces also put workers at risk for needlestick injuries. Take the following precautions: Wear appropriate clothing and protective gear when handling potentially dangerous items such as garbage bags or picking up piles of garbage. Take care when sticking your hands into places you cannot see, such as sinks of water, holes, the backs of beds and sofas, etc. Wear solid footwear when walking through or working in areas known for drug-use, such as parks, beaches, public transportation hubs, etc."
    },
    {
      "title": "Avoid unnecessary distractions when working with needles and syringes.",
      "content": "Avoid unnecessary distractions when working with needles and syringes. Concentrate on your work and on what you are currently doing at all times. [13] X Research source Avoid looking away or working in bad light while dealing with the needle stick. Be careful with restless or panicking patients who can easily move as you insert or withdraw the needle. Reassure them and only insert the needle when you're sure it is safe to do so."
    }
  ]
}