{
  "url": "https://www.wikihow.com/Cope-when-You-Hate-Your-Hair",
  "title": "How to Cope when You Hate Your Hair",
  "steps": [
    {
      "title": "Determine your facial shape.",
      "content": "Determine your facial shape. Different types of hairstyles suit different types of people depending on their facial shape. To find your facial shape, choose the following option that applies most closely to you: Square/Round/Oval Shaped Face – The width of your forehead, cheekbones and jaw are the same. Diamond Shaped Face – Your cheekbones are the widest part of your facial shape. Pear Shaped Face – Your jaw is the widest part of your face. Heart Shaped Face – Your forehead is the widest portion of your face and inverts inwards towards your chin."
    },
    {
      "title": "Identify a style that suits you.",
      "content": "Identify a style that suits you. Once you know your facial shape, try looking through magazines to find hairstyles that flatter that shape. There are also many sites online that allow you to test out hairstyles using current pictures of your face, so you can preview how the cut or color will look in real life. Finally, you can try identifying a celebrity who has a similar facial shape to you and checking out haircuts that have looked good on them."
    },
    {
      "title": "Pick a style that works with your hair's texture.",
      "content": "Pick a style that works with your hair's texture. Hair comes in many different textures: fine, medium, and coarse. It also comes in many different densities: sparse, medium and high. Your hair's texture and density will determine how the haircut falls on you, so make sure you consult with your stylist before committing to a cut. [1] X Research source"
    },
    {
      "title": "Hire a stylist you can trust.",
      "content": "Hire a stylist you can trust. Having a good stylist is the most important variable in securing a good hairstyle. If your stylist is inexperienced or unwilling to execute on your vision, you will likely leave the salon disappointed. In order to find a quality stylist, seek out referrals from friends or look online at Yelp reviews."
    },
    {
      "title": "Communicate your vision.",
      "content": "Communicate your vision. Once you've determined the kind of cut or color you want, it's important that you convey that information to your stylist so they can execute on your vision. Be clear with your stylist regarding the style you want, how much hair you're comfortable losing and what shade you're looking to achieve if you're coloring your hair. If possible, make a Pinterest board or have a picture on hand to better demonstrate the look you're going for."
    },
    {
      "title": "Develop a rapport with your stylist.",
      "content": "Develop a rapport with your stylist. If you find a stylist who works well with your hair, use them as frequently as possible. The more they work with your hair, the better they will understand it and the more they will be able to give you haircuts that will keep you coming back for more."
    },
    {
      "title": "Invest in quality products.",
      "content": "Invest in quality products. Oftentimes, bad hair can be solved using good products. Slight damage can be cured using hair quality hair serums and products, found either in drug stores, online or through the salon of your choice. When investing in quality hair products, it's important to use products designed to fix the problems you're actually having. Using a shampoo that guarantees more volume does nothing if the problem you're suffering from is dry or damaged hair. [2] X Research source"
    },
    {
      "title": "Style your own hair.",
      "content": "Style your own hair. Nobody ever need know that you're having a bad hair day if you learn how to fix your own hair. There are endless possibilities for potential hairstyles, and you can learn most of them simply by watching an online tutorial. Some popular styles you can try include: Braids. Buns or topknots. Experimenting with moving your hair part. Straightening or curling your hair."
    },
    {
      "title": "Distract with hair accessories.",
      "content": "Distract with hair accessories. There are numerous accessories on the market, designed to hide a bad hair day. From clip-ins and extensions to headbands and headscarves, if you need to disguise your hair, there's a way for you to do that."
    },
    {
      "title": "Cover up with a hat.",
      "content": "Cover up with a hat. Hats are the easiest way to hide your bad hairdo. Hats come in a variety of seasonal styles and are a very inexpensive solution. If you don't have the time or energy to actually fix your bed-head, a hat is the simplest way to go. Some schools and places of work do not allow hats to be worn indoors. Make sure you know what the protocol for wearing a hat indoors is before planning to wear one for the day."
    },
    {
      "title": "Speak up.",
      "content": "Speak up. If you recently got a bad haircut or color and you're still at the salon, communicate the issue. Chances are, they can fix it on the spot, and if not, they can schedule a time to have you come back. If it's a color problem, most salons will allow you a week to come back and correct the issue, free of charge. Hairstylists want you to leave their salon happy; it increases the chances that you'll become a permanent client for them. [3] X Research source"
    },
    {
      "title": "Determine whether or not your hair is healthy.",
      "content": "Determine whether or not your hair is healthy. If you go too long between haircuts, hair becomes unmanageable and damaged and it may be time for a change. [4] X Research source Some common signs of unhealthy hair are: Dry frizz Limp/dull hair that always looks flat Greasy hair Hair that feels too thick or too thin Split ends Extreme breakage or shedding"
    },
    {
      "title": "Check to see if you're bored.",
      "content": "Check to see if you're bored. Sometimes, dissatisfaction with personal appearance stems from boredom in other areas of a person's life. If you are frustrated with your hair, check in with yourself to make sure you're actually unhappy with your hair and not something more insidious."
    },
    {
      "title": "Love yourself.",
      "content": "Love yourself. Be aware that your hair only makes up one small fraction of who you are as a person. There will always be something about your hair that you may not love, but as long as you love and value yourself, it doesn't matter."
    }
  ]
}