{
  "url": "https://www.wikihow.com/Draw-on-Pictures-on-Android",
  "title": "2 Easy Ways to Draw on Pictures on Android",
  "steps": [
    {
      "title": "Open Google Photos.",
      "content": "Open Google Photos. This app looks like a multicolored pinwheel. Tap the icon to open the app."
    },
    {
      "title": "Tap the photo you want to edit.",
      "content": "Tap the photo you want to edit. You can browse through your gallery or tap the categories at the bottom of your screen to access your library or search for a specific photo."
    },
    {
      "title": "Tap .",
      "content": "Tap . The Edit button looks like three sliders in the row of icons at the bottom of your screen. [1] X Research source"
    },
    {
      "title": "Select Markup.",
      "content": "Select Markup . Drag the menu below the picture (it starts with Suggestions and Crop ) until you have Markup selected. [2] X Research source If you rather edit the photo instead, you can use something like Suggestions to make the best edits possible for that photo's composition and lighting."
    },
    {
      "title": "Select a tool.",
      "content": "Select a tool. Tap the pen to use the pen, the highlighter, or the text tool, to activate the appropriate tool."
    },
    {
      "title": "Draw on the picture.",
      "content": "Draw on the picture. You can change the color of the pen or highlighter by tapping a colored circle under the picture preview."
    },
    {
      "title": "Tap Done when you're finished.",
      "content": "Tap Done when you're finished. It's at the bottom of your screen, on the right side. [3] X Research source If you're a Google One member, more options will unlock for you. Other than markup, there are lots of other editing tools available to you. For example, you can add filters, crop, or adjust photos."
    },
    {
      "title": "Tap Save as Copy when you're done making edits.",
      "content": "Tap Save as Copy when you're done making edits. Save as Copy replaces Done in the lower right corner of your screen and will save the marked-up image as a new one instead of replacing the photo that you drew on. This way, you can access the original image as well as the one you drew on. [4] X Research source"
    },
    {
      "title": "Open Gallery on your Samsung.",
      "content": "Open Gallery on your Samsung. Tap the icon that looks like a white flower on a burgundy background. If you don't have a Samsung, you will want to use the Google Photos method instead."
    },
    {
      "title": "Tap a photo you want to draw on.",
      "content": "Tap a photo you want to draw on. Scroll through your gallery and tap the one you want to draw on so you can edit it."
    },
    {
      "title": "Tap .",
      "content": "Tap . This icon looks like a pencil and is located in the bottom left corner of your screen. [5] X Research source"
    },
    {
      "title": "Tap the smiley face and select a drawing tool.",
      "content": "Tap the smiley face and select a drawing tool. Tap the pen to use the pen, the highlighter, or the text tool, to activate the appropriate tool."
    },
    {
      "title": "Draw on the picture.",
      "content": "Draw on the picture. You can change the color of the pen or highlighter by tapping the tool again and tapping the color from the pop-up. [6] X Research source"
    },
    {
      "title": "Tap Save when you're finished.",
      "content": "Tap Save when you're finished. It's in the top right corner of your screen. [7] X Research source"
    }
  ]
}