{
  "url": "https://www.wikihow.com/Draw-Cool-Things",
  "title": "How to Draw Cool Things",
  "steps": [
    {
      "title": "Cool buildings.",
      "content": "Cool buildings. Most buildings are shaped like cubes or boxes, so they’re amongst the easiest cool drawings to start off with. Draw a cube or box in the center of your paper. Start adding windows, doors, a roof, and decoration around the outside of your building. When you feel comfortable drawing a building, add more in front of and behind it to make an entire cityscape. [1] X Research source Look pictures up online of famous buildings and try to replicate them in your cool drawing. Use your home as a real-life reference to practice drawing. Try to replicate the shape of the outside of your home in your drawing. Try drawing a street filled with buildings of different sizes to practice your perspective drawing."
    },
    {
      "title": "Famous landmarks.",
      "content": "Famous landmarks. Monuments like the Eiffel Tower and the Pyramids of Giza have notable appearances, so try capturing how they look on paper. Look up pictures of the landmark you’re choosing as references and sketch your drawing lightly with a pencil. [2] X Research source Look for a landmark near where you live and practice drawing it. If you can visit the location in person, try drawing it while you’re there."
    },
    {
      "title": "Airplane",
      "content": "Airplane or space shuttle. Look up pictures of airplanes or jets that pique your interest. Start by drawing a long cylinder for the main body of your plane. Make a cone at one end of the cylinder to make the front of the plane. Draw triangles or long trapezoids on the side and back to create wings and tailfins. [3] X Research source Shade your drawing based on where you want to put the light source to make your plane look more 3D. Add clouds in the background to make it look like your plane is flying through the sky. For more of a challenge, look for different planes, such as fighter jets or biplanes."
    },
    {
      "title": "Tank.",
      "content": "Tank. Tanks are big vehicles that look complex, but they’re mostly made from boxy shapes and cylinders. Draw a long rectangular box for the base and split it into thirds. Stack a slightly smaller box on top for the main body, and another even smaller box on that to make the turret. Draw a long cylinder extending out of the top box to make the gun. Sketch parallel horizontal lines on the first and third sections of the bottom box to make the treads. [4] X Research source You can make your tank as simple or as detailed as you want as long as it is unmistakably cool! If you want to add color, try creating a camouflage pattern with colored pencils."
    },
    {
      "title": "Sports car",
      "content": "Sports car . Look sports cars up online and choose one that you want to try drawing. Start by lightly sketching in the main shape of the body and tires. Once you’re happy with the shape, darken the lines you’ve drawn already and start adding details, like headlights, door handles, rims, and mirrors. Add shading to make your sports car look 3D once it’s finished. [5] X Research source To make drawing cars easier, draw them from the side so you don’t have to worry about adding perspective. Make the windows a dark shade of black so you don’t have to draw the interior."
    },
    {
      "title": "Forest or mountain landscape.",
      "content": "Forest or mountain landscape. Look for examples of landscapes online and choose one you like. Start by drawing the objects that are the furthest away on the skyline. Keep working from the things that are the furthest away to the closer objects at the front of your drawing. [6] X Research source Use more detail in your drawing for things that are closer to you. For example, it’s okay to leave detail out of a faraway mountain, but a tree closer to the front should have visible leaves and bark if your wearing his to be truly cool. Try drawing landscapes during different seasons to see how they change over time. Go to a location and take your own picture if you live somewhere with a view."
    },
    {
      "title": "Roses",
      "content": "Roses . Rose petals have a unique shape that is relatively simple to draw, and cool. Start by drawing an egg shape for the rose bud. Draw a line with small waves and creases on top of the rose bud to make the first petal. Make another larger petal on top that creases in a different spot to make your rose look more realistic. Layer another two or three petals around the rose bud to give your rose some shape. Leave your rose as a line drawing or color it in if you want. If you want, add a stem with thorns at the base of your rose to make it look like it was freshly picked. Practice drawing different types of cool flowers to practice different shapes. When coloring, try experimenting with different pencils and techniques so you get a feel of how they work. Varying the pressure of the pencil can give you different and cool colors to make your drawing really pop."
    },
    {
      "title": "Elephant.",
      "content": "Elephant. Elephants have a lot of detail in their skin, so it makes them a challenge to draw. Look up reference photos online for the elephant you want to draw. Block out the shape of the head with light pencil lines to get an idea of the anatomy. Use an eraser to make any changes as you need to. Start drawing in wrinkles and details into the elephant’s skin with a darker pencil across its face and trunk. [7] X Research source If you want to draw a full elephant body, don’t use dark lines on the wrinkles in the skin since it will make your drawing look unclear. Put the elephant in a tall grass environment to look like it’s in the wild."
    },
    {
      "title": "Insects.",
      "content": "Insects. Look up a variety of different insects to draw. Start by drawing the main shapes of the insect’s body and head. Add details like legs, antennae, and pincers. Shade or color your drawings to make them look realistic, or, be cool and creative and design your own insect. Fill a drawing page with different insects to make it seem like they could crawl right off the page. [8] X Research source Look at scientific illustrations of insects online for detailed drawings of insects that you can try drawing on your own. Remember to layer your colors to make new hues, allowing yourself to go crazy with your insect creation. If you want to make it realistic, know that it is all about shadow and contrast."
    },
    {
      "title": "Character from a book.",
      "content": "Character from a book. List down the traits and details that make up the character so you don’t forget them. Start by drawing a basic human (or other humanoid) form in a natural looking pose. Once you’re happy with the figure, start adding clothing and props to flesh out the character more. [9] X Research source For example, if you wanted to draw Harry Potter make sure to include a wand, his glasses, and including lightning bolt scar. You might also include props like a flying broomstick or his pet owl. Your character doesn’t need to look realistic. If you want to make a cool cartoon version of them, go ahead! Try posing a drawing mannequin if you have one to get a reference on how their body would look. Take a photo of yourself as a reference to what the character’s body might be shaped like."
    },
    {
      "title": "Scary monster.",
      "content": "Scary monster. Monsters are a thing of imagination, so you can design them however you want. Think about what you’re scared of the most and try to make it into a terrifying, cool creature. Make them have unnatural body shapes, long limbs, and sharp teeth and claws. If you want to shade or color your monster, use dark tones to keep it mysterious. [10] X Research source Use movie monsters as a reference if you want inspiration on how to draw your creatures. Your monster doesn’t need to be scary. Make a friendly monster instead by making it smile or giving it colorful fur."
    },
    {
      "title": "Dragon",
      "content": "Dragon . Dragons come in all shapes and sizes depending on where in the world the stories originated from. Start by drawing a sideways egg shape to make their body. Draw two lines coming out from the wider end of the egg to make a neck for your dragon. Use a rectangle or a circle to draw your dragon’s head. Give your dragon legs, wings, and a tail, and add details, such as scales, horns, or flames. [11] X Research source Have your dragon guard something, like gold or an egg, to give it more story. Think about where the dragon is located when choosing a color or design. For example, a water dragon may be blue and have fins while a fire dragon might have horns and be red."
    },
    {
      "title": "Superhero",
      "content": "Superhero . Think of a superpower you would want and design a hero that would use that power. Start by drawing a figure in a heroic pose, such as them flying or standing with their hands on their hips. Give your hero a costume and a logo to make them look like a true hero. [14] X Research source For example, if your superhero has ice breath, draw him freezing bad guys or turning water into ice. Every hero needs a supervillain. Come up with an evil character and draw your hero fighting them."
    }
  ]
}