{
  "url": "https://www.wikihow.com/Download-Subtitles-from-Subscene",
  "title": "Need Subtitles? A Guide to Subscene and VLC Player",
  "steps": [
    {
      "title": "Type in the movie or show you’d like to watch on Subscene’s site.",
      "content": "Type in the movie or show you’d like to watch on Subscene’s site. Click Subtitle Search to bring up a list of matching (or similar) titles. [1] X Research source If you’re looking to sub a popular film or show, you might be able to find what you’re looking for on Subscene’s home page."
    },
    {
      "title": "Click on the category that best matches your search.",
      "content": "Click on the category that best matches your search. Scroll through the list of results and see if any of them match your video. All Subscene listings have the year of release in parentheses, which should help narrow things down. Subscene divides their results into 3 categories: Exact , Close , and Popular . The title (or titles) in Exact are an exact match to your query, the titles in Close are a close match to what you search, while Popular includes popular listings that are similar (but not an exact match) to what you searched."
    },
    {
      "title": "Click on a subtitle file in your preferred language.",
      "content": "Click on a subtitle file in your preferred language. Check the far-left column as you scroll through the subtitle listings—they’re organized in alphabetical order by language. Click on a listing in your desired language to pull up the file and its description. [2] X Research source See how people reviewed the subtitles in the file description before you download them."
    },
    {
      "title": "Download the subtitle file (where it downloads as a ZIP file).",
      "content": "Download the subtitle file (where it downloads as a ZIP file). Click the green “Download Subtitle” button on the middle of the page—a ZIP file will automatically download to your computer with the subtitles inside. Keep in mind that the actual subtitle file has an SRT extension, not a ZIP one. [3] X Research source ZIP files are just compressed versions of larger files. They’re easier for your computer to download, though the files need to be “unzipped” before they can be used. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Extract the SRT file",
      "content": "Extract the SRT file from the ZIP file into a separate folder. Right-click on the zipped subtitle folder and click on the “Extract All” option. Then, follow the guidelines on your screen to finish unzipping and extracting the SRT file to a new location. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source On Mac, simply double click the zipped folder to extract the SRT file. [6] X Research source On iOS, open up the Files app and tap on the zipped folder that contains your subtitles—this unzips the folder and extracts the file into a new folder. [7] X Research source On Android, open up the Files by Google app and tap on the ZIP file with your subtitles. On the next menu that pops up, hit the “Extract” option to extract the SRT file and store it in the same folder. [8] X Research source"
    },
    {
      "title": "Download the video or TV show episode",
      "content": "Download the video or TV show episode of your choice. Search online for downloads of your desired movies and/or TV shows. Just make sure to double-check any downloads for viruses before you actually load them onto your device. Once your file is downloaded, move it into the same folder as your subtitles/SRT file. Try to keep track of where your file downloads to on your computer. You need to have the video file on hand—unfortunately, you can’t add SRT files to streaming services (though most services do have a built-in closed-captioning option)."
    },
    {
      "title": "Download VLC video player and open up your downloaded video using VLC.",
      "content": "Download VLC video player and open up your downloaded video using VLC. If you’re on PC, right-click the video to pull up an extra menu; from there, select “VLC” from the “Open with” category. [9] X Research source If you’re on Mac, move the video download to the Dock or Finder. Then, click on the video, hit “Open with” in the File menu, and select the “VLC” option. [10] X Research source VLC is also available for mobile devices in the App Store and Google Play store ."
    },
    {
      "title": "Select “Add Subtitle File” from the Subtitle menu",
      "content": "Select “Add Subtitle File” from the Subtitle menu to upload your SRT file. Now that your video is pulled up, click the Subtitles menu in the VLC player application, followed by the “Add Subtitle File” option. Then, click on the downloaded SRT file in the next pop-up to add subtitles to your video. [11] X Research source You’re now ready to enjoy your film or TV show with subs! On VLC mobile: Hit the square subtitle icon in the bottom-left corner of the screen while the video is playing in VLC. Hit the downward-pointing arrow next to “Subtitles” to pull up another menu. From these options, select the “Select subtitle file” option. Using your phone’s file system, select the SRT file you downloaded to import it into your video. [12] X Research source"
    }
  ]
}