{
  "url": "https://www.wikihow.com/Diagnose-a-Loss-of-Spark-in-Your-Car-Engine",
  "title": "How to Diagnose a Loss of Spark in Your Car Engine",
  "steps": [
    {
      "title": "Check to make sure you have fuel.",
      "content": "Check to make sure you have fuel. Your car needs to have enough gasoline to fill the cylinders in order to start. If your fuel gauge is broken you should put fuel in your car and try to start it before proceeding."
    },
    {
      "title": "Check your battery.",
      "content": "Check your battery. Try turning on your headlights, if your headlights are burning normally then your battery should be sufficiently charged. If the headlights are dim or do not turn on at all you may need to jumpstart your car. If the battery isn't working, your best option is to look for an auto parts shop for a professional diagnostic, as a home diagnosis isn't always accurate. [1] X Expert Source Jason Shackelford Auto Technician Expert Interview. 11 June 2019."
    },
    {
      "title": "Scan your fuse box.",
      "content": "Scan your fuse box. To rule out a blown fuse you should take a quick look in your fuse box. Blown fuses can usually be identified by a black or burnt looking spot in the middle of the fuse. Any fuse in question should be checked with a light tester or replaced."
    },
    {
      "title": "Park your car.",
      "content": "Park your car. You should choose an area that has plenty of space for you to move around the front and sides of your vehicle. You also want a well-lit area so that you can see what you are doing. Be sure to turn your vehicle off before proceeding."
    },
    {
      "title": "Gather your tools.",
      "content": "Gather your tools. It is best to have everything you need easily accessible. Gather any hand tools you might need including wrenches, a mult-meter, a test light, and a spark plug tester."
    },
    {
      "title": "Disable the fuel system by removing the fuel pump fuse or relay.",
      "content": "Disable the fuel system by removing the fuel pump fuse or relay. This will prevent fuel from being pumped into the cylinders while the ignition system is disabled. Filling up the cylinders and failing to ignite the fuel will flood your engine."
    },
    {
      "title": "Test your spark plugs wires.",
      "content": "Test your spark plugs wires. These wires carry high voltage so exercise extreme caution when handling them. Insert a spark plug tester into the plug boot (end of the wire) and ground it on a piece of clean, unpainted metal on the engine. [2] X Research source Have someone crank the engine and watch for a spark. If you have a good spark on all wires look for timing problems or other issues. If you do not have a good spark in all wires then you may have an electrical problem in your ignition system."
    },
    {
      "title": "Locate your distributor cap.",
      "content": "Locate your distributor cap. The distributor is responsible for taking the high voltage generated in the ignition coil and passing it on to the spark plugs in a synchronized pattern. [3] X Research source It is connected to each plug wire, and you can trace back your plug wires to find the distributor cap. Some newer cars do not have a distributor and instead an engine control module (ECM) coordinates the firing of the plugs. If this is true for your car, ignore any steps involving the distributor or distributor cap."
    },
    {
      "title": "Observe the rotor inside the distributor.",
      "content": "Observe the rotor inside the distributor. You should remove the distributor cap by removing the screws or clips that hold it on. Have a friend turn the key and crank the engine. If you notice that the distributor is not turning, then you may have a broken timing belt or chain."
    },
    {
      "title": "Turn the ignition key on but don't crank the engine.",
      "content": "Turn the ignition key on but don't crank the engine. This will turn power on to the electrical components of your ignition system. This allows you to test which parts and wires are getting the current that they need to operate."
    },
    {
      "title": "Locate the ignition coil.",
      "content": "Locate the ignition coil. This part is responsible for generating the high voltages needed to fire your spark plugs. The coil should have three wires attached to it. A thin power (positive) wire coming from the ignition switch, a thin ground (negative) wire going from the coil to the ignition module, and a thick coil wire going from the coil to the distributor cap."
    },
    {
      "title": "Locate the positive or power wire attached to the engine coil.",
      "content": "Locate the positive or power wire attached to the engine coil. Check for power using a test light. If this wire has no power, then your ignition coil is not receiving current. You should check the wiring from your ignition switch to the coil for breaks in the wire and repair them. If this wire has power, then the wiring from the ignition switch to the coil is working properly and you can move on."
    },
    {
      "title": "Locate the negative or ground wire attached to the engine coil.",
      "content": "Locate the negative or ground wire attached to the engine coil. Using a test light check for power. The test light should light up indicating power on the negative side of the coil with the key on and engine off. If the light does not come on, you have a break in the coil wire and should trace the length of this wire (between the ignition module and ignition coil) and repair any breaks."
    },
    {
      "title": "Crank the engine while watching the test light.",
      "content": "Crank the engine while watching the test light. It is ideal if you can have a friend turn the key to crank the engine. If you observe the test light flickering when cranking the engine, you should: Trace the negative wire all the way to the ignition module looking for any breaks in the wire. If there are any breaks in the wire, they must be repaired. If there are no breaks in the wire, use an Ohm meter to test the resistance of your ignition coil. Your service manual should specify resistance values for the primary and secondary coils. If your coil does not register the proper resistance, then you will need to replace your ignition coil."
    },
    {
      "title": "Locate the pulse generator on the distributor.",
      "content": "Locate the pulse generator on the distributor. This is where wiring comes in from the ignition module."
    },
    {
      "title": "Connect an A/C voltmeter to the pair of wires at the pulse generator and crank the engine.",
      "content": "Connect an A/C voltmeter to the pair of wires at the pulse generator and crank the engine. If you observe no current then your pulse generator has likely malfunctioned. If this is the case you will need to replace it. If you observe a current then your pulse generator is likely operating properly. This may indicate that your ignition module is not functioning and you must replace it."
    },
    {
      "title": "Suspect the ECM as a last resort.",
      "content": "Suspect the ECM as a last resort. If all other components are functioning properly and there are no breaks in your wiring system, then you may have a bad ECM. At this point you should consider taking your vehicle to a professional to diagnose the problem."
    }
  ]
}