{
  "url": "https://www.wikihow.com/Do-Harsh-Death-Metal-Vocals",
  "title": "How to Do Harsh Death Metal Vocals",
  "steps": [
    {
      "title": "Gargle warm salt water and baking soda to moisten your vocal cords.",
      "content": "Gargle warm salt water and baking soda to moisten your vocal cords. Mix together 1 ⁄ 2 cup (120 mL) of warm water, 1 teaspoon (4.9 mL) of salt, and 1 ⁄ 4 teaspoon (1.2 mL) of baking soda. Gargle the mixture for 30 seconds to loosen and moisten the back of your throat and vocal cords so you’re ready to sing death metal vocals. [1] X Research source Gargle using a high-pitch note to loosen and moisten your vocal cords. Don’t use very hot or boiling water or you could damage your throat."
    },
    {
      "title": "Do some “hee-haw” vocal warm-ups.",
      "content": "Do some “hee-haw” vocal warm-ups. All singers need to warm up their vocal cords before they perform, but for death metal music, you need to warm up the growling and screaming involved in the vocals so you don’t damage your vocal cords. Imagine the “hee-haw” sound that a donkey makes and use the sounds for a vocal exercise. Repeat the “hee-haw” sounds in different pitches and with varying intensity to prime your vocal cords for death metal vocals. [2] X Research source Start off gently so you don’t strain your vocal cords, then pick up the pitch and intensity."
    },
    {
      "title": "Warm-up your vocals by screaming “yeah” and growling “wow.”",
      "content": "Warm-up your vocals by screaming “yeah” and growling “wow.” Death metal vocals are characterized by deep growls and screaming sounds. Warm-up your harsh vocals by scream-singing the word “Yeah” and get your deep vocals ready by growl-singing “Wow.” [3] X Research source Start to scream and growl more intensely as your vocal cords get warmed up. Practice singing death metal lyrics that you know to warm up."
    },
    {
      "title": "Suck on a slippery elm lozenge to keep your vocal cords protected.",
      "content": "Suck on a slippery elm lozenge to keep your vocal cords protected. Slippery elm contains mucilage, which coats your throat and helps prevent it from getting hoarse. Singing, especially, metal vocals, can take a toll on your vocal cords. While you’re warming up, suck on a lozenge that contains slippery elm to help lubricate and protect your vocal cords. [4] X Research source You can find slippery elm lozenges at health food stores and online."
    },
    {
      "title": "Relax your throat and allow your mouth to hang open.",
      "content": "Relax your throat and allow your mouth to hang open. In order to make the guttural, harsh-sounding vocals of death metal, you need to let the noise emanate from deep within your diaphragm. Allow your throat and mouth to relax so you’re only producing sound from your diaphragm and vocal cords."
    },
    {
      "title": "Take a deep breath into your diaphragm.",
      "content": "Take a deep breath into your diaphragm. In order to create the deep growls of death metal vocals, you need to expel the air from your diaphragm, rather than just from your lungs. Start by taking a big breath and allowing your belly to inflate. [5] X Research source Make sure the area around your stomach fills up when you take your breath or you may be breathing from your chest. Place your hand on your chest when you take a breath. If your hand moves more than your stomach when you inhale, then you’re not breathing into your diaphragm. Breathing deeply helps anchor your body and control your vocal cords."
    },
    {
      "title": "Push the breath up from your diaphragm.",
      "content": "Push the breath up from your diaphragm. Use the muscles of your diaphragm to press the air out of your mouth so it sounds like wind coming from your body. Don’t use your vocal cords yet so you can be sure the air is coming from your diaphragm and not your chest. Push the air out quickly and forcefully by tensing your diaphragm and abdominal muscles."
    },
    {
      "title": "Add growling sounds from the back of your throat.",
      "content": "Add growling sounds from the back of your throat. As you’re expelling the breath, add harsh growls from the bottom of your throat to the sound. It should sound raspy and almost gurgling. If the sound hurts or tickles your throat, you may not have warmed up enough or you may not be pushing the air out from your diaphragm."
    },
    {
      "title": "Sing lyrics while you’re growling.",
      "content": "Sing lyrics while you’re growling. Once you’ve established the growl and you’re singing from your diaphragm, start adding lyrics to your harsh vocals. Start with short verses that you know before you move to entire songs. Practice singing lyrics in different pitches so you can find what sounds best for you. It will take lots of practice for you to master singing death metal vocals. Work on enunciating the lyrics while you’re growling so they’re discernible."
    }
  ]
}