{
  "url": "https://www.wikihow.com/Get-Back-at-a-Cheater",
  "title": "How to Get Back at a Cheater",
  "steps": [
    {
      "title": "Take pictures with a friend.",
      "content": "Take pictures with a friend. If your partner's cheated on you, one way to make him or her jealous is to take pictures with a friend. The friend should be the same sex as your partner. Go around town, and take pictures together. Post the pictures where your ex can see them. This revenge works best if you do some romantic-looking activities together, such as having a candlelit dinner together or walking hand-in-hand through a park"
    },
    {
      "title": "Post pictures of your happiness.",
      "content": "Post pictures of your happiness. Advertise your happiness on social media. Even if you're not feeling happy, try faking happiness for the photos. Post pictures of yourself out with friends having drinks or hiking through the woods. Include smiling selfies with local landmarks or in local museums. Anything that shows you are living a great life is game for posting on social media. [2] X Research source This step shows the other person what they've given up. Plus, faking happiness is one step in moving towards happiness. In addition, try to hide your pain. While this one can be difficult, it can make cheaters upset, as many cheaters are ego-driven, so they want to be in the middle. If you blow up at the person, you're feeding that person's ego. Try calmly breaking up with the person and then getting on with your life. [3] X Research source"
    },
    {
      "title": "Let them live with what they've done.",
      "content": "Let them live with what they've done. That is, once you've moved on from your partner, that person has to learn to live by themselves again, which they may not be equipped to do. They have to pick up the pieces, pay the bills, and be the one known as the cheating partner. Watching them try to pick up the pieces can be pretty good revenge. [4] X Research source"
    },
    {
      "title": "Ignore the person.",
      "content": "Ignore the person. Once you've decided to move on, don't take the person's calls. Unless you really, truly want to make up with the person, it's best to any communication from them. Once again, you don't want to feed their ego or be persuaded by their rhetoric. Of course, it may do some good to keep the person around on social media, so they can see how great your life is. That way, the person knows what he or she has lost. Reader Poll: We asked 1226 wikiHow readers how they would respond if they discovered their partner was cheating, and 61% of them said end the relationship immediately. [Take Poll] If this is the case for you, it’s usually better to cut them off completely."
    },
    {
      "title": "Deal with the emotions.",
      "content": "Deal with the emotions. Being cheated on comes with a whole range of emotions. You probably expect anger and sadness, but you may be surprised that you also feel shame and emptiness. You may find yourself annoyed or possessive. You may even feel relief because you have finally figured out what's going on with your relationship. All of these feelings are perfectly normal. The first step in dealing with your emotions is figuring out just what you're feeling. Try spending some time journaling to help you identify your emotions. Discussing it with a friend can also help you figure out what you're feeling. Don't be afraid to talk to a therapist. If you feel like your emotions are overwhelming you, it's perfectly normal to accept professional help."
    },
    {
      "title": "Learn to trust yourself again.",
      "content": "Learn to trust yourself again. You may be thinking that it's partially your fault that the person cheated. While you may be partially responsible for letting the relationship go, it was the other person's choice to cheat. [5] X Research source However, you can learn from what happened. In the future, trust yourself when the relationship doesn't feel quite right, and take steps to make it better. For instance, stop to talk to your partner when you feel like something has gone wrong. [6] X Research source"
    },
    {
      "title": "Forgive the person.",
      "content": "Forgive the person. This step may feel counter-intuitive to getting revenge. However, holding on to your anger only makes you unhappy and keeps you from moving on. [7] X Research source Forgiveness starts with identifying your anger and feelings toward the person, which you've already worked on in this section. [8] X Research source The next step is to see if you can find why the person did what he or she did. That means trying to find compassion for the partner to figure out how he or she got to the point of cheating. [9] X Research source Forgiving the person doesn't mean excusing what he or she did, nor does it mean you must stay with him or her. It does mean you have to think about the person as a person, not as this entity who hurt you. [10] X Research source"
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. In the wake of breaking it off with a cheater, you may find yourself wanting to wallow in your grief. When you're down-and-out, you may also find that you're not eating properly, sleeping well, or getting proper exercise. Taking care of yourself is essential to helping you heal and move on. Try to stick to a regular eating schedule, and be sure to make some healthy choices. Include plenty of fruits and vegetables, whole grains, and fish in your diet. Give yourself extra rest. Not only will you need extra rest, but you may find it harder to fall asleep. Therefore, you'll need extra time for sleeping. Try to get some exercise in, as well. Take a walk outside in the sunlight. Go for a swim. Play a game of basketball with your friends. Take steps to get up and get moving."
    },
    {
      "title": "Do the things you enjoy.",
      "content": "Do the things you enjoy. Pick up old activities you may not have had time for in a relationship. For instance, hang out with your friends or pick up an old hobby. Find time to volunteer. Not only will these activities help you move on, but they will make you happier as a person. Happiness is the best revenge. Don't be afraid to snap a picture or two to post where your ex can see it."
    },
    {
      "title": "Start dating again.",
      "content": "Start dating again. Once you've given yourself a little while to heal, pick up dating again. For one, trying to find romance again can make you happier. In addition, it can show your ex that you've truly moved on, and that what or he or she did lost you for good. [11] X Research source If you're unsure how to get started again, consider using a dating site. You must pay for some sites, but others are free. Dating sites offer a way to connect with people with similar interests to you."
    },
    {
      "title": "Go on an adventure.",
      "content": "Go on an adventure. Sometimes, when you're in a relationship, you put off doing the big things you've always longed to do. Now is the time to go do those things. You have your life wide open right now, and the possibilities are endless. [12] X Research source For instance, take a vacation to a far-flung country that you've always dreamed of. Go back to school for the degree you've always wanted. Get that pet you've longed for but couldn't have because your partner was allergic. Move to a new city. Get a new job or start a new career. Whatever it is that makes your heart beat a little faster, that is what you should do. Once again, it doesn't hurt to post a few pictures of your fabulous adventures where your ex can see them."
    },
    {
      "title": "Spill the beans.",
      "content": "Spill the beans. One way to get back at the cheater is to tell the truth about what happened. That doesn't mean you should go into extreme detail. Rather, if one of your friends or even one of your ex-partner's family members ask, tell the truth, that your partner cheated on you with someone else. Eventually, the bad karma will get back to your partner in the form of a tongue lashing from a mutual friend. However, this revenge can backfire if the person you're talking to is fiercely loyal to the other person. They may just see it as you spreading lies around."
    },
    {
      "title": "Sue the woman on the side.",
      "content": "Sue the woman on the side. In seven states, a married person can sue the person on the side for damages. You can try this (legal) revenge in Hawaii, Illinois, South Dakota, Utah, New Mexico, Mississippi, and North Carolina. [13] X Research source Generally, you need to either prove criminal conversation or alienation of affection. With criminal conversation, you'll need to prove that your spouse is having an affair generally through the use of a private investigator. With alienation of affection, you just need to prove that the person on the outside moved your marriage from a loving one to one of alienation and that you were harmed by that situation somehow. [14] X Research source Contact a divorce lawyer for more information. [15] X Research source"
    },
    {
      "title": "Post the news publicly.",
      "content": "Post the news publicly. If you're sure your partner is cheating, you can post that information in a public forum. For instance, you can post it on a social media platform as a blog post or add pictures to drive home the story. [16] X Research source Alternatively, you could go with a paper version and put up flyers in your neighborhood. That way, your spouse has to live with the consequences in a public way."
    },
    {
      "title": "Print out proof as a present.",
      "content": "Print out proof as a present. This one is good to try if there's a big holiday or anniversary coming up. Instead of outing the person right away, print out any proof you have of the affair. Wrap it up in boxes to hide the fact that it's not a present, then have the person open them on the big day."
    },
    {
      "title": "Tell the person on the side.",
      "content": "Tell the person on the side. If you can find a number for the person your partner is cheating with, try calling that person up. That person may have no idea that your partner is with someone else, and letting him or her know it may be pretty good revenge. [17] X Research source"
    }
  ]
}