{
  "url": "https://www.wikihow.com/Draw-a-Rectangle",
  "title": "How to Draw a Rectangle",
  "steps": [
    {
      "title": "Draw a straight, horizontal line using a ruler.",
      "content": "Draw a straight, horizontal line using a ruler. Using a ruler will help you make sure that your line is straight, so that your rectangle turns out neat and even. Make the line however long you want your rectangle to be. [1] X Research source This line will be the top of your rectangle, so draw it wherever you want the top to go."
    },
    {
      "title": "Make a shorter vertical line coming down from one end of the first line.",
      "content": "Make a shorter vertical line coming down from one end of the first line. Use the ruler to draw this line too, so that it’s straight. The angle between this line and the first line should be 90 degrees. [2] X Research source Make sure this line is shorter than the first line you drew. If it’s the same length, you’ll end up drawing a square instead of a rectangle. You can use a protractor to measure the angle between the vertical and horizontal lines."
    },
    {
      "title": "Draw a horizontal line coming off the bottom end of the vertical line.",
      "content": "Draw a horizontal line coming off the bottom end of the vertical line. Make sure this line is straight like the first two lines and that it’s the same length as the first horizontal line you drew. This will be the bottom of the rectangle. This horizontal line should be parallel with the horizontal line at the top of the rectangle."
    },
    {
      "title": "Draw a vertical line between the ends of the two horizontal lines.",
      "content": "Draw a vertical line between the ends of the two horizontal lines. Use the ruler to make the line straight. This vertical line should be the same length as the first vertical line you drew on the other side of the rectangle. [3] X Research source After you draw this line, your rectangle is finished!"
    },
    {
      "title": "Color in your rectangle to make it pop.",
      "content": "Color in your rectangle to make it pop. Now that your rectangle is finished, you can shade it in with pencil or color it with marker so that it stands out. You can also go over the perimeter of the rectangle with pen or black marker, so the lines are more visible."
    }
  ]
}