{
  "url": "https://www.wikihow.com/Decoupage-Jars",
  "title": "How to Decoupage Jars",
  "steps": [
    {
      "title": "Choose a glass jar that has sufficient surface space for images.",
      "content": "Choose a glass jar that has sufficient surface space for images. If you are a beginner to decoupaging jars, it is best to start with a jar with a larger surface. Once you have the experience, you can downsize to smaller jars later. A large jam jar or mason jar is a great start because they are big and easy to hold. [1] X Research source Another thing to consider is the appeal of the jar. A basic mason jar may be too plain or not interesting enough to you. If the jar has a unique shape, this can heighten the appeal of the end look once the project is completed."
    },
    {
      "title": "Wash the jar in warm, soapy water.",
      "content": "Wash the jar in warm, soapy water. Begin by removing any labels attached to the jar, along with the leftover adhesive left behind. If the adhesive proves stubborn, use a rubbing oil to assist, such as orange oil or eucalyptus oil. Glass jars also tend to get a lot of fingerprints on the outside. Wash the surface of the jar you chose with a cloth, mild soap, and warm water. [2] X Research source If soap and water are not enough, use some rubbing alcohol on a cotton ball to wipe the surface of the glass. This will remove any additional grease or grime on the jar."
    },
    {
      "title": "Allow the jar to dry fully before using it.",
      "content": "Allow the jar to dry fully before using it. Make sure the glass is dry before you begin your project. Also check that all adhesive has been removed, along with any unpleasant odors. If you have an older glass jar with remaining odors, either wash again or use an odor removal technique such as soaking with vinegar or washing out with baking soda. [3] X Research source If you’re using a drinking glass, place a piece of tape around the top of the glass to avoid your lips coming in contact with leftover glue. [4] X Research source"
    },
    {
      "title": "Decide what image(s) you would like to use on your jar.",
      "content": "Decide what image(s) you would like to use on your jar. Think of what images you would like to put on your jar. The choice of image is completely up to you, and you can choose a variety of materials, such as wrapping paper, fabric, wallpaper, or even ribbons. [5] X Research source If you’re having trouble selecting an image, consider the end use intended for the jar as a guide. For example, if the jar is to contain candy, find images with pieces of candy or other tasty treats. If you want to do an autumn theme, you can get real or fake fall leaves to adhere to your jar. [6] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source"
    },
    {
      "title": "Cut the images to fit the jar.",
      "content": "Cut the images to fit the jar. If you printed out an image on paper, use scissors to cut around the image so that it fits on your jar. You may want to measure the image you’re cutting to make sure it will fit the jar. [7] X Research source If you’re using fabric, make sure to use fabric scissors to cut it."
    },
    {
      "title": "Use a craft or cutting knife to trim away any excess paper.",
      "content": "Use a craft or cutting knife to trim away any excess paper. If you printed an image with intricate details, such as a flower, you can use a small cutting knife to trim away any excess paper. Before cutting, place the image on a cutting mat to protect your work surface. Then use the craft knife and press it against the image to slowly cut around the edges. [8] X Research source"
    },
    {
      "title": "Arrange the images on the jar to your liking.",
      "content": "Arrange the images on the jar to your liking. Before you begin decoupaging, place your images on the jar, so you get an idea of how you would like to arrange them. They can be in any placement you prefer, and can even overlap. [9] X Research source If you need to, make small marks with a light maker to clarify the exact positioning of the imaging on the jar. You can use a pen suited to glass if you need to make placement markers on the jar."
    },
    {
      "title": "Prepare the work surface by laying down paper.",
      "content": "Prepare the work surface by laying down paper. Lay out a sheet of grease-proof paper, like parchment paper, on your table or workspace. This protects the surface from glue residue. Parchment paper provides a good surface because it won’t stick to the glue you put on your jar. Avoid newspaper when covering your workspace. It will stick to your mason jar and ruin your project."
    },
    {
      "title": "Decide on a decoupage medium, or glue, to adhere your images to the jar.",
      "content": "Decide on a decoupage medium, or glue, to adhere your images to the jar. There are a variety of mediums to choose from at a craft store. Some popular decoupage glues, such as Mod Podge and Collage Pauge, are made especially for decoupaging. When purchasing your glue, consider the type of finish you want. You can get gloss for a shiny finish, or matte for a flat finish. [10] X Expert Source Nicole Bolin Crafts & DIY Specialist Expert Interview. 29 October 2020. [11] X Research source You can also make your own decoupage glue with water and basic white craft glue. Pour 1-part water and 1-part glue in a paper cup and mix it with a craft stick. Make sure to stir it well and use it quickly before it dries. [12] X Expert Source Nicole Bolin Crafts & DIY Specialist Expert Interview. 29 October 2020."
    },
    {
      "title": "Paint a thin layer of decoupage glue on the jar.",
      "content": "Paint a thin layer of decoupage glue on the jar. Dip your sponge brush in the decoupage glue, and carefully paint a thin layer on your glass jar. If you are only putting the image on one section of the jar, just paint that section. If you are putting images around the entire jar, cover it with glue. Make sure to completely cover the areas your pictures will touch. If the images are small, or you’re layering them, put the decoupage glue on the back of the image. To do this, lay the image face down on the grease-proof paper. Use the sponge brush to evenly apply the decoupage glue to the back. The layer needs to be thin, otherwise the pictures might get too wet and tear. [13] X Expert Source Nicole Bolin Crafts & DIY Specialist Expert Interview. 29 October 2020."
    },
    {
      "title": "Place the images onto the jar.",
      "content": "Place the images onto the jar. Once you have put all the glue you need on the jar or the back of the pictures, you can place them on the surface. If you made marks on your jar earlier, use these to guide your placement. Otherwise, add the images wherever you’d like. Use your fingers to gently push down and smooth out any wrinkles. [14] X Research source If you made a mistake with your positioning on the jar, use tweezers to remove or adjust the image. This will help to avoid sticky fingers. Repeat for any additional images being added. If you decided to overlap any images, do so with care to ensure that the images look neat and appropriately placed."
    },
    {
      "title": "Allow the decoupage glue to dry.",
      "content": "Allow the decoupage glue to dry. Before moving forward with the next steps, wait for the decoupage glue dry completely. This may take an hour or more, depending on the thickness of the paper you used to cover the jar. [15] X Research source Small air bubbles may form while the glue is drying. If this happens, use a safety pin or utility knife to pop them. Then use your fingers to smooth it out."
    },
    {
      "title": "Apply 2 to 3 layers of the decoupage glue on the jar to seal the images.",
      "content": "Apply 2 to 3 layers of the decoupage glue on the jar to seal the images. Once the glue has dried, use the sponge brush to apply a layer of the decoupage glue directly on top your images. Allow this layer to dry for two hours, and then add another one. Keep adding coats of the glue until the edges of your pictures are smooth. [16] X Research source Make sure you allow the glue to dry for at least two hours before adding another coat. The decoupage glue will appear cloudy when first added, but it will dry clear."
    },
    {
      "title": "Wait for your jar to dry before you use it.",
      "content": "Wait for your jar to dry before you use it. It is important to wait until your jar is completely dry before touching it. You don’t want to mess up all the work you just did. To play it safe, let it dry overnight. The next day, it should be completely safe to pick up without messing up the pictures. [17] X Research source"
    }
  ]
}