{
  "url": "https://www.wikihow.com/Draw-an-Anime-Character",
  "title": "How to Sketch Anime Characters: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Draw an oval and divide it into 4 sections.",
      "content": "Draw an oval and divide it into 4 sections. This will be the basic outline of your anime character’s head . The proportions don’t have to be exact, but make the bottom narrower, since it’ll be the chin. Once you’ve drawn the oval, draw a horizontal line through its center. Then, draw a vertical line that intersects with the horizontal line through its center. Later, you'll use these lines as guides to draw the facial features. [1] X Research source Internationally acclaimed portrait artist Renee Plevy says “You have to truly see the face in front of you before you start to draw.” Refer to magazine photos to figure out the right position for the person you’re drawing. To draw a wider face , widen the bottom of the oval so it’s slightly narrower than the top. To give your character a slender face, make the bottom of the oval narrower than the top. There's no single head shape used for all anime characters, so you can experiment until you find one you like."
    },
    {
      "title": "Draw the eyes underneath the horizontal line.",
      "content": "Draw the eyes underneath the horizontal line. Start by drawing a thick upper lash line just underneath the horizontal line you drew and on one side of the vertical line. Then, draw a semicircle coming down off the upper lash line with a black pupil in the center of it. Next, draw a narrow, horizontal line under the circle for the lower lash line. Finally, shade in the circle around the pupil. Try to make the eyes as symmetrical as possible. [2] X Research source Leave some white space so it looks like light is reflecting off your character’s eyes. Do the same thing on the other side of the vertical line to make the other eye. Anime eyes are big and exaggerated, and they usually take up about 1/4 to 1/5 of the height of the face."
    },
    {
      "title": "Sketch the eyebrows above the horizontal line.",
      "content": "Sketch the eyebrows above the horizontal line. Draw a long, downward curving line for each eyebrow. Make them slightly longer than the upper lash line you drew for the eyes. Then, thicken the ends of the brows that are at the center of the face. To give your character a straight or relaxed face, make sure the eyebrows are close to the horizontal line. [3] X Research source If you’re drawing a feminine anime character , make the eyebrows fairly thin. For a masculine character, thicken the eyebrows so they’re more prominent on the face."
    },
    {
      "title": "Add the nose halfway between the horizontal line and the chin.",
      "content": "Add the nose halfway between the horizontal line and the chin. To draw your character’s nose , draw a short, slightly curved vertical line along the center of the face at the halfway point between the horizontal line and the chin. Make the line longer if you want their nose to be big. The nose will overlap with the vertical line you drew in step 1. To see it better, make it darker than the vertical line, or erase the vertical line around the nose. [4] X Research source Make the nose the smallest feature on your character’s face. Anime noses are subtle, and they’re usually only defined when you’re looking at a character from the side. Sometimes, masculine anime characters have more pronounced noses, but that’s not always the case. To make your character’s nose more noticeable, draw a short horizontal line under the vertical line to represent the bottom of their nose. Draw a triangle-shaped shadow on the side of the nose so it looks like the light is hitting your character from the side. For certain styles of anime, like chibi , you don’t need to draw a nose at all!"
    },
    {
      "title": "Draw the mouth about halfway between the nose and chin.",
      "content": "Draw the mouth about halfway between the nose and chin. Similar to anime noses, anime mouths are simple and subtle. To draw your character’s mouth , draw a horizontal line that’s about as long as the space between their eyes. Don’t worry about drawing lips . Make the mouth the second smallest feature on your character’s face, after the nose. [5] X Research source Curve the line upward if you want your character to be smiling or downward if you want them to be upset. To draw your character smiling and showing their teeth, draw an upward curving line under the horizontal line you drew for their mouth. The white space (their teeth) between the curved and horizontal lines should be about half as tall as the mouth is long."
    },
    {
      "title": "Add the ears to the side of the head.",
      "content": "Add the ears to the side of the head. If you want your character to have long hair that’s covering their ears, skip drawing the ears. However, if your character’s hair is going to be short, draw a narrow oval on each side of the head. Have the top of the ears line up with the horizontal line running through the center of the face, and have the bottoms line up with the bottom of the nose. Then, draw the flaps of the ear inside each oval. [6] X Research source Experiment with the size of your character’s ears if you want them to be bigger or smaller."
    },
    {
      "title": "Draw the hair on your character's head.",
      "content": "Draw the hair on your character's head. The hairstyle you choose for your character is up to you, but generally, anime hair features pointed ends and distinct sections. You can draw a short, buzzed hairstyle, a medium-length style, or long, flowing hair. Whichever hairstyle you choose, avoid drawing individual strands of hair. Instead, draw big sections of hair, like 4 or 5 spikes at the ends. [7] X Research source If your character has long hair, draw 2 pigtails, one on each side of the head, with spiked ends. Or, draw their hair pulled up with a round bun at the top. Alternatively, give them bangs by drawing 3-4 distinct sections of hair coming down over their forehead. For a shorter hairstyle, draw 3-4 distinct sections of hair swooping to the side over your character’s forehead. Or, draw a hairstyle with a few lines running from their hairline to the back of their head so it looks like their hair is combed back. Alternatively, draw a chin-length bob that’s divided into several thick sections."
    },
    {
      "title": "Erase the horizontal and vertical guidelines you drew.",
      "content": "Erase the horizontal and vertical guidelines you drew. Erase them carefully so you don’t remove any of the facial features by mistake. Use a small eraser so you’re less likely to make mistakes. Once you erase both lines, your character’s head and face are finished!"
    },
    {
      "title": "Color your character to bring it to life.",
      "content": "Color your character to bring it to life. After drawing your character’s face and head, pick out some colors and fill in their face and hair. Don’t be afraid to experiment with colors! If your character is from another planet, consider coloring their skin or hair something that’s not commonly seen on Earth, like green, purple, or blue. Digital manga artist Arklight Blues says depending on the type of hair you want your character to have, you need to adapt your style. For example, black hair is easier and more efficient to draw than other colors."
    },
    {
      "title": "Draw a stick-figure outline of your character’s body.",
      "content": "Draw a stick-figure outline of your character’s body. To draw your character’s body , use straight lines for the arms, torso, and legs. Make the arms and torso similar in length, and make the legs about 1/3 longer. Then, draw triangles or ovals for the hands and feet. Make the hands about 1/5 the length of the arm, and make the feet about 1/6 the length of the legs. [8] X Research source To get the proportions right, make your stick-figure outline about 7 times as tall as your character’s head. Have the arm lines start about 1/5 of the way down the line you draw for the torso. Have the stick-figure outline of your character capture whatever pose you want them to be in. For example, if you want your character to be sitting, draw their legs so they're bent. If you want your character to be waving, draw one of their arms so it's bent."
    },
    {
      "title": "Outline the general shapes of your character’s body.",
      "content": "Outline the general shapes of your character’s body. Drawing over the stick-figure outline you made, sketch a rough outline of your character’s torso, arms, hips, and legs. Don’t worry about making the outline precise yet. At this point, you just want to represent the different parts of the body with basic shapes. Those shapes are as follows: [9] X Research source Draw ovals for the upper and lower arms and legs, and then draw a circle at each joint for the knees and elbows. Proportionally, make their upper and lower arms the same length and size. Make their upper legs thicker than their lower legs. For the torso, draw a quadrilateral (a 4-sided shape) that’s wider at the top and narrower at the bottom. Eventually, the wide corners at the top will become your character’s shoulders. To outline the hips, draw an oval over the point where the torso and upper legs meet. Anime characters tend to be tall and thin, but you can experiment with different heights and body shapes!"
    },
    {
      "title": "Connect and refine the general shapes you drew.",
      "content": "Connect and refine the general shapes you drew. Trace around the outer edges of your character’s body to make one seamless outline. At this point, start refining the different parts of the body so they look more realistic, like your character’s hands, shoulders, hips, and neck. When you’re finished, you’ll have a full, detailed outline of your character’s body around the more abstract outlines you drew before. [10] X Research source To connect and refine the legs, draw around the outer edges of each shape that makes up the legs (the ovals for the upper and lower legs, the circles for the knees, and the shapes you drew for the feet) so you have one seamless outline. Make the outline smooth (without any gaps) so the legs look realistic. For the upper body, do the same with the arms and torso. Round out the corners of the torso for the shoulders, and draw 2 lines curving up away from the center of the torso for the neck. Connect the shape you drew for the hips to the torso and the upper legs."
    },
    {
      "title": "Erase the stick-figure outline and shapes you drew.",
      "content": "Erase the stick-figure outline and shapes you drew. Be careful erasing so you don’t accidentally remove any of the refined, final outlines that you drew. When you’re finished, you should be left with a neat, seamless outline of your character’s body without any of the original guidelines you drew inside of it. [11] X Research source Plevy says that when trying to improve at drawing human anatomy, do a lot of reading, sketching, and reach out to a teacher who will help you see what you’re missing."
    },
    {
      "title": "Add your anime character’s clothes.",
      "content": "Add your anime character’s clothes. Draw the clothes over the outline of your character’s body. For your character’s shirt, draw the sleeves over their arms and the body of the shirt over their torso. Then, erase any lines that are inside the clothes since those parts of your character’s body are covered up. If your character’s wearing shorts, erase the outline of their upper legs inside the shorts since they’d be covered. [12] X Research source Think about where the clothes would naturally crease and fold if someone were actually wearing them. Or look at images of clothes online to see how they crease. Then, draw the creases and folds to make the clothes look more realistic. Choose any kind of outfit for your anime character. Some conventional anime outfits to consider include school uniforms, formal dresses and suits, and traditional Japanese attire."
    },
    {
      "title": "Color your character to bring life to your sketch.",
      "content": "Color your character to bring life to your sketch. After getting your character drawn, color their clothes, skin, and hair. To really flesh out your character, make a color palette that matches their personality and use those colors on their clothes and hair. For example, if your character is hotheaded and strong-willed, make their color palette red, orange, yellow, and black, then color their clothes and hair one of those colors. Experiment with colors, too! Give your character cool skin or crazy hair and have fun."
    }
  ]
}