{
  "url": "https://www.wikihow.com/Download-a-Google-Drive-Folder-on-iPhone-or-iPad",
  "title": "How to Download a Google Drive Folder on iPhone or iPad",
  "steps": [
    {
      "title": "Open the Google Drive app on your iPhone or iPad.",
      "content": "Open the Google Drive app on your iPhone or iPad. The icon looks like a multicolored triangle. Be sure to log into your Google account . If you don't have the Google Drive app, you can download it from the App Store . This method will download Google Drive folders to the iOS Files app. You can also make files available offline or save photos or images directly to your Camera Roll ."
    },
    {
      "title": "Tap the folder.",
      "content": "Tap the folder. Keep in mind that while you can't download an entire folder, you can download the folder's contents in bulk. [1] X Research source You should now see all the folder's contents. If needed, add more files to your folder before downloading."
    },
    {
      "title": "Long-press on a file in the folder.",
      "content": "Long-press on a file in the folder. This will select the file, and more options will appear at the top."
    },
    {
      "title": "Tap the \"select all\" icon at the top-right corner.",
      "content": "Tap the \"select all\" icon at the top-right corner. This looks like a solid square with a dotted square border. All items in the folder will be selected."
    },
    {
      "title": "Tap ••• in the top-right corner.",
      "content": "Tap ••• in the top-right corner. This will open a menu for all the selected items."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . This is the third option in the pop-up menu. Google Drive will begin preparing the folder items for download, which may take a moment."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . This will save the Google Drive folder's contents into the Files app on your iPhone or iPad."
    },
    {
      "title": "Select a save location.",
      "content": "Select a save location. Tap Browse in the top-left corner to select a location, such as On My iPhone , iCloud Drive , or another connected app."
    },
    {
      "title": "Create a new folder.",
      "content": "Create a new folder. Since your files will be separated, it's recommended to create a new folder to keep them together. You can skip this step if you already have a designated folder in your Files app. Do the following: Tap ••• in the top-right corner. Tap New Folder . Name the folder. Tap Done."
    },
    {
      "title": "Tap Save in the top-right corner.",
      "content": "Tap Save in the top-right corner. The files will be saved to your iPhone or iPad. If you want to view the files inside of a Google Drive folder without Wi-Fi or cellular data, you can make the files available offline ."
    },
    {
      "title": "Open the Google Drive app on your iPhone or iPad.",
      "content": "Open the Google Drive app on your iPhone or iPad. The icon looks like a multicolored triangle. Be sure to log into your Google account. If you turn on Available offline , you can view Google Drive files without an internet or cellular data connection. [2] X Research source"
    },
    {
      "title": "Tap the folder.",
      "content": "Tap the folder. To make an entire folder available offline, you'll need to open the menu for the individual files. Luckily, this can be done for multiple files at once. You should now see all the folder's contents."
    },
    {
      "title": "Long-press on a file in the folder.",
      "content": "Long-press on a file in the folder. This will select the file, and more options will appear at the top."
    },
    {
      "title": "Tap the \"select all\" icon at the top-right corner.",
      "content": "Tap the \"select all\" icon at the top-right corner. This looks like a solid square with a dotted square border. All items in the folder will be selected."
    },
    {
      "title": "Tap ••• in the top-right corner.",
      "content": "Tap ••• in the top-right corner. This will open a menu for all the selected items."
    },
    {
      "title": "Tap Make available offline.",
      "content": "Tap Make available offline . The selected files will be made available offline. If you want to remove offline access, tap the three dots next to the file name, and then select Remove offline access ."
    },
    {
      "title": "View your offline files.",
      "content": "View your offline files. You can find your offline files in your Google Drive, regardless of internet or cellular connection. Do the following: Open the Google Drive app. Tap the Home tab. Tap ☰ in the top-left corner. Tap Offline ."
    },
    {
      "title": "Open the Google Drive app on your iPhone or iPad.",
      "content": "Open the Google Drive app on your iPhone or iPad. The icon looks like a multicolored triangle. Be sure to log into your Google account. You can save photos or videos from Google Drive folders directly to your Camera Roll."
    },
    {
      "title": "Tap the folder.",
      "content": "Tap the folder. To save an entire folder to your Camera Roll, you'll need to open the menu for the individual files. Luckily, this can be done for multiple photos and videos at once. You should now see all the folder's contents."
    },
    {
      "title": "Long-press on a photo or video in the folder.",
      "content": "Long-press on a photo or video in the folder. This will select the file, and more options will appear at the top."
    },
    {
      "title": "Tap the \"select all\" icon at the top-right corner.",
      "content": "Tap the \"select all\" icon at the top-right corner. This looks like a solid square with a dotted square border. All items in the folder will be selected."
    },
    {
      "title": "Tap ••• in the top-right corner.",
      "content": "Tap ••• in the top-right corner. This will open a menu for all the selected items."
    },
    {
      "title": "Tap Send a copy.",
      "content": "Tap Send a copy . This is in the pop-up menu."
    },
    {
      "title": "Tap Save image or Save video.",
      "content": "Tap Save image or Save video . The images and/or photos will be saved to your Camera Roll."
    },
    {
      "title": "Why can't I download folders from Google Drive?",
      "content": "Why can't I download folders from Google Drive? If you can't download a certain file, picture, or video from Google Drive, make sure you have the proper permissions to do so. If you aren't the owner of the file, contact them for access. If you are the owner of the file, make sure you have enough space on your device to store the files."
    },
    {
      "title": "How do I upload an entire folder to Google Drive?",
      "content": "How do I upload an entire folder to Google Drive? To upload a folder on Google Drive using your iPhone or iPad, do the following: Open the Files app. Select a folder. Tap •••. Tap Select . Select all the files you want to add. Tap the Share icon. Tap Google Drive . Tap Folder at the bottom. Select an upload folder, then tap Save here . Tap Upload ."
    }
  ]
}