{
  "url": "https://www.wikihow.com/Cut-Side-Swept-Bangs",
  "title": "3 Techniques for Cutting Your Own Side Bangs",
  "steps": [
    {
      "title": "Section the front of your hair in a triangle starting at the crown.",
      "content": "Section the front of your hair in a triangle starting at the crown. Part your dry hair down the center with a rat tail comb , then find the spot where your head starts to slope forward, approximately 2 inches (5.08 cm) back from your hairline. Make a diagonal downward part on each side of this point, using the arch of your eyebrows as a guide to get the correct angle. Comb this triangle section of hair forward. [1] X Research source Make sure your hair is completely dry. [2] X Expert Source Yan Kandkhorov Hair Stylist Expert Interview. 28 January 2020. Cutting wet hair won't give you the accuracy you need because wet hair dries shorter and to a different shape. Tie the rest of your hair back to keep it out of the way."
    },
    {
      "title": "Divide the triangle of hair horizontally and clip the upper half.",
      "content": "Divide the triangle of hair horizontally and clip the upper half. Make a horizontal part in the bang hair with a rat tail comb, sectioning it into an upper and lower half. Clip the upper half out of the way on top of your head, as you’ll be trimming the lower half of your bang hair first. [3] X Research source"
    },
    {
      "title": "Pinch the hair between two fingers to mark the length you want.",
      "content": "Pinch the hair between two fingers to mark the length you want. Pull your lower bang hair straight down in front of your face, but don’t tug on it. Select a reference point on your face that’s the length you’d like your shortest bang piece to be. Pinch your hair in that spot, holding it between the second and third fingers of your non-dominant hand. This will serve a guide for cutting. [4] X Research source Some people use the bottom of their nose as a reference point. Others prefer a longer length and use the middle of their lips as a reference point. If you’re uncertain, start with a longer length. You can always take off more hair, but you can’t put it back once it’s cut."
    },
    {
      "title": "Pull your hair to the opposite side of how you’ll wear your bangs.",
      "content": "Pull your hair to the opposite side of how you’ll wear your bangs. With your fingers still pinching your hair at the reference point, sweep your bangs over in the opposite direction of how you’ll part your hair. [5] X Research source Once your hair is cut, it will fall to the other, correct side of your face with a sweeping downward angle."
    },
    {
      "title": "Cut off the hair right below your fingers.",
      "content": "Cut off the hair right below your fingers. Hold your hair close to your face and make a straight parallel cut. Release your hair; the shortest part of your bangs will reach the reference point on your face. Comb this hair over to the correct side, the way you intended to wear it. [6] X Research source Special styling shears will give you the best results, as they're sharper and designed for cutting hair. Otherwise, make do with a sharp pair of regular scissors."
    },
    {
      "title": "Unclip and cut the upper portion of your bangs.",
      "content": "Unclip and cut the upper portion of your bangs. Repeat the process you used to cut your lower bangs: find your reference point, pinch your hair, and pull it to the opposite side of how you’ll wear your bangs. Make a straight, parallel cut beneath your fingers. [7] X Research source"
    },
    {
      "title": "Combine your bang sections and hold the hair between two fingers.",
      "content": "Combine your bang sections and hold the hair between two fingers. Comb the upper and lower bang sections together and pull them in front of your face. Hold your bangs near the bottom, pinching the hair horizontally between the second and third fingers of your non-dominant hand. Pull your bangs slightly outward so they aren’t touching your face. [8] X Research source"
    },
    {
      "title": "Blend the bangs by point cutting the ends with small vertical clips.",
      "content": "Blend the bangs by point cutting the ends with small vertical clips. Hold the scissors vertically and snip the ends of your bangs by making tiny upward clips with the tips of the scissors. [9] X Research source Keep the clips shallow, only inserting the blades about ¼ - ½ inch (.64 - 1.27 cm) deep. When point cutting , the goal is to remove bulk rather than length. [10] X Research source Cutting at an angle would remove chunks of hair and change the shape of your bangs; make sure to keep the scissors straight and vertical."
    },
    {
      "title": "Style your side bangs.",
      "content": "Style your side bangs. Spritz your bangs with water and comb them in the direction of your part. For a sleek and sexy look, finger comb through your bangs as you blow dry them. Shuffle your hair a bit from left to right as you comb your fingers downward. For a fuller, softer side sweep, use a round brush as you blow dry; a round brush will give your bangs more curl. [11] X Expert Source Noël Reid-Killings Celebrity Hair Stylist Expert Interview. 25 November 2020."
    },
    {
      "title": "Choose a sharp, single-blade razor.",
      "content": "Choose a sharp, single-blade razor. A styling razor is recommended, although some DIY folks make do with a disposable shaver. Just ensure that your razor is very sharp and has a single blade. Using a dull tool or one with multiple blades can cause split ends. [12] X Research source Razor-cutting extremely coarse hair might not be your best bet, as it can cause split ends."
    },
    {
      "title": "Section the front of your hair in a triangle using a rat tail comb.",
      "content": "Section the front of your hair in a triangle using a rat tail comb. Comb your hair forward over your face. Find the spot where your head starts to slope forward, approximately 2 inches (5.08 cm) from your hairline. Make a diagonal downward part on each side of this center point, using the outside ending point of your eyebrows as a guide to get the correct angle. Tie the rest of your hair back."
    },
    {
      "title": "Divide the triangle where you normally part your hair and clip one side.",
      "content": "Divide the triangle where you normally part your hair and clip one side. At your natural part line, separate the bang hair so there's a piece of hair on the left and a piece on the right. Clip the smaller section of bang hair out of the way. [13] X Research source"
    },
    {
      "title": "Make small razor strokes to cut the larger section of hair at a slant.",
      "content": "Make small razor strokes to cut the larger section of hair at a slant. Hold the bigger section of bang hair tautly between the fingers of your non-dominant hand. Starting at the bottom of your nose, stroke the razor against your hair to remove small bits at a time. [14] X Research source Cut your bangs at an angle that slants downward towards your jaw. [15] X Research source Make small up-and-down movements as you cut. [16] X Research source Some confident stylists use longer, sweeping motions, but it’s safer to take your time if you’re new to cutting bangs. Keep your fingers out of the way by sliding them down your hair as you cut. Styling razors are extremely sharp, so be careful. Most professional stylists like to wet down bangs before cutting with a razor, as a razor can tug on dry hair. However, it’s easier for beginners to get the length they want if they cut their bangs dry, since wet hair will shorten as it dries."
    },
    {
      "title": "Check your bang length and graze the tips with a razor to remove bulk.",
      "content": "Check your bang length and graze the tips with a razor to remove bulk. Make sure you’re happy with the angle and length of your cut. For a wispier, more texturized look, remove excess bulk by very lightly running the razor downward over small pieces of hair, starting about 1 inch (2.54 cm) above the end of your bangs. [17] X Research source Remember that you’re trying to remove bulk, not length, so don’t apply a lot of pressure on the razor."
    },
    {
      "title": "Place the uncut hair next to the short bangs and razor cut it to match.",
      "content": "Place the uncut hair next to the short bangs and razor cut it to match. Unclip the uncut bang hair, then comb both sections of bang hair in front of your face. Grasp the piece of long bang hair that’s next to the cut bang hair, holding a ½ inch (1.27 cm) piece of it between the fingers of your non-dominant hand. Use the razor to cut it the same length as the short hair beside it. [18] X Research source"
    },
    {
      "title": "Cut the smaller section of bangs at a downward angle.",
      "content": "Cut the smaller section of bangs at a downward angle. Trim these bangs so they match the angle of the bangs you cut earlier. [19] X Research source See if your bangs are symmetrical by using both hands to hold a bang piece from each side. Slide your fingers downward; if your bangs match, your fingers will slide off both pieces of hair at the same time. [20] X Research source Remember, you can always trim shorter, but you can’t add length once the hair is cut. Take your time. Remove excess bulk by lightly grazing the blade downward over small pieces of hair, starting about 1 inch (2.54 cm) above the end of your bangs."
    },
    {
      "title": "Air dry your hair or use a blow dryer with a diffuser.",
      "content": "Air dry your hair or use a blow dryer with a diffuser. Squeeze excess moisture out of your hair by scrunching it with a t-shirt. Add a bit of leave-in conditioner or curl cream to your damp hair for best results. Wait for it to dry, or use a blow dryer with a diffuser attachment ; diffusing your hair minimizes frizziness. [21] X Research source Starting with freshly washed and dried hair makes the curls easier to separate."
    },
    {
      "title": "Section your bang hair with a part that goes from ear-to-ear.",
      "content": "Section your bang hair with a part that goes from ear-to-ear. Create a part that runs parallel to your hair line. Begin the part at the front of one ear and curve it over your head to the top of the other ear. You can do this with your fingers or with a wide-tooth comb . Tie the rest of your hair back. [22] X Research source Dry-cutting curly hair is recommended because the curls shrink a lot once they dry. [23] X Research source It’s also easier to identify and separate ringlets when your hair is dry."
    },
    {
      "title": "Cut curl groupings individually.",
      "content": "Cut curl groupings individually. Finger-comb your hair, separating the curls into their natural ringlets or groupings. Use styling shears or sharp scissors to cut the shortest curl grouping, holding the ringlet lightly between your fingers–you don’t want to stretch it out, or it will be difficult to tell how short the curl will be. [24] X Research source To decide how short to cut, think about how you plan to wear your hair. Do you want diagonal bangs that rest mainly on your forehead, or do you want them to be long enough to sweep behind your ear? For shorter diagonal bangs, make your shortest curl even with the bottom of your eyebrows. For longer side bangs that blend into long hair, make the shortest curl even with the bridge of your nose. [25] X Research source When in doubt, opt for longer bangs. You can always shorten them later."
    },
    {
      "title": "Continue to cut curl groupings so they slant downward.",
      "content": "Continue to cut curl groupings so they slant downward. The longest ringlet will be on the opposite side of your face from your shortest ringlet. [26] X Research source The angle doesn’t need to be completely uniform; you may like the more natural appearance of having some ringlets be slightly longer or shorter. As long as the overall shape of your bangs is at a downward slant, it will look great. Wear your new diagonal bangs for a day or two, then wash your hair before deciding whether to shorten your bangs further. You'll have a better idea of how your bangs naturally lay if you live with them for a few days first. [27] X Research source"
    }
  ]
}