{
  "url": "https://www.wikihow.com/Format-eBooks",
  "title": "How to Format eBooks",
  "steps": [
    {
      "title": "Set indentations and line spacing.",
      "content": "Set indentations and line spacing. Since, in a lot of eBook platforms like Kindle, the tab indent does not convert, you'll need to set your indentations in Word or whatever word processing software you're using. You should apply your font formatting changes to your \"Normal\" type so it is the default. Using Word, click the Home tab, right-click the \"Normal\" style and click Modify . When you're editing the \"Normal\" style, click Paragraph and make the following changes: Click Special under \"Indentation\" then set \"First Line\" to 0.2\" (5 mm). Under \"Spacing,\" set \"Before\" and \"After\" to 0 pt and \"Line Spacing\" to \"Single.\" Click OK to save your changes and set the \"Normal\" style in Word."
    },
    {
      "title": "Format chapter titles.",
      "content": "Format chapter titles. Make sure they are larger and easier to see so when you add them to the table of contents later, you don't skip any. If you're using Word, you can use the default \"Heading 1\" style for your chapter titles."
    },
    {
      "title": "Add front and back elements.",
      "content": "Add front and back elements. Aside from the meat of your book that includes all the text, you could also leave a few pages for the cover, the copyright page, dedication page, and bibliography. You can get ideas for these pages by performing a quick internet search or by using Kindle Create, which you can download from https://www.amazon.com/Kindle-Create/b?ie=UTF8&node=18292298011 ."
    },
    {
      "title": "Add page breaks.",
      "content": "Add page breaks. Since eBooks are generally fluid and don't specifically have pages, you can force a page break if you want to separate your text on a new page. For Word, you can place your cursor where you want to insert the page break, then go to the Insert tab and click Page Break . You'll most likely want to insert a page break before the beginning of each chapter, so the chapters don't flow on the same page."
    },
    {
      "title": "Create a table of contents (if you don't want to use Kindle Create).",
      "content": "Create a table of contents (if you don't want to use Kindle Create). When you use Kindle Create, the software will suggest chapter titles as it finds them. Make sure all the chapter contents are set to the \"Heading 1\" style to continue. If you want to do it yourself in Word, click the References tab and Table of Contents . Select Automatic Table 1 . Select Table of Contents again from the References tab and select Custom Table of Contents . Clear the text field next to \"Show Page Numbers\" and set \"Show levels\" to \"1\" and click OK . A window should pop-up asking if you want to replace the table of contents you have already. Click Yes . So far, you should have a list of contents of every chapter title you set to Heading 1 in Word. Next, highlight the title \"Contents\" and click the Insert tab and click Bookmark in the \"Links\" section. In the \"Bookmark name\" field enter \"toc\" and click Add . Now your chapters should be hyper-linked to their places within the book. Finally, insert a page break after your table of contents."
    },
    {
      "title": "Preview your book.",
      "content": "Preview your book. You can use Kindle Previewer , a free desktop application, to see how your eBook will look on tablets, Kindle E-readers, and phones. You can save your file from Word as a .doc or .docx and upload it to your Bookshelf in Amazon if you want to create the eBook without using Kindle Create. [1] X Research source"
    }
  ]
}