{
  "url": "https://www.wikihow.com/Do-Pranayam",
  "title": "5 Pranayama Breathing Techniques for Beginners",
  "steps": [
    {
      "title": "Sit in a comfortable position.",
      "content": "Sit in a comfortable position. When first learning the ujjayi breathing pattern, begin in a position that takes little effort to hold. This allows you to focus on your breath rather than your body. Try sitting in an easy cross-legged position with your spine long and shoulders rolled back. You can also sit on a yoga block or chair if that feels better. [1] X Research source If sitting up is uncomfortable, lie flat on your back. The ujjayi breathing pattern is often used in hatha yoga to cultivate heat, balance, and focus."
    },
    {
      "title": "Inhale slowly through your nose.",
      "content": "Inhale slowly through your nose. Close your lips. Then, inhale slightly deeper than you normally would, filling your lungs fully. Direct the breath across the back of your throat as you inhale so the air makes a slight hissing sound. [2] X Research source Mimic the sound of the ocean with your breath. Imagine the water receding from the shore to form the next wave. Count as you inhale to measure the length of your breath. Although there is no “correct” length, start by aiming for a count of 4 or 5. Keep your inhales and exhales evenly timed as you go."
    },
    {
      "title": "Exhale slowly through your nose while constricting your throat.",
      "content": "Exhale slowly through your nose while constricting your throat. Keeping your lips sealed, breathe out through your nose. Try to tighten the muscles in the back of your throat, just as you would if you were whispering. As you exhale, your breath should make a noise similar to waves crashing on the shore. [3] X Research source Be careful not to overly constrict your throat to the extent that breathing becomes difficult. If you’re having trouble making the correct ujjayi sound, practice opening your mouth and making a “HAAAAAH” sound as if trying to fog up a mirror with your breath. Then, close your mouth and attempt to make a similar sound through your nasal passages. Try to match the length of your exhale to the length of your inhale. You may need to count in your head to ensure your breaths remain even."
    },
    {
      "title": "Continue to inhale and exhale for 5 to 8 minutes.",
      "content": "Continue to inhale and exhale for 5 to 8 minutes. Ujjayi breathing is a great way to soothe your nerves or agitation. Aim for at least 5 minutes each session, and once you become more experienced, you can gradually increase your practice to 10 to 15 minutes. [4] X Research source Stop and resume normal breathing if you become dizzy or short of breath during your practice."
    },
    {
      "title": "Sit comfortably with your left hand resting on your lap.",
      "content": "Sit comfortably with your left hand resting on your lap. Try sitting in an easy cross-legged position on the ground with your back straight, shoulders back, and chest forward. Place your left hand on your lap or knee to help ground yourself. [5] X Research source If this sitting position is uncomfortable for you, rest on top of a yoga block or chair. Consider connecting your thumb and pointer finger to form an “okay” gesture to create a calming mudra. [6] X Research source Nadi shodhana pranayama is believed to help quiet your mind and ease tension, especially while meditating."
    },
    {
      "title": "Close your right nostril with your right thumb.",
      "content": "Close your right nostril with your right thumb. Rest your index and middle fingers on your forehead (between your eyebrows), or fold them and rest your knuckles just below your nose. Then, place your thumb on the slight indentation below the bone at the top of your nose. [7] X Research source"
    },
    {
      "title": "Inhale through your left nostril.",
      "content": "Inhale through your left nostril. Breathe in slowly and steadily through your nose. To ensure your inhales and exhales are consistent, try counting to 4 or 5 as you inhale. [8] X Research source You can increase the length of your breaths as you become more experienced with pranayam."
    },
    {
      "title": "Close your left nostril using your right ring finger and release your right nostril.",
      "content": "Close your left nostril using your right ring finger and release your right nostril. At the top of the inhale, use the inside of your right ring finger to block your left nostril so both nostrils are closed gently. Retain your breath here for a slight pause. Then, release your thumb from your right nostril so only your left nostril is blocked. [9] X Research source If your pointer and middle fingers are resting bent below your nose, it may be easier to bend your ring and pinky fingers as well. Do whatever feels best for you."
    },
    {
      "title": "Exhale and inhale through your right nostril.",
      "content": "Exhale and inhale through your right nostril. Exhale through your right nostril and pause for just a moment. Then, inhale through your right nostril without moving your hand position. Try to match the length of your exhale to the length of your inhale. Counting to 4 or 5 as you exhale can help with this."
    },
    {
      "title": "Switch to block your right nostril and exhale through your left nostril.",
      "content": "Switch to block your right nostril and exhale through your left nostril. Lightly block your right nostril, unblock your left nostril, and then complete a full exhale through your left nostril. This constitutes one cycle of the pranayama. [10] X Research source Repeat this process 3 to 5 times before returning to regular breathing."
    },
    {
      "title": "Sit in a comfortable position, and bring your left hand to your belly and right hand to your chest.",
      "content": "Sit in a comfortable position, and bring your left hand to your belly and right hand to your chest. Roll your shoulders back and sit up straight. Then, place your left hand slightly below your belly button and your right hand on the middle of your chest (above your nipples but below your collarbone). [11] X Research source If sitting up isn’t comfortable for you, try this breathing technique lying flat on a yoga mat or couch. Dirga pranayama is said to help reduce stress and help you feel grounded. It’s a particularly good technique to use to relax before bed. [12] X Research source"
    },
    {
      "title": "Inhale through your nose, bringing the air into your abdomen, rib cage, and upper chest.",
      "content": "Inhale through your nose, bringing the air into your abdomen, rib cage, and upper chest. As you inhale, use your hands to feel your abdomen filling with air. Then, feel the air move into your ribs as your lungs fill. Finally, allow your breath to lift up into your chest. [13] X Research source Each part of your abdomen and chest will lift as you breathe into it, which can help you feel the air’s movement. Try visualizing each section of your body (abdomen, ribs, upper chest) as you breathe into it."
    },
    {
      "title": "Exhale from your upper chest, ribs, and then abdomen.",
      "content": "Exhale from your upper chest, ribs, and then abdomen. Breathe out through your nose. As you do so, allow your collarbone to deflate and relax, followed by your rib cage and abdomen. Use your hands to feel the progression as each part of your chest falls with the exhale. [14] X Research source Try counting with each inhale and exhale to ensure that you’re inhaling and exhaling for equal amounts of time. Start with a count of 4 and then work your way up. Repeat this three-part breath pattern for 3 to 5 minutes or until you feel relaxed."
    },
    {
      "title": "Sit in a comfortable position and inhale deeply to prepare.",
      "content": "Sit in a comfortable position and inhale deeply to prepare. Try an easy cross-legged position on the ground to begin. If that is uncomfortable, place a yoga block under your bottom or sit in a chair instead. No matter how you choose to sit, keep your spine straight and your shoulders rolled back. [15] X Research source Kapalabhati is said to help release toxins from the body, and the technique must be practiced in a seated pose (rather than a lying position) because it requires you to constrict your stomach muscles. [16] X Research source"
    },
    {
      "title": "Suck in your lower belly quickly to push a sharp burst of air through your nose.",
      "content": "Suck in your lower belly quickly to push a sharp burst of air through your nose. Pull your abdomen inward to force the air from your lungs with an active and forceful breath. [17] X Research source Avoid using your chest, shoulders, neck, or face to create a forceful breath. [18] X Research source Place your hands on your lower belly to ensure that you’re using the correct muscles. If you’re having trouble activating the lower abdomen, try cupping one hand lightly in the other and pressing it gently and quickly against your lower belly. [19] X Research source"
    },
    {
      "title": "Release the contraction to let the inhale in.",
      "content": "Release the contraction to let the inhale in. After the sharp contraction of your lower abdomen pushes the air out of your lungs, quickly relax your muscles. This allows the breath to flow back into your lungs naturally, recoiling or rebounding from the force of the exhalation. The inhalation, in contrast to the exhalation, should be smooth and effortless. [20] X Research source Always keep your lips sealed and inhale through your nose throughout your kapalabhati practice."
    },
    {
      "title": "Repeat this breath cycle 11 times before taking a break to breathe normally.",
      "content": "Repeat this breath cycle 11 times before taking a break to breathe normally. Pace yourself slowly if you’re just beginning, and aim for about 1 exhale-inhale cycle every 1 to 2 seconds. As you become more experienced with the practice, try increasing your pace to 2 exhale-inhale cycles per second. [21] X Research source If you become dizzy or lightheaded or get a stitch in your side during kapalabhati practice, pause and breathe normally for a minute or two. [22] X Research source Generally, try to complete 3 rounds of 11 breaths in each sitting; however, you can do less than 3 if that feels right for you. [23] X Research source"
    },
    {
      "title": "Kneel on the floor, sitting back on your heels.",
      "content": "Kneel on the floor, sitting back on your heels. Place a cushion, blanket, or yoga mat beneath you to cushion your knees. [24] X Research source Set your palms firmly against your knees or on the floor with your fingers splayed out. [25] X Research source Try crossing the front of one ankle over the back of the other if that’s more comfortable for you. If sitting on your knees isn’t comfortable, try this pranayama practice in a cross-legged position. Simhasana is a practice meant to help you blow off steam, release tension, and alleviate stress."
    },
    {
      "title": "Inhale deeply through your nose.",
      "content": "Inhale deeply through your nose. Close your eyes, and draw breath through your nostrils until your lungs are full. Lengthen through the crown of your head and draw your shoulders back as you inhale to ensure your lungs are completely expanded. [26] X Research source"
    },
    {
      "title": "Open your mouth, stretch your tongue out, and exhale.",
      "content": "Open your mouth, stretch your tongue out, and exhale. After you inhale, open your mouth wide as if you were at the dentist. Stick out your tongue and lengthen the tip out and down so it extends towards your chin. [27] X Research source Exhale by making a “haaaa” sound or imagining you’re fogging up a window with your breath. [28] X Research source For a more intense option, open your eyes wide and look upward while you open your mouth. [29] X Research source Press down through your palms as you exhale to ground yourself to the earth. [30] X Research source Repeat this process 2 to 3 times or until you feel you’ve released all your negative energy."
    }
  ]
}