{
  "url": "https://www.wikihow.com/Enable-Cookies-in-Firefox",
  "title": "How to Enable or Disable Cookies in Mozilla Firefox",
  "steps": [
    {
      "title": "Launch the Mozilla Firefox app.",
      "content": "Launch the Mozilla Firefox app. This looks like an orange fox holding a purple globe. Currently, there's no way to allow cookies for specific websites on the mobile app, so you'll need to disable Firefox's Enhanced Tracking Protection ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . This will be at the bottom-right corner. A pop-up menu will open."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . You can find this at the bottom of the menu."
    },
    {
      "title": "Tap Tracking Protection.",
      "content": "Tap Tracking Protection . This will be underneath the Privacy header. You may need to scroll down to find it. By default, this should be set to Standard ."
    },
    {
      "title": "Toggle off \"Enhanced Tracking Protection\".",
      "content": "Toggle off \"Enhanced Tracking Protection\". This will enable cookies. When you're finished visiting the website, be sure to toggle the switch back on to enable Enhanced Tracking Protection again. This will help protect your browsing privacy."
    },
    {
      "title": "Launch Mozilla Firefox.",
      "content": "Launch Mozilla Firefox . This looks like an orange fox holding a purple globe. Some cookies are designed to track you for advertising and other purposes. Enabling all cookies could harm your privacy online. Be sure to only allow cookies for trusted websites to stay safe ."
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . You can find this in the top-right corner. A drop-down menu will open."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This is towards the bottom of the menu, below Zoom ."
    },
    {
      "title": "Click Privacy & Security.",
      "content": "Click Privacy & Security . This is in the left panel, underneath Search ."
    },
    {
      "title": "Click Custom.",
      "content": "Click Custom . The circle will be bubbled in."
    },
    {
      "title": "Uncheck \"Cookies\".",
      "content": "Uncheck \"Cookies\". This will stop Firefox from blocking cookies. [1] X Research source If you're worried about tracking cookies, keep Cookies checked, but select Cross-site tracking cookies, and isolate other cross-site cookies from the drop-down menu. To disable cookies again, check the box for Cookies , or select Standard under Enhanced Tracking Protection . You can also clear your cookies and history at any time."
    },
    {
      "title": "Enable cookies for one website (optional).",
      "content": "Enable cookies for one website (optional). If you only want to enable cookies on a specific website, you'll need to add an exception. Do the following: Go to the Privacy & Security menu. Scroll down to the Cookies and Site Data section. Click Manage Exceptions… Enter the website's address into the field. Click Allow for Session or Allow . Click Save Changes ."
    }
  ]
}