{
  "url": "https://www.wikihow.com/Get-Perfect-Eyebrows",
  "title": "How to Get Perfect Eyebrows",
  "steps": [
    {
      "title": "Find the place where your brows should begin.",
      "content": "Find the place where your brows should begin. Finding just the right spot for your inner brows to start is key to creating perfect brows, since starting too far in could throw off the balance of your face. [1] X Research source To figure out where your inner brows should start, use the following technique: As a general starting point, take a pencil or other long, thin instrument and line it up vertically with outer edge of the tip and bridge of your nose. The place where the instrument overlaps your brow is where it should begin. Mark the spot by making a dot there with an eyeliner pencil. Repeat on the other side. However, if you have close-set eyes, space your brows a bit farther apart to the total extent the space between your eyes is smaller than an eye on both sides. If you have wide-set eyes, space your brows a little closer together to the extend this space is wider. This helps to balance your features. If you're not sure what will look best, consider visiting a trained esthetician for a brow mapping session. The esthetician will use your eyes and nose as guides to create brows that will frame and accentuate your features. [2] X Expert Source Karina Villalta Certified Esthetician Expert Interview. 11 August 2020."
    },
    {
      "title": "Find the spot where your eyebrow arch should peak.",
      "content": "Find the spot where your eyebrow arch should peak. Most eyebrows naturally arch around the eye, and finding the place where the arch peaks is essential to making them look perfect. Use the same long, thin instrument to figure out where your arch should peak by following this technique: [3] X Research source Look straight ahead in the mirror and line up the instrument with the outer edge of the tip of your nose and the outer edge of your iris. The place where the instrument crosses your brow is where your arch should peak. Mark it with a dot using an eyeliner pencil. Repeat on the other side. If you have a round face, aim for a more angular brow. Alternatively, choose a softly rounded brow if you have a square or oblong face."
    },
    {
      "title": "Determine where your brow should end.",
      "content": "Determine where your brow should end. Finding the right place for brow to end is as important as where it begins. You want your brows to frame your eyes gracefully. Find the right spot by lining up the long, thin instrument in this way: [4] X Research source Line up the instrument from the outer tip your nose to the outer corner of your eye. The place where the instrument crosses your outer brow is the place where it should end. Mark the spot with a dot using an eyeliner pencil. However, if you have a long face, extend your brows out a little further. If you have a wide face, the outer ends of your brows should be thinner and more delicate."
    },
    {
      "title": "Decide how thick you want your brows to be.",
      "content": "Decide how thick you want your brows to be. Perfect eyebrows for someone else may not be perfect eyebrows for you. Sometimes thick, bushy eyebrows are in style, and sometimes more people prefer them to be thin and well-tailored. Think about what style you're going for before you dive into plucking your brows. The thickness of your eyebrows is a personal decision that should be influenced by the following factors: The size of your eyes. If your eyes are on the bigger side, thicker brows can help balance them out. If they're small, thick brows might overshadow them, so you'll want to choose a brow thickness that's slightly thinner. The size of your lips. A good general rule of thumb is that your eyebrows should be about the same thickness as your upper lip. This can help 'tie the look together'. If you look at pictures of models in magazines than you'll notice this is the case with many of them. The distance between your brows and your eyes. If you have a low brow bone that is set close to your eyes, you'll want to pull up your brows a bit to lighten the area. If you have a high brow line spaced well above your eyes, heavier brows might provide a more balanced look. However, you should avoid tweezing the hair above your brows, rather than below, to create less space above the brows."
    },
    {
      "title": "Brush your brow hairs up.",
      "content": "Brush your brow hairs up. Take a small eyebrow brush or a fine-toothed comb and brush the hairs up in the direction they grow. [5] X Expert Source Ashleigh Grounds Makeup Artist & Hair Stylist Expert Interview. 22 April 2020. This will make it easier to figure out which hairs need to be plucked."
    },
    {
      "title": "Outline the desired shape of your brows.",
      "content": "Outline the desired shape of your brows. If you have random hairs below or to the sides of the your brows, you’ll want to remove them. Connect the dots you drew when determining the desired shape of your brows. If you have practice tweezing your eyebrows, you could draw the outline freehand using an eyebrow pencil. Alternatively, you can get an eyebrow stencil from a beauty supply store or online and trace the stencil with an eyebrow pencil."
    },
    {
      "title": "Tweeze",
      "content": "Tweeze the hairs outside the outline. Now it's time to start shaping your brows according to the plans you laid out. Make sure you're in a well-lit area so that you don't accidentally tweeze too much. Hold the skin taut, grasp each hair firmly with the tweezers, and pluck 1 hair at a time in the direction they grow. [6] X Research source Start with the inner brow, closest to your nose. Use the tweezers to pluck the hairs that are closer to your nose than the dot. Tweeze the hairs that fall outside the dot on your outer brow. Tweeze hairs above and below the arch area. Look at the place where your arch should peak and carefully tweeze around it to make the peak slightly more prominent. Tweeze the bottom of the brow. Pluck stray hairs under your brow and shape the bottom. If you decided you want thick brows, stop after plucking the hairs that grow outside the brow. If you want thinner brows, carefully pluck the underside of the brow to lighten it up."
    },
    {
      "title": "Tweeze the other brow.",
      "content": "Tweeze the other brow. Now that you've shaped the first one, take extra care to make sure the other brow matches it in shape and size. Use the same method to tweeze the hairs on the inside of the inner brow dot, the outside of the outer brow dot, around the arch peak, and on the underside of the brow. Examine both brows in the mirror to make sure they are even. Keep in mind that eyebrows are never exactly symmetrical, but they should arch in the same place and be as even as possible. [7] X Research source"
    },
    {
      "title": "Don't over-tweeze.",
      "content": "Don't over-tweeze. Avoid the temptation to keep tweezing hairs in order to create 2 perfectly even brows. You risk plucking away too much hair. Eyebrow hair can take 6 - 8 weeks to grow back, and sometimes it's gone for good. Take care of the hair you have. Over-tweezing, waxing, or threading can thin your brows permanently. [8] X Expert Source Karina Villalta Certified Esthetician Expert Interview. 11 August 2020."
    },
    {
      "title": "Fill in the brows",
      "content": "Fill in the brows . Take an eyebrow pencil in a shade close to that of your brows and make light strokes in the direction that your hair grows to help fill out your look. Eyebrow hair doesn't usually grow completely evenly, so filling in the gaps is a necessity for creating the perfect brows. [9] X Research source Don't create an arch where there isn't one, or try to lengthen your brows with a pencil. It will be too obvious that you drew extra parts. For the most natural look, select an eyebrow pencil 1 or 2 shades lighter than the natural color of your brows. For a heavier look, choose an eyebrow pencil that's a shade or 2 darker than your natural brow shade."
    },
    {
      "title": "Use a brow comb.",
      "content": "Use a brow comb. Gently comb them into shape so that no hairs are poking up in the wrong direction. If you filled in your brows with pencil, take care not to smudge it when you comb your brows."
    },
    {
      "title": "Apply brow gel.",
      "content": "Apply brow gel. This helps your brows stay in place all day, and prevents them from getting messy under windy conditions. Apply a dab to the inner part of your brow and either smooth it to the outer part of your brow with the tip of your finger or use the brow brush to comb it in. If you don't have brow gel, you can use hairspray instead. Spray your finger with hair spray and wipe it across your brow. You can also use a dab of petroleum jelly in place of brow gel."
    }
  ]
}