{
  "url": "https://www.wikihow.com/Famous-Cults",
  "title": "18 Infamous Cults & Cult Leaders Around the World",
  "steps": [
    {
      "title": "The Peoples Temple resulted in a mass suicide of its followers.",
      "content": "The Peoples Temple resulted in a mass suicide of its followers. The Peoples Temple was founded by Jim Jones in 1954, combining elements of Christianity, communism, and socialism. The group held overtly political beliefs, which led to increased tension and the group’s eventual move to Jonestown, a commune in Guyana. As Jones became more paranoid of the outside world, he convinced his followers to commit mass suicide by drinking cyanide-laced grape Flavor Aid, leading to the deaths of 918 people, including Jones. [1] X Research source Leader: Jim Jones Beliefs: The Peoples Temple believed in socialism, egalitarianism, and racial equality. Accusations: Many followers did not want to participate in Jones’s mass suicide but were killed anyway. Temple security guards also killed US representatives who came to Jonestown to investigate claims of abuse. Charges: Because Jones died, no charges were made."
    },
    {
      "title": "The Manson Family was a commune and cult led by Charles Manson.",
      "content": "The Manson Family was a commune and cult led by Charles Manson. Charles Manson created the Manson Family in California in the 1960s. His followers were mostly young women who believed he was a reincarnation of Jesus. Manson taught that a race war was coming and convinced his followers to kill people in order to provoke it. The Manson Family killed a total of nine people in separate attacks, including actress Sharon Tate. [2] X Research source Leader: Charles Manson Beliefs: The Manson Family believed that Manson was a manifestation of Jesus Christ and that his prophecies foretold an impending apocalyptic race war. Accusations: Manson convinced his followers to kill a confirmed 9 people, and it’s possible they killed up to 24. Charges: Manson was convicted of nine counts of first-degree murder and was imprisoned until his death in 2017. Other members of the cult are still in prison."
    },
    {
      "title": "Heaven’s Gate was a religious movement that resulted in a mass suicide.",
      "content": "Heaven’s Gate was a religious movement that resulted in a mass suicide. In the early 1970s, Marshall Applewhite and Bonnie Nettles went around the country, gathering followers they called “the crew.” The group believed the Earth was about to be wiped out and the only chance for survival was to leave it. After Nettles’s death, Applewhite continued to lead the group and, in 1997, convinced 38 followers to kill themselves so they could leave their “earthly vessels” behind and escape Earth’s impending doom. [3] X Research source Leaders: Marshall Applewhite, Bonnie Nettles Beliefs: The central belief of the group was that followers could transform themselves into immortal extraterrestrial beings and transcend into the “Next Level” or “The Evolutionary Level Above Human.” They believed they would ascend to Heaven in a UFO. Accusations: Applewhite convinced 38 members to kill themselves by mixing phenobarbital with applesauce and washing it down with vodka. He and three others also committed suicide, bringing the death toll to 42. Charges: No charges were made for any crimes."
    },
    {
      "title": "The Branch Davidians were a Christian cult founded in 1955.",
      "content": "The Branch Davidians were a Christian cult founded in 1955. Founded by Benjamin Roden, the Branch Davidians considered themselves as a continuation of the Seventh-Day Adventists. After leader David Koresh took over in 1987, the group abandoned most of their existing beliefs and adopted the idea that the end of the world was near. The group took over a compound in Waco, Texas, where Koresh kept underage “spiritual wives” and was believed to stockpile weapons. The National Guard raided the compound in 1993, and after federal agents launched tear gas, the compound caught fire, leading to the deaths of 82 people, including Koresh. [4] X Trustworthy Source U.S. Bureau of Alcohol, Tobacco, and Firearms U.S. federal law enforcement agency dealing with crimes related to firearms and alcohol and tobacco products Go to source Leader: David Koresh Beliefs: The Branch Davidians believed the apocalypse was near and that living prophets would interpret the Bible to prepare for the end times. Koresh believed he was the Messiah and that his offspring would be holy as well. Accusations: Koresh was accused of sexual abuse and possessing illegal weapons. Charges: After the fire, a federal grand jury indicted 12 surviving members, charging them with aiding and abetting in the murder of federal officers and unlawful possession of firearms. Eight were convicted on firearm charges, five on voluntary manslaughter, and four were acquitted of all charges."
    },
    {
      "title": "The Love Has Won cult believed their leader was a divine being.",
      "content": "The Love Has Won cult believed their leader was a divine being. The Love Has Won (or the Galactic Federation of Light) cult was founded by Amy Carlson (“Mother God”) in 2006. Carlson described herself as the creator of the universe and believed she had been reincarnated 534 times. The group adopted elements of QAnon conspiracy theories and gained new followers by promoting New Age products on YouTube livestreams. The group dissolved after Carlson’s death in 2021, when her body was discovered in a makeshift shrine in the cult’s mission house. [5] X Research source Leader: Amy Carlson (known to followers as Mother God) Beliefs: Carlson created the universe and would lead 144,000 people into a mystical 5th dimension, and tragedies such as the Holocaust, 9/11, and the Sandy Hook massacre were hoaxes. Accusations: Ex-members accused the group of sleep deprivation and physical abuse, and outsiders accused the group of brainwashing and fraud, as they offered “etheric surgery” they claimed would remove sickness and negative energy from the body. Charges: After Carlson’s death, seven members of the group were charged with abuse of a corpse and two counts of child abuse. There was no foul play suspected with Carlson’s death, as it was possibly due to alcohol abuse, anorexia, and/or chronic colloidal silver ingestion."
    },
    {
      "title": "School of Prophets was a polygamist cult.",
      "content": "School of Prophets was a polygamist cult. Ron and Dan Lafferty were two brothers who committed a double murder in the name of God. They were a part of a small Mormon splinter group called the School of Prophets, led by Robert C. Crossfield (known by his prophet name “Onias”). After joining the group, Ron claimed God had sent him revelations about their brother Allen’s wife, Brenda, and he and Dan went on to kill Brenda and her infant daughter in 1984. The School of Prophets was not directly involved with the murder. [6] X Research source Leader: Robert C. Crossfield (not involved with the murder) Beliefs: The School of Prophets followed Mormon beliefs, such as communication with God and polygamy Accusations: While the School of Prophets was not involved in the murder, the Laffertys became religious extremists upon joining, leading them to kill Brenda because of her opposition to polygamy. Ron used his religious beliefs to justify the crime. Charges: Ron Lafferty was sent to Utah’s death row and died there in November 2019. Dan is serving a life sentence."
    },
    {
      "title": "NXIVM was an abusive sex cult.",
      "content": "NXIVM was an abusive sex cult. NXIVM was founded in 1998 by now-convicted racketeer and sex offender Keith Raniere. It began as a personal development company offering “Executive Success Programs” and techniques for self-improvement. In 2017, it was revealed that female members were allegedly called slaves, branded with Raniere’s initials, and subjected to corporate punishment. In 2018, Raniere was arrested and indicted for charges related to sex trafficking and conspiracy to commit forced labor. [7] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source Leader: Keith Raniere Beliefs: NXIVM had students recite a “Twelve-point Mission Statement,” in which they pledged to “purge” themselves of envy-based habits, enroll others in the program, and control as much money as possible. Accusations: NXIVM contained a secret society called “DOS,” in which female members were forced into sexual slavery. Charges: Raniere was charged and convicted in June 2019 for racketeering, racketeering conspiracy, sex trafficking, attempted sex trafficking, sex trafficking conspiracy, forced labor conspiracy, and wire fraud conspiracy. Other members, including actress Allison Mack, were also charged for their roles in the cult."
    },
    {
      "title": "Rajneeshpuram was a religious intentional community.",
      "content": "Rajneeshpuram was a religious intentional community. After gaining thousands of followers in the 1970s, Indian mystic Bhagwan Shree Rajneesh founded Rajneeshpuram in Wasco County, Oregon. Rajneesh preached a “religious-less religion” that embraced sexual liberation and was hostile toward Hindu and Christian morality. Rajneesh and his followers wanted to take over the nearby town of Antelope and the county seat of Dalles. This eventually led to an assassination plot on U.S. Attorney Charles H. Turner and the United States’ first recorded bio-attack intended to influence the outcome of a local election. [8] X Research source Leader: Bhagwan Shree Rajneesh Beliefs: Rajneeshpuram residents believed the wider Oregonian community was bigoted and religiously intolerant. Accusations: In 1984, several residents planned, organized, and executed a bioterrorism attack, poisoning the salad bars at 10 restaurants in Wasco County. The goal was to decrease voter turnout so Rajneeshpuram candidates would win the election. They also conspired to assassinate Charles H. Turner. Charges: Rajneesh was deported, and several members of his staff were convicted for orchestrating a food-poisoning scheme against locals."
    },
    {
      "title": "Leader Daniel Perez murdered his followers to collect their life insurance money.",
      "content": "Leader Daniel Perez murdered his followers to collect their life insurance money. Cult leader Daniel Perez was a self-proclaimed “seer” and “thousand-year-old angel” who led a group of mostly women from state to state for 15 years. He told his followers that he needed to have sex with young girls to stay alive. Over the years, Perez collected millions of dollars from deceased followers’ life insurance policies, and he was eventually arrested for suspicion of murder after 26-year-old Patricia Hughes drowned on the group’s compound (Angels’ Landing) outside of Wichita, Kansas. [9] X Research source Leader: Daniel Perez Beliefs: Perez convinced his followers that he was a seer and an angel who must have sex with young girls to stay alive. Accusations: Perez was accused and convicted of murdering his followers in order to receive their life insurance policies, as well as rape and assault. Charges: Perez was convicted of 28 crimes following his 2015 trial, including first-degree murder, rape, aggravated assault, and sexual exploitation of a child. He was sentenced to life in prison."
    },
    {
      "title": "The Children of God’s leader encouraged the sexual abuse of children.",
      "content": "The Children of God’s leader encouraged the sexual abuse of children. The Children of God (aka the Family International, Teens for Christ, The Family of Love, and The Family) was founded in Huntington Beach, California, by David Brandt Berg in 1968. They used a method of evangelism called “flirty fishing,” in which female members would recruit members through sex. Berg also encouraged members to sexually assault children who had reached puberty because God “created them to have children” by that age. At the height of its movement, the cult had tens of thousands of members, including River and Joaquin Phoenix, Rose McGowan (all of whom were children and weren’t involved as adults), and Jeremy Spencer (who is still a part of the organization). [10] X Research source Leader: David Brandt Berg Beliefs: The group spread messages of salvation, apocalypticism, spiritual “revolution and happiness,” and distrust of the outside world. Berg believed sex should be used to show God’s “love and mercy.” Accusations: Several members say they were sexually assaulted and beaten as children Charges: No charges have been made. The group still exists today, but after Berg’s death in 1984, they have tried to distance themselves from his endorsement of pedophilia."
    },
    {
      "title": "Aum Shinrikyo was a Japanese doomsday cult.",
      "content": "Aum Shinrikyo was a Japanese doomsday cult. Aum Shinrikyo was founded by Shoko Asahara in 1984. The group attracted young, elite university students and graduates and convinced them that the apocalypse was near and they would be the only ones to survive. In 1995, members carried out a gas attack in the Tokyo subway system, likely in an attempt to bring about the apocalypse. 13 people died, and thousands were injured. [11] X Research source Leader: Shoko Asahara Beliefs: Aum Shinrikyo started out as a yoga and meditation class but came to be a religion for the “elite.” They believed the apocalypse was near and only the elite would survive. Accusations: In addition to carrying out a gas attack on the Tokyo subway system, they were also responsible for the Matsumoto sarin attack the following year. Asahara claimed he was not involved. The group was also accused of holding members against their will and forcing them to donate money. Charges: 13 members of the group, including Asahara, received death sentences for the subway gas attack and were hanged in 2018. The cult still exists today in various offshoots like Aleph and Hikari no Wa."
    },
    {
      "title": "Matamoros was a human sacrifice cult.",
      "content": "Matamoros was a human sacrifice cult. In 1989, Mexican authorities found the remains of 12 male bodies near the U.S. border, later finding three more. Five drug smugglers were arrested in connection with the murder, claiming they thought the human sacrifices would protect their smuggling operations. The leaders of the cult were later revealed to be Adolfo de Jesús Constanzo and Sara Aldrete, who fled to Mexico City with three other followers. Constanzo instructed a follower to kill him to avoid arrest. [12] X Research source Leaders: Adolfo de Jesús Constanzo and Sara Aldrete Beliefs: The Matamoros cult believed human sacrifice would protect their drug smuggling operations. This evolved from Constanzo’s practice of Palo Mayombe, a religion that involves animal sacrifice. Accusations: The cult was responsible for the deaths of at least 15 people. Charges: 14 cult members were arrested for a range of crimes, including murder, drug-running, and the obstruction of justice. Aldrete and members Elio Hernández Rivera and Serafín Hernández García were convicted of multiple murders and were each sentenced to over 60 years in prison."
    },
    {
      "title": "The Order of the Solar Temple caused many mass deaths of its followers.",
      "content": "The Order of the Solar Temple caused many mass deaths of its followers. Founded by Joseph Di Mambro and Luc Jouret in 1984, the Order of the Solar Temple was a New Age spiritual group that drew members from Switzerland, France, and Canada. The group became more doomsday-focused, and Canadian authorities began investigating them for accusations of sexual misconduct. In 1994, Di Mambro ordered the murder of a family of ex-members before orchestrating mass suicide and mass murder on two Temple communes in Switzerland. [13] X Research source Leaders: Joseph Di Mambro and Luc Jouret Beliefs: The group contained many ritualistic elements and believed in the ascended master figures of Theosophy, who they believed to reside on the star Sirius. Accusations: The group was accused of sexual misconduct and arms trafficking. Charges: All high-ranking members of the group died, so composer Michel Tabachnik was tried after the second mass suicide due to his involvement with Di Mambro. He was acquitted twice and found to be innocent on all counts."
    },
    {
      "title": "A Russian cult leader convinced followers to hide in a cave for the apocalypse.",
      "content": "A Russian cult leader convinced followers to hide in a cave for the apocalypse. This Russian doomsday cult was founded by Pyotr Kuznetsov and broke off from the Russian Orthodox Church. In 2007, about 30 members withdrew to a cave in Russia’s Penza region and said they would commit suicide if authorities intervened. Kuznetsov, who was not with them, had told them to wait there for the end of the world, which he believed was coming in 2008. After about six months, 23 members emerged, and it was revealed two had died. Kuznetsov reportedly attempted suicide when his doomsday prophecy didn’t come true. [14] X Research source Leader: Pyotr Kuznetsov Beliefs: Kuznetsov believed the world would end in 2008 and convinced his followers to believe the same. They also believed bar codes, passports, and social security numbers were satanic. Accusations: Kuznetsov did not allow his followers to watch TV, listen to the radio, or handle money. Charges: No crimes were technically committed, so no charges were made."
    },
    {
      "title": "MRTCG was a breakaway movement from the Roman Catholic Church.",
      "content": "MRTCG was a breakaway movement from the Roman Catholic Church. The group was founded in Uganda in the 1980s by Credonia Mwerinde and Joseph Kibweteere. They believed the apocalypse would occur on December 31, 1999, and to avoid damnation, all members had to abide by the Ten Commandments. When 2000 arrived, the group proposed a new doomsday date of March 17, 2000. On that day, the group gathered in a secluded church that burst into flames, killing all 530 in attendance. The police also found hundreds of other bodies in compounds across Uganda. The deaths were ruled a mass murder. [15] X Research source Leader: Credonia Mwerinde and Joseph Kibweteere Beliefs: MRTCG believed the apocalypse was near and that members had to strictly follow the Ten Commandments of the Bible to avoid damnation. Members were discouraged from talking to each other, and sex and soap were banned outright. Accusations: The deaths of the members were originally believed to be a mass suicide, but police later determined they were the result of a mass murder. Those who did not die in the fire were poisoned. Charges: Police originally believed Mwerinde and Kibweteere died but now suspect they may still be alive. They have issued an international warrant for their arrest."
    },
    {
      "title": "The Church of Scientology is a religious cult founded in the 1950s.",
      "content": "The Church of Scientology is a religious cult founded in the 1950s. Created by L. Ron Hubbard, Scientology is a set of beliefs and practices that have often been recognized as a cult , a business, a scam, and a religion. Scientologists work through courses to reach higher levels of spiritual progression and believe that traumatic events can be wiped from the mind through a process called “auditing.” Many believe Scientology takes advantage of people by charging them for auditing and courses. [16] X Research source Celebrity Scientologists include Tom Cruise, John Travolta, Danny Masterson, Elisabeth Moss, and ex-Scientologist and anti-Scientologist activist Leah Remini. Leader: L. Ron Hubbard Beliefs: Scientologists believe in reincarnation and that past lives took place on extraterrestrial planets. They regard Hubbard’s writing on the religion as scripture. Accusations: The Church of Scientology has been accused of extensive criminal activities, scamming, exploitation, and forced abortions. Charges: No charges have been made against the Church of Scientology."
    },
    {
      "title": "Gruppo del Rosario was an Italian apocalyptic cult.",
      "content": "Gruppo del Rosario was an Italian apocalyptic cult. The Gruppo del Rosario (Rosary Prayer Group) was primarily active from 1973 to 1989, though remnants of the group existed as late as 2010. In May 1988, 35 members, including leader Lidia Naccarato, were arrested for the brutal murder of a fellow member named Peter. Naccarato had received a “revelation” from God that Peter made a pact with Satan to prevent the resurrection of Naccarato’s uncle, Antonio. [17] X Research source Leader: Lidia Naccarato Beliefs: Naccarato and her uncle claimed to receive visions from God and believed that when Antonio died, he would be resurrected to rid the world of evil. They also believed female members of the group should have sex with other female members to “redeem the evil.” Accusations: Police discovered Naccarato and 34 other members wearing white robes and standing in a circle around Peter’s body. Charges: The 35 members discovered by police were arrested for murder."
    },
    {
      "title": "The Yahweh cult was a racist, anti-government group.",
      "content": "The Yahweh cult was a racist, anti-government group. Created by Michael W. Ryan in the 1980s, the Yahweh cult was founded on teachings of white supremacy, antisemitism, homophobia, and a general distrust of authority. The group believed the white race was “chosen” by God and all other people are the children of Satan. Ryan and his followers committed several burglaries and stockpiled weapons for the impending “race war.” Ryan was arrested in 1985 for the murder of a child and a 25-year-old follower. [18] X Research source Leader: Michael W. Ryan Beliefs: White supremacy, antisemitism, homophobia Accusations: Ryan was arrested for assault, and the group was accused of several burglaries. Charges: Ryan was convicted of first-degree murder in April 1986 and was sentenced to death later that year. He died of cancer in 2015 while on death row."
    }
  ]
}