{
  "url": "https://www.wikihow.com/Find-Net-Force",
  "title": "How to Find Net Force",
  "steps": [
    {
      "title": "Draw a free body diagram.",
      "content": "Draw a free body diagram. A free body diagram is a quick sketch of an object that illustrates all of the forces acting on it and the direction these forces are acting. Read through the problem and draw a simple sketch of the object in question and the arrows representing every force acting on that object. [2] X Research source For example: Calculate the net force of an object weighing 20 N sitting on a table being pushed towards the right with 5 N of force, but staying still because of a friction force of 5 N."
    },
    {
      "title": "Establish the positive and negative directions of forces.",
      "content": "Establish the positive and negative directions of forces. The standard is to set arrows pointing upward or to the right as positive and arrows pointing downward or to the left as negative. Remember, you can have multiple forces working in the same direction. Forces that oppose each other will always have opposite signs (one positive, one negative). [3] X Research source If you are working with multiple force diagrams, make sure you keep the directions consistent throughout. Label the magnitude of each force with a “+” or “-“ sign based on the direction of the arrow you’ve drawn on the force diagram. For example: The force of gravity is a downward force making it negative. The normal force is upward making it positive. The push force is to the right making it positive, while the friction force acts to oppose this force towards the left (negative)."
    },
    {
      "title": "Label all forces.",
      "content": "Label all forces. Be sure to label all of the forces that are acting on the object. When an object is resting on a surface there is a downward force of gravity (F g ) and an equal force in the opposite direction called the normal force (F n ). In addition to these two forces, label the rest of the forces stated in the problem. Write the magnitude of each force in Newtons next to the given label. [4] X Research source A standard way to label forces is with a capital F and a subscript of first letter of the force. For example, if there is a force due to friction, label it F f . Force due to gravity: F g = -20 N Normal force: F n = +20 N Friction force: F f = -5 N Push force: F p = +5 N"
    },
    {
      "title": "Sum the magnitudes of all the forces.",
      "content": "Sum the magnitudes of all the forces. Now that you have labelled all forces with both a direction and magnitude, you just need to add all of them together. Write an equation for net force (F net ) where F net is equal to the sum of all the forces acting on the object. [5] X Research source For example: F net = F g + F n + F f + F p = -20 + 20 -5 + 5 = 0 N. Because the net force is 0 N, the object is stationary."
    },
    {
      "title": "Sketch a force diagram.",
      "content": "Sketch a force diagram. When you have a diagonal force acting at an angle on the object, you need to find the horizontal (F x ) and vertical (F y ) components of the force to find its magnitude. You'll have to use trigonometry and the directional angle (usually θ \"theta\"). The directional angle θ is always measured counter-clockwise from the positive x-axis. [6] X Research source Draw the force diagram including the angle of the diagonal force. Sketch each arrow in the proper direction the force is acting and label it with the proper magnitude. For example: Sketch the diagram for a 10 N object experiencing a 25 N force up and to the right at an angle of 45°. There is also a friction force to the left of 10 N. Forces include: F g = -10 N, F n = + 10 N, F p = 25 N, F f = -10 N."
    },
    {
      "title": "Calculate Fx and Fy using the three basic trigonometric ratios (SOH CAH TOA).",
      "content": "Calculate F x and F y using the three basic trigonometric ratios (SOH CAH TOA). Using the diagonal force (F) as the hypotenuse of a right-triangle and F x and F y as the legs of that triangle, you can calculate each in turn. [7] X Research source Remember, CAH: cosine(θ) = adjacent/hypotenuse. F x = cos θ * F = cos(45°) * 25 = 17.68 N. Remember, SOH: sine(θ) = opposite/hypotenuse. F y = sin θ * F = sin(45°) * 25 = 17.68 N. Note that there may be multiple diagonal forces acting on an object simultaneously, so you'll have to find F x and F y of each force in the problem. Then sum the F x values to obtain the total force in the horizontal direction and sum the F y values for the total force in the vertical direction."
    },
    {
      "title": "Redraw the force diagram.",
      "content": "Redraw the force diagram. Now that you have calculated the individual horizontal and vertical components of the diagonal force, you can sketch a new force diagram representing these forces. Erase the diagonal force and instead, draw the arrows for the individual horizontal and vertical magnitudes. For example, instead of one diagonal force, the diagram will now have one vertical force pointing up with a magnitude of 17.68 N and one horizontal force pointing to the right with a magnitude of 17.68 N."
    },
    {
      "title": "Sum all of the forces in the x and y directions.",
      "content": "Sum all of the forces in the x and y directions. Once you have drawn a new force diagram, calculate the net force (F net ) by adding all of the horizontal forces together and all of the vertical forces together. Remember to keep all of the directions of the vectors consistent throughout the problem. For example: Horizontal vectors are all forces along the x axis: F netx = 17.68 – 10 = 7.68 N. Vertical vectors are all forces along the y axis: F nety = 17.68 + 10 - 10 = 17.68 N."
    },
    {
      "title": "Calculate the magnitude of the net force vector.",
      "content": "Calculate the magnitude of the net force vector. At this stage, you have two forces: one in the x-direction and one in the y-direction. The magnitude of the force vector is the hypotenuse of the triangle formed by these two component vectors. Simply use the Pythagorean Theorem to calculate the hypotenuse: F net = √ (F netx 2 + F nety 2 ). [8] X Research source For example: F netx = 7.68 N and F nety = 17.68 N Plug into equation: F net = √ (F netx 2 + F nety 2 ) = √ (7.68 2 + 17.68 2 ) Solve: F net = √ (7.68 2 + 17.68 2 ) = √(58.98 + 35.36) = √94.34 = 9.71 N. The magnitude of force is 9.71 N in a diagonal up and to the right."
    }
  ]
}