{
  "url": "https://www.wikihow.com/Dua-Hajat",
  "title": "How to Perform Dua e Hajat",
  "steps": [
    {
      "title": "In Arabic",
      "content": "In Arabic لا إِلَهَ إلاَّ اللهُ الحَلِيمُ الكَرِيمُ، سُبْحَانَ اللهِ رَبِّ الْعَرْشِ العَظِيمِ ، الحَمْدُ لِلهِ رَبِّ العَالَمِيْنَ ، أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَعَزَائِمَ مَغْفِرَتِكَ ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرّ،ٍ وَالسَّلامَةَ مِنْ كُلِّ إِثْمٍ ،لاَ تَدَعْ لِيْ ذَنْباً إِلاَّ غَفَرْتَهُ، وَلاَ هَمَّاً إِلاَّ فَرَّجْتَهُ، وَلاَ حَاجَةً هِيَ لَكَ رِضاً إِلاَّ قَضَيتَهَا يَا أَرْحَمَ الرَّاحِمِيْنَ [1] X Research source Pronunciation guide: “Laaa i-la-ha il-lal-la-hul-Ha-leemul kareem. Sub-hanallahi rabi-bil `arshil `azeem. Wal-Hamdu-lil-la-hi rabbil-`Alameen. As’aluka muji-bati rah-ma-tik, wa `a-zaaa ‘i-ma mag-fira-tik, wal gha-nee-mata min kul-li birr, was-sa-la-mata min kul-li ithm. La ta-da` li dhan-ban il-la gha-far-tah, wala ham-man il-la far-raj-tah, wala day-nan il-la ka-day-tah, wala hajatam-min ha-wa i-jid-dunya wal-aaa-khi-rah. He-ya laka ri-dan il-la qa-day-taha yaaa ar-ha-mar-ra-he-meen.” [2] X Research source"
    },
    {
      "title": "In English",
      "content": "In English “There is no deity but Allah, the Most Forbearing, the Ever-Generous. Glory be unto Allah, Lord of the Great Throne. Praise be to Allah, Lord of all the worlds. I ask you for those things that bring about Your mercy and Your complete forgiveness; [for] a full portion of every righteous act, and safety from every vice. Do not leave any sin of mine except that You forgive it; any anxiety except that You relieve it; nor any need of mine that pleases You except that You fulfill it, O Most Merciful of those who show mercy.” [3] X Research source"
    },
    {
      "title": "Perform wudu (ritual cleansing or ablutions).",
      "content": "Perform wudu (ritual cleansing or ablutions). Wudu ensures you’re physically and spiritually clean before prayer. First, say “Bismillah” (“in the name of God”) and wash your hands up to the wrists 3 times, wasting as little water as possible. Then, rinse your mouth and nose 3 times each. [4] X Research source Next, wash your entire face and beard (if you have one) 3 times, followed by your arms and hands from the fingertips to the elbows, 3 times. Wipe your head and then your ears next using fresh water. Next, wash your feet thoroughly 3 times, making sure to get between the toes and around the back of the ankle. Finish with this prayer: “Ash-hadu an laa ilaaha ill-Allahu wahdahu laa shareeka lah, wa ash-hadu anna Muhammadan ‘abduhu wa Rasooluh. Allahumma-j‘alni minat-tawwabeen wa-j‘alni minal-mutatahhireen.” In English: “I bear witness that none has the right to be worshiped but Allah Alone, Who has no partner; and I bear witness that Muhammad is His servant and Messenger. O Allah! Make me among the repentant and make me among those who purify themselves.”"
    },
    {
      "title": "Perform two rakats in a quiet place facing Mecca.",
      "content": "Perform two rakats in a quiet place facing Mecca. A rakat is a single unit or iteration of prayer that is part of the obligatory prayers, or salahs. Find a quiet, clean spot to pray and position yourself to face the direction of the Kaaba in Mecca (you may perform the rakats standing or seated). Perform the rakats with the intention of Nafl Salaat, or non-obligatory prayer. The two rakats in order are: Surah Al-Fatiha: “Bismi Allahi alrrahmani alrraheemi. Alhamdu lillahi rabbi alalameena; Alrrahmani alrraheemi; Maliki yawmi alddeeni. Iyyaka nabudu wa-iyyaka nastaeenu. Ihdina alssirata almustaqeema; Sirata allatheena anamta alayhim ghayri almaghdoobi alayhim wala alddalleena.” [5] X Research source In English: “In the name of Allah, Most Gracious, Most Merciful. Praise be to Allah, the Cherisher and Sustainer of the worlds; Most Gracious, Most Merciful; Master of the Day of Judgment. Thee do we worship, and Thine aid we seek. Show us the straight way; The way of those on whom Thou hast bestowed Thy Grace, those whose (portion) is not wrath, and who go not astray.” Surah Al-Ikhlas: “Qul huwa laahu ahad. Allah hus-samad. Lam yalid wa lam yoolad. Wa lam yakul-lahu kufuwan ahad.” [6] X Research source In English: “He is Allah, the One and Only; Allah, the Eternal, Absolute; He begetteth not, nor is He begotten; And there is none like unto Him.”"
    },
    {
      "title": "Raise your hands, recite the dua sincerely, then make your request.",
      "content": "Raise your hands, recite the dua sincerely, then make your request. Surrender your needs to Allah and have faith that He will grant your wishes when He deems it the right time. Recite the dua e hajat first, then ask Allah for your specific need. [7] X Research source When you’re finished, say “Allahumma Ameen” (“Oh Allah, hear my prayer”). [8] X Research source Ask for anything as long as you’re genuine and your intentions won’t harm somebody else. For example, ask for love, help with an illness or injury, better financial luck, or for the wellbeing of your loved ones."
    },
    {
      "title": "Use the dua e hajat to ask Allah to guide you to a partner or spouse.",
      "content": "Use the dua e hajat to ask Allah to guide you to a partner or spouse. One of the most common hajats (“needs”) that worshipers pray for is to find a partner to marry. Perform the dua e hajat and ask Allah for guidance—be sincere as always, and repeat your request regularly to encourage Him to fulfill your desire. Remain patient while waiting for your partner to appear. Trust that Allah will bring you together when He decides the time is right and avoid making hasty love decisions. If you are torn between multiple potential partners, perform the dua istikhara to ask for Allah’s help with decision making."
    },
    {
      "title": "Try this sample prayer to ask for marriage:",
      "content": "Try this sample prayer to ask for marriage: “Oh Allah, You are the giver of peace and blessings. You are the origin of all good things. I ask You to bless me with a spouse who will bring happiness to my life. Help me find the right person to make me a better person. Guide me toward the right decision and grant me the strength to face any challenges in my married life. Amin.”"
    },
    {
      "title": "There is no specific time for dua e hajat, but there are forbidden hours.",
      "content": "There is no specific time for dua e hajat, but there are forbidden hours. Unlike the 5 obligatory prayers, which must be done at specific times, perform dua e hajat at any time of the day or night outside of the forbidden hours. The most blessed time for dua e hajat is the last third of the night leading up to the first prayer of the day (Subuh Fajr). The forbidden times are: [9] X Research source From after the first prayer of the day (Subuh) until sunrise. When the sun is at its meridian, about 5 minutes before the midday prayer (Zuhur). After the afternoon prayer (Asr) until sunset. Blessed days for dua e hajat include Fridays, the day of Arafah, Ramadan, and other holidays."
    },
    {
      "title": "The dua e hajat is a reminder that Allah is the provider of all things.",
      "content": "The dua e hajat is a reminder that Allah is the provider of all things. This prayer is a call for help or guidance during a time of need. By performing it, worshipers acknowledge that they are unable to achieve their goals without Allah’s blessings or divine intervention, reminding them to stay humble and earnest as they navigate life. [10] X Research source Dua e hajat is also a way to invoke the mercy of Allah and improve communication and your relationship with Him."
    },
    {
      "title": "Daily dua e hajat alleviates stress and improves your bond with Allah.",
      "content": "Daily dua e hajat alleviates stress and improves your bond with Allah. When your requests are genuine and for a good cause, supplicating Allah with regular dua e hajat can lead to many improvements in your life, including: Increased gratitude. You become more aware and thankful for the blessings you already have in your life. Stronger faith in Allah. As He provides for you and fulfills your wishes, your trust that your prayers will be answered increases. Protection. Allah will shield you from adversaries, harm, or negative influences. [11] X Research source Better communication with Allah. Regular supplication leads to a stronger connection with Him. Improved mental and emotional health. Regular prayer can reduce your overall levels of stress and anxiety. [12] X Research source Increased blessings. Through dua e hajat, Allah provides abundance to fulfill your needs and wants. Forgiveness of sins. When performed sincerely, dua e hajat encourages Allah to forgive your wrongdoings. Reaching heaven. All the benefits of dua e hajat come together to help you reap the reward of entering heaven when the time comes."
    }
  ]
}