{
  "url": "https://www.wikihow.com/Fold-an-Origami-Envelope",
  "title": "An Easy Guide to Making Your Own Origami Envelopes",
  "steps": [
    {
      "title": "Take a square piece of paper",
      "content": "Take a square piece of paper with the corner facing you. You can find a range of origami paper on Amazon . If you want a colored envelope, make sure the colored side is facing down. [1] X Research source"
    },
    {
      "title": "Fold the paper in half,",
      "content": "Fold the paper in half, from corner to corner across the square."
    },
    {
      "title": "Take the top corner of the first layer",
      "content": "Take the top corner of the first layer and fold it down to the bottom edge. [2] X Research source"
    },
    {
      "title": "Fold the right corner",
      "content": "Fold the right corner one third over to the left. You do not have to be exact, just try to be as accurate as possible."
    },
    {
      "title": "Take the left corner",
      "content": "Take the left corner and fold it over to the other end. Now the bottom portion should be square shaped."
    },
    {
      "title": "Fold the point of the flap over the other flap",
      "content": "Fold the point of the flap over the other flap back to the left edge of the model."
    },
    {
      "title": "Fold the point of the flap up",
      "content": "Fold the point of the flap up to the top corner of the flap. Unfold. This is a crease to help guide the next step. [3] X Research source"
    },
    {
      "title": "Turn the model 180 degrees.",
      "content": "Turn the model 180 degrees. The point of view in the photo will now change."
    },
    {
      "title": "Open the folded portion of the flap.",
      "content": "Open the folded portion of the flap."
    },
    {
      "title": "Make a squash fold",
      "content": "Make a squash fold on this flap. Make sure you flatten it well, as this will help secure the envelope closed. [4] X Research source"
    },
    {
      "title": "Change the position back so it is \"upright.\"",
      "content": "Change the position back so it is \"upright.\" Or turn it back 180 degrees."
    },
    {
      "title": "Fold the very top point",
      "content": "Fold the very top point down to the bottom edge. Or, the bottom edge of the square you formed by \"squashing.\""
    },
    {
      "title": "Put the top flap (the portion you just folded down)",
      "content": "Put the top flap (the portion you just folded down) into the \"pocket\" that was formed by the squash fold. [5] X Research source"
    },
    {
      "title": "Flatten the model.",
      "content": "Flatten the model. Ensure that the model can hold itself together.If you want , you can decorate with stickers or small drawings ..."
    },
    {
      "title": "Take a plain piece of printer paper and write or type your message.",
      "content": "Take a plain piece of printer paper and write or type your message. [6] X Research source"
    },
    {
      "title": "Fold it in half hamburger style so it looks like this.",
      "content": "Fold it in half hamburger style so it looks like this. Make sure the message is on the inside."
    },
    {
      "title": "Unfold the piece of paper.",
      "content": "Unfold the piece of paper."
    },
    {
      "title": "With the writing facing you, take one side of the paper, and fold it at a right angle so that the edge is touching the first crease.",
      "content": "With the writing facing you, take one side of the paper, and fold it at a right angle so that the edge is touching the first crease."
    },
    {
      "title": "Do this with the other side.",
      "content": "Do this with the other side."
    },
    {
      "title": "On one side of each right triangle, there is an open space.",
      "content": "On one side of each right triangle, there is an open space. With one side, fold that space over so that it is touching the right triangle."
    },
    {
      "title": "Do this with the other side.",
      "content": "Do this with the other side."
    },
    {
      "title": "Then take one side and fold it over at a right angle against the first crease.",
      "content": "Then take one side and fold it over at a right angle against the first crease."
    },
    {
      "title": "Do this with the other side so it looks like this.",
      "content": "Do this with the other side so it looks like this."
    },
    {
      "title": "Then take one of these last triangles.",
      "content": "Then take one of these last triangles. You'll see a small flap under the tip of it. Slide the tip of it underneath the little flap."
    },
    {
      "title": "Slide the tip of the other triangle underneath the flap found under it.",
      "content": "Slide the tip of the other triangle underneath the flap found under it. Now it's done. It should look like this."
    },
    {
      "title": "If you plan on mailing the envelope, you can write the address on the back.If you want , you can decorate with stickers or small drawings...",
      "content": "If you plan on mailing the envelope, you can write the address on the back.If you want , you can decorate with stickers or small drawings..."
    }
  ]
}