{
  "url": "https://www.wikihow.com/Encourage-Yourself-to-Read",
  "title": "How to Encourage Yourself to Read",
  "steps": [
    {
      "title": "Create a reading schedule.",
      "content": "Create a reading schedule. Like anything else, reading is an activity that gets easier with practice. Block out a chunk of time to dedicate to reading every day, even if it’s just ten minutes. Choose a time that’s stress-free. Read during a nice, quiet time. Enjoy a book with breakfast or as you’re getting ready for bed. Prepare a snack you love to munch on while you read. This will make you look forward to reading time!"
    },
    {
      "title": "Don’t make reading into a chore.",
      "content": "Don’t make reading into a chore. Even though reading does get better with practice, it’s supposed to be a fun activity. Don’t force yourself to read things you hate. Reading is supposed ignite creativity and inspire joy. If you can’t get into a book, move onto a new one. Reading increases empathy and intelligence, but only if you can focus on what you’re reading. Choosing books with compelling characters and storylines that suck you in raise your chances of reaping the intellectual benefits of reading. [1] X Research source"
    },
    {
      "title": "Browse your local library.",
      "content": "Browse your local library. Spend some time checking out the selection at your local library to get an idea of what you’d be excited to read. Libraries are perfect places to get lost for hours. Wander through a bunch of different sections and grab whatever books interest you! [2] X Research source Curl up in an armchair and read the first page of all of the books you take off the shelf. After you’ve gone through them all, choose one or two that seemed the most compelling. Don’t buy too many books at once, as this can be overwhelming. Instead, limit yourself to one or two a visit that you can’t wait to get home and read. Get a library card. Though people go to libraries less frequently than in the past, your local library is an amazing resource for essentially free books. Talk to a librarian about how to set up an account, and ask for some recommendations."
    },
    {
      "title": "Buy from local independent bookstores.",
      "content": "Buy from local independent bookstores. Like the library, bookstores are an excellent place to find books that might interest you. Independent bookstores are particularly good resources because unlike some of the bigger chains, independent stores are run by book lovers who want to foster a literary community. Going to an independent bookstore will help you to meet other people who want to get into reading. Employees at independent bookstores are well-read and will be able to offer you exciting new recommendations. Most independent bookstores also sell local authors. This is a fun way for you to read books by people you might know and to become more active in the community!"
    },
    {
      "title": "Join a book club.",
      "content": "Join a book club. Joining a book club not only exposes you to books that you might not have otherwise read but also allows you to connect with other like-minded readers. Coming together with others and discussing what you’re reading makes the material feel more relevant and gives you a chance to hear a wide variety of opinions. [3] X Research source Plus, most book clubs have great food! The food and conversation stimulate lasting connections and friendships."
    },
    {
      "title": "Join an online book forum.",
      "content": "Join an online book forum. Online book forums can help you foster your reading interest. You can also participate in book discussions and get ideas for new books to read. Do an online search for book forums to find one you’d like to be a part of."
    },
    {
      "title": "Start small.",
      "content": "Start small. There’s no reason to immediately force yourself to read War and Peace when you’re trying to get into reading. Start with something that’s easy and fun to read, regardless of its academic level. [4] X Research source Pick up your old favorite kids book or choose a young adult novel, most of which are fast-paced, easy to read, and full of imaginative characters. Grab a favorite like Harry Potter , or some Roald Dahl classics like Matilda or James and the Giant Peach to get started. Try an alternative format, such as a graphic novel. If you like history, try out the graphic novel Persepolis by Marjane Satrapi or Maus by Art Spiegelman."
    },
    {
      "title": "Experiment with different genres.",
      "content": "Experiment with different genres. Don’t limit yourself to one genre. Alternating between genres such as fiction, non-fiction, fantasy, sci-fi, and history can keep you constantly engaged and excited about reading. [5] X Research source Science fiction and fantasy are often great picks for people who don’t love to read. They’re fun, imaginative, and fast paced. Ender’s Game by Orson Scott Card and A Hitchhiker’s Guide to the Galaxy by Douglas Adams are two widely adored sci-fi classics. For fiction, don’t force yourself to read the classics just because you think you should. The Kite Runner by Khaled Hosseini and The History of Love by Nicole Krauss are two examples of popular contemporary books."
    },
    {
      "title": "Ask friends for recommendations.",
      "content": "Ask friends for recommendations. Friends, family members, and teachers who know what you like and what you’re interested in are a great resource for book recommendations. Not only will you get good advice, but you will make connections with other people who love to read. Since reading is such a solitary activity, it’s nice to share your thoughts on books with the people in your life. [6] X Research source Reach out to your old high school English teacher and ask for a good book recommendation. Your teacher will most likely be thrilled to hear from you, and will have tons of knowledge on the best books out there."
    },
    {
      "title": "Look at lists of prize-winning books.",
      "content": "Look at lists of prize-winning books. Every year, The Pulitzer Prizes awards prizes for the best writing of the year. Check out the Pulitzer website at https://www.pulitzer.org/prize-winners-by-year for a list of the best books of the year. The website is organized by either “Prize Winners By Year” or “Explore by Category.” Choose “Explore by Category” to see prizes in many different categories such as Fiction, Drama, History, Biography, Poetry, and General Nonfiction. Scroll through them all! For lovers of classics, check out the Modern Library’s list of 100 Best Novels at http://www.modernlibrary.com/top-100/100-best-novels/ . Print out the list and cross them off as you go!"
    },
    {
      "title": "Keep track of what you’ve read.",
      "content": "Keep track of what you’ve read. There are tons of sites, such as Goodreads and Delicious Library, that let you track the books you’ve read. You can also see what books your friends are reading and check out reviews of books that you’re interested in. [7] X Research source Most sites also give you recommendations based on what you’ve read and rated. [8] X Research source Even if you don’t like using online reading sites, write down a list of all the books you’ve read with a few notes on what you thought of them. Studies show that keeping track of goals and accomplishment helps with happiness, motivation, and emotional well-being. Plus, it’s satisfying to have a record of all the books you’ve read! [9] X Research source"
    },
    {
      "title": "Tell others about books you like.",
      "content": "Tell others about books you like. Encouraging others to read will make reading more fun for you as well. When you find a book that you love, tell a friend, family member, or significant other to read it. Then the two of you can talk about it, and the other person might then be more inspired to read and ultimately provide you with more future recommendations."
    },
    {
      "title": "Don't force it.",
      "content": "Don't force it. There's no reason to slog through a book that you just can't get into. There are hundreds of thousands of books out there. If you're not into a book after about thirty pages, move on to something else. Go to a library or bookstore and choose several books in different genres. Read the first chapter to see if you enjoy the book, rather than looking at the cover or reading the blurb on the back."
    },
    {
      "title": "Pick a comfortable position.",
      "content": "Pick a comfortable position. It’s hard to read if you’re in physical pain. Find a nice, cozy place to settle in with a book and read with good posture so that you stay comfortable and all you have to focus on is the story itself. Don’t sit in a hard plastic folding chair, but rather an armchair, hammock, couch, or comfy window nook. [10] X Research source Find a room in your house that's quiet so you can concentrate on what you're reading. [11] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Make yourself a nice cup of tea or coffee to sip on while you’re reading. It’ll keep you hydrated and awake!"
    },
    {
      "title": "Get rid of distractions.",
      "content": "Get rid of distractions. [12] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Reading takes a lot of concentration, and it’s impossible to get into a book if you’re constantly checking your email or Facebook or distracted by outside commotion. Find a quiet place and eliminate technological distractions while you’re reading. [13] X Research source Turn off your cell phone or put it on silent, unless you plan to use it to look up unfamiliar words. Put your cell phone far enough away from you that you won’t pick it up to check your social media. Buy some earplugs to drown out the sounds of traffic or your neighbor’s TV."
    },
    {
      "title": "Choose between a Kindle and a paper book.",
      "content": "Choose between a Kindle and a paper book. There’s nothing like the feel and smell of a good old-fashioned book. However, some prefer reading electronic books through sources such as the Kindle. Find a reading medium that makes the most sense for you. Kindles are generally easier to transport. You can store tons of reading material in one lightweight package. Kindles also have special features such as highlight, search, and note taking. While print books are easier on the eyes, Kindles have a muted gray background that causes less strain than the common computer screen. [14] X Research source"
    },
    {
      "title": "Try an audiobook.",
      "content": "Try an audiobook. If you spend a lot of time in transit, audiobooks are great ways to keep reading on-the-go. Though the average word per minute is lower by listening to an audiobook than by reading for yourself, for those with limited time, it’s still better than not reading at all. [15] X Research source Some people are more auditory than visual. If you tend to excel at auditory learning, audiobooks are likely the right choice for you. Audiobooks aren’t just for commuters. Listen to a book while cooking, cleaning, mowing the lawn, or running. iBooks and Audible are two of the main resources for audiobooks. [16] X Research source"
    }
  ]
}