{
  "url": "https://www.wikihow.com/Gain-Weight-if-You-Have-Lactose-Intolerance",
  "title": "How to Gain Weight if You Have Lactose Intolerance",
  "steps": [
    {
      "title": "Choose lean proteins for healthy weight gain.",
      "content": "Choose lean proteins for healthy weight gain. It may be tempting to start eating high fat meats to gain weight, but eating high-fat protein may lead to other problems, such as high cholesterol. Lean proteins are the best choice for healthy weight gain, so opt for lean proteins instead. Good sources of lean protein include: Skinless turkey or chicken breast Lean beef Pork loin Light tuna (packed in water) Tofu or tempeh Beans"
    },
    {
      "title": "Choose higher calorie fruits and vegetables.",
      "content": "Choose higher calorie fruits and vegetables. Some fruits and vegetables are higher in fat and calories than others. By choosing higher calorie options, you will have a better chance of gaining weight. When it comes to fruits and vegetables, go for bananas, pineapples, raisins, other dried fruits, peas, corn, potatoes, and squashes."
    },
    {
      "title": "Eat dense breads and cereals.",
      "content": "Eat dense breads and cereals. Carbohydrates are a great source of calories, but some choices have higher calories than others. Steer clear of “light” breads and cereals to avoid low-calorie choices. When choosing bread, look for healthy higher calorie breads like 100% whole wheat bread. Other good options include: Whole grain cereals Granola Bran muffins Whole wheat bagels Whole wheat pasta Brown rice"
    },
    {
      "title": "Cook with oil.",
      "content": "Cook with oil. When you're grilling vegetables, meats, or other foods, use a healthy cooking oil to add some fat and calories. Opt for olive, grapeseed, or canola oils over vegetable oil. Olive, grapeseed, and canola oils are higher in calories and also contain more nutrients your body needs to put on weight in a healthy fashion. Try drizzling olive oil over a salad, use canola oil to grease a pan, or replace butter with canola oil in cookie recipes."
    },
    {
      "title": "Use coconut milk.",
      "content": "Use coconut milk. Coconut milk is a great source of lactose-free fat and calories, so incorporating it into your diet may help you to gain some weight as well. Coconut milk is a good source of healthy fat as well as other nutrients and it is quite versatile, so you can use it in a variety of recipes. [1] X Research source Try making a coconut milk based curry, replace dairy milk with coconut milk in a soup recipe, or add a spoonful of coconut milk to your morning coffee. Coconut milk in it's looser, liquid form is a direct substitute for cow's milk. Coconut milk in it's more solid form (such as, in a can) is a perfect substitute for whipped cream or creamer."
    },
    {
      "title": "Snack on nuts.",
      "content": "Snack on nuts. Nuts are a great, nutrient-dense snack that are also high in calories. Macadamia nuts, pecans, pine nuts, brazil nuts, and walnuts have the highest calorie count while chestnuts, cashews, and peanuts are on the lower end of the spectrum. [2] X Research source Try munching on a handful of nuts as a snack or incorporate nuts into other recipes. For example, you could throw some cashews into a stir-fry, blend walnuts into a pesto sauce, or add chopped almonds to a batch of chocolate chip cookies. Spread nut butter on bread or try some with fruit. Adding nut butters, like peanut butter and cashew butter, to a slice of whole wheat toast can be a great way to increase calories while getting in a healthy snack. [3] X Research source Try spreading a tablespoon of almond butter on toast or dip apple slices in some peanut butter."
    },
    {
      "title": "Incorporate hummus into your diet.",
      "content": "Incorporate hummus into your diet. Hummus is a highly recommended spread for healthy weight gain as it contains chickpeas, which are high in calories, as well as healthy fats, and nutrients. Hummus is a great source of fiber as well. Try spread some hummus on a slice of bread, using it as a dip for veggies, or adding a scoop of hummus to a salad."
    },
    {
      "title": "Indulge in some avocado.",
      "content": "Indulge in some avocado. Avocados are high in fat and rich in nutrients, so eating avocado is a great way to add some calories into your diet if you are lactose intolerant. Avocados are best known as the main ingredient in guacamole, but they have a mild flavor, so you can use them in lots of different ways. Try spreading guacamole on a sandwich, toss some avocado slices into your salad, or throw ¼ of an avocado into a fruit smoothie to add some fat and calories without changing the flavor."
    },
    {
      "title": "Drizzle some honey on your food.",
      "content": "Drizzle some honey on your food. You should avoid using added sugar to gain weight as too much sugar can increase your risk for a variety of medical issues. However, adding honey to snacks and drinks may help you gain weight safely. Some research shows honey helps with malnutrition and it also has strong antibacterial properties. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have diabetes you may want to avoid honey. While honey does not have the same effect on blood sugar as table sugar, some studies indicate it can affect blood sugar levels. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drink dairy-free smoothies and shakes.",
      "content": "Drink dairy-free smoothies and shakes. To gain weight in a healthy fashion, you need to add 200 to 500 extra calories into your daily meals. This can be difficult to do and many people feel full to the point they cannot keep eating. Having a variety of healthy, dairy free shake recipes can allow you to gain the extra calories without having to eat another meal. Shakes and smoothies are very popular in the health foods movement as they add nutrients to your diet in a fun, easy-to-consume manner. A simple google search for dairy-free smoothie recipes will yield a variety of results. Most smoothies use some kind of liquid, usually fruit juice without added sugar or almond or soy milk, as well as a variety of fruits and veggies. Ingredients are blended in a food processor until mixed to your desired texture. [6] X Research source Many smoothies use additives like vanilla extract, cinnamon, or honey to give the smoothie added sweetness and flavor. You can experiment with mixing and matching different additives until the smoothie tastes good to you. [7] X Research source If you find a smoothie recipe that sounds good but uses a dairy product like milk or yogurt, you could try substituting it for a dairy- free alternative. Use soy or almond yogurt or milk instead, for example. [8] X Research source"
    },
    {
      "title": "Drink calorie-heavy beverages.",
      "content": "Drink calorie-heavy beverages. Dieters are generally recommended to avoid the calories that come from beverages. However, if you're trying to gain weight, supplementing your diet with some calorie heavy beverages may be helpful. With meals, drink fruit juices with no added sugars or sports drinks like gatorade. You should not, however, stop drinking water as eight glasses of water is essential to a healthy diet. Just drink water in addition to calorie heavy beverages. While drinking calories is great for weight gain, it's important to put on weight in a healthy fashion. Avoid sugary beverages like soda or fruit juices with a lot of added sugar. You should also avoid trying to gain weight by increasing your alcohol consumption as alcohol can be particularly dangerous if you're malnourished."
    },
    {
      "title": "Ask a nutritionist about incorporating a dairy-free protein powder into your diet.",
      "content": "Ask a nutritionist about incorporating a dairy-free protein powder into your diet. Protein powders are a variety of health supplements, sold at gyms or health food stores, designed to help add bulk to drinks and help you put on pounds and muscle. Protein powders can be added to smoothies and other drinks, and even ground up and added to some meals. Ask a nutritionist about incorporating protein powder first. Protein powder is often used for muscle building regimens and might not be helpful if you're simply trying to gain weight. Egg white protein powder is a great way to add protein to the diet without dairy. It comes in various flavors or unsweetened varieties."
    },
    {
      "title": "Talk to a doctor about your weight.",
      "content": "Talk to a doctor about your weight. Unexplained weight loss, and a difficulty gaining weight, can be a symptom of lactose intolerance itself. This is especially so if you're newly diagnosed and still adjusting to your new diet. However, weight loss can also be a symptom of a number of underlying medical conditions. If you don't believe lactose intolerance is to blame, talk to your physician. The causes of weight loss are vast and range from fairly benign ailments, such as minor dental issues, to more serious diseases like cancer and Parkinson's. It's important to get a physical evaluation by a doctor if you're losing weight unexpectedly. He or she will perform an exam and a number of tests based on your medical history and current health. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If your inability to gain weight is related to your lactose intolerance, your doctor can help you form a diet and exercise regimen that works for you. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Seek the advice of a nutritionist.",
      "content": "Seek the advice of a nutritionist. If you're having trouble gaining weight on a lactose-free diet, ask your regular doctor for a referral to a nutritionist. A good nutritionist can make recommendations for your diet based around your personal preferences and health needs. If your weight loss is related to a medical condition, your insurance provider should cover a nutritionist."
    },
    {
      "title": "Evaluate your medications.",
      "content": "Evaluate your medications. If you're on any prescription drugs, check the list of side effects. There are a wide array of prescription medications that can cause unintentional weight loss. Medications from migraine meds to psychiatric medication can sometimes cause weight loss. Meds for ADHD in particular are a culprit in sudden weight loss. [11] X Research source Talk to your doctor about switching to alternative medications if you believe any drugs you're taking are causing malnutrition."
    }
  ]
}