{
  "url": "https://www.wikihow.com/Decorate-Cupcakes-Without-Icing",
  "title": "11 Cute & Easy Ways to Decorate Cupcakes Without Icing",
  "steps": [
    {
      "title": "Whipped cream is a light, refreshing alternative to frosting.",
      "content": "Whipped cream is a light, refreshing alternative to frosting. Once your cupcakes cool off, spoon a bit of whipped cream on top. If you’d really like to spice things up, sprinkle lemon zest, sprinkles, or chopped nuts on the whipped cream. [1] X Research source If you aren’t in the mood for whipped cream, spoon on some Greek yogurt instead. [2] X Research source"
    },
    {
      "title": "Use paper stencils to dust fun designs on your cupcakes.",
      "content": "Use paper stencils to dust fun designs on your cupcakes. Cut up long, vertical strips of paper and arrange them on top of the cupcake. Scoop ½ cup (50 g) of powdered sugar into a sifter and coat the exposed sections of the cupcake. Then, remove the stencils so you can admire your powdered sugar design! [3] X Research source You can also use cocoa powder instead of powdered sugar. Use perforated baking sheets, cooling pads, and letter stencils to create fun, unique designs on your cupcakes. You can do this with any kind of cupcake!"
    },
    {
      "title": "Glaze provides the sweetness of frosting without the thickness.",
      "content": "Glaze provides the sweetness of frosting without the thickness. Whip up a simple glaze with 1½ cups (173 g) of powdered sugar along with 2 US tbsp (30 mL) of milk and 1 vanilla bean with the seeds removed from the pod. [4] X Research source Drizzle the glaze on top of your cupcakes for a simple, sweet, no-nonsense topping. [5] X Research source"
    },
    {
      "title": "Fruit is a refreshing, healthier alternative to frosting.",
      "content": "Fruit is a refreshing, healthier alternative to frosting. Chop the fruit into smaller pieces or slices, and arrange a piece in the center of each cupcake. For an extra burst of fruity sweetness, spread a layer of jam or jelly on the cupcake before arranging the fruit slice. [6] X Research source For instance, you might top your cupcakes with blueberries, sliced strawberries, or sliced kiwi. You can also spread melted jam, jelly, or preserves on top of your cupcakes. [7] X Research source This is a great addition for any kind of cupcake."
    },
    {
      "title": "Caramel glaze provides a richer, more dynamic flavor for your cupcakes.",
      "content": "Caramel glaze provides a richer, more dynamic flavor for your cupcakes. Pour 3 US tbsp (38 g) of caster sugar into a saucepan with a couple spoonfuls of water, stirring the sugar until it dissolves into the water. Then, mix in 3 US tbsp (44 mL) of cream, 1 US tbsp (15 mL) of butter, and a pinch of salt. Turn off the heat and let the sauce cool off, which will help it thicken up. At this point, drizzle the caramel sauce over your cupcakes. [8] X Research source"
    },
    {
      "title": "Melt a handful of white chocolate chips in the microwave.",
      "content": "Melt a handful of white chocolate chips in the microwave. Spread the melted chocolate over each cupcake in a thin layer. While the chocolate is still wet, dip the cupcakes in a bowl of coconut flakes. [9] X Research source You can try this with a variety of tasty toppings, like sprinkles, candy, or cereal. This tastes great with chocolate cupcakes."
    },
    {
      "title": "Mix equal amounts of Nutella and peanut butter in a bowl.",
      "content": "Mix equal amounts of Nutella and peanut butter in a bowl. Heat the mixture in the microwave until it’s completely melted. Then, spread the tasty mixture on top of each cupcake. [10] X Research source When melted, Nutella and peanut butter acts more like a glaze."
    },
    {
      "title": "Chocolate ganache is a tasty replacement for icing that you can make at home.",
      "content": "Chocolate ganache is a tasty replacement for icing that you can make at home. Add 9 oz (261 g) of chopped, bittersweet chocolate to a bowl. Boil 1 c (240 mL) of heavy cream in a saucepan. Pour the cream over the chocolate, and mix the ingredients together until they’re smooth. Give the ganache several minutes to cool, and then spread it over the tops of your cupcakes. [11] X Research source Chocolate ganache is a tasty addition to chocolate cupcakes. [12] X Research source"
    },
    {
      "title": "Add a marshmallow to each cupcake before they’re finished baking.",
      "content": "Add a marshmallow to each cupcake before they’re finished baking. Take a look at your oven timer while your cupcakes are still in the oven. When there’s about a minute left, place a small marshmallow in the center of each cupcake. The marshmallow will melt and create a sweet, sticky glaze all over your cupcakes. [13] X Research source As an extra touch, sprinkle crushed graham crackers on top."
    },
    {
      "title": "Add an extra dimension of flavor to your cupcakes.",
      "content": "Add an extra dimension of flavor to your cupcakes. Scoop some of this cookie dough on top of each cupcake a simple but delicious decoration. Double-check that cookie dough is safe to eat raw, or make your own edible cookie dough at home. [14] X Research source"
    },
    {
      "title": "Spread a thin layer of honey on top of each cupcake.",
      "content": "Spread a thin layer of honey on top of each cupcake. Then, stick edible flowers on top of the honey, which helps them stay in place. Keep things simple with just 1 edible flower per cupcake, or add multiple flowers to create more colorful confections. [15] X Research source For a simpler cupcake, spread honey over the cupcakes and leave it at that. Some edible flowers are borage blossoms, hibiscus, lavender, pansies, and roses. [16] X Research source"
    }
  ]
}