{
  "url": "https://www.wikihow.com/Deal-with-Being-Betrayed-by-Family",
  "title": "11 Ways to Cope with Being Betrayed by Family (and Start the Healing Process)",
  "steps": [
    {
      "title": "Get some space from them so they can’t hurt you again.",
      "content": "Get some space from them so they can’t hurt you again. [1] X Expert Source Adam Dorsay, PsyD Licensed Psychologist & TEDx Speaker Expert Interview. 14 May 2019. Don’t give your family members another chance to do something else that could hurt or betray your trust. If you can, try to separate yourself from your family members by cutting off contact with them. Stay disconnected from the family member as long as it takes for them to change their behavior and recognize that they’ve wronged you. [2] X Research source When they’re ready to apologize or if you feel ready to talk, feel free to open up your line of communication again. You may need more time away from someone if they severely broke your trust, such as if a family member stole from you or said something damaging about you behind your back. Reader Poll: We asked 474 wikiHow readers how to set boundaries with a family member who betrayed them, and 59% said they would limit the amount of time they spend with them. [Take Poll]"
    },
    {
      "title": "It’s completely normal to feel upset or angry, so don’t hide your feelings.",
      "content": "It’s completely normal to feel upset or angry, so don’t hide your feelings. Rather than fighting against your feelings, give yourself a chance to sit with them so you can reflect. Let yourself cry and feel upset, but take a second to recognize what’s causing you to feel that way before moving on to the next thought. It takes a while to process all of the emotions after a betrayal, so give yourself as long as it takes. [3] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source If you feel like you need to cry, do it. It’ll feel a lot easier to move on after getting through the negativity you feel now."
    },
    {
      "title": "Writing your emotions down lets you vent and process what happened.",
      "content": "Writing your emotions down lets you vent and process what happened. Open up a fresh page in a journal or notebook and jot down exactly how you’re feeling. Avoid editing yourself and just write everything that comes to your mind about the situation. [4] X Research source Write in your journal every day or whenever you feel the need to so you can get your thoughts down on paper. [5] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source No one else is going to read your journal except for you. It’s okay to say whatever you want without censoring yourself if it helps you process your feelings."
    },
    {
      "title": "Go for a walk or take a deep breath so you don’t stress yourself out.",
      "content": "Go for a walk or take a deep breath so you don’t stress yourself out. Rather than feeling overwhelmed by what’s going on, be sure to focus on how you’re doing mentally. If you feel like the betrayal still gets you worked up, look for ways to escape and relieve your stress. You could take a walk every day, try breathing exercises, practice yoga, or anything else that helps you clear your head. [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source An easy breathing exercise you can try when you’re stressed is breathing in through your nose for 4 counts, holding your breath for 7 counts, and slowly exhaling through your nose for 8 counts. [7] X Research source"
    },
    {
      "title": "You didn’t do anything wrong, so the betrayal wasn’t your fault.",
      "content": "You didn’t do anything wrong, so the betrayal wasn’t your fault. Try not to blame yourself for trusting a family member or getting involved since it will only make you more emotionally exhausted. Your family member made their decision on their own, so let yourself off the hook and forgive yourself so you’re able to move on. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, you could say to yourself, “I am not responsible for my brother’s actions and I did everything that I could.”"
    },
    {
      "title": "Go out and do the things that make you feel happy and fulfilled.",
      "content": "Go out and do the things that make you feel happy and fulfilled. Instead of focusing on the negative effects of betrayal, list all of the things in your life that you’re proud of. Look for interests, hobbies, or skills that you want to keep improving on and take time to continue building on them. [9] X Research source For example, use the opportunity to reach out to friends and other family members that care about you so you can keep those relationships strong."
    },
    {
      "title": "Reach out to your friends when you’re feeling stressed out.",
      "content": "Reach out to your friends when you’re feeling stressed out. Get in touch with a few of your really close friends who you can trust, and ask them if you can vent. Talk about what you’re going through with your family so they understand how you’re feeling about it all. They may be able to help distract you from the situation or offer helpful advice if they’ve been through something similar. Be careful not to overwhelm your friends with your problems. Always ask if they’re open to chatting about heavy topics before going into them."
    },
    {
      "title": "Scheduling a time to talk keeps you from mentally dwelling on the topic.",
      "content": "Scheduling a time to talk keeps you from mentally dwelling on the topic. When you’re ready to talk to your family member, avoid bringing up their betrayal every chance you have since it can make every interaction feel negative. Instead, set aside 15–20 minutes of your day where you can sit down with them and have a conversation. It may still take a little while to fully reconcile, but it’ll be easier to open up each day. [10] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source As the person that was betrayed, you control how often you talk to your family member and how long your conversations are. [11] X Expert Source Adam Dorsay, PsyD Licensed Psychologist & TEDx Speaker Expert Interview. 14 May 2019."
    },
    {
      "title": "Help your family understand what made you upset so they don’t repeat it.",
      "content": "Help your family understand what made you upset so they don’t repeat it. Think through what you want to say to your family member beforehand so you can speak calmly and thoughtfully. Avoid trying to shame or humiliate them as you’re explaining the situation. Instead, just explain how their choices made you feel so they get a better understanding of how they affected you. [12] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, avoid saying something like, “You lied to me and made me feel bad,” since it feels accusatory. You could instead say something like, “I felt really upset when I found out you had been lying to me.”"
    },
    {
      "title": "Learning about their motivations helps you gain more insight.",
      "content": "Learning about their motivations helps you gain more insight. There’s a chance the betrayal could be a big misunderstanding, so listen to your family member’s side of the story. Give them your full attention and hear them out so you can understand why they made the choices that they did. Do your best not to judge or interrupt them so they have a chance to fully explain. [13] X Research source For example, there may be a good reason that a family member told you a small lie. Avoid lashing out while your family member explains their thoughts so you have a chance to think it over."
    },
    {
      "title": "Restore the trust with your family if you think they’ll change.",
      "content": "Restore the trust with your family if you think they’ll change. If you feel confident that your family member understands why you were upset and wants to change, take it slow so you don’t get hurt again. Pay attention to how they behave and if their actions match what they say they’re going to do. As long as your family member continues being respectful, loyal, and caring, keep building back your relationship. [14] X Research source For example, if your family member exposed some of your secrets, you may keep some information to yourself when you see them instead of telling them everything. As another example, if your family member stole something from you, you may still see them in public but avoid inviting them over. Even though they’re your family, you’re not obligated to maintain relationships with them if you don’t feel like you can trust them. [15] X Research source"
    },
    {
      "title": "You can still move past the negativity even if you don’t forgive the person.",
      "content": "You can still move past the negativity even if you don’t forgive the person. If you’re still upset or feel hurt by your family member, it’s only going to sting the longer you think about it. Make the conscious choice to let go of what happened and continue living your life. Focus on the present and what you can do going ahead in the future instead of thinking back on the things that happened to you. [16] X Research source For example, you may want to move on or cut ties if your family member doesn’t apologize or continues to betray you in the same way without taking any responsibility. [17] X Research source Remember, forgiving someone isn’t excusing their behavior. It’s giving yourself the permission to move on and not let the thoughts of the situation affect you anymore."
    },
    {
      "title": "A professional can help you work through more substantial issues.",
      "content": "A professional can help you work through more substantial issues. Family betrayals can be really traumatic depending on the event that happens. If you have a hard time overcoming or reconciling with it, reach out to a therapist in your area to talk through your issues. [18] X Expert Source Adam Dorsay, PsyD Licensed Psychologist & TEDx Speaker Expert Interview. 14 May 2019. They can offer some helpful solutions that may help you build your relationship up again. [19] X Research source You may be able to go with your family member to a therapist so you can work through the problem together."
    }
  ]
}