{
  "url": "https://www.wikihow.com/Find-out-How-Much-Something-Is-Worth",
  "title": "How to Find out How Much Something Is Worth",
  "steps": [
    {
      "title": "Scan eBay’s sold listings to price your item.",
      "content": "Scan eBay’s sold listings to price your item. The website eBay has a feature that allows users to research the price of items based on the typical selling price of the item or items that are similar. Go to the seller center, log into your user account, use the text field to search for your item, and click “look up.” [1] X Research source For instance, if you were to enter a search for “Spiderman suit,” the results would show an average price of $20.61, with Spiderman suits ranging in price from $0.01 to $199. If you want to look at the different asking prices (and not what the item sells for), you can do a general search for the item and sort it by price. For example, if you type in “New iPhone 6,” the lowest asking price is $380, while the highest asking price is $699."
    },
    {
      "title": "Use a search engine to see what general items are worth.",
      "content": "Use a search engine to see what general items are worth. If your item is more general and not a rare collectible or antique, try using a search engine like Google . When you type in the item, it will often list similar items for sale, including new and used options. You can also use the \"shopping\" function to quickly compare items and prices. [2] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For example, if you search “Men’s Nike Shox,” the results page shows both pictures and prices, with costs ranging from $80 to $125. If you have a photo of your item, use Google Lens to enlist the help of AI and Google’s image search to find examples of your item being sold elsewhere."
    },
    {
      "title": "Visit an online database for niche items.",
      "content": "Visit an online database for niche items. Look for online databases that offer pricing information for your item. Use your preferred search engine, type in your item, and then include the word database. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For instance, if you search “antiques database” there are many results that list prices of collectibles . Kovels is an online database that offers a free subscription to its pricing guide."
    },
    {
      "title": "Get an estimate from an online valuation site.",
      "content": "Get an estimate from an online valuation site. There are many sites online where professional appraisers or subject matter experts offer estimates on your items. Simply upload a photo and add descriptions. The site will typically respond within a week with a valuation of the item. [4] X Research source Charges for this service vary, but the price starts at a minimum of $10 to $30. Some sites have monthly memberships, which give the user access to a database of sales records and instant price searches. Try sites such as What’s It Worth to You, Value My Stuff, and Worth Point. If you’re searching for the tax-deductible value of items that have been donated, you can use valuation sites, tax preparation companies (such as Turbo Tax), or the Salvation Army. If you want free guidance, post a photo of your item in Reddit’s What Is This Worth? forum. The posters there have a blast researching the values of obscure items!"
    },
    {
      "title": "Visit a certified appraiser near you.",
      "content": "Visit a certified appraiser near you. There are professional appraisers for almost every item. When seeking an appraiser, choose a professional who is certified by the American Society of Appraisers, the Appraisers Association of America, or the International Society of Appraisers. Once the appraisal is complete, you will receive a written report discussing the item, the procedure used to value it, and the current value of the item. [5] X Research source www.bls.gov/ooh/business-and-financial/appraisers-and-assessors-of-real-estate.htm Costs vary greatly depending on the appraiser and the item. Some appraisers charge by the hour (anywhere from $200 to $400 based on their expertise), while some charge a flat rate. Avoid working with an appraiser who charges a percentage of the item’s value. To ensure a fair valuation, take the item to an appraiser before taking it to a local antique store or dealer. Unlike individual dealers, the appraiser will have no conflict of interest, since they are ethically bound from making an offer for purchase after appraising an item. Bank managers or estate attorneys are often good sources to help find reputable appraisers. [6] X Research source"
    },
    {
      "title": "Take the item to an antique store for a quicker appraisal.",
      "content": "Take the item to an antique store for a quicker appraisal. Many antique stores also employ professional appraisers. Contact your local antique store to discuss appraisal options. Appraisers should still be certified by a national appraisal board. They often offer insurance replacement valuations or fair-market valuations, but they also offer less-expensive services such as verbal approximations. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Contact a collectibles dealer for specialty items.",
      "content": "Contact a collectibles dealer for specialty items. If your item is a collectible that has well-established price guidelines (such as baseball cards ), search online for a collectible dealer to assist in pricing your item. Search for someone who is certified by a national appraisal board for the fairest valuation judgments. [8] X Research source Make sure that the collectibles dealer is reputable. Read reviews about them online, if possible."
    },
    {
      "title": "Visit auction houses to get info on higher-end items.",
      "content": "Visit auction houses to get info on higher-end items. Auction houses offer private valuation services for various fees (based on location). [9] X Research source Occasionally, auction houses will offer a “valuation day” or “appraisal day” where they will offer free valuations for the general public. Contact your local auction house, such as Sotheby’s or Christie’s, for information on scheduled dates and procedures. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source PBS’s The Antique Roadshow is an auction house that tours the USA and offers tickets and applications to have items appraised. Their website also offers online appraisals. [11] X Research source"
    },
    {
      "title": "Find a recent price guide for any popular collectibles.",
      "content": "Find a recent price guide for any popular collectibles. There are many well-established guidebooks for various collectible items. Search your local library for price guides to determine the value of your item. For example, Kovels’ Antiques & Collectibles Price Guide is a collection of recent prices paid for items in at least 700 categories at auctions, shops, shows, flea markets, and online. [12] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Other titles include: A Guide Book of United States Coins Scott Standard Postage Stamp Catalogue The Standard Catalog of Baseball Cards Beckett Almanac of Baseball Cards & Collectibles"
    },
    {
      "title": "Search collector’s books.",
      "content": "Search collector’s books. Collector’s books can provide detailed information on items such as size, condition, manufacturer’s marks, etc. These reference books may also contain pricing information based on similar items. Check your local library or bookstore for collector’s books specific to your needs. Used bookstores are another great resource. You may also find digital books online. Check out viaLibri if you’re looking for a rare collector’s book."
    },
    {
      "title": "Ask your librarian for help.",
      "content": "Ask your librarian for help. A librarian is often a good source of general information and can be very helpful in leading you to the right books or reference materials online. It’s their job to help people out, and librarians tend to be very passionate about getting to the bottom of a good mystery, so don’t hesitate to ask for help if you need it!"
    }
  ]
}