{
  "url": "https://www.wikihow.com/Fax",
  "title": "How to Fax",
  "steps": [
    {
      "title": "Set your fax machine up.",
      "content": "Set your fax machine up. In order to send and receive faxes using a fax machine, you will need to make sure that your fax machine is plugged in and connected to your landline phone connection. [1] X Research source A dedicated line is recommended if you plan on faxing frequently because you will not be able to use the fax machine and the phone at the same time. You should also make sure your fax machine has toner and paper if you plan on receiving faxes. If you don't have a fax machine at home or at work, you may be able to send one for free from your local public library. You can also go to a store such as Kinko's or The UPS Store to fax your documents for a fee. These options work best if you do not expect to send faxes frequently."
    },
    {
      "title": "Adjust your settings.",
      "content": "Adjust your settings. All fax machines are different, but you will usually have the option to adjust certain settings. Read your user manual in order to learn more about the specific features that are available on your machine. [2] X Research source If you want to know for sure that your fax was transmitted successfully, turn the confirmation page setting on. When this feature is turned on, the machine will print a page after you send a fax, which will let you know if it was successfully transmitted or not. You can also set up a fax header, which is a line of text that will appear at the top of each document you send. It typically includes basic information about who the fax is from. If you plan on receiving faxes as well, you can choose between automatic receive mode or manual receive mode, which will require you to accept each incoming fax."
    },
    {
      "title": "Gather your documents.",
      "content": "Gather your documents. [3] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. Using the original documents instead of photocopies will provide the recipient with a document that is cleaner and easier to read. Use a cover sheet on top of the pages you will fax. The cover sheet should contain information such as the sender's name and fax number, the recipient's name and fax number, the date, and the number of pages included in the fax."
    },
    {
      "title": "Place your documents in the machine.",
      "content": "Place your documents in the machine. Many machines have both a paper feeder and a flatbed screen. If you have only one page, you can use either function. If you have multiple pages, the paper feeder usually works better. When using the paper feeder, you can insert all of your pages at once. Your fax machine should have an icon that indicates which direction that papers should be facing in the paper feeder. Some fax machines also offer the option to scan and fax both sides of a document, so check your user manual to see if this is possible on your machine. [4] X Research source When using the flatbed screen, lift the lid on the top of the machine and place your document face down on the glass screen. Make sure to line your document up with the markings provided on the screen and close the lid before continuing."
    },
    {
      "title": "Enter the fax number.",
      "content": "Enter the fax number. [5] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. When entering the number, be sure to include the area code, country code, and any numbers that you need to dial out. You should enter the number exactly the way you would if you were calling the number using a phone. [6] X Research source"
    },
    {
      "title": "Press the send button.",
      "content": "Press the send button. [7] X Expert Source Mitch Harris Consumer Technology Expert Expert Interview. 31 August 31 2021. After a few seconds, you will hear the machine begin to transmit the fax and the papers will begin feeding into the fax machine. [8] X Research source The button on your machine may say \"go\" or \"fax\" instead of \"send.\""
    },
    {
      "title": "Look for a confirmation message.",
      "content": "Look for a confirmation message. Some machines will display a message on the screen to let you know if your fax was successfully transmitted. If you configured your settings to receive printed confirmations, your machine will print a page that details the status of your fax. [9] X Research source"
    },
    {
      "title": "Choose a program.",
      "content": "Choose a program. When sending a fax from a computer, you will have the option to use software that is installed on your computer or an online service. [10] X Research source Some operating systems come with programs that allow you to send faxes. Windows 7, for example, has a tool called Fax and Scan, which allows you to send a fax without a fax machine. In order to use computer software, you will need to connect your computer to a phone line. If this is not possible, try using an online service instead. There are several online services available, including MyFax, eFax and FaxZero. Some are free, some require a subscription or membership, and some services will ask you to pay per fax."
    },
    {
      "title": "Open the program and create a new fax.",
      "content": "Open the program and create a new fax. Each program is unique, but you should see an option called \"create new fax\" or something similar."
    },
    {
      "title": "Attach your documents.",
      "content": "Attach your documents. In order to fax documents using a computer, you will need to upload them to your message. You should see a button that says \"upload documents\" or something similar. [11] X Research source If you have electronic documents, you can search for them on your computer and attach them to your message. If you have paper documents, you will need to use a scanner to digitize them. If you don't have a scanner, you can also take a picture of the documents and either email it to yourself or upload the picture directly to your computer."
    },
    {
      "title": "Enter the fax number and a message.",
      "content": "Enter the fax number and a message. Type a brief message to your recipient into the space provided on the screen, just as you would if you were sending an email. This will serve as your cover sheet, so there is no need to attach a separate cover sheet. You will also need to enter the recipient's fax number in the TO field. [12] X Research source You may also be asked to type in a confirmation code to prove that you are not a robot."
    },
    {
      "title": "Hit send.",
      "content": "Hit send. Once you have attached your documents, typed your message, and entered the recipient's fax number, hit the send button, and you are done."
    },
    {
      "title": "Download an app.",
      "content": "Download an app. There are a variety of mobile apps available for phones and tablets that allow you to send faxes just as you would from your computer. Some apps, are free, while others may charge a fee. Popular apps include Files Anywhere, Fax Burner, and JotNot Fax. [13] X Research source Some apps will give you a temporary fax number, which may not be ideal if you plan on sending and receiving frequently."
    },
    {
      "title": "Open the app and choose your document.",
      "content": "Open the app and choose your document. Once you open the app on your mobile device, you will be prompted to create a new fax. The first thing you need to do is select the document that you want to fax. [14] X Research source If your document is saved locally on your device, in your email, or in a cloud storage service such as DropBox, you should be able to search for and upload your document from the app. If you have a paper document, you can use your phone or tablet to take a picture of your document and attach it to your message."
    },
    {
      "title": "Enter the fax number and a message.",
      "content": "Enter the fax number and a message. Type a message to your recipient, just as you would if you were sending the fax from a computer. Be sure to enter the recipient's fax number in the TO field of your message. [15] X Research source"
    },
    {
      "title": "Hit send.",
      "content": "Hit send. Once you have attached your documents, typed your message, and entered the recipient's fax number, hit the send button, and your fax will be sent."
    }
  ]
}