{
  "url": "https://www.wikihow.com/Copy-and-Paste-in-Microsoft-Word",
  "title": "How to Copy and Paste in Word on PC & Mac",
  "steps": [
    {
      "title": "Highlight the text you want to copy.",
      "content": "Highlight the text you want to copy. You can highlight words, sentences, paragraphs, or other blocks of text by left-clicking and dragging your mouse pointer over the text."
    },
    {
      "title": "Right-click the text and select Copy.",
      "content": "Right-click the text and select Copy . Alternatively, you can click Copy on the Home tab. This copies the text to your clipboard. Instead of right-clicking the text or clicking Copy , you can also press Ctrl + C (PC) or Cmd + C (Mac) at the same time."
    },
    {
      "title": "Click the location where you want to paste the text.",
      "content": "Click the location where you want to paste the text. This can be anywhere in your Word document. You can even open a second Word document and paste the text there."
    },
    {
      "title": "Right-click the location where you want to paste the copied text.",
      "content": "Right-click the location where you want to paste the copied text. A menu will appear with several options. You'll see a few different icons under \"Paste options\" on the menu. If you just want to quickly insert the text at the desired location, press Ctrl + V' to paste instead."
    },
    {
      "title": "Select a paste option.",
      "content": "Select a paste option. You can now select the paste option that works best for you: Keep source formatting (the clipboard with a paintbrush): This option pastes the selected text with its original formatting. So, if the text was bold, used a different font, or was a different color than the region into which you're pasting it, the text will retain its original features. Merge formatting (the clipboard with an arrow): This option makes the selected text blend seamlessly with existing text while keeping basic formatting changes like bold and italics. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Picture (the clipboard with a photo): This converts the copied text into an image and pastes it as such. Keep text only (the clipboard with an \"A\"): This option strips all formatting from the original copied text and applies the new section's formatting instead."
    },
    {
      "title": "Paste the word(s).",
      "content": "Paste the word(s). Go to the part of your document where you want to place the text(s) that you’ve copied and then click on it. Right-click, and choose “Paste” from the options that appear."
    }
  ]
}