{
  "url": "https://www.wikihow.com/Get-Signed-by-a-Record-Label",
  "title": "How to Get Signed by a Record Label",
  "steps": [
    {
      "title": "Check out your competition.",
      "content": "Check out your competition. Improve your act by studying bands or acts you admire that already signed with labels. What do they do that you don't do? Think about their image, their music, and the way they relate to their fans. [1] X Research source What works in your act? What could you do better? Learning and covering their songs can be a useful exercise. Figure out how they're constructing their music. What can you learn from them?"
    },
    {
      "title": "Be professional.",
      "content": "Be professional. To make it in this business, music has to be your life. Record labels won't throw money at you and hope for the best just because you're a \"promising talent.\" They want to invest in polished, professional acts that will earn them a profit. You have to devote yourself to this path 100% and give it your all. Show the labels your professionalism through your dedication to your craft, product, and image."
    },
    {
      "title": "Practice constantly.",
      "content": "Practice constantly. Practice until you can play each song in your sleep, until the drummer's got every lyric memorized even though he doesn't sing. Set aside time for daily rehearsals, and focus on writing new material. Make the best music you can make. Tape your rehearsals and watch back over the tape for ways you might improve. Polish your live show in the privacy of your practice space. Take risks when nobody will be around to notice. With enough practice, the quality of your gigs will reflect your professionalism and dedication."
    },
    {
      "title": "Consider the commercial possibilities of your music.",
      "content": "Consider the commercial possibilities of your music. You need to strike a balance between your artistic vision and how marketable your music is. Your experimental jazzcore opera might be an awesome artistic direction to explore, but labels won't want to sell it. You need to make music that will appeal to a broad audience. Would your grandfather like your music? Would your friends? Would someone who didn't speak English like your songs? Give your audience some thought. Make the music you want to make, but be realistic about your goals. If you don't want to compromise your vision, you might need to reconsider your major label aspirations. Focus instead on developing a fan base that will love your corner of the music world."
    },
    {
      "title": "Start booking shows locally.",
      "content": "Start booking shows locally. When you have a solid set of material together, start booking local shows at coffee shops, bars, or other venues that host music. Before booking a gig, check out some shows at potential venues. Make sure the \"regular\" crowd will enjoy the style of music you play. Play 1-2 shows a month at first, until you've built up a steady local following. Then, you can start playing weekly in local venues and branch out into more regional shows. Don't plan a larger tour until you know you can play your set weekly without any hiccups."
    },
    {
      "title": "Play with similar bands.",
      "content": "Play with similar bands. The best way to develop your following is to attach yourself to other local bands, or a \"scene\" that has already built one up. Attend the gigs of local bands you like, and ask if you can open for them at future shows. Invite them to come check out a practice, or point them toward your music online. You can also set up your own gigs and ask other bands to play with you. They might return the favor. Note that asking an experienced and popular band to open for your small, unknown act could come across as rude. Out of respect, offer to let them play last or choose their own slot. When you join a \"scene\" and become part of a community, other bands will be more willing to share resources and tips with you. If you need to borrow an amp or need studio connections for recording, turn to these new relationships."
    },
    {
      "title": "Market your band using social media.",
      "content": "Market your band using social media. Announce your shows and release any recordings you've made to keep in touch with new fans. When labels sign new acts, they're looking for scenes with a base that has already been built up. The most popular social media platforms among older users (18-34) are Facebook and Twitter. [2] X Research source However, TikTok, Snapchat, and Instagram are more popular with younger audiences (14-17). Encourage your followers to check out bands you've played with before. If you cultivate a presence in the scene, people will be more likely to check out your stuff. It's hard to get people out to your show on a Saturday night if you didn't go see them on Friday."
    },
    {
      "title": "Make awesome t-shirts.",
      "content": "Make awesome t-shirts. T-shirts are incredibly popular merchandise, and cheap to make compared to a professional recording. People like to buy merchandise at gigs, and t-shirts are a great way to make a little cash. Not only will the profits keep your band going, but you also get free marketing every time someone wears your shirt! Exchange t-shirts with other bands so you can wear each other's shirts on stage. Cross-marketing benefits everyone in the scene. When the scene is strong, everyone in it gets closer to landing a record contract."
    },
    {
      "title": "Take your show on the road.",
      "content": "Take your show on the road. You don't want to play too often in the same scene, or you might start boring the regulars. Crack your way into other venues and scenes to build a wider fan base in your area. Book a short tour with some other bands, visiting a few cities where someone might have friends with a big basement you can all crash in. Call local festivals and find out who you might be able to open for. Sign up for band contests sponsored by local radio stations or concert halls. Have someone video your shows and ask about having them played on public access TV shows."
    },
    {
      "title": "Save your money.",
      "content": "Save your money. The first time you book a show that gets a $100 payout is thrilling: You did it! You're making money playing music! It's tempting to blow it all on a celebratory party, but don't do it. Start a bank account specifically for the band, and save as much money as you possibly can. Use this account for \"band expenses\" only. New guitar strings, upgraded equipment, or rent for a practice space all cost money. To get signed to a label, you'll need a solid demo recording, and those usually require money. Recording a demo is essential, especially so you can have a better feel of the song. It will sound really different from singing live, so you better work on it. Before you commit with an expensive studio, try to record your demos at a home studio so you get the feeling of it."
    },
    {
      "title": "Put videos of your music on YouTube.",
      "content": "Put videos of your music on YouTube. YouTube is a powerful free platform for getting your music to a wide audience. Many successful musicians found their start on YouTube, from Justin Bieber and Carly Rae Jepsen to Soulja Boy and Cody Simpson. Open yourself up to an audience far beyond your local community. You can potentially reach new fans all across the globe. Make a video recording of yourself or your band playing your songs. You don't need fancy equipment — the built-in camera on your computer or phone, will suffice. Open a YouTube account with your Gmail login information. [3] X Research source Upload videos to your account. This process is so simple, you can even do it from your phone. Share links to your music on your social media accounts. Spread the word! People who might not be willing to attend live shows might be more likely to click a link and discover they love your sound."
    },
    {
      "title": "Find a studio and book some time.",
      "content": "Find a studio and book some time. Recording an amazing demo is a great way to get noticed by a record label, but your fans will also love it. Give them some of those songs they love hearing you play live, plus some new ones they haven't heard yet. Studio costs can vary, anywhere from $15 to $200 dollars an hour for the initial recording. In general, it costs more to have the recordings mastered. Because of the high cost, limit your demo to one or two of your best songs. Plan how you'll record them quickly and effectively ahead of time."
    },
    {
      "title": "Plan your studio time.",
      "content": "Plan your studio time. Different recording engineers or producers will organize a recording session differently. Make sure you've got your end of the deal —the song— down as much as possible. [4] X Research source If you know your material inside and out, you won't need multiple takes to get it right. Research the process and facilities before booking time anywhere. Know whether your band members are more comfortable recording separately or together as a whole band. How much direction do you want from your engineer? Don't record on equipment you're unfamiliar with. Twiddling about with fancy amps and guitar pedals can't afford is tempting, but it will eat up your studio time. You also don't want your demo to have sounds you can't reproduce on your own."
    },
    {
      "title": "Record your best original songs.",
      "content": "Record your best original songs. Don't include any covers on a demo, or anything significantly different from the majority of your material. Think of your demo as your band's resume. Which of your songs best represents your music? What songs do your fans like best? The demo session isn't the time to indulge the brand new song you haven't worked out yet or try to start free-styling on a new beat. Record what already works."
    },
    {
      "title": "Try recording yourself.",
      "content": "Try recording yourself . With a decent laptop and some cheap mics, you can make a professional sounding recording and have it up on the Internet in an afternoon. Increasingly, bands are recording themselves to avoid expensive studio costs. Save your money for other things, like touring and buying better equipment. If you own a recent Mac, it likely came with GarageBand recording software pre-loaded on it. [5] X Research source If not, you can purchase it in the Apple app store at low cost. [6] X Research source Apple also offers Logic Pro X, which has more professional features but costs a lot more. [7] X Research source Audacity is a free, open-source recording software that works on computers running Windows, Mac OS, and GNU/Linux. [8] X Research source Explore cheap or free recording options in the scene. Let your friends open for you on your next tour if they'll record you for free on their equipment. Ask around and see if any other bands have gotten deals. Musicians are usually willing to share information if you're willing to share back."
    },
    {
      "title": "Share your music.",
      "content": "Share your music. Today's technology lets you bring your music to a wide audience easily and cheaply. You should take advantage of it! Share videos and recordings of your music on YouTube and Sound Cloud for free. The process of signing up for an account is simple, and you can reach a large audience. You can apply directly to iTunes to get them to carry your music, but they review all material before making decisions. [9] X Research source You might use a third party \"aggregator\" that will help you put your best face forward for a fee. [10] X Research source Spotify will not work directly with artists. Have your label, distributor, or an aggregator contact them about carrying your music. [11] X Research source Don't worry about making a profit yet — focus on increasing your popularity. The industry is moving away from the album model toward one based on Internet popularity. If you get a million views on YouTube, you'll be hearing from a label."
    },
    {
      "title": "Research record labels.",
      "content": "Research record labels. It does you no good to shop your demo with labels that don't sign acts that play your style of music. Where have your favorite acts signed? Do they accept unsolicited demos?"
    },
    {
      "title": "Reach out to labels that fit your act.",
      "content": "Reach out to labels that fit your act. Once you've found a strong list of potential homes, find their addresses. Send them your demo or press pack and point them toward your music online. Call to follow up and make sure they received the package."
    },
    {
      "title": "Consider hiring a manager.",
      "content": "Consider hiring a manager. If you've started to experience some success, an experienced manager will be a strong asset. Managers know the ins and outs of the industry. He or she may be able to help you book better gigs and secure an entertainment attorney when the time comes."
    }
  ]
}