{
  "url": "https://www.wikihow.com/Drill-Ceramic-Tile",
  "title": "How to Drill Ceramic Tile",
  "steps": [
    {
      "title": "Clean the tile's surface.",
      "content": "Clean the tile's surface. Wipe the tile with a rag soaked in mild soap and water. Examine the cleaned surface for damage. If the tile is cracked, you'll need to replace it before you continue."
    },
    {
      "title": "Choose a drill bit.",
      "content": "Choose a drill bit. An ordinary steel drill bit may fail to penetrate the tile, or cause it to shatter. Instead, use an abrasive bit, like a diamond drill bit. [1] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. Search for an appropriate bit using the following guidelines: Glass or tile bits are shaped to reduce the risk of shattering brittle materials. These should be carbide-tipped. Diamond bits are more expensive, but can drill through extra-hard tiles. You may need these for modern porcelain tiles (made since the late 1990s), because they’re much harder than ceramic tiles. [2] X Research source Masonry bits are made from carbide-tipped steel. These are strong enough to drill through, but their shape increases the risk of shattering porcelain and other brittle tiles. As a last resort, use high speed steel (HSS) bits. Expect these to wear down after one or two holes. [3] X Research source If drilling a large hole for plumbing installation, use a hole saw bit made from one of the above materials. Make sure its central pilot bit is also made from a suitable material."
    },
    {
      "title": "Wear safety glasses.",
      "content": "Wear safety glasses. Ideally, the tile should not chip or break. In the event that it does, your eyes should be protected."
    },
    {
      "title": "Cover the area with masking tape.",
      "content": "Cover the area with masking tape. Tape over the area in an X shape, marking the site of the hole. This will help give the drill bit some traction, reducing the chance of it slipping. The tape also makes chipping less likely on the outer rim of the hole."
    },
    {
      "title": "Tap the drill bit in lightly with a hammer.",
      "content": "Tap the drill bit in lightly with a hammer. A drill bit may skip and jump around on the tile's smooth surface, unless you make a small pilot hole to steady it. Hold the drill bit over the center of the X and tap it in with a hammer. Tap gently to avoid damage, repeating until you've made a small dent through the surface of the glaze. [4] X Research source If you're using a solid drill bit larger than 1 ⁄ 4 inch (0.6 cm), consider drilling a pilot hole with a smaller bit first."
    },
    {
      "title": "Drill through the tile slowly.",
      "content": "Drill through the tile slowly. Set your drill to the lowest speed and apply modest pressure to the surface. Work slowly, as this will help prevent the tile from cracking. [5] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. This may take three or four minutes. Applying too much pressure can cause the tile to blow out and crack on the backside, creating a weak spot in the tile and often a much larger hole than originally intended. Diamond bits are especially vulnerable to damage from fast drilling. Drill no faster than 600 rpm for diamond bits below ½ inch (1.25 cm), or 450 rpm for bits from ½ to 1 inch (1.25—2.5 cm). [6] X Research source"
    },
    {
      "title": "Lubricate with water as you drill.",
      "content": "Lubricate with water as you drill. Friction from drilling hard materials creates a great deal of heat, which can scorch the drill bit or even break the tile. Protect your project and extend the lifespan of the drill with a constant trickle of water. You may use a small hose, or an assistant with a squirt bottle or glass of water. \"Pump\" the drill every 15 to 20 seconds with a tiny up-and-down motion. This draws water to the tip of the bit, where friction is greatest. [7] X Research source The drill bit should never feel more than slightly warm. If it gets hot, stop and wet it until it cools down. You can also dip the drill bit into a little water periodically to keep it wet. [8] X Expert Source Art Fricke Home Renovation & Repair Specialist Expert Interview. 1 July 2020. As an alternative, lubricate the drill with drilling oil."
    },
    {
      "title": "Penetrate the backing board.",
      "content": "Penetrate the backing board. You can switch back to a regular drill bit for this process if you prefer. Continue to drill slowly and patiently, as it is just as important to maintain the wood or drywall behind the tile. Damaging the backing board can make it difficult to anchor your screw or whatever you plan to insert. [9] X Research source"
    },
    {
      "title": "Fill hairline cracks with epoxy or tile filler.",
      "content": "Fill hairline cracks with epoxy or tile filler. You can repair hairline cracks without having to replace the tile, as long as the tile is still firmly set. You can use specialized ceramic tile repair kits, but a two-part ceramic epoxy will work fine. Mix the two components together using a piece of scrap wood, then spread over the crack using a clean rag. Wipe up the excess using a second rag. [10] X Research source Take care not to get the epoxy in the grout lines between tiles."
    },
    {
      "title": "Add color to hide the repair.",
      "content": "Add color to hide the repair. There are two ways to make the repair invisible: Before filling, mix the epoxy with epoxy tint the same color as the tile. Or , after filling, paint over the repair using an oil-based enamel paint marker."
    },
    {
      "title": "Select a replacement tile for more severe damage.",
      "content": "Select a replacement tile for more severe damage. Purchase a replacement tile for any damage wider than a hairline crack. Bring the tile to a home repair store to find a match for size, shape, and pattern. Note the thickness of the tile as well. A thinner replacement will need a layer of mastic to raise it. [11] X Research source"
    },
    {
      "title": "Remove surrounding grout.",
      "content": "Remove surrounding grout. Carefully cut away the grout around the broken tile. A grout saw will make this task go faster, but you can use a hammer and chisel instead. Work slowly all the way around the tile, to allow for safe removal without damaging the surroundings."
    },
    {
      "title": "Break away the rest of the tile.",
      "content": "Break away the rest of the tile. Use a hammer and large chisel to break the tile apart. Angle it away from you and start from the center to reduce damage to backing. [12] X Research source Wear gloves and safety glasses. Lay down cloth to protect surrounding surfaces from ceramic shards."
    },
    {
      "title": "Replace tile adhesive.",
      "content": "Replace tile adhesive. Scrape off the existing adhesive using a putty knife. Spread a new layer of thin-set mortar onto the wall or floor. Follow label instructions for mixing the mortar. You may need to wear a dust mask."
    },
    {
      "title": "Press in the new tile.",
      "content": "Press in the new tile. Make sure the tile is flush by tapping it in place with a rubber mallet, or a piece of wood wrapped in cloth. [13] X Research source Scrape out any excess mortar from the grout lines with a screwdriver."
    },
    {
      "title": "Replace the grout.",
      "content": "Replace the grout. Let the tile dry overnight, or as specified in your mortar instructions. Mix the grout, then add a thin line around the tile using a plastic putty knife. After a week, apply grout sealer over the grout to protect from moisture. [14] X Research source"
    }
  ]
}