{
  "url": "https://www.wikihow.com/Get-Ready-for-a-First-Date-(Teen-Girls)",
  "title": "How to Get Ready for a First Date (Teen Girls)",
  "steps": [
    {
      "title": "Take at least an hour and a half, maybe two hours, to get ready.",
      "content": "Take at least an hour and a half, maybe two hours, to get ready. Make a list of everything you want to get done before your first date, and calculate how long it will take. (example: Taking a shower, blow-drying hair...) This is a good time to think of some fun topics or questions to ask them to keep the conversation fun and interesting. Think of something funny that happened to you recently to share - don't bring up how you hate your mom or why your sister is the worst - save drama for later. Maybe you learned what fleet means or your soccer team did something cool - stories that are fun and show off that you are relaxed and go with the flow but can also make fun of yourself and others. A lot of people like that."
    },
    {
      "title": "Listen to empowering music, your favorite bands, or anything feel good and optimistic in the background.",
      "content": "Listen to empowering music, your favorite bands, or anything feel good and optimistic in the background."
    },
    {
      "title": "Take a steam shower/bath.",
      "content": "Take a steam shower/bath. Make sure your parents have a steam shower first. If not, sit in a bath. Go nuts with those bath bombs - but don't trip out. Sometimes hours can go by as you watch that orange zesty fizz. Don't miss your date but maybe use some of your bath salt stash instead to be safe. Epson salts keep your muscles relaxed. Shampoo and condition your hair well. Wash your body to cleanse and have a good smell when you're on the date. When in the shower/bath, if needed, shave anything you feel needed (Legs, armpits...)."
    },
    {
      "title": "Towel/air-dry your hair and don't comb/brush through it until it's at least partially dry.",
      "content": "Towel/air-dry your hair and don't comb/brush through it until it's at least partially dry. For blow-drying/ironing, do it when hair is still damp and don't wait too long. Put some hair cream in it to keep it looking healthy and finger combing works best for not ruining done-hair."
    },
    {
      "title": "Read magazines and helpful tips online from people with dating experience.",
      "content": "Read magazines and helpful tips online from people with dating experience. Take dating quizzes, Google teen dating tips, talk to friends even. (Try Cosmo Girl and Seventeen for teen dating advice)"
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. For a bit of taste add the juice from a lemon/orange or some water Flavoring Drink Mix. Try to avoid anything fat or sugar-y the few hours before the date, so you can eat at the date and still look fit."
    },
    {
      "title": "Do meditation before.",
      "content": "Do meditation before. Don't know how? Sit on a comfy couch, bean bag, floor, carpet... in a comfortable position that isn't slouched or lazy, (pick a spot away from people, somewhere private and quiet, close your eyes, and think happy thoughts. Don't think about the date, and don't analyze yourself or them. Think or something relaxing, something that makes you feel good. It doesn't have to be cheesy, but it has to be comforting. Do it with classical or Harmonica music in the background, and do it before you get dressed."
    },
    {
      "title": "If you paint your nails, paint them in a color that matches your style.",
      "content": "If you paint your nails, paint them in a color that matches your style. Do either something creative and wacky, or simple and basic. When it comes to nails, you can hardly go overboard, and it's a good way to be expressive and make a statement without being judged."
    },
    {
      "title": "Pick the outfit according to:",
      "content": "Pick the outfit according to: The occasion Your style and personality The weather Check out what wikiHow users suggest you wear on the \"What do I wear on a first date?\" forum page."
    },
    {
      "title": "Be self aware.",
      "content": "Be self aware. When choosing an outfit know what flatters you, and what makes you feel more secure and comfy. If you're young, don't feel like you have to dress \"sexy\" or older than you feel to impress your date. If you're older, showing a little skin isn't bad, but again, don't feel forced. If you have an area that you're insecure about, cover it up a bit, but put more focus on things you love. This will make you feel more confident. For example, if you don't like your legs but feel great about your face, wear a maxi skirt with a flattering top and a statement necklace to bring attention upwards."
    },
    {
      "title": "Put some thought into your underwear situation — as bad as it sounds, we all wanna look good under.",
      "content": "Put some thought into your underwear situation — as bad as it sounds, we all wanna look good under. Even if you aren't gonna get anywhere, wear a color-coordinated set of underwear, something that won't be noticed from above (panty lines!) that are both flattering and unseen to the eye. Wear something form-fitting and your size. Wear a bra if you need, ask a close friend or a female in your family if you're not sure if you need or not, and tell them to be frank. This is a good idea as it often makes you feel more self confident, even if you won't be getting that far."
    },
    {
      "title": "Apply makeup according to the occasion and your personal preference.",
      "content": "Apply makeup according to the occasion and your personal preference. For example, if you're seeing a movie, you'll be in the dark so you don't need so much. If it's raining or very hot, or you're going swimming, you'll need to set your makeup well and wear waterproof products. Be careful not to apply too much or it may give you a bad impression of insecurity or trying too hard. Also be sure that if you're young that your parents are okay with you wearing makeup."
    },
    {
      "title": "Put make-up on to highlight your good areas if you wear any rather than covering up bad ones.",
      "content": "Put make-up on to highlight your good areas if you wear any rather than covering up bad ones. If you have beautiful eyes, put on some eyeliner and mascara, those basic eye makeups always do best. Put lip gloss and foundation if you'd like, then you're out the door. If you have a zit, or a problem area, put oil-free make-up on it, just a pea size though, spread it a bit, then don't touch it anymore."
    },
    {
      "title": "Decide how to wear your hair.",
      "content": "Decide how to wear your hair. Most people prefer putting their hair down on dates, but try out updos too. They make you look taller and longer, which makes you look thinner and it brings out eyes and makes you look more mature. Otherwise, don't always blow-dry. Fun waves and curls are fun too, and these days original, and it makes you look like a natural beauty. If you have curly hair, a ponytail looks the best, with a pair of nice earrings- that's real nice ."
    },
    {
      "title": "Pick good shoes.",
      "content": "Pick good shoes. If you know you're going to be walking quite a bit then put shoes that match your outfit yet are walkable and comfy. If you don't know how to walk in heels, don't wear them on a first date- practice first."
    },
    {
      "title": "Brush your teeth.",
      "content": "Brush your teeth. Bad breath is a big turn-off, and it's especially useful if you want a goodnight kiss at the end of the date. Brushing and flossing on a regular basis is all you need. If you're still feeling insecure, take breath-mints or sugar-free minty bubblegum, but it's not a replacement for actually brushing your teeth. Mouthwash when you're done."
    },
    {
      "title": "Wear perfume.",
      "content": "Wear perfume. Wear something age appropriate that you like, such as a fruity body mist like Victoria's Secret. Spray once on one of your wrists but avoid rubbing your wrists together or against any other surface because the odor particles in the fragrance break down, making the scent dissipate quickly."
    },
    {
      "title": "Wear deodorant.",
      "content": "Wear deodorant. Perfume is not a replacement for deodorant. Deodorant is far more important than perfume. Put an extra deodorant in the purse you're taking to the date, and go to the bathroom one time during the date to put more on."
    },
    {
      "title": "Organise your purse.",
      "content": "Organise your purse. Are there drugs? Double-check. You might get bored or gassy. Sometimes your stomach knots up with nerves so keep some antacids or anti-gas tablets if you're anxious.Cellphone (don't use it too much during the date), iPod (to listen to while waiting), keys, bubble gum or breath-mints, deodorant, tissues, money, lip gloss (apply regularly). Ask them to carry your purse if you wanna have a little fun."
    },
    {
      "title": "Go easy on jewelry, but accessorize well.",
      "content": "Go easy on jewelry, but accessorize well. Wearing bracelets and necklaces that match and make a statement is always a plus, 1-3 rings are okay, earrings are always good (hoop earrings are a bit a few years ago though, best are studs and ones that stick close to the ear, or drops)Wear a cool belt, or a brooch to match your outfit and make it special, but it's on of those things where you can actually go overboard. Don't go too kitschy, or clichéd or out-there, especially if you're just going to the mall. A statement necklace brings attention to your face."
    },
    {
      "title": "Remember that they are probably nervous too.",
      "content": "Remember that they are probably nervous too. Never talk about being nervous, it sounds good but it ends up being weird, good luck!"
    }
  ]
}