{
  "url": "https://www.wikihow.com/Draw-a-Person-with-Down-Syndrome",
  "title": "How to Draw a Person with Down Syndrome",
  "steps": [
    {
      "title": "Draw the person's general face shape, along with guidelines representing the horizontal and vertical center lines.",
      "content": "Draw the person's general face shape, along with guidelines representing the horizontal and vertical center lines. Give the face plenty of roundness—a person with Down Syndrome will not have an angular face. People with Down Syndrome tend to be heavyset. Even if this character is a muscular athlete, they will have a very clear softness in their face and body. Make the cheeks full. Just like people without Down Syndrome, people with Down Syndrome can have a variety of face shapes. Your character's face shape may be round, oval, heart, et cetera."
    },
    {
      "title": "Sketch the neck and shoulders.",
      "content": "Sketch the neck and shoulders. Your character should have a thick, short neck. Make the shoulders proportionate based on your character's age and the style of your art. Use the collarbones to help guide you in the pose."
    },
    {
      "title": "Draw the eyes.",
      "content": "Draw the eyes. The eyes should be widely-spaced, and positioned lower on the face than average (leaving a big forehead). Note the clear almond shape of the eyelids: a bigger swoop on top, and a smaller one on bottom. Both lids should be angled upwards at the outsides. For extra detail, show a hint of puffiness under the lower lid. This is a common feature of people with Down Syndrome."
    },
    {
      "title": "Sketch the nose and eyebrows.",
      "content": "Sketch the nose and eyebrows. People with Down Syndrome usually have a button nose, wider at the bottom, with a relatively flat nose bridge. Take age into consideration: on a baby or small child, the bridge will be barely visible, while it will be much more defined in adulthood. The girl in the picture is in her mid teens. The nose bridge extends to the eye socket. Follow this curve to draw the eyebrows. A few people with Down Syndrome have unibrows."
    },
    {
      "title": "Draw the mouth.",
      "content": "Draw the mouth. People with Down Syndrome may not have perfect control over their mouth muscles, so you may want to go with a more rounded and relaxed shape. Avoid sharp corners. Add lips if desired. Make the lips more rounded for a feminine look, and more squarish for a masculine look."
    },
    {
      "title": "Sketch the hair.",
      "content": "Sketch the hair. Most people with Down Syndrome have fine hair that is straight or slightly wavy. Use thin, flowing lines that follow the shape of the hair and the contours of the head. For bangs, use dense lines, with the most lines at the ends. Give a them a rounded shape."
    },
    {
      "title": "Add any other details.",
      "content": "Add any other details. Consider glasses, freckles, jewelry, and props. (This girl is wearing headphones.) Refine your sketch. A good way to check your picture is to view it backwards. Digital artists can flip the sketch in their drawing programs. Traditional artists can hold up their drawing, with the sketch side facing a light or window. They can then see the image reversed through the paper."
    },
    {
      "title": "Lower the opacity of your sketch and line the picture.",
      "content": "Lower the opacity of your sketch and line the picture. Use thicker lines for basic shapes and areas you want to call attention to, and thinner lines for smaller details such as hair, eyebrows, freckles, and glasses. Keep your lines rounded and organic. You may line your drawing entirely in black, or use some other colors as well (e.g. brown for the eyebrows)."
    },
    {
      "title": "Add small black shadows for the darkest parts of the picture.",
      "content": "Add small black shadows for the darkest parts of the picture. This includes general shadows such as the area under the chin, and places of overlap such as the area around the headphone and the hand. Darken lines you want to emphasize, such as the outline of the face and eyes. Darkening the corners of a smile will make it look more cheerful. However, too much of this may start to make the character look like they might not have Down Syndrome. Zoom out, or place your picture on the other side of the room, to see how balanced it looks. Refine as desired."
    },
    {
      "title": "Fill the background with a color besides white and start shading the face.",
      "content": "Fill the background with a color besides white and start shading the face. The nonwhite background color will encourage you to use contrast. Many people with Down Syndrome have a cool complexion, so use cooler and desaturated tones. Take care to keep the cheeks looking full and rounded. Many white people with Down Syndrome have extremely fair complexions. Think of the nose as an elongated teardrop. The deepest shadow is usually directly below the nose, with some shading on either side and a lighter part on the middle."
    },
    {
      "title": "Shade the teeth and the whites of the eyes.",
      "content": "Shade the teeth and the whites of the eyes. Fill them both with a medium grey-brown color and work your way up to a near white tone. The deeper tones will suggest shadows cast by the eyelids and the corners of the mouth, and it will look more three-dimensional. It is normal for work to look creepy at this stage. It will improve once the eyes are finished."
    },
    {
      "title": "Color the eyes.",
      "content": "Color the eyes. Start with your darkest color, working up to the lightest one. Many people with Down Syndrome have Brushfield spots—little whitish dots in the iris, close to the pupil. The top eye on the right shows how the eyes were shaded. The bottom eye shows the same eye with Brushfield spots."
    },
    {
      "title": "Shade in the hair.",
      "content": "Shade in the hair. Flick your brush in the same direction that the hair flows. Apply the darkest color to the edges of the hair, and put layers of lighter colors on top. This artist added the lightest color in a stripe on top."
    },
    {
      "title": "Color in the lips, shirt, and any remaining props.",
      "content": "Color in the lips, shirt, and any remaining props. If the character is wearing lipstick or lip gloss, add a highlight or two on the lips as shown above. The shirt does not need to be detailed, as the focus is on the face."
    },
    {
      "title": "Color your background as desired and fine-tune your image.",
      "content": "Color your background as desired and fine-tune your image. Look over the shading and consider tweaking the colors. This artist added a Gradient Map layer at 15% opacity to enhance the color. Now is a good time to zoom out or stand back from your artwork again to see how it looks from a distance. You may also notice things needing correction—for example, the mouth was made less pointy. Don't forget to sign your work!"
    }
  ]
}