{
  "url": "https://www.wikihow.com/Diagnose-Dysplasia-in-Rottweilers",
  "title": "How to Diagnose Dysplasia in Rottweilers",
  "steps": [
    {
      "title": "Look for an unstable rear end.",
      "content": "Look for an unstable rear end. For young dogs, the first sign is usually that the dog has wobbly rear legs, has difficulty climbing stairs, or is unable to jump into a car. It may also not be able to run and exercise easily, as you would expect a young dog to do. Dogs that are 6 - 12 months old can present with sudden back end lameness, or their symptoms may just gradually worsen."
    },
    {
      "title": "Watch out for a dropped back or awkward movement.",
      "content": "Watch out for a dropped back or awkward movement. If both hips are affected, the dog may stand with a clearly dropped rear end. It may also move in a bunny-hop motion, swinging both back legs forward at the same time instead of moving them independently. [2] X Research source"
    },
    {
      "title": "Be on the look out for a change in character.",
      "content": "Be on the look out for a change in character. Pain may cause the Rottweiler to be less tolerant than it was previously. Rottweilers need a lot of exercise. If they are unable to do this they can grow bored and may display a tendency toward aggression. Some dogs may react aggressively because of pain, if you go to stroke or touch the hip area."
    },
    {
      "title": "Pay attention to limping and muscle wasting.",
      "content": "Pay attention to limping and muscle wasting. In older dogs, the key symptom of dysplasia is back end lameness. Thus, a dog may walk with a limp and when you look at it from behind you may notice there is less muscle mass on the most severely affected leg. [3] X Research source Dogs with hip dysplasia have a tendency to rest the sore leg when standing. They may also exhibit hesitation before moving from a standing position."
    },
    {
      "title": "Take your dog to the vet if you suspect dysplasia.",
      "content": "Take your dog to the vet if you suspect dysplasia. If you notice your Rottweiler has mobility issues, then the next step is a vet check. The vet will watch the dog walking, running, and how it copes with stairs. This will help the vet to see which leg is most painful and how badly affected it is. The vet then performs a physical examination, which also includes testing the dog's nerve reflexes by turning the paw upside down and pinching the toes. This helps to if the problem is physical (with the joints) or neurological (with the nerves.) The vet then carefully manipulates the legs, flexing and extending each joint to test if the movement is normal or restricted. This also helps to confirm which areas are tender or sore."
    },
    {
      "title": "Discuss additional testing with the vet.",
      "content": "Discuss additional testing with the vet. Based on this exam, the vet may suggest taking x-rays of the dog's hip joints. This is best done under anesthetic, because meaningful x-rays require the vet to put the dog's legs in positions which would be too painful for a conscious dog. Any time a dog is put under anesthesia there is a risk to the dog's health and an added cost that you will need to approve. Also, while the dog is anesthetized and relaxed, the vet can perform special tests. These involve testing the amount of movement out of the joint to see if it is within normal limits or not. A bone that has moved out of its joint is going to be more painful, because the bones are constantly banging against each other."
    },
    {
      "title": "Talk to your vet about the diagnosis.",
      "content": "Talk to your vet about the diagnosis. To reach a diagnosis of hip dysplasia the x-rays must show problems associated with hip dysplasia and the dog must have a long-term lameness problem. One problem with diagnosing hip dysplasia is that the x-rays need to be interpreted in light of the physical symptoms (lameness) and amount of the discomfort the dog is in. Some dogs have what appears to be poor hip anatomy that is discovered by accident when the dog is radiographed for a different reason, and yet they have no lameness or apparent pain in the hips. The vet assesses the x-rays by looking at things like the shape of the femoral head (round vs square), how deeply the femur sits in the hip bone, and the angle at which the femoral head joins onto the thigh bone. The latter matters because dysplastic hips often have a poor angle which means when the thigh muscles contract they pull at an odd angle. [4] X Research source"
    },
    {
      "title": "Follow your veterinarian's suggestions for treatment.",
      "content": "Follow your veterinarian's suggestions for treatment. Hip dysplasia is a painful condition and so your vet will prescribe pain relief for long-term use. Typically this is a medication from the nonsteroidal antiinflammatory (NSAID) family. If the problem is severe, there are a number of surgical procedures which can be done. These range from a femoral head excisions (where the femoral head is removed so it no longer bangs against the acetabulum) to a total hip replacement. [5] X Research source"
    },
    {
      "title": "Don't breed dogs with the condition.",
      "content": "Don't breed dogs with the condition. It is important not to breed dogs that have hip dysplasia, as it will be passed onto their puppies. To reduce the incidence of hip dysplasia, good breeders now screen breeding stock for the condition. Thus, only dogs screened by the Orthopaedic Foundation for Animals and found to have good hips scores should be used for breeding. [6] X Research source By breeding from Rottweiler's with healthy hips, in time, the breed's health will improve and countless owners will be spared the heartbreak of seeing an active dog struggling to move and in constant pain. [7] X Research source Make sure any Rottweiler puppy you purchase comes from a reputable breeder who actually follows these guidelines. This is important for the future health of a dog you adopt. It is also important to avoid supporting breeders who continue to encourage this problem through bad breeding practices."
    },
    {
      "title": "Feed your dog special large breed food.",
      "content": "Feed your dog special large breed food. The deterioration can be hastened by a poor diet that is not balanced to provide the slow, sustained bone growth of a large breed such as a Rottweiler. To this end, it is best to feed a special diet designed for \"large breed growth.\""
    },
    {
      "title": "Avoid excessive amounts of exercise for puppies.",
      "content": "Avoid excessive amounts of exercise for puppies. Excessive amounts of exercise in a puppy can also make the joints more vulnerable to damage. This can accelerate the onset of the disability caused by dysplasia. Try to give your dog low-impact exercise. This means exercise that is easier on the joints, such as walking or swimming. This will allow the dog to burn off some of its energy, while not threatening the future health of its joints. [8] X Research source Older dogs with bad joints need to have controlled amounts of exercise as well, but they usually do not have the energy or youthful enthusiasm that makes this kind of exercise likely."
    },
    {
      "title": "Learn what dysplasia is.",
      "content": "Learn what dysplasia is. This is the abnormal development of the joints, usually as a result of genetic disease being passed down from parent to pup. A healthy hip joint is a ball and socket design, which consists of a round femoral head (the top of the thigh bone) fitting neatly in the acetabulum (the cup on the pelvis which forms the hip joint), so that the hip joint moves smoothly without any grating or bumping. [9] X Research source A dysplastic hip joint has a number of features including a poorly shaped femoral head that has flat edges or is square-shaped, sitting in a shallow acetabulum. This means when the hip moves it catches and rubs, which causes discomfort and pain. [10] X Research source"
    },
    {
      "title": "Learn about the progression of the disease.",
      "content": "Learn about the progression of the disease. Dysplasia is a slowly progressive disease, where poor joint anatomy gradually deteriorates over time with the development of secondary arthritis. As the animal ages, the continued trauma to the hip joint causes premature arthritic changes with new bone being laid down. This compounds the problem and impedes hip movement even more. [11] X Research source Remember, dogs as young as 6 months can be affected. Don't assume that problems in a young dog cannot be dysplasia."
    },
    {
      "title": "Understand that dysplasia can occur is a variety of places on the body.",
      "content": "Understand that dysplasia can occur is a variety of places on the body. In the Rottweiler, it is the hip joints that are commonly affected. In other breeds different joints may be affected, such as the elbows in Labrador retrievers. [12] X Research source"
    }
  ]
}