{
  "url": "https://www.wikihow.com/Get-Nail-Polish-out-of-Clothes",
  "title": "How to Get Nail Polish out of Clothes",
  "steps": [
    {
      "title": "Make sure your clothing fabric is safe for the product you choose.",
      "content": "Make sure your clothing fabric is safe for the product you choose. Acetone is generally safe for application to cotton, silk, denim, and linen; check the tag on your clothing to make sure it’s made from one of those materials. If not, do not use the acetone method on that garment. Hydrogen peroxide is a form of color-safe bleach, so it will probably not damage your clothing; however, know that leaving it on your fabric for an inordinate amount of time without rinsing may result in color damage. [1] X Research source Do not use acetone if your garment is made from materials including acetate or triacetate, as the material will be damaged by the application of acetone. If you’re not sure about the composition of the garment, or if you just want to be extra safe, test the product you choose on a very small area that will not be highly visible. For example, use the part of the collar that falls along the nape of the neck and can be covered with long hair, or use the bottom of the shirt if it’s a shirt that is tucked in."
    },
    {
      "title": "Purchase acetone, rubbing alcohol, or hydrogen peroxide.",
      "content": "Purchase acetone, rubbing alcohol, or hydrogen peroxide. You can find any of these products in the cosmetics and/or health section of any grocery or convenient store. Look for nail polish removers that use acetone as their active ingredient if you can’t find pure acetone. [2] X Research source"
    },
    {
      "title": "Place the fabric over a layer of paper towels.",
      "content": "Place the fabric over a layer of paper towels. This is to prevent the nail polish from getting onto another surface when it comes loose from the fabric; it will get onto the paper towels instead. The stained area of the garment should be touching the paper towels directly, as you will blot at it from the back of the stain. [3] X Research source"
    },
    {
      "title": "Blot the stain remover onto the back of the stain.",
      "content": "Blot the stain remover onto the back of the stain. You can soak more paper towel in the product if that’s all you have, but cotton balls are the best way to blot at your stain. This will loosen the nail polish from the fabric and gently transfer it to the layer of paper towels underneath it. [4] X Research source Make sure to blot, not rub; rubbing can spread the stain and make it messier.You’re trying to press the nail polish loose and encourage it to bind to the paper towel to get rid of the excess polish."
    },
    {
      "title": "Rinse your garment.",
      "content": "Rinse your garment. Run warm water over the stained area in a sink or bathtub. You can rub gently at the stain with your finger, but again, avoid spreading the stain around."
    },
    {
      "title": "Repeat the blotting procedure if necessary.",
      "content": "Repeat the blotting procedure if necessary. If there’s still a little bit of nail polish left on the garment, put it face-down on a layer of fresh paper towels, and blot at the stain with the stain remover from behind again. Repeat the process of blotting and rinsing until the stain is completely removed from your garment."
    },
    {
      "title": "Run the garment through the laundry.",
      "content": "Run the garment through the laundry. To make sure that all unwanted chemicals, including both the nail polish and the stain remover, are removed from your clothing, run it through the washing machine when you’re finished blotting and rinsing. [5] X Research source"
    },
    {
      "title": "Test the product on a small, hidden area of the fabric.",
      "content": "Test the product on a small, hidden area of the fabric. To control how small the test area is, apply the spray to a cotton swab, and transfer it to a very small part of the fabric that will be hidden by your hair or other clothing when you wear the garment. If the color doesn’t bleed off when you rub it, you can safely apply the spray to your stain."
    },
    {
      "title": "Spray the product directly onto the stain.",
      "content": "Spray the product directly onto the stain. Use enough product to completely saturate the stained area of fabric — be generous! [6] X Research source"
    },
    {
      "title": "Scrub the stain loose.",
      "content": "Scrub the stain loose. Either buy a cheap toothbrush or use an old one that needs to be replaced anyway to gently scrub at the stain to loosen it from the garment."
    },
    {
      "title": "Blot the stain with a cotton ball.",
      "content": "Blot the stain with a cotton ball. You don’t want to spread the stain around, but dab it to pick the nail polish up onto the cotton ball. When one cotton ball becomes covered with nail polish, replace it with a fresh one to prevent transferring the nail polish back onto your garment. [7] X Research source"
    },
    {
      "title": "Rinse with warm water.",
      "content": "Rinse with warm water. Hold the stained part of your garment under running water in the sink or bathtub to rinse the fabric of both polish and bug or hair spray. Repeat the process of spraying with bug/hair spray, scrubbing with toothbrush, and rinsing in warm water until the stain has been completely removed from your garment. Run the garment through the laundry when you’ve finished."
    }
  ]
}