{
  "url": "https://www.wikihow.com/Deal-With-a-Difficult-Cousin",
  "title": "How to Deal With a Difficult Cousin",
  "steps": [
    {
      "title": "Take a few deep, calming breaths if your cousin is bothering you.",
      "content": "Take a few deep, calming breaths if your cousin is bothering you. If you’re feeling stressed or angry because of your cousin’s behavior, take a few deep, cleansing breaths to help you calm down before you do anything else. Breathe in through your nose to the count of 5, then hold for 5 seconds, and breathe out through your mouth to the count of 5. Repeat this deep breathing exercise until you feel calm. [1] X Research source If you’re able, you might even want to leave the room for a few minutes or take a walk around the block to calm down. [2] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 18 August 2021. While you're doing this, try thinking about why what they're doing bothers you so much. That way, you'll be able to communicate with them more clearly once you're feeling calmer. [3] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 18 August 2021."
    },
    {
      "title": "Ask your cousin to stop the behavior that’s frustrating you.",
      "content": "Ask your cousin to stop the behavior that’s frustrating you. Whether your cousin is teasing you or doing something that you find annoying, let them know that you’d like them to stop. Say it in a direct manner so there’s no mistaking what you want them to do. Keep your voice calm and avoid yelling when you ask them to stop. [4] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source For example, you might say something like, “Joe, can you please stop making that sound? It’s really getting on my nerves.” Or you might say, “Gina, stop teasing me about my braces. Lots of people have braces. It’s really not a big deal.”"
    },
    {
      "title": "Laugh it off if you can.",
      "content": "Laugh it off if you can. If your cousin is teasing you and trying to get a reaction out of you, you might be able to stop them by laughing at what they’re saying. Don’t show that what they’re saying bothers you at all. Just laugh at their comments instead. [5] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source For example, if your cousin says your new outfit is ugly, laugh at the comment and respond with something like, “Sure, okay, Charlotte.” Then, go about your business and act like their comment didn't bother you. This can be hard to do sometimes, especially if their words actually hurt your feelings. It’s okay to feel upset and if you can’t bring yourself to laugh because your feelings are hurt, go to an adult and tell them what happened."
    },
    {
      "title": "Tell an adult if your cousin still won’t stop bothering you.",
      "content": "Tell an adult if your cousin still won’t stop bothering you. If your cousin keeps doing what they’re doing even after you ask them to stop, you might need to bring an adult into the situation. Try telling a parent or guarding what’s going on and ask for their help. This is especially important to do if your cousin is physically hurting or threatening you. [6] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source For example, you might say, “Mom, Charlie keeps making fun of my hair and I’ve asked him nicely to stop.” Or you might say, “Uncle Dave, can you please ask Juliet to stop tickling me?”"
    },
    {
      "title": "Remind yourself that their behavior is not about you.",
      "content": "Remind yourself that their behavior is not about you. While it might seem like your cousin is frustrated by something you’re doing if they’re being mean to you or teasing you, their behavior is all about them. Remind yourself of this whenever they say or do something that upsets you. [7] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, you might tell yourself, “Sarah teasing me is not because of anything I did. She’s just being mean and it’s not my fault.” Keep in mind that you are not to blame for the things your cousin says or does, even if they try to tell you that you are."
    },
    {
      "title": "Use “I” statements",
      "content": "Use “I” statements to express yourself. “I” statements help to reduce the chance that someone will become defensive when you tell them how you feel. Instead of casting blame on your cousin by starting a sentence with “you,” start with “I.” [8] X Research source For example, you might say something like, “I get frustrated when you make comments about my size, so please don’t do that any more.” Or, you might say, “I feel like you’re not listening when you keep interrupting me.”"
    },
    {
      "title": "Tell them that you won’t put up with emotional manipulation.",
      "content": "Tell them that you won’t put up with emotional manipulation. If your cousin uses guilt, threats, or other emotional manipulation techniques to get you to do things, set boundaries about what you will and will not do. Be direct and assertive about what you are unwilling to tolerate. [9] X Research source For example, you might tell your cousin something like, “Stop trying to guilt me into helping you with your homework. I’ve already told you I have plans after school, so I can’t help you.” Or if they’re threatening you, you might say, “Threatening me won’t change my mind, so don’t bother.”"
    },
    {
      "title": "Acknowledge your cousin’s point of view without judgment.",
      "content": "Acknowledge your cousin’s point of view without judgment. You may also find it helpful to empathize with your cousin. This may help you to see them with more compassion and understanding. Having empathy for someone doesn’t mean you have to do whatever they want, but it may help you to feel less frustrated by their behavior if you can get into their head. [10] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 18 August 2021. [11] X Research source For example, if your cousin keeps pestering you to do their homework for them, they might be feeling frustrated because they don’t understand it and they might not have anyone else who is willing to help them. If your cousin is physically abusive towards you, this might be due to how their parents or an older sibling treats them. It doesn’t make it okay, but looking at it this way may help you to feel less upset about it."
    },
    {
      "title": "Incorporate the word “because” into any requests you make.",
      "content": "Incorporate the word “because” into any requests you make. People are often more compliant with requests when the word “because” is inserted into them. If you often have trouble getting your cousin to do things to help you, try phrasing your requests with the word “because.” [12] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, instead of asking your cousin, “Can you please help me clean up the living room?” say something like, “We need to clean up the living room because my parents will be home soon and they asked us to clean up.” Or, instead of saying, “Can you stop playing that song over and over?” you might say, “I need you to stop playing that song on repeat because it’s very annoying.”"
    },
    {
      "title": "Change the subject if they ask or say something that bothers you.",
      "content": "Change the subject if they ask or say something that bothers you. You don’t have to carry on a conversation or answer questions if it makes you uncomfortable. It’s fine to change the subject or ignore questions or comments that upset you. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if your cousin asks you a question you don’t want to answer, you could smile and say something like, “So, how was your day?” If they don’t take the hint and try to ask again, you might need to tell them directly, such as by saying, “I’m not comfortable answering that.”"
    },
    {
      "title": "Set your expectations low so you won't be disappointed.",
      "content": "Set your expectations low so you won't be disappointed. Having high expectations of your interactions with your cousin can lead to disappointment. If you continue to experience disappointment due to how your cousin treats you, lowering your expectations may help. Try setting your expectations very low so that even if they’re a little pleasant to be around, you’ll be surprised. [14] X Research source For example, if you have a cousin who frequently makes rude comments or who complains a lot, then expect them to be at their worst. This way, if your cousin happens to say only a few rude things or is in a slightly better mood, you’ll be pleasantly surprised."
    },
    {
      "title": "Imagine you’re surrounded by an impenetrable shield.",
      "content": "Imagine you’re surrounded by an impenetrable shield. Visualizing a shield around your body that nothing can get through may help you to cope with any comments your cousin makes that would normally upset you. Imagine that the words are hitting the shield and bouncing off of it before getting to you. To make the visualization stronger, imagine the color of the shield, its shape, and any special features on it, such as a design or spikes. Visualization takes some practice, but over time you’ll get better and better at letting your cousin’s comments bounce off your shield."
    },
    {
      "title": "Try to accept and acknowledge your cousin for who they are.",
      "content": "Try to accept and acknowledge your cousin for who they are. Taking a minute to acknowledge who your cousin is and what they are really like might also help you to cope with their behavior. Identify their behavior and how you feel when you’re around them. Then, say or think something like this to yourself: [15] X Research source “Janice, you’re mean and you tease me often, and that hurts my feelings. But I accept that this is who you are and that I will feel upset sometimes when I’m around you.” Repeat this mantra to yourself whenever you are having a hard time being around your cousin."
    },
    {
      "title": "Prepare a way out for yourself if you get too frustrated.",
      "content": "Prepare a way out for yourself if you get too frustrated. Sometimes you might need to get away from your cousin before you say or do something in retaliation. To ensure that this is always an option, come up with a plan ahead of time whenever you will be spending time with them. Try to avoid putting yourself into a scenario where you can’t leave or have no way to get a break. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if you’re spending the day at home with your cousin, excuse yourself to go to the restroom whenever you need a break."
    },
    {
      "title": "Devote adequate time to self-care.",
      "content": "Devote adequate time to self-care . Self-care includes everything from eating well and getting enough rest , to pampering yourself with a relaxing bath, a new haircut, or a fun day with friends. Make your needs a priority to ensure that you are at your best whenever you need to interact with your cousin. [17] X Research source For example, eat a healthy meal or snack before you spend time with your cousin to ensure that you aren’t hungry. [18] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source If you anticipate a difficult time with your cousin, try doing something special for yourself, such as reading a chapter of your favorite book, watching an episode of a favorite TV show, or playing with your favorite toy."
    }
  ]
}