{
  "url": "https://www.wikihow.com/Get-Rid-of-Painful-Cracked-Lips",
  "title": "How to Get Rid of Painful Cracked Lips",
  "steps": [
    {
      "title": "Drink plenty of fluids.",
      "content": "Drink plenty of fluids. Having 8-10 glasses of water per day is ideal. When your body is dehydrated, it often shows first in your lips. The more water, the better! [1] X Research source Drink consistently throughout the day, not all at one time. That's not going to help your lips immediately!"
    },
    {
      "title": "Don't lick or pick at your lips.",
      "content": "Don't lick or pick at your lips. When your lips are chapped, avoid the temptation to lick them constantly or pick at them. These two common habits just make the situation worse. Licking your lips may bring temporary relief, but as the saliva on your lips evaporates, it dries out your lips. Picking at the skin on your lips may lead to bleeding, an infection, or a cold sore. [2] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020. If you feel the urge to lick or pick at your lips, immediately apply a lip balm instead. Reapply lip balm or ointment after drinking or rinsing out your mouth."
    },
    {
      "title": "Apply an ointment.",
      "content": "Apply an ointment. Be careful which over-the-counter ointment or lip balm (e.g. Chapstick) you use to heal your cracked lips. Many contain ingredients (e.g., camphor or menthol) that make lips feel better temporarily, but which may actually dry out your lips even more, forcing you to reapply them again and again. [3] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020. Look for a lip balm that contains beeswax, shea butter, coconut butter, almond oil, or other natural moisturizers - and not much else. Don't choose a lip balm with an extra-long list of ingredients you can't pronounce. A vitamin E or glycerin-based ointment containing other natural ingredients could also be helpful. [4] X Research source Avoid using lipstick to moisturize your lips. Lipstick can be drying - you need a protective ointment underneath. In some cases, you can develop an allergy to lipstick or red dye #40, which is included in many lipstick formulas. If this happens, the lipstick can make your lips very irritated or even cause a rash."
    },
    {
      "title": "Apply oils.",
      "content": "Apply oils. For an ultra-moisturizing lip treatment, rub a little oil on your lips. It will soothe and moisturize your lips while also protecting them from further damage. Use natural moisturizers made from nut oils and seed butters. Here are some examples: Coconut oil Almond oil Jojoba oil Olive oil Cocoa or shea butter Rosehip oil"
    },
    {
      "title": "Soothe your lips if they're painful.",
      "content": "Soothe your lips if they're painful. If your lips are so cracked that it hurts to smile, try soothing them with a home remedy that will make them feel better. Here are a few suggestions: Rubbing a cucumber slice on your lips daily for about 10 minutes is also known to be effective. Rubbing some aloe vera gel on your lips can be soothing. Rubbing a little honey on your lips will moisturize them and make them feel better. Slather on an unflavored lip balm that contains natural oils or butters, such as coconut oil or shea butter."
    },
    {
      "title": "Avoid excessive use of commercial skin treatments.",
      "content": "Avoid excessive use of commercial skin treatments. These include cosmetics and heavily flavored lip balms. They can dry out your skin. Be sure to always read the label, looking for fragrances or perfumes listed in the ingredients. These can burn or agitate your skin, potentially making your lips worse."
    },
    {
      "title": "Try using fluoride-free toothpaste.",
      "content": "Try using fluoride-free toothpaste. Some people have an allergy to fluoride that not only affects their lips but can also cause other irritations in the mouth. Switch up your toothpaste and see if you notice a difference."
    },
    {
      "title": "Use a humidifier in your home or office.",
      "content": "Use a humidifier in your home or office. Heating indoor spaces in the winter causes the air to dry out. Try installing a humidifier. This moistens up air in a room and ultimately moistens up your lips. [5] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020."
    },
    {
      "title": "Consider your diet.",
      "content": "Consider your diet. Increase the amount of needed vitamins in your diet by eating better or taking supplements like vitamin pills. [6] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020. Refrain from eating salty foods, which increase the urge to lick your lips. A high salt diet and salty snacks are very drying for your lips! Similarly, stay away from caffeinated drinks, which urge you to lick your lips. Soda is especially problematic, as it contains both caffeine and salt. Choose another beverage, instead."
    },
    {
      "title": "Try not to sleep or breathe with your mouth open.",
      "content": "Try not to sleep or breathe with your mouth open. If you wake up in the morning with dry, cracked lips, it might be because your mouth was open while you slept. The air circulating in and out of your mouth all night can dry out your lips. See if changing your sleeping position helps. Dry, chapped lips can also be caused by breathing through your mouth when you have a stuffy nose. Try to clear your nasal passages so you can breathe through your nose as much as possible. Wearing a mouth guard, retainer or another device that causes your mouth to stay open could also be the culprit. If you can't avoid sleeping with your mouth open, apply a good ointment before bed. If you often find yourself sleeping with your mouth open and you feel unrested, talk to your doctor to make sure you don't have any underlying health conditions."
    },
    {
      "title": "Protect your lips from drying environments.",
      "content": "Protect your lips from drying environments. Leaving your lips unprotected in a strong wind can cause damage. Spending time in a very dry place can cause your lips to dry out and crack. If your environment is the culprit, you'll need to take extra care to protect your lips when you go out. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Treat sun damage.",
      "content": "Treat sun damage. Just as the rest of your skin can be damaged by the sun, so can your lips. Yes, you can have sunburned lips, and they hurt! Treat sun damaged lips by applying aloe to help the burned skin heal more quickly. [8] X Expert Source Margareth Pierre-Louis, MD Board Certified Dermatologist Expert Interview. 15 May 2020. Don't just treat sun damage after the fact! Do your best to prevent it by always using sun protection on your lips, such as a lip balm labeled for sun protection. Look for an SPF of at least 15. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "See if smoking or chewing is the problem.",
      "content": "See if smoking or chewing is the problem. Anything you regularly put in contact with your lips can affect their condition. The chemicals in cigarettes, gum and processed snacks can cause your lips to become dry and cracked."
    },
    {
      "title": "Determine whether a vitamin deficiency could be at play.",
      "content": "Determine whether a vitamin deficiency could be at play. Certain vitamins are critical to maintaining healthy skin and lips. These include Vitamins A, B, C, B2 (Riboflavin deficiency) and E. Make sure you're getting plenty of these vitamins to avoid cracked lips."
    },
    {
      "title": "Find out whether you are sensitive or allergic to a product ingredient.",
      "content": "Find out whether you are sensitive or allergic to a product ingredient. Many cracked and dry lips are the result of negative reactions to ingredients in cosmetics and skin care products. Overusing some products can aggravate the very condition they are meant to alleviate. Switch to a toothpaste that doesn't contain sodium lauryl sulphate. Sodium lauryl sulfate is the foaming agent found in most toothpastes; it can also aggravate mouth sores or ulcers and chapped lips."
    },
    {
      "title": "See if it's a side effects of your medications.",
      "content": "See if it's a side effects of your medications. Certain medications cause dry or cracked lips as a side effect. If your condition coincides with beginning a new medication regimen, consult your doctor about this possibility."
    },
    {
      "title": "Consider more serious conditions.",
      "content": "Consider more serious conditions. If none of the above seems to be the cause of your painful lips, they could also be a symptom of far more serious problems. Consult a doctor if you suspect that your lip pain originates with a seemingly unrelated ailment. Some possible illnesses could be: Diabetes . If you have diabetes or a history of the condition in your family, this may be a cause of your lip pain. Kawasaki Disease . A serious, but rare, blood disorder that is a cause of chronic dry lips. Sjogren's Syndrome . A kind of autoimmune disease which can damage the tear ducts and similar glands. This causes dry eyes, dry mouth, and dry mucus membranes. It's also a common cause of seriously cracked lips. Macrocytosis . A blood condition where the average red blood cell size is increased to dangerous levels. Sexually transmitted diseases . STDs, oral herpes HSV-1, HIV, and other diseases can be an underlying cause of chronic cracked lips."
    }
  ]
}