{
  "url": "https://www.wikihow.com/Do-a-Straddle-Press-Handstand",
  "title": "How to Do a Straddle Press Handstand",
  "steps": [
    {
      "title": "Start in a seated straddle position.",
      "content": "Start in a seated straddle position. Sit down on your butt with your legs extended out to either side of your body at roughly a 45-degree angle. Engage your glutes to hold your legs straight and firm and rotate your knees in slightly, which will help you engage your core in turn. When you’re reading to begin the press, place your hands shoulder-width apart on the floor in front of you. [1] X Research source There’s no single best width where the straddle is concerned—a wider straddle will provide better leg clearance but requires more strength, whereas a narrower straddle will offer greater stability but will make it harder to get your legs out of the way. Do what’s most comfortable for you. If you prefer, you can also start in a standing position, with your feet a little wider than hip-width apart and your hands on the floor directly beneath your shoulders. This position will give you a little more leverage, which can be helpful if you don’t have the strength required to press all the way up from the floor. [2] X Research source"
    },
    {
      "title": "Lean forward over your hands slowly.",
      "content": "Lean forward over your hands slowly. As your torso begins to tilt, transfer your weight from your lower body to your hands. Press your palms firmly into the floor and maintaining a small amount of bend in your elbows. [3] X Research source Spread your fingers out on the floor as much as you can to create a wider base and lend added stability to your handstand. [4] X Research source"
    },
    {
      "title": "Engage your core as you continue leaning to begin lifting your legs.",
      "content": "Engage your core as you continue leaning to begin lifting your legs. Tense the muscles of your midsection tight. You should be able to feel an equal amount of tension in your upper and lower abs, hips, and pelvis. Imagine that your entire upper body from the crown of your head to your tailbone is one straight line. [5] X Research source Focus on keeping your torso as rigid as possible during the first part of the press. If you’re too loose, your own weight will be working against you, decreasing your leverage and pulling you off balance. Make sure your head stays well in front of your hands to serve as a counter-lever to your lower body. If you can look down between your hands, you’re not leaning out far enough."
    },
    {
      "title": "Keep your shoulders ahead of your hips until your feet clear the floor.",
      "content": "Keep your shoulders ahead of your hips until your feet clear the floor. Continue shifting more and more of your weight forward. Finding a good point of balance between your head and your hips is crucial at this stage, as most of your lower body will still be behind you. When only your toes remain on the floor, you’re ready to begin pulling upward into the handstand. [6] X Research source Extend your shoulders completely by pushing your straight arms down away from your head. This will distribute more of your weight among your trapezius, scapula, and core muscles, which are much stronger than the muscles of the arms themselves. [7] X Research source Avoid letting your knees bend, if you can help it. Just like a loose torso, relaxed legs can create an imbalance."
    },
    {
      "title": "Pick your legs up off of the floor and raise them out to the sides.",
      "content": "Pick your legs up off of the floor and raise them out to the sides. Without breaking your forward lean, tighten your glutes, hamstrings, and core to prepare to lift your legs. In one controlled movement, sweep them back behind you and upwards. As they leave the floor, your upper and lower body will briefly be in the same configuration they were in in your starting position, only inverted. [8] X Research source Don’t rush the leg lift. Doing so could cause you to wobble or overshoot your mark and fall forward. The key to a solid straddle press is to perform each movement in a slow, controlled manner. Keep your awareness on your hands, arms, and shoulders as your legs come up. Otherwise, you may lose tightness and topple over prematurely."
    },
    {
      "title": "Bring your legs together over your head to complete the handstand.",
      "content": "Bring your legs together over your head to complete the handstand. As you straighten your legs, your hips will naturally move into alignment with your shoulders. At this point, you can stop leaning forward and concentrate on fine-tuning your balance through your hands. Maintain this “stacked” position to hold the handstand for as long as you can. [9] X Research source Dialing in your handstand may feel harder than normal, since you’ll already be fatigued. Do your best to hold the position with good form for 5-10 seconds, then gradually increase your time to build up your endurance. [10] X Research source If you need some assistance, practice pressing up against a wall, or have a friend spot you by holding your hips once you get inverted. The added support will help you learn how to transition between each part of the movement without having to worry about maintaining your balance."
    },
    {
      "title": "Lower yourself back down to the floor by reversing the sequence.",
      "content": "Lower yourself back down to the floor by reversing the sequence. With your core nice and tight, slowly separate your legs and begin hinging at the waist to bring them down in front of your body. Lean forward and keep your head in front of your hands like you did on the way up to maintain your balance. Place your feet on the floor and stand up if you started in a standing position. If you pressed up from seated position, bend your arms to bring yourself back down to a seated straddle. As your straddle press handstands improve, you can start performing multiple “reps,” going from straddle to handstand and back again without ever setting your full weight back down. [11] X Research source"
    },
    {
      "title": "Practice your straddle press handstand frequently.",
      "content": "Practice your straddle press handstand frequently. The straddle press handstand is an advanced-level skill that requires a tremendous amount of strength, balance, flexibility and coordination. Make it a point to develop each part of the movement individually until it becomes easy to transition to the next stage. Not only will a slow progression help you prioritize proper form from beginning to end, it will also minimize your risk of injury. Try to set aside 15-30 minutes per day to practice. The more you train, the quicker you’ll get the hang of it. Stop practicing when you feel your form start to slip. You don’t want to get in the habit of performing the movement with poor technique."
    },
    {
      "title": "Hold boat pose for increasingly longer durations.",
      "content": "Hold boat pose for increasingly longer durations. Sit on the floor with your legs straight out in front of you, making sure your sitting bones are firmly grounded. Press your fingertips into the floor on either side of your legs and tighten your core to raise your legs up to a 45-degree angle. With your legs fixed at around eye-level, extend your arms out parallel above the floor. Try to hold the pose for at least 10 seconds before releasing it, and work up to longer holds as you get more comfortable. [12] X Research source If you’re having trouble holding full boat pose with proper form, bend your knees slightly or a place a block between your thighs. You can also leave your feet on the floor until you develop enough strength to maintain the hollow body position. Boat pose, or navasana , is a traditional yoga pose which can be used to strengthen the muscles of your core, inner thighs, hip flexors, and shoulders."
    },
    {
      "title": "Do V-ups to give your core muscles a killer workout.",
      "content": "Do V-ups to give your core muscles a killer workout. V-ups are a type of core exercise similar to boat pose, but slightly more difficult to perform. Start by lying flat on your back with your arms over your head and your core and the tops of your thighs engaged. Using muscular strength (not momentum), lift your legs and torso off the ground simultaneously so that your body forms a “V” shape. Lower yourself back down to the ground in a controlled manner to complete one rep. [13] X Research source Start with sets of 5-10 reps and gradually add more with each workout. Try touching your hands to your feet at the top of each rep to intensify the exercise and get more bang for your buck."
    },
    {
      "title": "Increase your upper body strength with push ups.",
      "content": "Increase your upper body strength with push ups . Drop down into a standard planche position, with your head, torso, and legs forming a single straight line, your hands shoulder-width apart, and your shoulders positioned directly over your wrists. Bend your elbows and lower yourself until your chest is hovering just above the floor. Then, reverse the movement to yourself back up into a planche. Aim for 15-20 push ups per set, with a total of 4-5 sets per workout. [14] X Research source If you need to, you can do push ups from your knees until you’ve gained the strength necessary to perform a proper planche push up. When you get to the point where you can do 20 or more strict push ups, start introducing more challenging variations, such as diamond, clapping , spider, and one-armed push ups . Pike push ups translate especially well to the kind of shoulder strength required for a straddle press handstand. [15] X Research source"
    },
    {
      "title": "Add some kettlebell swings to your workout to practice your hip hinge.",
      "content": "Add some kettlebell swings to your workout to practice your hip hinge. Grab a kettlebell with both hands and stand with your feet slightly wider than shoulder-width apart. Keeping your back straight and your gaze fixed on the wall in front of you, bend over at the hips so that the kettlebell dangles down between your legs. Just before it touches the floor, push with your legs and extend your hips forcefully to swing it up to around chest level then bring it back down for another rep. [16] X Research source Be sure to keep your chest up and your arms straight throughout the entire movement. You should be relying on the explosive power of your lower back, hips, glutes, and hamstrings, not your arms. [17] X Research source Set a goal of 20-30 swings per set, or simply do as many as you can in 30 seconds or a minute."
    },
    {
      "title": "Perfect your pike handstands.",
      "content": "Perfect your pike handstands. Start pushing yourself up from a seated straddle the way you would for a normal straddle press handstand, only pause when you’re about halfway up and bring your legs together in front of you. In this position, your thighs should be parallel to the floor so that your body forms a kind of elongated “7” shape. If you’re having trouble getting your legs off the floor, keep your knees bent or prop your feet up on a chair or exercise ball to take some of the difficulty out of the early stages of the movement. [18] X Research source You can also use a wall to brace yourself if you need a little assistance. Stand facing the wall in a straddle position and place your hands on the floor 6–12 inches (15–30 cm) away from the bottom. Lean forward until your shoulders are resting against the wall, then lift your legs up into a supported handstand. Pike handstands are actually tougher than straddle handstands for many people due to the extreme weight shift, so if you can do a strict pike handstand, you should have all the tools you need to press up from a straddle."
    }
  ]
}