{
  "url": "https://www.wikihow.com/Ferment-Fish",
  "title": "How to Ferment Fish",
  "steps": [
    {
      "title": "Skin 3 to 4 fish and remove the bones.",
      "content": "Skin 3 to 4 fish and remove the bones. You can use this recipe as a way to ferment any type of fish that you want to preserve. For example, get out 3 or 4 fresh herring, sardines, or mackerel to use. Then, use a sharp knife to remove the skin and de-bone the fish. [1] X Research source Feel free to substitute your favorite type of fish. You can use any de-boned fillet of fish."
    },
    {
      "title": "Chop the fish into bite-sized pieces and put them into a 1 US qt (0.95 L) jar.",
      "content": "Chop the fish into bite-sized pieces and put them into a 1 US qt (0.95 L) jar. Get out a clean, sterilized jar that's large enough to hold the fish. Then, roughly chop them—they don't have to be perfectly uniform—and put them in the jar. [2] X Research source"
    },
    {
      "title": "Add onion, coriander, bay leaves, peppercorns, and dill.",
      "content": "Add onion, coriander, bay leaves, peppercorns, and dill. Put a few slices of white onion into the jar with the fish along with 1/2 teaspoon (1 g) of coriander seeds, 10 bay leaves, 1 teaspoon (2 g) of black peppercorns, and a sprig of fresh dill. These will all add incredible flavor to the fish as it ferments. [3] X Research source Some Baltic countries add a few crushed juniper berries and cardamom pods to add a unique flavor to the fish."
    },
    {
      "title": "Mix water with salt and whey in a separate bowl or jug.",
      "content": "Mix water with salt and whey in a separate bowl or jug. To get whey, drain a batch of homemade yogurt or kefir in cheesecloth and keep the liquid. Measure 3 to 4 tablespoons (44 to 59 ml) of this liquid whey and put it into a measuring jug along with 1 ⁄ 2 cup (120 ml) of cool water. Then, stir in 1 tablespoon (17 g) sea salt until it dissolves. [4] X Research source Making homemade yogurt or kefir can feel like a lot of work. For less effort, you can buy plain yogurt and use the liquid that settles on the top."
    },
    {
      "title": "Pour the brine into the jar to submerge the fish.",
      "content": "Pour the brine into the jar to submerge the fish. The salt and whey in the mixture will preserve and season the fish. If you don't have enough brine to completely cover the fish, pour in more cool water."
    },
    {
      "title": "Seal the jar and leave the fish at room temperature for 3 to 5 days.",
      "content": "Seal the jar and leave the fish at room temperature for 3 to 5 days. Screw the lid on tightly and label the jar so you know when you started fermenting the fish. Set the jar at room temperature where it's out of direct sunlight and leave it for at least 3 days or up to 5. [5] X Research source"
    },
    {
      "title": "Move the jar to the fridge and use the fermented fish within a few days.",
      "content": "Move the jar to the fridge and use the fermented fish within a few days. The fish will continue to ferment, so you can slow down the process by putting it into the fridge. Then, plan on eating it within a few days. Try eating it with slices of avocado and onion. It's also great mixed with crème fraiche and a squeeze of lemon! [6] X Research source Most people prefer to eat fermented fish without cooking it. Serve it with crackers or dry toast. It's also great with other pickled foods like pickled vegetables."
    },
    {
      "title": "Sterilize a 1 US quart (0.95 L) glass jar and lid.",
      "content": "Sterilize a 1 US quart (0.95 L) glass jar and lid. You can use a mason jar or a glass bottle that has a tight-fitting lid. Run them through the dishwasher on a high-heat setting to sterilize them. [7] X Research source Don't have a dishwasher? Put the jar or bottle and lid into a pot and fill it with enough water to submerge them. Then, boil the water over high heat for 10 minutes. Don't try to handle the hot, sterilized jar or bottle until it's cooled."
    },
    {
      "title": "Mix cold white rice in a bowl with 1 1/2 tablespoons (49 g) of rock salt.",
      "content": "Mix cold white rice in a bowl with 1 1/2 tablespoons (49 g) of rock salt. This is a great way to use leftover cooked rice you have in the fridge! Measure 2 cups (400 g) of cold, white rice and put it into a mixing bowl. Then, add 1 1/2 tablespoons (49 g) of rock salt and use your fingers or a spatula to work the salt throughout the rice. [8] X Research source If the cold rice sticks to your hands or the spatula, dip them in cold water."
    },
    {
      "title": "Cut the fish into bite-sized pieces if you're using fillets.",
      "content": "Cut the fish into bite-sized pieces if you're using fillets. Take 2 cleaned fillets of fish like tilapia, salmon, trout, or whatever fish is fresh in your area and chop them into rough pieces. Put the fish into a big bowl. [9] X Research source Want to use small, whole fish like silver biddies instead of fillets? No problem! You can skip this step and use 3 ⁄ 4 pound (340 g) of small, whole fish instead."
    },
    {
      "title": "Rub the remaining 1/2 tablespoon (16 g) of rock salt on the fish.",
      "content": "Rub the remaining 1/2 tablespoon (16 g) of rock salt on the fish. Sprinkle the remaining rock salt over the chopped fish or small, whole fish in your bowl. Use your fingers to toss the fish so the salt coats it. [10] X Research source This probably seems like a lot of salt in addition to the salted rice, but remember that salt helps preserve the fish."
    },
    {
      "title": "Pack alternating 1 in (2.5 cm) layers of rice and fish in the jar.",
      "content": "Pack alternating 1 in (2.5 cm) layers of rice and fish in the jar. Spread about 1 inch (2.5 cm) of the salted rice in the bottom of your sterilized jar. Then, press a layer of fish pieces or small, whole fish over the rice. Pack another layer of rice over the fish and press down to get rid of air pockets. Keep alternating the layers until you've used all the fish and end with a rice layer. [11] X Research source Don't worry if you have space at the top of your bottle—you just don't want air pockets around the fish."
    },
    {
      "title": "Seal the jar tightly so air can't get into the container.",
      "content": "Seal the jar tightly so air can't get into the container. If your jar has an airtight lid, screw it on so it's secure. If you're using a bottle that didn't come with one, no problem! Just press a piece of plastic wrap over the top and pop a rubber band on it so the plastic doesn't slide off. [12] X Research source If you really want to make sure that your jar is completely airtight, you can use plastic wrap and screw a lid on top of it."
    },
    {
      "title": "Put the jar in a cool, dry place to ferment for 7 to 10 days.",
      "content": "Put the jar in a cool, dry place to ferment for 7 to 10 days. Set the jar in a dark place where heat and light won't damage the fish. After a few days, you can open the jar and push the fish/rice mixture down so it's covered by the liquid that appears. Leave the fish to ferment for at least 7 days before you eat it. Don't forget about your fish! If you let it ferment for more than 10 days, it can spoil. [13] X Research source It's really easy to forget when you started fermenting the fish, so label the jar with the date."
    },
    {
      "title": "Sauté the fermented fish with vegetables when you're ready to eat it.",
      "content": "Sauté the fermented fish with vegetables when you're ready to eat it. Create a flavorful meal by cooking a sliced onion in a skillet with 2 chopped tomatoes and 3 chopped cloves of garlic. Once they're soft, stir in all of the fermented fish and rice. Then, mix in 1 ⁄ 2 cup (120 ml) of water and heat the dish until it simmers. [14] X Research source Stir in more water if you like your burong isda to be thinner. If you like a spicy meal, add a few thinly sliced pieces of fresh ginger when you sauté the veggies."
    }
  ]
}