{
  "url": "https://www.wikihow.com/Get-Around-Overwatch-2-Phone-Number",
  "title": "Is It Possible to Play Overwatch 2 without a Phone Number?",
  "steps": [
    {
      "title": "If you started playing Overwatch after 6/9/2021, you can play without a phone number.",
      "content": "If you started playing Overwatch after 6/9/2021, you can play without a phone number. When Overwatch 2 first launched, all players were required to add a phone number to their account. Blizzard then updated their terms to allow new Overwatch players to proceed without a phone number. Note that this rule applies to having played the first Overwatch game, which has since been replaced with Overwatch 2. If you started playing Overwatch before 6/9/2021, you must add a phone number to your account when signing up for Battle.net. [3] X Research source If you do not have a phone number handy, you will need to find a workaround."
    },
    {
      "title": "Blizzard requires a phone number as an anti-cheating measure.",
      "content": "Blizzard requires a phone number as an anti-cheating measure. In an attempt to crack down on users creating multiple accounts to gain a gameplay advantage, Blizzard requires you to verify your identity with a unique phone number."
    },
    {
      "title": "Sign up for a temporary phone number.",
      "content": "Sign up for a temporary phone number. A few burner services allow you to generate a temporary phone number. Unfortunately, Blizzard has managed to block many of these from working. [4] X Research source There are a few that claim to still work on Overwatch 2, however. Consider using a service like Dingtone or MobileSMS . Such services are the only workarounds for this dilemma. As a new player, there is no way for you to sign up for Overwatch 2 without a phone number."
    },
    {
      "title": "Sign up for a compatible pre-paid plan.",
      "content": "Sign up for a compatible pre-paid plan. Not all pre-paid phone services are accepted on Battle.net. Blizzard has certain ID requirements for the phone carriers it accepts, although it is not totally clear what those are. Users claim that MetroPCS and Cricket phone numbers are not accepted when registering for Battle.net. Other users claim that Talktone numbers will be accepted."
    }
  ]
}