{
  "url": "https://www.wikihow.com/Cut-Beef",
  "title": "How to Cut Beef",
  "steps": [
    {
      "title": "Purchase a cut of beef.",
      "content": "Purchase a cut of beef. Beef can be purchased at a butcher's shop or grocery store. For the sake of learning proper cutting, you should buy a cut with visible muscle, or \"grain\". The beef you use should depend on the meal you're preparing. \"Grain\" refers to the direction of the major muscle fibers on a cut of meat. It's not so important while you're cooking, but it's a crucial thing to consider when you cut the beef. [1] X Research source The smaller the grain on the beef, the less important the slice's angle is. Cuts such as filet mignon or New York strip have softer muscle by definition, so slicing these types of meat may be a bit easier and more forgiving. If you are having difficulty learning to slice beef properly, these cuts are well suited for you."
    },
    {
      "title": "Wash your hands thoroughly in preparation for cooking.",
      "content": "Wash your hands thoroughly in preparation for cooking. Handwashing is a vital part of cooking preparation. Wash your hands with a disinfecting soap and lather them in water for at least 30 seconds. This will make sure you don't bring germs onto the food you're working with. If you're handling uncooked meat at any point, make sure to wash your hands again afterwards."
    },
    {
      "title": "Cook the meat to your liking.",
      "content": "Cook the meat to your liking. Lovers of steak all have their preferences when it comes to the degree of cooking. Ranging from rare (pink in the middle) to well-done (completely cooked), the level of cooking has a major effect on taste and texture. You can cook beef before or after it's been cut. Different degrees of cooking, such as rare, medium rare, medium, medium well, and well done can also affect the meat's tenderness. Generally speaking, the longer you cook the meat, the less tender it is. Most steak lovers prefer medium rare as it offers an optimal balance."
    },
    {
      "title": "Allow the beef to rest.",
      "content": "Allow the beef to rest. [2] X Research source Place the steak to the side, and allow it to rest for a minimum of 3 to 5 minutes once it is cooked to your liking. This allows the juices to redistribute inside your steak, which relaxes the muscle. Slicing steak prematurely allows these juices to escape. Resting time should vary based on the cut and size of your beef. A roast, for example, should be allowed to rest for 10 minutes, while steaks should be given 5 to settle. Generally speaking, 1 minute of resting time per 100g of meat is a good rule if you're unsure how much time to let your beef idle."
    },
    {
      "title": "Identify the grain.",
      "content": "Identify the grain. The \"grain\" of a cut of beef refers to the direction of major muscle fibers. You can usually see the direction visibly on beef, although less gamey cuts (like filet mignon) make be less clear. It's important to know where the grain is before cutting as you'll want to cut across the muscle. You'll increase the tenderness of your cut by severing the fibers. Certain recipes might actually welcome some roughness in the meat, so long as the meat cuts are bite-sized. If this is the case, feel free to cut with the grain. Don't confuse grill marks with the grain. Grill marks are the cooking lines that show where the steak was placed on the grill. Backyard cooks can sometimes confuse the grill marks as grain lines."
    },
    {
      "title": "Place the meat on a cutting board.",
      "content": "Place the meat on a cutting board. For the sake of traction, safety, and protecting your countertop, it's recommended you put your meat on a cutting board before you do anything to it. This will minimize the risk of anything going astray while you're working on it. [3] X Research source"
    },
    {
      "title": "Cut away surface muscle.",
      "content": "Cut away surface muscle. [4] X Research source Muscle in a piece of beef will increase its chewiness. This includes connective tissue, which is often seen on the exterior of a cut of meat. Muscle (and fat) are both usually visibly distinct from the rest of the cut. Hold the beef with one hand, and cut the muscle by sawing it back at forth with a knife. When it's cut off, discard it away from the meat you're preparing. Don't hack away at the muscle if you're losing too much beef. If your beef has a lot of muscle on the outside, it's a good idea to cut it off before you cook."
    },
    {
      "title": "Trim off the fat.",
      "content": "Trim off the fat. Different cuts carry different degrees of fat, and some recipes actually favour a bit of beef fat along with the steak. However, for certain dishes (like stir fry), the fat should be removed. [5] X Research source It's ultimately up to you whether you'd prefer a lean or marbled cut. Too much fat can pose a health issue, but it does capture a lot of flavour. This can be done prior to cooking the meat. If you do so before cooking, you're likely to get the cleanest possible cut."
    },
    {
      "title": "Mark your cuts.",
      "content": "Mark your cuts. [6] X Research source If you're cutting down a bigger piece of meat and want relatively equal-sized chunks, it's a good idea to measure out parts with a ruler. Take a ruler and measure out pieces of the beef. From there, make noticeable incisions. These will be a placemarker for you when you make each of the cuts, and save you having to bring out the ruler for each time. Again, it is important to remember you want to mark your cuts against the grain of the muscle fibres."
    },
    {
      "title": "Hold your cut in place with a meat fork.",
      "content": "Hold your cut in place with a meat fork. A meat fork helps ensure that your piece of beef won't slip while you're cutting it. This helps ensure your cut is smooth. More importantly, it limits the risk of the knife slipping and causing injury. [7] X Research source"
    },
    {
      "title": "Position a butcher's knife at an angle near the steak's endmost point.",
      "content": "Position a butcher's knife at an angle near the steak's endmost point. Because a proper beef cut should be smooth, the only mindwork you'll need to do is with positioning the knife itself. Aim the far end of your knife for the far end of the meat, aiming it downward at an angle. Think of the knife as a guillotine or a paper cutter. When you begin to cut the beef, you'll want to keep the knife is the exact same position. Having a proper butcher's knife makes the process of cutting beef a lot smoother. If you're regularly preparing meat in your cooking, it's a good idea to invest in a high-end knife set. Other utensils, like forks, don't usually warrant the same quality."
    },
    {
      "title": "Cut the beef using a smooth, downward motion.",
      "content": "Cut the beef using a smooth, downward motion. Properly cutting beef should be a very smooth process. Push the knife down gently, rocking it back and forth slowly. Provided your knife is sharp enough, you shouldn't need a lot of force to do this. Keep working downward until the slice is severed from the rest of the cut. Set the beef aside, and move on to the next segment until you're done. Again, don't forget to cut against the grain. This has an important effect on the meat's texture."
    },
    {
      "title": "Present the beef with your meal.",
      "content": "Present the beef with your meal. Aesthetics during mealtime are often underrated, but they have a big impact on the way food is received. If you're serving multiple pieces of meat per dish, it's a good idea to serve them together. If you're bringing the beef out on a platter, it can be appetizing to reassemble them in the shape of the original cut. This increases the impression of freshness."
    },
    {
      "title": "Partially freeze your beef.",
      "content": "Partially freeze your beef. Raw beef is notoriously difficult to cut. However, you can alleviate some of the strain by placing the beef in the freezer. Partially freezing beef firms up the meat, making it easier to work with. [8] X Research source Put your meat in the freezer for 30 minutes to an hour. The extra time you put into preparing it will make the cutting process that much easier for you."
    },
    {
      "title": "Trim off the fat.",
      "content": "Trim off the fat. One thing about cutting beef while raw is that you're able to cut off potentially unwanted parts (like muscle and fat) without their flavour sinking into the rest of the cut during the cooking process. Slide your knife under the surface fat and take it off in a smooth motion. Take care not to go too deep with your cuts. Getting too aggressive with your fat trimming will result in the loss of good meat. [9] X Research source Membrane is a fine film over parts of some cuts, and can be peeled off with your hands. [10] X Research source Consider leaving some of the fat on your cut. Even if you want to keep your beef lean, a bit of fat will keep your cut of beef juicy."
    },
    {
      "title": "Take extra care to make your cuts consistent.",
      "content": "Take extra care to make your cuts consistent. If you haven't yet cooked your beef, it's all the more important that you make your cuts consistent. If you're cutting pieces of different sizes, they'll cook at different rates. [11] X Research source This will run the risk of undercooking (or overcooking!) parts of your beef. It helps to mark your cuts beforehand. Because consistent size is so important with pre-cooked cutting, you should get the measurements done before you set a knife to your beef."
    },
    {
      "title": "Cut in slow, smooth strokes.",
      "content": "Cut in slow, smooth strokes. [12] X Research source Setting your beef on a cutting board, cut down in a smooth, downward motion, much as you would with cutting cooked beef. Although raw beef is generally harder to cut, pre-freezing it partially helps ease some of the difficulty."
    },
    {
      "title": "Cook your beef as soon as possible.",
      "content": "Cook your beef as soon as possible. If you plan on cutting the beef before cooking it, only cut it if you're planning on cooking immediately after. Slicing in advance will increase oxidation and make the meat taste off. [13] X Research source"
    },
    {
      "title": "Wash your hands vigorously after cutting.",
      "content": "Wash your hands vigorously after cutting. Raw beef carries lots of bacteria with it. Whenever you're handling raw meat, it is strongly recommended you wash your hands thoroughly afterwards. Lather your hands with anti-bacterial soap under hot water for at least 30 seconds. Dry your hands off with a towel afterwards."
    }
  ]
}