{
  "url": "https://www.wikihow.com/Deal-With-a-Cursing-Person",
  "title": "How to Deal With a Cursing Person",
  "steps": [
    {
      "title": "Stay calm.",
      "content": "Stay calm. Do not reply with anger just because the customer is being immature and working through their anger in an unhealthy way. For instance, if you’re on the phone with a customer, do not hang up on them as soon as they start cursing. If you react angrily, you might escalate the situation, and both you and the customer could end up even more aggravated than you already are. Pay attention to your volume and tone of voice. Use a gentle, even tone when replying to angry customers. Remain aware of your emotions. If you don’t think you can handle a certain call, tell the person that you’ll transfer them to a manager or another third party, even if it’s just your coworker. “I’m going to transfer you to someone who can help you better than I can,” you could explain. It is easier to tune out or forgive swearing against a product, company, or service than it is to forgive someone swearing at you personally. In either case, however, stay calm and do not respond in anger. Remember, the irate customer does not know you, and you did not personally cause whatever misfortune they are experiencing. Don’t let their foul language rattle you or make you feel personally guilty, angry, or incompetent."
    },
    {
      "title": "Validate their feelings",
      "content": "Validate their feelings to calm them down. Sometimes, an angry customer feels unheard or ignored, and so they act out in desperation. You can alleviate this by showing that you care about their situation and are willing to listen. Validating their feelings can calm them down by making them feel understood. Here are some examples of validating things to say: \"I can tell you're upset.\" \"That sounds frustrating to deal with.\" \"Yes, that definitely sounds like a problem. What do you need to fix it?\" \"I'm sorry to hear about that. It sounds difficult to deal with.\""
    },
    {
      "title": "Tell the customer that using profanity will not solve their problem.",
      "content": "Tell the customer that using profanity will not solve their problem. Sometimes, when a customer is extremely frustrated, they forget their manners. Remind that customer that while you are sorry, no amount of cursing will solve the problem they're experiencing. \"I understand you're upset. Cursing at me will not help me fix your problem.\" \"I know this is frustrating. I am on your team here, and profanity isn't going to help me help you.\" \"I have a hard time focusing when people are yelling at me. If you want my help, please lower your volume, or come back later once you've calmed down.\""
    },
    {
      "title": "Warn the customer that they will not receive help if they continue to curse.",
      "content": "Warn the customer that they will not receive help if they continue to curse. Give a clear, unambiguous warning that specifically mentions their cursing. “I’m sorry, but I cannot help you if you curse at me.” \"I am sorry, but you are frightening people, and we cannot help you today. Please lower your voice or leave the building.\""
    },
    {
      "title": "Hang up the phone on a customer who ignores a warning.",
      "content": "Hang up the phone on a customer who ignores a warning. If you're dealing with a customer over the phone, hang up on them. This is a last resort that should only be utilized in extreme cases. The foul-mouthed customer is likely to call back even angrier than before. However, if you have a customer who does not relax after repeated attempts to calm them, ending the call is the best option. Sometimes ending a call can give angry people the time they need to calm down. Always be polite as you end your call. Let your customer know you’re hanging up. A goodbye like, “I’m going to hang up now because I do not want to be cursed at. I hope your day improves,” is appropriate. Be succinct. Follow through on your warnings to your customer that you’re going to hang up."
    },
    {
      "title": "Get help when dealing with threatening customers.",
      "content": "Get help when dealing with threatening customers. [1] X Research source If one of your customers continues to curse and threatens you, inform them you will contact the police. Leave to do so. Explain the situation to the police and, assuming the customer has fled before the police arrive, give them as much information as possible about the customer. Allow the threatening customer to leave and do not antagonize them. Do not shout, threaten, or scream when dealing with a customer who threatens you. This might panic them and escalate the situation. If you believe the customer is armed, do not announce, “I’m calling the police.” This will only agitate them. Flee from an armed customer at the first opportunity. If the exit is blocked, look for safe spaces to hide within your workplace like under or behind a bar counter. Contact the police when you have a chance."
    },
    {
      "title": "Explain the situation to your coworkers.",
      "content": "Explain the situation to your coworkers. Protocol concerning cursing customers varies with place of employment. You may want to write down everything that happened, to help you remember, or to make an official report. You could also tell your boss about what happened, and ask for advice dealing with similar situations in the future. If you work at a call center, you might make an entry in their account describing the exchange, and how you handled it. At an in-person workplace, you might tell your coworkers about what happened, and give them a heads-up in case the customer comes back and curses at them too."
    },
    {
      "title": "Ask your coworker to tone it down.",
      "content": "Ask your coworker to tone it down. [2] X Research source Most people don't want to cause tension in the workplace, and will listen if you say that cursing is bothering you. Be assertive, polite, and clear. “Peggy, I’m uncomfortable with the language that you’re using. Could you please ease up on the cursing? I’d really appreciate it.”"
    },
    {
      "title": "Insist that anyone cursing at you cease immediately.",
      "content": "Insist that anyone cursing at you cease immediately. Cursing at anyone, especially a coworker, is an act of profound disrespect. [3] X Research source Verbal abuse is very inappropriate in the workplace (and in general). Put on a calm face, even if you feel angry or scared. Breathe deeply to calm your nerves, and assert yourself. \"Don't speak to me like that. I don't talk to you that way, and I don't deserve this.\" \"I need you to stop cursing at me.\" \"I have asked you three times to stop cursing at me now. It's creating a stressful environment, and I will go to HR for help if I need to.\""
    },
    {
      "title": "Evaluate your relationship with your coworker.",
      "content": "Evaluate your relationship with your coworker. Workplace friends engage in different types of communication than coworkers who are not friends. Workplace friends use profanity when in conversation with one another more than they do when conversing with non-friends. For instance, if you have worked in a place for a long time, you might begin to hear someone speak to you in a more informal way and lace their conversation with curses. This could mean that the coworker considers you a friend. If it makes you uncomfortable, just say so. \"Cursing makes me uncomfortable. Please don't do it around me.\" If they consider you a friend, then they won't want to make you feel bad."
    },
    {
      "title": "Bring your concerns to the manager, or to Human Resources.",
      "content": "Bring your concerns to the manager, or to Human Resources. If you tell your manager that a certain coworker is making you uncomfortable by using certain words, the coworker could be dismissed or disciplined for creating a hostile work environment. [4] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source Individuals affected by a hostile or intimidating person (such as a cussing coworker) could and should be proactive by informing management of their feelings. Try keeping a log of your coworker's behavior, with each entry dated and with a full description of what happened and how you handled it. This can be useful evidence. If your immediate supervisor is unresponsive, contact the human resources department where you work. Sometimes you have to go over your direct manager’s head to get results. If your company as a whole is unresponsive, talk to a lawyer. Lawsuits involving hostile work environments are taken very seriously."
    },
    {
      "title": "Stay calm when your child swears.",
      "content": "Stay calm when your child swears. [5] X Research source Do not overreact by yelling at or scaring your child. If your child knows that a certain word sends you into a rage, they will use it to push your buttons later. Similarly, do not laugh when your child curses. This will make them think the behavior is acceptable and they might use it again to be funny."
    },
    {
      "title": "Ask your child why they used a curse word.",
      "content": "Ask your child why they used a curse word. Kids curse for many reasons. They might be seeking attention, expressing anger, or bullying another child. Find out why the child cursed by asking, “Why did you use that word?” after you’ve heard or received word of the child swearing. They heard it somewhere, but didn't know it was inappropriate. They feel ignored, and don't know how to get your attention. They're angry and trying to express it. They're copying another person."
    },
    {
      "title": "Ask the child where they heard that word.",
      "content": "Ask the child where they heard that word. Children copy other people—both adults and other kids. They also try out things from music, TV, and movies. Talk to them about what they think is a good role model. [6] X Research source Talk to the kid about what they can do if the other person curses around them (or at them) again. Avoid power struggles. For example, if your child's new friend curses a lot, then saying \"you can't be friends with them\" will probably make the child more stubborn. Instead, ask questions about the friend, and about what the child thinks about the cursing. Talk about their opinions about cursing in a TV show, song, or movie. What do they think is appropriate with regards to cursing? What does a bad role model look like? Having an open dialogue can help."
    },
    {
      "title": "Gently explain to them a better way to handle the situation.",
      "content": "Gently explain to them a better way to handle the situation. Children aren't always as emotionally intelligent as adults are, and they might look to you for guidance. You can teach them more constructive ways to handle what they're dealing with. If the child didn't know it was a curse, explain that it's a curse word and it's inappropriate. If they get embarrassed or upset, reassure them that they didn't know it was inappropriate, so you aren't upset with them. Now they do know, and don't have to use it again. If they felt lonely or ignored, talk to them about better ways to get your attention. Maybe you'd like your child to tell you \"I'm lonely,\" or to invite you to hang out with them. Then, be sure to pay attention when they do this in the future, so they know it works better than cursing. If they're angry, talk about other ways to handle anger. Maybe you'd like your child to say \"I'm angry!\", or to punch a pillow, or draw an angry picture and rip it up, or get some exercise. Talk about ways to handle anger, and be a good role model by using healthy coping mechanisms when you feel angry. If they're copying someone, have a conversation about how curse words might make others feel. Ask the child if they've ever been scared or upset by being cursed at. Talk about people who might be better role models, and things that are better to do than cursing."
    },
    {
      "title": "Explain to your child what kinds of speech are inappropriate.",
      "content": "Explain to your child what kinds of speech are inappropriate. Along with typically vulgar words, explain to your child that name-calling, yelling, and a sharp tone are also unacceptable. Invite your child to ask questions so that they are clear on your policy about what kinds of language you tolerate and what kinds you do not tolerate. Outline the various types of discipline your child will face when they utilize foul language in the future. Be clear when explaining why certain types of speech are inappropriate. For instance, you could explain to your child that “bad words” offend many people. If you are religious, you might also inform them that certain words are forbidden by your faith."
    },
    {
      "title": "Avoid lectures.",
      "content": "Avoid lectures. When you're the only one talking, and the child feels that you won't listen to their side, they may just tune you out. This isn't helpful or constructive. Instead of lecturing, work on having an open dialogue. Let the child talk about their feelings and ideas, without being judged right away."
    },
    {
      "title": "Avoid over-reliance on discipline.",
      "content": "Avoid over-reliance on discipline. Jumping to punishment may make a child feel like you aren't willing to listen to them, or that you don't care about their feelings. Use your words first, to explain the rules and have a dialogue about why they cursed and what they could do next time. If they come around, then no punishment is needed. Try talking to the child about how they could make amends if they upset somebody. This is a positive form of discipline that can help them feel better about themselves. Ask the child for ideas on how to make amends to someone they upset (e.g. drawing them a picture, singing them an \"I'm sorry\" song, doing something nice for them) and let the child choose which way they think is best. Time-outs, grounding, and suspension of privileges may make a child feel \"naughty.\" Limit this type of discipline as much as you can. Do not use physical force against your child such as slapping or spanking. This will harm your relationship with the child, and may worsen behavior problems, including making them more likely to hit others. [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Be sure to give the child plenty of positive attention, in ways not related to their cursing.",
      "content": "Be sure to give the child plenty of positive attention, in ways not related to their cursing. Sometimes, kids act out because they just need more attention. If they get more quality time, from you and from other caregivers, they may stop cursing all on their own."
    },
    {
      "title": "Have a serious conversation with a child who keeps breaking the rules.",
      "content": "Have a serious conversation with a child who keeps breaking the rules. When a child acts out, they may be communicating that they're scared, lonely, overwhelmed, or otherwise unable to handle something constructively. Ask them why they do this. (If they don't know, keep talking about it.) Try to figure out what's wrong. Sometimes, a child needs to \"have a good cry\" if they're dealing with a lot of emotions. You can help by staying and listening. Sit next to them, or hold them while they cry. Being there for them makes a difference. Consider getting a good therapist involved if your child is really struggling."
    },
    {
      "title": "Recognize the difference between aggressive and non-aggressive cursing.",
      "content": "Recognize the difference between aggressive and non-aggressive cursing. Most people swear quite often. Even though it is deemed inappropriate in polite society, swearing can make people feel empowered and provide a needed catharsis. If someone is swearing at you or someone else, you should rightly be offended. If someone is swearing for emphasis, or swearing to express general frustration with a certain experience, there is usually no reason to be upset. Sometimes, in a moment of anger, people utilize cuss words. Whatever the case, try to empathize with the person’s situation and learn to accept non-aggressive swearing as a normal part of human speech."
    },
    {
      "title": "Recognize that Tourette Syndrome (TS) may cause someone to curse involuntarily.",
      "content": "Recognize that Tourette Syndrome (TS) may cause someone to curse involuntarily. Tourette’s syndrome (TS) is a neurological disability that causes a person to make involuntary sounds or movements. A person with TS may say curse words because they cannot control their mouth. In this case, it's best to just ignore it and know that they aren't doing it on purpose. People with TS may have other tics such as grimacing, touching a part of the face, sniffing, shrugging, or blinking unusually. The movements may be repeated again and again. Recognize that the person with TS may be embarrassed by the swearing tic. They may try to control it, but be unable to. It's best to ignore the cursing, and keep on having a pleasant conversation. About 100,000 people in the US have TS."
    },
    {
      "title": "Contact the authorities.",
      "content": "Contact the authorities. In some cities, swearing in public is actually a violation of the law. [8] X Research source [9] X Research source If you hear someone cursing in public, call your local police department’s non-emergency number or get the attention of a police officer to let them know about the foul language being spewed in public. Usually there will be a ticket and a fine for the individual who was cursing. The amount of the fine varies by locality, but some can range up to $500."
    },
    {
      "title": "File a complaint with the Federal Communications Commission (FCC) for cursing in public communications.",
      "content": "File a complaint with the Federal Communications Commission (FCC) for cursing in public communications. The FCC is the government agency tasked with keeping various communications mediums free of profanity. If you hear a talk show host using inappropriate language, or are subjected to profanity over the phone, you can file a complaint with the FCC. You can submit your complaint by mail, email, fax, or phone. All you need to file the complaint is the call sign of the station or name of the individual, the city and state where the phone call or broadcast originated, and the date and time of the offending broadcast or phone call. The quickest way to file a complaint is to visit https://consumercomplaints.fcc.gov/hc/en-us and click on “File Complaint” under either TV or radio. You do not need to provide a recording or transcript of the program or call. However, you can send one, though it will not be returned."
    }
  ]
}