{
  "url": "https://www.wikihow.com/Delete-an-eHarmony-Account",
  "title": "How to Delete an eHarmony Account",
  "steps": [
    {
      "title": "Login to eHarmony.com using your username and password.",
      "content": "Login to eHarmony.com using your username and password. If you can't remember your login details, you can click the \"Forgot password\" link and eHarmony will send you an email to reset your password. [1] X Research source"
    },
    {
      "title": "Click on your profile at the top of your screen.",
      "content": "Click on your profile at the top of your screen. Go to the top of the screen and click on your profile in the navigation bar. This should bring down a drop-down list with links that say \"My Profile,\" \"My Matches,\" and \"Account Settings.\" [2] X Research source"
    },
    {
      "title": "Click the \"Account Settings\" link.",
      "content": "Click the \"Account Settings\" link. Navigate your cursor over \"Account Settings\" and click it to go to your general account settings page. [3] X Research source"
    },
    {
      "title": "Click on the \"Billing\" button.",
      "content": "Click on the \"Billing\" button. The right most icon will say \"Billing.\" Click on the icon to be brought to the billing page, where all of your personal billing information is located."
    },
    {
      "title": "Click the \"Close Account\" button at the bottom of the screen.",
      "content": "Click the \"Close Account\" button at the bottom of the screen. There will be a blue hyperlink that reads \"Close Account\" on the bottom right-hand side of the screen. Scroll all the way down and click the link. [4] X Research source"
    },
    {
      "title": "Click the \"Yes, close my account\" link.",
      "content": "Click the \"Yes, close my account\" link. After you hit the close your account button, a new window will pop up on your screen warning you that you'll lose your matches. Click the link that says \"Yes, close my account\" under the button that says \"Nevermind keep my matches.\" [5] X Research source Your profile will become unsearchable and you'll stop receiving matches once you close your account."
    },
    {
      "title": "Look for a confirmation email.",
      "content": "Look for a confirmation email. Your account must be closed first before you can request that eHarmony deletes all your information. Closing your account will make your profile unsearchable, but you'll be able to retrieve your profile information if you decide to use the site again in the future."
    },
    {
      "title": "Make sure that you want to delete all your information.",
      "content": "Make sure that you want to delete all your information. If you decide that you want to use eHarmony again but have deleted your account, you'll have to reupload all your pictures, rewrite the content in your profile, and retake the questionnaire on the site. If you plan on using your profile in the future, you should just cancel your account rather than deleting it. [6] X Research source"
    },
    {
      "title": "Send an email to deletemyinfo@eharmony.com.",
      "content": "Send an email to deletemyinfo@eharmony.com. Your subject line should read \"Delete My Account Information.\" Inside of the body of the text, explain that you want your information to be completely deleted from the website. Wait for a response from eHarmony. [7] X Research source Your information should be removed from the site within ten days. [8] X Research source"
    },
    {
      "title": "Give eHarmony a call to delete your information.",
      "content": "Give eHarmony a call to delete your information. If you've been unable to contact eHarmony through email, you can give them a call. Call 1+ 855-290-5575 and tell the customer service representative that you want to delete your account. [9] X Research source You can say something like, \"I enjoyed eHarmony while it lasted, but I don't want my personal information on the site anymore. Can you please delete it and send me a confirmation email when it's deleted?\""
    }
  ]
}