{
  "url": "https://www.wikihow.com/Find-the-X-Intercept",
  "title": "How to Find the X Intercept",
  "steps": [
    {
      "title": "Identify the x-axis.",
      "content": "Identify the x-axis. A coordinate graph has a y-axis and an x-axis. The x-axis is the horizontal line (the line that goes from left-to-right). The y-axis is the vertical line (the line that goes up and down). [1] X Research source It is important to look at the x-axis when locating the x-intercept."
    },
    {
      "title": "Find the point where the line crosses the x-axis.",
      "content": "Find the point where the line crosses the x-axis. The x-intercept is this point. [2] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021. If you are asked to find the x-intercept based on the graph, the point will likely be exact (for example, at point 4). Usually, however, you will have to estimate using this method (for example, the point is somewhere between 4 and 5)."
    },
    {
      "title": "Write the ordered pair for the x-intercept.",
      "content": "Write the ordered pair for the x-intercept. An ordered pair is written in the form ( x , y ) {\\displaystyle (x,y)} and gives you the coordinates for the point on the line. [3] X Research source The first number of the pair is the point where the line crosses the x-axis (the x-intercept). The second number for will always be 0, since a point on the x-axis will never have a value for y. [4] X Research source For example, if a line crosses the x-axis at point 4, the ordered pair for the x-intercept is ( 4 , 0 ) {\\displaystyle (4,0)} ."
    },
    {
      "title": "Determine that the equation of the line is in standard form.",
      "content": "Determine that the equation of the line is in standard form. The standard form of a linear equation is A x + B y = C {\\displaystyle Ax+By=C} . [5] X Research source In this form, A {\\displaystyle A} , B {\\displaystyle B} , and C {\\displaystyle C} are integers, and x {\\displaystyle x} and y {\\displaystyle y} are the coordinates of a point on the line. For example, you might be given the equation 2 x + 3 y = 6 {\\displaystyle 2x+3y=6} ."
    },
    {
      "title": "Plug in 0 for y {\\displaystyle y} .",
      "content": "Plug in 0 for y {\\displaystyle y} . The x-intercept is the point on the line where the line crosses the x-axis. At this point, the value for y {\\displaystyle y} will be 0. So, in order to find the x-intercept, you need to set the y {\\displaystyle y} to 0 and solve for x {\\displaystyle x} . [6] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021. For example, if you substitute 0 for y {\\displaystyle y} , your equation will look like this: 2 x + 3 ( 0 ) = 6 {\\displaystyle 2x+3(0)=6} , which simplifies to 2 x = 6 {\\displaystyle 2x=6} ."
    },
    {
      "title": "Solve for x {\\displaystyle x} .",
      "content": "Solve for x {\\displaystyle x} . To do this, you need to isolate the x variable by dividing both sides of the equation by the coefficient. This will give you the value of x {\\displaystyle x} when y = 0 {\\displaystyle y=0} , which is the x-intercept. [7] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021. For example: 2 x = 6 {\\displaystyle 2x=6} 2 x 2 = 6 2 {\\displaystyle {\\frac {2x}{2}}={\\frac {6}{2}}} x = 3 {\\displaystyle x=3}"
    },
    {
      "title": "Write the ordered pair.",
      "content": "Write the ordered pair. Remember that an ordered pair is written in the form ( x , y ) {\\displaystyle (x,y)} . For the x-intercept, the value of x {\\displaystyle x} will be the value you calculated previously, and the y {\\displaystyle y} value will be 0, since y {\\displaystyle y} always equals 0 at the x-intercept. [8] X Research source For example, for the line 2 x + 3 y = 6 {\\displaystyle 2x+3y=6} , the x-intercept is at the point ( 3 , 0 ) {\\displaystyle (3,0)} ."
    },
    {
      "title": "Determine that the equation of the line is a quadratic equation.",
      "content": "Determine that the equation of the line is a quadratic equation. A quadratic equation is an equation that takes the form a x 2 + b x + c = 0 {\\displaystyle ax^{2}+bx+c=0} . [9] X Research source A quadratic equation has two solutions, which means a line written in this form is a parabola and will have two x-intercepts. [10] X Research source For example, the equation x 2 + 3 x − 10 = 0 {\\displaystyle x^{2}+3x-10=0} is a quadratic equation, so this line will have two x-intercepts."
    },
    {
      "title": "Set up the quadratic formula.",
      "content": "Set up the quadratic formula. The formula is x = − b ± b 2 − 4 a c 2 a {\\displaystyle x={\\frac {-b\\pm {\\sqrt {b^{2}-4ac}}}{2a}}} , where a {\\displaystyle a} equals the coefficient of the second-degree term ( x 2 {\\displaystyle x^{2}} ), b {\\displaystyle b} equals the coefficient of the first-degree term ( x {\\displaystyle x} ), and c {\\displaystyle c} equals the constant. [11] X Research source"
    },
    {
      "title": "Plug all of the values into the quadratic formula.",
      "content": "Plug all of the values into the quadratic formula. Make sure you substitute the correct values for each variable from the equation of the line. [12] X Research source For example, if the equation of your line is x 2 + 3 x − 10 = 0 {\\displaystyle x^{2}+3x-10=0} , your quadratic formula will look like this: x = − 3 ± 3 2 − 4 ( 1 ) ( − 10 ) 2 ( 1 ) {\\displaystyle x={\\frac {-3\\pm {\\sqrt {3^{2}-4(1)(-10)}}}{2(1)}}} ."
    },
    {
      "title": "Simplify the equation.",
      "content": "Simplify the equation. To do this, first complete all of the multiplication. Make sure you pay close attention to all positive and negative signs. [13] X Research source For example: x = − 3 ± 3 2 − 4 ( − 10 ) 2 ( 1 ) {\\displaystyle x={\\frac {-3\\pm {\\sqrt {3^{2}-4(-10)}}}{2(1)}}} x = − 3 ± 3 2 + 40 2 {\\displaystyle x={\\frac {-3\\pm {\\sqrt {3^{2}+40}}}{2}}}"
    },
    {
      "title": "Calculate the exponent.",
      "content": "Calculate the exponent. Square the b {\\displaystyle b} term. Then, add this number to the other number under the square root sign. [14] X Research source For example: x = − 3 ± 3 2 + 40 2 {\\displaystyle x={\\frac {-3\\pm {\\sqrt {3^{2}+40}}}{2}}} x = − 3 ± 9 + 40 2 {\\displaystyle x={\\frac {-3\\pm {\\sqrt {9+40}}}{2}}} x = − 3 ± 49 2 {\\displaystyle x={\\frac {-3\\pm {\\sqrt {49}}}{2}}}"
    },
    {
      "title": "Solve for the addition formula.",
      "content": "Solve for the addition formula. Since the quadratic formula has a ± {\\displaystyle \\pm } , you will solve once by adding, and once by subtracting. Solving by adding will give you your first x {\\displaystyle x} value. [15] X Research source For example: x = − 3 + 49 2 {\\displaystyle x={\\frac {-3+{\\sqrt {49}}}{2}}} x = − 3 + 7 2 {\\displaystyle x={\\frac {-3+7}{2}}} x = 4 2 {\\displaystyle x={\\frac {4}{2}}} x = 2 {\\displaystyle x=2}"
    },
    {
      "title": "Solve for the subtraction formula.",
      "content": "Solve for the subtraction formula. This will give you the second value for x {\\displaystyle x} . First calculate the square root, then find the difference in the numerator. Finally, divide by 2. [16] X Research source For example: x = − 3 − 49 2 {\\displaystyle x={\\frac {-3-{\\sqrt {49}}}{2}}} x = − 3 − 7 2 {\\displaystyle x={\\frac {-3-7}{2}}} x = − 10 2 {\\displaystyle x={\\frac {-10}{2}}} x = − 5 {\\displaystyle x=-5}"
    },
    {
      "title": "Find the ordered pairs for the x-intercept.",
      "content": "Find the ordered pairs for the x-intercept. Remember that an ordered pair gives the x-coordinate first, then the y-coordinate ( x , y ) {\\displaystyle (x,y)} . The x {\\displaystyle x} values will be the values you calculated using the quadratic formula. The y {\\displaystyle y} value will be 0, since at the x-intercept, y {\\displaystyle y} always equals 0. [17] X Research source For example, for the line x 2 + 3 x − 10 = 0 {\\displaystyle x^{2}+3x-10=0} , the x-intercepts are at points ( 2 , 0 ) {\\displaystyle (2,0)} and ( − 5 , 0 ) {\\displaystyle (-5,0)} ."
    }
  ]
}