{
  "url": "https://www.wikihow.com/Drain-a-Water-Heater",
  "title": "How to Drain & Refill a Hot Water Heater",
  "steps": [
    {
      "title": "Turn off the heater's water supply by turning the cold water valve.",
      "content": "Turn off the heater's water supply by turning the cold water valve. First, make sure no water is coming into the tank so that you can fully drain it. Find the cold water valve near the top of the hot water tank, and turn it clockwise to close it. [1] X Research source This is often a labeled lever or knob at the top right of the water heater, fixed to a pipe that travels into the top of the tank. [2] X Research source If you’re ever unsure of what’s what on your water heater, consult its user manual, look up the make and model online, or call the manufacturer with the number supplied on the water heater’s labeling."
    },
    {
      "title": "Turn off the power or gas and let the heater cool for 3 hours.",
      "content": "Turn off the power or gas and let the heater cool for 3 hours. Turning off the power also turns off the heating element inside your water heater, which prevents heating an empty tank. For an electric water heater, find your fuse box or circuit breaker box and check the diagram on the inside of the panel to identify the breaker that controls the power to your water heater. Flip the switch to shut off power to the water heater. [3] X Research source For a gas water heater, turn the gas valve on the tank (located near the pilot light) to the “pilot” position, “off,” or its lowest possible temperature setting (whichever is available). The pilot light will not actually go out, but the gas will be cut off from the water heater. Then, allow the water heater to cool for up to 3 hours so you’re not working with dangerously hot water. [4] X Research source"
    },
    {
      "title": "Attach a garden hose to the drain valve at the bottom of the tank.",
      "content": "Attach a garden hose to the drain valve at the bottom of the tank. At the base of the water heater is a small valve called the drain valve. Take a standard garden hose and screw the nozzle onto the valve to connect it. Place the other end of the hose into a large bucket or over a floor drain, or run it outside into the yard or garden if your water heater is above-ground. Running your hose outside lets you drain the heater all at once, rather than by the bucketful. If your water heater is in the basement, attach a hose pump to the hose to propel the water up and out. [5] X Research source Hose pumps vary in design and operation, so consult your pump’s owner’s manual for hookup and operation instructions."
    },
    {
      "title": "Open the drain valve to allow the water to drain from the tank.",
      "content": "Open the drain valve to allow the water to drain from the tank. Near the drain valve where the hose is connected is a knob or lever that opens and closes the valve. Turn the knob or lever counterclockwise to open up the valve and let the water flow (you may need to use a wrench to open stubborn valves). Make sure it’s opened all of the way to allow for proper drainage. [6] X Research source Keep the valve open until no more water runs out, indicating the tank is empty. Also, turn on a hot water tap anywhere in your home to allow air into the tank, helping it drain. Or, open the pressure release valve on your tank to achieve the same effect. If you’re draining the tank with a bucket, fill the bucket, close the valve, empty the bucket, and repeat until no more water pours from the valve."
    },
    {
      "title": "Open and close the cold water valve to flush out the tank in bursts.",
      "content": "Open and close the cold water valve to flush out the tank in bursts. Sediment can collect at the bottom of your water heater, so it’s important that you run fresh water through it to flush it all out. Once the tank is empty, keep the drain valve open and also open the cold water valve at the top for 15 seconds at a time to expel any sediment. Let the tank drain after each burst. [7] X Research source Repeat this 5-10 times, or until no more sediment is in the expelled water."
    },
    {
      "title": "Close the drain valve and disconnect the hose.",
      "content": "Close the drain valve and disconnect the hose. Turn the drain valve (to which the hose is connected) clockwise to close it. Make sure it’s fully closed to prevent any leaks. Then, unscrew the garden hose to disconnect it from the drain valve. [8] X Research source Optionally, attach the hose to an outdoor spigot and run water through it to expel any sediment inside the hose. Make sure the cold water valve is closed while you adjust the drain valve and hose."
    },
    {
      "title": "Turn on the cold water valve to allow water back into the heater.",
      "content": "Turn on the cold water valve to allow water back into the heater. Find the cold water valve at the top of your water heater and twist it in the opposite direction (counterclockwise) to return water to the tank. You’ll know the tank is full when an open hot water tap in your home runs with a steady stream. Keep the cold water valve open. [9] X Research source"
    },
    {
      "title": "Restore power to the water heater.",
      "content": "Restore power to the water heater. If you have an electric water heater, turn the power back on by flipping the breaker that controls the electricity to it. To turn a gas water heater back on, you need to restore the flow of gas into the water heater. Flip the pilot light switch back into the “on” position or to the temperature setting it was dialed to before you turned it off. [10] X Research source This is usually around 140 °F (60 °C). [11] X Research source If power isn’t immediately restored to the water heater, try flipping the breaker off and back on again. You may need to consult your gas water heater’s owner manual for instructions on how to turn on the heater if it doesn’ have an automatic pilot function."
    },
    {
      "title": "Drain and refill your water heater every 3 months.",
      "content": "Drain and refill your water heater every 3 months. For regular maintenance, it’s best to drain, flush, and refill your water heater about 4 times a year, or every 3 months. This keeps it clear of sediment and working properly, and helps you catch any issues that may arise, like excess sediment or discolored water. In these cases, call your manufacturer to have the water heater professionally serviced."
    },
    {
      "title": "Drain the heater any time your hot water supply is inconsistent.",
      "content": "Drain the heater any time your hot water supply is inconsistent. If the hot water in your home is slow to get going, the temperature fluctuates, or the water itself is discolored or has a bad odor, it may be that you have sediment in your water heater. Drain, flush, and refill the water heater to expel the sediment. [12] X Research source If the problem isn’t solved, call a maintenance worker to have your water heater serviced. Also drain the heater if it makes noise while it’s running, or if your energy bills fluctuate, both of which may indicate that it’s time to flush sediment out of the system."
    }
  ]
}