{
  "url": "https://www.wikihow.com/Flirt-with-a-Scorpio",
  "title": "11 Ways to Flirt with a Scorpio (Backed by Astrology)",
  "steps": [
    {
      "title": "Every Scorpio loves a good mystery.",
      "content": "Every Scorpio loves a good mystery. Reveal personal details about yourself slowly and deliberately, leaving something to the imagination each time you talk. Your Scorpio will be intrigued by the prospect of solving a puzzle, and they will make time for more frequent conversations with you. Be a little vague about your life. \"I had a pretty fun childhood growing up in the northeast. What about you?\" Keep them interested by saying, \"I have an interesting story about that. Maybe I'll tell you…on our next date.\" Answer a question flirtatiously by saying, \"Wouldn't you like to know?\" Love astrology? Take this quiz to discover your soulmate’s sign."
    },
    {
      "title": "Scorpios use body language to communicate their interest.",
      "content": "Scorpios use body language to communicate their interest. When flirting with a Scorpio, catch their eyes and hold their gaze without looking away. [2] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. This is a great way to show them you feel the same without coming right out and saying it—and it'll encourage your Scorpio to chase you."
    },
    {
      "title": "An aggressive sign like Scorpio is attracted to boldness.",
      "content": "An aggressive sign like Scorpio is attracted to boldness. [3] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Talk about your goals and ambitions, hold your own when you disagree, and convey confidence with your body language. Confidence shows your Scorpio that you know what an attractive person you are and makes you a major catch in their eyes too! \"I tend to be pretty ambitious when it comes to my career—and I get the feeling that we're a lot alike in that respect.\" Try flirting with your Scorpio this way: \"Just so you know: if you want to make a move, today would be the perfect time to go for it.\" Confident body language includes holding your head high and standing up straight. Avoid crossing your arms and keep both feet planted solidly on the ground."
    },
    {
      "title": "Excite a sensual Scorpio with flattering (but not revealing) outfits.",
      "content": "Excite a sensual Scorpio with flattering (but not revealing) outfits. While Scorpios put more value on a person's brain and personality, they like partners who take care of their appearance too. [4] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Wear clothes that accentuate your favorite body parts and groom yourself thoroughly before meeting up with your Scorpio. Pick clothing that looks timeless, sophisticated, and not too over-the-top. Scorpios also like black clothes, so a tailored suit or a little black dress would impress them. Scorpios favor dark and intense colors overall. In addition to black, try wearing burgundy, maroons, and dark blues."
    },
    {
      "title": "Clever and witty Scorpios look for partners who match their intellect.",
      "content": "Clever and witty Scorpios look for partners who match their intellect. Engage them in conversation by bringing up topics you know they care about. Prove that you're just as clever by offering your own opinions on each topic, but keep an open mind and listen thoughtfully to your Scorpio's perspective too. \"What have you read lately? I bet you have a great taste in books.\" \"I'm a true crime fanatic. Any good podcast or documentary recommendations?\" \"Have you seen the news today? There's one story I really want to get your thoughts on.\""
    },
    {
      "title": "Scorpios don't like crowds or expressing themselves in front of people.",
      "content": "Scorpios don't like crowds or expressing themselves in front of people. They'll feel comfortable flirting with you if only the two of you can hear what they say. Invite them for a one-on-one hang, or text flirty messages to your Scorpio. The more privacy they've got, the more aggressively they'll flirt. \"It's always great to see you, but would you want to do something with just the two of us?\" \"So, about this weekend. I'm thinking you, me, and a bottle of wine?\" You could ask them to hang out over text. \"I have Netflix on, but no one to chill with. Think you can help me out?\" Reader Poll: We asked 314 wikiHow readers which date idea they think a Scorpio would enjoy the most, and 43% of them said stargazing. [Take Poll] So if you're looking for a winning date idea to try with your Scorpio crush, that's a great option!"
    },
    {
      "title": "Coy comments and double meanings are favorites of the flirty Scorpio.",
      "content": "Coy comments and double meanings are favorites of the flirty Scorpio. If they're interested, a Scorpio will flirt back quickly and confidently once they pick up on your intentions. Flirting is a fun game for them, but Scorpios also like to be in control, so tease them with playful remarks and let your Scorpio decide what happens next. [5] X Research source \"This song makes me think of you every time I hear it!\" \"What does your week look like? Any room for me?\" \"I have a book I think you'd really like…you should stop by and pick it up.\""
    },
    {
      "title": "Emotional and expressive Scorpio wants someone to be their rock.",
      "content": "Emotional and expressive Scorpio wants someone to be their rock. Offer support whenever your Scorpio needs it, and let them vent their emotions to you. Make sure you're emotionally stable enough to encourage them while caring for yourself. Your Scorpio is looking for someone who will stick by them no matter what, and if you can be that person, they'll be yours forever. \"I just want to know that there's no pressure, but you can talk to me about anything. I'm more than happy to listen.\" \"I know you've been having a rough week. Let me know if there's anything I can do! I like making you smile.\""
    },
    {
      "title": "Cautious Scorpio needs to know you're trustworthy before opening up.",
      "content": "Cautious Scorpio needs to know you're trustworthy before opening up. [6] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Some signs like a bit of competition when it comes to dating, but not Scorpio! Be exclusive once you start flirting, even if you haven't committed to a relationship yet, and be available so that they never think you're ignoring them. Keep their secrets when they confide in you and never go behind their back. Scorpios fall fast for people they know they can trust!"
    },
    {
      "title": "Soothe Scorpio’s natural paranoia with honesty.",
      "content": "Soothe Scorpio’s natural paranoia with honesty. [7] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Scorpios value truth above all else, and they have a sixth sense for catching lies. Be truthful and direct with them no matter what you say, and don't be afraid to disagree. Scorpios would rather know the truth than be told what they want to hear! Just be respectful; they'll appreciate your honesty. Scorpios like a friendly debate. \"I've never liked that movie. But who knows—maybe I didn't give it enough of a chance! Try to change my mind. 😉\" Tell Scorpio your true feelings. \"You're attractive, intriguing, and I like you a lot. I just wanted you to know!\""
    },
    {
      "title": "Scorpios are private and won't like feeling pressured to be vulnerable.",
      "content": "Scorpios are private and won't like feeling pressured to be vulnerable. [8] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Accept your Scorpio's mysterious nature and trust that they'll open with you when they feel ready. Once you've both established your romantic interest, try opening up first; once they see you do it, your Scorpio will feel safer reciprocating."
    }
  ]
}