{
  "url": "https://www.wikihow.com/Eat-140-Grams-of-Protein-a-Day",
  "title": "How to Get 140 Grams of Protein per Day: Best Foods, Meal Plans & Diet Tips",
  "steps": [
    {
      "title": "Breakfast",
      "content": "Breakfast Aim to get around 35 grams of protein (or 47 grams if you don’t plan on snacking during the day) at breakfast to help start your day right. Opt for high-protein breakfast foods like eggs, cheese, tofu, black beans, Greek yogurt, cottage cheese, and oatmeal. [2] X Research source Scrambled eggs : Scramble eggs with some spinach. Pair it with 2 slices of whole-wheat toast and 2 slices of bacon. (32 grams of protein) Tofu scramble : Crumble and heat tofu with spinach, bell peppers, and tomatoes. Serve with potatoes and 2 slices of whole-wheat toast. (33 grams of protein) Greek yogurt : Add Greek yogurt, oats, chia seeds, and a splash of milk to a bowl. Top with nuts, seeds, and fruit for more protein. (31 grams of protein) Oatmeal : Cook rolled oats and add whey, pea, or hemp protein powder and chia seeds. Top with milk, sliced banana, and cinnamon for extra protein and flavor. (35-45 grams of protein [3] X Research source Protein pancakes : Mix together whole wheat flour, milk (powdered, soy, oat), and 1 egg. Cook the batter in a pan. Then, top with walnuts. (35 grams of protein) For a lower-carb alternative, certified dietitian-nutritionist Lisa Jubilee recommends using almond, coconut, or cassava flour."
    },
    {
      "title": "Lunch",
      "content": "Lunch Get around 35 grams of protein (or 47 grams if you skip snacks) at lunchtime, too. Choose healthy and delicious sources of protein like beans, lentils, quinoa, lean meats (chicken, turkey), and fish (tuna, salmon). [4] X Research source Tuna salad sandwich : Mix canned tuna with celery, lemon juice, and mayonnaise. Spread it on 2 slices of whole-wheat bread and add a large piece of lettuce. (27 grams of protein) [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Serve with a chickpea and veggie salad. (10 grams of protein) [6] X Research source Plant-based grain bowl : Add cooked quinoa, chickpeas, kale, roasted veggies (cauliflower, broccoli, sweet potato), and tahini dressing to a bowl. (20 grams of protein). [7] X Research source Add another protein source like tofu, tempeh, or seitan to boost your intake. Chicken lettuce wrap : Cook ground chicken with mushrooms, garlic, and ginger. Then, pour in a soy sauce marinade. Spoon the chicken onto a leaf of lettuce. (24 grams of protein) [8] X Research source Serve with ½ cup of brown rice. (7 grams of protein) [9] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Vegetarian/vegan tacos : Crumble and coat tofu with taco seasoning. Then, bake it until crispy. Top a warm corn or flour tortilla with the tofu, black beans, and your favorite toppings. (20 grams of protein) [10] X Research source Turkey wrap : Fill a flour or gluten-free tortilla with sliced turkey deli meat, cucumber, tomatoes, romaine lettuce, cheddar cheese, and Greek yogurt. (28 grams of protein) [11] X Research source"
    },
    {
      "title": "Dinner",
      "content": "Dinner Eat about 35 grams of protein (or 47 grams if you skip snacks) at dinner to fulfill your protein intake. Like at lunch, prioritize lean meats, fish, tofu, tempeh, seitan, and grains like quinoa. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Chicken stir-fry : Stir-fry chicken and zucchini in a pan. Then, pour in a soy sauce marinade. Serve over whole grain or brown rice. (40 grams of protein) [13] X Research source Salmon and sweet potato : Roast salmon and broccoli in the oven. Serve with mashed sweet potato. (32 grams of protein) [14] X Research source Turkey burger : Form minced turkey into patties and bake. Add your favorite toppings and serve with roasted veggies, like sweet potato or broccoli. (40 grams of protein) [15] X Research source Creamy vegan pasta : Sauté onions, bell peppers, sun-dried tomatoes, and garlic in a pan. Add tomato paste, spices, and a creamy cashew sauce. Toss with lentil pasta and spinach. (36 grams of protein) [16] X Research source Lentil and cauliflower curry : Simmer the lentils in vegetable stock with cauliflower and potatoes. Serve over brown or whole grain rice. (23 grams of protein) [17] X Research source"
    },
    {
      "title": "Snack",
      "content": "Snack Get an additional 35 grams of protein by snacking on nutritious foods throughout the day. Some great options include nuts, cottage cheese, yogurt, hummus, and peanut butter. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Almonds : ¼ cup has about 6 to 15 grams of protein. Roasted chickpeas : ½ cup has about 7 grams of protein. Cottage cheese : ½ cup with fruit on top has about 10 grams of protein. Greek yogurt : ⅔ cup with fruit on top has about 20 grams of protein. Hummus : ¼ cup of hummus with raw veggies has about 5 grams of protein. Hard boiled eggs : 1 egg has about 6 grams of protein. Peanut butter (with apples or celery): 1 tbsp has about 8 grams of protein. String cheese : 1 stick has about 7 grams of protein. Protein shake : 1 scoop of protein powder has 10-20 grams of protein. For a nutrient boost, certified nutrition and wellness consultant Lyssandra Guerra recommends adding spinach, baby kale, tahini, Medjool dates, coconut water, and coconut cream. Protein bar : Most bars have around 10 grams of protein. ACE-certified personal trainer Monica Morris agrees that protein bars are a great way to get extra protein."
    },
    {
      "title": "Meat-based protein",
      "content": "Meat-based protein There are plenty of inexpensive meats that give you a great amount of protein. In general, stick to leaner cuts, which are also usually healthier and contain fewer calories, saturated fats, and sodium. [19] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Chicken breast (100 grams): 22.5 grams of protein [20] X Research source Ground turkey (100 grams): 17.3 grams of protein [21] X Research source Ground pork (100 grams): 17.8 grams of protein Canned tuna: 19 grams of protein [22] X Research source Wild salmon (100 grams): 22 grams of protein [23] X Research source"
    },
    {
      "title": "Plant-based protein",
      "content": "Plant-based protein Plant-based proteins are generally less expensive than meat, so they’re a great way to hit your goals while saving money . Some options include: [24] X Research source Black beans (100 grams): 24 grams of protein [25] X Research source Chickpeas (100 grams): 21 grams of protein [26] X Research source Lentils (100 grams): 23 grams of protein [27] X Research source Tempeh (100 grams): 20 grams of protein [28] X Research source Tofu (100 grams): 8 grams of protein [29] X Research source Peanuts (100 grams): 23 grams of protein [30] X Research source Quinoa (100 grams): 12 grams of protein [31] X Research source"
    },
    {
      "title": "Dairy products",
      "content": "Dairy products Lots of dairy products are full of protein. Some inexpensive options include: Greek yogurt (100 grams): 9 grams of protein [32] X Research source Cottage cheese (100 grams): 11 grams of protein [33] X Research source String cheese (100 grams): 31 grams of protein [34] X Research source Skim milk (100 grams): 3 grams of protein [35] X Research source Soy milk (100 grams): 3 grams of protein [36] X Research source"
    },
    {
      "title": "Vegetables",
      "content": "Vegetables Many vegetables are a good source of protein, as well as other important nutrients. Check out these inexpensive and healthy options: Brussels sprouts (100 grams): 4 grams of protein [37] X Research source Corn (100 grams): 3 grams of protein [38] X Research source Russet potatoes (100 grams): 2 grams of protein [39] X Research source Broccoli (100 grams): 2 grams of protein [40] X Research source Asparagus (100 grams): 1 gram of protein [41] X Research source"
    },
    {
      "title": "Eat 0.36 grams of protein per pound you weigh (or 0.8 grams per kg).",
      "content": "Eat 0.36 grams of protein per pound you weigh (or 0.8 grams per kg). This is generally the amount of protein you need each day to meet your basic protein requirements. Protein helps your body build and repair muscle, so getting your daily requirement is a key component of staying healthy. However, the specific amount of protein you need depends on your activity level, age, weight, and sex. [42] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For instance, someone who is 170 lbs (77 kg) needs about 61 grams of protein each day to meet their minimum requirement. According to registered dietitian and nutritionist Jalpa Sheth, “different phases of life [have] different demands of protein.” She says, “When you are in your adulthood, it goes by how active you are.” And when you are older, the protein demand is higher “because your body needs more to…keep up its muscle mass.” If you aren’t getting enough protein , Morris says you might notice that you “get hungry more often,” are more susceptible to injury and weight gain, or get “dry nails or split ends” more frequently. If you’re not sure how much protein you need , consult your doctor or a registered dietitian. They can also help you come up with a plan to ensure you meet your protein requirements."
    },
    {
      "title": "Get 0.5-0.8 grams of protein per pound (1.2-1.7g per kg) to gain muscle.",
      "content": "Get 0.5-0.8 grams of protein per pound (1.2-1.7g per kg) to gain muscle. If you’re a bodybuilder or someone who’s trying to pack on the muscle, nutrition experts recommend slightly increasing the amount of protein you eat each day from the normal recommended amount. This helps you keep up with your increased rate of physical activity and see noticeable gains more quickly. For instance, someone who is 170 lbs (77 kg) needs between 85 to 136 grams of protein to gain muscle."
    },
    {
      "title": "Eat foods high in protein at every meal.",
      "content": "Eat foods high in protein at every meal. Ensure you’re getting healthy, high-quality sources of protein at breakfast, lunch, dinner, and while you snack. Some great options include poultry, fish, eggs, nuts (peanuts, almonds), seeds (chia, hemp), beans (black, garbanzo), lentils, grains (quinoa, buckwheat), dairy (yogurt, cottage cheese), and soy products (tofu, tempeh). [43] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Whenever possible, Registered dietitian and personal trainer Melody Sayers recommends that you “choose fish, beans, or lentils as your protein source.” She says, “Fish is high in healthy fats, such as Omega 3s” while “plant-based protein contains fiber, is free of cholesterol, and contains virtually no saturated fat.” Most dietitians don’t recommend getting the majority of your protein from red meat. Sayers says beef and pork are “much higher in saturated fat, sodium, and cholesterol” than lean animal proteins like chicken, turkey, and fish. However, it’s fine to enjoy red meat in moderation. Just look for grass-fed meat that has a high lean meat percentage to make a healthier choice."
    },
    {
      "title": "Split your protein intake across 3 to 5 meals.",
      "content": "Split your protein intake across 3 to 5 meals. Your body can only process so much protein at one time. So, don’t eat all of your protein in one sitting. [44] X Research source Morris recommends splitting your daily protein intake over 3 to 5 meals, including breakfast, lunch, dinner, and snacks. So, aim to get 28 to 47 grams of protein at each meal if your goal is to get 140 grams of protein each day. Morris says, “If someone were to try and intake their [protein] portion in a shorter period of time, that remainder generally will go to fat storage or waste products” instead of being absorbed by your body."
    },
    {
      "title": "Eat protein first at each meal.",
      "content": "Eat protein first at each meal. Digging into your proteins and veggies before you get to the carbs slows your digestion and helps you feel fuller for longer. [45] X Research source This also helps reduce spikes in blood sugar, which is great for those who are diagnosed with diabetes or pre-diabetes. [46] X Research source Eating your proteins first is also great if your goal is also to lose weight ."
    },
    {
      "title": "Switch out foods and ingredients for high-protein alternatives.",
      "content": "Switch out foods and ingredients for high-protein alternatives. For instance, nutrition and vegan food specialist Dee Dine recommends replacing pasta and noodles made from refined white flour with high-protein alternatives made from buckwheat, lentils, or chickpeas. Swap out white rice for quinoa, bulgur, amaranth, or couscous. When making salads, top them with nuts, seeds, and beans instead of croutons for a similar satisfying crunch."
    },
    {
      "title": "Opt for protein supplements when you’re in a pinch.",
      "content": "Opt for protein supplements when you’re in a pinch. Morris says protein powder and protein bars are a great, quick way to boost your protein intake. For instance, she suggests making protein shakes with protein powder or adding it to oatmeal, coffee, and even water. For a vegan alternative to whey protein powder, opt for hemp, pea, or soy protein. In particular, Dine says “hemp protein powder offers many nutritional benefits.” She says: “It offers a complete protein” to support the “major organs, including the brain.” It’s also “useful for weight control as it helps regulate the metabolism” and “keeps blood sugar levels balanced.” It is “full of antioxidants which boost the immune system” and “high in unsaturated fats which are healthy for the heart.”"
    },
    {
      "title": "Plan out your meals for each week.",
      "content": "Plan out your meals for each week. Before you go grocery shopping, write down all the meals you plan on making that week and the ingredients you need to make them . This helps ensure that you hit your protein goals each day. As a plus, making a meal plan and grocery list can prevent you from making impulse buys, which can help you save money. [47] X Trustworthy Source US Department of Agriculture U.S. agency responsible for promoting good agricultural practices and protecting consumers Go to source Cook more at home instead of eating out at restaurants so you know exactly how much protein you’re getting. Sheth says cooking at home is “a lot healthier” because “you can control the ingredients…as well as the portions and the way it's cooked.”"
    },
    {
      "title": "Track your protein intake with a food-tracking app.",
      "content": "Track your protein intake with a food-tracking app. Using a food-tracking app is a great way to ensure you’re hitting your protein goals and getting other important nutrients. Personal trainer John Diaz says, “I personally use a food tracker” to track “every calorie, every gram of fat, protein, carbohydrate, and fiber that I eat every day” which “works really well to keep me on track.” For instance, try an app like MyFitnessPal or Cronometer ."
    },
    {
      "title": "Maintain a healthy, balanced diet.",
      "content": "Maintain a healthy, balanced diet. Protein is just one component of a healthy, balanced diet . Ensure you’re getting plenty of vegetables, fruits, whole grains, and unsaturated fats (olive oil, avocados) to stay healthy and full of energy. [48] X Research source In general, about ½ of each meal should be veggies/fruits, ¼ should be protein, and ¼ should be whole grains."
    },
    {
      "title": "Is eating 140g of protein a day safe?",
      "content": "Is eating 140g of protein a day safe? Whether eating 140g of protein a day is safe or not depends on whether it’s within your daily recommended amount of protein. Your daily recommended amount is about 0.36g of protein per pound you weigh (or 0.8g per kg), though people who are very active or are bodybuilders may need 0.5-0.8g of protein per pound (1.2-1.7g per kg). If 140g of protein is over your daily recommended amount, then it can put you at a higher risk of developing kidney stones. [49] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If 140g of protein is under your recommended amount, then you might not be getting enough protein, which can be harmful to your nutrition and health."
    },
    {
      "title": "Is 140g a day enough to build muscle?",
      "content": "Is 140g a day enough to build muscle? To build muscle, nutrition experts recommend that you eat around 0.5-0.8g of protein per pound (1.2-1.7g per kg). So, if 140g falls inside your daily recommended amount of protein, then it is likely enough to build muscle. However, if your daily recommended amount of protein is more than 140g, it likely is not enough to build muscle."
    },
    {
      "title": "How many total calories should you eat a day?",
      "content": "How many total calories should you eat a day? On average, an adult man who is moderately active needs around 2,600 calories a day and an adult woman who is moderately active needs around 2,000 calories a day. However, the specific amount you need depends on your age, weight, height, sex, and activity level. [50] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To find out how many calories you need in a day , use an online calorie calculator . The amount of calories you need per day also depends on whether you want to lose weight . Most nutrition experts recommend cutting back 500 calories per day from your normal amount, which helps you lose 1 lb (0.45 kg) per week. [51] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Lean sources of protein, like poultry, fish, lentils, beans, tofu, and quinoa, are typically low in calories, so they can help you reach your weight loss goals while ensuring you get enough protein."
    },
    {
      "title": "Is 2 eggs a day enough protein?",
      "content": "Is 2 eggs a day enough protein? Eating 2 eggs typically gives you about 12 grams of protein. [52] X Research source While this is a great source of protein, 12 grams is not usually enough for the whole day. So, make sure you eat other protein-rich foods to hit your daily recommended amount, like poultry, fish, tofu, beans, Greek yogurt, and cottage cheese. [53] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    }
  ]
}