{
  "url": "https://www.wikihow.com/Dispute-a-PayPal-Transaction",
  "title": "How to Dispute a PayPal Transaction",
  "steps": [
    {
      "title": "Log in to your PayPal account and go to the Resolution Center.",
      "content": "Log in to your PayPal account and go to the Resolution Center. If you have a personal PayPal account, PayPal allows you to dispute a transaction with a seller if you have problems with the product you purchased. You can find a link to the resolution center by clicking on the PayPal icon on the upper-left side of your screen. If you scroll down to the bottom of the page, the link will be on the left-hand side, entitled “Resolve a problem in our resolution center.” PayPal has a different process if you have a business account rather than a personal account."
    },
    {
      "title": "Open your dispute.",
      "content": "Open your dispute. PayPal's Resolution Center allows you to send a message directly to the seller to resolve any problems you have. Click the button to “dispute a transaction.” You will be redirected to a page that lists all of your transactions. Select the transaction that you want to dispute by clicking on the open circle to the left of the transaction date, and then click the “continue” button."
    },
    {
      "title": "Specify a problem with the purchase or an unauthorized purchase.",
      "content": "Specify a problem with the purchase or an unauthorized purchase. At this point, you will be redirected to a page that asks you to identify the type of problem that you want to address. There are two selections: “I have a problem with an item I purchased” or “I want to report a transaction that I didn't authorize or was transacted in error.” Click the circle to the left of the selection that most accurately describes your dispute, and then click the “continue” button. If you chose, “I have a problem with an item I purchased,” you will be redirected to a screen that asks you to select either “I didn’t receive my item,” or “I received my item but it is significantly not as described.” Click the circle to the left of the selection that most accurately describes your dispute, and then click the “continue” button."
    },
    {
      "title": "Select the “category of your purchase” from a drop down menu.",
      "content": "Select the “category of your purchase” from a drop down menu. Once you choose your category, there is a message box that allows you to compose a message directly to the seller through PayPal’s Resolution Center."
    },
    {
      "title": "Explain your dispute and set forth how you want the dispute resolved.",
      "content": "Explain your dispute and set forth how you want the dispute resolved. Once you have composed your message, click the “continue” button. PayPal will record your dispute and send it to the seller. PayPal gives you 180 days from the date your payment posted to dispute the transaction. If a transaction is more than 180 days old, you still can report the problem to PayPal. [1] X Research source www.paypal.com/c2/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationBuyerFileDispute"
    },
    {
      "title": "Negotiate with the seller to resolve the situation.",
      "content": "Negotiate with the seller to resolve the situation. PayPal gives you and the seller the opportunity to exchange messages directly to attempt to resolve your problem. While you're negotiating, PayPal places a hold on any funds related to the disputed transaction. [2] X Research source www.paypal.com/c2/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationBuyerFileDispute When you open your dispute, PayPal sends the seller an email notification. You should receive a response from the buyer within seven days. From the day you open your dispute, you have 20 days to negotiate. If you don't close or escalate your dispute within that time, PayPal will automatically close your dispute. [3] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationResponseReview"
    },
    {
      "title": "Close or escalate your dispute.",
      "content": "Close or escalate your dispute. If you're completely satisfied with the solution you've reached with the seller, you can close the dispute. Otherwise you can escalate the dispute to get PayPal involved. Once you've closed a dispute, you can't reopen it, so make sure you're happy with the result. If you want to escalate a dispute that involves your payment for an item you didn't receive, you have to wait seven days for shipment of the item after you open your dispute before you can escalate it. [4] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationResponseReview"
    },
    {
      "title": "Log in to your PayPal account and go to the Resolution Center.",
      "content": "Log in to your PayPal account and go to the Resolution Center. The Resolution Center allows you to track all open disputes, review closed disputes, or initiate new ones."
    },
    {
      "title": "Open a dispute or click on an existing dispute.",
      "content": "Open a dispute or click on an existing dispute. If you haven't opened a dispute yet, PayPal requires you to open a dispute and attempt to negotiate directly with the seller before you escalate your dispute to a claim. If you've already opened a dispute and have failed to come to a resolution with the seller, you have the opportunity to escalate your dispute to a claim."
    },
    {
      "title": "Select the option to escalate under \"More Options.\"",
      "content": "Select the option to escalate under \"More Options.\" When you escalate your dispute to a claim, you ask PayPal to investigate the issues surrounding the transaction and decide the outcome."
    },
    {
      "title": "Provide the information requested.",
      "content": "Provide the information requested. PayPal will ask questions about the transaction to assist with the investigation. [5] X Research source www.paypal.com/c2/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationResponseReview As part of its investigation, PayPal will ask for information from the seller as well such as a shipping receipt or other evidence that the seller upheld their end of the bargain."
    },
    {
      "title": "Wait for PayPal to resolve your claim.",
      "content": "Wait for PayPal to resolve your claim. You can check the status of your claim at any time by logging in to your PayPal account and going to the Resolution Center. Once PayPal starts reviewing your claim, you'll be able to see an estimated resolution date."
    },
    {
      "title": "Identify unauthorized activity.",
      "content": "Identify unauthorized activity. If you see transactions on your PayPal account that you didn't authorize, you can skip the dispute process and immediately file a claim with PayPal. [6] X Research source www.paypal.com/c2/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationUnauthorizedActivity"
    },
    {
      "title": "Log in to your PayPal account and go to the Resolution Center.",
      "content": "Log in to your PayPal account and go to the Resolution Center. PayPal's Resolution Center helps you resolve any problems with unauthorized transactions or other account activity. [7] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    },
    {
      "title": "Click the \"Report a Problem\" button.",
      "content": "Click the \"Report a Problem\" button. Using this button allows you to report unauthorized activity to PayPal directly, rather than filing a dispute and going through negotiation with the seller. [8] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    },
    {
      "title": "Provide the information requested by PayPal.",
      "content": "Provide the information requested by PayPal. You'll be asked questions about the transaction you're reporting so PayPal has the necessary details to investigate your report. [9] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    },
    {
      "title": "Change your PayPal password and security questions.",
      "content": "Change your PayPal password and security questions. After you've filed an unauthorized activity claim, PayPal will prompt you to change your password to prevent further unauthorized activity on your account. [10] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    },
    {
      "title": "Wait for PayPal to review your claim.",
      "content": "Wait for PayPal to review your claim. PayPal attempts to make an initial review of claims within 10 days of the date they're filed. If PayPal determines the activity you reported was unauthorized, it will refund the amount of the transaction to your account and close the claim. If PayPal needs information from other parties involved in the transaction to resolve the claim, it will contact them and give them seven days to respond before resolving the claim. [11] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    },
    {
      "title": "Wait for PayPal's final decision.",
      "content": "Wait for PayPal's final decision. After all necessary information has been received, PayPal fully investigates the activity you've reported. If PayPal needs any further information, you'll receive a message in the Resolution Center. You also can log in and go to the Resolution Center to check on the status of your claim at any time. [12] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails PayPal typically comes to a final decision on unauthorized activity claims within 30 days. [13] X Research source www.paypal.com/us/cgi-bin/webscr?cmd=xpt/CaseManagement/customerservice/EducationEnterUnauthorizedDetails"
    }
  ]
}