{
  "url": "https://www.wikihow.com/Dress-if-You%27ve-Got-an-Hourglass-Figure",
  "title": "How to Dress if You've Got an Hourglass Figure",
  "steps": [
    {
      "title": "Look for tops, outerwear, and dresses that accentuate your waist.",
      "content": "Look for tops, outerwear, and dresses that accentuate your waist. Since an hourglass figure is slimmest at the waist, clothes that are nipped in at your waist will help show your curves to their best advantage. Tops and dresses that wrap around or tie at the waist are especially flattering, as are belted trench coats, fit-and-flare dresses, and peplum blouses. [1] X Research source A slim-fitting scoop-neck top tucked into high-waisted pants or a skirt can be another great way to emphasize your waist. Just make sure the top fits you comfortably in the bust."
    },
    {
      "title": "Avoid shapeless or too-tight clothes.",
      "content": "Avoid shapeless or too-tight clothes. If you wear baggy, shapeless clothing, it will swallow your figure and make you look boxy instead of curvy. On the other hand, if your clothes are too tight, you'll look uncomfortable, and it can draw attention to any areas where you carry a little more weight. [2] X Research source Instead, look for clothes that skim lightly across your figure, as this will make you look and feel more confident. If you have any problem areas you'd like to minimize, consider wearing a form-fitting—but not extremely tight—garment made from a supportive material like heavy knits, denim, or stretch fabrics."
    },
    {
      "title": "Opt for V-neck, scoop neck, or boat neck tops to flatter your bust.",
      "content": "Opt for V-neck, scoop neck, or boat neck tops to flatter your bust. Whether you love showing off your bust or you'd prefer to keep your look more modest, if you have a larger chest, it's best to opt for tops where the neckline creates an angle or a curve. A V-neck can be a great way to make your bust look smaller, for instance, since the sharp angle draws attention downward toward your waist. [3] X Research source A boatneck top is cut in a horizontal line from shoulder to shoulder, so it shows off the graceful curve of your collarbone. Scoop neck frame your face and show off your collarbone area, but they may not expose as much cleavage as a V-neck. Avoid high-necked style like polo tops, turtlenecks, or tight crew necks, which can make your chest look larger."
    },
    {
      "title": "Avoid pieces with extra fabric at the hips or bust.",
      "content": "Avoid pieces with extra fabric at the hips or bust. Avoid wearing ruffles or pleats around your waist or hips. Since your figure is already curvy, adding extra volume to these areas will make you appear heavier than you are, and that can make your body seem disproportionate. [4] X Research source An exception to this might be vertical ruffles on a blouse, which can help minimize your bust. You may also want to avoid wearing horizontal stripes in these areas, as these can make you seem wider."
    },
    {
      "title": "Use belts to draw attention to your waist.",
      "content": "Use belts to draw attention to your waist. If you're wearing a dress, top, or jacket that's a little flowy, you can add extra emphasis on your waist by adding a belt. Depending on your style, you might add a glamorous skinny belt on top of a flowy dress, or you might wear a bold, wide belt on top of a stylish trench. For the most impact, wear the belt cinched over the smallest part of your waist. [5] X Research source If you have a larger belly, a belt might emphasize that rather than the curve of your waist. In that case, consider highlighting the sides of your waist by wearing a cropped jacket or high-waisted bottoms."
    },
    {
      "title": "Wear supportive undergarments that fit properly.",
      "content": "Wear supportive undergarments that fit properly . When you have a curvy figure, it's especially important to ensure your undergarments fit well and provide proper support. For instance, your bra should comfortably lift your breasts, but the straps and back shouldn't dig into your skin. If you need to, have your bra professionally fitted so you'll know exactly what size works best for you. [6] X Research source When you're choosing underwear, look for seamless versions if you prefer full-coverage styles, which will help reduce visible underwear lines. You can also wear thong underwear to ensure there won't be any lines under your clothes."
    },
    {
      "title": "Wear a body-skimming jersey top with bootcut jeans for a comfortable everyday look.",
      "content": "Wear a body-skimming jersey top with bootcut jeans for a comfortable everyday look. Jersey is a knit fabric that's lightweight and soft, and it's commonly used in T-shirts and other casual tops. As long as your garment fits properly, the jersey will skim over your figure, making you look comfortable and cool while still being flattering. Then, the slight flare on your jeans will balance out the curves of your hips. [7] X Research source Try wearing this look with your favorite sandals and a messy ponytail for a fun weekend outing!"
    },
    {
      "title": "Go girly and casual by pairing a skater dress with tennis shoes.",
      "content": "Go girly and casual by pairing a skater dress with tennis shoes. A skater dress is a great way to show off your hourglass figure because it fits like a T-shirt on the top, is fitted at the waist, and then flares out at the hips. This casual dress is perfect for wearing to school, work, or just for hanging out with your friends—just toss on some low-profile sneakers and grab your bag! A choker necklace is a pretty, trendy accessory to add to this look. If your style is a little tougher, try wearing your skater dress with a pair of rugged ankle boots instead. Add an extra in-your-face touch with a pair of ripped fishnets and plenty of dark eyeliner!"
    },
    {
      "title": "Wear a miniskirt and a fitted tee if you want to show off your legs.",
      "content": "Wear a miniskirt and a fitted tee if you want to show off your legs. If you love your shapely legs and you want to make them the focus of your outfit, try wearing a fitted scoop-neck tee, a miniskirt, and a pair of low-profile sneakers. The T-shirt will give you enough coverage on top to balance out the fact that your legs are exposed, giving you a fun, flirtatious look. [8] X Research source For an unexpectedly flattering touch, choose a T-shirt with accents on the shoulders, like rhinestones or a lace overlay."
    },
    {
      "title": "Toss on a bomber jacket for a cool way to stay warm in chilly weather.",
      "content": "Toss on a bomber jacket for a cool way to stay warm in chilly weather. Bomber jackets have a stretchy band around the waist, perfect for drawing attention to that area. They're comfortable and casual, and you can make them work with almost any style. For instance, a leather bomber jacket looks just as great with ripped boyfriend jeans as it does with a floaty dress. Try a satin bomber jacket with skinny jeans, heels, and a colorful fitted V-neck tee for a hip-hop inspired look that's perfect for an hourglass figure."
    },
    {
      "title": "Opt for peplum tops and dresses to emphasize your waist.",
      "content": "Opt for peplum tops and dresses to emphasize your waist. Peplum tops typically fit snugly at the waist, then flare outward near the bottom hem, while peplum dresses often look similar to a peplum top with a pencil skirt. Garments with a peplum already mimic the shape of an hourglass, so they'll accentuate your curves perfectly. [9] X Research source Try wearing a peplum top with a body-con skirt and stiletto heels for a glam night out, for instance."
    },
    {
      "title": "Try an empire-waist dress for an easy, flattering look.",
      "content": "Try an empire-waist dress for an easy, flattering look. Empire-waist dresses are cut so that the waist of the garment hits just under the bust, emphasizing an area that's typically quite narrow on an hourglass figure. The rest of the dress will flow over your stomach and hips, so it's perfect for hourglasses of all sizes. [10] X Research source For instance, if you're going to brunch with friends, you might wear a knee-length, empire waist dress with wedge sandals, statement earrings, and a colorful handbag. These dresses can be great for work, too!"
    },
    {
      "title": "Use a cropped jacket for another way to draw attention to your waist.",
      "content": "Use a cropped jacket for another way to draw attention to your waist. When you wear a jacket that ends at your natural waist, it draws the eye to that area. That's a perfect, subtle way to accentuate your figure when you don't want to wear a belt. [11] X Research source For instance, you might wear a satin tank top tucked into an A-line skirt, then top that with a cropped brocade jacket for an outfit perfect for an elegant occasion."
    },
    {
      "title": "Try a dressy jumpsuit that's nipped-in at the waist for elegant comfort.",
      "content": "Try a dressy jumpsuit that's nipped-in at the waist for elegant comfort. If you choose a jumpsuit in a dressy material like chiffon, lace, or crepe, it can be just as stylish as a dress, but you'll have the added convenience of wearing pants. Look for a style that will flatter your waist without constricting your bust or hips so you'll be comfortable no matter what event you're attending. [12] X Research source Style your jumpsuit with an updo, dressy heels, and bold earrings for a head-turning look."
    },
    {
      "title": "Opt for a bodycon dress if you're daring.",
      "content": "Opt for a bodycon dress if you're daring. Bodycon dresses fit closely to your figure, so they're a great way to show off your hourglass figure. However, they're not very forgiving, so if you have any areas you'd rather not show as much, consider choosing a dress made from a heavy stretch material that will hold you in. [13] X Research source Bandage dresses are an example of a bodycon style. Style your bodycon dress with tough ankle boots, dark eye makeup, and messy hair for an edgy rock-n-roll look."
    },
    {
      "title": "Wear a tailored blouse and slim-fitting trousers for a smart, dressy look.",
      "content": "Wear a tailored blouse and slim-fitting trousers for a smart, dressy look. When you wear a blouse that's been tailored specifically to your body, you'll have plenty of room in your bust area while still showing off your waist. If you pair that with trousers that are cut to be narrow through your leg, you'll look professional and put-together, but you'll still be comfortable enough to get things done throughout the day. [14] X Research source Try adding a pair of sleek pumps and a statement necklace for a simple, sophisticated touch. A shirt that wraps at the waist is another great work-friendly option."
    },
    {
      "title": "Top your look with a belted trench if your style is classic.",
      "content": "Top your look with a belted trench if your style is classic. A trenchcoat is a timeless piece that looks good on almost everyone, but it's especially flattering on a curvy hourglass figure. Leave the trenchcoat open over a form-fitting outfit, or wear it belted if your outfit is flowy or boxy, as this will help define your waist. [15] X Research source Try wearing your hair in a sleek bun, then toss on a pair of low heels for a look that's both pretty and professional."
    },
    {
      "title": "Go for business casual with a scoop-neck blouse, flared work pants, and low heels.",
      "content": "Go for business casual with a scoop-neck blouse, flared work pants, and low heels. A smart blouse, comfortable work pants, and sensible shoes are all you need for a look that's flattering without drawing too much attention to your figure. In fact, by rotating through several blouses, you can wear variations of this outfit to work pretty much every day, if it makes you feel comfortable. If you're not comfortable walking in heels, flat-soled dress shoes are fine."
    },
    {
      "title": "Wear a wrap dress for an easy way to look professional.",
      "content": "Wear a wrap dress for an easy way to look professional. Wrap dresses are made to look like they're one piece of fabric that wraps around and ties at the waist. This versatile style looks great on a variety of body types, but it's especially flattering to an hourglass shape. Even better, it's a no-fuss way to look put-together when you're in a hurry. Wear your hair in a neat, low bun and opt for a pair of sensible pumps to complete this work-ready look."
    },
    {
      "title": "Invest in a single-breasted jacket or blazer to dress up your work outfits.",
      "content": "Invest in a single-breasted jacket or blazer to dress up your work outfits. Suit jackets and blazers are a great way to add a professional touch to any outfit, and single-breasted options are especially flattering on an hourglass figure. They're versatile, too—the same blazer might look just as good with a blouse as it does over a dress, so take the time to find one that fits you well. Also, if you can afford it, don't be afraid to pay a little more for a quality piece that will last a while. [16] X Research source Double-breasted blazers can add too much bulk in your bust area."
    },
    {
      "title": "Opt for a high-waisted pencil skirt for a sophisticated work look.",
      "content": "Opt for a high-waisted pencil skirt for a sophisticated work look. Pencil skirts are made to fit close to your body, and a high-waisted version will typically hit right around the narrowest part of your waist. You can wear this versatile wardrobe staple a variety of different ways, like with a tucked-in chiffon blouse and pumps one day or with a cami and blazer another. [17] X Research source For instance, you might tuck a silky tank top into your pencil skirt, then wear that with a relaxed blazer with the sleeves rolled up."
    }
  ]
}