{
  "url": "https://www.wikihow.com/Dry-Shave",
  "title": "How to Dry Shave",
  "steps": [
    {
      "title": "Purchase an electric shaver.",
      "content": "Purchase an electric shaver. Electric shavers are all either rotary shavers or foil blades. Rotary shavers have several spinning blades that are usually pivoted so they can adjust to various angles of the skin. Foil blades have a linear blades that move back and forth underneath a flat, perforated steel cover. [1] X Research source Models are made for men and women that are designed to perform optimally for gender specific applications. Models that perform best over the flat surfaces of the legs will not work as well on the sharp angles of a face and vice versa."
    },
    {
      "title": "Clean your face.",
      "content": "Clean your face. Providing a clean surface will help your shaver perform optimally by removing debris and oils. Using a gentle cleanser prior to shaving will also help to soften the hairs."
    },
    {
      "title": "Keep your face dry.",
      "content": "Keep your face dry. To get the best results from an electric razor, the hair should be rigid and as a dry as possible. [2] X Research source Many dry shave products are designed to stiffen the hairs using alcohol and degreasers. [3] X Research source"
    },
    {
      "title": "Consider trimming your hair first.",
      "content": "Consider trimming your hair first. If your hair is longer than .25\" you should consider trimming the hair first. Many shavers come with a trimmer attachment that can be used by flipping a switch on the device."
    },
    {
      "title": "Clean the shaver",
      "content": "Clean the shaver . Electric shavers are machines, and just like any other machine, they will perform best when they are well-maintained. Always check to be sure there are no remaining hairs in the blades prior to shaving. Rinse the blade for several seconds to clear away any dirt or hair. You may also want to consider disinfecting the razor with alcohol before starting your shave. Many shavers come with their own cleaning tools. Be sure to clean them after every usage so that they are ready to go the next time."
    },
    {
      "title": "Hold the razor at right angles.",
      "content": "Hold the razor at right angles. This will create maximum contact between the blades and the skin. It will reduce shaving time and get more of the hairs with each pass over the skin. Foil blade shavers should be moved in long, straight strokes. Rotary shavers will work best when moved in a circular motion."
    },
    {
      "title": "Keep the skin taut with your free hand.",
      "content": "Keep the skin taut with your free hand. Use your thumb and index finger to make your skin taut. This will provide a smooth, even surface to pass the shaver over. An flat surface will trim your hair more evenly."
    },
    {
      "title": "Start with the sensitive areas first.",
      "content": "Start with the sensitive areas first. Sensitive areas of the face would include areas along the neck where razor burn most likely occurs. Starting here when the razor is still cooler and cleaner will give you a better, smoother shave. As the razor gets hotter and collects more hair particles, it won't perform quite as well and can be harsh on sensitive skin."
    },
    {
      "title": "Let the razor cool.",
      "content": "Let the razor cool. Electric razors tend to get hot with use. Heat can irritate the skin and lead to razor burn. If you notice the razor is beginning to feel hot against your skin, shut it off for a few minutes. Once it cools down, resume your shave."
    },
    {
      "title": "Consider trimming your hair first.",
      "content": "Consider trimming your hair first. If you have longer facial hair, it will be very difficult to dry shave. Trim any hair that is long enough with scissors or an electric hair trimmer, then you will have a manageable beard or mustache to dry shave."
    },
    {
      "title": "Use a new razor.",
      "content": "Use a new razor. Old razors that are dull require a lot of pressure to cut the hair. This will increase the likelihood that you will get cuts or nicks while dry shaving. Experiment with razors to find the one that shaves you the best. The moisturizing strips on many disposable razors only work in the presence of water, so they are useless for a dry shave."
    },
    {
      "title": "Apply your desired product to your face.",
      "content": "Apply your desired product to your face. It's best to use just about anything between your skin and the razor, if you can. Water, soap, shampoo, olive oil, lotion, and hair conditioner will all do if you don't have anything that says it's for shaving. [4] X Research source"
    },
    {
      "title": "Shave with the grain.",
      "content": "Shave with the grain. When dry shaving the goal isn't to get the closest shave, but simply to remove the hairs as much as possible without causing too much damage to your skin. Going against the grain (shaving the opposite direction that the hair grows) makes for the closest shave, but it also produces the most irritation. To reduce the risk of injury when dry shaving, always shave with the grain instead."
    },
    {
      "title": "Pull the skin taut.",
      "content": "Pull the skin taut. You don't have to actually stretch the skin. Just use your fingers to create a flat, firm surface for the razor to cut across. Start with the sensitive areas around the ankles and behind the knees. These areas are more likely to get nicked as the blade gets dull and collects skin and hair in the course of shaving."
    },
    {
      "title": "Glide the razor over your face.",
      "content": "Glide the razor over your face. You should not need to press down or apply pressure with the razor. If this is necessary, then the razor is probably not sharp enough. A sharp razor will cut hair cleanly at its base level with the skin. Pressing the blade down may cut the hair at a slightly lower spot, but it will also bring the blade in contact with the sensitive skin that surrounds the other side of the follicle. Accept that a dry shave will probably not be as close as a wet shave. Grip the razor handle at the very bottom with your fingertips, to apply the least pressure possible to your skin. More leverage means more likelihood of the blade cutting flesh, instead of hair."
    },
    {
      "title": "Let your skin rest.",
      "content": "Let your skin rest. Don't rub with a towel, as that can irritate the freshly shaved skin. If you have a moisturizer, apply it to your skin. This will help to reduce any redness or irritation to your skin."
    },
    {
      "title": "Acquire a new razor.",
      "content": "Acquire a new razor. Dull razors will force you to bear down harder to get a close shave. This can result in more nicks or cuts. New razors come pre-lubricated and will give you the best results. [5] X Research source Select a razor with one or two blades max. More blades will pull hair and cut below the skin. This can lead to ingrown hairs or razor burn. A single-blade razor won't clog up as quickly as a razor with 2 or more blades."
    },
    {
      "title": "Keep your skin taut.",
      "content": "Keep your skin taut. Use the hand that isn't holding the razor to stretch the skin slightly. Spread your thumb and index finger far apart and apply slight pressure to skin to make the skin into a smoother flatter surface. This will make it easier to apply the appropriate amount of force with the razor."
    },
    {
      "title": "Shave with the grain.",
      "content": "Shave with the grain. Gently press the blade to your skin and glide it in the same direction that the hair grows. Use light, long strokes. Shaving against the grain will likely result in painful razor burn that appears as bumpy, irritated skin. Shaving with the grain will not be as close as it would with going against the grain, however you will be less likely to damage the skin."
    },
    {
      "title": "Clean your razor.",
      "content": "Clean your razor. Rinse the razor u/nder water to clean out any remaining hairs from between the blades. Tap the razor against the sink or tub wall to help dislodge hairs as well. Cleaning a reusable razor will prolong the life of the blade. If you used a disposable razor you can simply throw it away. Consider dipping the razor in rubbing alcohol to help dry out the blade and prevent rust from forming."
    },
    {
      "title": "Splash your skin with cool water.",
      "content": "Splash your skin with cool water. Cup your hands under the faucet to catch some cold water, then splash it against your skin. Do this for 30-40 seconds. Cooling the skin down with water will help to close your pores and soothe the skin. If you have any nicks, the cool water will help stop the bleeding."
    },
    {
      "title": "Apply an aftershave to your face if desired.",
      "content": "Apply an aftershave to your face if desired. If you shaved your face, you can apply an aftershave to tone the skin or moisturize it. Aftershaves are either made with a base of alcohol or witch hazel oil. Alcohol will add more tone to the skin, but can also dry skin out. Witch hazel is better at moisturizing the skin, but does not add as much tone as aftershave."
    },
    {
      "title": "Moisturize your skin.",
      "content": "Moisturize your skin. Shaving can be rough on your skin, you can even lose some of your skin in the process. Keep your skin looking and feeling healthy by treating it with some non-alcohol and fragrant-free moisturizers. [6] X Research source Simply place a dollop on your hands, then massage the lotion gently into your skin."
    }
  ]
}