{
  "url": "https://www.wikihow.com/Enable-MMS-Messaging-for-iPhone",
  "title": "How to Turn On MMS Text Messages on an iPhone",
  "steps": [
    {
      "title": "Turn on cellular data",
      "content": "Turn on cellular data . If you want to send a multimedia message like a photo, video, or group message when you're not connected to Wi-Fi, or if you're want to send it to someone who isn't using iMessage (such as an Android user), you'll need to use MMS. [1] X Research source MMS requires using your mobile carrier, even if you're connected to the internet via Wi-Fi. To turn on cellular data: Open the Control Center by swiping down from the upper-right corner of the home screen on iPhone X or later, or by swiping up from the bottom of the home screen on other models. If the cellular icon (the vertical antenna with two curved lines on either side in the upper-right tile) is gray, tap it to turn it green. If not, you're already on the network. Some cellular plans don't come with MMS messaging, while others may charge if you go over a certain amount. Make sure you check with your carrier to find out the specific limitations before sending an MMS message. [2] X Research source"
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. It's the gray gear icon on the home screen or in your App Library."
    },
    {
      "title": "Scroll down and tap Messages.",
      "content": "Scroll down and tap Messages . You can find this between Phone and FaceTime ."
    },
    {
      "title": "Scroll down and toggle on \"MMS Messaging\".",
      "content": "Scroll down and toggle on \"MMS Messaging\". This will be underneath the SMS/MMS header. This allows your phone to send messages with pictures and videos using your data plan with your carrier. MMS is different from iMessage , which can be sent using a Wi-Fi signal when senders and recipients have iMessage enabled. It doesn’t use cellular data when Wi-Fi is available. Any time you send a photo or other type of multimedia message to someone with an Android, it will always be sent as MMS. If you don't enable MMS, you won't be able to send multimedia messages to anyone with an Android or with an iPhone who isn't using iMessage."
    },
    {
      "title": "Toggle on \"Group Messaging\".",
      "content": "Toggle on \"Group Messaging\". This allows you to send and reply to group messages, which may require MMS if other group members aren't using iMessage."
    },
    {
      "title": "Check to see if you can send an SMS message.",
      "content": "Check to see if you can send an SMS message. An SMS message is a regular text message sent through your cellular network. If you can send an SMS but not an MMS, it might be because the attachment is too large—carriers do limit MMS size. For example, if you (or the person you're sending the message to) is using Verizon, the message must be smaller than 3.5 MB. [3] X Research source You'll need to turn off iMessage to send an SMS, so follow these steps: Open the Settings app. Scroll down and tap Messages . Toggle off iMessage . Open the Messages app and attempt to send a text-only message to one recipient with no attachments. If the text-only message went through, try sending it again with the attachment. If it still doesn't go through, it's probably because the attachment is too big, or because your carrier limits MMS. If both SMS and MMS messages go through when iMessage is disabled, it's likely because the recipient is using an Android, but their phone number was once connected to an iPhone. Your iPhone may be attempting to attempt to send messages to their iMessage account rather than their phone number with MMS. If this is the case, have the recipient contact Apple for instructions for unlinking their phone number from the previously-associated iMessage account. After testing, toggle iMessage back on."
    },
    {
      "title": "Update your iPhone.",
      "content": "Update your iPhone. You may run into issues when your phone hasn't been updated in a while. To update your iOS, open the Settings app. Click General, and then click Software Update."
    },
    {
      "title": "Reset your Network Settings.",
      "content": "Reset your Network Settings. This will clear all of your cellular and Wi-Fi connections, potentially fixing any errors in your MMS service. Just be aware that this will clear all of your saved Wi-Fi network passwords, so you'll have to enter them again when you connect to Wi-Fi. Open Settings. Tap General. Tap Transfer or Reset iPhone. Tap Reset. Tap Reset Network Settings. If you have a passcode, you will be asked to enter it."
    },
    {
      "title": "Contact your carrier.",
      "content": "Contact your carrier. MMS is a carrier feature, which means that your carrier manages the servers that send MMS data from your iPhone to other phones and vice versa. If you're having persistent MMS problems, your carrier may be able to reset your MMS service on their end, fixing the connection issue. [4] X Research source"
    }
  ]
}