{
  "url": "https://www.wikihow.com/Find-out-More-About-Your-Crush",
  "title": "How to Find out More About Your Crush",
  "steps": [
    {
      "title": "Start with a simple Google search.",
      "content": "Start with a simple Google search. Enter your crush’s first and last name, along with a few identifying details to narrow the search -- for instance, their hometown, school, or workplace. If you don’t know their full name or don’t have any identifying details, you may have to sort through several pages of search results. Try switching to Google Images to see if any pictures of your crush come up. If you have access to a picture of them, like a Facebook profile pic, you can do a screen capture and search for their picture online. Click the camera icon on the Google Images home page and upload your screen capture, and Google will look for matches online."
    },
    {
      "title": "Try a search engine that’s just for people.",
      "content": "Try a search engine that’s just for people. If your Google search comes up short, or if you’re still looking for additional information, you might want to try a search engine designed specifically for looking up people. Pipl, 123People and PeekYou are some specialized search engines that may be useful. [1] X Research source Be aware that you can’t believe everything these search engines pull up. If you find any information that seems unlikely or doesn’t add up, keep in mind that it could be inaccurate. [2] X Research source"
    },
    {
      "title": "Look up their Facebook profile.",
      "content": "Look up their Facebook profile. It’s easiest to find someone on Facebook if you know their first and last name, or if you have mutual friends on Facebook. How much you can see of their profile will vary depending on what their privacy settings are. However, you can also search for “[their name] + photos,” which will show you other people’s photos that they are tagged in."
    },
    {
      "title": "Find their Instagram account.",
      "content": "Find their Instagram account. Instagram is a little harder to find people on, unless you happen to know their Instagram handle. If you have mutual friends, try looking at your friends’ followers to see if you can spot them. If you found their Facebook profile, you can look for Instagram photos in their Photos section, which should link to their Instagram account."
    },
    {
      "title": "Search for them on Twitter.",
      "content": "Search for them on Twitter. You won’t necessarily find a lot of personal information on Twitter, but reading your crush’s tweets may give you an idea of what they care about and what their sense of humor is like. This is also easier if you happen to know their handle, as many people don’t use their real names on Twitter. Try looking at mutual friends’ followers again, or search for their Instagram handle if you know it, as it may be the same as their Twitter handle."
    },
    {
      "title": "Check out their Spotify profile.",
      "content": "Check out their Spotify profile. You can learn a lot about someone from what kind of music they like, and you may be able to see what they’ve listened to most recently or what playlists they have. it will also give you a chance to see if you like any of the same bands, which could be a great conversation starter. [3] X Research source If you do decide to talk to them about bands you both like, don’t let on that you already know what they listen to. Find a natural way to bring it up in conversation, like, “I can’t stop listening to this new album by the National. Have you heard of them?”"
    },
    {
      "title": "Keep what you learn about your crush to yourself.",
      "content": "Keep what you learn about your crush to yourself. While whatever information you might find online about your crush is technically public, they may not appreciate having details about their life shared with people they don’t know very well. Keeping these things to yourself can also save you the embarrassment of having to admit to your crush that you were looking them up!"
    },
    {
      "title": "Find a mutual interest.",
      "content": "Find a mutual interest. What does your crush do in their spare time? Look for clues about what their interests might be. Did you see them carrying a sci fi novel last week? Have you heard them mention the new rock climbing gym? If you can’t find any common interests, consider taking up something they’re interested in to see if you enjoy it too. It could give you a chance to get to know them better and help you spend time together. You could always ask them directly! For instance, you could ask \"Are you up to any fun adventures this summer?\" or \"You seem really creative. Do you dance or play an instrument?\" [4] X Expert Source John Keegan Dating Coach Expert Interview. 13 July 2021."
    },
    {
      "title": "Get to know their friends.",
      "content": "Get to know their friends. This can be a good way to see a side of your crush you might not otherwise. Not only will you get a better idea of what kind of person they are based on who they hang out with, you’ll most likely hear their friends talk about them. You can even ask a friend or two to tell you more about them, if you trust them not to spill the beans that you were asking. Don’t try to force a friendship just to get close to your crush. If you just don’t click with your crush’s friends, or if their friends don’t seem interested in hanging out with you, don’t push it."
    },
    {
      "title": "Spend time with them in different settings.",
      "content": "Spend time with them in different settings. If you usually only see your crush at school, find a way to hang out with them outside of school. If you’ve only ever seen them when you were hanging out with a big group of people, try to catch them one on one. You may see a side of them you hadn’t before. [5] X Research source It’s better to try this once you’ve gotten to know your crush a little bit. That way you can be direct instead of trying to “accidentally” run into them outside of your normal routine."
    },
    {
      "title": "Get to know them as a friend.",
      "content": "Get to know them as a friend. Even if you think your crush likes you back, it’s sometimes a good idea to stay in the friend zone until you know a little more about them. This will make it easier for you to be yourself, since you won’t be pressuring yourself to make a move, and it may make them behave more genuinely too. Just make sure you don’t wait too long to act once you figure out you want to be more than friends. [6] X Research source"
    },
    {
      "title": "Pay attention to how they treat others.",
      "content": "Pay attention to how they treat others. Your crush might be sweet and charming with you, but that doesn’t mean they’re a good person to everyone they meet. Take note of how they act towards their friends, strangers, and most importantly, towards anyone who’s less popular or fortunate than they are. [7] X Research source"
    },
    {
      "title": "Start with a text conversation if you’re too shy to speak up in person.",
      "content": "Start with a text conversation if you’re too shy to speak up in person. It can be hard working up the nerve to talk to your crush. Try sending them a text or an instant message instead. Keep the first message brief and light -- send them a funny picture or link, or think of a question they would know the answer to. If they continue the conversation, you can gradually write longer messages. [8] X Research source Don’t reference things that you have no obvious reason for knowing about them. For instance, you wouldn’t want to start the conversation by sending them a picture of an adorable koala if they’ve never actually told you they like koalas. However, if they have bright red hair, you could send them a silly article like “Why People with Red Hair Are Smarter Than Anyone Else.” Always wait for a response before sending another message. [9] X Research source Try asking them what they've watched on Netflix! That's a great way to break the ice. [10] X Expert Source John Keegan Dating Coach Expert Interview. 13 July 2021."
    },
    {
      "title": "Have a rough idea of what you’re going to say ahead of time.",
      "content": "Have a rough idea of what you’re going to say ahead of time. It’s easy to freeze when you finally get the opportunity to talk to your crush, so you might want to think about what you’ll say beforehand. Be careful not to plan things out too much, though -- you might end up sounding like you’re reciting something you’ve rehearsed, and you could get thrown off if the conversation doesn’t go exactly how you imagined it."
    },
    {
      "title": "Keep in mind they may be nervous too.",
      "content": "Keep in mind they may be nervous too. After all, it’s entirely possible that your crush likes you back, in which case they may be just as nervous about the conversation as you are. Instead of focusing on whether or not you’ll be able to make a good impression, just remember that they might be trying to get up the nerve to talk to you too. [11] X Research source"
    },
    {
      "title": "Start a conversation about something you have in common.",
      "content": "Start a conversation about something you have in common. It can be intimidating to start a conversation with your crush, but there’s no better way to find out if they’re a good match for you. Just think of it like any other conversation: you can start by talking about a neutral subject that you have in common, like homework, the weather, or a local sports team. If that goes well, ask them a question or two about themselves to keep the conversation going. You might ask, \"Do you have any fun summer plans?\" If they do, you could say, \"This August, I'm going to the Outer Banks. It's really beautiful there!\" [12] X Expert Source John Keegan Dating Coach Expert Interview. 13 July 2021. Reader Poll: We asked 2660 wikiHow readers who've talked to their gym crush, and 54% of them agreed that the best way to break the ice is by making small talk about their workout routine. [Take Poll] This is a great example of how to start a conversation with your crush!"
    },
    {
      "title": "Ask questions to keep the conversation going.",
      "content": "Ask questions to keep the conversation going. If it seems like the conversation is going well and you want to keep your crush talking, ask them questions. It helps to ask a simple question and then follow that with some related questions. For instance, if you ask your crush what their favorite movie is and they say The Avengers, you can ask if they’ve seen the latest Marvel movie or what their favorite character is. Ask questions like \"What's something you're really interested in?\" or \"What are you really passionate about?\" [13] X Expert Source John Keegan Dating Coach Expert Interview. 13 July 2021."
    }
  ]
}