{
  "url": "https://www.wikihow.com/Deal-with-Being-Fired",
  "title": "How to Deal with Being Fired",
  "steps": [
    {
      "title": "Try not to get angry or freak out.",
      "content": "Try not to get angry or freak out. Though you may be feeling intense feelings of rage or anger, it’s important not to insult or yell at your boss or others in the office. Once your boss or HR supervisor tells you the news, try to swallow any anger in the moment. [1] X Research source Getting upset at your boss or your co workers will only damage your reputation and create a scene. Rather than get mad, focus on getting out of the meeting with some measure of dignity. Do not get physical with your boss. No matter how angered you may by your firing. Harming your boss will most likely result in you being arrested, which could negatively impact your chances in finding a new job, as employers often check criminal records."
    },
    {
      "title": "Ask for reasons why you were fired.",
      "content": "Ask for reasons why you were fired. There is a big difference between getting laid off and getting fired. Find out the specific reasons why your superiors decided to fire you, rather than lay you off. [2] X Expert Source Melody Godfred, JD Career Coach Expert Interview. 29 April 2020. Was it because of your attitude in the workplace? One specific event or account that went sideways? Or downsizing and cost cutting? [3] X Research source Posts on various social media accounts can often result in firings. If the content on the post(s) could be considered offensive, the company may not want to be associated with you anymore and may let you go. Determining the reason behind your firing will help you understand why you are being fired. It will also allow you to improve in a certain area in your next job or role."
    },
    {
      "title": "Do not sign a severance package right away.",
      "content": "Do not sign a severance package right away. Once you are told you are being fired, your boss will likely hand you a stack of pink slip paperwork. These are official papers concerning your employment contract, which you will have to sign. But hold off on signing the severance package, if it is offered to you. Take the time to look it over and run it by your lawyer. You may be able to negotiate a higher severance payment, especially if you have been with the company or organization for a long period of time."
    },
    {
      "title": "Discuss how your departure will be described to the rest of the company.",
      "content": "Discuss how your departure will be described to the rest of the company. This is especially important to talk about if you have been with the company in a high paying position for a long period of time, or if you are in a role where you work directly with clients or customers. If you have built a relationship with certain clients, you want to be sure the company explains your firing in a way that is honest, but does not burn your reputation. It is also important to clarify your departure so you know how your former employer will explain your firing to future employers who call them for a reference. If you don’t want your employer to be a reference for any future jobs you apply for, specify that you just want them to confirm your dates of employment at the company and nothing more."
    },
    {
      "title": "End the meeting with a handshake.",
      "content": "End the meeting with a handshake. This may be difficult to do, especially after the initial sting of being fired. But try to stay on good terms with your employer, even if you may be upset. You don’t want to burn any bridges for the future and end your professional relationship with your boss on a sour note."
    },
    {
      "title": "Pack up and exit the building.",
      "content": "Pack up and exit the building. Avoid roaming around the office and telling your co-workers you just got fired. This looks unprofessional and may cause friction between you and your former employer. Gather your belongings in a cardboard box, or only take the essentials with you. Then, head for the nearest exit. [4] X Research source Take the time to call up your closest co-workers that evening and say your goodbyes. Or make arrangements to meet up with them outside of the office. When gathering your items and leaving the office, do so calmly. Not in an angry or emotional way. In some cases, you may be asked or expected to leave the office immediately after you are informed of your termination, without an opportunity to gather your belongings. If this happens, your personal items will likely be collected by the human resources department and mailed to you or held for pickup at a later time. Make sure to regularly inventory and account for your personal items at the office, so you will always know exactly what belongings of yours are there."
    },
    {
      "title": "File for unemployment benefits.",
      "content": "File for unemployment benefits. In most states, you can qualify for unemployment benefits if you weren’t let go due to intentional misconduct. Look up your state’s policy on unemployment benefits to determine if you qualify."
    },
    {
      "title": "Don’t be afraid to tell people you were fired.",
      "content": "Don’t be afraid to tell people you were fired. It may be painful to admit at first. But saying “I was fired” out loud to yourself or to others can help you process the trauma of being fired. Unload the negative feelings you have towards getting fired by admitting it to yourself and to others in an open way. Be honest if a potential employer asks you how you left your old job. Explain the specific details around the reasons for your firing, but stress that you left the company on good terms. This will show the potential employer you are willing to be honest and upfront, but can still be professional. [5] X Expert Source Melody Godfred, JD Career Coach Expert Interview. 29 April 2020."
    },
    {
      "title": "Turn to your friends and family.",
      "content": "Turn to your friends and family. Focus on your relationships with your partner, your family members, and your close friends. Avoid dealing with your stress and anger alone. [6] X Research source Don't be afraid to open up to your friends and family about the trauma of being fired. Though you may be tempted to isolate yourself and try to tackle your feelings on your own, you may need to turn to your loved ones for support, and that's okay."
    },
    {
      "title": "Talk to a therapist or counselor.",
      "content": "Talk to a therapist or counselor. Talking about getting fired with your partner, your family or close friends can definitely help you deal with the trauma of being fired. But professional help from a therapist or counselor will help you work through any anger issues you may have as a result of being fired. [7] X Research source Though you may be tempted to focus on moving forward, it’s important to deal with any intense emotions you may have due to getting fired. That way, you can move forward in a healthy and stable way."
    },
    {
      "title": "Avoid thinking about \"what ifs\".",
      "content": "Avoid thinking about \"what ifs\". The \"what if\" thinking can be easy to fall into. \"What if I had just not been late for that one meeting?\" \"What if I had done more over time?\" But living in the past will not help you move forward. \"What ifs\" are impossible to answer and will stall your ability to re focus on the positive aspects of your life. [8] X Research source Rather than think of \"what ifs\", think about \"what now's\". As in, \"what can I now do with my open time?\" \"what can I now do to move forward and succeed?\""
    },
    {
      "title": "Focus your energy on activities you enjoy doing, or skills you want to get better at.",
      "content": "Focus your energy on activities you enjoy doing, or skills you want to get better at. Use this open time to decompress and de-stress by doing activities you never had the time or energy to do before. Try not to fall into a routine of inactivity or lethargy. [9] X Research source Read a book you’ve been meaning to get to or participate in a recreational volleyball game you always had to miss due to work. Declutter your home and donate anything you don’t need. Go for walks in the morning and give yourself time to enjoy your sudden free time. Get a gym membership or take free classes at your local YMCA. Burn up any stress by pouring your energy into sports or social activities with friends."
    },
    {
      "title": "Look over your finances.",
      "content": "Look over your finances. To be safe and proactive, assume you may not land another job in the next several months. Sit down and go over your monthly budget. Look at any money in a savings account, or in investments. Decide how you are going to maintain your standard of living without steady income for several months. You may want to get your financial planner involved in this process. Or seek out legal advice from your lawyer. If you are receiving severance pay from your former employer, factor this into your budget for the coming months. But try not to live primarily on your severance pay. You want to be careful not to depend too heavily on your savings or investments to keep you afloat as you search for a new job."
    },
    {
      "title": "Think about the next step in your career.",
      "content": "Think about the next step in your career. Did you enjoy your last job or position? Or do you feel like you might want to try a different career? Consider how happy you were in your former position and if you may be happier doing something else."
    },
    {
      "title": "Identify your transferable skills.",
      "content": "Identify your transferable skills. If you are thinking about a career change, it's important to make a list of the skills you gained in your previous position. [10] X Expert Source Melody Godfred, JD Career Coach Expert Interview. 29 April 2020. For example, if you worked in an admissions office, but now want to get into sales, you have valuable people skills and communication skills. These are your transferable skills. If you aren’t sure what your transferable skills are, you can do a self-assessment test. Look up career assessment tests online. You can also do a self-assessment on your own. Think about what would be the best next step in your career and what would make you happy. Consider why an employer would want to hire you and what skills you can offer an employer."
    },
    {
      "title": "Create an action plan.",
      "content": "Create an action plan. This may be updating your resume and your online profile. You may also focus on attending business get togethers to network. Let everyone you know that you are in the job market again and work every contact you have."
    },
    {
      "title": "Conduct your own job interview.",
      "content": "Conduct your own job interview. It can be a challenge to build up your confidence again after being fired. But conducting a job interview on yourself can help you get more comfortable with marketing your skills to potential employers. Ask yourself questions like: [11] X Research source What are my weaknesses? This is the most common interview question and one of the most difficult to answer. Focus on professional development, rather than personal issues or faults. Include a solution to your weakness in your answer. For example: “I am working on getting better at public speaking, and just joined Toastmasters to work on this weakness.” Why should someone hire me? Summarize your experiences into one sentence. For example: “With over five years’ experience working in the sales industry and my proven record of selling products, I could make a big difference in your company.” What are my goals? Focus on short term goals and goals you can achieve in the next year. For example: “My immediate goal is to get a position at a growth-oriented sales company. My long term goal is to eventually grow into a position of responsibility and leadership.”"
    },
    {
      "title": "Don't write off a temporary position.",
      "content": "Don't write off a temporary position. Though you may be hesitate to accept a temporary position, consider your finances. If money is critical, a temporary job may be necessary and it may lead to better things. Temporary opportunities sometimes open the door to permanent opportunities. [12] X Research source Rather than go towards what you know and have done before, embrace a new opportunity if it comes up. You don't know where the journey may lead unless you start down the path."
    },
    {
      "title": "Relish the work when you get it.",
      "content": "Relish the work when you get it. Once you land your next position, appreciate it and focus on working hard. Seize the opportunity to work, especially if it is in a career you are happy doing and find fulfilling. [13] X Research source"
    }
  ]
}