{
  "url": "https://www.wikihow.com/Eat-Sugar-Snap-Peas",
  "title": "How to Eat Sugar Snap Peas",
  "steps": [
    {
      "title": "Use a knife to cut off the tough stem at the end of the pea pod.",
      "content": "Use a knife to cut off the tough stem at the end of the pea pod. Not all sugar snap peas have stems at the end, but if yours do, make sure you cut the stem off before eating them. Place the sugar snap peas on a cutting board and use a knife to carefully cut off the tip of the pea pod that the stem is attached to. [1] X Research source"
    },
    {
      "title": "Eat the whole pod.",
      "content": "Eat the whole pod. Unlike with garden peas, the pods on sugar snap peas can be eaten. Don’t worry about removing the round peas inside. The pods on sugar snap peas are crunchy and sweet. [2] X Research source"
    },
    {
      "title": "Add raw sugar snap peas to salads.",
      "content": "Add raw sugar snap peas to salads. Raw sugar snap peas can add crunch to your salads and make them more nutritious. Cut the pods into smaller segments with a knife so they’re easier to mix in with your salad, or you can leave them whole."
    },
    {
      "title": "Pair raw sugar snap peas with dips.",
      "content": "Pair raw sugar snap peas with dips. Dip them into hummus, guacamole, and other kinds of dip. Sugar snap peas are a healthier alternative to foods like chips and bread that are usually paired with dips."
    },
    {
      "title": "Heat 1 tablespoon (14.8 mL) of olive oil in a pan over medium-high heat.",
      "content": "Heat 1 tablespoon (14.8 mL) of olive oil in a pan over medium-high heat. Any kind of olive oil will work. Make sure you use a pan that’s large enough to hold all the sugar snap peas you’ll be sautéing. [3] X Research source If you’d prefer to cook the sugar snap peas in a different way, jump to our sections on blanching or roasting snap peas ."
    },
    {
      "title": "Add the sugar snap peas to the pan.",
      "content": "Add the sugar snap peas to the pan. Use a large spoon to carefully scoop the sugar snap peas into the pan so hot oil doesn’t splash up on you. Stir the sugar snap peas with the spoon to coat them in olive oil. [4] X Research source"
    },
    {
      "title": "Sprinkle 1 ½ teaspoons (7.4 mL) of salt and ¾ teaspoon of pepper (3.7 mL) over the peas.",
      "content": "Sprinkle 1 ½ teaspoons (7.4 mL) of salt and ¾ teaspoon of pepper (3.7 mL) over the peas. Use the spoon to stir in the salt and pepper so the sugar snap peas are evenly coated. [5] X Research source"
    },
    {
      "title": "Toss the sugar snap peas in the pan for 3-5 minutes.",
      "content": "Toss the sugar snap peas in the pan for 3-5 minutes. Use the spoon to turn them over in the pan and stir them so they’re evenly cooked. You’ll know the sugar snap peas are finished sautéing when they’re tender and crispy. [6] X Research source"
    },
    {
      "title": "Turn off the stove top and serve the sugar snap peas.",
      "content": "Turn off the stove top and serve the sugar snap peas. Pour them from the pan into a large bowl and sprinkle sea salt over them for some extra flavor. Put a serving spoon in the bowl and you’re finished! [7] X Research source"
    },
    {
      "title": "Fill a pot with 6 cups of water and bring it to a boil.",
      "content": "Fill a pot with 6 cups of water and bring it to a boil. Place the pot of water on a burner and turn the burner to the highest setting. Use a pot that’s large enough to hold all the sugar snap peas you want to blanch. [8] X Research source"
    },
    {
      "title": "Fill a large bowl with ice and water.",
      "content": "Fill a large bowl with ice and water. Use about 1-2 ice cube trays worth of ice. After you put the ice in the bowl, fill it up almost to the brim with water. Set the bowl of ice water aside. [9] X Research source Do this step while you’re waiting for the pot of water to boil to save yourself time."
    },
    {
      "title": "Add the snap peas and 1 teaspoon (4.9 mL) of salt to the boiling water.",
      "content": "Add the snap peas and 1 teaspoon (4.9 mL) of salt to the boiling water. Boiling the sugar snap peas will make them less tough, and it will help preserve their color and flavor. Leave the pot uncovered as you boil the sugar snap peas. [10] X Research source"
    },
    {
      "title": "Let the sugar snap peas boil for 5 minutes.",
      "content": "Let the sugar snap peas boil for 5 minutes. Don’t remove them from the boiling water early or they won’t blanch properly. After 5 minutes, the sugar snap peas should be crisp and tender."
    },
    {
      "title": "Scoop the peas out of the boiling water and put them in the bowl of ice water.",
      "content": "Scoop the peas out of the boiling water and put them in the bowl of ice water. Use a slotted spoon to scoop out the sugar snap peas so the boiling water drains out of it. Once all the sugar snap peas are in the bowl of ice water, turn off the stove top. [11] X Research source"
    },
    {
      "title": "Drain the bowl of ice water immediately.",
      "content": "Drain the bowl of ice water immediately. Take the sugar snap peas out of the bowl and place them on a dry paper towel. Grab a second paper towel and pat the sugar snap peas until they're dry. [12] X Research source"
    },
    {
      "title": "Use the blanched sugar snap peas in a recipe or store them for later.",
      "content": "Use the blanched sugar snap peas in a recipe or store them for later. Add the sugar snap peas to a salad or stir-fry. They’ll be more tender now that they’re blanched. If you don’t want to use them now, put them in a sealed plastic bag and place them in the refrigerator or freezer. Store the sugar snap peas in the fridge for up to 5 days. [13] X Research source Blanched sugar snap peas can stay good in the freezer for up to a year. [14] X Research source"
    },
    {
      "title": "Turn on the oven and prepare a baking sheet.",
      "content": "Turn on the oven and prepare a baking sheet. Preheat the oven to 450°F (232°C). While the oven's preheating, spread out the sugar snap peas in an even layer on a baking sheet. Make sure none of the sugar snap peas are overlapping or on top of each other. If you can’t fit all the sugar snap peas on one baking sheet, use a second baking sheet. [15] X Research source"
    },
    {
      "title": "Brush olive oil over the sugar snap peas with a basting brush.",
      "content": "Brush olive oil over the sugar snap peas with a basting brush. Dip the basting brush in a bowl of olive oil so it’s fully saturated. Brush over the surface of the sugar snap peas until they’re all coated with oil. [16] X Research source"
    },
    {
      "title": "Season the sugar snap peas to add extra flavor.",
      "content": "Season the sugar snap peas to add extra flavor. Sprinkle salt and pepper over the sugar snap peas. You can also add other seasonings like thyme and garlic powder. Try to evenly coat the sugar snap peas with the seasonings as you're sprinkling them on. [17] X Research source"
    },
    {
      "title": "Put the sugar snap peas in the oven for 10 minutes.",
      "content": "Put the sugar snap peas in the oven for 10 minutes. After 10 minutes, open the oven door and look at the sugar snap peas. If they’re slightly brown on the edges, they’re finished. If not, leave them in for a few more minutes."
    },
    {
      "title": "Take the sugar snap peas out of the oven and serve.",
      "content": "Take the sugar snap peas out of the oven and serve. Use a spatula to remove the sugar snap peas from the baking sheet and transfer them to a plate. Serve the roasted sugar snap peas as a side or add them to a roasted vegetable medley."
    }
  ]
}