{
  "url": "https://www.wikihow.com/English-or-Spanish-Meme",
  "title": "What Is the \"English or Spanish\" Meme?",
  "steps": [
    {
      "title": "The English or Spanish meme is a trending meme format where men freeze in place to avoid being called gay.",
      "content": "The English or Spanish meme is a trending meme format where men freeze in place to avoid being called gay. Confused? You're not alone. Basically, this all started when TikTok user @alfonsopinpon_ posted a compilation video in which he approached various men in a mall and asked them if they spoke English or Spanish, then followed that up with \"Whoever moves first is gay.\" The men in the video would then often freeze in place so they wouldn't be called gay. Yes, that is actually how this whole thing started. So how did this become a meme? Once the original videos gained traction, people copied the format (asking \"English or Spanish\" followed by saying \"Whoever moves first is gay\") and started making their own supposedly funny versions with friends. These videos often depict straight men freezing in awkward or uncomfortable positions for long periods of time so they're not perceived as being gay."
    },
    {
      "title": "The meme implies that being gay is a bad thing.",
      "content": "The meme implies that being gay is a bad thing. The whole point of the original videos and the memes that followed is that men will go to great lengths—like freezing awkwardly in place no matter what they're doing—to avoid being thought of as gay, because to them, being gay is bad, shameful, and embarrassing. Sure, some people are just joking and don't take it that seriously, but that doesn't mean the meme isn't harmful. It still promotes homophobia and suggests that gay men are less than. [1] X Research source Unfortunately, the English or Spanish meme is just more evidence that homophobia is still alive today and that more work needs to be done when it comes to the acceptance of the LGBTQ+ community."
    },
    {
      "title": "People think the meme is funny because of how far men will go to prove they're not gay.",
      "content": "People think the meme is funny because of how far men will go to prove they're not gay. They find the men freezing in place to avoid being associated with queerness funny and relatable. Again, the crux of the joke is that being gay is bad or embarrassing, which is homophobic, even if it's just meant to be funny. [2] X Research source"
    },
    {
      "title": "“Static” by Steve Lacy is often used in compilations of the meme.",
      "content": "“Static” by Steve Lacy is often used in compilations of the meme. On May 25, 2024, TikTok user @azavtu posted a video where they compiled videos of people freezing after being told “Whoever moves first is gay” with “Static” by Steve Lacy playing in the background. This went viral and sparked a trend where users post videos of themselves asking people “English or Spanish” while the song was playing. [3] X Research source On June 28, 2024, TikTok user @evanjarold posted a video using the song. While on a roller coaster, they asked a friend “English or Spanish” as the ride dropped."
    },
    {
      "title": "The English or Spanish meme is problematic despite its popularity.",
      "content": "The English or Spanish meme is problematic despite its popularity. It may seem like an unserious, silly joke that isn't meant to hurt anyone's feelings, and of course not everyone participating in the meme has bad intentions. But that doesn't change the fact that the meme implies there's something wrong with being gay, which isn't cool! Nobody should be made to feel less than or like they should be ashamed of who they are, and even silly internet memes can promote harmful beliefs like homophobia. There are definitely better, funnier memes out there that don't rely on putting people down."
    }
  ]
}