{
  "url": "https://www.wikihow.com/Cover-a-Book",
  "title": "How to Cover a Book",
  "steps": [
    {
      "title": "Choose paper to cover your book with.",
      "content": "Choose paper to cover your book with. For books without covers or to protect your textbooks, make a paper cover for your book. You can cover your books with foreign or old newspapers, old or new maps, sheet music, old wall paper, a brown paper bag, etc.. Unless you are covering a smaller book, you will need a large piece of paper to make your cover. It will need to be at least double the length of your book and three inches taller than the height of your book."
    },
    {
      "title": "Cut the paper to size using the measurements for your book.",
      "content": "Cut the paper to size using the measurements for your book. To find the width of the book, lay the book open and measure the width with a measuring tape or ruler. Then add 6 inches, 3 inches to cover both sides of the book. Next measure the height of the book and add 3 inches, 1 ½ inches to cover the top and bottom of the book. Using a ruler, mark a faint line with a pencil on your paper the dimensions of your cover, and then with a sharp pair of scissors, cut your paper to size. Avoid laying the book out so that a previous crease that was in a bag or on your paper aligns with a cover edge. If your paper is already worn, it will tear more easily when it is on an edge of the book."
    },
    {
      "title": "Fold the paper 1/4 inch above the top and bottom of the book.",
      "content": "Fold the paper 1/4 inch above the top and bottom of the book. Close your book and center it on the paper. Faintly mark the edges of the top and bottom of the book then add an extra ¼ inch so that the book will fit inside of the cover. Take the book off the paper, and fold the paper up to the spot marked and make your fold into a crease. Repeat the process with the top of the book; fold the paper down and create your crease about a 1/4 inch above the top of the book. Go back over the creases you have made in the paper with a pen or bone folder. You want your creases to be crisp and clean, especially if you are using heavy paper."
    },
    {
      "title": "Tape down the top and bottom folds.",
      "content": "Tape down the top and bottom folds. Use double-sided tape to tape down the folds you have just made so that they do not flap. The double sided tape will help the cover stays snug on the book once it is covered. Place the tape toward the center of your cover, leaving about three inches at both sides for your book to fit in the cover."
    },
    {
      "title": "Create the folds for the sides of the book.",
      "content": "Create the folds for the sides of the book. Lay your book open flat on the paper and center the book so that both sides have the same amount of paper for the flaps. Press your book down so it does not move, and fold the paper over the right side of the book and create a crease. Go back over the crease, more lightly than before, with the side of your pen or your bone folder. To accommodate for the thickness of the cover, do not make the creases too heavy. With the flap in the right side of the book, close the book and wrap the paper around the book and mark where you want to fold the paper to make the last flap. Take the book of the paper, and crease the flap for the left side of the book. Go over the crease with your bone folder or pen again, but remember to keep the crease lighter."
    },
    {
      "title": "Fit your book inside of the cover.",
      "content": "Fit your book inside of the cover. Gently place the back of the book into the fold on the back of your paper cover. Then wrap the paper cover around the book and tuck the top cover of the book carefully into the front of the paper cover."
    },
    {
      "title": "Add a name tag to your cover.",
      "content": "Add a name tag to your cover. You can buy fun or fancy name tags or labels from crafts and office supply stores. Write your class or your name on the label using a fun script or font. Practice writing the word on a scrap of paper in different scripts or fonts until you find a script you like, and then with a marker or pen, inscribe the title onto the name tag. Use a ruler and carefully center the tag on the front upper center of your paper cover and then adhere it."
    },
    {
      "title": "Use paper tape to create fun horizontal stripes on your book cover.",
      "content": "Use paper tape to create fun horizontal stripes on your book cover. You can buy different colored paper tapes from a crafts store that go well with your cover. Take the cover off of the book to make the stripes, or make the stripes before you make the cover. Mark a place for each stripe at the top of the book every 1-2 inches. Use a ruler to mark off the stripes at regular intervals to make sure they are evenly spaced. To keep your lines straight, draw faint lines down the cover with your ruler and cover them with strips of paper tape."
    },
    {
      "title": "Buy fun stickers to create a theme or add flair.",
      "content": "Buy fun stickers to create a theme or add flair. For example, if you have a blue paper cover with white stripes, you can adhere an anchor sticker to the bottom corner of your cover to create a sailing themed book cover. You can buy any kind of sticker(s) to go along with the color or pattern of your book cover."
    },
    {
      "title": "Place a plastic pocket on the front of your book cover.",
      "content": "Place a plastic pocket on the front of your book cover. You can put your school schedule into a document holder you adhere to your book cover or you can decorate a card to place into a holder to give your cover more fun style. In office supply stores, you can find self-adhering business card holders, self-adhering document holders, and insertable label holders for shipping. Simply adhere one of these pockets onto the front or back of your book cover."
    },
    {
      "title": "Create a pocket in your cover with paper.",
      "content": "Create a pocket in your cover with paper. You will follow the method “Making a Paper Cover” to make your paper cover, but you will use two pieces of paper instead of one. The second paper creates a pocket you can use to put papers in. You can overlap two different colored pieces of large construction paper to create a pocket on your book cover. Or you can use one solid color and one pattern or music sheet, etc.. This pocket will look cool but is also a practical addition to your cover. You will be able to quickly stash documents in the front of your book cover with a pocket. To create the paper sheet you will cover your book with, lay the papers on top of each other so that the piece below sticks out 2 inches from the bottom edge of the top paper. Use double sided tape to adhere the two pieces of paper together at the edges of the paper."
    },
    {
      "title": "Create a rubber band notebook holder on a textbook book cover.",
      "content": "Create a rubber band notebook holder on a textbook book cover. If you keep a pocket notebook, make a rubber band holder to keep your pocket notebook. It will help prevent you from losing the small notebook in your bag. Simply take two large rubber bands and place them around the length of the front cover so that they are spaced a bit wider apart than the notebook. To secure your notebook in the cover, put your notebook under the rubber band closer to the book opening, and set it on top of the rubber band nearer to the book spine."
    },
    {
      "title": "Choose one or two fabrics to make your notebook cover with.",
      "content": "Choose one or two fabrics to make your notebook cover with. If you have a sewing machine, making fabric covers is a simple way to cover your notebooks. Pick one fabric for the cover and the another fabric for the flaps on the inside of the cover. You can choose a combination of a print and a solid color fabric, two print fabrics, or two different colored solid fabrics. You should prewash your fabric to prevent it from shrinking. Iron the fabric before you use it as well. You will need less fabric for the inside of the cover and more for the outside."
    },
    {
      "title": "Find the dimensions for the cover.",
      "content": "Find the dimensions for the cover. Use a ruler or measuring tape to get the height and the width of your book for the big cover. To find the height, measure the height of the notebook and add an inch. To get the width, multiply the width of the front cover by two, then add the width of book's spine, and then add another inch. For example, your height and width may be 8 (height)x 12 ½ (width of book spread open) inches, and then you would add another inch to have 9 x 13 ½ inches. For the dimensions of the inside flaps, use the same cover dimension for the height, for my example it is 9 inches. To find the width, divide the width by 3. In my example, 13 ½ divided by 3 is 4.5 inches. My fabric will measure 9 x 4.5 inches."
    },
    {
      "title": "Cut the fabrics to the dimensions you took.",
      "content": "Cut the fabrics to the dimensions you took. Using a pair of sharp scissors and a ruler, make a faint straight line on your fabric and cut out your fabric to size. You should cut out 2 larger pieces of fabric for the outside and inside and 2 smaller pieces of fabric for the inside flaps."
    },
    {
      "title": "Use an iron to make a double fold.",
      "content": "Use an iron to make a double fold. Make a ¼ inch flap along one of the long sides of the inner fabric, and iron it down so that it is creased. Double the fabric, turning over the folded crease once more so that it has a second ¼ inch fold over the first fold. Create a crease on this double fold and then iron it down. Do this on both pieces of the flap fabric."
    },
    {
      "title": "Sew the double fold shut.",
      "content": "Sew the double fold shut. On the inner side of the double fold, use your sewing machine and sew the flap down so that it is closed. At the top and bottom of your fabric back up your sewing machine and go back over the stitches to ensure the stitching does not come undone at the ends. Repeat the process with both pieces of fabric."
    },
    {
      "title": "Layer your fabrics, and pin them into place.",
      "content": "Layer your fabrics, and pin them into place. Lay out a piece of the bigger fabric with the print or color side facing up. Then place the smaller fabric flaps on top of the bigger fabric so that they are covering the right and left sides of the bigger fabric. The sewn sides of the flap fabrics should be facing in toward the center of the big fabric. Then place the last piece of big fabric on top of the three pieces of fabric with the print or color side facing down. Pin the 4 fabric sheets together. To keep the fabric in place while you sew, pin about four pins on the bottom and top of the fabric and the three pins on the sides of the fabric."
    },
    {
      "title": "Sew around the edges of your cover using a ⅜ inch inseam.",
      "content": "Sew around the edges of your cover using a ⅜ inch inseam. Leave a gap of an ¾ inch in the middle of the bottom or top of the cover so that you can turn the cover inside out once you have finished sewing."
    },
    {
      "title": "Use your scissors to round the corners of the fabric, and then turn the cover inside out.",
      "content": "Use your scissors to round the corners of the fabric, and then turn the cover inside out. To round the corners, trim the sharp edges of the 4 corner edges off. Then flip the cover inside out. Make sure to get all of the corners all the way turned out."
    },
    {
      "title": "Iron the cover, and then sew a perimeter around the sides of the cover.",
      "content": "Iron the cover, and then sew a perimeter around the sides of the cover. Iron the cover to flatten it, and then use your sewing machine to go back over the 4 sides of the cover. You can use a 3/8 inch inseam. This perimeter will close the ¾ inch gap you left, and give the cover a clean and finished style."
    }
  ]
}