{
  "url": "https://www.wikihow.com/Create-a-Playlist-on-Spotify",
  "title": "How to Create a Playlist on Spotify",
  "steps": [
    {
      "title": "Open Spotify.",
      "content": "Open Spotify. This app icon looks like a green circle with black sound waves inside it that you'll find on one of your Home screens, in the app drawer, or by searching. Log in if you're not already logged in."
    },
    {
      "title": "Tap Your Library.",
      "content": "Tap Your Library . You'll find this in the tabs along the bottom of your screen with the icon of two vertical lines and one diagonal line."
    },
    {
      "title": "Tap Playlists.",
      "content": "Tap Playlists . It's a tab at the top of your screen under \"Music\" and should be opened automatically."
    },
    {
      "title": "Tap Create playlist.",
      "content": "Tap Create playlist . You'll see it next to a tile with a plus sign inside at the top of the \"Playlists\" menu."
    },
    {
      "title": "Enter a name for your playlist and tap Create.",
      "content": "Enter a name for your playlist and tap Create . You'll be redirected to the playlist page and can tap Add Songs to add music to the playlist."
    },
    {
      "title": "Add songs to your playlist.",
      "content": "Add songs to your playlist. Tap the music note and plus sign to the right of songs under \"Recommended Songs\" to add them to the playlist. You can tap Add Songs from the playlist's page to add music. To edit this playlist, tap it from the \"Playlist\" menu and tap ⋮ (Android) or ••• (iOS) and Edit Playlist . For more information on editing playlists on Spotify, see How to Edit a Spotify Playlist on iPhone or iPad and How to Edit a Spotify Playlist on Android. [1] X Research source"
    },
    {
      "title": "Open Spotify.",
      "content": "Open Spotify. You'll find this application in your Application folder in Finder or in your Start menu."
    },
    {
      "title": "Click New Playlist.",
      "content": "Click New Playlist . You'll see this at the bottom of the panel on the left side of the client window next to a plus sign."
    },
    {
      "title": "Enter a name and description for your playlist and click Create.",
      "content": "Enter a name and description for your playlist and click Create . Typing a description is optional. You can also add a playlist cover by clicking on the image panel."
    },
    {
      "title": "Add songs to your playlist.",
      "content": "Add songs to your playlist. Click Add next to songs listed under \"Recommended Songs\" to add them to your playlist or search for music and click the three-dot menu next to the song's title to add it to your playlist. To edit or delete the playlist, right-click it and select Edit or Delete from the menu. For more information on editing playlists, see How to Edit a Spotify Playlist on PC or Mac . [2] X Research source"
    },
    {
      "title": "Go to https://open.spotify.com and login if you aren't already.",
      "content": "Go to https://open.spotify.com and login if you aren't already. You can use any web browser to use the Spotify web player and create playlists."
    },
    {
      "title": "Click Create Playlist.",
      "content": "Click Create Playlist . You'll find this option in the panel on the left side of your screen with a plus sign."
    },
    {
      "title": "Enter a name for the playlist and click Create.",
      "content": "Enter a name for the playlist and click Create . You'll be redirected to the playlist page and can click New Releases to find and add music to the playlist."
    },
    {
      "title": "Add songs.",
      "content": "Add songs. Click Add under \"Recommended\" to add them to your playlist or search for music and click the three-dot menu next to the song's title to add it to your playlist."
    }
  ]
}