{
  "url": "https://www.wikihow.com/Embroider-by-Hand",
  "title": "How to Embroider by Hand",
  "steps": [
    {
      "title": "Select a cloth.",
      "content": "Select a cloth. You’ll need to carefully consider what fabric you want to embroider. This can be a complex decision. For beginners, it’s a good idea to start with a basic, white or light colored cotton or canvas fabric. As you learn and experiment with different materials, you’ll have to keep some other things in mind as well: Choose a fabric that complements the item that the embroidery will be on. Choose a firm fabric with a good thread count (28 or higher), especially if the design will involve heavy items like ribbon or buttons."
    },
    {
      "title": "Select the embroidery floss.",
      "content": "Select the embroidery floss. First things first, for serious projects make sure you’re getting embroidery floss and not “craft thread” or similar looking products. These are ill suited to embroidery because the thread is much lower quality and the color can bleed. However, for small test projects and learning exercises, it can be perfectly useful and more economical. You’ll also want to adjust the weight (thread count) of the floss to the level of detail you’re trying to create. The more detailed the project, the thinner the floss should be. The more bold the design, the thicker the floss should be. Don’t worry too much about the type of embroidery floss you buy. There are many types but generally of the thinner threads, the only impact is on the final look (whether it comes out shiny or more matte in finish). Beginners shouldn’t worry about this. Be careful not to buy embroidery thread, since this is designed to be used with a machine. Embroidery floss comes in a variety of colors and sheens. Some even sparkle."
    },
    {
      "title": "Select a needle.",
      "content": "Select a needle. For your first, basic projects you’ll want to get a basic embroidery needle. A size 12-18 needle is a good starting point for canvas embroidery. Some needles have sharp points while others have blunt points but for beginners, a sharp point will get you through most starting projects. Use embroidery needles rather than sewing needles due to the longer eye on the needle (These are able to hold multiple threads or a full skein)."
    },
    {
      "title": "Get your tools and supplies.",
      "content": "Get your tools and supplies. You’ll need an embroidery hoop of a reasonable size for your design. You’ll also need a method of transferring your design onto the fabric (discussed in the following section). There are also other helpful extras like thimbles and needle threaders that can make your life much easier (and less painful!)."
    },
    {
      "title": "Choose a design that you want to embroider.",
      "content": "Choose a design that you want to embroider. When you’re first starting, it’s a good idea to stick to something as basic as possible. Go for clean lines, not too much area to be filled, and larger shapes. It takes awhile to develop the dexterity to do detailed, fine work, so go with these basic designs for now. Good beginner shapes include: flowers, stars, and simple line art. You can find designs online or you can draw or trace one of your own."
    },
    {
      "title": "Apply your design.",
      "content": "Apply your design. You’ll have to decide on a method for applying the design you found or made onto your fabric. For beginners working with simple fabrics, tracing is probably the easiest. You can also get iron on transfers, but beware that these are permanent and cannot be removed if you make a mistake. If you’re brave, you can draw the design freehand. You can also try things like water-soluble fabric, which allows you to trace or print the design onto the temporary fabric and embroider directly onto it with the backing fabric underneath. Stencils are also a good option when you’re first learning how to embroider, especially since those designs tend to be simple. Try using a light box or light from a window to trace designs from paper to fabric."
    },
    {
      "title": "Figure out where things go.",
      "content": "Figure out where things go. Before you can continue, you need to know what goes where in your design. What areas will be filled? What color will they be? What sections are in the background vs foreground? This is crucial in making sure that your project goes smoothly. Not planning ahead is like getting in car without a map and just expecting to end up in New York City."
    },
    {
      "title": "Assemble your hoop.",
      "content": "Assemble your hoop. Embroidery hoops—which you should not skip on—are formed by two wooden circles with a clasp that holds them together. The inner circle goes on the backside of your fabric and the outer circle goes on the front side that you will be embroidering. Fit them together and then tighten the screw holding the frames together. You’ll want to be extra sure that the fabric is taut. This is the point of the hoop after all! The fabric should feel tight like the top of a drum."
    },
    {
      "title": "Cut the floss.",
      "content": "Cut the floss. Cut a length of floss to embroider with. The floss’s length will depend on how much area you want to embroider, what kind of stitches you’re doing, and how thick the floss and fabric are. Generally, you do not want the doubled up thread to be longer than your arm, since this will be a pain to have to pull, but you can do it if the project calls for that much continuous thread."
    },
    {
      "title": "Thread the floss onto the needle.",
      "content": "Thread the floss onto the needle. Thread the floss onto the embroidery needle, just like how you’d thread a normal sewing needle. This is why using an embroidery needle is important though: the eye is much longer to accommodate the extra threads. However, unlike sewing, you won’t double up the entire length of the thread. Instead, you will only double up part of it, leaving a long tail to embroider with and a short tail of about 3” that will be extra."
    },
    {
      "title": "Move from background to foreground.",
      "content": "Move from background to foreground. Before you put the thread to fabric, it’s important to understand where the threads are going to go. In embroidery, you generally want to start with background items and move forward, as parts of the design get closer to you. This is so that you can overlap your stitches between colors and sections to create depth."
    },
    {
      "title": "Knot the floss.",
      "content": "Knot the floss. Before you start stitching, you’ll need to create some kind of stopper to keep the floss from coming right back out of the fabric. When you’re first starting, making a knot at the end of the long tail is probably easiest. As you get more skilled, you’ll want to switch to using a waste knot, since this will keep extra bulk to a minimum."
    },
    {
      "title": "Start your stitches in the right spot.",
      "content": "Start your stitches in the right spot. When you do finally start your stitches, it’s a good idea to start at a joint or corner. This will create a more natural, flowing look. Look for spots where one object touches another. If your design is very basic, like a circle, you just have to pick a spot and start. Learn to undo stitched mistakes. Everyone makes mistakes when stitching, even the pros. It is as useful to learn how to undo mistakes as it is to learn the stitching. For help on undoing unwanted embroidery stitches, see: How to Remove Embroidery ."
    },
    {
      "title": "Do test stitches when you can.",
      "content": "Do test stitches when you can. When you work on projects, you of course want to dive right in and get to the fun! But it’s a good idea to do a test section with the combination of fabric, needle, and floss that you will be using. This allows you to make sure that the final product looks good and you have the size of all of the various parts adjusted correctly. Satin stitches make good test stitches."
    },
    {
      "title": "Learn how to make really even stitches.",
      "content": "Learn how to make really even stitches. When you've got down the basics, you want to work towards making your more even, clean, and aligned. Very even stitching is generally considered the mark of a good embroiderer. This is a skill that comes through practice and you will get it with time. Just be sure to pay attention and aim to have even stitches."
    },
    {
      "title": "Work on making your stitches smaller.",
      "content": "Work on making your stitches smaller. Not much modern embroidery calls for small stitches, but older styles sometimes require fine, detailed stitches. You’ll need to work on your dexterity, aim, and eye in order to do the really fine embroidery that the seasoned pros do. Like even stitches, this is a skill that comes from practice, so make an effort."
    },
    {
      "title": "Work your way up and keep practicing.",
      "content": "Work your way up and keep practicing. As with any craft, it’s very important to start slow and really work your way up to more complex pieces. If you try to take on too much right at the beginning, it’s easy to get frustrated or feel like you can’t learn how to do it...which isn’t true. You can do this! Just keep trying!"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}