{
  "url": "https://www.wikihow.com/Dnd-Character-Ideas",
  "title": "15+ Creative Dungeons & Dragons Character Concepts for Players",
  "steps": [
    {
      "title": "Become the ultimate spy or scam artist as a changeling.",
      "content": "Become the ultimate spy or scam artist as a changeling. In D&D 5e, Changelings have a natural shapeshifting ability that lets them change appearances at will, giving them endless opportunities for self-expression—or the perfect disguise. Play a changeling with a sketchy past, whether they spied for a faction (like the Harpers, for example) or they’ve been scamming and running heists to get by. [1] X Research source Suggested classes: Rogue or bard Changelings can make for great rogue characters, using their abilities to sneak around with strangers’ faces. Otherwise, try playing a bard who uses shapeshifting to get into character the way no other actor can!"
    },
    {
      "title": "Turn your next character into a swordsman with a complex past.",
      "content": "Turn your next character into a swordsman with a complex past. Perhaps they came from a long line of soldiers that served the royal family, or they were a peasant with dreams of proving their worth. Make a PC (player character) who worked their way through the ranks of the guard and swore an oath to protect the crown—until they suddenly left, and now roam the realm as a warrior without a cause to fight for. Suggested classes: Fighter, paladin, or ranger For example, make a fighter character who found out about the king’s corruption or saw other guards mistreat the townsfolk and decided to rebel! Try a disgraced paladin who failed to protect a member of the royal family or disobeyed orders for noble reasons but was still cast out. Alternatively, make a former solder-turned-ranger who found solace in nature and now spends more time roaming the kingdom’s forests anonymously helping travelers."
    },
    {
      "title": "Play a not-so-virtuous paladin trying to regain their honor.",
      "content": "Play a not-so-virtuous paladin trying to regain their honor. It’s easy to picture the stereotypical, lawful goody-two-shoes when you think of paladins. However, there are ways to take a different path! Why not make a PC who couldn’t keep their oath or did something that went against their code? Start the campaign with your PC in disgrace, giving them a chance to prove themselves again—or find another source of power. Suggested classes: Paladin or cleric Paladins are usually super self-disciplined because they swear oaths to their gods and get powers in return—so a paladin who violated their oath is really interesting to role-play! Alternatively, try playing a cleric who did something that goes against their god’s teachings and needs to redeem themselves in the eyes of their god and temple."
    },
    {
      "title": "Make your character a powerful entity who flew too close to the sun.",
      "content": "Make your character a powerful entity who flew too close to the sun. Warlocks are spellcasters who made a deal with a powerful being—so what if, instead of making a deal, your PC was the powerful being? [2] X Research source They lived for ages, gaining power, making deals with mortals, and becoming a warlock patron themselves, only to wind up being stripped of their power—and essentially being turned into a level 1 mortal! Suggested classes: Warlock, sorcerer, or druid Try a warlock PC who’s their own patron. The remnants of their old power still fuels their spells—but there’s a host of powerless ex-warlocks who want to know what changed. As a druid, try playing a former archfey who was overthrown, kicked out of their domain in the Feywild, and now roams the world as an eladrin. Otherwise, try playing as a sorcerer—but the dregs of their former power are what make up their “bloodline.” For example, make a former dragon-turned-draconic bloodline sorcerer."
    },
    {
      "title": "Play a sweet-natured swashbuckler instead of a hardened criminal.",
      "content": "Play a sweet-natured swashbuckler instead of a hardened criminal. Pirates are often seen as the terror of the seas, hardened criminals who live on the outskirts of society and kill any who cross them. Why not play a pirate who’s a little more fun and whimsical? Maybe they couldn’t find work and just needed a job to provide for their family—or they were raised on the ship and considered its crew their only family. Suggested classes: Rogue, bard, or monk Rogues make fantastic pirates, especially the swashbuckler subclass. Alternatively, try a monk with the Drunken Master subclass. If your PC is a bard, perhaps they only became a pirate because they wanted to travel and sing shanties about their great adventures. If pirates aren’t your thing, there are lots of ways to take a traditionally edgy idea and make it fun. Why not make an oddly chipper necromancer wizard or a friendly and well-adjusted assassin?"
    },
    {
      "title": "Create a character chosen by their god—willingly or unwillingly.",
      "content": "Create a character chosen by their god—willingly or unwillingly. The “chosen one” trope is a classic, but there are still ways to have fun with it! Perhaps your PC is a devoted cleric or paladin in service to a god who gives them special treatment—or perhaps they were completely unaffiliated with the gods until the day one god, in particular, decided to hand them a prophecy and a dangerous mission. Suggested classes: Cleric, sorcerer, paladin, or barbarian Clerics and paladins are often associated with divine magic and gods, but other classes could also work. For example, play a Divine Soul sorcerer who received their divine powers at birth. Maybe they’re excited about being a divine soul—or maybe they absolutely do not like the god who gave them powers and want to get rid of them. Alternatively, try a Path of the Zealot barbarian as your chosen one; they’re warriors who channel all their rage into divine abilities."
    },
    {
      "title": "Craft a prophecy about a great hero…who is definitely not your PC.",
      "content": "Craft a prophecy about a great hero…who is definitely not your PC. There’s a prophecy in your PC’s village that tells of a great hero who will save them all from evil—but your PC is just the chosen one’s childhood friend, rival, or next-door neighbor. However, before the prophecy could be fulfilled, the chosen one ran away, and now it’s your PC’s job to bring them back so they can save the world. Suggested classes: Any This backstory is totally open-ended in terms of PC class—make your PC a wizard’s apprentice, a fighter-in-training, a street urchin rogue, or acolyte training to be a cleric, for example. As your “anti-chosen one” PC adventures, they might also learn that they don’t need a prophecy to be a great hero on their own!"
    },
    {
      "title": "Change up the typical warlock-patron dynamic by making them family.",
      "content": "Change up the typical warlock-patron dynamic by making them family. Tieflings are a race whose bloodline originates with devils, while warlocks are spellcasters who make contracts with powerful patrons. Both are popular options for D&D players who want to play “edgy” characters, but why not defy the stereotypes by playing a tiefling warlock with a more wholesome origin? [3] X Research source Your PC’s patron is none other than their mom, dad, grandma, or favorite uncle. Suggested classes: Warlock Instead of promising an Elder God 100 souls in exchange for yours, maybe your PC’s contract says they have to have dinner with their patron once a week in exchange for cool magic powers. After all, they never call to check in anymore!"
    },
    {
      "title": "Play a PC so talented (yet arrogant) that they were sent on a quest.",
      "content": "Play a PC so talented (yet arrogant) that they were sent on a quest. Make a prodigy PC who always had a promising career ahead of them. Then, one day, their superiors or teachers send them on a quest to prove their worth, and your PC jumps at the opportunity. Little did they know, there’s no epic quest—everyone else was just tired of dealing with the PC’s big head! How far they go without realizing is anyone’s guess. Suggested classes: Any Get as creative as you like with the class for this backstory! Maybe your PC was the brightest wizard at their academy, the strongest barbarian in their tribe, or the greatest cleric their temple had ever seen."
    },
    {
      "title": "Create a PC that used to serve someone but got a chance at power.",
      "content": "Create a PC that used to serve someone but got a chance at power. The all-powerful, evil wizard is one of the oldest fantasy tropes—as is the loyal sidekick always by their side. Why not play as the sidekick and let them have a chance at power? Have your PC learn not through traditional study but from observing their former boss over the years, paying attention to all their work—so that now, they know enough to strike out on their own. Suggested classes: Wizard or sorcerer As a servant-turned-wizard, your PC learned by stealing glances at their boss’s spellbooks for years. Alternatively, as a sorcerer, your PC spent years serving their arrogant wizard boss, only to realize they have their own innate magical power! Don’t want to be a spellcaster? Turn your PC into an experiment gone wrong, like a Warforged created by a mad Artificer—and play any class you like."
    },
    {
      "title": "Shake things up by playing an older character who already retired.",
      "content": "Shake things up by playing an older character who already retired. Who says your PC has to be young and bright-eyed? Back in the day, they were a famed adventurer who traveled the realm and saved towns and had many songs written about them—but their world-saving days ended. However, evil never stops. One day, some event pushes them to leave retirement and don their armor for one last adventure. Suggested classes: Any Perhaps your character is an old wizard who just wants to drink tea and read books, but the dragon circling the nearby town is really putting a damper on retirement. Maybe your PC is an ex-ranger who just wants to care for their farm animals and grow crops until a group of bandits burns their farm to the ground—causing your ranger to go on the hunt. The possibilities are endless!"
    },
    {
      "title": "Take the classic “raised by wolves” story and give it a twist.",
      "content": "Take the classic “raised by wolves” story and give it a twist. Maybe your PC is an orphan raised by a clan of orcs in the woods, or the forest they got lost in as a kid was actually the Feywild—and now their parental figure is a tiny pixie or a talking tree. Start the campaign with your PC being an expert at traversing the wilds but totally unfamiliar with social norms—which makes for fun roleplaying opportunities. [4] X Research source Suggested classes: Druid, ranger, monk, or cleric This is a fun backstory if you want to play a class more in-tune with nature! For example, try making a Four Elements monk, a ranger or druid who respects the forest, or a cleric who worships the forest gods."
    },
    {
      "title": "Play a PC banished from their tribe and forced to explore the world.",
      "content": "Play a PC banished from their tribe and forced to explore the world. Most adventurers leave by choice to go on a great quest or travel the world. However, your PC didn’t get a choice in the matter. For whatever reason, they were exiled and forced to leave home. Now they’re out in the big, scary world and don’t know where to start or who to trust. Will they try to prove themselves and earn a place back home, or stay away for good? [5] X Research source Suggested classes: Barbarian, ranger, or druid For example, make your PC a barbarian who couldn’t prove their worth in battle, a druid who broke a sacred law of nature, or a ranger whose test to prove their abilities as a hunter was such a disaster that they were banished."
    },
    {
      "title": "Make a character who dreams of opening their own business one day.",
      "content": "Make a character who dreams of opening their own business one day. Your PC is a craftsman, inventor, or artist who wants to become a self-sufficient businessperson—but for now, they’re just a wanderer with a vision! They sell their wares on the road to make a living. Perhaps they don’t really picture themselves as a hero—but when adventure comes their way, they realize they have gifts to contribute to the world. [6] X Research source Suggested classes: Artificer, wizard, or bard Make your PC a wizard skilled in alchemy who loves making potions, an artificer who invents wild new toys, or a bard who loves to write and wants to be a famous author. Playing a merchant provides fun roleplaying and moneymaking opportunities for your PC, especially if they try to maintain their business throughout the campaign and make sales during downtime."
    },
    {
      "title": "Design a PC pretending to be someone they’re not.",
      "content": "Design a PC pretending to be someone they’re not. Introduce your PC to the rest of the players as someone respectable—a venerated knight or a powerful cleric who can heal any ailment. Little do they know, however, that your PC is actually a rogue who killed that other person and took all their gear! Your PC might fess up early on, or keep up the ruse and see how long they can go until they’re discovered. Suggested classes: Rogue, bard, wizard, or sorcerer Rogues are the natural choice for a sneaky PC impersonating someone else after robbing and killing them—but bards, wizards, and sorcerers can all cast spells like “Disguise Self,” which allow them to impersonate people more easily."
    },
    {
      "title": "",
      "content": "Create customized names for your DnD characters. Are you a druid, fighter, ranger, or rogue? Are you impish and clever, or solemn and strong? Whoever your DnD character is, find their perfect name with our custom name generator. All fields are optional, but providing more info may help you fine-tune your search. Race Class Gender Any (default) Female Male Non-Binary Character Description See ad to Generate Names Generate Backstory Copy Backstory Backstory copied! Regenerate Backstory Customize Names: Randomize Again Try the full DnD Name Generator or check out all of our generators ."
    }
  ]
}