{
  "url": "https://www.wikihow.com/Do-Squats-and-Lunges",
  "title": "How to Do Squats and Lunges",
  "steps": [
    {
      "title": "Stand erect with your feet approximately one shoulder-width apart.",
      "content": "Stand erect with your feet approximately one shoulder-width apart. From there, you can widen or narrow your stance depending on which muscles you are targeting — a wider stance works the hamstrings and glutes, while a narrower stance works the quads. Point your toes slightly outwards, as this helps to stabilize your stance. Keep your arms extended in front of you."
    },
    {
      "title": "Push your hips back, slowly bending your knees to a 90-degree angle.",
      "content": "Push your hips back, slowly bending your knees to a 90-degree angle. You want to hinge your hips so that your butt moves backwards, almost as if you were sitting in an invisible chair. [1] X Expert Source Tiffany Stafford, CPT Personal Trainer Expert Interview. 26 March 2020. Keep bending until your hamstrings are parallel with the floor. Your knees shouldn't extend beyond the tips of your toes. Your body weight should be concentrated on your heels rather than on your toes. This will allow you to squat deeper. If regular squats are difficult for you, or if you just want to change them up a bit, you can try doing squats into a chair or onto a bench. [2] X Expert Source Tiffany Stafford, CPT Personal Trainer Expert Interview. 26 March 2020."
    },
    {
      "title": "Activate your Glutes and Hamstrings prior to the motion.",
      "content": "Activate your Glutes and Hamstrings prior to the motion."
    },
    {
      "title": "Keep your back straight and eyes looking ahead.",
      "content": "Keep your back straight and eyes looking ahead. It is very important to keep your back straight while squatting, otherwise you could put unnecessary pressure on the spine which could lead to a pulled muscle or a herniated disc. Keeping your chest up and your eyes pointing straight ahead will help you to keep your back straight as you squat. Also try to keep your stomach muscles engaged as you perform the exercise. [3] X Research source"
    },
    {
      "title": "Slowly rise to starting position.",
      "content": "Slowly rise to starting position. Pause for a moment at the bottom of the squat, then slowly rise back to your starting position. Keep your back straight and push up from your heels. Squeeze your glutes in tight when you reach the top of the squat."
    },
    {
      "title": "Start with a low weight.",
      "content": "Start with a low weight. The most important thing with squats is to have the correct form, so you shouldn't attempt weighted squats until you can perform body weight squats with perfect form. Start with a low weight — maybe just using the bar (which weighs 45lbs) — and slowly build yourself up to heavier weights as your squat technique and muscle strength improves. [4] X Research source"
    },
    {
      "title": "Position the bar correctly.",
      "content": "Position the bar correctly. Set up the squat rack so the bar is slightly below shoulder level. Position the safety bars so they are low enough to allow you to squat down fully with the bar on your shoulders. When you're ready, duck under the bar and grip it widely with your palms facing forward. Rest the bar across your upper back (not your neck). If this feels uncomfortable for you, try using a bar pad."
    },
    {
      "title": "Squat using the same technique as the body weight squat.",
      "content": "Squat using the same technique as the body weight squat. Place your feet slightly wider than shoulder-width apart, with your toes pointing slightly outwards. Hinge your hips and push your butt backwards until your hamstrings are parallel with the floor. Keep your chest up, your shoulders back and your eyes looking straight ahead. Remember to keep your back straight — this is especially important when you are squatting with heavy weights. Push out of the squat with your heels and don't let your knees cave in towards the center. If this happens, you may need to reduce your weight."
    },
    {
      "title": "Inhale on the way down, exhale on the way back up.",
      "content": "Inhale on the way down, exhale on the way back up. Breathing deeply is very important when squatting heavy weights. If you hold your breath you can become dizzy, nauseous or even blackout. Take a deep breath in as you squat down and exhale powerfully as you rise up. Maintaining this breathing pattern will give you the energy you need to keep going. If you're pushing yourself to get another few repetitions, don't be afraid to pause between repetitions to take a couple of deep breaths."
    },
    {
      "title": "Squat with dumbbells.",
      "content": "Squat with dumbbells. [5] X Expert Source Tiffany Stafford, CPT Personal Trainer Expert Interview. 26 March 2020. Take two dumbbells of your chosen weight and hold them in front of you, against your shoulders, as if you were about to do a press up. Hold the weights in this position as you squat, using the same technique described above. If you want to make this a total body exercise, press the dumbbells straight into the air when you reach the top of the squat — this allows you to work your legs, core, back, shoulders, chest, and triceps in a single exercise!"
    },
    {
      "title": "Do jump squats.",
      "content": "Do jump squats. This variation can only be performed with body weight squats, not with weighted squats. Place your hands on the back of your head and squat down as normal. Rise quickly out of the squat and jump straight up into the air. Immediately squat down again when you land. [6] X Research source"
    },
    {
      "title": "Try a one-legged squat.",
      "content": "Try a one-legged squat. Hold your arms straight out in front of you at shoulder level and lift your right foot off the ground. Do a one-legged squat, lowering your body as far down as possible, while still keeping your right foot off the ground. Slowly raise yourself back up to the starting position, then repeat with the other leg."
    },
    {
      "title": "Do a barbell stiff squat.",
      "content": "Do a barbell stiff squat. This squat is the same as a normal weighted squat, except you complete the entire exercise while balanced on your toes, with your heels lifted as high off the floor as possible. It can be somewhat difficult to balance during this exercise, so make sure you have your basic weighted squat technique down before you attempt this."
    },
    {
      "title": "Stand erect with your feet about one shoulder-width apart.",
      "content": "Stand erect with your feet about one shoulder-width apart. Put your hands on your hips, keep your back as straight as possible, relax your shoulders and keep your eyes facing directly ahead. Engage your core. Lunges should be performed on solid, even ground, not on an exercise mat. An exercise mat will simply throw you off balance."
    },
    {
      "title": "Take a large step forward with one leg.",
      "content": "Take a large step forward with one leg. The length of your step will depend on your height, but it will usually be somewhere between 2 or 3 feet (0.6 or 0.9 m). As you step forward, lower your hips and bend your knees until they both form 90 degree angles. Your front knee should not extend over your toes and your back knee should not touch the ground."
    },
    {
      "title": "Return to starting position.",
      "content": "Return to starting position. Pause at the bottom of the lunge for up to five seconds. Push off the heel of your front foot to return to the starting position."
    },
    {
      "title": "Alternate with your other leg.",
      "content": "Alternate with your other leg. Repeat the movement, this time with your opposite leg. Remember to keep your muscles tight as you perform the exercise."
    },
    {
      "title": "Choose your weight.",
      "content": "Choose your weight. Weighted lunges can either be performed with a dumbbell in each hand or a barbell across the back. However, barbell lunges should be reserved for more advanced athletes who have very good balance. As with most strength exercises, you should start with a low weight and work your way up."
    },
    {
      "title": "Get into lunge position.",
      "content": "Get into lunge position. With the dumbbells in your hands (by your sides) or the barbell resting on the trapezius muscles (the muscle below the neck and between the back of the shoulders), step forward with one foot into a lunge position. Both knees should form a 90-degree angle. The front knee should not extend beyond the toes and the back knee should not touch the ground."
    },
    {
      "title": "Straighten your legs, but don't step backwards.",
      "content": "Straighten your legs, but don't step backwards. With the weighted lunge, your feet remain in the same position as you complete the desired number of repetitions. You simply need to bend your knees up and down to perform the exercise. [7] X Research source Remember to keep your back straight, your shoulders back and relaxed, your chin up and your core engaged as you complete your repetitions."
    },
    {
      "title": "Switch legs.",
      "content": "Switch legs. Once you have completed the desired number of repetitions, switch legs and repeat the exercise on the other side."
    },
    {
      "title": "Do reverse lunges.",
      "content": "Do reverse lunges. Reverse lunges involve the same movement as regular lunges, except they involve stepping backwards into the lunge instead of forwards. Moving backwards instead of forwards requires greater skill and balance, forcing you to perfect your technique."
    },
    {
      "title": "Do bicep curl lunges.",
      "content": "Do bicep curl lunges. Take a dumbbell in each hand and hold your arms down by your sides. As you step forward into the lunge, bend your elbows and raise the dumbbells towards your shoulders to complete a bicep curl . Lower the dumbbells as you step back into the starting position."
    },
    {
      "title": "Do walking lunges.",
      "content": "Do walking lunges. Instead of returning your front leg to the starting position after completing a lunge, walking lunges involve walking around a room, lunging with each step. This exercise requires very good balance, so you should only attempt it after you have mastered the regular stationary lunge."
    },
    {
      "title": "Do side lunges.",
      "content": "Do side lunges. Side lunges offer the same benefits as forward lunges, but they work the hips, glutes, and thighs in a slightly different way, making them a good variation to incorporate into your routine. Start with your feet and knees together then take a large step out towards the side with your right foot. Bend your right knee until it forms a 90-degree angle and keep your left leg as straight as possible. Push off your right foot to return to the starting position, then repeat with your left leg."
    }
  ]
}