{
  "url": "https://www.wikihow.com/Gaslighting-Yourself",
  "title": "Are You Gaslighting Yourself? Why You Do It and How to Stop",
  "steps": [
    {
      "title": "Self-gaslighting is when you deny your own reality.",
      "content": "Self-gaslighting is when you deny your own reality. Doubts and insecurities can lead you to really question your worth, abilities, and decisions. When you gaslight yourself, you often beat yourself up for the littlest things. It may be difficult for you to look past your internalized doubts, even if you know something is true or factual. [1] X Research source Self-gaslighting often stems from: Trauma Fear of failure Low self-esteem and/or self-worth Mistrust Imposter syndrome Anxiety and/or depression You may be familiar with the term “gaslighting,” which is a form of emotional manipulation where a second party makes you question your reality. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source While the terms are similar, self-gaslighting is when you're the one doubting yourself."
    },
    {
      "title": "You second-guess yourself.",
      "content": "You second-guess yourself. Doubting your memories or abilities constantly is a sure sign of gaslighting. Perhaps you replay events or situations in your mind over and over again, wondering if you imagined it or not. Doubting memories can come from abuse or neglect. If you’ve been hurt physically or mentally, talking to a therapist can be an incredibly helpful way to validate your emotions and feel supported."
    },
    {
      "title": "You dismiss your feelings.",
      "content": "You dismiss your feelings. You’re self-gaslighting if you always deny yourself of your own emotions. In this event, what you’re feeling doesn't seem very justifiable—maybe it’s even silly. Thoughts like “I’m too sensitive” or “I’m overthinking it” can cause you to question your own reactions."
    },
    {
      "title": "You compare your situation to others.",
      "content": "You compare your situation to others. Telling yourself that things could be worse may be a sign of self-gaslighting. Of course, being sympathetic or compassionate about another person’s hardships isn’t harmful whatsoever—however, it isn't good to doubt your own struggles because they aren’t as bad as they could possibly be. [3] X Research source If you find yourself saying, “They have it worse. What I’m going through isn’t that bad,” you may be gaslighting yourself."
    },
    {
      "title": "You make excuses for other people’s bad behavior.",
      "content": "You make excuses for other people’s bad behavior. You’re most likely gaslighting yourself when you write off someone's negative comments with a justification like \"They're just having a bad day.\" Rather than seeing the bad behavior for what it is, it may feel easier to find a logical way to explain it. This may seem harmless, but it unfortunately can start to warp your perception of reality over time. [4] X Research source"
    },
    {
      "title": "You’re overly critical of yourself.",
      "content": "You’re overly critical of yourself. Self-doubts and fears may cause you to question your own abilities. If people tell you you’re amazing at something, you might doubt their words because you believe you’re not good at anything. This sign often manifests through procrastination and can cause you to push aside passions and interests."
    },
    {
      "title": "You stew on negative thoughts about yourself.",
      "content": "You stew on negative thoughts about yourself. If a negative thought enters your mind and seems stuck there, you may be gaslighting yourself. These intrusive thoughts take over your day, and it’s all too easy to believe them. For instance, say you look in the mirror and think, “I look awful in this shirt.” That single thought may haunt you all day, even if friends say they love your outfit."
    },
    {
      "title": "You always blame yourself.",
      "content": "You always blame yourself. A clear sign of self-gaslighting is that you’re the first to blame yourself if something goes wrong. Even if a situation is completely out of your control, you may find it easy to take responsibility. [5] X Research source This generally stems from a fear of being wrong, especially if you question your memory and the reality of what happened."
    },
    {
      "title": "Reflect on where self-doubts are coming from.",
      "content": "Reflect on where self-doubts are coming from. The first step to stopping self-gaslighting is getting a better understanding of why you’re gaslighting yourself. Close your eyes and think about why you’re not good enough or always to blame. Does a specific memory come to mind? Perhaps a person? Uncovering the root of your behavior can help you understand why you doubt yourself. [6] X Research source Try journaling at the start or end of each day to organize your thoughts and process your emotions. Even the simplest entry can lift a weight off your shoulders. Talk to a therapist or counselor about your past to find the source of your insecurities. They’ll be able to personally guide you on your journey and provide you with individualized care. Don’t be afraid to ask yourself hard questions. Healing is difficult, and it can take time, so be patient and gentle with yourself—you can do this."
    },
    {
      "title": "Rephrase negative thoughts.",
      "content": "Rephrase negative thoughts. An excellent way to build self-trust is to learn to believe how amazing you are. When a negative thought comes to mind, reframe it into something positive. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Here are some examples: If you think, “I’m so stupid,” stop the negative thought with, “I didn’t know the answer, but that’s okay. I’ve learned something new.” Redirect “I’m not pretty like the other girls” to “I’m a bit different than other girls, and that’s okay! I’m charming and witty.” Use positive affirmations to build your self-esteem. Try looking in the mirror every morning and saying something like, “I am strong, capable, and reliable,” “I am not the opinion of someone who doesn’t know me,” or, “I believe in myself. I can do anything.”"
    },
    {
      "title": "Surround yourself with positive people.",
      "content": "Surround yourself with positive people. We know it sounds cliche, but the people you hang out with truly affect your mood. Break free of self-gaslighting behavior by being with optimistic people who are confident, encouraging, and uplifting. [8] X Research source Meet new people at community or school events to broaden your social circle. For instance, attend a play, volunteer at a food bank, or go to the farmer’s market. Reach out to old friends to rekindle lost friendships. Maybe you used to be close with someone who never failed to make you smile. Send them a quick text!"
    },
    {
      "title": "Use mindfulness techniques to ground yourself.",
      "content": "Use mindfulness techniques to ground yourself. Self-gaslighting can be a symptom of extreme anxiety, depression, or self-doubt. Calm your energy and ease tension by practicing mindfulness . Focus on the present moment and get out of your head with some of these techniques: [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Do a sitting meditation . Sit in a comfortable position and close your eyes. Focus on your breath, and let each thought come and go as it pleases. Pay attention to your surroundings. When life gets overwhelming, take a moment to focus on what you see, hear, smell, taste, and feel."
    },
    {
      "title": "Yes, self-gaslighting can cause long-term physical and mental harm.",
      "content": "Yes, self-gaslighting can cause long-term physical and mental harm. Long periods of self-doubt and low self-esteem can cause anxiety, depression, and behavioral disorders. These mental health conditions can manifest physically in the body, causing stomach pain, headaches, and fatigue. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Along with this, studies have shown that those with low self-esteem and gaslighting tendencies are more prone to toxic relationships and substance abuse. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}