{
  "url": "https://www.wikihow.com/Get-Pet-Hair-Out-of-Laundry",
  "title": "How to Get Pet Hair Out of Laundry",
  "steps": [
    {
      "title": "Brush a dry sponge over the fabric to remove hair from the surface.",
      "content": "Brush a dry sponge over the fabric to remove hair from the surface. Take a kitchen sponge that you don’t plan on using for washing dishes anymore. Run the abrasive scrubbing side against the clothing or blanket to swipe off pet hair. [1] X Research source Do this outside or over a trash bag so you don’t get hair all over your floors. For hair that's tough to get off, you can use a damp sponge. Wet the sponge, then wring out any excess water before brushing the fabric."
    },
    {
      "title": "Lift stubborn hair from fabric with a lint roller.",
      "content": "Lift stubborn hair from fabric with a lint roller. [2] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. Start with a clean adhesive sheet on your roller. Then roll it over the item, using smooth strokes in one direction. Pay special attention to any areas with a lot of hair. Rip off the sheets as they become covered in hair to expose fresh sheets. Otherwise, the roller won’t be as effective at pulling up the hair. You can also loosen the hair before using the lint roller by spraying static guard on the fabric. Make your own lint roller by wrapping a piece of masking or packing tape around your hand with the sticky side facing out. Run your hand over the fabric to pick up hair. [3] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020."
    },
    {
      "title": "Use a clothes steamer if the hair is caught on delicate fabric.",
      "content": "Use a clothes steamer if the hair is caught on delicate fabric. The warmth and moisture of the steam also releases trapped hair so it will be easier to remove in the wash. Fill the tank of the steamer with water, then lightly run the steamer over the fabric in downward strokes. [4] X Research source Steamers are safe to use on delicate materials, like wool or velvet. Check the care instructions on the label of the item if you aren’t sure. It’s easier to steam items when they’re hanging up. If you’re on a budget, you can buy a handheld steamer, which typically costs around $30 to $40, instead of a standing steamer, which can cost over $100."
    },
    {
      "title": "Toss the laundry in the dryer for 10 minutes before washing the clothes.",
      "content": "Toss the laundry in the dryer for 10 minutes before washing the clothes. Put the hair-covered items in the dryer and turn it on a low-heat cycle, like permanent press. After 10 minutes, check the laundry. If there’s still a lot of hair on the pieces, run them in the dryer for another 5 to 10 minutes. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Clean the lint trap after tossing the clothes to clear all of the hair from it. It's important to get as much hair off of your garments as you can before washing it, so it doesn't get onto the rest of your clothes or stay in the washing machine. [6] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020."
    },
    {
      "title": "Use fabric softener to loosen up hair from the fabric.",
      "content": "Use fabric softener to loosen up hair from the fabric. Check the back of the bottle to find instructions on how much softener to use per load. Then, before turning on the washing machine, measure the right amount of fabric softener and pour it into the dispenser. [7] X Research source Most fabric softener bottles have measuring caps that you can use to portion out the liquid. The dispenser in the machine itself may also have a fill line that you can use as a guide. The fabric softener dispenser will either look like a tall cylinder in the center of your machine or a small compartment towards the top of the machine, depending on your model. Never pour fabric softener directly into the drum of the washing machine. For older washing machines, read the manual to find out if you need to wait and manually add the softener immediately before the last rinse cycle. Newer models do this automatically."
    },
    {
      "title": "Add white vinegar to the rinse cycle for a natural hair remover.",
      "content": "Add white vinegar to the rinse cycle for a natural hair remover. The acetic acid in vinegar softens fabric, which frees up the pet hair that's stuck in the material. Measure out 1 ⁄ 2 cup (120 ml) of vinegar, then pour it into the fabric softener dispenser of your washing machine before turning it on. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source You can use apple cider vinegar instead of white vinegar if you’d like. If you have an older washing machine, you may need to manually add the vinegar before the final rinse cycle. On newer models, you can put it in at the beginning and the machine will automatically dispense it when it’s rinsing. Check the manual for your washing machine first to make sure it’s okay to use vinegar with your model."
    },
    {
      "title": "Put 1 to 2 dryer sheets in the dryer as a scented static remover.",
      "content": "Put 1 to 2 dryer sheets in the dryer as a scented static remover. Dryer sheets eliminate static, which can keep hair stuck to the fabric. Place them in the dryer along with the wet clothes before you turn on the machine. If you have a light load of laundry, 1 sheet will work. For medium to heavy loads, use 2 sheets. For fabric with a lot of static, like flannel, use an extra dryer sheet."
    },
    {
      "title": "Toss 3 to 6 wool dryer balls into the dryer for an eco-friendly alternative.",
      "content": "Toss 3 to 6 wool dryer balls into the dryer for an eco-friendly alternative. Dryer balls remove static and stray hair just like dryer sheets, but the balls are biodegradable and reusable. They're also free of artificial ingredients, so they don't have a scent. Set the balls, which are about the size of tennis balls, in the dryer with the wet laundry before drying. You can find wool dryer balls in the laundry aisle of big-box stores, or you can buy them from an online retailer."
    },
    {
      "title": "Clean the lint trap halfway through drying.",
      "content": "Clean the lint trap halfway through drying. If the lint trap gets clogged while your laundry is drying, the hair can get spit back onto your clothes. Stop your dryer when it reaches the midpoint of its drying cycle and pull out the lint trap. Brush off any hair or lint that has accumulated, then replace the trap and resume the cycle. [9] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Depending on your dryer model, the lint trap is usually either on top of the dryer or just inside the door."
    },
    {
      "title": "Run an empty wash cycle after you remove the laundry.",
      "content": "Run an empty wash cycle after you remove the laundry. This will rinse out any extra hair that’s still inside the machine. Simply set the washing machine on a regular wash cycle and let it run without anything inside. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For the deepest clean, choose the hottest setting and longest cycle on your washing machine. Settings that are labeled “white” or “stains” tend to use the highest heat. Choose “extra rinse” if you have that option on your machine."
    },
    {
      "title": "Wipe the drums of the washing machine and dryer if there’s still hair.",
      "content": "Wipe the drums of the washing machine and dryer if there’s still hair. Otherwise, the next time you go to do laundry, the pet hair will just get tossed in with the clothes. Use a damp cloth or paper towel to pick up any strands that were left behind in the drums of either machine. [11] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you want to sanitize your machine while you wipe it down, squeeze a few drops of laundry detergent onto your cloth or towel first. Make sure you get in all the nooks and crannies, including the door and door seal, too."
    },
    {
      "title": "Vacuum out any excess hair from the washing machine or dryer.",
      "content": "Vacuum out any excess hair from the washing machine or dryer. Use the soft brush attachment on your vacuum cleaner to suck up any hair that was left behind in both machines. Do a sweep around the entire drums, including the tops and sides. If you're vacuuming the washing machine, make sure it's completely dry first. To dry the drum of the washing machine, leave the door open so it can air out, or wipe it down with a dry cloth. You can buy different brush attachments for your vacuum cleaner from a houseware store, hardware store, or online retailer."
    }
  ]
}