{
  "url": "https://www.wikihow.com/Draw-Graffiti-Letters",
  "title": "How to Draw Graffiti Letters",
  "steps": [
    {
      "title": "Draw the outline sketch for the letters in pencil.",
      "content": "Draw the outline sketch for the letters in pencil. [1] X Research source"
    },
    {
      "title": "Add actual lines for the graffiti designs on the letters.",
      "content": "Add actual lines for the graffiti designs on the letters. Most graffiti designs are connected, intersecting or on top of one part of the other. [2] X Research source"
    },
    {
      "title": "Fill in the basic colors.",
      "content": "Fill in the basic colors. [3] X Research source"
    },
    {
      "title": "Add darker tone on the graffiti colors.",
      "content": "Add darker tone on the graffiti colors."
    },
    {
      "title": "Add more details by drawing a design on the graffiti.",
      "content": "Add more details by drawing a design on the graffiti. You can choose any design that you want. Metallic, balloon, fluffy, gummy, and so on. I chose drawing cracked lines on the sample."
    },
    {
      "title": "Add the cast shadow to complete the graffiti.",
      "content": "Add the cast shadow to complete the graffiti."
    },
    {
      "title": "Draw the outline sketches for the letters.",
      "content": "Draw the outline sketches for the letters."
    },
    {
      "title": "Add the actual lines for the graffiti designs on the letters.",
      "content": "Add the actual lines for the graffiti designs on the letters. Draw pointed lines intersecting the others. [4] X Research source"
    },
    {
      "title": "Erase the unnecessary lines.",
      "content": "Erase the unnecessary lines."
    },
    {
      "title": "Fill in the basic color.",
      "content": "Fill in the basic color."
    },
    {
      "title": "Add the highlights and shadows.",
      "content": "Add the highlights and shadows. [5] X Research source"
    },
    {
      "title": "Instead of adding shadows, choose a bright color that is contrasting the colors of the letters.",
      "content": "Instead of adding shadows, choose a bright color that is contrasting the colors of the letters. Graffiti colors almost always have contrasting colors. However, you can also use colors that complement each other."
    },
    {
      "title": "Add more designs on the background to finish the graffiti.",
      "content": "Add more designs on the background to finish the graffiti."
    }
  ]
}