{
  "url": "https://www.wikihow.com/Gargle",
  "title": "How to Gargle",
  "steps": [
    {
      "title": "Find a clean glass.",
      "content": "Find a clean glass. This is now your \"gargling cup.\" While you don't have to use a special cup to put your gargling liquid in, it's often safer than drinking directly out of a bottle of mouthwash, for example, because you avoid transmitting bacteria. [1] X Research source"
    },
    {
      "title": "Fill your gargling cup with your gargling liquid of choice.",
      "content": "Fill your gargling cup with your gargling liquid of choice. A little bit is fine—better to start out with less than with too much."
    },
    {
      "title": "Put a small amount of the liquid in your mouth and swish it around.",
      "content": "Put a small amount of the liquid in your mouth and swish it around. The goal is to try to get the front and sides of the mouth, areas that gargling won't reach, during this first sweep. [2] X Research source Move your cheeks in and out and your tongue back and forth to swish the gargling liquid back and forth in your mouth. Some people enjoy warming the gargling liquid up a bit before gargling. While it probably won't be pleasant if you're using mouthwash, warm water mixed with a little bit of salt feels nice in the back of your mouth."
    },
    {
      "title": "Tilt your head back, open your mouth, and make an \"ahhh\" sound.",
      "content": "Tilt your head back, open your mouth, and make an \"ahhh\" sound. Keep the small flap in the back of your throat, the epiglottis, closed so you don’t accidentally swallow any of the liquid. [3] X Research source This may take a bit of time to get used to, but when done correctly, the vibrations in the back of your mouth will cause the gargling liquid to move about, almost as if the liquid were boiling. Gargling coats the back of the mouth with whatever liquid you choose, eliminating some bacteria and soothing a sore throat. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Spit the gargling liquid out into the sink.",
      "content": "Spit the gargling liquid out into the sink. Continue with your oral health routine by brushing your teeth or flossing ."
    },
    {
      "title": "Gargle with a simple salt water (saline) solution for respiratory health.",
      "content": "Gargle with a simple salt water (saline) solution for respiratory health. Mix a half-teaspoon (3 g) of salt in 1 cup (240 mL) of warm water. Stir the mixture to dissolve the salt. Gargle the saline solution 3 times a day to help prevent and soothe respiratory tract infections. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source One study found that people who gargled a simple salt solution 3 times a day had a 40% decrease in upper respiratory tract infections. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Not only does the saltwater gargle appear to ease cold symptoms, but it also keeps you healthier during cold and flu season. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Other studies point to evidence that saline solutions help fight against sore throats and congestion. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Board Certified Dentist and Oral Surgeon Pradeep Adatrow says, “The safest mouthwash you can use for any oral problems is the warm saltwater rinse…Although it may be initially painful, the saltwater rinse can really help dry out mouth sores.”"
    },
    {
      "title": "Try a commercial or homemade mouthwash for fresh breath.",
      "content": "Try a commercial or homemade mouthwash for fresh breath. Using mouthwash helps simultaneously freshen your breath, clean your mouth, and fight against infection. Millions of people use mouthwash morning and night as part of their oral health routine. Adatrow recommends, “Before introducing any mouthwash into your oral care regimen, it is advisable to seek guidance from a qualified healthcare professional.” Mouthwashes with alcohol tend to be more potent but carry the risk of several adverse side effects, including mouth ulcers, corroded fillings, and even the elevated threat of cancer. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Use them sparingly. You can also make your own mouthwash if you'd like. In fact, it's quite easy. Here are some ideas: Peppermint and tea tree mouthwash Angelica mouthwash Rosemary and mint mouthwash"
    },
    {
      "title": "Use a simple baking soda and water combination to ease mouth sores.",
      "content": "Use a simple baking soda and water combination to ease mouth sores. Sodium bicarbonate, or baking soda, is a renowned cleaner used for tons of home applications. Who knew it made such a great mouthwash? To make a baking soda mouthwash, dissolve 1 teaspoon (5 g) of baking soda in .5 cups (120 mL) of warm water. [10] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you want, you can add a few drops of peppermint oil to boost the flavor and freshen your breath. Studies show that a baking soda rinse can help balance the pH in your mouth and make it less friendly to acid-loving bacteria. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It’s also great for soothing the pain of canker sores and treating other mouth ulcers ."
    },
    {
      "title": "Try adding lemon and honey to hot water for a soothing gargle.",
      "content": "Try adding lemon and honey to hot water for a soothing gargle. Making honey and lemon water is a great choice for gargling because it contains two ingredients that are soothing to the throat. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Another benefit of this gargling liquid is that it's actually something you can drink after gargling, unlike the other solutions. Try adding a 1 tablespoon (15 mL) each of honey and lemon juice to 6 fluid ounces (180 mL) of water. Gargle the mixture, then swallow it, especially if you have a sore throat or want to eliminate some mucous."
    },
    {
      "title": "Swish some chamomile tea to ease a scratchy throat.",
      "content": "Swish some chamomile tea to ease a scratchy throat. Just like the honey and lemon gargle, you can swallow tea after you’re done gargling it. Brew a cup of chamomile tea and wait until it’s pleasantly warm but not scalding hot. Take a sip and gargle it for a moment before swallowing. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Chamomile tea is especially helpful for lubricating your throat if you’re hoarse. Other kinds of herbal teas , such as peppermint and raspberry, are also soothing when your throat is sore or inflamed."
    }
  ]
}