{
  "url": "https://www.wikihow.com/Do-Something-when-You%27re-Bored",
  "title": "What to Do When You’re Bored",
  "steps": [
    {
      "title": "",
      "content": "Watch a movie . Find a movie online, or head to your local movie theater. Maybe opt for something you wouldn't normally watch, like a documentary or a mystery. Bake or cook. Baking and cooking can help you pass the time while making something scrumptious. So, try making cookies , brownies, or a homemade soup . Have a fashion show. Who says you need to go anywhere to glam yourself up? Pass the time by trying out different makeup techniques and putting together fun outfits from your closet. [1] X Research source Hang out with your pet. If you have an animal, pamper them with a bath , clip their nails , or teach them new tricks. Spending time with them can help you feel less bored while strengthening your relationship. Call or text a friend. See what your loved ones are up to if you’re feeling bored. A casual conversation can keep you entertained while passing the time and connecting with a friend. Exercise . Fill your body with endorphins and cure boredom by moving your body. Look up a YouTube yoga flow, dance routine, or bodyweight workout. Learn something new. Having some free time is a great chance to learn something new and interesting. Learn how to do magic tricks , discover how to breathe fire , or how to make chainmail . Make a pillow fort. If you’re stuck at home, turn your space into something epic by piling up as many pillows and blankets as possible! Share something on social media. Update your friends and family on what’s going on in your life. Express your boredom with a Facebook update, share a silly photo on Instagram , or Snapchat your closest pals to see what they’re up to. Watch random YouTube videos. Search “comedy” if you want to laugh, and choose something from the “Trending” menu to see what the world’s watching. [2] X Research source Challenge yourself. Do something you thought you never could do before. [3] X Expert Source Gera Anderson, PsyD Licensed Clinical Psychologist Expert Interview. 18 October 2021. Maybe that’s doing a handstand or singing a high note. Memorize something new. Learn America’s 50 states in alphabetical order, see how much of pi you can remember , or try memorizing fun phrases in Morse code. Practice tongue twisters. Search “tongue twisters” online. Then, try to perfect as many as you can. Play a board game. If you’re stuck inside with friends or family, consider playing a traditional board game (like Monopoly or Scrabble) to help pass the time. [4] X Research source Play a video game. When you’re bored, reach for your video game console of choice. Try to beat as many levels as possible, or play until you’re tired of the game. Plan a vacation . While you’re stuck inside, think about what you want your next adventure to be. Maybe you want to go to Disney World or visit the Eiffel Tower. Learn a new language . Sign up for apps like Duolingo or Babbel and play a few games to learn words and phrases in a different language. [5] X Expert Source Gera Anderson, PsyD Licensed Clinical Psychologist Expert Interview. 18 October 2021. Explore Craigslist or eBay. Find the weirdest thing you possibly can. Start with general searches like “dolls” or “90s memorabilia” and see where it takes you."
    },
    {
      "title": "",
      "content": "Meditate. If you have some time and are bored, calm your mind and take a few moments to sit in silence. This can help re-energize your mind and help you think more clearly. [6] X Research source Read a book . Skim through your bookshelf or head to the library and pick up whatever book interests you. This is an easy and fun way to pass the time without doing anything too exerting. [7] X Research source Listen to music . Turn on your favorite artist or album, or tune into a random radio station to see what’s topping the charts. Take a nap. If you’re feeling rundown and bored, take this time as an opportunity to unwind and catch some extra zs. [8] X Research source Do a puzzle. Pass the time by solving a puzzle . This quiet, relaxing activity can take up as much time as you’d like. Make a gratitude list. Write down everything in your life you’re grateful for. This can be big or small things, like your being thankful for your family or the smell of freshly baked cookies. Do your nails. Give yourself a manicure or pedicure to keep yourself busy. Stick with solid polish colors, or get wild and try a funky design (a quick online search can bring up thousands of ideas)."
    },
    {
      "title": "",
      "content": "Make a video . Pass the time by following a social media trend (like a popular dance) or recreate your favorite movie scene with a friend or by yourself. From practicing, filming, and editing, this activity can keep you joyfully busy for hours! Practice music. If you play an instrument or sing, now is a great time to practice your skills. Try learning a new piece of music or mastering your favorite song. Doodle . This is a great way to keep your hands busy while staying focused at school, work, or home. Write a story. Pass the time by making up fictional characters, places, and scenarios. Jot down your ideas in a notebook, or see how long of a story you can type on your computer. Make up a dance. Simply turn on some music and get groovy! You can make up an entire dance number or a quick and easy move to teach all your friends. Write a song. Ask yourself, “What am I feeling right now?” Then, turn those feelings into lyrics and/or a melody. Make a bucket list. Write down everything you want to do or see before you die. Maybe that’s riding in a hot air balloon or visiting Mount Everest. Rewrite the lyrics to a favorite song. Look up the lyrics to your favorite song. Then, try replacing all the adjectives and/or pronouns with something new. Then, show it to your friends and see their reaction. Make a collage. Cut up a magazine and hang fun quotes and pictures on your wall, or print out pictures of you and your friends to arrange in a picture frame. Start a scrapbook. Have a bunch of pictures lying around? Use this time to organize them in a book. [9] X Research source"
    },
    {
      "title": "",
      "content": "Practice a sport. Work on your soccer goals, basketball foul shots, or long jump . In other words, practice your favorite sport to sharpen your skills, have fun, and pass the time. Go for a walk. Pass the time and soak in some sunshine by taking a nature walk. Take a walk around your neighborhood or head to your local park. Travel somewhere new in town. Get in your car and see where the road takes you, or hop on a bus or train and take an exit you’ve never taken before. [10] X Research source Donate to a local food bank. Sort through your pantry and see if you have any nonperishable food items (like canned goods) that you could give to someone in need. Volunteer at a local animal shelter. Call your local shelter to see if they need help caring for the animals or cleaning out kennels. Play “Truth or Dare” with a friend. If you’re bored with friends, consider asking them, “Truth or dare?” Continue playing the game until your spirits are up. Go shopping. Ask a friend or family member to come along for even more fun! Keep in mind that you don’t have to buy anything—you can simply browse the stores and window shop. Do an outdoor activity. Pass the time by doing something fun in nature. You can go for a hike , fish , or bird watch . Stargaze. If you’re bored at night, lay a blanket in your yard or balcony and sit on it as you look at the stars. See how many constellations you can spot (or make up). Start a garden. Try your hand at gardening to cure your boredom all year round! Plant tomatoes or flowers to help liven up your backyard or patio. People-watch. Whenever you're bored in a busy place (train station, airport, bus depot, cafe, etc.), look around at the people near you. You could even make up stories as to what they’re doing or going. [11] X Research source Listen to the conversations going on around you. Eavesdropping can be a great way to pass the time and learn more about people. Subtly listen to a stranger’s conversation to see what’s happening in their life. Then, consider writing down what you hear to turn into a story later. [12] X Research source Make up a new persona. When you're traveling, you can be anyone you want to be. Come up with a different personality and stick to it while on the airplane, at the bus depot, waiting for the train, etc. Play “I Spy.” If you’re bored traveling with a friend, look around you and say, “I spy something [mention a describing word about something you see].” Then, have your friend guess what you’re describing. Keep going back and worth spying and guessing until you feel less bored. Clean out your fridge. Reorganize all your dressing and condiments, throw out expired items, and place like items together. [13] X Research source"
    },
    {
      "title": "",
      "content": "Write down your goals. It can be easy to get stuck in your head when you're bored. To avoid this, focus on what you need to have a meaningful and fulfilling life. Take note of your goals and how you can achieve them. [14] X Research source Clean your room . Having a clean room can help you feel accomplished and neat, giving you a boost of energy. Plus, it’s a great productive activity to pass the time. Organize your closet . If your room’s all clean, consider cleaning out your closet. Maybe you organize everything by color, pattern, or style. Then, consider donating or selling any items that don’t fit or you don’t wear anymore. [15] X Research source Do a household project. When you have a little time on your hands, try doing something you've been putting off. Paint that wall you’ve always wanted to paint, hang up a picture, or fix that squeaky door . Reorganize or clean your space. Whether you’re at home or the office, take your boredom as a sign to organize your living or workspace. Vacuum, dust, or simply tidy things up. [16] X Research source Ask a loved one if they need help with anything. Call up a friend or family member to see if their house, watering the garden, or cooking dinner. This will put your spare time to good use and give you somebody to hang out with, all while doing something nice for someone else. [17] X Expert Source Tara Bradford Life & Mindset Coach Expert Interview. 16 September 2020. Clean your computer . Wipe down the screen and between the keys. Then, organize the desktop by placing everything in labeled folders or deleting any documents you no longer need or want. Decorate your bedroom or living space. Kill some time by decorating your home with seasonal items. Move furniture around, hang up some pictures, or do whatever else feels right!"
    }
  ]
}