{
  "url": "https://www.wikihow.com/Do-Simple-and-Cute-Hairstyles",
  "title": "How to Do Simple and Cute Hairstyles",
  "steps": [
    {
      "title": "Decide where you want your ponytail to sit.",
      "content": "Decide where you want your ponytail to sit. Ponytails are incredibly versatile. Your ponytail's placement can dramatically affect your look. High ponytails sit on the crown of your head so that the ponytail is visible from the front. These are very dramatic and fashionable. Tying your hair just a few inches lower gives a more sporty look. Low ponytails at the nape of your neck can make you look down-to-earth. Another less common type of ponytail is 1 tied to the side of the head instead of the back. Side ponytails can make you seem quirky and fun."
    },
    {
      "title": "Tease your hair slightly at your crown.",
      "content": "Tease your hair slightly at your crown. Teasing, also known as backcombing, adds subtle, flattering volume that may also help to keep your ponytail in place. Take a section of hair from the back of your head where it starts to curve downward. Gently backcomb the bottom part of this section with 2 or 3 passes. [1] X Research source To backcomb , grip the section of hair and hold it vertically away from your scalp. Run a comb from the middle of the back of your hair towards the roots, stroking downward. Repeat this until the gathered strands have created a cushion on your crown. If you are doing a side ponytail, tease a small section of hair right above where you plan on placing the hair tie. If your hair is curly, you can skip this step."
    },
    {
      "title": "Gather your hair back.",
      "content": "Gather your hair back. Use both hands to sweep the majority of your hair backward and hold it in place with 1 hand. For a sleek and practical ponytail to keep hair out of your face, gather all of your hair, including your bangs. For a more laid-back look, leave your bangs loose (if you have bangs) or pull a few wisps of hair out around your face. For a side ponytail, gather your hair to the side instead."
    },
    {
      "title": "Smooth out any bumps with a flat brush.",
      "content": "Smooth out any bumps with a flat brush. Gather your hair into the crook of your index finger and thumb and then use the other hand to smooth back your hair. Smooth down the hair with your fingers first, and then run the brush over the hair to get it nice and neat. Keep holding onto the hair with your other hand while you do this. Loosen and tighten your grip on the hair as needed to smooth it. Switch hands as needed to smooth out both sides of the ponytail."
    },
    {
      "title": "Secure your ponytail in place.",
      "content": "Secure your ponytail in place. Take a hair tie and pull it over your ponytail from the back. Once the elastic reaches the base of your ponytail, twist it into a figure 8. Pull your ponytail back through this new opening. Repeat this until the hair tie no longer has slack and your ponytail isn't budging from its desired position. For extra style, you can use a colorful scrunchy. [2] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. You could even create your own unique ponytail by adding braids or twists wherever you want. For a simpler look, use a plain elastic."
    },
    {
      "title": "Consider doing a double ponytail.",
      "content": "Consider doing a double ponytail. One easy secret to creating a longer-looking ponytail is to stack 2 ponytails on top of each other. Instead of tying all of your hair back at once, separate it into top and bottom halves. Tie each half back as its own ponytail. Position the top ponytail at the crown of your head and the other pony tail a few inches below it. Comb the ends of the 2 ponytails together so they blend together as a single, very long ponytail."
    },
    {
      "title": "Get a hair donut.",
      "content": "Get a hair donut. [3] X Expert Source Christine George Master Hair Stylist & Colorist Expert Interview. 10 January 2020. The most important thing you'll need to make a sock bun is a spongy donut-shaped item to wrap it around. Hair donuts are what give the sock bun its perfect shape. You can either buy a hair donut or make 1 for yourself by cutting the toe off of a tube sock. [4] X Research source Discard the toe. The remaining sock tube will be your donut. You don't have to shape the tube; it will take on a donut shape further on. If you are using a sock, take 1 edge of the sock and roll it up into itself until it takes on a solid donut shape."
    },
    {
      "title": "Put your hair into a ponytail.",
      "content": "Put your hair into a ponytail. Use the techniques discussed elsewhere in this article. Place the base of your ponytail wherever you want your bun to sit. The most popular position for a sock bun is on the crown of your head starting from a high ponytail. It's better to use a thin hair tie rather than a bulky scrunchie, as a scrunchie may cause bumps in your bun."
    },
    {
      "title": "Pull your ponytail through the center of your sock bun.",
      "content": "Pull your ponytail through the center of your sock bun. If you're using a hair donut, just put it on just as you would a scrunchie. If you're using a sock, pull it down to the base of your ponytail. [5] X Research source"
    },
    {
      "title": "Roll your hair onto the donut.",
      "content": "Roll your hair onto the donut. Bring the donut up to the tip of your ponytail. Spread the ends of your hair evenly around the donut. Then slowly roll the donut down towards the base of your ponytail, wrapping your hair with it."
    },
    {
      "title": "Roll the hair donut down around the base of your ponytail.",
      "content": "Roll the hair donut down around the base of your ponytail. Tuck any loose strands into the donut. If you can see the donut through gaps in your hair, gently spread your hair out a bit to cover them. Depending on how tight you've rolled your bun and how thick your hair is, you may not need to secure it any further. If your hair is very fine or you've rolled it loosely, secure your bun with a few bobby pins. [6] X Research source"
    },
    {
      "title": "Use a comb to give yourself a middle part and gather all of your hair back.",
      "content": "Use a comb to give yourself a middle part and gather all of your hair back. Make sure you have 2 large and 4 small bobby pins on hand if you decide to go with this style."
    },
    {
      "title": "Twist your hair.",
      "content": "Twist your hair. Take your gathered up hair with 1 hand and twist it in a clockwise direction by rolling your wrist. Be gentle to avoid hair breakage or hurting your scalp. Keep twisting until all of your hair from the nape of your neck to the tips is a tight spiral. [7] X Research source"
    },
    {
      "title": "Coil your hair into a bun.",
      "content": "Coil your hair into a bun. Hold your hair with 1 hand, maintaining its twisted spiral. With that same hand, begin to wrap the whole strand in a clockwise circle around its base. Place your index finger of your other hand in the center of the base to keep the bun in shape. Once you've gotten down to the end of your hair, wrap the tips underneath the rest of the bun. [8] X Research source You can also do a counterclockwise bun. If you choose this option, start by twisting your hair counterclockwise instead."
    },
    {
      "title": "Secure your wrapped hair.",
      "content": "Secure your wrapped hair. Use large bobby pins on either side to hold your bun securely. Make any minor changes to your bun's shape you'd like by gently pulling edges loose with your fingers. Once you have the desired shape, pin it in place with the 4 smaller bobby pins. You may choose to put the finishing touches on your bun by adding a little volume to your hairdo. Use the tail of a comb and gently slide it under the hair at your crown. Gently pull the hair slightly up and out of the bun. You can use the same technique on the outer portion of the bun. [9] X Research source"
    },
    {
      "title": "Use a comb to gather all of your hair into a ponytail.",
      "content": "Use a comb to gather all of your hair into a ponytail. A chignon is a classic hairstyle that is worn low on the back of your head, near the nape of your neck. You will need to start with a sleek ponytail, so gather your hair, smooth it out, and secure it with an elastic band at the back of your head. [10] X Research source"
    },
    {
      "title": "Secure the ponytail halfway to the ends with another elastic band.",
      "content": "Secure the ponytail halfway to the ends with another elastic band. Brush out the ponytail well to ensure that it is smooth. Then, secure the ponytail with an elastic band near the center. [11] X Research source"
    },
    {
      "title": "Slide a bobby pin over the elastic band and fold over the ponytail.",
      "content": "Slide a bobby pin over the elastic band and fold over the ponytail. Slide the bobby pin onto the elastic band going towards the base of the ponytail. Then, fold the ponytail up towards the base so that the 2 elastic bands are right next to each other and insert the bobby pin through the base of the ponytail. [12] X Research source You can position the hair however you want, but the classic way is to fold it straight up and secure the bobby pin through the top center of the ponytail holder. [13] X Research source"
    },
    {
      "title": "Wrap the remaining hair around the base of the ponytail.",
      "content": "Wrap the remaining hair around the base of the ponytail. Take the ends of your ponytail and wrap them around the base of the chignon to hide the elastics. Then, insert bobby pins on either side to hold the hair wrapped around your chignon securely. [14] X Research source Spray on some hairspray for a stronger hold."
    },
    {
      "title": "Create a pony tail where you would like the braid.",
      "content": "Create a pony tail where you would like the braid. Brush your hair out and secure it with an elastic at the back of your head. If desired, you can also skip the ponytail and just divide your hair into 3 sections to start."
    },
    {
      "title": "Take your ponytail and separate it into 3 equal sections.",
      "content": "Take your ponytail and separate it into 3 equal sections. Label these sections A, B, and C respectively."
    },
    {
      "title": "Create your first twist in your braid by taking and crossing it over B.",
      "content": "Create your first twist in your braid by taking and crossing it over B. The order should now be B, A, C."
    },
    {
      "title": "Next you should take C and cross it over A.",
      "content": "Next you should take C and cross it over A. Now the order should be B, C, A. This creates your first twist in the braid."
    },
    {
      "title": "Repeat steps 2-4 until you get to the end of your braid, secure with an elastic and enjoy your new look!",
      "content": "Repeat steps 2-4 until you get to the end of your braid, secure with an elastic and enjoy your new look!"
    },
    {
      "title": "Slide a stretchy headband over the crown of your head.",
      "content": "Slide a stretchy headband over the crown of your head. Position the front of the headband so that it either rests on the top of your forehead or an inch or 2 back on top of your hair. Move the back portion of the headband wherever you want your tuck to be. A popular position is the nape of the neck. [15] X Research source"
    },
    {
      "title": "Make sure your headband fits correctly.",
      "content": "Make sure your headband fits correctly. It must be both tight enough to stay in place all day and loose enough for hair to be tucked into. Your headband should not slide around at all on your head. You should be able to slide 2 to 3 fingers comfortably underneath the headband. Don't wear a headband that feels like it's pinching your head."
    },
    {
      "title": "Tuck your hair into the headband.",
      "content": "Tuck your hair into the headband. Begin from the front and work in sections. Take a strand of hair into your hand and bring it up and over the headband. Tuck the ends in so that the hair forms a loop. For best results, start in the front of your hair and work towards the center back on the sides. Then combine the ends into the middle section and fold them together. If your hairdo is looking too flat, add some volume. Take a styling comb and gently insert it under the hair at your crown and/or tucked into the headband. Carefully lift the comb to pull the hair out slightly. Re-tuck any strands that you may have accidentally loosened out of the headband completely. [16] X Research source"
    }
  ]
}