{
  "url": "https://www.wikihow.com/Do-a-German-Accent",
  "title": "How to Do a German Accent",
  "steps": [
    {
      "title": "Change the “w” sound to a “v” sound.",
      "content": "Change the “w” sound to a “v” sound. German doesn’t have a “w” sound, and you’ll sound inauthentic if you make this sound while attempting to speak with a German accent. For example, pronounce the word “water” should like “vater.” Or, if you want to say that you “want to wet your whistle,” pronounce it like, “I vant to vet my vistle.” [1] X Research source Change the “w” pronunciation even if it’s in the middle of a word. For example, “jewelry” in a German accent would sound like “juvelry.” If a word already has a “v” in it—like “veterinarian”—you can pronounce it as you normally would."
    },
    {
      "title": "Articulate the letter “s” like a “z” when it occurs within a word.",
      "content": "Articulate the letter “s” like a “z” when it occurs within a word. When you’re using a German accent and come across words with an “s” in the middle, change the sound to a “z.” For example, if you’re saying the word “also” with a German accent, pronounce it like “alzo.” [2] X Research source Of course, this is somewhat uncommon, since “s” is used most often at the end of English words. When the letter “s” occurs at the end of a word, don’t change it to a “z” sound. For example, the word “hiss” should sound the same whether or not you’re using a German accent. Don’t say “hiz.”"
    },
    {
      "title": "Enunciate a German “r” by gargling it slightly in the back of your throat.",
      "content": "Enunciate a German “r” by gargling it slightly in the back of your throat. This is a little difficult, since the sound doesn’t exist in English. The German “r” sound comes close to the sound of an English “gh” or “rh,” but takes place far down in the back of the throat. Try to pronounce the “r” at the top of your esophagus, just about where you’d gargle water. The sound of a word like “rabbit” should resemble “hrabbit” or “ghabbit.” [3] X Research source As another example, the English word “run” should sound like “hrun” or “ghun.”"
    },
    {
      "title": "Form the German “h” sound far back in your throat.",
      "content": "Form the German “h” sound far back in your throat. Similarly to when you’re pronouncing “r” with a German accent, the letter “h” should be slightly rolled or gargled in the back of your throat. If you’re struggling to figure this sound out, try making a soft “g” sound before you pronounce the letter “h.” So, the word “hair” would sound like “hghair.” To put it a little coarsely, the German “h” sound mimics the sound you’d make if you were trying to gather spit in the back of your throat."
    },
    {
      "title": "Pronounce consonant sounds with the tip of your tongue.",
      "content": "Pronounce consonant sounds with the tip of your tongue. This will harden the consonants. When a word ends with a soft consonant, German language speakers have a tendency to make the sound hard and abrupt, unlike in English. Harden your consonants shortening the consonant sound and making it more abrupt in the back of your throat. Soft consonants include “g,” “d,” and “b.” [4] X Research source So, words like “pug,” “loud,” and “cub,” should be pronounced like, respectively, “puk,” “lout,” and “cup.” Be aware that these consonant shifts can lead to confusion. For example, “loud” and “lout” are both English words but have very different meanings."
    },
    {
      "title": "Voice long vowel sounds high in the back of your mouth.",
      "content": "Voice long vowel sounds high in the back of your mouth. English speakers are used to pronouncing most long vowel sounds relatively low in their throats. This is most noticeable with the long “a” sound but applies to all long vowel sounds. When using a German accent, pronounce the long “a” more like a short “e.” To achieve this effect, slightly constrict your throat and pronounce the “a” sound from the back of your mouth. [5] X Research source For example, the word “cat” will sound like “kit” or “ket.” The proper noun “Kate” should be pronounced like “Ket.”"
    },
    {
      "title": "Enunciate the short “i” like an “e” sound.",
      "content": "Enunciate the short “i” like an “e” sound. Similarly to the long vowel sounds—and especially the long “a”—the short “i” sound should be pronounced from higher up in the back of your mouth. The intonation of this vowel sound also needs to become a little more nasal than in English. [6] X Research source For example, the words “winter” and “different” both use the short “i” sound. With a German accent, they would sound like “veenter” and “deeferent.”"
    },
    {
      "title": "Pronounce the double “oo” sound like a short “u.",
      "content": "Pronounce the double “oo” sound like a short “u. ” In a word like “book,” the English “oo” sound is pronounced from relatively deep in the throat. To change your speech for a German accent, tighten up this vowel sound so that it resembles a slightly nasal “u” sound. Try to keep your mouth closed relatively tightly when pronouncing this sound with a German accent. [7] X Research source For example, words like “wood,” “cook,” and “took” would be pronounced like “vud,” “cuk,” and “tuk,” respectively."
    },
    {
      "title": "Pronounce the English “th” sound like an “s” or “z.",
      "content": "Pronounce the English “th” sound like an “s” or “z. ” German language speakers never pronounce the “th” sound like English speakers do in a word like “this” or “that.” In German, the “th” sound becomes flattened into a less-complex “z” or “s” sound. You can choose between either of these sounds when modifying the “th” sound. Or, try out both and see which sounds better to you. [8] X Research source So, pronounce “this” like “zis” and pronounce the word “thick” like “sick” or “zick.”"
    },
    {
      "title": "Articulate the “ng” letter combination with a “k” sound.",
      "content": "Articulate the “ng” letter combination with a “k” sound. This occurs most frequently in the English present perfect tense, when many verbs take an “ing” ending. To pronounce these words with a German accent, drop the “ng” sound and replace it with a “k.” So, “thinking” and “wishing” become “thinkink” and “vishink.” [9] X Research source If it helps, think of it as swallowing or barely voicing the “ng” sound. You can also think of it as changing the soft “g” sound into a much harder “k” sound."
    },
    {
      "title": "Say the “dg” sound so that it resembles a “ch” sound.",
      "content": "Say the “dg” sound so that it resembles a “ch” sound. In English, “dg” makes a low “j” sound that occurs mostly in the back of the mouth. To take on a German accent, push the sound forward and up in your mouth so it’s pronounced with your tongue against the roof of your mouth. The resulting sound should resemble the English “ch” sound. [10] X Research source This sound commonly occurs in English words like “judge.” When you say this word with a German accent, it’ll sound like “chudge.” As another example, the word “German,” when spoken with a German accent, should sound like “cherman.”"
    }
  ]
}