{
  "url": "https://www.wikihow.com/Find-a-Good-Roommate",
  "title": "How to Find a Good Roommate",
  "steps": [
    {
      "title": "Advertise online.",
      "content": "Advertise online. Websites like Craigslist, Padmapper, and Roomie Match can help you find the right roommate for you. Such sites allow you to build a profile or post an ad seeking out a roommate to meet your needs. [1] X Research source Craigslist is one of the biggest and most commonly used sites. As it's free, it's a great means to reach a wide audience. Sites outside of Craigslist, such as roomates.com, often come with fees. However, they also allow you to create a more customized profile and search for roommates based on specific attributes."
    },
    {
      "title": "Ask friends for leads.",
      "content": "Ask friends for leads. As your friends know you well, let them know you're seeking a roommate. Let them know to pass on any leads to you. As your friends know your habits and lifestyle, they'll likely to be able to point you in the direction of a compatible match. [2] X Research source Remember that the qualities that make good friends are different from the ones that make good roommates. A disorganized party animal may be fun to hang out with, but might be hard to live with. On the other side of the coin, a quiet and organized person might get on your nerves if you're the type to have frequently have friends over late at night."
    },
    {
      "title": "Start looking early.",
      "content": "Start looking early. A bad roommate can make life incredibly stressful. The sooner you start looking for a roommate, the better. Start seeking out a roommate a month or two in advance. [3] X Research source"
    },
    {
      "title": "Provide as many details as possible.",
      "content": "Provide as many details as possible. Seemingly small details can make a big difference in attracting the right match. While writing your post, include as many details as possible about your lifestyle and habits. If you're seeking a roommate for an apartment you're currently living in, make sure to provide details about the apartment and neighborhood. [4] X Research source Include the basics, such as the size of the apartment. Then, list any appliances the apartment has and the feel of the neighborhood. Include details about any personal habits that may affect the living situation. For example, if you work night shifts, make sure you choose a roommate who's a sound sleeper and will not be bothered by you coming and going at odd hours."
    },
    {
      "title": "Share your interests in an ad.",
      "content": "Share your interests in an ad. While you don't need to be best friends with your roommate, it's always a perk to find someone you get along with. Include a little about yourself and your interests. This will help you attract a likeminded roommate. [5] X Research source For example, say something like, \"I love sports and always follow football season. I'm also into cooking and baking, so I'll be in the kitchen a lot.\""
    },
    {
      "title": "Meet up in person.",
      "content": "Meet up in person. Never agree to a living situation without meeting up in person first. You want to make sure there's good chemistry and the person doesn't seem unsafe or unfriendly. Meet up in a neutral location, like a coffee shop, and talk over your expectations for things like chores, bills, and so on. If you're showing your apartment, meet up at a neutral location first before bringing over the potential roommate. It's a good idea to have a friend or family member in the apartment with you for safety."
    },
    {
      "title": "Ask about a potential roommate's lifestyle.",
      "content": "Ask about a potential roommate's lifestyle. Some roommates simply aren't compatible. Think about your personal living habits and ask about the other person's habits. Make sure the two of you have a similar lifestyle so you won't clash too much. [6] X Research source Talk about your general lifestyle. Do you love loud music and having people over? If so, you may not hit it off with a quiet, introverted roommate. Hobbies and leisurely activities can also sometimes be an issue. For example, if your new roommate watches a lot of television, this could drive up the cable bill."
    },
    {
      "title": "Learn the person's cleaning habits.",
      "content": "Learn the person's cleaning habits. Chores are a common reason roommates fight, so make sure to ask your potential roomie whether they're a neat person. You should also confess to your own cleaning habits. If you occasionally let dishes sit in the sink overnight, for example, be upfront about this. [7] X Research source If you're visiting an apartment to potentially move into, pay attention to whether it's clean. If you notice a lot of dust, grime, and dirty dishes, this may not be the ideal place to live."
    },
    {
      "title": "Figure out why they're looking for a new place.",
      "content": "Figure out why they're looking for a new place. If you're having someone move in with you, ask them why they're looking for a new place. This can be a good way to identify red flags. If someone has a reasonable need to move, such as wanting to be closer to work, this is a good sign. However, people who cite things like roommate drama may be difficult to live with. [8] X Research source"
    },
    {
      "title": "Make sure they can cover costs.",
      "content": "Make sure they can cover costs. Asks about a potential roommate's income and make sure it exceeds your rent and bills. You don't want to be left lending your roommate money each month for rent. [9] X Research source In addition to a decent income, make sure their work is steady. If your roommate is working a temp job, for example, they may not be able to make rent in a few months."
    },
    {
      "title": "Check any references.",
      "content": "Check any references. It's completely appropriate to ask a roommate for references. Ask for the number of their old landlords and a few previous roommates. Call these people up to make sure your roommate was respectful and paid any bills in a timely fashion. [10] X Research source"
    },
    {
      "title": "Do a background check.",
      "content": "Do a background check. If you haven't known someone for awhile, it's always good to double check that they're safe. Ask to run a basic credit check and criminal background check, which can easily be done online. You can also have a potential roommate get their credit checked and present you with the paperwork. [11] X Research source If someone objects strongly to a background check, this may be a red flag."
    },
    {
      "title": "Choose someone similar to you.",
      "content": "Choose someone similar to you. If you have a handful of good candidates, pick the roommate most similar to you. Choose someone who's lifestyle, cleaning habits, and personality closely mimic your own. Roommates with compatible personalities tend to get along the easiest. [12] X Research source"
    },
    {
      "title": "Get your agreement in writing.",
      "content": "Get your agreement in writing. When signing up to live with someone, get everything in writing. In addition to financial responsibilities regarding rent and bills, have loose agreements about having friends over, parties, and chores. Having a roommate contract to refer to can prevent arguments down the road. [13] X Research source"
    }
  ]
}