{
  "url": "https://www.wikihow.com/Escape-from-Handcuffs",
  "title": "How to Escape from Handcuffs",
  "steps": [
    {
      "title": "Find a bobby pin, paper clip, or piece of wire.",
      "content": "Find a bobby pin, paper clip, or piece of wire. To create a makeshift key, you will need a thin, bendable piece of metal. Look around you to locate a bobby pin, paper clip, or piece of wire. Be sure that the wire is strong enough to act as a key. If you are using a bobby pin, be sure to remove the plastic tip if there is one."
    },
    {
      "title": "Straighten out the metal.",
      "content": "Straighten out the metal. If you are working with a bobby pin, use your thumb and forefinger to pull apart its two sides to straighten it out. If you are using a paper clip, brace the middle between your fingers on one hand and use the other hand to pull it open to make a straight piece of wire. Uncurl or unbend any other type of wire you may be using."
    },
    {
      "title": "Bend the tip of your bobby pin, paper clip, or wire.",
      "content": "Bend the tip of your bobby pin, paper clip, or wire. Hold the end of your strand of metal between your two index fingers. Position one finger about a quarter of an inch (approximately 0.6 cm) down from the tip. Use the other finger to bend the top of the metal into a 90 degree angle. [1] X Research source The bent tip of your makeshift key should only fit halfway into the handcuff lock."
    },
    {
      "title": "Place the tip into the keyhole and bend the metal backwards.",
      "content": "Place the tip into the keyhole and bend the metal backwards. Using your fingers, feel around to find the keyhole on the handcuffs. Direct the tip of your makeshift key inside of it. Once you've inserted the tip all the way into the lock, bend your key backwards to make another 90 degree angle. [2] X Research source Remove the key to feel it. The end of your key should now be in a sort of \"Z\" shape."
    },
    {
      "title": "Insert the \"key\" in the hole.",
      "content": "Insert the \"key\" in the hole. Find the hole again with your fingers. Wiggle the bent part into the hole so that it points toward the locking arm. It should be at a 90-degree angle to the keyhole. [3] X Research source"
    },
    {
      "title": "Twist the key in different directions.",
      "content": "Twist the key in different directions. Twist the key in different directions. Eventually the key should should lift the locking device inside and click the cuffs open. Be patient during this process as it may take some time. [4] X Research source"
    },
    {
      "title": "Unlock an extra lock for double-lock handcuffs.",
      "content": "Unlock an extra lock for double-lock handcuffs. Double-lock handcuffs are essentially regular handcuffs with an extra locking mechanism for added security. To get out of these, inset your makeshift key into the lock, pointing away from the center of the handcuffs. Twist the key until you feel a slight click, then remove the key and re-insert it the other way to unlock the basic locking mechanism."
    },
    {
      "title": "Find a flat piece of metal.",
      "content": "Find a flat piece of metal. Find a piece of metal that is about as thin as a credit card. This \"shim\" should be narrow enough to fit into the locking mechanism on the cuffs. The metal clip on a pen could serve as a \"shim,\" for instance. [5] X Research source"
    },
    {
      "title": "Insert the shim between the locking mechanism and the teeth.",
      "content": "Insert the shim between the locking mechanism and the teeth. Slide your shim up into the locking mechanism so that it runs along the teeth. You're essentially sticking the shim into the cuff along the rim. If your hands are behind your back, feel around slowly to locate this point and insert the shim carefully. [6] X Research source"
    },
    {
      "title": "Tighten the cuff and push the shim.",
      "content": "Tighten the cuff and push the shim. With the shim in place, tighten the cuff one notch. Push the shim forward as you tighten the cuff. Note that if you fail to unlock the handcuffs this way, you will end up restrained more tightly than before. [7] X Research source If you are successful, the handcuffs should click open."
    },
    {
      "title": "Use your teeth to tighten the zip tie, then break it.",
      "content": "Use your teeth to tighten the zip tie, then break it. Brace the loose end of the zip tie between your teeth. Pull the strand of plastic upwards towards you, tightening the tie. As you pull it tighter, try to break the tie apart with your wrists. [8] X Research source The tightness should create a tension in the tie that makes it easier to break."
    },
    {
      "title": "Use a shim to override the locking mechanism.",
      "content": "Use a shim to override the locking mechanism. Insert a small object into the locking bar of the zip tie. Once the locking bar is separated from the locks of the zip tie, you should be able to remove the tie from the locking mechanism. Try to use your fingernail, a small pin, a credit card, or anything else you can find. [9] X Research source The locking mechanism is essentially a small notch that digs between the tracks of the zip tie as you tighten it, keeping it secured."
    },
    {
      "title": "Use your shoelaces to \"saw\" through the zip tie.",
      "content": "Use your shoelaces to \"saw\" through the zip tie. If your hands are tied in front of you and you are wearing shoes with laces, reach down and untie them. Use your fingers and teeth to thread one shoelace though the zip tie. Attach it with a knot to a shoelace from your other foot so they connect between your wrist and the tie. Lift up your feet and kick your feet back and forth until the lace \"saws\" through the zip tie. [10] X Research source"
    }
  ]
}