{
  "url": "https://www.wikihow.com/Download-a-Discord-User%27s-Profile-Picture-Using-Chrome-on-PC-or-Mac",
  "title": "How to Download a Discord User's Profile Picture Using Chrome on PC or Mac",
  "steps": [
    {
      "title": "Log in to Discord on https://discord.com on your computer.",
      "content": "Log in to Discord on https://discord.com on your computer. Chrome works best for this but you can use other browsers, too."
    },
    {
      "title": "Access the user's profile.",
      "content": "Access the user's profile. You can do this in two ways. Either right-click their profile picture and select Profile or click their profile picture and then click it again when the Roles menu comes up."
    },
    {
      "title": "Open Inspect Element.",
      "content": "Open Inspect Element. Use the shortcut ⌘ Cmd + ⇧ Shift + C or Ctrl + ⇧ Shift + C , or to access it manually, click the three vertical dots in the top right corner and select More Tools . A drop-down menu will appear. On a Mac, you can also click View in the top left and select Developer Tools . Another drop-down menu will appear."
    },
    {
      "title": "Switch to the tool with a cursor inside of a square.",
      "content": "Switch to the tool with a cursor inside of a square. When you hover over it, it will say \"Select an element in the page to inspect it\". When the box and cursor turn blue, it's ready to use."
    },
    {
      "title": "Place the cursor on the profile picture and click.",
      "content": "Place the cursor on the profile picture and click. When you do this, Inspect Element will switch to that element and highlight an image address."
    },
    {
      "title": "Copy the image address.",
      "content": "Copy the image address. Right-click the highlighted selection and click Copy . Select Copy Element from the drop-down menu. On a Mac, you can also click Edit in the top left and select Copy . Choose Copy from the options given."
    },
    {
      "title": "Paste the image link into Google Chrome and cut all text before https.",
      "content": "Paste the image link into Google Chrome and cut all text before https. Highlight everything before https (the text surrounding it will be url(\"https:) and right-click. Choose Cut from the options given or press the Del key. You can also highlight it and choose Edit > Cut on a Mac."
    },
    {
      "title": "Press enter and check if the image is correct.",
      "content": "Press enter and check if the image is correct. If you've done the process correctly, it will show up with a small version of the profile picture with black borders. If not, it will search the link in Google with normal results."
    },
    {
      "title": "Save the image to your PC or Mac.",
      "content": "Save the image to your PC or Mac. Right-click the profile picture that shows up and select Save Image As... . You can then name the file, where you want it to be located, and press Save . The image should be on your PC or Mac now!"
    }
  ]
}