{
  "url": "https://www.wikihow.com/Cover-Up-a-Bad-Wall",
  "title": "How to Cover Up a Bad Wall",
  "steps": [
    {
      "title": "Hang temporary wallpaper.",
      "content": "Hang temporary wallpaper. If you aren't allowed to permanently alter the wall or don't want to spend time hanging normal wallpaper, consider covering the bad wall with adhesive renter's wallpaper instead. [1] X Research source The adhesive backing is roughly as strong as the glue on the back of a sticky note, if not a little stronger, so it's easy to remove. If you remove it carefully, you can often reuse it, too. If you need to cover the entire wall, measure the dimensions of the space and buy a large enough roll to fit your needs. This can be an expensive option, though, so you can also use smaller strips to cover small patches of imperfections if doing so would suit your needs."
    },
    {
      "title": "Try peel-and-stick tiles.",
      "content": "Try peel-and-stick tiles. Like adhesive wallpaper, adhesive tiles are a good way to mimic the look of the real thing without committing to anything more permanent. You can use this to cover a large wall, but it makes an especially useful option for small wall spaces like kitchen backsplashes. These tiles are also fairly thin, so you should have no difficulty trimming them down to better cover the size and dimensions of your space. Since the outer surface is smooth and hard, you should be able to keep them clean with a soft cloth. Like adhesive wallpaper, peel-and-stick tiles are relatively easy to remove. If any residue gets left behind, you should be able to clean it off with a standard household cleanser."
    },
    {
      "title": "Create patterns with tape.",
      "content": "Create patterns with tape. If you're up to a challenge, use colored or patterned tape to create simple patterns over the wall. You can plan out the pattern so that the tape falls out over the imperfections you want to hide. [2] X Research source Duct tape should adhere well and is available in a variety of styles, giving you more options to work with. Consider applying it in diamond patches, stripes, or zigzags."
    },
    {
      "title": "Purchase vinyl decals.",
      "content": "Purchase vinyl decals. Vinyl décor decals are essentially large stickers designed for use on painted walls. Choose a design you like and simply adhere it directly over the spot you want to cover up. Note that this may work best when you're trying to cover simple flaws like stains or ink marks . Strange wall textures can still show through from the front of the decal after you apply it."
    },
    {
      "title": "Apply drywall mud.",
      "content": "Apply drywall mud. Drywall mud is fairly easy to work with, and you can give the mud an interesting texture after putting it up to hide any imperfections in your wall. [3] X Research source Grab a bucket of ready-made drywall mud and apply it evenly over the surface of the wall with a 6-inch (15-cm) putty knife. The coat should be between 1/8 and 1/4 inch (3 to 6 mm) thick, depending on the severity of damage. You can apply texture in a variety of ways. Swipe over it with a whisk brush to create a woven appearance, draw overlapping spirals into it using a thick-bristled brush, lightly scuff the mud with a trowel to create the popular \"skip trowel\" look. Give the mud 24 hours to dry, then apply paint to the wall as desired. You can also apply a glaze over the paint after it dries to further enhance the texture."
    },
    {
      "title": "Use textured wallpaper.",
      "content": "Use textured wallpaper. Plain wallpaper may not be enough to hide damaged, uneven wall surfaces, but textured wallpaper can mask those imperfections more effectively. [4] X Research source Measure the dimensions of your wall and buy enough textured wallpaper to cover the entire surface. Depending on your needs, you can either buy it in rolls or large tiles. Check the manufacturer's instructions to determine how to hang it. Many types have dried glue on the back of each piece. In these instances, you can wet the paper with plain water and paste it directly to the wall. Most textured wallpaper is also paintable, so if desired, you can apply a coat of standard wall paint over the surface of the wallpaper after it dries."
    },
    {
      "title": "Create a faux painting.",
      "content": "Create a faux painting. Instead of trying to hide any imperfections in your wall, work with them by creating a large mural incorporating the uneven elements. To deal with discoloration, consider layering coordinating colors over the space to create a scenic view—the night sky, the beach, the mountains, the grasslands, or any other appropriate option. You can mask minor imperfections in the texture of the wall but sponging the paint on or by using other techniques that add texture to paint . If you're feeling bold, you can use this technique to work with cracks in the wall, too. For instance, the right crack can look like the branch of a tree; consider painting a tree trunk nearby and adding leaves, birds, and similar details around it. If the marks on the wall are small enough, you can cover them with artwork. [5] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020."
    },
    {
      "title": "Lay brick.",
      "content": "Lay brick. It can be somewhat time-consuming, but applying brick over a bad wall can create an intriguing accent. Since brick is such a sturdy material, it should be able to hide everything from discoloration to large cracks. You can technically use standard bricks to cover the wall, but thinner interior bricks will usually fit the space better. Essentially, you'll be building a brick wall over the wall you already have. Similarly, you can lay tiles over the wall to cover up imperfections. This can work especially well in rooms that conventional feature tile surfaces, like bathrooms, kitchens, and laundry rooms."
    },
    {
      "title": "Put up shelves.",
      "content": "Put up shelves. Push a large bookshelf in front of the wall if you need to hide a large space or hang smaller shelves directly onto the wall if you only need to cover up a small patch. You can use one large bookshelf to cover one panel of the wall, but if you want to cover the entire wall, consider pushing back-to-back bookcases up against it. When using smaller shelves, place the shelf directly beneath the imperfection you want to hide. Stack decorative elements on top of the shelf in a manner that allows you to cover up the flaw behind them."
    },
    {
      "title": "Find appealing artwork.",
      "content": "Find appealing artwork. This is classic way to cover up patches of bad wall. Find a painting, photograph, or other piece of artwork large enough to cover the imperfect area, then hang it directly over the spot you need to hide. [6] X Expert Source Kanika Khurana Interior Designer Expert Interview. 9 October 2020. You can purchase duplicate prints of classic artwork, frame a poster, or commission a piece from a local artist. If you aren't able to find artwork you like, consider making your own. Buy several canvases that are large enough to cover the area and paint them as desired."
    },
    {
      "title": "Cover imperfections with a picture collage.",
      "content": "Cover imperfections with a picture collage. For walls with larger flawed patches, you could try creating a collage of favorite pictures. These pictures can be framed or unframed; both options will work, but they'll each create different effects. [7] X Research source The picture collage can be as small or large as you need it to be, and you can use either personal or professional pictures. Try to plan out the collage so that there are pictures directly over any imperfection you need to hide. Hanging framed pictures will create a more polished, intentional look. Unframed pictures, on the other hand, create an artsy, casual appearance. Regardless of which option you choose, try to use photographs printed on high-quality, low-gloss photo paper to minimize glare."
    },
    {
      "title": "Set up mirrors.",
      "content": "Set up mirrors. You can hang one mirror to cover one small imperfection or create a collage of mirrors to hide a larger area. Mirrors also have the added benefit of making the room look bigger. When hanging one mirror, consider the dimensions of the space you need to cover. A full-length mirror can cover a tall patch, but if you need to cover a wide space, you can make the same mirror work by simply turning it on its side. When hanging multiple mirrors, choose a variety of shapes and sizes and hang them in an asymmetrical manner. Make sure to place a mirror over any hole or imperfection that needs covering, though."
    },
    {
      "title": "Hang curtains.",
      "content": "Hang curtains. You might think of using curtains to cover a bad wall with a window placed in it, but you can still use this fix even if no windows are involved. When you're covering both the wall and the window, choose curtains that are long enough to cover the entire damaged space and hang them high above the top of the window. You can also hang curtains in between separate windows if that portion of the wall needs hiding. Even if you aren't covering a window, you can still attach a standard curtain rod to the top of the wall near the ceiling. Hang heavy fabric curtains from the rod, making sure they hang low enough to brush the floor. Doing it this way makes it look as though the curtains hide a window, so they shouldn't seem too misplaced."
    },
    {
      "title": "Staple fabric over the area.",
      "content": "Staple fabric over the area. Fabric is cheaper than wallpaper and it can hide more imperfections than plain paint. It's also fairly easy to hang up and take down, so you won't lose much if you change your mind about it later. Home decor or upholstery fabric works best since it's heavy enough to keep its form when hung vertically, but otherwise, you can choose any pattern, color, or style you want. Fold and press any raw edges to the raw side of the fabric, then stretch it out over your wall and staple it in place with a standard staple gun. Work from top to bottom for best results. Alternatively, you can soak the material in fabric starch and stick it directly to the wall. When the starch dries, it should hold the fabric in place. If you only want to add a fabric accent, consider covering appropriately sized foam boards with your material instead of placing the fabric directly on your wall. When finished, hang these covered boards over the area you want to hide."
    },
    {
      "title": "Find a tapestry.",
      "content": "Find a tapestry. Tapestries might seems like a dated solution, but nowadays, you can find tapestries that are actually designed to fit into contemporary spaces. Unlike plain fabric, tapestries are specially woven for the purpose of hanging, so the fibers and the design shouldn't lose integrity once you hang the piece on the wall. Tapestries come in a variety of sizes, though, so you'll need to make sure that the one you buy is the right size for your wall space."
    }
  ]
}