{
  "url": "https://www.wikihow.com/Deter-Possums-from-Your-Garden",
  "title": "How to Deter Possums from Your Garden",
  "steps": [
    {
      "title": "Know what to protect.",
      "content": "Know what to protect. Possums seem to be fond of new growth on deciduous vines, fruit on fruit trees, and some of the new growth on pruned evergreens. Possums damage the plants when they eat the new growth, so this needs to be prevented. Possums may remove all of the buds, thereby weakening the plant, creating bare patches, and making it easier for plant diseases to take hold. [3] X Research source Keep this in mind when planting new plants in your yard or when planting a garden. If you plant things a possum doesn't like, such as prickly and smelly plants like a tea tree or geraniums for example, they are less likely to be destroyed."
    },
    {
      "title": "Protect individual fruits and vegetables.",
      "content": "Protect individual fruits and vegetables. For example, there are cloth bags that are made to cover individual fruits in a tree. Each one can be covered separately. [4] X Research source This will stop the possums from getting to the fruit and does not interfere with the growth of the fruit. You can also use old plastic plant pots with a slit down the side to protect individual fruits or vegetables. Place the fruit inside the pot, so that it is mostly covered but can still grow."
    },
    {
      "title": "Enclose garden beds.",
      "content": "Enclose garden beds. Instead of keeping possums out of your yard, you can just try to keep them out of specific garden beds. The best way to do this is to create a full enclosure out of chicken wire. This may make tending your garden a little more difficult but it will assure that your plants survive."
    },
    {
      "title": "Block all entry points.",
      "content": "Block all entry points. Possums may make their way into your eaves or other access points on your house or shed. Possums trying to get into your garden shed or house eaves can be deterred by covering openings with permanent covers, such as pieces of wood, or by using anti-bird netting over any holes or entrance points. Just make sure that the possums are not inside the shed or eaves when you cover them, as you could trap them inside. If you're not sure how the possums are getting in, patrol the area at dusk and watch for possums leaving their den."
    },
    {
      "title": "Make it hard for possums to climb structures or plants.",
      "content": "Make it hard for possums to climb structures or plants. If the possum is using a structure to get to the plant, make the structure difficult to climb. Wrap galvanized iron sheets around posts and over beams of structures, such as pergolas. This will stop the possum from being able to grip the surface with its claws. This also requires ensuring that there are no trees or shrubs next to the structure that allow the possum to ease itself down from. You can also use a plastic garbage can with the bottom cut off and a slit up the side. Put it around the trunk of a tree so that the possum is unable to climb up the tree. You can wrap sheet metal around the trunk of the tree to make it difficult to climb. You can also place thick netting around the trunk. The netting will catch the possum's feet and discourage them from climbing."
    },
    {
      "title": "Trim trees that are being eaten.",
      "content": "Trim trees that are being eaten. If a possum is eating the new growth off a tree, you need to figure out how to block its access to the tree. Branches should be far enough away from fences and structures so that a possum can't jump to them. [5] X Research source This, in combination with blocking access to climbing the trunk of the tree, will give you the best chance of saving your tree from being decimated. The good news is that while possums can jump, they can't jump very far. An agile, young possum can jump approximately 2.5 meters from a fixed, stable base but less than 2 meters from a swaying tree branch. This means that trimming your trees so they are more than 2 meters from your garden fence or other structure should be sufficient."
    },
    {
      "title": "Put netting on fruit bushes and trees.",
      "content": "Put netting on fruit bushes and trees. In particular, you should place netting over these plants while they are sending out new growth shoots or are bearing fruit. The netting will not keep possums out completely but they should make it difficult enough for the possums that much of the fruit will be saved. Also remove any fallen fruit below fruit trees or bushes. Fallen fruit will attract possums to the area, so keep it to a minimum if you can."
    },
    {
      "title": "Place a greased PVC pipe on top of your fence.",
      "content": "Place a greased PVC pipe on top of your fence. This method only works if your garden is closed in with fencing, as it stops possums from climbing over the fence. It will take about one day of your time to install this protection. Attach a large PVC pipe running horizontally across the top of all of the fencing. This will be hard for the possum to grip onto. Then apply non-toxic grease to the PVC pipe. When a possum now tries to get into your garden, you should find that it cannot get a secure grip or footing because of a the grease on the drum. This causes the animal to fall off without injury. Make sure that there are no holes or other points for the possum to cross the fence."
    },
    {
      "title": "Look into commercial possum sprays.",
      "content": "Look into commercial possum sprays. Nurseries, supermarkets, and some hardware stores stock a range of possum-deterrent sprays that you can use. Remember to follow the instructions on the packaging so that your plants are not affected and so that possums the are not injured."
    },
    {
      "title": "Make and apply a quassia chip spray.",
      "content": "Make and apply a quassia chip spray. Quassia is a small branching tree that contains substances that deter the possum from wanting to be around it. [6] X Research source Make a spray of 100g quassia chips to 2 liters (0.5 US gal) of water. Heat for one hour, then strain. Add one tablespoon detergent. Dilute 1 part quassia solution to 4 parts water and spray on foliage. Most homemade sprays and applications need to be reapplied following rain. They should be reapplied frequently anyway, for full effectiveness."
    },
    {
      "title": "Use household items to deter possums.",
      "content": "Use household items to deter possums. These will require constant reapplication to be effective in the long-term. Some things that you can try include: Brew up some lapsang souchong tea. Spray this over the affected plants. Possums don't like it! Spread blood and bone around the vulnerable plants. Use mothball flakes on beams, and around the base of plants. Place in pantyhose and hang from foliage. Apply Indonesian fish sauce. Combine one tablespoon of sauce in one litre of water and then sprayed on foliage. Make a garlic spray. Place 2 tablespoons of freshly crushed garlic into one litre of hot water. Leave overnight, strain, then spray on foliage. Spray laundry detergent full strength onto foliage. Tabasco sauce. Use this full strength. It can painted or sprayed onto foliage. Note that this can badly damage some plants, so do your research before applying this sauce. Strong-smelling herbs such as sage, rosemary, or oregano may deter possums, especially when mixed with spicy chili pepper. Blend to a paste and spread around affected plants."
    },
    {
      "title": "Surround your garden with predator urine.",
      "content": "Surround your garden with predator urine. Urine from male foxes, weasels, and likely other predators has repelled possums in experiments. [7] X Research source That said, it may not be completely reliable, and it could attract other animals. [8] X Research source Look for predator urine at a hardware store or plant nursery, and follow the label instructions to distribute it in a perimeter around your garden. [9] X Research source Kirmani SN, Banks PB, McArthur C. 2010 Integrating the costs of plant toxins and predation risk in foraging decisions of a mammalian herbivore. Oecologia 164 349–356 Carpet Python faeces are an effective possum deterrent, if available. Pythons are possum predators. Some homeowners ring their garden with human hair to deter pests, but this is unproven. [10] X Research source Consider trying it the next time you have a haircut, scattering the trimmed hairs thinly over the surface."
    },
    {
      "title": "Put up noisy deterrents.",
      "content": "Put up noisy deterrents. Wind chimes, noisy bells, or plastic bottles cut in half can catch the wind and make enough noise to keep some pests away. This isn't foolproof, but hopefully your fruit trees will be ready to harvest before the possums learn to ignore the noise. You can also buy commercial ultrasonic pest deterrents, outside the range of human hearing. Dogs, especially outdoor dogs, will chase away possums, and their barking will scare them off."
    },
    {
      "title": "Put up scarecrows",
      "content": "Put up scarecrows . You can try a traditional scarecrow, or put up fake birds such as a tennis ball with feathers glued onto it. Again, the effectiveness of this deterrent varies from animal to animal, and may lessen over time. Hanging mirrors near the scarecrow may amplify the effect."
    },
    {
      "title": "Plant food for possums.",
      "content": "Plant food for possums. You may be able to steer a possum's attention away from one plant to another. Put plants that possums like to eat, such as eucalyptus, at the edge of your garden. This may keep them occupied enough to keep them away from tender shoots and new growth in your garden."
    },
    {
      "title": "Trap possums humanely.",
      "content": "Trap possums humanely. In New Zealand, possums are considered an invasive species. You should trap them and call animal control for removal. [11] X Research source That said, possums are protected in Australia. The South Australian government only recommends (humane) trapping when a possum is living in your building. Even then, it may cause the possum less stress to lure it out, then block its access For example, you could build a nesting box, place some fruit in it, and then place it near where the possum is dwelling. This should lure the possum into the nesting box. If you do use a live trap, a small amount of honey works well as bait. Use the trap to transfer it out of the building, but not outside of the area. Possums almost always die when relocated."
    },
    {
      "title": "Understand that possums are protected in Australia but not in New Zealand.",
      "content": "Understand that possums are protected in Australia but not in New Zealand. Possums may limit the kinds of plants you can grow in your garden but possums need human help to survive. If you live in Australia, you can help offset the destruction of their natural environment by creating a good location for them to live, including nesting boxes and attractive vegetation. Possums are considered invasive in New Zealand. Call animal control or the Department of Conservation for assistance in removing them."
    }
  ]
}