{
  "url": "https://www.wikihow.com/Feed-a-Pregnant-or-Nursing-Cat",
  "title": "How to Feed a Pregnant or Nursing Cat",
  "steps": [
    {
      "title": "Switch your cat to a wet kitten food.",
      "content": "Switch your cat to a wet kitten food. Towards the midpoint of your cat’s pregnancy, begin switching her onto a high-quality wet kitten food. Kitten food contains higher percentages of nutrients and vitamins than do adult cat foods, and will provide the queen with more of the protein and calories she needs during pregnancy. [1] X Research source Keep in mind that your cat’s food consumption will increase during pregnancy. She’ll usually eat about 50% more than she would when not pregnant. A cat’s pregnancy typically lasts from 58–70 days. Plan to switch your queen to the nutritious kitten food by about the 5th week (35 days)."
    },
    {
      "title": "Mix protein into your cat’s normal food.",
      "content": "Mix protein into your cat’s normal food. During the early and middle stages of pregnancy, your cat can keep primarily eating their typical food. However, you should mix in added protein to help facilitate healthy kitten growth. Do this by boiling small pieces of chicken, beef, fish, or egg and adding them to your cat’s dry or wet food. [2] X Research source Cats can be picky eaters, and pregnant ones especially so. Try different proteins until you find one your cat prefers. The added protein will also give the mother cat strength and energy as her body grows the kittens. Throughout the pregnancy and nursing period, the mother will need plenty of protein."
    },
    {
      "title": "Give your cat constant access to food.",
      "content": "Give your cat constant access to food. As the pregnancy progresses and the litter of kittens take up more space inside of her, your queen will eat smaller and smaller meals, but her meals will also become more frequent. So, make sure that food is always available for your cat when she’s hungry. Rather than feeding her at specific meal times, you can leave food sitting out. [3] X Research source Wet food may go bad if left out too long. You can avoid this problem by putting out a small portion of wet food and waiting until your cat eats it, then putting out more."
    },
    {
      "title": "Feed your cat kitten food three times daily after she gives birth.",
      "content": "Feed your cat kitten food three times daily after she gives birth. The queen will likely be exhausted and have low energy—and no appetite—for the first few days after giving birth. Her appetite will soon return, though. Continue to feed her the high-quality kitten food, and you can continue to mix in additional protein. Give the cat a dish of this food three times daily, spaced at regular intervals. [4] X Research source If you notice the cat continuing to gain weight after giving birth, you may need to cut back on the food. Do not overfeed your cat to the point of obesity."
    },
    {
      "title": "Give your cat a food high in calcium.",
      "content": "Give your cat a food high in calcium. It’s important that your mother cat consumes food containing plenty of calcium shortly after giving birth. Calcium will increase the mother’s milk production, which in turn will encourage bone growth in the developing kittens. [5] X Research source Check the nutritional information on canned cat foods to find one that is high in calcium. Alternately, you can give your mother cat calcium supplements under a veterinarian’s supervision. Check with your veterinarian before you start giving your cat calcium supplements. This is not an uncommon procedure, and will ensure that your mother cat is consuming enough calcium and passing it on to her kittens. Calcium supplements should be available at a local pet-food store."
    },
    {
      "title": "Transition your cat back to adult food once the kittens have weaned.",
      "content": "Transition your cat back to adult food once the kittens have weaned. While she is lactating and feeding her kittens with milk, the mother cat will need the protein and nutrients that the kitten food offers her. [6] X Research source However, once the kittens have weaned (usually around 6–10 weeks after birth), you can transition the mother cat back to an adult food. [7] X Research source Do this by mixing a small amount of the adult food in with the kitten food. Increase the percentage of adult food over one week, until the cat has fully transitioned to adult food. You can also re-introduce dry food into the cat’s diet at this point, and do not need to feed her extra protein."
    },
    {
      "title": "Observe your cat to see if she’s in heat.",
      "content": "Observe your cat to see if she’s in heat. Housecats typically go into heat sometime between late spring and early fall, roughly from March to September. While in heat, a female cat will exhibit behaviors including increased displays of affection, increased restlessness and hunger, and howling to attract male cats. The cat will remain in heat for about 10 to 14 days. [8] X Research source If your female cat is in heat and is allowed to go outside, she’ll attempt to attract and mate with male cats. Naturally, there is a high chance that she’ll become pregnant because cats are spontaneous ovulators."
    },
    {
      "title": "Examine your cat’s weight and nipples.",
      "content": "Examine your cat’s weight and nipples. If your cat is pregnant, she’ll begin to gain weight rapidly. Even an already-overweight cat will put on a noticeable amount of weight if she becomes pregnant. When a female cat becomes pregnant, her nipples will increase in size and become noticeably darker in color. If you notice your cat gaining weight and its nipples darkening, it’s almost certainly pregnant. [9] X Research source This change in the nipple size and color happens during the third week of pregnancy (about 21 days)."
    },
    {
      "title": "Take your cat to the veterinarian.",
      "content": "Take your cat to the veterinarian. If you have begun noticing signs of pregnancy, schedule an appointment for your cat to see a veterinarian. The vet will be able to confirm the pregnancy (most likely with an ultrasound), and will advise you about any potential health complications that could result. [10] X Research source This would also be a good time to ask your vet about your pregnant cat’s diet, and to ask their advice about how to keep your pregnant and nursing cat well nourished."
    }
  ]
}