{
  "url": "https://www.wikihow.com/Download-Free-Games-on-Nintendo-DS",
  "title": "How to Download Free Games on Nintendo DS",
  "steps": [
    {
      "title": "Buy an R4 SDHC card.",
      "content": "Buy an R4 SDHC card. An R4 SDHC card is the substitute for a game card when loading your own games on a DS. This is what you'll plug into the DS in order to load your downloaded games. [1] X Research source The easiest way to find an R4 SDHC card that will work with your DS is by typing r4 sdhc nintendo ds into an online store's search."
    },
    {
      "title": "Buy a microSD card.",
      "content": "Buy a microSD card. The microSD card is actually where the games will be stored, so try to find a two-gigabyte (2 GB) card if possible. [2] X Research source You can find microSD cards online as well as in most tech stores. Most microSD cards come with an adapter that allows you to open the SD card on a computer. If your selected microSD card doesn't include an adapter, you'll need to buy one as well."
    },
    {
      "title": "Plug the microSD card into the included adapter card.",
      "content": "Plug the microSD card into the included adapter card. At the top of the microSD's adapter card, there should be a small slot into which you'll insert the microSD card. [3] X Research source The microSD card only fits one way, so don't force it. If the microSD card won't fit into the adapter card, flip the microSD card over and try again."
    },
    {
      "title": "Plug the microSD card's adapter card into your computer.",
      "content": "Plug the microSD card's adapter card into your computer. There should be a wide, flat slot on the side of your computer (laptop) or on the CPU box (desktop) into which the adapter card fits. If you use a Mac, you may need a USB-C to SD card adapter."
    },
    {
      "title": "Format the card",
      "content": "Format the card . Before you can add files to the microSD card, you'll need to make sure that the card's format is correct: [4] X Research source On Windows , select FAT32 as the file system. On Mac , select MS-DOS (FAT) as the file system."
    },
    {
      "title": "Download a ROM for your selected game.",
      "content": "Download a ROM for your selected game. A ROM is a game file; by placing these game files on your SD card and then using the card with your DS, you'll be able to select games directly off of the card. The easiest way to download ROMs is by searching for your game title followed by \"ds rom\", selecting a reputable site , and clicking the \"Download\" button or link. Keep in mind that downloading ROMs for games that you don't already own is piracy, which is illegal in most places. Make sure that you only download from sites that you can trust based on user feedback and reviews. You don't want to accidentally download a virus."
    },
    {
      "title": "Wait for your ROM to finish downloading.",
      "content": "Wait for your ROM to finish downloading. Once the ROM for your game has finished downloading onto your computer, you can proceed with adding the ROM to your microSD on a Windows or Mac computer."
    },
    {
      "title": "Make sure that the microSD card is plugged in.",
      "content": "Make sure that the microSD card is plugged in. If you unplugged the adapter card (or the microSD card from the adapter card) from your computer, re-plug in the card before continuing. [5] X Research source"
    },
    {
      "title": "Open Start .",
      "content": "Open Start . Click the Windows logo in the bottom-left corner of the screen."
    },
    {
      "title": "Open File Explorer .",
      "content": "Open File Explorer . Click the folder-shaped icon in the lower-left side of the window."
    },
    {
      "title": "Go to the downloaded ROM's location.",
      "content": "Go to the downloaded ROM's location. On the left side of the File Explorer window, click the folder to which your ROM was downloaded. For example, if your downloaded files normally go to the Downloads folder, you'd click Downloads here."
    },
    {
      "title": "Select the ROM.",
      "content": "Select the ROM. Click the ROM file that you just downloaded."
    },
    {
      "title": "Copy the ROM.",
      "content": "Copy the ROM. Press Ctrl + C to copy the ROM."
    },
    {
      "title": "Select your SD card's folder.",
      "content": "Select your SD card's folder. Click your SD card's name in the lower-left side of the File Explorer window. [6] X Research source You may have to scroll down to find the SD card. Alternatively, you can click the This PC folder and then double-click your SD card's name under the \"Devices and drives\" heading."
    },
    {
      "title": "Paste in the ROM.",
      "content": "Paste in the ROM. Click a blank space in the SD card's window, then press Ctrl + V to paste in the ROM. You should see the ROM's file icon appear in the window. [7] X Research source"
    },
    {
      "title": "Eject the SD card.",
      "content": "Eject the SD card. Click the flash drive-shaped icon in the bottom-right corner of the screen, then click the Eject option in the pop-up menu. Once you receive a notification, you can physically remove the SD card from your computer. You may first have to click ^ in the lower-right corner of the screen to see the flash drive icon."
    },
    {
      "title": "Make sure that the microSD card is plugged in.",
      "content": "Make sure that the microSD card is plugged in. If you unplugged the adapter card (or the microSD card from the adapter card) from your computer, re-plug in the card before continuing."
    },
    {
      "title": "Open Finder.",
      "content": "Open Finder. Click the blue, face-like app icon in your Mac's Dock. [8] X Research source"
    },
    {
      "title": "Go to the downloaded ROM's location.",
      "content": "Go to the downloaded ROM's location. On the left side of the Finder window, click the folder to which your ROM folder was downloaded. For most browsers, the default download location is the Downloads folder."
    },
    {
      "title": "Select your ROM.",
      "content": "Select your ROM. Find the ROM file and click it."
    },
    {
      "title": "Copy the ROM.",
      "content": "Copy the ROM. Press ⌘ Command + C to do so. [9] X Research source"
    },
    {
      "title": "Click your SD card's name.",
      "content": "Click your SD card's name. In the lower-left side of the Finder window, you should see a \"Devices\" heading, under which your SD card should be listed. Clicking this opens the SD card's window."
    },
    {
      "title": "Paste in your ROM file.",
      "content": "Paste in your ROM file. Click the SD card window, then press ⌘ Command + V . You should see the ROM file appear in the window. [10] X Research source"
    },
    {
      "title": "Eject the SD card.",
      "content": "Eject the SD card. Click the triangle-shaped \"Eject\" icon to the right of the SD card's name in the Finder, then remove the card from your Mac when prompted."
    },
    {
      "title": "Plug the microSD card into the R4 card.",
      "content": "Plug the microSD card into the R4 card. There should be a small slot at the top of the R4 card into which the microSD card fits. [11] X Research source As with the microSD card's adapter card, the microSD card only fits one way."
    },
    {
      "title": "Insert the R4 card into your Nintendo DS.",
      "content": "Insert the R4 card into your Nintendo DS. The R4 card should fit into the slot into which you usually insert your games' cards. [12] X Research source Make sure that the microSD card is snugly inserted into the R4 card as well. On the original DS, you may first have to plug a card reader into the bottom of the DS."
    },
    {
      "title": "Turn on your DS.",
      "content": "Turn on your DS. Press the \"Power\" button to turn on the DS. [13] X Research source"
    },
    {
      "title": "Select the \"MicroSD Card\" option.",
      "content": "Select the \"MicroSD Card\" option. Once the DS finishes powering on, you should see a \"MicroSD Card\" option (or something similar) on the bottom screen."
    },
    {
      "title": "Select your game.",
      "content": "Select your game. The game that you downloaded in ROM format should be displayed here. Select it to open it on your DS and begin playing! [14] X Research source"
    }
  ]
}