{
  "url": "https://www.wikihow.com/Find-Trending-Audio-on-Instagram",
  "title": "How To Find Trending Sounds on Instagram",
  "steps": [
    {
      "title": "When you see search for audio on Instagram, you'll see arrows next to some songs.",
      "content": "When you see search for audio on Instagram, you'll see arrows next to some songs. Instagram denotes trending audio with an arrow on the song's info page. This arrow appears next to the number of Reels and photos that have used the sound. You can use the Explore tab (represented by a magnifying glass icon) to search the title of a song or artist. [1] X Research source Once you have typed in your search term(s), tap the blue See all results option. To limit your search results to audio options, tap the Audio tab atop your screen. Here, you will find a list of all songs or sounds that match your search. Tap a song that interests you and look for the trending arrow."
    },
    {
      "title": "When you create a Reel, Instagram will suggest trending sounds to use.",
      "content": "When you create a Reel , Instagram will suggest trending sounds to use. If you tap See More near the top of the audio selection screen, you'll see several suggestions of trending audio to include in your Reel. While these suggestions will not include any arrows or numbers, you can safely assume that Instagram is recommending you use trending audio. [2] X Research source"
    },
    {
      "title": "Browse Reels on Instagram to discover trending audio.",
      "content": "Browse Reels on Instagram to discover trending audio. Keep an eye out for songs used repeatedly. Sure, you can tap on each individual song and scour its info page for a trending arrow, but you can also just keep scrolling and see if a song is used several times by several different users. If you hear a song more than once, it's likely trending. [3] X Research source"
    },
    {
      "title": "Visit https://www.instagram.com/creators to see the monthly trend report.",
      "content": "Visit https://www.instagram.com/creators to see the monthly trend report. This Instagram account offers all kinds of interesting tips for Instagram creators, but of particular use may be the monthly Trend Report, which documents some of the month's most successful Reels. Such success may stem from a popular challenge or dance, but you can always bet that the sounds used in these Reels are worthy inclusions in your own posts."
    },
    {
      "title": "When you search for a song, the number beside the song shows how often it was used.",
      "content": "When you search for a song, the number beside the song shows how often it was used. The info page for a sound also includes the number of times it has been used in posts on the platform. Popularity does not always equate to trendiness, but these songs should still benefit your content. [4] X Research source Any sound with a number above a million can safely be considered a popular sound, but even sounds with several hundred thousand uses may positively impact your post. You may also browse your feed or your Explore page for Reels that include music or sounds. Tap the name of the sound to open its info page and determine if it is trending."
    },
    {
      "title": "Several playlists on Spotify are dedicated to trending audio on Instagram.",
      "content": "Several playlists on Spotify are dedicated to trending audio on Instagram. It may sound strange to visit another app in order to find what's trending on Instagram, but several users have taken the time to compile Spotify playlists documenting the trending songs on Instagram. Just search for Instagram trending on Spotify and select Playlists to see which songs are trending. [5] X Research source Once you find a trending song on a Spotify playlist, you can cross-reference with Instagram by searching for it there. If you see a trending arrow on its info page, you can confirm that it is indeed a trending sound."
    }
  ]
}