{
  "url": "https://www.wikihow.com/Ddakji-Game",
  "title": "How to Play & Win the Korean Ddakji Game (From Squid Game)",
  "steps": [
    {
      "title": "Gather four sheets of square paper.",
      "content": "Gather four sheets of square paper. The size and type of paper you use is up to you, but you must get at least four sheets of paper, as each Ddakji tile requires two sheets of square paper to make. The larger the paper, the easier it is to fold (but not to play, necessarily). To make the pieces easier to discern, use different colored sheets of paper. [1] X Research source Origami paper is typically smoother and cracks less than other types of paper. [2] X Research source ."
    },
    {
      "title": "Fold the squared paper into thirds.",
      "content": "Fold the squared paper into thirds. Grab one end of the paper and fold it ⅓ of the way itself. Then, turn the paper around and fold the folded section another ⅓ of the way. Finally, take the other end and fold it into ⅓. By the end, your paper should be folded into a rectangular shape. Repeat this step for the other sheets of paper. [3] X Research source Once you fold the first two-thirds of the paper, the final ⅓ will be really easy to spot!"
    },
    {
      "title": "Fold the corners into the edge of the paper.",
      "content": "Fold the corners into the edge of the paper. Once you’ve folded the paper into a rectangle shape, grab the upper right-hand corner and fold it downward so its edge aligns with the back of the paper. Repeat this in the lower left-hand corner. Then, repeat this step for your other sheets of paper. [4] X Research source"
    },
    {
      "title": "Lay the folded pieces over each other.",
      "content": "Lay the folded pieces over each other. Once you’ve folded each sheet of paper, grab two of them and lay them over each other so all of the folded ends are facing upward. [5] X Research source Repeat this step for any other tiles you’re making."
    },
    {
      "title": "Fold the two pieces together.",
      "content": "Fold the two pieces together. After laying the folded pieces of paper over each other, grab the folded ends of the bottom sheet and fold them over the top sheet. Hold the ends down, then fold the flaps of the bottom piece into the flaps of the top to secure the tile together. [6] X Research source Repeat this step for any other tiles you’re making. If you’ve folded the tile correctly, you won’t need tape, glue, or any other adhesives to hold it together."
    },
    {
      "title": "Gather at least two players and your tiles, then choose a starter.",
      "content": "Gather at least two players and your tiles, then choose a starter. Once you’ve made your tiles (or bought them, we don’t judge), gather your players and play a game of Rock, Paper, Scissors to see who goes first. Ddakji is a 2-4 player game, so you need at least two people to play. [7] X Research source If you decide to do four players, make more tiles to accommodate for each player. Each player should have one tile. For a longer game, give each player two tiles and only let the opposing team take the tiles if they flip both. If you’re playing with four people, pair into teams of two. To avoid longer games, set a designated number of rounds before starting the game."
    },
    {
      "title": "Have the losing player(s) place their tile(s) on the ground.",
      "content": "Have the losing player(s) place their tile(s) on the ground. Whoever loses the game of Rock, Paper, Scissors must place their tile on the ground and let the winning player make their move first. If you’re playing with a group of four, place one tile for each person on the losing team. [8] X Research source"
    },
    {
      "title": "Have the winning person try to flip the first tile.",
      "content": "Have the winning person try to flip the first tile. Whoever wins the game of Rock, Paper, Scissors must approach the losing player’s tile and use their tile to flip it. Do this by throwing your tile at the other player’s. [9] X Research source"
    },
    {
      "title": "On your turn, throw your tile at the ground tile(s) to try and flip it.",
      "content": "On your turn, throw your tile at the ground tile(s) to try and flip it. If you’re playing with teams, designate whose tile everyone’s going for to make it easier for everyone. When it’s your turn, throw your tile at your opponent’s tile on the ground and try to flip it. If you flip the tile, take it and add it to your collection. If you don’t flip it, switch roles regardless. If you throw first, place your tile on the ground after and let your opponent try to flip it. [10] X Research source"
    },
    {
      "title": "Play until you collect all your opponent’s tiles.",
      "content": "Play until you collect all your opponent’s tiles. For each round you play, the winner gets to take a tile. Whoever collects all of the tiles in the end wins! If you’re playing rounds, whoever collects the most tiles by the end of the game wins. [11] X Research source"
    },
    {
      "title": "Aim for the puffiest part of the tile.",
      "content": "Aim for the puffiest part of the tile. When you make the tiles, there will typically be a puffier part in the middle of them. When you hit that puffy part, the hive will cause air to disperse throughout the tile, giving it more of a chance to flip. [12] X Research source When aiming for the puffiest part, avoid making a follow-through motion, as it can change the angle of your throw."
    },
    {
      "title": "Use lighter paper.",
      "content": "Use lighter paper. Using lighter paper to make your ddakji tiles makes them easier to flip. While lighter paper may result in a softer throw, you can adjust your throwing strength to gain the upper hand. To gain the advantage and ease the game’s difficulty, use light paper without telling your opponent that it’s easier to flip. That way, you’ll gain the advantage without them catching on."
    },
    {
      "title": "Experiment with different-sized tiles.",
      "content": "Experiment with different-sized tiles. You may have a harder time flipping bigger tiles than smaller tiles, or vice versa. So when you’re learning the game, experiment with different-sized tiles to get a feel of what works for you and what doesn’t. If you find that you’re better with a certain tile size, make the tiles you use for future games that size without telling your opponent about your skill with them. That way, you’ll catch them off guard with how quickly you flip their tile. [13] X Research source"
    },
    {
      "title": "Use the flat side of your tile instead of the pointy side.",
      "content": "Use the flat side of your tile instead of the pointy side. By using the flat side of your tile, you will cover more area when you hit your opponent’s tile, moving the air in the tile around more and increasing your chances of a flip. If you use the pointy side, you may be able to flip the tile, but you won’t be able to hit it with as much force as you would by using the flat side, so your chances are a lot slimmer."
    },
    {
      "title": "Neomgyeomeokgi (Flipping)",
      "content": "Neomgyeomeokgi (Flipping) This is the most popular variation of Ddakji. In this variation, players start by playing a game of rock, paper, scissors to determine who places their tile on the ground first. Whoever loses places their tile on the ground, then the other person has to try and flip it over by hitting it. If they flip it successfully, they take the ddakji. If they fail, the other person goes. Whoever collects all ddakji first wins. [14] X Research source How to Play: Play rock, paper, scissors to determine who places their tile on the ground first, then throw your tile at the other person’s to flip it. Whoever flips all tiles first wins. To switch the game up, specify an order in which the tiles need to be flipped by marking them with numbers, colors, or other signifiers. To really raise the stakes, add a rule that if a tile lands underneath or on top of another tile without flipping it, the person who threw it loses that tile."
    },
    {
      "title": "Nallyeomeokgi (Throwing)",
      "content": "Nallyeomeokgi (Throwing) In this version of Ddakji, players compete to see who can throw their tiles farther. They start by playing rock, paper, scissors to determine who throws the tile first. In cases versions, a line is drawn to give players something to aim for. In this version, players attempt to land their tile precisely on the line in order to take others’ tiles. Whoever gets all of the tiles first wins. [15] X Research source How to Play: Play rock, paper, scissors to figure out who goes first, then try to throw your tile farther than the other player(s). Whoever throws farther takes the opponent’s tile. Whoever gets all tiles first wins! For a more challenging game, draw a line and try to land your tile exactly on it. Whoever lands first gets a tile. Whoever gets all the tiles wins."
    },
    {
      "title": "Byeokchigi (Hitting a Wall)",
      "content": "Byeokchigi (Hitting a Wall) In this variation of Ddakji, players are supposed to throw their tiles at the wall. Whoever’s tile bounces back the farthest wins. [16] X Research source How to Play: Find a wall and take a few steps back. Play rock, paper, scissors to determine who goes first. Then, throw your tile at the wall and try to bounce it as far as you can behind you. Whoever lands furthest takes a tile. Whoever gets all the tiles wins."
    },
    {
      "title": "Mireonaegi (Pushing Out)",
      "content": "Mireonaegi (Pushing Out) This one is one of the tougher variations of Ddakji. In this version, players draw a circle on the ground and place a tile inside of it. There’s either one tile per player or a set number of tiles per each player that’s determined before the start of the game. Either way, players win tiles from other players by pushing them out of the circle using their own tiles. [17] X Research source How to Play: Draw a boundary circle and place a set number of tiles per player inside. Play rock, paper, scissors to see who goes first, then throw your tile at the other players’ to push them out of the circle (and win their tile). Whoever gets all tiles first wins. If you accidentally leave your tile in the circle during your turn, you lose it."
    },
    {
      "title": "Ddakji is hundreds of years old and became popular in the 14th century.",
      "content": "Ddakji is hundreds of years old and became popular in the 14th century. The first recorded games of Ddakji were hundreds of years ago, having gained historical popularity during the Joseon Dynasty of 1392-1897. During this period, paper was precious and scarce. With whatever paper-like materials they could find, people would make Ddakji tiles to play the game. [18] X Research source After the country was liberated from Japanese rule in 1945, paper became a lot more common, enshrining the game of Ddakji in Korean history."
    },
    {
      "title": "Ddakji gained international popularity with the success of Squid Game.",
      "content": "Ddakji gained international popularity with the success of Squid Game. Although Ddakji was already popular in Korean culture, having been featured in the South Korean game show, Running Man, it didn’t gain international fame until the release of Squid Game in 2021. In the first episode, the main character Gi-hun plays a game of Ddakji against a mysterious recruiter, who offers him 100,000 won (about $68.05) for every round he wins. But Gi-hun repeatedly loses, and since he doesn’t have the money, he’s slapped across the face. [19] X Research source This game sets up the entire show. Even though Gi-hun eventually wins one round, he is offered the chance to win more money by entering the mysterious Squid Games, a competition where the contestants play mysterious games for money."
    }
  ]
}