{
  "url": "https://www.wikihow.com/Get-Rid-of-Bra-Indentations-on-Shoulder",
  "title": "How to Get Rid of Bra Strap Indentations on Your Shoulders (and Keep Them from Coming Back)",
  "steps": [
    {
      "title": "Scrub your shoulders to remove dead skin and make dents less noticeable.",
      "content": "Scrub your shoulders to remove dead skin and make dents less noticeable. [1] X Research source Make an exfoliating scrub with sugar and lemon juice to slough off the dead skin and pale the marks left by your bra straps. Pour some sugar into a small bowl, then dribble in lemon juice and stir until the mixture has a paste-like consistency. Massage into your shoulders, then rinse off with warm water. The scrub helps remove the dead skin and promote new skin cell growth. If you don't feel up to making your own, a commercial scrub works just as well. You might not notice results immediately, especially if the marks have been there for a while. Exfoliate daily to promote new skin growth and help fade those marks."
    },
    {
      "title": "Cushions might prevent the straps from digging into your shoulders as much.",
      "content": "Cushions might prevent the straps from digging into your shoulders as much. Bra strap cushions work best to alleviate marks from your bra straps cutting into your skin. If you have a bra that you like but the shoulder straps are super-skinny, adding a cushion helps protect your shoulders. Research has shown that bra strap cushions don't work as well as crossing the straps in the back, but they might make your bra more comfortable for you to wear. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Plump up your skin to help fill out the indentations.",
      "content": "Plump up your skin to help fill out the indentations. Intense moisture gives your skin a smoother appearance and might reduce the appearance of minor indentations that haven't been there for very long. Moisturized skin is also more healthy so it'll bounce back faster when your straps cause undue pressure or irritation. [3] X Research source A homemade mask with yogurt and turmeric helps fade the marks as well as moisturize your skin. Just mix about 1/4 teaspoon (1.5 grams) of turmeric powder into 1 teaspoon (5 milliliters) of plain yogurt. You can also add about 1/2 teaspoon (2.5 milliliters) of honey to cut the strong smell and help the mask stick to your skin. Leave it until it dries, then gently wipe it off. [4] X Research source"
    },
    {
      "title": "Increase blood circulation to help the area heal faster.",
      "content": "Increase blood circulation to help the area heal faster. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Use a light oil, such as almond or olive oil, to massage your shoulders, neck, and upper back. If you can't reach well enough in all of these places, get someone to help you. Use mild soap and warm water to clean the oil off of your skin once you're done with your massage, then follow up with a light moisturizer ."
    },
    {
      "title": "Skin-care products that fade scars can help with bra strap marks.",
      "content": "Skin-care products that fade scars can help with bra strap marks. Alpha hydroxy peels that help reduce the appearance of acne scars on your face can do the same thing for the strap marks on your shoulders. Even if the product is specifically designed for use on your face, it's safe to use anywhere. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source These products might not do anything about the indentations themselves. But without the marks, the grooves will be less noticeable. Alpha hydroxy acids make your skin more sensitive to the sun, so always wear sunscreen on your shoulders if you're treating your bra strap marks with alpha hydroxy acids."
    },
    {
      "title": "Use makeup as a quick fix if you're going out and plan on baring your shoulders.",
      "content": "Use makeup as a quick fix if you're going out and plan on baring your shoulders. Pat on a basic concealer to cover the marks, then dust on a little loose powder to set it. That might be all you need for lighter marks, but if it's not enough, try a cream makeup specifically designed to camouflage scars. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source The most heavy-duty cream makeup to cover scars is available by prescription. Talk to a dermatologist if you have dark marks that can't be easily covered by commercial makeup."
    },
    {
      "title": "Prevent indentations by ensuring your bras fit correctly.",
      "content": "Prevent indentations by ensuring your bras fit correctly. [8] X Research source [​​v161361_b01]. 14 April 2020. Research has shown that as much as 80% of people who wear bras don't wear the correct size. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If it's been a while since you've checked your bra size, measure yourself —or better yet, have a professional do it. Breast Research Australia (BRA), in partnership with the Australian Institute of Sport, has a free sports bra app that you can use to find the best fitting sports bra for you."
    },
    {
      "title": "Take the pressure off of your shoulders to allow them to heal.",
      "content": "Take the pressure off of your shoulders to allow them to heal. If you have a strapless bra, try alternating it with your regular bras (even if you're not baring your shoulders!) to give your shoulders a break. If you wear a strapless bra for just a couple of days, your strap marks will likely start to fade. Wearing a strapless bra will be most effective if you combine it with other treatments, such as exfoliating the skin on your shoulders and following up with a moisturizer."
    },
    {
      "title": "Research shows that crossed straps better distribute the weight.",
      "content": "Research shows that crossed straps better distribute the weight. [10] X Research source If your bra straps unhook in the back, unhook them and loosen them up a bit. Cross them in the back, then reattach them. Put your bra on and adjust the straps so they fit properly. You'll notice that you feel less pressure from the straps on your shoulders, which typically makes it less likely that you'll develop indentations. This strap orientation also keeps your straps from slipping off your shoulders as much."
    },
    {
      "title": "A wider bra strap is less likely to cause shoulder indentations.",
      "content": "A wider bra strap is less likely to cause shoulder indentations. The pressure on your bra straps can make a skinny strap feel like a knife cutting into your skin by the end of the day. Bras with wider straps spread that pressure over a larger area so they don't cause as much damage to your skin. [11] X Research source Wider straps also provide better support for your breasts and put less pressure on the nerves in your shoulders and neck. If you have larger breasts, even a properly fitted bra might cause shoulder pain after a few hours. Wider straps will help with this. [12] X Research source"
    },
    {
      "title": "Consult with a plastic surgeon to get your shoulder grooves filled in.",
      "content": "Consult with a plastic surgeon to get your shoulder grooves filled in. If you've been wearing ill-fitting bras for years, the straps can actually cause deformities of the muscles in your shoulders, leading to a permanent indentation. A plastic surgeon can tell you if your indentations are permanent and if you're a good candidate for surgery. [13] X Research source If your indentations aren't severe, you might be able to get rid of them through less invasive treatments, such as laser treatments commonly used to treat scars. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    }
  ]
}