{
  "url": "https://www.wikihow.com/Cook-White-Cabbage",
  "title": "How to Cook White Cabbage",
  "steps": [
    {
      "title": "Buy white cabbage during fall and early winter for the best flavor.",
      "content": "Buy white cabbage during fall and early winter for the best flavor. White cabbage is available year-round, but its peak is during the late fall and early winter. [1] X Research source The stem should be trimmed with a fresh look. Avoid buying precut or shredded cabbage. [2] X Research source Once cabbage is already cut, it loses vitamin content, even if it is packaged well. Don’t fuss over whether you should buy organic or conventional cabbage, because it’s considered pretty clean and free of pesticides."
    },
    {
      "title": "Choose cabbage with vibrant and unblemished leaves.",
      "content": "Choose cabbage with vibrant and unblemished leaves. [3] X Research source When choosing a head of white cabbage, inspect its leaves. They should be light green and tightly packed in a ball shape. Test its weight to make sure the cabbage is heavier rather than lighter. [4] X Research source To ensure your cabbage’s freshness, store in the refrigerator until it’s ready to use. Browning and markings can be signs of worm damage in cabbage. [5] X Research source"
    },
    {
      "title": "Rinse and peel white cabbage before using it.",
      "content": "Rinse and peel white cabbage before using it. The outermost leaves should be peeled, because they usually have some brown and wilting. Like all vegetables, you should rinse it before use, because it will have some dirt, pesticide, or bacteria on it, although not as much as other produce you’ll buy. [6] X Research source Cut the stem off the bottom of the head of cabbage to prepare it for cooking."
    },
    {
      "title": "Melt butter in a sauté pan on medium-high heat.",
      "content": "Melt butter in a sauté pan on medium-high heat. [7] X Research source The pan should be hot on the surface before adding butter, so test the pan’s heat by flicking tap water on it and observe whether the water sizzles. Butter becomes liquid between 82 °F (28 °C) and 92 °F (33 °C), so keep the pain over low to medium-low heat for melting butter without burning it. Rather than dropping one large chunk of butter to the pan, chop it up into smaller pieces, so the butter melts quickly and evenly over the surface of the pan."
    },
    {
      "title": "Slice a head of cabbage using a knife or mandoline.",
      "content": "Slice a head of cabbage using a knife or mandoline. First, cut the head into wedges, and then slice the wedges with the flat side down using a knife. Cut it to your desired thickness. You can have finer slices or thicker slices. [8] X Research source Using a mandoline, slide the cabbage wedges across the sharp blade in the middle of the mandoline to get finer shreds."
    },
    {
      "title": "Add the sliced cabbage to the pan of melted butter.",
      "content": "Add the sliced cabbage to the pan of melted butter. Toss in 1.5 teaspoons (7.4 mL) of kosher salt and 1 ⁄ 2 teaspoon (2.5 mL) of ground pepper at the same time with the cabbage for seasoning. Sauté for 10 to 15 minutes. When you saute cabbage, stir occasionally until it is tender and begins to turn brown. [9] X Research source Stirring prevents the cabbage from sticking and ensures an evenly distributed brown color to the leaves."
    },
    {
      "title": "Store leftovers in a sealed contained in the fridge.",
      "content": "Store leftovers in a sealed contained in the fridge. Either airtight bags or plastic containers can prevent bacteria growth, retain moisture, and prevent leftovers from absorbing other odors in the fridge. Leftovers should be refrigerated or frozen within 2 hours of cooking the food. Leftovers can be stored in the refrigerator for 3 to 4 days or frozen for 3 to 4 months. However, frozen leftovers tend to lose moisture and flavor when stored longer than 4 months."
    },
    {
      "title": "Cut the cabbage into wedges and remove the core to shred it.",
      "content": "Cut the cabbage into wedges and remove the core to shred it. To shred cabbage by hand, place a wedge with one of the flat sides down, so you can cut it into slices of desired thickness. You can have finer slices or thicker slices. [10] X Research source Cabbage can also be shredded using a kitchen tool called a mandoline. Slide the cabbage wedges across the sharp blade in the middle of the mandoline to cut it into fine shreds."
    },
    {
      "title": "Turn the burner to medium heat.",
      "content": "Turn the burner to medium heat. Place the pan over the burner until the pan is sufficiently heated. You will know the pan is heated when a few drops of water sizzle when they touch the pan. [11] X Research source"
    },
    {
      "title": "Measure 2 tablespoons (30 mL) of cooking oil.",
      "content": "Measure 2 tablespoons (30 mL) of cooking oil. Add oil to the heated pan. Swirl the oil in the pan to coat the surface. [12] X Research source"
    },
    {
      "title": "Put the shredded cabbage in the wok to fry.",
      "content": "Put the shredded cabbage in the wok to fry . Stir the cabbage until it’s coated in oil. Add 2 teaspoons (9.9 mL) of Shaoxing rice cooking wine, 5 red chilis, 2 scallions, 5 garlic cloves and 1 tablespoon (15 mL) of water as you stir the cabbage. Cook for 8 minutes. [13] X Research source When cabbage is done cooking it will look smaller in the wok than when it was raw. You’ll know the cabbage is cooked when it’s soft and aromatic. [14] X Research source"
    },
    {
      "title": "Remove tattered or withered outer leaves from the cabbage.",
      "content": "Remove tattered or withered outer leaves from the cabbage. Rinse it under cold water before slicing it, and then cut the head of cabbage in half and into quarters, and then slice it finely with either a knife or mandoline. [15] X Research source You may also boil the leaves whole or left as wedges instead of shredded. It’s up to you and how you want to serve the cabbage. [16] X Research source"
    },
    {
      "title": "Boil the water vigorously before adding cabbage.",
      "content": "Boil the water vigorously before adding cabbage. The pot should be filled with about a half an inch of water. [17] X Research source Add salt to the boiling water for taste. [18] X Research source Once the water is boiling vigorously, drop the sliced cabbage into the pot."
    },
    {
      "title": "Simmer cabbage slices for 3 to 5 minutes.",
      "content": "Simmer cabbage slices for 3 to 5 minutes. Make sure to bring the water back to a boil after adding the cabbage. If you’re cooking wedges, simmer for 10 to 15 minutes. [19] X Research source Check the cabbage regularly to make sure it’s not overcooked. A good indicator that it’s ready is when it’s just tender without being mushy. Overcooking cabbage will release its sulfurous odors that most people hate about it so much. [20] X Research source Use a colander to drain the water from the cabbage into a separate bowl. Put the colander on top of the saucepan, and serve cabbage into small dishes. [21] X Research source"
    },
    {
      "title": "Season the cabbage as desired.",
      "content": "Season the cabbage as desired. Melt butter on the cabbage, and sprinkle a pinch of white pepper on it for seasoning. Add some more salt and serve while it’s warm [22] X Research source White cabbage goes well with any meaty dish such as corned beef, sausages, and bacon. [23] X Research source"
    }
  ]
}