{
  "url": "https://www.wikihow.com/Find-Out-when-Someone-Died",
  "title": "How to Find Out when Someone Died",
  "steps": [
    {
      "title": "Start with a general search of the person's name.",
      "content": "Start with a general search of the person's name. If you search the person's full name online, you may pull up newspaper obituaries or other information about them that will lead you to a date of death. This type of search typically yields better results if the person has a somewhat unusual name. [1] X Research source Even if the person has a relatively common name, you can filter out less relevant results by including other information about the person. For example, if you know the town where they were born, you can add that town name. An obituary typically would list where the person was born. If you know the names of other people who were related to that person or survived that person, adding those names can also help you narrow your search results."
    },
    {
      "title": "Try genealogy sites for older deaths.",
      "content": "Try genealogy sites for older deaths. If you're trying to find out when someone died who lived hundreds of years ago, genealogy sites may be your best bet. Many of these sites have compiled data and records going back hundreds of years. [2] X Research source For example, ancestry.com has a global grave index available at https://search.ancestry.com/search/db.aspx?dbid=60541 . This database indexes cemetery and burial details going back to the 1300s. You'll get better search results if you have a lot of information about the person. Otherwise, be prepared to sift through numerous results."
    },
    {
      "title": "Check online government databases.",
      "content": "Check online government databases. Many governments provide at least limited access to digitized government databases online. Do an online search for \"death index\" or \"death records\" with the name of the country the person was from. If you believe the person died more recently, or at least within the past 50 years, government databases may have a record of the death. Older records may be spotty, especially if the country has been involved in war or civil strife, or had a significant change in government. For example, it may be more difficult to find out when someone died if they lived in Eastern Europe in the early 1900s."
    },
    {
      "title": "Search newspaper obituaries.",
      "content": "Search newspaper obituaries. Local newspapers typically publish an obituary whenever there is a death. For many people, this may be the only record of their death that is available. If you can find the person's obituary, you can find out when they died. [3] X Research source Go to https://www.legacy.com/obituaries/search to search obituaries and funeral home notices published in Australia, Canada, Europe, New Zealand, the UK, and the US."
    },
    {
      "title": "Talk to family members of the deceased.",
      "content": "Talk to family members of the deceased. Family members may have records or keepsakes related to the deceased person. These can help you determine roughly when the person died, even if you can't get an exact date. [4] X Research source Older family members can be especially helpful if you're trying to track down when an ancestor or distant relative died. Prepare questions for the person before you meet with them and take care not to overwhelm them – especially if they are elderly. If you have any photographs, documents, or other artifacts related to the deceased, bring them along to help jog the person's memory or direct their focus."
    },
    {
      "title": "Search probate records at the local courthouse.",
      "content": "Search probate records at the local courthouse. If you know where the person died, the local courthouse may have records related to their death. A probate court record would exist if the person had a will, or if they died without a will but had property that needed to be distributed to surviving family. Some courts have their records digitized and available online, but most do not. If the person died many years ago, you'll likely have to make a trip to the courthouse to find any court filings related to their death. If you can't easily travel to the area, call the clerk's office and let them know what you're looking for. They may be able to do a search for you and mail you the results. You'll typically have to pay a fee for a search of court records, as well as for copies of any records that are found. This fee is usually minimal (along the lines of a few US dollars)."
    },
    {
      "title": "Visit a state or national archives facility.",
      "content": "Visit a state or national archives facility. Most countries have archives with vital records and other historical information. The public typically has access to these records, although you may have to make an appointment or register as a researcher first. [5] X Research source Some records may also be digitized and available on the national archives website. National archives facilities are more likely to have records of someone who died during wartime or while serving in the military."
    },
    {
      "title": "Contact your country's embassy for foreign deaths.",
      "content": "Contact your country's embassy for foreign deaths. If the person was a citizen of your country but died in another country, your country's embassy in that country will have information about their death. Typically, embassy staff can get you a copy of the person's death certificate. [6] X Research source If the death was recent, the nearest embassy or consular office will also have the person's personal effects. These items are normally released to the person's next of kin."
    },
    {
      "title": "Check with the vital records office where the person died.",
      "content": "Check with the vital records office where the person died. In smaller countries, vital records and statistics may be kept at the national level. However, in most places, death certificates are kept at a more local level of government. [7] X Research source For example, in the US, you can find death certificates at either the state or county level. Older records are typically kept at the county level. Find out the process for getting a copy of the death certificate before you go through the trouble of ordering one. For example, some offices may require you to pick up the copy in person. If that isn't an option for you, there's no point in submitting a request."
    },
    {
      "title": "Complete a request form to get a copy of the death certificate.",
      "content": "Complete a request form to get a copy of the death certificate. The vital records office will have a form you must fill out to request a copy of the death certificate. You typically have to provide information about yourself, the deceased, and the reason you want a copy of the death certificate. [8] X Research source Access to death certificates is restricted in some places. Restrictions are more common with more recent deaths. Some offices may require you to have your request form notarized. Look for a block on the form for a notary's seal. If notarization is required, don't sign your form until you are in front of a notary so they can verify your identity and your signature."
    },
    {
      "title": "Submit your form with any required fees.",
      "content": "Submit your form with any required fees. The request form has information on how to submit the form and what fees are required for copies of death certificates. If you need a certified death certificate, the fees will generally be more. However, you don't necessarily need a certified death certificate just to find out when the person died. [9] X Research source Some offices may allow you to submit the form online. However, if the form needs to be notarized, you will need to mail it or take it to the office in person."
    },
    {
      "title": "Receive your copy of the death certificate.",
      "content": "Receive your copy of the death certificate. After your request is processed, the office will mail you a copy of the death certificate. The death certificate will show the date the person died along with other information about their death. [10] X Research source If you're able to go to the office in person to submit your request form, you may be able to receive a copy of the death certificate immediately. However, if it's an older death, the records may be kept in archives off-site. Retrieval of an older death certificate may take a little longer."
    }
  ]
}