{
  "url": "https://www.wikihow.com/Fluffy-Edgar-Cut",
  "title": "The Fluffy Edgar Hairstyle: Cutting, Shaping, & Upkeep",
  "steps": [
    {
      "title": "Wet your hair and comb down your bangs.",
      "content": "Wet your hair and comb down your bangs. Dampen your hair with a faucet or spray bottle to elongate it. Then, comb your bangs down in front of your forehead. [1] X Research source Try to keep your bangs tight and symmetrical to make cutting your Fluffy Edgar guidelines nice and easy. Make sure your hair is at least ear-length. For a Fluffy Edgar cut, you want longer hair that’s at least 3–4 inches (7.6–10.2 cm) so it can be combed forward easily."
    },
    {
      "title": "Add heat-protectant spray or serum to your damp hair.",
      "content": "Add heat-protectant spray or serum to your damp hair. Apply a little heat-protectant spray or serum to your combed, damp hair (particularly around the bangs area) to prep your hair for blow-drying and protect it against heat damage. [2] X Research source"
    },
    {
      "title": "Blow dry your hair in the direction of your bangs.",
      "content": "Blow dry your hair in the direction of your bangs. Use a blow dryer on medium-high heat to dry your hair. To keep your bangs from being tossed around, use a comb to hold your front hair firmly in place and blow dry in the direction your bangs are being laid down. [3] X Research source"
    },
    {
      "title": "Cut your guidelines using a guardless clipper.",
      "content": "Cut your guidelines using a guardless clipper. Guidelines are used to determine the overall shape and length of your haircut. Create side guidelines for your Fluffy Edgar by using a clipper with no guard to cut sharp, straight lines on the sides of your head. Cut these slightly below the top of the ear. Then, cut an equally straight line on the back of the head near the bottom of the ear. Use a size 0 guard to cut any excess hair below these lines. [4] X Research source Having a size 0 guard (which cuts basically skin-smooth) gives clear lines that make it much easier to taper your Fluffy Edgar cut. If you want a higher taper/fade for your Fluffy Edgar, shave your side guidelines about 0.75 inches (1.9 cm) of an inch above the ear. Then, shave your back guideline 0.75 inches (1.9 cm) above the bottom of the ear. Back guidelines do not have to be perfectly even. In fact, it’s common for these lines to dip before reaching the other ear. You can even add funky line patterns for flair!"
    },
    {
      "title": "Create fade lines by using a size 2 clipper guard and opening it over time.",
      "content": "Create fade lines by using a size 2 clipper guard and opening it over time. Add a clipper guard (size is totally your choice but usually 1 ½ to 2 works best with this cut) and place your clippers at the top of your side guidelines above the ears. Then, begin shaving your hair vertically towards the top of your head and horizontally towards the back of the head to create other, thicker lines (fade lines) about 1 inch (2.5 cm) above the guidelines. [5] X Research source To create an even fade , start shaving with the clipper guard fully closed and slowly open the guard’s lever with each pass. [6] X Research source Work in small sections, shaving a little bit of hair at a time. Slow and steady creates a better-looking taper."
    },
    {
      "title": "Use a size 1 guard to blend the hair.",
      "content": "Use a size 1 guard to blend the hair. Now that you have a sharp guideline at the bottom and a thicker fade line at the top, replace your size 2 clipper guard with a size 1 (or about half the size of the fade line guard) and blend the hair by shaving in the same direction that you shaved your fade lines (vertically bottom-to-top and horizontally towards the back), stopping slightly below the fade lines. Leave the lever fully open and keep the blade flat. [7] X Research source Shaving the head in this way will create a blended look that tapers toward the thicker, fluffy top of the head."
    },
    {
      "title": "Clean up the blend by cutting clipper-over-comb.",
      "content": "Clean up the blend by cutting clipper-over-comb. Once you’ve created a nice, even taper, clean up the lines by combing out a small chunk of hair at a time and shaving this chunk off with a razor on the outside of the comb. Use this method to remove any bulky or loose-hanging hairs that round or limpen the guidelines. [8] X Research source Comb the hair at a 45-degree angle for that rounded Edgar look."
    },
    {
      "title": "Trim your front bangs with a guardless clipper.",
      "content": "Trim your front bangs with a guardless clipper. After you’ve tapered and blended the back and sides of your Fluffy Edgar, remove the guard from your clipper and trim your bangs in a straight, even line across the forehead. [9] X Research source Where you decide to cut your bang line is based entirely on how much forehead you wish to show. If you’ve cut a higher taper, trim shorter bangs. If your taper is lower, keep your bangs lower. Use a straight blade after you’ve clipped your hair for a crisper line. [10] X Research source"
    },
    {
      "title": "Texturize and remove any excess hair with a scissor-over-comb technique.",
      "content": "Texturize and remove any excess hair with a scissor-over-comb technique. Use hair scissors to help remove any hairs on the top and sides of your head that don’t blend into the fade lines. While cleaning the initial blend is best done with clippers-over-comb for a more buzzed look, use scissors-over-comb for touching up and cutting off these final few hairs, because they offer more control. [11] X Research source"
    },
    {
      "title": "Wet your hair and let it air dry.",
      "content": "Wet your hair and let it air dry. What separates an Edgar cut from a Fluffy Edgar cut is the style and texture of your top hair. To style your top hair, get it wet and malleable by rinsing your hair and allowing it to dry without a towel or blow dryer."
    },
    {
      "title": "Apply a texturizing mousse to your damp hair.",
      "content": "Apply a texturizing mousse to your damp hair. Once your hair is damp, but not fully dry, use about a quarter-sized amount of texturizing mousse to add volume. Scrunch, fluff and flick the top part of your hair a handful at a time until you’ve achieved your desired degree of curl. [12] X Research source Avoid using other hair products to make your Fluffy Edgar last as long as possible."
    },
    {
      "title": "Shampoo and condition every 2-3 days.",
      "content": "Shampoo and condition every 2-3 days. Try not to wash your hair more than 3 times a week so it doesn’t become too dry, flat, or frizzy. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use a sulfate-free, moisturizing conditioner a few times per week to help maintain your hair's volume."
    }
  ]
}