{
  "url": "https://www.wikihow.com/Delete-Corrupted-Files",
  "title": "How to Delete Corrupted Files on a PC or Mac",
  "steps": [
    {
      "title": "Close all programs you were working on and restart your computer.",
      "content": "Close all programs you were working on and restart your computer. If your account isn't an admin account, you may not have the permissions set up to delete certain files, so you'll need to log in to an administrator account."
    },
    {
      "title": "Log in to an administrator account.",
      "content": "Log in to an administrator account. As an administrator, you won't have any trouble deleting corrupted files."
    },
    {
      "title": "Locate the corrupted file you want to delete.",
      "content": "Locate the corrupted file you want to delete. You'll find it on either your desktop or in File Explorer."
    },
    {
      "title": "Drag the corrupted file to the Recycle Bin.",
      "content": "Drag the corrupted file to the Recycle Bin. This recycling can icon is usually on your desktop."
    },
    {
      "title": "Right-click the Recycle Bin icon and select Empty Recycle Bin.",
      "content": "Right-click the Recycle Bin icon and select Empty Recycle Bin . This is usually the second option in the list next to another recycling bin icon."
    },
    {
      "title": "Open Command Prompt as an Administrator.",
      "content": "Open Command Prompt as an Administrator. You can click the Start menu icon and type \"cmd\" to open a list of search results then click the Command Prompt program and click Run as administrator . For this method, you need the file path of the file you want to delete. If you don't know how to get a file's file path, refer to How to Find a File's Path on Windows ."
    },
    {
      "title": "Enter the following code into the command prompt window:",
      "content": "Enter the following code into the command prompt window: \"Del /F /Q /A <filepath>\" Replace <filepath> with your file's location. For example, you might have \"Del /F /Q /A C:\\Users\\John\\Downloads\". \"/F\" means to force delete files, \"/Q\" means to delete read-only files, and \"/A\" means to select files with the archiving attribute. [1] X Research source"
    },
    {
      "title": "Press ↵ Enter.",
      "content": "Press ↵ Enter . Your file should be deleted."
    },
    {
      "title": "Close all programs you were working on and restart your computer.",
      "content": "Close all programs you were working on and restart your computer. You'll want to use this method if the previous steps did not work for you."
    },
    {
      "title": "Press F8 before the Windows logo appears.",
      "content": "Press F8 before the Windows logo appears. You may miss this on your first try, so you might need to restart your computer again. For more information, you can look at How to Activate Safe Mode in Windows 10 Using F8 , How to Activate Safe Mode in Windows 10 using the Power Menu , and How to Start Windows in Safe Mode for older versions of Windows."
    },
    {
      "title": "Select Advanced options.",
      "content": "Select Advanced options . You'll see this on the right side of your screen."
    },
    {
      "title": "Select Startup Settings and Restart.",
      "content": "Select Startup Settings and Restart . Your computer will restart again with Startup Settings."
    },
    {
      "title": "Enable Safe Mode.",
      "content": "Enable Safe Mode. You'll need to press the corresponding number (1-9) or function key (F1-F9) to make your selection."
    },
    {
      "title": "Locate the file you want to delete.",
      "content": "Locate the file you want to delete. You'll find it on either your desktop or in your file explorer."
    },
    {
      "title": "Drag the file to the Recycle Bin.",
      "content": "Drag the file to the Recycle Bin. This recycling can icon is usually on your desktop."
    },
    {
      "title": "Right-click the Recycle Bin icon and select Empty Recycle Bin.",
      "content": "Right-click the Recycle Bin icon and select Empty Recycle Bin . The files inside the Recycling Bin should be deleted; if you continue to get an error, continue to the other methods."
    },
    {
      "title": "Open Terminal.",
      "content": "Open Terminal. You can find the Terminal app icon in the Utilities folder of Finder."
    },
    {
      "title": "Enter the following code into the Terminal window, but don't press ⏎ Return:",
      "content": "Enter the following code into the Terminal window, but don't press ⏎ Return : \"sudo rm -R \" . You'll want to make sure you add a space after the last \"R\" in the code."
    },
    {
      "title": "Locate the file you want to delete in Finder.",
      "content": "Locate the file you want to delete in Finder. Make sure you can see your Terminal window at the same time."
    },
    {
      "title": "Drag the file you want to delete from Finder into the Terminal window.",
      "content": "Drag the file you want to delete from Finder into the Terminal window. The file's location and name will add to the end of your command. Press the Return key to delete the file."
    },
    {
      "title": "Enter the Admin password and press ⏎ Return.",
      "content": "Enter the Admin password and press ⏎ Return . This will prompt Terminal to permanently delete the file."
    },
    {
      "title": "Click the Apple logo .",
      "content": "Click the Apple logo . You'll see this in the top left corner of your screen."
    },
    {
      "title": "Click Restart and press ⇧ Shift.",
      "content": "Click Restart and press ⇧ Shift . Hold down the Shift key as your Mac restarts to enable Safe Mode. You can release the Shift key at the login window, as Safe Mode has been activated."
    },
    {
      "title": "Log into your account and locate the file you want to delete.",
      "content": "Log into your account and locate the file you want to delete. Since your Mac is in Safe Mode, you might be able to delete the corrupted file."
    },
    {
      "title": "Drag the file to the Trash.",
      "content": "Drag the file to the Trash. You can also click to select the file in Finder, then go up to the menu and select Move to Trash ."
    },
    {
      "title": "Empty Trash.",
      "content": "Empty Trash. Click and hold on the Trash icon. After a few seconds, a menu will pop up, and you can click Empty Trash . Restart your Mac again to exit Safe Mode. If those steps still caused an error to pop up, try the next method."
    }
  ]
}