{
  "url": "https://www.wikihow.com/Erm-What-the-Sigma",
  "title": "TikTok’s \"Erm, What the Sigma?\" Meaning",
  "steps": [
    {
      "title": "“Erm, what the sigma?\" means \"What the heck?\"",
      "content": "“Erm, what the sigma?\" means \"What the heck?\" The phrase is an ironic way of saying \"What the heck?\" or \"What the h*ll?\" while poking fun at Gen Z and Gen Alpha internet humor. On TikTok, users make videos featuring the “Erm, what the sigma?” audio that spawned the meme, in which voices similar to Spongebob and Squidward from the show Spongebob Squarepants repeat the phrase. [1] X Research source One viral example of the meme is a TikTok video featuring footage of a scene from an episode of Spongebob Squarepants , but with a section of Squidward's dialogue replaced with, \"Erm, what the sigma?\" The phrase is also used in this caption to this TikTok about trying to use slang to talk to Gen Alpha or trying to understand younger people’s conversations. The phrase can be humorously combined with other nonsense memes like \"skibidi toilet.\" [2] X Research source \"Erm, what the sigma?\" is sometimes thrown around nonsensically, purely as a way to make fun of Gen Z/Alpha humor."
    },
    {
      "title": "Use it to show confusion while making fun of Gen Z/Alpha internet culture.",
      "content": "Use it to show confusion while making fun of Gen Z/Alpha internet culture. TikTokers (many of whom are themselves Gen Z or Gen Alpha) may use the “Erm, what the sigma?” audio in TikToks to jokingly signal that they are sigma males (a separate meme referring to a cool, lone-wolf male), to make fun of having brainrot (when one’s vocabulary becomes taken over by nonsense memes from spending too much time online), or just to show their pets running wild. [3] X Research source Essentially, use it to say \"What the heck?\" but with an ironic edge. As a comment or reply, you can type or say “Erm, what the sigma?” when the content of a video or situation seems bizarre and leaves you speechless. It also makes sense to comment the phrase on Spongebob Squarepants -related memes, since the voices in the TikTok audio that spawned the “Erm, what the sigma?” meme resemble Spongebob and Squidward."
    },
    {
      "title": "The “Erm, what the sigma?” meme went viral on TikTok in March 2024.",
      "content": "The “Erm, what the sigma?” meme went viral on TikTok in March 2024. It first appeared in a now-deleted TikTok from user @lawfreeza in which two Instagram voice messages were played, the second one saying the phrase, “Erm, what the sigma?” [4] X Research source The video was reposted by another user, @annamae_83, who highlighted the voice’s resemblance to Squidward’s. [5] X Research source It received more attention when user @huugh_mungus used the sound in a TikTok video of Squidward and Spongebob “reacting” to an ice cream cone by repeating the meme. [6] X Research source The original voice note audio of the phrase was a mash-up of a line from Family Guy —in which Stewie Griffin's catchphrase is, “Erm… What the deuce?”—and the slang term “sigma,” referring to a cool, lone wolf male. [7] X Research source"
    },
    {
      "title": "Sigma",
      "content": "Sigma The term “sigma” refers to a cool male who, unlike the alpha male, is a lone wolf figure. Sigma and alpha males are considered equal on the hierarchy of maleness. [8] X Research source The terms have their root in the toxic “manosphere” Internet communities, but have been appropriated by Gen Z and Gen Alpha to use ironically and in memes joking about being sigma (cool). [9] X Research source"
    },
    {
      "title": "“Erm… What the deuce?”",
      "content": "“Erm… What the deuce?” This phrase from the cartoon show Family Guy , repeated by character Stewie Griffin, likely inspired the original “Erm, what the sigma?” audio. The phrase became popular on the site iFunny in 2021 before meme variations (such as Plankton from Spongebob Squarepants saying “Erm… what the scallop?”) spread to other social media platforms in 2022. [10] X Research source"
    },
    {
      "title": "So That Just Happened",
      "content": "So That Just Happened Similar to “Erm, what the sigma?” are the Marvel one-liner memes like “So, that just happened” and “Well, this is awkward.” These meme phrases refer to the occasional cliché lines said in Marvel superhero films as jokes, which are viewed as cringe by Gen Z/Gen Alpha. [11] X Research source “So, that just happened” is often quoted in similar contexts to “Erm, what the sigma?” indicating a situation is absurd or cringe."
    }
  ]
}