{
  "url": "https://www.wikihow.com/Download-Videos-Using-Real-Player",
  "title": "How to Download Videos Using Real Player",
  "steps": [
    {
      "title": "Download the latest free version of RealPlayer.",
      "content": "Download the latest free version of RealPlayer. Go to RealPlayer.com and click the big orange button at the top."
    },
    {
      "title": "Install the software.",
      "content": "Install the software. On a PC, double-click the .exe file. As you run the install, you must agree to the usage terms and decide whether or not to include other features (ex. a weather toolbar) with your installation. On a Mac, drag the Real Player files into your Applications folder alias in the installation window. When you first launch RealPlayer, it will give you the licence agreement to approve. Click Accept to continue. Select the formats for which you want to make RealPlayer the default media player."
    },
    {
      "title": "Close your web browser.",
      "content": "Close your web browser. Toward the end of the installation, the installer will ask you to close your web browser in order to properly install RealPlayer’s One-Click Video Download function. Since you will need this in the ensuing steps, be sure to close your browser when prompted."
    },
    {
      "title": "Reopen your browser.",
      "content": "Reopen your browser. Find a video you want to add to your RealPlayer library. On a PC, hover your mouse over the video until a \"Download This Video\" button pops up above the upper right-hand corner of the video. Click on the \"Download This Video\" button and RealPlayer will download the video into your RealPlayer library. On a Mac, wait till the video has finished loading/buffering. Then click on the RealPlayer Downloader window, and the currently playing video will appear in the window. You can chose from there to download the video by clicking the Download button. When you click the Download button, the video will be saved to your library."
    }
  ]
}