{
  "url": "https://www.wikihow.com/Expand-Your-Singing-Voice-Range",
  "title": "Tips to Achieve More Powerful and Extended Vocal Range as a Singer",
  "steps": [
    {
      "title": "Find your natural range.",
      "content": "Find your natural range. The easiest way to do this is to have a voice coach help you, but you can figure it out on your own. Start with a middle C on a keyboard. Play it and match it with your voice. Do this again with the next note down and continue until you reach a note you cannot sing without straining your vocal cords. This is the bottom of your range. Repeat this process going up in pitch to find the top of your range. [1] X Research source Search online for videos of notes played up and down the keyboard if you don’t have access to a keyboard."
    },
    {
      "title": "Move through your normal range.",
      "content": "Move through your normal range. Start with your normal range. Hum as low as you comfortably can, then glide your voice up. Continue to slowly hum higher, stopping once it feels uncomfortable. Master that first, touching upon notes at the high and low end of the range. Don’t linger on notes that put a strain on your throat. Focus on staying relaxed. Perform scales at least eight to ten times a day in practice. Continue this range practice daily until you can hit the difficult notes eight to ten times in a session."
    },
    {
      "title": "Work up to difficult notes.",
      "content": "Work up to difficult notes. Continue to use the scale exercise, attempting to sustain difficult notes for long periods of time. Add in other exercises to loosen your vocal cords. Take a break whenever you feel uncomfortable. The more you reach these notes, the easier time you’ll have singing them without pain. One exercise you can add is slides. Sing a note. Instead of moving back and forth, stop at the next note. Do this for each note until you reach the end of your range. Another exercise is to grunt. Grunt to shorten your vocal cords, then sing a short word like “mom” in a note in your range. Move up or down your range each time."
    },
    {
      "title": "Round vowel sounds.",
      "content": "Round vowel sounds. Change the sounds of vowels during higher notes to put less pressure on your vocal cords. Try rounding your mouth into a loose oval shape as you speak a word such as “time.” Let your jaw drop and your tongue loosen. The “i” will take on an “ah” sound. [2] X Research source This isn’t useful at the lower end of your range because your vocal cords are already shortened. Use scale practice exercises to reach those notes."
    },
    {
      "title": "Transition to normal vowel sounds.",
      "content": "Transition to normal vowel sounds. At first, you can try singing individual words at the top of your range. Sing the word out loud, keeping the vowel sound rounded. At the end of the word, allow your throat to open so the vowel sound ends in the normal pronunciation. For example, transition back from an “ah” sound in “time” to the normal long “i” sound. As long as the normal sound returns before the next consonant, the word will still sound right to listeners. [3] X Research source As you practice singing songs, incorporate this vowel modification into words on high notes until it becomes second nature."
    },
    {
      "title": "Substitute words.",
      "content": "Substitute words. When you stumble over a certain word at a tough note in the middle of a song, substitute it for a simpler word such as “noo.” Practice the song again with the substitution until you are comfortable enough hitting the note to put the original word back in. Vowel modification can be used in conjunction with word substitution, such as when substituting “thet” for “that.”"
    },
    {
      "title": "Warm up before you sing.",
      "content": "Warm up before you sing. You should always take the time to loosen your vocal cords before you start. This is necessary to reach notes on the edges of your range and avoid damaging your voice. Possible warm-ups include performing trills, moving up and down your range with “me” or “oo” sounds, holding your mouth in an “o” and buzzing, and humming. For trills, place your lips together and make an “h” or “b” sound (lip trills) or place your tongue behind your upper teeth and make an “r” sound (tongue trills) as you move up and down your vocal range. You should also repeat exercises when you are finished singing to cool down your vocal muscles."
    },
    {
      "title": "Breathe properly while singing.",
      "content": "Breathe properly while singing. Expanding your range involves mastering the basics of singing. One of these techniques is proper breathing . Inhale deeply so the diaphragm muscle under your lungs pushes your stomach out. When you exhale to sing, bring your stomach slowly in so that you can sing longer and control your tone. [4] X Research source Practice controlling your breath by breathing in for a set interval such as four seconds, holding for four seconds, then breathing out for four seconds. Increase the intervals as you practice. Taking in and using too much air at once won’t help you sing higher notes. Take in a single deep breath at a time and give your vocal cords a constant airflow to avoid strain."
    },
    {
      "title": "Adopt proper posture.",
      "content": "Adopt proper posture. Good posture also serves to enhance the airflow necessary to stretch your range. Plant your feet on the ground, shoulder-width apart. Allow your shoulders to relax as you straighten your back. Keep your head and neck up while singing. When you reach the notes on the outside of your range, remember to avoid tilting your head or stretching your neck."
    },
    {
      "title": "Relax your muscles.",
      "content": "Relax your muscles. Many beginning singers are tempted to tighten their body and strain their vocal cords to extend their range, but this is dangerous. Instead, stand firm against the floor without feeling tense. Don’t raise your muscles towards your throat when you sing. Allow your tongue and throat to stay as loose as possible. This will reduce your strain and increase your airflow, helping you reach notes on the edges of your range. [5] X Research source One way to practice staying loose when not singing is to stick your tongue out ten times, two to three times per day."
    }
  ]
}