{
  "url": "https://www.wikihow.com/Find-Information-on-a-Business-That-No-Longer-Exists",
  "title": "How to Find Information on a Business That No Longer Exists",
  "steps": [
    {
      "title": "Contact the state where the business is registered.",
      "content": "Contact the state where the business is registered. Companies must register with the State Secretary or Division of Corporations where they conduct business. This is public information that is usually searchable online. Locate your State Secretary by entering the search terms Secretary and the name of the state you are researching in the search engine."
    },
    {
      "title": "Contact the Better Business Bureau.",
      "content": "Contact the Better Business Bureau . [1] X Trustworthy Source Better Business Bureau Nonprofit organization dedicated to promoting marketplace trustworthiness by educating consumers and reviewing businesses Go to source The Better Business has information on thousands of businesses throughout the United States. You can find reviews and complaints about the business you are researching."
    },
    {
      "title": "Locate records through the Library of Congress.",
      "content": "Locate records through the Library of Congress. Find historical information. The Library of Congress has compiled a list of resources to assist researchers in finding information on old businesses. [2] X Trustworthy Source Library of Congress Official library of the U.S. and main research institution for Congress and the American public Go to source Ask a Library of Congress Librarian. If you have trouble finding information online, you can submit your question directly to library staff. [3] X Trustworthy Source Library of Congress Official library of the U.S. and main research institution for Congress and the American public Go to source"
    },
    {
      "title": "Search the Securities and Exchange Commission's databases.",
      "content": "Search the Securities and Exchange Commission's databases. [4] X Trustworthy Source U.S. Securities and Exchange Commission Independent U.S. government agency responsible for regulating the securities industry, which includes stocks and options exchanges Go to source Any business that offers publicly traded securities must file reports with the SEC. If the company you are looking for was in business on or after 1996, you can use the SEC online search engine to find information. Request copies of documents. You can request documents not accessible through the search engine by submitting an online form. [5] X Trustworthy Source U.S. Securities and Exchange Commission Independent U.S. government agency responsible for regulating the securities industry, which includes stocks and options exchanges Go to source There may be a fee for certain documents."
    },
    {
      "title": "Locate websites that are no longer online on the Wayback Machine.",
      "content": "Locate websites that are no longer online on the Wayback Machine. The Wayback Machine is an online archive of more than 200 billion web pages, found at https://archive.org/web/ . If you know the name of the website that the business you're looking for used to use, you can enter it in the search bar to see snapshots of the webpage at previous points in time."
    },
    {
      "title": "Find business records for a company in your community.",
      "content": "Find business records for a company in your community. Research records at the county clerk's office if you know the county where the business was located. Locate the correct office by searching the National Association of Counties website. [6] X Research source"
    },
    {
      "title": "Contact your state's Department of State.",
      "content": "Contact your state's Department of State. The Department of State registers business entities and maintains old business information for any business in its jurisdiction. Find your state's Department of State office either through an online search or by going to the National Association of Secretaries of State website. [7] X Research source"
    },
    {
      "title": "Locate the company information to verify your employment history.",
      "content": "Locate the company information to verify your employment history. When you are looking for a new job, your new employer may ask for verification for your previous employment. Start with the information you have on hand. Use recent pay documents such as pay stubs or tax forms to verify your job title and salary history. Contact the Social Security Administration. Request your earnings history on the Social Security Administration website at https://www.ssa.gov/ . You will be charged a fee depending on the number of years for which you're requesting information."
    },
    {
      "title": "Locate former contacts.",
      "content": "Locate former contacts. Search social media. Sites such as LinkedIn may have contact information on the company, as well as your former managers and coworkers. Attend networking meetings in your former industry. You may meet former colleagues or friends of theirs who can help you contact them. Contact your university's alumni association for colleagues who graduated from your school."
    },
    {
      "title": "Attempt to collect a debt from a defunct company.",
      "content": "Attempt to collect a debt from a defunct company. Know your rights. When a business closes, its legal obligations do not end. [8] X Research source When you discover a company that owes you money is about to close, consult an attorney with the appropriate knowledge to protect your interests. If the business you have been working with declares bankruptcy, it may still be possible to collect all or part of the debt. The Small Business Association provides general guidelines on how the collection process works. If you are unable to collect the debt from the defunct business, you may be able to write it off as a tax deduction. The IRS provides information on what it does and does not allow to be written off. [9] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source"
    },
    {
      "title": "Attempt to access a defined benefit (traditional pension) plan from a defunct company.",
      "content": "Attempt to access a defined benefit (traditional pension) plan from a defunct company. Contact the plan custodian. If your plan was administered by a financial company such as Fidelity or Vanguard, you can contact them to find the information you need. You can get the company's contact information on their website. If your plan was not administered by a financial company, try contacting the Pension Benefit Guaranty Corporation (PBGC). This is a federal agency that guarantees pensions of bankrupt companies. Their website is https://www.pbgc.gov/ ."
    },
    {
      "title": "Attempt to access a defined contribution (401(k)) plan from a defunct company.",
      "content": "Attempt to access a defined contribution (401(k)) plan from a defunct company. Contact the plan custodian. If your 401(k) was administered by a financial company, contact them to find the information you need. If your plan custodian is no longer in business, contact the U.S. Department of Labor’s Employee Benefits Security Administration (EBSA). Call toll-free at 1-866-444-3272 or contact them online at https://www.dol.gov/ebsa/ . Check the National Registry of Unclaimed Benefits to see if you are listed as a missing participant. You can find it at https://www.unclaimedretirementbenefits.com/ ."
    },
    {
      "title": "Locate information on the stock certificate.",
      "content": "Locate information on the stock certificate. Find or inherit stock certificates from a company no longer in business? According to the Securities and Exchange Commission, an old stock or bond certificate may still be valuable even if it no longer trades under the name printed on the certificate. [10] X Trustworthy Source Investor.gov Website maintained by the Securities and Exchange Commision’s Office of Investor Education and Advocacy providing free resources about investing. Go to source You can find this information printed on the certificate: The CUSIP. This is a nine-character alphanumeric code that uniquely identifies a security. This can be used to research the history of the company, including mergers, reorganizations, and other changes. The stock's transfer agent. A transfer agent is a financial company such as a bank or trust company that keeps track of who owns a business's stocks and bonds. The State Securities Regulator. You can locate the state where the company was incorporated on the face of the certificate. [11] X Research source If the company no longer exists in any form, you may still be able to sell the certificate as a collectible. [12] X Research source"
    },
    {
      "title": "Check public records online.",
      "content": "Check public records online. The Harvard Law School Library provides information on how to get started searching public records. [13] X Research source Search the Library Of Congress Business History database at https://www.loc.gov/rr/business/guide/guide1/businesshistory/intro.html ."
    },
    {
      "title": "Contact your state historical society.",
      "content": "Contact your state historical society. Many historical societies have information on businesses that operated in that state. You can find a list of state historical societies in the Preservation Directory. [14] X Research source"
    }
  ]
}