{
  "url": "https://www.wikihow.com/Fertilize-Soil-With-Eggshells",
  "title": "How to Fertilize Soil With Eggshells",
  "steps": [
    {
      "title": "Save your egg shells.",
      "content": "Save your egg shells. When you use eggs in a meal or for a recipe, save the shells. Crack open your raw eggs, rinse the shells with warm water, and let them dry in a sunny pot. Run your finger around the inside of the shell when washing it to remove any residue, but try to preserve the membrane. Most of the nutrients are in this. For best results, plan on using 4 to 5 eggs for each plant you want to fertilize."
    },
    {
      "title": "Crush the eggshells or grind them into a fine powder.",
      "content": "Crush the eggshells or grind them into a fine powder. You can crush them into flakes using your hands or a food processor. You can also grind them into a powder using a mortar and pestle or a coffee grinder instead. It is possible to use whole eggshells in your soil, but they will decompose much faster if they are crushed or ground into powder. [1] X Research source To make the crushing process easier, bake the eggshells at 350 degrees until the start to lightly brown before grinding."
    },
    {
      "title": "Add a few teaspoons of powdered eggshell into the hole if you are planting a new flower, herb, or vegetable.",
      "content": "Add a few teaspoons of powdered eggshell into the hole if you are planting a new flower, herb, or vegetable. [2] X Research source Once you have some eggshells in the hole, put the plant inside, and pat the soil around it. Putting eggshells directly into the hole with the plant ensures that the plant will get the nutrients from the decomposing eggshells."
    },
    {
      "title": "Add crushed eggshells around the base of your plant.",
      "content": "Add crushed eggshells around the base of your plant. [3] X Research source You do not need to cover the eggshells with soil. As they decompose, they will leach calcium and other nutrients into the soil. This will help your plants grow into strong, healthy plants."
    },
    {
      "title": "Mix crushed eggshells directly into potting soil.",
      "content": "Mix crushed eggshells directly into potting soil. When you buy plants from the nursery, you will need to transplant them outside, or into a new pot. Before you do this, consider mixing a handful of crushed eggshells into the soil. Overtime, the eggshells will leach their nutrients into the soil, and help the young plants grow into healthy, strong plants. If you aren't able to use eggshells right away, you can also crush them and add them to your compost bin."
    },
    {
      "title": "Crack open some raw eggs, rinse them with warm water, and let them dry in a sunny spot.",
      "content": "Crack open some raw eggs, rinse them with warm water, and let them dry in a sunny spot. When rinsing the shell, run your finger around the inside of the shell to get rid of any residue. Try to leave the membrane. Most of the nutrients are in this. Save the yolks and whites for breakfast, lunch, or dinner."
    },
    {
      "title": "Loosely crush the eggshells.",
      "content": "Loosely crush the eggshells. You can use your hands, a coffee grinder, or even a food processor. Crushing the eggshells will make it easier to measure them out."
    },
    {
      "title": "Place at least 2 tablespoons (30 grams) of crushed eggshells into a large pot.",
      "content": "Place at least 2 tablespoons (30 grams) of crushed eggshells into a large pot. This will be enough to brew 1 gallon (3.8 liters) of eggshell tea. Consider adding 1 tablespoon (15 grams) of Epsom salt for extra nutrition. Epsom salt is high in magnesium and sulfate, both of which are beneficial to plants."
    },
    {
      "title": "Fill the pot with water and bring it to a boil for a few minutes.",
      "content": "Fill the pot with water and bring it to a boil for a few minutes. You need 1 gallon (3.8 liters) of water for every 2 tablespoons (30 grams) of crushed eggshells. Boiling the water will give the eggshells a \"jump start\" and help them to start releasing their nutrients into the water faster."
    },
    {
      "title": "Remove the pot from heat, and let the eggshells steep, covered, for at least 24 hours.",
      "content": "Remove the pot from heat, and let the eggshells steep, covered, for at least 24 hours. [4] X Research source You can even let the eggshells steep for a few days. During this time, the eggshells will release their nutrients into the water."
    },
    {
      "title": "Strain the water into a jar, and leave it outside overnight.",
      "content": "Strain the water into a jar, and leave it outside overnight. This will allow the water reach outdoor temperatures, and lessen the risk of \"shocking\" the plants by being too hot or too cold. Some gardens find that this also helps the plants absorb the nutrients better. When leaving the jar outside, make sure that it is covered, and in a shady spot, out of sunlight."
    },
    {
      "title": "Water your plants with the diluted eggshell tea.",
      "content": "Water your plants with the diluted eggshell tea. For best results, use the eggshell tea once a month. The water will be infused with calcium and other nutrients, and give your plants a growing boost. Store any leftover water in a cool, dry place. [5] X Research source"
    },
    {
      "title": "Crack open a raw egg and remove the yolk and white.",
      "content": "Crack open a raw egg and remove the yolk and white. You can simply crack the egg in half, but you won't have much space to plant the seeds in. Instead, consider cracking the egg near the upper third with a spoon. Save the egg yolk and white for eating later. Don't use hardboiled eggs, as the shells would be brittle. If you already cooked the egg, save the water you cooked it in, let it cool, and use it to water your plants instead. Don't use colored or painted eggs (such as Easter eggs). The pigments in paints and markers contain dyes that can harm the delicate seedlings. [6] X Research source"
    },
    {
      "title": "Clean the shell, inside and out, using warm water, then set it down in the sun the dry.",
      "content": "Clean the shell, inside and out, using warm water, then set it down in the sun the dry. When rinsing the shell, be sure to run your finger around the inside of the shell to remove any residue."
    },
    {
      "title": "Consider poking a small drainage hole in the bottom of the shell using a pin or thumb tack.",
      "content": "Consider poking a small drainage hole in the bottom of the shell using a pin or thumb tack. It is easiest if you do this from the inside. It is not absolutely necessary, but it will help prevent over-watering, which can kill a young plant."
    },
    {
      "title": "Fill the eggshell with damp, seed-starting soil.",
      "content": "Fill the eggshell with damp, seed-starting soil. If you are having trouble getting the soil into the eggshell, roll up a piece of paper into a cone, and use it to funnel the soil into the shell instead. [7] X Research source You can also use a small spoon instead."
    },
    {
      "title": "Sprinkle 2 to 3 seeds on top and lightly cover them with more soil.",
      "content": "Sprinkle 2 to 3 seeds on top and lightly cover them with more soil. [8] X Research source Smaller plants, such as flowers and herbs, work best when starting in eggshells. Larger vegetables, such as beans, cucumber, and squash can work, but they will need to be moved outside 1 week after they sprout. [9] X Research source Consider easy-to-grow herbs, such as: basil, dill, and parsley. Marigolds are great for starting in eggshells, and they are edible too."
    },
    {
      "title": "Place the egg in a holder and place it on a sunny windowsill where it won't be disturbed.",
      "content": "Place the egg in a holder and place it on a sunny windowsill where it won't be disturbed. The holder can be as simple as an egg carton to as fancy as an egg holder. If you are using an egg carton, consider lining it with plastic first so that it doesn't get soggy from the draining water."
    },
    {
      "title": "Water the seeds, and wait for them to grow.",
      "content": "Water the seeds, and wait for them to grow. Depending on what type of seed you planted, you might see the seedling emerge in less than a week. When watering the seedlings, consider using a spray bottle instead of a watering can; it will be a lot more gentle on the delicate, young plants. Depending on how dry it is in your home, you may need to water the seeds every day to every few days. Consider rotating the eggshell every few days. This will allow the plants to get equal amounts of sunlight and grow more evenly. [10] X Research source You may need to pull out the smaller/weaker seedlings so that each eggshell has one plant growing in it. This will ensure that the young seedlings enough space to grow in."
    },
    {
      "title": "Transplant the eggshell outside when the seedling has 1 to 2 sets of true leaves.",
      "content": "Transplant the eggshell outside when the seedling has 1 to 2 sets of true leaves. Before you plant the egg in the soil, crush it slightly in your hand—enough to break the shell but not so much that the soil loses its shape. This will break the shell up a little and allow the roots to poke through. Eggshells are biodegradable. As they decompose, they will release nutrients and calcium into the soil, which will help the young plant grow. [11] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}