{
  "url": "https://www.wikihow.com/Determine-if-a-Street-Is-One-Way-or-Two-Way",
  "title": "How to Determine if a Street Is One Way or Two Way",
  "steps": [
    {
      "title": "Look for traffic control devices - such as traffic lights or street signs - as you drive.",
      "content": "Look for traffic control devices - such as traffic lights or street signs - as you drive. The presence of a street sign may differ on 1-way/2-way presence, but one thing is clear: the presence of any signs means you can travel that direction to that sign and complete the action without taking further action to the next location and so on. If you see a traffic light that works, there's a possibility that you are coming to a legal intersection that is allowed. Whether it's a One Way, Do Not Enter, or some other warning sign, this is something that will tell you the type of street it is. Some cities use \"Do Not Enter\" signs for traffic calming and limiting access from that intersection, but it might not be a \"one-way street\" unless marked as such. In other words, a car might enter from the other end, legally turn around mid-way (or pull into and out of a driveway), and then legally go the opposite way. If the street is not marked as being One Way, then it is not a One Way street. Since they never passed the Do Not Enter sign, it does not affect them."
    },
    {
      "title": "Look for warning street signs - including such signs as One Way or Do Not Enter.",
      "content": "Look for warning street signs - including such signs as One Way or Do Not Enter. These two signs can be great indicators of streets that are one-way and are well-marked. One Way streets have easy-to-spot signs, but Do Not Enter signs often mean \"the One Way Starts here.\" While One Way signs designate the direction the road is heading, Do Not Enter signs are placed so that traffic only flows one-way with cars heading in that direction, and who might be coming out."
    },
    {
      "title": "Look for parked cars - if any.",
      "content": "Look for parked cars - if any. Parked cars often show directions of travel on a street via a side of the road. Look for traffic flow and parked cars in the direction you wish to go. At least then, you will know that you can progress toward your destination. Secondarily, you can check for opposing traffic flow and/or parked cars. But be careful and be mindful because sometimes drivers park the opposite direction down a one-way facing traffic - which is unsafe! Cars parked in the same direction on both sides of the street indicate the direction of travel, and that it is a one-way street. Note that not everyone follows the rules about which direction they park on a public street. Cars parked in both opposing directions mean the street should be two-way. Use another method of verifying if there are no cars on either side of the street. When noticing cars on the same side of the street opposing one another, avoid using this method unless you can spot other cars further down the line and avoid factoring in that one car that might not be parked correctly on the street."
    },
    {
      "title": "Learn about the meanings of the colors of the street lines.",
      "content": "Learn about the meanings of the colors of the street lines. Street lines should come in two colors - white and yellow. If a street only has white lines on either side (with no yellow lines), this generally means the street is a one-way street - but doesn't tell you the direction of travel down this street. In the absence of the yellow lines marking the indication of passing traffic, this suggests there be no passing traffic on this route - marking a narrow street which is often a part of the one-way traffic flow. Yellow lines represent passing traffic but are often enough to say that the street may be wide enough for forming the possibility of a two-way street."
    },
    {
      "title": "Glance down the street to see if you see any traffic signal lights.",
      "content": "Glance down the street to see if you see any traffic signal lights. Watch for the backs of traffic lights. Glance at the signal lights in the opposite direction to confirm. If you only see the back of the signal lights, the street is one-way - going the other way. Look for blinking or steady traffic control device lights - a common indicator that this is a two-way street. There may also be signs prohibiting turns, such as \"No Right Turn\", or an arrow symbol on a traffic signal, when the street is one-way coming toward your location."
    },
    {
      "title": "Look at a street map - if you aren’t behind the steering wheel of a car.",
      "content": "Look at a street map - if you aren’t behind the steering wheel of a car. Look for arrows on maps, as arrows designate the presence of one-way streets and the direction of travel on that street. No arrows mean it's a good possibility this street is a two-way street. If you're taking directions from a GPS device or a passenger serving as your \"navigator\", remember that you are the driver and you are responsible for seeing the signs and following the law. Do not compound someone else's mistake by assuming they were correct. Cities are often designed so that one-way streets alternate. For example, if you cross an east-west one-way arterial route/street that is going west, the next street, in most cases, will be one-way going east. If you had read the map and later come to that intersection and found new presences of new One-Way designations, you might later need to recognize the need to adjust your course and later tell the navigation company the street's traffic control flow is different."
    }
  ]
}