{
  "url": "https://www.wikihow.com/Fix-Christmas-Lights-That-Are-Half-Out",
  "title": "How to Fix Half-Out Christmas Lights",
  "steps": [
    {
      "title": "Remove corrosion from the plug prongs and test the lights again.",
      "content": "Remove corrosion from the plug prongs and test the lights again. If the plug prongs on your string of lights look dark or corroded, bring back their brass shine by rubbing them with a sheet of medium- or fine-grit sandpaper. Use a clean cloth or tack cloth to wipe away any sanding dust, then try plugging in the lights again. [1] X Research source Corrosion on the plug prongs adds resistance that may prevent the necessary voltage from flowing through the light string. Once you clear the corrosion away, your lights may work again! If this doesn’t work, move on to other troubleshooting measures."
    },
    {
      "title": "Plug a light string that works into the half-out string.",
      "content": "Plug a light string that works into the half-out string. Skip this if you don’t have multiple strings of the same brand that you can’t daisy-chain together. Plug one end of your half-working string into an outlet, then connect a fully-functioning string to its other end. Before doing this, confirm that the second string is fully functional by plugging it into the outlet on its own. [2] X Research source Boss explains that if the second string still works, you either need to replace a bad bulb or replace a bad fuse . If the fuse is good but the string is still not working it is usually a broken connection somewhere in the line. If the functioning string doesn’t work when plugged into the half-working string, there’s likely a problem with the wiring or, if you have incandescent bulbs, you'll need to fix one or more shunts within the bulbs. [3] X Research source"
    },
    {
      "title": "Run a bulb tester over the string to find any bad bulbs.",
      "content": "Run a bulb tester over the string to find any bad bulbs. If you’ve narrowed down your likely problem to bad bulbs or bad fuses , use a bulb tester. Plug in the string of lights, then test each dark bulb by either touching it with or inserting it into the tester, depending on your model. [4] X Research source Depending on your tester model, it may beep or light up when you find a bad bulb. If you find one bad bulb, keep checking for more. Mark each one with masking tape so you know which ones to replace. Move on to replacing any bad bulbs that you find. If you don’t find any bad bulbs, move on to checking and replacing the fuses ."
    },
    {
      "title": "Pull up from the plastic seat of the bulb, not the bulb itself.",
      "content": "Pull up from the plastic seat of the bulb, not the bulb itself. If you tug on the bulb itself, you’ll probably just pull it and its 2 lead wires out of the plastic seat that fits into the socket. Instead, work your thumbnail into the small gap between the bulb seat and the socket exterior, then lift the seat and bulb together out of the socket. [5] X Research source Safety Warning: Always unplug the string of lights before replacing a bulb. Alternative: Some bulb seats have plastic latches that snap onto the socket exterior. Simply lift up any latches before pulling out the bulb and seat."
    },
    {
      "title": "Use a replacement bulb that’s an exact match.",
      "content": "Use a replacement bulb that’s an exact match. Holiday lights tend to look very similar, but they’re not universal. Different manufacturers may use slightly different bulbs, seats, sockets, and/or lead wires, any of which may prevent a non-matching replacement bulb from working properly. If you have the replacement bulbs that came with the string, use those first. [6] X Research source When buying strings of lights, consider buying an extra string for every 3 or so that you buy—that is, buy 8 strings if you need 6. Use the extra string(s) simply for backup bulbs. Pull the bulbs from the extra string(s), put them in a labeled bag, and store the bulb-free string(s) for use if the wiring on one of your other strings goes bad. Safety Warning: If you don't have an exact match, don't try to force a bulb that doesn't completely fit into place. Non-matching bulbs are far more likely to fail and, in very rare cases, may present a fire hazard if they short. It's safer to just buy replacement light strings."
    },
    {
      "title": "Press the new bulb securely in place, then test it.",
      "content": "Press the new bulb securely in place, then test it. Check to make sure that the 2 small lead wires are snug along opposite sides of the bulb seat. Then, press the bulb straight down into the socket until the seat is snugly in place. Plug the string of lights back in—if the whole string lights up, you’re all set! [7] X Research source If all the lights don’t come on, run the tester over your replacement bulb to make sure it is seated properly. If it isn’t, try removing and re-setting it again. If it is, move on to checking for other problems with the string of lights."
    },
    {
      "title": "Slide open the fuse compartment with a small screwdriver.",
      "content": "Slide open the fuse compartment with a small screwdriver. Boss explains that the fuse is located on the male-side end of the string of lights (the side with the plug prongs). Look for a small compartment cover on the side of the plug. Slide this cover out toward the plug prongs to expose the fuse compartment. A small screwdriver comes in handy here, although you may be able to slide open the compartment with an opened paperclip or your fingernail."
    },
    {
      "title": "Use an opened paperclip or other small tool to remove the fuses.",
      "content": "Use an opened paperclip or other small tool to remove the fuses. In nearly all cases you’ll find 2 small fuses inside the compartment—they look like tiny glass capsules with metallic tips. Use the end of an opened paperclip as a lever to get underneath and lift up each fuse. [8] X Research source Boss says that a tiny flathead screwdriver is perfect for the job if you have one."
    },
    {
      "title": "Confirm the fuse is bad by inspecting it carefully for damage.",
      "content": "Confirm the fuse is bad by inspecting it carefully for damage. If the glass section of the fuse is dark or looks burned on the inside, the fuse is 100% blown. Even if it isn’t blown though, it’s likely still the issue if you’ve ruled everything else out. Boss confirms that if you can’t tell for sure, it’s best to assume the fuse has blown and replace it. A blown fuse occurs when the small sacrificial wire within the fuse melts. It’s meant to do so as a protective measure if an excessive current passes through the line, although fuses can fail for other reasons as well."
    },
    {
      "title": "Install replacement fuses that are the same size and amperage.",
      "content": "Install replacement fuses that are the same size and amperage. Unlike bulbs, holiday light fuses usually are identical across brands. They’re nearly always the same size and rated for 3 amps, as indicated by a “3A” notation on the fuse. For the easiest replacement option, use the extra fuses that came with the string of lights. [9] X Research source Push your replacement fuses down into the compartment until they are fully seated. The tip of a pen may come in handy to help push the fuse in place. Slide the cover back over the compartment, then plug in the string and see if all the lights work. If replacing any bad bulbs and fuses hasn’t solved your problem, you likely have an issue with a bad shunt (in incandescent lights) or bad wiring."
    },
    {
      "title": "Purchase a holiday light repair tool.",
      "content": "Purchase a holiday light repair tool. If you use a lot of light strings in your holiday decorations, get a Christmas light repair tool . This will make replacing bulbs and shunts a breeze. [10] X Research source A good light repair tool is multi-functional. It should act as a voltage detector, bulb tester, bulb remover, and shunt repairer."
    },
    {
      "title": "Remove a bulb in (or close) to the section that won’t light.",
      "content": "Remove a bulb in (or close) to the section that won’t light. If your light repair tool has a bulb remover, use it according to the product instructions. Otherwise, use your thumbnail to pry the plastic seat of the bulb from the socket. [11] X Research source You can remove any bulb in the darkened section, or even a lit bulb that’s near the darkened section. Unplug the light string before removing a bulb, though."
    },
    {
      "title": "Insert the tool in the socket and send one or more pulses as instructed.",
      "content": "Insert the tool in the socket and send one or more pulses as instructed. The repair tool has a prong that fits into the light socket. Once it’s in place, pull the trigger on the device to send a pulse of energy through the string of lights. [12] X Research source Follow the specific instructions for your light repair tool. You may be instructed to trigger several pulses through the light string. Shunts are small backup wires inside each incandescent bulb that are meant to take over if the filament in the bulb fails, thereby maintaining a completed circuit. The pulses from the light repair tool should be enough to melt the insulated coating and activate any shunts that aren’t working."
    },
    {
      "title": "Replace the bulb and test the light string again.",
      "content": "Replace the bulb and test the light string again. Remove your light repair tool and press the bulb back into the socket firmly. With any luck, the entire string will light up when you plug in the lights! [13] X Research source If the string still won’t light fully, it’s probably time to just replace the whole thing."
    }
  ]
}