{
  "url": "https://www.wikihow.com/Find-a-Real-Estate-Broker-to-Work-For",
  "title": "How to Find a Real Estate Broker to Work For",
  "steps": [
    {
      "title": "Obtain a full list of real estate brokers by conducting an online search or checking your local community directory.",
      "content": "Obtain a full list of real estate brokers by conducting an online search or checking your local community directory. This will be the starting point from which you can narrow down your broker search. Find out which ones are recruiting new agents by calling, stopping into the office or visiting their websites. In general, brokers are looking for new agents and will be excited to talk to you."
    },
    {
      "title": "Research the real estate brokers in your area from a consumer perspective.",
      "content": "Research the real estate brokers in your area from a consumer perspective. Pay attention to the companies you would notice if you were looking for a broker as a seller or a buyer. It may be helpful to imagine you are from out of town and searching for a home. [1] X Research source Pay attention to yard signs, advertisements, open houses and social media presence. Assess at the level of professionalism in each form of advertising. Also drive by the brokerage's office. Make sure the office is conveniently located and has plenty of parking available for your clients. Check that the exterior is attractive enough that you would want to bring clients there. [2] X Research source"
    },
    {
      "title": "Conduct an online search of different brokers in your area.",
      "content": "Conduct an online search of different brokers in your area. A successful broker will have an attractive website, activity on sites such as Facebook and Twitter, and well written reviews and testimonials on sites such as Yelp. [3] X Research source An online real estate listings site will help you determine which brokers in your area handle the most listings (and do the most business). An advantage of joining a larger brokerage, at least at the start of your career, is that you immediately gain the reputation and trustworthiness of the brokerage."
    },
    {
      "title": "Talk to real estate agents in your area.",
      "content": "Talk to real estate agents in your area. Find out what the most desirable companies are, and why. If you completed your real estate education locally, you may also be able to ask the professionals at your school for broker recommendations. [4] X Research source"
    },
    {
      "title": "Consider real estate brokers that operate through a virtual office.",
      "content": "Consider real estate brokers that operate through a virtual office. There are more brokers popping up these days that do not have a store front, allowing you to meet with clients at public places like coffee shops or your own home. These can be a good fit if you want to work from home, though commissions are usually less. Look for places that have benefits such as online training and easily accessible mentors."
    },
    {
      "title": "Discuss different brokers with other professionals that deal with real estate agents.",
      "content": "Discuss different brokers with other professionals that deal with real estate agents. These can include mortgage lenders, appraisers, home inspectors, and attorneys, among others. If possible, get an idea of which brokers they prefer to work with. [5] X Research source"
    },
    {
      "title": "Check out the National Association of Realtors.",
      "content": "Check out the National Association of Realtors. Their website contains resources for new agents as well as information and statistics on real estate brokers around the country. The US Department of Labor also offers advice on choosing a broker on their website. [6] X Research source"
    },
    {
      "title": "Schedule an interview with brokers you are interested in.",
      "content": "Schedule an interview with brokers you are interested in. Most brokers will jump at the chance to talk to a potential new agent. Call their local offices and schedule an interview to get started. Read the rest of this section first and have a mental (or physical) list of questions ready for your interviewer. Know what sort of answers to your questions you prefer."
    },
    {
      "title": "Find out what mentoring programs, if any, are available with different brokers.",
      "content": "Find out what mentoring programs, if any, are available with different brokers. If you are just starting out, you will benefit from a broker who helps you establish your career. A good mentor can give you area-specific tips that you won't learn in the licensing process. [7] X Research source Look for training programs or seminars that are offered or encouraged. Some brokers will even help you pass your real estate exam for licensure if you sign on with them while you are training to be an agent."
    },
    {
      "title": "Research how many agents are with each broker, how long they stay and what their experience levels and areas of expertise are.",
      "content": "Research how many agents are with each broker, how long they stay and what their experience levels and areas of expertise are. If many agents have been with a broker for long periods of time, it is a good sign that the broker treats their agents fairly. You can generally find this information on the broker's website."
    },
    {
      "title": "Ask brokers you might work for about what the scheduling expectations are.",
      "content": "Ask brokers you might work for about what the scheduling expectations are. You might be required to put in a specific number of hours at the office or attending open houses and other events. Knowing what the broker expects will help you match your expectations and preferred working style with those of the broker."
    },
    {
      "title": "Talk about commissions.",
      "content": "Talk about commissions. Most brokers divide the commission 50-50 with their agents. You will also need to know which party pays for licensing, marketing materials and benefits such as health insurance. The amount of control a broker usually has over these things will often be similar to the amount of control they have over your selling process. [8] X Research source"
    },
    {
      "title": "Determine how referrals and leads are handled.",
      "content": "Determine how referrals and leads are handled. You will want to know if agents are assigned potential clients in a specific way, or if it will be up to you to bring in your own clients. Some brokers, especially larger ones, offer leads and other lead-generation services to agents. This can be invaluable if you are in a new area or are just starting out."
    },
    {
      "title": "Assess the available technology.",
      "content": "Assess the available technology. Some brokers require their agents to provide their own laptops, cell phones and other devices. Other brokers might provide computer access, copiers, fax machines and even iPads or tablets. Factor this in to the cost of getting started in your real estate career. [9] X Research source"
    }
  ]
}