{
  "url": "https://www.wikihow.com/Deposit-Cash-with-USAA",
  "title": "Using ATMs and Money Orders to Deposit Cash to Your USAA Account",
  "steps": [
    {
      "title": "Navigate to the USAA ATM locator tool on a web browser.",
      "content": "Navigate to the USAA ATM locator tool on a web browser. USAA has a number of locations nationwide where you can manage your USAA accounts, primarily using an ATM. Navigate to the ATM finder , or click on “Find and ATM” under the “Banking” tab of the USAA website to get started. [1] X Research source Clicking on a dot on the map brings up specific information about that location and the services available there."
    },
    {
      "title": "Enter your zip code to find the nearest ATM.",
      "content": "Enter your zip code to find the nearest ATM. On the USAA ATM locator page, use the “Service” dropdown menu to limit your search results to ATMs where you can deposit cash. Then, enter your city, state, ZIP code, or a nearby landmark to narrow the results to your locale. [2] X Research source Note that there are relatively few locations where you can use an ATM to deposit cash with USAA—USAA only allows customers to deposit cash at USAA-branded ATMs, or withdraw cash from USAA partner (or “preferred”) ATMs. The ATM locator specifies which is which. If you frequently have cash deposits, you may want to check this map before you open a checking account with USAA."
    },
    {
      "title": "Travel to the ATM and deposit your cash.",
      "content": "Travel to the ATM and deposit your cash. If you live in an area with an ATM that accepts USAA cash deposits nearby, you have a relatively easy way to deposit cash with USAA. Insert your USAA ATM or debit card when instructed by the screen, and input your PIN to access your account. Follow the on-screen prompts to complete your transaction. [3] X Research source Double-check that the machine counted your cash correctly, and keep your receipt. These ATMs will take up to 30 bills at a time, and don't require any deposit slips or envelopes."
    },
    {
      "title": "Check your account online to monitor your deposit.",
      "content": "Check your account online to monitor your deposit. Depending on the location where you made your deposit, there may be a hold on your funds. Use the USAA website, mobile app, or call a teller to keep an eye on the status of your deposit. Also check for information on your receipt telling you when your funds will be available. [4] X Research source Check your USAA account within 24 hours to make sure your deposit is accurately reflected in your account."
    },
    {
      "title": "Purchase a money order.",
      "content": "Purchase a money order. Buy a money order at a post office, Western Union, or some grocery stores and discount stores, such as Walmart or Publix. When filling out the money order, you are the purchaser and recipient, and the business you’re purchasing from is the payee. Fill out your information in the appropriate fields, like your full name and address. [5] X Research source You can typically deposit amounts up to $1,000 with a single money order, so purchase multiple money orders if you plan to deposit more than that. You'll have to pay a fee to get your money order issued, but it's usually no more than a couple of dollars. The US Postal Service only charges 45 cents for military money orders. If you have trouble or are confused, ask the desk worker for assistance—they’re trained and knowledgeable when it comes to filling out money orders. Keep the receipt for the money order, in case you lose it or run into other complications later."
    },
    {
      "title": "Download the USAA mobile app.",
      "content": "Download the USAA mobile app. If you don't already have the USAA app on your smartphone, download it for free from your device’s app store. Then, provide your personal details to set up access to your USAA account. It only takes a few minutes! [6] X Research source Sign in to your account on the app using the same credentials that you use on the USAA website. Depending on the security you have set up, you may need to enter a code (sent through text or email) to verify your identity."
    },
    {
      "title": "Endorse the back of the money order with your signature.",
      "content": "Endorse the back of the money order with your signature. Since the money order is payable to you, flip it over and sign in the endorsement area on the back of the money order. Add the words \"For mobile deposit only at USAA FSB.\" [7] X Research source Optionally, add your account number in the endorsement area for additional security, though this isn't strictly necessary."
    },
    {
      "title": "Select \"Transfer/Deposit\" on the mobile app.",
      "content": "Select \"Transfer/Deposit\" on the mobile app. Open the mobile app and tap the \"Deposit\" menu tab, then choose \"Deposit Into Bank Account.\" Indicate that you want to deposit a check or money order, then follow the instructions on the screen. [8] X Research source If you just downloaded the app or have never made a mobile deposit before, grant the app access to your phone's camera to complete your transaction."
    },
    {
      "title": "Scan both sides of the money order using your phone's camera.",
      "content": "Scan both sides of the money order using your phone's camera. A guide will appear on your phone screen. Lay the money order down on a flat, dark surface so that the 4 corners of the money order are within the guidelines and the writing on the money order is clear and visible. Then take a picture. Repeat with the other side of the money order. [9] X Research source After you take each photo, you'll have the opportunity to review the quality. If it seems blurry or crooked, take the photo again. Once you're satisfied with the photos, enter the amount of the money order. If you have more than one account, select the account where you want the money deposited."
    },
    {
      "title": "Send the money order to USAA by mail if you prefer.",
      "content": "Send the money order to USAA by mail if you prefer. If you’d rather not use the mobile app, order deposit slips from the USAA website , and mail the money order with a completed deposit slip via USPS to the address below: [10] X Research source USAA Federal Savings Bank / ATTN: Bank Priority Mail 9861 / 10750 McDermott Freeway / San Antonio, TX 78284-9908"
    },
    {
      "title": "Locate a USAA Preferred ATM.",
      "content": "Locate a USAA Preferred ATM. While you can't deposit cash into a Preferred ATM, you can withdraw funds, check account balances, or move funds between accounts without accruing any ATM fees. Use the ATM finder tool on the USAA website to locate a Preferred ATM near you. [11] X Research source Look for ATMs that have an \"Allpoint,\" \"MoneyPass,\" or \"PNC Bank\" logo. These are USAA Preferred ATMs. If you find a Preferred ATM attached to a bank branch, consider opening an account at that bank, then use that account for cash deposits and also manage your USAA account from the same location."
    },
    {
      "title": "Get a prepaid debit card.",
      "content": "Get a prepaid debit card. With a prepaid debit card, you may be able to reload it with cash around the clock. When you get the debit card, link the card to your USAA account to easily transfer money from the card to your account online. [12] X Research source Shop around for prepaid debit cards to find the one with the lowest fees that has convenient locations for you to reload the card."
    },
    {
      "title": "Use another bank account for cash deposits.",
      "content": "Use another bank account for cash deposits. If you already have a checking account at a brick-and-mortar bank, deposit your cash into that account and then transfer the money to your USAA account. It may not be the easiest or most efficient way to deposit cash with USAA, but it’s a helpful alternative to ATMs and money orders. [13] X Research source While USAA doesn't charge any fees for incoming transfers, the other bank may charge a fee to initiate the transfer. Speak with a bank teller about how much the transfer is going to cost you before you open an account, especially if you're going to have frequent cash deposits. Also keep in mind hold times. Using this method may mean your funds aren't available in your USAA account for several days. USAA also enables customers to use Zelle , a money transfer app, to send instant transfers between accounts."
    },
    {
      "title": "Write a check",
      "content": "Write a check from another account. If you have a friend or family member who has a checking account with a brick-and-mortar bank, they may be able to work out an arrangement with you. Deposit the cash in their bank account, then have them write you a check for the total. [14] X Research source Once you get their check, deposit it using the USAA mobile banking app on your phone."
    }
  ]
}