{
  "url": "https://www.wikihow.com/Fill-in-Photoshop",
  "title": "How to Fill in Photoshop",
  "steps": [
    {
      "title": "Open an image in Photoshop.",
      "content": "Open an image in Photoshop. You can do this by launching Photoshop and going to File > Open to select a file. Unless you're opening a file with multiple layers saved in it, this will make the selected image the background layer of your Photoshop canvas."
    },
    {
      "title": "This is a safety precaution.",
      "content": "This is a safety precaution. If you do this, you don't have to worry about making crucial mistakes and messing up the original image in the background. Right-click the background layer on the Layers panel on the lower-right corner, and select Duplicate Layer here. Alternatively, you can select your background layer on the Layers panel, and press ⌘ Command + J on Mac or Control + J on Windows."
    },
    {
      "title": "This tool looks like a paintbrush icon and a dashed circle on the toolbar panel.",
      "content": "This tool looks like a paintbrush icon and a dashed circle on the toolbar panel. You can find it in the upper-left corner of your screen. You can also just press W on your keyboard to switch to Quick Selection. The Quick Selection tool is grouped with the Magic Wand tool on the toolbar. If you can't find Quick Selection, click and hold Magic Wand to access it. Alternatively, you can use the Marquee Tool to make a selection. It will allow you to select a rectangular or elliptical area in the image."
    },
    {
      "title": "Click all the areas you want to include in your selection.",
      "content": "Click all the areas you want to include in your selection. As you click each option, you'll see dashed lines around the edges. If you select an area by mistake, you can remove it from your selection by holding Alt and clicking on the area you want to exclude. You can adjust your selection's brush tip size in the upper-left corner of the Photoshop window."
    },
    {
      "title": "Click the Edit tab.",
      "content": "Click the Edit tab. This menu item is next to File on the top-left. It will open a drop-down menu."
    },
    {
      "title": "The Fill tool is on the Edit menu.",
      "content": "The Fill tool is on the Edit menu. This will open your Fill options in a new pop-up window. If you want to use a keyboard shortcut, press ⇧ Shift + F5 to open and use the Fill tool."
    },
    {
      "title": "Click the \"Contents\" drop-down menu and choose Color.",
      "content": "Click the \"Contents\" drop-down menu and choose Color . This option will allow you to fill the selected area with a solid color fill. It will open the Color Picker window. Alternatively, try other options here like Content Aware and Pattern . Content Aware will fill the selected area with patterns derived from around your selection. It will remove whatever's inside your selection, and replace it with what's in the background. Pattern will allow you to select a custom graphic pattern and fill the selected area with it."
    },
    {
      "title": "Click a color in the Color Picker window.",
      "content": "Click a color in the Color Picker window. You can click anywhere on the gradient to choose your color."
    },
    {
      "title": "Click OK in the Fill window.",
      "content": "Click OK in the Fill window. This will fill the selected area with the color you've picked."
    }
  ]
}