{
  "url": "https://www.wikihow.com/Crochet-Baby-Sandals",
  "title": "How to Crochet Baby Sandals",
  "steps": [
    {
      "title": "Make a foundation chain.",
      "content": "Make a foundation chain. [1] X Research source Attach your base color to the crochet hook with a slipknot, then work 12 chain stitches from the loop. See the \"Tips\" section if you need instructions on forming slip knots or chain stitches. You will use two yarn colors for this project: a base color and an accent color. For now, start with your base color."
    },
    {
      "title": "Stitch around the foundation chain.",
      "content": "Stitch around the foundation chain. For your first row, you will crochet up one side of the chain, then back down the other side. The top of the chain will be larger than the bottom and will eventually form the toe area of the sole. Single crochet three times in the second chain away from the hook. If you do not know how to single crochet, check the \"Tips\" section for instructions. Single crochet once in each of the next six chains. Half double crochet once in each of the next three chains. Check the \"Tips\" section for information about the half double crochet. Half double crochet seven times in the last chain. This completes one side of the chain. Work your way back down the chain, starting with one half double crochet in each of the next three stitches. Single crochet once in each of the next six stitches. Single crochet twice in the last stitch. Slip stitch this last stitch to the first single crochet from the other side. Check the \"Tips\" section for instructions on making the slip stitch."
    },
    {
      "title": "Expand the sole outward.",
      "content": "Expand the sole outward. Your second row will consist of single crochets and half double crochets, much like your first row. In the process, you will work all the way around the perimeter of the sole. Chain one. Single crochet once into the same stitch. Single crochet twice into the next stitch. Single crochet once into each of the next six stitches. Half double crochet once into each of the next four stitches. Half double crochet twice into each of the next three stitches. Half double crochet three times into the next stitch. Half double crochet twice into each of the next three stitches. Half double crochet once into each of the next four stitches. Single crochet once into each of the next six stitches. Single crochet twice into the next stitch. Single crochet once into the same stitch as the first single crochet of this row. Slip stitch the last and first stitches of this row together."
    },
    {
      "title": "Half double crochet around the sole.",
      "content": "Half double crochet around the sole. The third and final row will require you to work around the perimeter of the sole, finishing the shape in the process. This row uses mostly half double crochets. Chain two. Half double crochet twice into the same stitch as your chain. Half double crochet once into the next stitch. Half double crochet twice into the stitch after that. Half double crochet once into each of the next 14 stitches. Half double crochet twice into each of the next seven stitches. Half double crochet once into each of the next 14 stitches. Half double crochet twice into the next stitch. Half double crochet once into the stitch after that. Half double crochet twice into the next stitch. Join the first and last stitches of the row using one slip stitch."
    },
    {
      "title": "Fasten off the sole.",
      "content": "Fasten off the sole. Cut the yarn, leaving a 3 to 4 inch (7.6 to 10 cm) tail. Pull this tail through the loop on your hook to create a knot and secure the sole. Weave the excess tail into the stitches along the wrong side of the sole to hide it from sight and hold it in place. This step completes one sole."
    },
    {
      "title": "Repeat three more times.",
      "content": "Repeat three more times. You will need to make three more soles using the same technique outlined for the first sole. One of these soles should use your base color. The other two should use your accent color."
    },
    {
      "title": "Slip stitch two soles together.",
      "content": "Slip stitch two soles together. Place one base sole on top of one accent sole. Slip stitch the soles together through the center stitches at the back of the heels. Use your accent color yarn to do this. Note that your base color sole should be the top piece and your accent color sole should be on the bottom. The wrong sides of the soles should face each other as you do this."
    },
    {
      "title": "Single crochet around the soles.",
      "content": "Single crochet around the soles. Make one single crochet in the outer loops of each stitch set. Repeat all the way around the perimeter of the soles. This should add a border to the soles while joining both layers together."
    },
    {
      "title": "Fasten off the yarn.",
      "content": "Fasten off the yarn. Cut the yarn, leaving a 3 inch (7.6 cm) tail. Pull this tail through the loop on your hook to knot it in place. Weave the excess tail into the stitches of your bottom layer."
    },
    {
      "title": "Repeat with the other two soles.",
      "content": "Repeat with the other two soles. Slip stitch the other two soles together at the back, then single crochet both layers together in each set of stitches around the perimeter. Fasten off the yarn as usual. When finished, you should have two identical soles, each made with two layers. Note that these two soles should be mirror images of each other, just like standard sandals would be."
    },
    {
      "title": "Locate your starting point.",
      "content": "Locate your starting point. Examine your stitches at the back of the heel and find the center stitch. Count five stitches to the right of this stitch; this will be your starting point. Note that you will be working into the trim you created when joining the soles together, so those are the stitches you need to count out in this step. Also note that you should use your accent color when creating the back heel."
    },
    {
      "title": "Single crochet across the heel.",
      "content": "Single crochet across the heel. Single crochet once into your starting stitch, then once into each of the next nine stitches after that. You will be working toward the center back of the heel at first. After your first five stitches, you will end up working past the center to its left. This row of single stitches should be evenly centered along the back."
    },
    {
      "title": "Work a second row of single crochet.",
      "content": "Work a second row of single crochet. Chain one, then single crochet once into each of the stitches of your original back heel row."
    },
    {
      "title": "Fasten off the yarn.",
      "content": "Fasten off the yarn. Cut the yarn, leaving an 8 inch (20 cm) tail or so. Pull this tail through the loop on your hook to knot the yarn. The excess tail here will be used to help sew the pieces together later."
    },
    {
      "title": "Repeat.",
      "content": "Repeat. Follow the same procedure outlined here to crochet a back heel onto your other sole."
    },
    {
      "title": "Make a foundation round.",
      "content": "Make a foundation round. Work 7 chain stitches from your hook, then slip stitch the first and last together to form a ring. Use your accent color yarn. Note that this piece is worked separately from the rest of the sandal and will be joined to the body of the sandal later."
    },
    {
      "title": "Single crochet across each stitch.",
      "content": "Single crochet across each stitch. For the first round, single crochet once into each of the stitches in your foundation ring. Do not join the first and last stitches of the round together."
    },
    {
      "title": "Single crochet another 22 rounds.",
      "content": "Single crochet another 22 rounds. You will need to make a total of 23 rounds. For each round, simply single crochet once into each stitch of the previous round. Do not join the first and last stitches of any of the rounds together. You will use the \"continual round\" technique; in other words, the first stitch of the next round will be worked through the top loop of the first stitch from your current round. There are no \"in between\" steps to advance you to the next round. The strap should curl up into a tube as you work."
    },
    {
      "title": "Slip stitch the opening closed.",
      "content": "Slip stitch the opening closed. Fold the tube in half so that both open ends meet. Slip stitch the bottom four stitches together. Gradually work up the opening, slip stitching as you go, to close the tube and create a closed strap. You will end up working through four sets of stitches."
    },
    {
      "title": "Fasten off the yarn.",
      "content": "Fasten off the yarn. Cut the yarn, leaving an 8 inch (20 cm) tail. Pull this tail through the loop on your hook to knot off the ankle strap. This tail needs to remain long so that you can sew the ankle strap to the toe strap later."
    },
    {
      "title": "Sew the ankle strap to the back heel.",
      "content": "Sew the ankle strap to the back heel. Position the ankle strap so that its tail is pointed toward the front of the sandal. Whip stitch the bottom loops of the ankle strap to the top loops of the back heel using your accent yarn. You should whip stitch the pieces together using a yarn (tapestry) needle instead of a crochet hook. Check the \"Tips\" section if you need instructions on whip stitching."
    },
    {
      "title": "Repeat.",
      "content": "Repeat. Follow the same steps outlined above to make a second ankle strap. Whip stitch this second ankle strap to the back heel of the other sandal."
    },
    {
      "title": "Create a foundation round.",
      "content": "Create a foundation round. Chain six using your accent color yarn, then join the last and first stitch together with a slip stitch to form a round. This piece will also be worked separately from the rest of the sandal and joined later. Leave an 8 inch (20 cm) starting tail when forming the slipknot attached to your crochet hook. This tail will be used to sew the strap to the sole later."
    },
    {
      "title": "Single crochet a total of 11 rounds.",
      "content": "Single crochet a total of 11 rounds. Work one single crochet into each stitch of your foundation round to complete the first round. You will do the same thing to form the next 10 rounds. Single crochet once into each stitch of the previous round. Do not join the first and last stitches of each round together. Simply move from one round to the next without taking any extra steps to advance. At the end of the very last round, slip stitch the first and last stitch of the round together. As you crochet, a tube should form."
    },
    {
      "title": "Fasten off the round.",
      "content": "Fasten off the round. Cut the yarn, leaving another 8 inch (20 cm) tail. Pull this tail through the loop on your hook to tie a knot and secure the strap piece. This tail should lie on the opposite end of your starting tail. The long tail will help you sew the strap to the sole."
    },
    {
      "title": "Sew each side of the strap onto the sole.",
      "content": "Sew each side of the strap onto the sole. Using a yarn needle and the tails on each side of the toe strap, whip stitch both ends of the ankle strap to the sole of the sandal, near the toe area. Locate the center stitch at the front of the toe area. Count back five stitches from this center and attach the front of one strap end to this stitch. Sew the rest of the strap on, moving back toward the ankle strap as you work. Count back five stitches from the center front of the sole on its opposite side. Sew the other side of the strap on in the same way you attached the first side. Note that you should be sewing the open ends of the tube closed as you whip stitch the strap to the sole."
    },
    {
      "title": "Whip stitch the ankle strap to the toe strap.",
      "content": "Whip stitch the ankle strap to the toe strap. Pinch the toe strap and ankle strap together at their natural centers. Use the tail of the ankle strap to whip stitch across four stitches in the center of the toe strap, joining the toe pieces together. Knot the tail and weave it into the inside of either strap to help secure the stitching."
    },
    {
      "title": "Repeat.",
      "content": "Repeat. Follow the same steps outlined here to create a second toe strap. Attach this toe strap to the sole and ankle strap of the other sandal using the same procedure you used for the first."
    },
    {
      "title": "Take a final look.",
      "content": "Take a final look. Weave in or cut away any excess tails you see. With this, the baby sandals should be complete and ready for use."
    }
  ]
}