{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Savior-Complex",
  "title": "How to Get Rid of a Savior Complex",
  "steps": [
    {
      "title": "Become an active listener.",
      "content": "Become an active listener . Notice that oftentimes others may just want to vent, not be fixed. A big problem for many “rescuers” is assuming others are helpless and unable to resolve their own problems. If you take up the practice of listening more actively, you may learn that your help is not needed—just a supportive shoulder and listening ear. When a partner or friend comes to you with a problem, aim to understand rather than immediately reply. Make occasional eye contact with the person. Face them. Examine their body language to cue into their emotional state (e.g. tensed shoulders may express fear or hesitation). Offer nonverbal cues like nodding to show you’re listening. Try to separate what you’re hearing from your own judgments in order to connect to the speaker’s message. If you’re not sure of what they’re trying to convey ask clarifying questions like “Are you saying…?” [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Wait before stepping in.",
      "content": "Wait before stepping in. In addition to actually listening to what your loved one is saying, defy your savior nature and wait it out. You may find that people can often help themselves if given the chance. In fact, you may have been unwittingly building learned helplessness or enabling your loved ones by always swooping in to save the day. [2] X Research source Challenge yourself to not offer help or advice when a loved one comes to you with a problem. Repeat a mantra in your head like “I can be present for a friend without rescuing or fixing.” If a friend is going through a difficult time, try giving them validating statements instead of offering to help. For example, you can say, \"I'm so sorry you're going through this right now.\" This shows your empathy without involving you in the problem."
    },
    {
      "title": "Offer help only when requested.",
      "content": "Offer help only when requested. One key aspect of the savior complex is the ingrained desire to help even when it’s not wanted or requested. Automatically assuming everyone wants to be rescued can actually be insulting since it demonstrates that you don’t believe in their ability to help themselves. [3] X Research source Prevent yourself from this by only taking action after a clear appeal for help. For example, if a friend tells you about a bad day, simply listen without offering your own resolution. Only if the friend asks, “What do you think?” or “What should I do?” should you step into the helping role. If a friend does ask for your help, only provide as much help as you are willing to give. Establish boundaries so that you do not over-commit yourself. For example, you can say, \"I don't think that I can talk to your friend for you. What I can do is help you take your mind off of your fight.\""
    },
    {
      "title": "Stop taking responsibility for other adults.",
      "content": "Stop taking responsibility for other adults. Despite the close relationship you might have with partners, relatives, or friends, you need to realize that these individuals are separate entities in charge of their own lives. When you play the role of savior, you place everyone else into roles similar to helpless children or invalids. It’s hard to see a loved one hurting or making a mistake, but it’s not your job to rescue them or correct every negative situation they encounter. [4] X Research source In fact, adversity is oftentimes a cornerstone to positive growth and development. They need to go through difficulty in order to learn and improve. If you take that from them, you rob them of learning opportunities. To help others establish their independence, try asking them questions about how they might handle the situation. You might ask things like \"What do you think you can do about this?\" or \"What options have you entertained?\""
    },
    {
      "title": "Accept your own inadequacy.",
      "content": "Accept your own inadequacy. Many people with the savior complex come off as goody two-shoes, lecturing others about their wrongdoings and many negative habits. While this may not be your intention, your loved ones may view your constant “fixing” habit as an indicator that you think they are broken or screwed up. Everyone has flaws. A person not recognizing that he or she has flaws is a flaw! Realize that \"success\" is defined subjectively. What is right for one may be wrong for another. You may have a particular way of judging what is best for a person, but that does not necessarily mean the other person sees it just in that way. Check assumptions on knowing what is right for another. This is particularly true of peer relationships. There are some things like abusive situations, drug abuse, suicidal signs and the like that are fairly clear on being bad and needs immediate intervention. Accept your own strengths and weaknesses. You may or may not be the person to do a task or offer advice. No one person can do everything well."
    },
    {
      "title": "Be single",
      "content": "Be single . The savior and white knight often jumps from relationship to relationship, “rescuing” the helpless or damaged. If this describes you, it may be time to take a hiatus from relationships. If you are not in a long-term or committed relationship, take some time to enjoy being single and nurturing your own needs. [5] X Research source Spending some time single can help you gain more awareness into your compulsive helping/rescuing tendencies. It can also give you time to explore the parts of yourself that trigger this habit. You may want to set an amount of time that you remain single to help you keep this goal. For example, you might want to give yourself six months. During this time, set goals for your self-improvement."
    },
    {
      "title": "Set objective goals for yourself.",
      "content": "Set objective goals for yourself. Compulsive helpers often allow their efforts to fix others to prevent them from doing any personal development of their own. What’s more, by viewing yourself as a savior you develop unrealistic goals that eventually wear away at your self-esteem. By creating realistic goals, you can rebuild. [6] X Research source Select a goal for yourself that allows you to focus only on you. This might include anything from losing weight to writing a novel. Make it a SMART goal , which is specific, measurable, attainable, realistic, and time-bound. You might say, “I want to lose 15 pounds in 10 weeks.” Then, map out how you will achieve this goal: “I will eat a serving of vegetables at every meal. I will exercise 5 days per week. I will drink only water.” Run through your goals with another person. They may be able to tell if you if the goals are realistic or not. They may also be able to give you ideas to achieve your goals."
    },
    {
      "title": "Create a self-care toolbox.",
      "content": "Create a self-care toolbox. Individuals with a savior complex frequently dedicate all their time and energy to others, placing them in dire need of self-care. Balance your excessive helping of others by doing something nice for yourself. Create a routine that includes various nurturing activities. You might create a soothing nighttime ritual to help you sleep better. Adopt a new exercise habit such as running or yoga. Get your hair or nails done weekly. Or, simply run a warm bath and listen to relaxing music. Pour back into yourself. Ask a friend or family member to be an accountability partner. This is a person who will check in and make sure you're following through with your self-care. Ask them to check in with you often."
    },
    {
      "title": "Examine past relationship patterns.",
      "content": "Examine past relationship patterns. Are you even aware of your innate need to fix or control others? Some people reading this may be in denial of a savior complex. By taking a closer look into your relationships with others, you can see a pattern of compulsive helping. Have you stayed in a relationship in which you were unhappy because you thought the other person needed you? Do you find yourself frequently worrying about others and their problems? Do you feel guilty when others help or give to you? Are you uncomfortable letting others experience negative emotions, so you quickly try to resolve the problem? Do you exit unhealthy relationships only to find yourself connecting with similar people as your past partners? [7] X Research source If you answered yes to any of these questions, you may want to visit a therapist. A therapist can help you determine if these are unhealthy behaviors for you."
    },
    {
      "title": "Spot aspects of yourself that you have neglected.",
      "content": "Spot aspects of yourself that you have neglected. You may not realize that in your attempt to fix everyone around you, you have left yourself starving emotionally, psychologically, and spiritually. Perform a self-assessment to look closer at areas of personal need. You may find that you have been projecting your own shortcomings onto those around you. [8] X Research source Identify your personal values . What beliefs, ideas, and principles drive your decisions and goals? Have you been living according to your values? Examine your emotional intelligence . Are you able to recognize your emotions and effectively express them? Take a look at your self-worth . Is your self-esteem connected to how much others value or need you?"
    },
    {
      "title": "Acknowledge and make peace with childhood trauma or neglect.",
      "content": "Acknowledge and make peace with childhood trauma or neglect. The compulsive need to rescue or help others is often rooted in your childhood. Researchers believe those who suffer from a savior complex or white knight syndrome are trying to fix some negative sense of themselves that arose in early life. Low self-esteem, abuse, or neglect may have contributed to this complex. You may choose friends or partners who are going through distress similar to that which you experienced in childhood. [9] X Research source Awareness is the first step in being able to repair a damaged sense of self. Take notice of the relational patterns you form and offer yourself compassion. You might even say aloud, “I am drawn to damaged or toxic people because I am trying to rescue the part of myself that was abused as a child.” In addition to acknowledging this connection, it may help to see a professional counselor who can work with you to heal from past wounds."
    },
    {
      "title": "See a therapist for codependency issues.",
      "content": "See a therapist for codependency issues. Deep down, people with savior complex or white knight syndrome have a problem with codependency. Codependency describes your reliance on others to feel emotional voids. In a sense, you neglect yourself in favor of doing for others because your self-worth comes from the desire to be needed. [10] X Research source You can recover from codependency by working with a competent mental health therapist who has experience in this area. It may also help to participate in self-help support groups for people with codependency issues. Researching codependency may help you identify your own patterns and needs. It can help you find a solution that works for you."
    }
  ]
}