{
  "url": "https://www.wikihow.com/Get-Hollow-Cheeks",
  "title": "How to Get the Hollow Cheek Look",
  "steps": [
    {
      "title": "Eat a healthy diet and exercise regularly.",
      "content": "Eat a healthy diet and exercise regularly. Naturally hollow cheeks are largely determined by genetics and bone structure. You can’t change your bones without surgery, but you may be able to reduce extra facial fat to make your cheekbones look more prominent. There’s no way to target facial fat, though, so you’ll need to exercise to burn fat all over to decrease the amount of fat in your cheeks. [1] X Research source Even with weight loss, your natural bone structure still plays a big role in how hollow your cheeks look. If your cheekbones are naturally flat, exercise alone may not be enough. Age is another factor that affects how your cheekbones look. The younger you are, the rounder your cheeks are likely to be. Your face will naturally get slimmer as you age, especially once you get into your 30s and beyond."
    },
    {
      "title": "Try targeted facial exercises to work your cheek muscles.",
      "content": "Try targeted facial exercises to work your cheek muscles. The jury is out on whether facial exercises alone can make your face look more toned and sculpted. Science tells us that targeting fat in specific places (like your cheeks) isn’t possible. [2] X Research source Many people say they’ve had good results after doing facial exercises, though, and there’s certainly no harm in trying them for yourself. The cheek lifter: Open your mouth and make an “O,” allowing your upper lip to fold over your top teeth. Smile to lift your cheeks and place your fingers on the top part of each cheek. Hold for 10 seconds, then release. Do 3 sets of 10 reps. The cheek sculptor: Smile without showing your teeth. Then, press your lips together and smile even wider to force your cheek muscles up. Place your fingers at the corners of your mouth and gently slide them up to the apples of your cheeks. Hold for 20 seconds, then release. Do 3 sets of 10 reps. [3] X Research source Kiss the ceiling: Tilt your head backward so that you’re looking straight up at the ceiling. Pucker your lips to simulate a kissing motion, hold for a few seconds, then relax your lips. Repeat this 10-20 times."
    },
    {
      "title": "Apply concealer 2-3 shades lighter than your skin under your eyes.",
      "content": "Apply concealer 2-3 shades lighter than your skin under your eyes. After applying your usual foundation, add concealer under each eye in a triangle shape that goes along your bottom lash line to the side of your nose. Blend the concealer well and set it with translucent powder . [4] X Research source The undereye concealer brightens the area, evens out your skin tone, and creates a smooth base."
    },
    {
      "title": "Add cream contour 3-4 shades darker than your skin under each cheekbone.",
      "content": "Add cream contour 3-4 shades darker than your skin under each cheekbone. Draw a line of cream contour directly beneath the cheekbone in the hollow of each cheek, starting at the hairline by your ear and angling down towards your mouth. Blend the contour upward toward your cheekbone and ear (rather than downward) with a sponge or your fingers. [5] X Research source If you don’t like cream contour, feel free to use powder contour instead ! Use an angled makeup brush to apply the powder. The darker contour creates the illusion of higher, more defined cheekbones and emphasizes the hollows of your cheeks."
    },
    {
      "title": "Apply highlighter along the top of your cheekbones to make them pop.",
      "content": "Apply highlighter along the top of your cheekbones to make them pop. Use a light hand so the effect looks lifted but still natural. For a little extra glam and an ultra sculpted look, try applying a cream concealer or highlighter first and then dusting a shimmer highlighter directly over it. Set your look with a dusting of translucent powder and add blush (if desired). [6] X Research source"
    },
    {
      "title": "Buccal fat removal",
      "content": "Buccal fat removal Buccal fat is the naturally occurring fat pad in the lower part of each cheek. Buccal fat surgery removes these fat pads to create a more defined look. If your face is already thin or narrow, though, a surgeon may be reluctant to do buccal fat extraction. The ideal candidate is someone who has a naturally round or chubby face. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Buccal fat removal became a popular trend during the Covid-19 pandemic, possibly because many people spent time scrutinizing their faces on video calls. Procedure description: The surgery takes about an hour and is typically done under local anesthesia (although some surgeons may offer intravenous sedation and general anesthesia). A small incision is made on each side of the mouth to remove the fat pads, so there’s no scarring. Recovery takes 2-3 weeks, and the full results are visible after the swelling goes down completely. [8] X Research source Is it permanent? Yes, buccal fat removal is permanent. Risks and complications: Infection, bleeding, nerve damage, overcorrection (too much fat removal resulting in a gaunt appearance), and facial asymmetry. Average cost: $2,000 to $5,000."
    },
    {
      "title": "Cheek implants",
      "content": "Cheek implants Cheek implants add volume to the cheek area, which improves facial contours and creates a more sculpted appearance. If your goal is to get hollow cheeks, your surgeon will probably recommend malar implants. Malar implants are placed directly on top of the cheekbones to give them more height and definition. Most cheek implants are made of silicon. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Procedure description: Cheek implant surgery typically takes up to an hour and is done under general anesthesia (which means you’ll be asleep the whole time). The surgeon will make an incision inside your mouth or under your eyelid, fit the implant into place on your cheek and secure it, then stitch you up. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Is it permanent? Yes, cheek implants are permanent, but the procedure is also reversible if you don’t like the results. Risks and complications: Bleeding, infection, numbness, chronic pain, implant migration, asymmetrical look. Average cost: $2,000 to $4,000."
    },
    {
      "title": "Cheek filler",
      "content": "Cheek filler Getting cheek filler can define and enhance your cheekbones and create a hollow look underneath the bones. The most commonly used fillers are hyaluronic acid fillers. Cheek filler is a super common procedure; more than 3 million people get cheek filler every year. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Procedure description: Cheek filler injections take 15 to 30 minutes. Your injector will clean your skin and apply a numbing agent. The filler is injected with a thin needle in small amounts right under the skin in several areas of the cheek to create the desired look. You’ll feel a little pinch or sting, but the pain is minimal. Is it permanent? Cheek filler is temporary and usually lasts for about a year. If you dislike the results, your injector can dissolve the cheek filler for you. Risks and complications: Bleeding, bruising, lumps, hives, itchiness, redness, swelling, and tenderness. Average cost: $600 to $3,500."
    },
    {
      "title": "Aging",
      "content": "Aging As we age, our bodies produce less collagen and elastin, which are proteins responsible for keeping the skin firm and plump. Natural fat pads in the cheeks also diminish over time, especially around the mouth, and cheek muscles atrophy over time, as well. All of these changes create a sunken, hollow look in the cheek area. [12] X Research source"
    },
    {
      "title": "Weight loss",
      "content": "Weight loss Losing body fat means you’re also losing facial fat, whether intentional or unintentional. Volume loss in the cheeks leads to that hollow look. That said, if your cheekbones are naturally flat, weight loss may not result in hollow cheeks–it all depends on your facial structure. [13] X Research source"
    },
    {
      "title": "Genetics",
      "content": "Genetics Some people are born with naturally high cheekbones, which creates that sculpted hollow cheek look. Other people are genetically predisposed to having thinner cheeks in general. [14] X Research source"
    },
    {
      "title": "Lifestyle factors",
      "content": "Lifestyle factors Things like smoking, poor nutrition and chronic dehydration can cause cheeks to look hollow or sunken in. Smoking in particular can create this look because cigarettes damage the skin’s collagen and elastin, which often leads to volume loss in the cheek area. [15] X Research source"
    },
    {
      "title": "Medical conditions",
      "content": "Medical conditions Other health factors can also contribute to the hollow cheek look, including hormonal imbalances, autoimmune diseases, and conditions that specifically affect the face. Health conditions that can cause extreme weight loss, like anorexia and cancer, can also make cheeks look noticeably sunken in. [16] X Research source"
    },
    {
      "title": "Many people like the look because models tend to have hollow cheeks.",
      "content": "Many people like the look because models tend to have hollow cheeks. Most models are quite thin and naturally have high cheekbones, which helps create that carved out look. Hollow cheeks may be perceived as attractive because people see them on the covers of magazines, but the truth is, all facial structures can be attractive! Hollow cheeks aren’t inherently better looking than round, healthy cheeks. [17] X Research source As people age, the hollow cheek look tends to become less desirable because full, round cheeks are associated with youth."
    },
    {
      "title": "Hollow cheeks aren’t healthy or unhealthy—they’re just a facial feature.",
      "content": "Hollow cheeks aren’t healthy or unhealthy—they’re just a facial feature. Some people are born with higher cheekbones and others aren’t—it usually doesn’t indicate anything health-wise. There are unhealthy ways to go about getting the hollow cheek look, though, like extreme weight loss or risky facial surgeries. Many people believe the healthiest look is embracing the unique face you were born with. There's nothing wrong with going for the hollow cheek look if you want to, but you don’t need to change yourself to be beautiful. [18] X Research source"
    }
  ]
}