{
  "url": "https://www.wikihow.com/Eat-Prawns",
  "title": "How to Eat Prawns",
  "steps": [
    {
      "title": "Use the knife to remove the prawn’s head.",
      "content": "Use the knife to remove the prawn’s head. First, you will want to examine the prawn to see if the head, shell, and tail are there. If the head is still attached, spear the prawn with your fork to keep it in place on your dish. Using a back and forth motion, slice off the prawn’s head with your knife. Begin setting aside the parts of the prawn that you don’t plan on eating. You can do this on the edge of the dish or on a napkin. [1] X Research source The prawn’s head is a shell segment that is separate from the rest of the body. [2] X Research source"
    },
    {
      "title": "Insert the knife",
      "content": "Insert the knife under the prawn’s shell and pull upwards. Skewer the prawn with your fork on one end to anchor it in place, and stick your knife beneath the shell. If you pull your knife up quickly, the shell should be freed from the rest of the prawn. Continue this process down the prawn’s body until you remove the entire shell. [3] X Research source Keep separating the removed pieces of prawn so that they do not get mixed in with the rest of your meal. [4] X Research source If you can’t find the shell at first, turn the prawn on its back. Start by inserting your knife near the head and slicing downwards to get better traction while separating the shell from the body. [5] X Research source"
    },
    {
      "title": "Separate the tail from the rest of the prawn with a knife.",
      "content": "Separate the tail from the rest of the prawn with a knife. Stick your fork into the prawn to hold it steady. This should be easier now that you have removed the shell. A quick slice should remove the prawn’s tail. [6] X Research source"
    },
    {
      "title": "Devein the prawn’s entire body.",
      "content": "Devein the prawn’s entire body. Look for the prawn’s intestinal tract, which will appear as a dark line running down its back. Stick your fork into the bulk of the prawn to hold it steady before using your knife to make a shallow cut around the length of the tract. Use the tip of your knife to coax the tract away from the rest of the prawn. At this point, you can eat the prawn. [7] X Research source While the intestinal tract is not dangerous to eat, it will change the texture of a cooked prawn. [8] X Research source Be sure to place the prawn’s vein among the other inedible parts. [9] X Research source On their own, prawns can be paired with a variety of dishes (i.e, pasta, pizza, curry, burgers). [10] X Research source If you want to serve full prawns with the shells on, you need not devein them. Using a microwave to defrost prawns may make them soggy or overcooked like other things."
    },
    {
      "title": "Use two hands to remove the head.",
      "content": "Use two hands to remove the head. If your prawn has eyes, then it still has a head. Hold the prawn in one hand to keep it secure. [11] X Research source Grab just beneath the prawn’s eyes to get a firm grip on its head. Quickly twist to separate the head from the rest of the meat. [12] X Research source"
    },
    {
      "title": "Insert the tip of your finger beneath the prawn’s shell and pull.",
      "content": "Insert the tip of your finger beneath the prawn’s shell and pull. If you touch the meat of the prawn and feel a hard surface, then the shell probably hasn’t been removed. [13] X Research source Don’t be discouraged if you can’t pry off the whole shell in one try. [14] X Research source When cooked properly, prawn shells can be eaten. [15] X Research source Prawn shells contain chitosan, a substance believed to help in lowering cholesterol. Still, most people enjoy shrimp shells for their texture alone. [16] X Research source"
    },
    {
      "title": "Pull the prawn’s tail quickly to remove it from the body.",
      "content": "Pull the prawn’s tail quickly to remove it from the body. Check for a hard, shell-like piece at the end of the prawn to see if the tail is still attached. [17] X Research source Hold the prawn securely in one hand while using the other to grip the prawn’s tail. Use a quick, forceful movement to remove the tail. [18] X Research source Once the shell has been removed, the remaining tail section will be significantly harder than the rest of the prawn. This should make it easier for you to identify and remove. [19] X Research source"
    },
    {
      "title": "Use your fingers to devein the prawn.",
      "content": "Use your fingers to devein the prawn. Look for a long, dark line going along the back of the prawn. [20] X Research source This is the intestinal tract of the prawn. [21] X Research source Glide a fingernail down the back of the prawn to cut into the meat of the prawn. Once you have located the intestinal tract, use two fingertips or fingernails to pinch and remove the tract from the rest of the body."
    }
  ]
}