{
  "url": "https://www.wikihow.com/Field-Dress-a-Duck",
  "title": "How to Field Dress a Duck",
  "steps": [
    {
      "title": "Find out the ID regulations in your area.",
      "content": "Find out the ID regulations in your area. In some regions, duck carcasses need an entire wing left on for identification purposes with the game warden, while other places allow you to retain the heads and entrails separately for ID. Since this affects how you'll dress out your birds, it's important to find out how they'll be checked if and when the game warden comes calling. Duck hunting regulations vary widely. In some areas, you'll only be allowed to collect a certain number of duck per day, so it's a good idea to be up-to-date on the specific regulations in your area. Federal guidelines can be found here , while local regulations can be found on the website of the Department of Natural Resources or the Hunting and Finishing bureau in your state."
    },
    {
      "title": "Clean the ducks immediately after retrieving them.",
      "content": "Clean the ducks immediately after retrieving them. When you collect a duck, it'll have been floating around in pond water, rolling in the mud, and probably mouthed by your golden retriever for a couple minutes before you got to it. In other words, it's pretty dirty, and it's important to take a few minutes to clean it up a bit before packing it up or dressing it out to keep the meat from spoiling. [1] X Research source Clean any dirt and fecal matter from the feathers, especially around the tail of the duck. Dry it thoroughly and pack it in a cooler, or start dressing it immediately, depending on your intentions. Below 40 F, a duck carcass will be fine for 3-5 days in clean conditions, without doing anything. [2] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Locate the shot and keep track of it. The meat around the area the pellets(s) entered will be scorched and less than tasty. You'll need to be careful to remove any shot from the carcass, and to trim away any meat around the area later, so it's a good idea to clean it out now."
    },
    {
      "title": "Age ducks 1-2 days at less than 40 °F (4 °C).",
      "content": "Age ducks 1-2 days at less than 40 °F (4 °C). Letting meat dry out some will intensify the flavor in the right ways, reducing gaminess and making your duck more tasty. [3] X Research source In the right conditions, you can do this without dressing the bird out, or you can do it after you've skinned or dressed the bird. Either way is fine for a clean bird. If the temperature is right, you can hang birds upside down by their feet to drain out, in a shed or garage, as long as it's cool enough. Otherwise, keeping them in plastic bins in the refrigerator is also fine, as long as there's enough air circulation. Different hunters like to dress out the birds at different points in the process. If you're out and going to collect lots of birds, it's likely you'll want to breast them out in the field as quickly as possible to keep down on your baggage. Alternatively, it's perfectly fine to keep the ducks whole, get them on ice quickly, and wait a couple days before dressing them in the right conditions."
    },
    {
      "title": "Decide if you'll skin or pluck your ducks.",
      "content": "Decide if you'll skin or pluck your ducks. Skinning a duck is much faster and easier, especially in the field. Depending on how you'd like to cook your duck, though, some people prefer to leave the skin on, which means a more time-intensive plucking process needs to happen. Both ways are perfectly acceptable and will be covered below. [4] X Research source It's sometimes better to skin diver ducks and ducks shot around salt water. The fatty skin can sometimes taste a little fishy and be orange-colored, if the duck has consumed a lot of shellfish. [5] X Research source It's fine to pluck all others kinds of ducks, if you want to take the time. Foodies and gourmands agree: cooked properly, the crispy skin of a roast duck can be one of the most desirable parts of the meal. The skin is especially fatty, meaning that it can imbue the meat with lots of flavor. If you can take the time to save the skin, many people think it's well worth it."
    },
    {
      "title": "Remove the feet with clippers.",
      "content": "Remove the feet with clippers. Start by clipping off both feet as close as possible to the body as possible, using wire cutters or a sharp knife. It usually works best to use something with a scissor-action, so you can lop them off quickly and cleanly. Some people choose to toss the feet, but you can hang on to them and use them for making stocks and broths if you want to be especially resourceful."
    },
    {
      "title": "Remove one or both wings, if you don't need to keep them on.",
      "content": "Remove one or both wings, if you don't need to keep them on. With your clippers, clip the joint where the wing meets the body, as close as possible. Then, use a sharp knife to run along and separate the rest of the skin connecting the wing to the body. Then, do the same thing to the other wing. Alternatively, you can also clip the wings at the middle joint, just after the long feathers end, if you want to retain the top-most connective tissue where the wing meets the body. There's not much meat there, but there is some. If you do this, clip the joint, then run your knife back down along the wing toward the bird's \"armpit.\" If you want to skin your bird in the field, but need to leave the wings on for ID purposes, read the section called \"Breasting Out Ducks Quickly.\" You can skin the duck, but leave the wings on very easily."
    },
    {
      "title": "Feel for the breast-bone with your finger.",
      "content": "Feel for the breast-bone with your finger. On a sturdy, flat surface, lay the duck down on its back and feel for the breastbone. The easiest way to start peeling the skin away is to start with your fingers, just where the bone pokes up. You don't have to pluck the feathers before you do this, but some hunters prefer removing some of the chest feathers to get out of the way before you start skinning. That's fine, but you'll only need to remove a few before you can get a finger on the skin, making it easier to do all at once."
    },
    {
      "title": "Use your hands and tear in opposite directions, firmly and smoothly.",
      "content": "Use your hands and tear in opposite directions, firmly and smoothly. It's likely you'll have to dig in there, and you'll probably pull some feathers free before you get the hang of it. That's fine, just try to get a finger on the skin itself and start to open it up. Pull the skin in opposite directions, like you were removing it's jacket. Alternatively, some like to hold the duck so the back is facing your chest, and use the tips of the fingers to tear into the skin and peel it back, like you were opening your shirt. This is usually a better method when you're out in the field, since you won't be able to lay the bird down on the ground, probably."
    },
    {
      "title": "Peel the skin back.",
      "content": "Peel the skin back. Since you've removed the wings and the feet, you can pull the skin all the way off the bird, except around the neck. Once you've opened up the skin on the chest, keep peeling it back, over the \"shoulders\" where the wings met, and off the bottom around the tail. The tail feathers should stay stuck to the bird. You shouldn't have to use a knife, though the skin is a bit stickier than rabbit skin on most ducks. Try to use as smooth a pull as possible."
    },
    {
      "title": "Remove the feet and wings as before.",
      "content": "Remove the feet and wings as before. Use your clippers and your knife to remove the feet and the wings to give yourself a smaller area with which to pluck. If you need to save the wings or other parts of the duck for ID, later, do so. Alternatively, if you're plucking, some hunters like to leave the feet on to hold onto during the plucking process. It's up to you. You can always remove them later, if you wish."
    },
    {
      "title": "Pull large flight feathers and tail feathers in the direction of growth.",
      "content": "Pull large flight feathers and tail feathers in the direction of growth. There's not much of a secret to removing the outer layer of large feathers: just start plucking. They'll be tenacious, so you might just need to pull them one at a time, or a few at a time, pulling them straight out from the carcass."
    },
    {
      "title": "Remove the smaller torso feathers against the grain.",
      "content": "Remove the smaller torso feathers against the grain. Smaller feathers are more quickly plucked several at a time, working from the bottom of the bird up toward the neck, against the grain. If you've got the right leverage and the right amount of elbow grease, you can get these feathers off a lot more quickly with some practice. Use your thumb and forefinger to start ripping them back and off. You won't be able to remove all the feathers this way. You'll be left with a fine layer of super-soft downy feathers that are next-to impossible to remove by hand. Collect all the rest of the feathers in a bag for easy removal. They're also excellent for stuffing and other projects."
    },
    {
      "title": "Heat water and paraffin wax in which to dip the birds and remove the down.",
      "content": "Heat water and paraffin wax in which to dip the birds and remove the down. In a large pot, boil enough water in which to submerge the duck, and melt in a block of paraffin wax, available at most grocery stores and other outlets. [6] X Research source It should float in a layer right on top of the hot water. When you're ready, remove the water from the heat. Use one package or block of paraffin wax per duck. It's likely you won't need to really boil the water to melt the wax, so keep a close eye on it. When the wax is melted, the water is fine and you're ready to dunk the birds."
    },
    {
      "title": "Dunk the duck.",
      "content": "Dunk the duck. Quickly and gently dunk the bird through the layer of wax floating on top of the water, then immediately submerge the duck into a bucket of cold water to set the wax firmly. You don't need to soak the bird for longer than a couple of seconds, and in fact it's better to do it quickly. Before you've removed the entrails, it's important not to heat up the carcass too much, or you'll risk some spoilage. [7] X Research source Immediately after pulling the duck from the hot wax bath, dunk it into a bucket of cold water to set the wax. You can let the duck sit in the cold water for a minute or two while the wax sets up, but it should happen very quickly."
    },
    {
      "title": "Peel the wax away from the skin.",
      "content": "Peel the wax away from the skin. Now, there should be a hard crust of wax around the duck, which you can peel away to remove the downy under feathers. Squeeze the bird around the midsection to crack the wax and peel away the chunks in as large a portions as possible. The under skin should look very clean, like a chicken you bought at the store."
    },
    {
      "title": "Remove the head.",
      "content": "Remove the head. As you peel the skin up toward the neck, you'll have to remove the head before the skin will come off entirely without tearing. Peel the skin back to expose the point at which the neck meets the body, and use your clippers to cut as close as possible to the body and remove the head."
    },
    {
      "title": "Remove the tail.",
      "content": "Remove the tail. After you remove the skin from around the torso of the duck, the tail feathers will likely be stuck on, attached to a small ring of fat around the base of the carcass. Use your clippers to cut the feathers off, cutting right through and removing that ring of fat from the rest of the bird."
    },
    {
      "title": "Make an incision into the side of the bird, under the rib.",
      "content": "Make an incision into the side of the bird, under the rib. There's no meat south of the rib-line of the duck, so the best way to remove the entrails is usually to cut around the base of the breast, underneath the rib, to separate the cavity with the entrails from the good meat. Run your knife up along the bottom of the breast plate, making smooth and shallow cuts. When you get to the other side, grasp the lower portion of the bird and pull firmly to remove the entrails. The intestines should come out in one clean go. You can remove the heart and liver separately, which might stick up in the body cavity, and remove the gizzard from above. You can eat the liver if you remove the bile duct, which is greenish in color, kind of like an gel-cap pill. The heart is also edible, but somewhat small. Alternatively, some hunters prefer to remove the gizzard from the top of the duck and remove the rest of the entrails from that cavity. It's a smaller space to work with, however, and farther away from the intestines, which need to be removed with care to avoid spoilage."
    },
    {
      "title": "Trim away the meat around the shot.",
      "content": "Trim away the meat around the shot. Examine the meat on the bird. There should be a scorched-looking section, where the pellets entered the carcass. This will need to be removed, because it will taste \"off.\" Remove any shot from the meat very carefully, and discard the scorched meat. To finish off the dressing process, clean the meat and remove any remaining feathers and dirt stuck on. You can run the meet under some cool water, or simply clean it off with a clean towel. The loose feathers can be tenacious."
    },
    {
      "title": "Store the meat properly.",
      "content": "Store the meat properly. Duck meat needs to be kept in a cool, dry place, preferably around 40 °F (4 °C). Wrap your meat loosely in butcher paper and store in a cooler, when you're in the field, until you can get it back to the refrigerator. It should be fine for about a week. If you've got a lot of meat and you want to freeze some immediately, Ziplock freezer bags are the best method. Pack duck meat loosely into meal-sized portions and label them with the date. Frozen duck meat should be good for six months to a year in the proper conditions."
    },
    {
      "title": "Skin ducks quickly in the field to save space.",
      "content": "Skin ducks quickly in the field to save space. If you're out on a serious hunting trip, you probably won't want to carry back a bunch of whole birds, most of which you're planning on discarding. If you're only after the meat, dressing them out quickly by removing the breasts and leaving the skin, feathers, and other mess in the field is a snap. You can also leave the wings on with this method, to stay in compliance with hunting regulations in your area. If you've got the time, it's better to dress your ducks later and more thoroughly. There's more meat to be had, and the skin is a desirable eating feature for many cooks. This method should only be done in the field when storage is at a premium."
    },
    {
      "title": "Open up the skin on the breast.",
      "content": "Open up the skin on the breast. Start by opening up the chest skin as you would doing a full skinning of the duck. Feel with your fingers for the breast-bone and tear the skin in opposite directions, opening up the chest like a shirt. Pull it back far enough to expose the breast in its entirety, then set it on the ground on its back."
    },
    {
      "title": "Stand with one foot on the head and one foot on the feet of the duck.",
      "content": "Stand with one foot on the head and one foot on the feet of the duck. Hold the duck in place with your feet, putting one food on the duck's neck and one on it's feet. You're going to be pulling the breast out and leaving the rest of the duck on the ground, making it easy to hold the mess in place with your feet."
    },
    {
      "title": "Hook two fingers above and underneath the breast-bone.",
      "content": "Hook two fingers above and underneath the breast-bone. With one hand, hook two fingers up under the breast plate, near the wishbone up toward the neck of the duck. With your other hand, hook two fingers underneath the breast plate near the abdomen. You should be able to feel the breast quite distinctly on the duck, as it's the largest and most substantial portion of meat, slightly raised up above the abdomen, and slightly darker red in color than the surrounding tissue."
    },
    {
      "title": "Pull upward firmly.",
      "content": "Pull upward firmly. After you've hooked your fingers firmly around the breast, pull upward, sawing back and forth slightly to help the breast come free. The wings, also, should pull through, because the joint is firm. Done correctly, you'll pull off the breast meat perfectly cleanly, with the wings attached, leaving the entrails, skin, head, tail, and feathers all on the ground. Perfect for the pot and so the game warden can identify it."
    }
  ]
}