{
  "url": "https://www.wikihow.com/File-a-Motion-to-Change-a-Court-Date",
  "title": "How to File a Motion to Change a Court Date",
  "steps": [
    {
      "title": "Consider talking to the other side first.",
      "content": "Consider talking to the other side first. Although you don't have to get the other side's permission to change the court date, the judge may be more likely to grant your request if both parties to the lawsuit agree to change it. In some jurisdictions, agreed or assented motions do not require any hold before the judge rules on them. This also could work in your favor if you are in a situation where the original court date is coming up soon and you are making a last minute request. [1] X Research source"
    },
    {
      "title": "Look for forms.",
      "content": "Look for forms. The clerk's office or your court's self-help center may have a form you can use to draft your motion to continue. Some jurisdictions do not keep forms for motions to continue. If that is the case for your court, look for other motions that have been filed in that court that you can use as a guide for how your motion should be formatted. If you do find forms, follow the instructions included with the forms to fill them out so they will be accepted by the court. Typically, these forms require you either to type your answers or to print legibly using blue or black ink. [2] X Research source"
    },
    {
      "title": "Format your caption.",
      "content": "Format your caption. The caption of your motion will look the same as the caption in other documents filed in your case, so you can use those as a guide."
    },
    {
      "title": "Title your motion.",
      "content": "Title your motion. The title of the motion tells the court what the document is. If you haven't been able to find a form, you should type out the title below the caption. A Motion to Continue can also be referred to as a Request for Continuance. You can look at other motions filed in your court to determine which style is preferred."
    },
    {
      "title": "Write out the reasons you're requesting a continuance.",
      "content": "Write out the reasons you're requesting a continuance. You must include a good reason why you want the judge to postpone your court date. The judge won't grant your request simply because you would prefer a different day. Keep in mind that the judge has complete discretion on whether to grant your request. For example, you may be able to get a judge to grant your request for a continuance if an important witness or piece of evidence is not available on the previously scheduled court date. Typically excusable reasons to delay your court date relate to the unavailability of important evidence or witnesses, a party to the case, or a party's attorney."
    },
    {
      "title": "Draft an affidavit or other documents, if necessary.",
      "content": "Draft an affidavit or other documents, if necessary. Depending on the reasons you're requesting a continuance, you may be required to include an affidavit with your motion. For example, if you want a continuance in Illinois because a witness or piece of evidence won't be available, you must file an affidavit testifying that you tried and failed to secure the witness or evidence, what that witness or evidence would show if you had it, and that if you had more time that witness or evidence would be available. In some other jurisdictions, you also may have to include a memorandum or declaration along with your motion. The clerk typically can tell you what documents you need, or you can ask at a local self-help clinic or legal aid office. Unless you are filing an agreed motion with the other side, you probably will have to include a certificate of service."
    },
    {
      "title": "Sign your motion.",
      "content": "Sign your motion. Once you've finished drafting your motion, you must sign it before you file it with the clerk. It may be necessary to sign your motion in front of a notary public. If you've attached an affidavit, the affidavit must be signed in front of a notary to authenticate your signature. Notaries can be found in most banks, at the clerk's office of the courthouse, or some other private businesses such as check cashing services. After you've signed your motion, make enough copies to keep one for your records and send one to each defendant in the case – the clerk will keep the originals for the court file. If you're filing a joint motion with the other side, both parties must sign the motion before you can file it."
    },
    {
      "title": "File your motion with the clerk.",
      "content": "File your motion with the clerk. Take your motion along with all copies to the clerk's office and file them with the court. Many courts do not charge filing fees for regular motions. Check with the clerk to learn if you will need to pay a filing fee to file your motion. [3] X Research source You generally should file your motion to continue as soon as possible after the reason you need to postpone your court date arises. If you wait until the last minute to file your motion, the judge may be more reluctant to grant your request. [4] X Research source Some courts may hold motions for a period of time to allow all parties to respond. For example, New Hampshire courts hold motions for 10 days. If such a rule exists in your jurisdiction, you must file a motion to continue far enough in advance of the original court date to allow for that hold period. [5] X Research source"
    },
    {
      "title": "Have the other side served.",
      "content": "Have the other side served. If you didn't file a joint motion, you must provide legal notice to the other side of the motion and when it will be heard. Typically you can serve the other side either using certified mail or in person. Once the other side has been served, either you or the process server generally must complete the proof of service form and file it with the court."
    },
    {
      "title": "Attend the hearing on your motion.",
      "content": "Attend the hearing on your motion. If the judge requires a hearing on your motion, she will schedule a date for it to be heard. Even though you filed a motion to continue, you still are expected to appear in court when the judge decides whether to change your court date. Treat the judge with the utmost deference and respect. She has complete control over whether your motion is granted, so if having your court date postponed is important to you, don't give the judge any reason to deny your request. You must appear in court on the date of your hearing or the judge may dismiss your motion and the court date will remain unchanged. The judge will consider a number of factors when deciding whether to grant your motion, including how soon the original trial date is, whether a continuance has already been requested or granted, how packed the court's calendar is, and whether all parties have agreed to the continuance. If the judge does not require a hearing, she will review the motion on her own and send you a written decision in the mail. [6] X Research source If the judge does not grant your motion, you will be expected to appear in court on the originally scheduled date. [7] X Research source"
    }
  ]
}