{
  "url": "https://www.wikihow.com/Get-Rid-of-Food-Poisoning",
  "title": "How to Get Rid of Food Poisoning",
  "steps": [
    {
      "title": "Figure out what caused the food poisoning.",
      "content": "Figure out what caused the food poisoning. Before treating the symptoms of food poisoning, it is important to figure out what caused it. Think back to the food you ate in the last 4 to 36 hours. Did you try something new? Did anything taste slightly off? Did you share food with a friend or family member who is also experiencing the same symptoms? Here are the most likely causes of food poisoning: [1] X Research source Food that has been contaminated by E. coli, Salmonella, and other types of bacteria. Bacteria are usually killed when food is cooked and handled properly, so this type of food poisoning usually results from undercooked meat or food that was left sitting out without refrigeration. Poisonous fish, such as pufferfish, are also a common source of food poisoning. Pufferfish should not be consumed unless it has been prepared by staff at a restaurant that is certified to do so. Poisonous wild mushrooms, looking identical to edible mushrooms, can also cause food poisoning."
    },
    {
      "title": "Decide if immediate medical attention is necessary.",
      "content": "Decide if immediate medical attention is necessary. Food poisoning that was caused by bacteria, especially when it strikes an otherwise healthy person, is usually treatable at home. However, depending on the source of the food poisoning and the age of the person who has it, it may be necessary to seek medical help immediately. Call a doctor under the following circumstances: If the food poisoning is due to poisonous fish or mushrooms. If the patient is an infant or a young child. If the patient is pregnant. The person with food poisoning is over 65 years of age. Frequent diarrhea or vomiting The person with food poisoning is experiencing severe symptoms, such as trouble breathing, dizziness or fainting, or vomiting blood. If you can’t keep fluids down and vomit out whatever you drink."
    },
    {
      "title": "Drink fluids.",
      "content": "Drink fluids. The first and most important thing that needs to be done in any case of food poisoning is to increase fluid intake. It is easier for the toxins to get flushed out of your system if your water intake is good. Vomiting and diarrhea are the common symptoms of food poisoning and these lead to fluid loss, so it is important to drink water and other fluids to avoid dehydration. [2] X Research source"
    },
    {
      "title": "Limit eating any foods.",
      "content": "Limit eating any foods. Food poisoning causes vomiting and diarrhea, which are natural bodily functions that work to dispel the poison from the body. Eating solid foods will cause more vomiting and diarrhea, so it's best to avoid eating until you are feeling better. It should go without saying that you should avoid eating the food that caused the poisoning. If you aren't sure what caused it, forgo eating anything that hasn't been freshly prepared right before you consume it. Throw away any suspect food. If you get tired of subsisting on broth and soup, eat plain foods that won't upset your stomach, like bananas, plain boiled white rice, or dry toast. Only start eating after the active vomiting stage of your food poisoning. [3] X Research source Ginger ale and lemon or lime soda can also help with rehydration, and the carbonation helps to settle your stomach. [4] X Research source Avoid having coffee, alcohol, and any other fluids that cause dehydration."
    },
    {
      "title": "Replace electrolytes.",
      "content": "Replace electrolytes. If you're losing a lot of nutrients through excess vomiting and diarrhea, buy an electrolyte solution from a pharmacy to replace them. Gatorade or Pedialyte will work fine, too. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source This method works best for adults, but not for small children."
    },
    {
      "title": "Get plenty of rest.",
      "content": "Get plenty of rest. You'll probably feel weak and tired after going through the symptoms of food poisoning. Sleep as much as you need to, to help your body recover faster. [6] X Research source"
    },
    {
      "title": "Avoid medications.",
      "content": "Avoid medications. Over-the-counter medications meant to prevent diarrhea and vomiting can actually slow your recovery by impeding the natural functions that eliminate the source of the food poisoning. [7] X Research source"
    },
    {
      "title": "Wash your hands, dishes, and kitchen surfaces.",
      "content": "Wash your hands, dishes, and kitchen surfaces. Food poisoning is often caused by bacteria that get transferred to food by way of unwashed hands, dishes, cutting boards, utensils, or work surfaces. Take the following measures to prevent getting food poisoning this way: [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wash your hands with warm, soapy water before preparing food. Wash your dishes and utensils in warm, soapy water after they have been used. Use a cleanser to wipe down your counters, tables, cutting boards, and other kitchen surfaces after preparing a meal, especially one that includes raw meat."
    },
    {
      "title": "Store food properly.",
      "content": "Store food properly. Make sure that raw food, such as packages of uncooked chicken or steak, is kept separate from food that doesn't need to be cooked, to prevent cross-contamination. All meat and dairy should be refrigerated as soon as you bring it home from the market. [9] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Cook meat thoroughly.",
      "content": "Cook meat thoroughly. Cooking meat until it reaches an internal temperature that kills bacteria can prevent bacterial food poisoning. Make sure you know the temperature to which your meat should be cooked, and use a meat thermometer to check the temperature before you finish cooking it. [10] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source Chicken and other poultry should be cooked to 165 F (73.9 C). Ground beef should be cooked to 160 F (71.1 C). Beef steaks and roasts should be cooked to 145 F (62.8 C). Pork should be cooked to 160 F (71.1C). Fish should be cooked to 145 F (62.8 C). Avoid reheating meats multiple times since they could develop bacteria that cause food poisoning."
    },
    {
      "title": "Don't eat wild mushrooms.",
      "content": "Don't eat wild mushrooms. Foraging for wild mushrooms has become a trend in recent years, but unless you're looking for mushrooms under the guidance of an expert, eating freshly picked mushrooms should be avoided. Even scientists have trouble distinguishing some edible and poisonous mushroom species without the aid of biological tests."
    }
  ]
}