{
  "url": "https://www.wikihow.com/Get-Over-a-Guy-Who-Doesn%27t-Care-About-You",
  "title": "How to Move On from A Man Who Doesn’t Care About You",
  "steps": [
    {
      "title": "Acknowledge and accept your own feelings.",
      "content": "Acknowledge and accept your own feelings. Avoiding the experience of sadness for a loss does not help us process the emotions,” board-certified psychiatrist Kirsten Thompson, MD says. [1] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 1 October 2021. Facing your feelings is the first step toward feeling better overall. Try confiding in a trusted friend or writing down your feelings in a diary to let it all out. Regardless of how serious your relationship with the guy was, this is an important step in the grieving process. Don’t pretend that it didn’t happen or act like you are unfazed by the situation. To effectively get over someone, according to psychologists, you need to recognize and admit what you are dealing with . Also, practice radical acceptance, which involves forgiving him and yourself and making peace with the situation. Remind yourself that all your feelings are normal and natural."
    },
    {
      "title": "Remember that you’re not to blame.",
      "content": "Remember that you’re not to blame. Blaming yourself will only make you feel worse. It can be easy to look at the situation and feel like there’s something wrong with yourself, but try to remember that there’s nothing wrong with you as a person. If the guy you’re having trouble getting over didn’t care about you, it just means that you two weren’t a good fit. [2] X Research source It can be helpful to use affirmations to remind yourself that you are not to blame. You could say things like, “I am worthy of love,” or, “This was not my fault.”"
    },
    {
      "title": "Do fun things alone to come home to yourself.",
      "content": "Do fun things alone to come home to yourself. “Use healthy distractions,” Thompson says. [3] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 1 October 2021. Doing fun things on your own will make you feel good while keeping your mind off the situation. It also proves to yourself that you can be happy without him. Take yourself out for ice cream, go for a drive around town, or spend some time in nature. Being on your own can be a fun time, and you don’t need anyone else to enjoy life. [4] X Research source Take note of all the things you do on your own, and the many ways in which you are independent. For example, are you financially independent? What are some skills you have that have nothing to do with him? In what ways do you take responsibility for your own happiness?"
    },
    {
      "title": "Make a list of your positive qualities.",
      "content": "Make a list of your positive qualities. Remember how awesome you are all on your own. Sit down and write out 10 things you love about yourself, no matter how small, to boost your self-esteem . It could be anything: art skills, fashion sense, kindness toward others, friendships, or being a great cook. Take a look at the list whenever you’re feeling down to pick yourself back up again. [5] X Research source Feeling rejected can lower your self-esteem, and this exercise is designed to help you remember what a catch you are. Sometimes it can be helpful to ask a good friend for their input. We sometimes have a hard time recognizing positives in ourselves."
    },
    {
      "title": "Give yourself time, and don’t rush it.",
      "content": "Give yourself time, and don’t rush it. Time really is the best medicine. Although you may feel frustrated that it’s taking time to get over someone, avoid being hard on yourself. If you try to force yourself to move on quickly, you might make yourself feel even worse. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Even if you were not in an official relationship, you have lost someone who you thought was important to you. As a result, you need to give yourself time to recover without feeling like you should be making more progress."
    },
    {
      "title": "Detach yourself from him so you can heal.",
      "content": "Detach yourself from him so you can heal. “Cut off all contact with the person indefinitely,” Thompson recommends. [7] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 1 October 2021. Don’t remind yourself of what he put you through. To speed up your recovery, it's a good idea to keep your interactions with the guy to a minimum to help yourself detach . You don’t have to avoid the person at all costs and it may not be realistic to cut him out of your life, but you should do what is needed to help you feel better. [8] X Research source This might mean spending time in new places or hanging out with different friends if you travel in the same circles. You may also want to block him on social media accounts or delete contacts in your phone."
    },
    {
      "title": "Trash or put away things that bring back memories.",
      "content": "Trash or put away things that bring back memories. Thompson tells us that digging up old memories “doesn’t allow your mind and body to adapt to a life where they are not involved.” [9] X Expert Source Kirsten Thompson, MD Board Certified Psychiatrist Expert Interview. 1 October 2021. It might seem painful, but it’s a good way to move on. If your camera roll is full of pics of the two of you, it might be time to clear it out. Consider putting them on a USB drive and keeping them in a drawer if you don’t want to delete them. [10] X Research source The same goes for any pictures or belongings you have of him hanging around your home. If you don’t want to get rid of them completely, compile them all and put them in a box or a drawer in your closet."
    },
    {
      "title": "Get some exercise to nourish your body and mind.",
      "content": "Get some exercise to nourish your body and mind. “Move your body by walking, yoga, pilates, etc. at least 30 minutes every day, which releases the endorphins,” licensed clinical psychologist Susan Pazak, PhD suggests. [11] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Endorphins are brain chemicals that relieve pain and boost your mood, so they’re a huge help. Although working out may be the last thing you want to do when you are feeling down, research shows that exercise can help you feel less depressed and more confident. Try going for a run, or going swimming or biking. [12] X Research source Exercising also gives you a sense of control and power over your situation. Imagine that you are taking charge of your life in the same way you are taking charge of your physical activity."
    },
    {
      "title": "Hang out with your friends to remind yourself that people care.",
      "content": "Hang out with your friends to remind yourself that people care. Pazak says it’s important to “surround yourself with people who love and support you.” [13] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Spend time with those who love you the most. If you don’t feel up to doing much, invite a few friends over to hang out and watch movies. Or, go out and get food and drinks somewhere. Isolating yourself will only make you feel worse, so it’s important to lean on your support network. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Your family members can be helpful, too. Reach out to your parents, siblings, or anyone else you’re close with for some advice and comfort."
    },
    {
      "title": "Organize fun activities and outings for self-care.",
      "content": "Organize fun activities and outings for self-care. Take your mind off your troubles by trying new things. Go out to dinner, see a movie, plan a trip, or take a spa day. Try out a new hobby that you’ve always wanted to try, whether you’re with your friends or on your own. [15] X Research source If you’re having trouble taking your mind off things, bring a friend or two along. They can help distract you from your thoughts so you can actually have a good time."
    },
    {
      "title": "Give yourself a routine.",
      "content": "Give yourself a routine. Pazak also suggests that you “have a routine of activities that you enjoy doing most days every day.” [16] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Get into a rhythm and a groove. When you know what you’re doing next each moment, your mind is less likely to wander and land on thoughts of him. A routine gives you stability and clarity in how you live your life. It doesn’t have to be anything complex. Just focus on getting 3 meals a day, and filling the time in between with 2 or 3 regular activities, like reading, studying, exercising—anything you enjoy doing."
    },
    {
      "title": "Meet with a mental-health professional.",
      "content": "Meet with a mental-health professional. “Limit conversations about the ex except for productive conversations with a psychologist, counselor or coach,” Pazak recommends. [17] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Seeing a professional can help you work through your feelings in a healthy way. Mental health professionals are trained to guide people through the grieving process and help them move forward with their lives and future relationships. [18] X Research source If you are depressed and having a hard time getting past the guy who doesn’t care about you, a trained mental-health professional may be able to recommend therapy options, support-group meetings, or even medicine that can help you feel better."
    },
    {
      "title": "He doesn’t show up for you when you need him.",
      "content": "He doesn’t show up for you when you need him. Dating coach John Keegan says that showing up is crucial in a loving relationship. [19] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. “Showing up” means he’s there for you in your big and small moments. Maybe he helps out when you’re stressed, or comes to your big events. But if he can’t be bothered to care when you’re in trouble, or when you’re celebrating, the connection might not be there. Remember that he has his own life, too. It’s one thing to miss a big day because he had his own big things happening; it’s another to shrug off a big day because he just didn’t feel like it."
    },
    {
      "title": "He always chooses his friends over you.",
      "content": "He always chooses his friends over you. Keegan says to beware if “he'd rather be with his friends” than spend time with you. [20] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. It might mean that he doesn’t value your time together, or at least that he values his other connections over yours. If he can’t be bothered to be 1-on-1, then he’s not the one. Again, remember that he deserves his own space and his own connections. Just spending time with his friends isn’t a red flag, but always choosing his friends over you is."
    },
    {
      "title": "He doesn’t want to meet your friends or family.",
      "content": "He doesn’t want to meet your friends or family. A guy should want to get to know your social circle, Keegan says. [21] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. Your friends and family are part of your life, and he should want to get to know that life and feel comfortable in it. If he declines invites to hang out with your social circle, then he’s probably not interested in a deeper, longer connection. At the same time, you should want to get to know his social circle, too."
    },
    {
      "title": "He avoids making long-term plans.",
      "content": "He avoids making long-term plans. When you talk about relationship stuff, like where you see yourself in 5 years, or moving in together, or being steady, and he gets shifty, that’s a red flag, Keegan tells us. [22] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. It usually means he’s not ready to commit to the relationship, and might not be as into it as you are. Keep in mind that this is totally natural for new relationships or crushes. But if you’ve been seeing each other for a long time and he still can’t commit, he might never."
    },
    {
      "title": "He doesn’t open up to you.",
      "content": "He doesn’t open up to you. Someone who’s into you, especially a boyfriend, wants to get to know the deepest parts of you, and wants you to know the deepest parts of themself. But Keegan warns that if he starts to “pull away,” it could mean that he’s not invested. [23] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. That emotional investment is an anchor, and he’s pulling up his anchor and getting ready to sail away. Of course, it takes time for a lot of people to open up. If you just met recently, or just fell into a relationship, expect a warming-up period before he shares the deepest parts of himself."
    },
    {
      "title": "It’s hard to move on from someone you’ve emotionally invested in.",
      "content": "It’s hard to move on from someone you’ve emotionally invested in. Even if you weren’t dating very long, or never formally dated at all, you still envisioned a life together. There was hope that you’d get what you wanted, and hope is a hard thing to squash. [24] X Research source The key is shifting that hope to someone who’s better for you, and more available, so that you can fulfill it and get the relationship you deserve. Part of that may be a lack of closure. If you haven’t had a definitive ending, sometimes your brain has a hard time processing that things are, in fact, over. You’ll heal in time, but it will take time. The key is to allow yourself to grieve and open up to new people when you’re ready. They’ll show you that there’s more to life than the one who got away."
    },
    {
      "title": "Divide the time you were close to them by 2.",
      "content": "Divide the time you were close to them by 2. There’s no one-size-fits-all answer for this. For the most part, it depends on how close you were. Some gurus say it’s how long you cared about them divided by 2. But if you’re good to yourself, it’ll be even shorter. [25] X Research source For example, if you only dated for a couple months, you might get over him quickly. But if that was an intense and passionate couple months, it could take longer. Also, even if you didn’t date, if you had your eyes on him for a long while, it could take a long while to heal. On the flipside, breakups from longer relationships usually take longer to heal."
    }
  ]
}