{
  "url": "https://www.wikihow.com/Divide-a-Bird-of-Paradise-Plant",
  "title": "How to Divide a Bird of Paradise Plant",
  "steps": [
    {
      "title": "Look for plants to divide in late spring or early summer.",
      "content": "Look for plants to divide in late spring or early summer. This is the ideal time to divide a bird of paradise as it’s when the plant will be actively growing. Also, make sure to choose plants that have been blooming for at least 5 years. [1] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Avoid dividing plants that have not yet flowered."
    },
    {
      "title": "Choose plants that have 6 or more stems.",
      "content": "Choose plants that have 6 or more stems. Check the base of the plants and look for one that has 6 or more stems going out from the base. You can divide these into individual plants which will then flower after 2-3 years. [2] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You can get 6 separate divisions out of a clump that has 6 stems."
    },
    {
      "title": "Dig or pull up plants with your hands and a garden trowel.",
      "content": "Dig or pull up plants with your hands and a garden trowel. Use your hands to remove a bird of paradise plant from a pot, or use a garden trowel to dig it up out of the ground. Turn the pot on its side, grasp the stems as close to the soil as possible and wiggle them back and forth as you hold onto the pot with your other hand. [3] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source This may be difficult to do if the plant is large or if it is root-bound in a pot, which means the roots are growing out through the holes in the bottom of the pot."
    },
    {
      "title": "Clean the roots by rinsing them with a hose.",
      "content": "Clean the roots by rinsing them with a hose. Lay the roots on a patch of grass or concrete and rinse them with a garden hose to get the soil off of them. You can also use your hands to pull large clumps of soil away from the roots. Keep rinsing and pulling away soil until all of the roots are visible. [4] X Research source"
    },
    {
      "title": "Separate the roots with your fingers or a sharp, disinfected knife.",
      "content": "Separate the roots with your fingers or a sharp, disinfected knife. Carefully disentangle the roots with your fingers and pull the stems apart. If the stems do not come apart easily, use a sharp, disinfected knife to cut them apart. Dip the knife into a cup of rubbing alcohol to disinfect it. [5] X Research source Ensure that each stem has a root attached to it. If the clump has 8 shoots, you should be able to get 8 divisions from it."
    },
    {
      "title": "Dig a hole deep enough to accommodate the entire root.",
      "content": "Dig a hole deep enough to accommodate the entire root. Fill a small pot 1/3 of the way full of well-draining potting soil, and then use your hands to push the soil out towards the edges of the pot. You can also dig a new hole in your garden that is deep enough to accommodate the root. [6] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Make sure that the pot you use has holes in the bottom of it so that any excess water will be able to drain out."
    },
    {
      "title": "Plant each stem in the pot or hole filled with potting soil.",
      "content": "Plant each stem in the pot or hole filled with potting soil. Position the stem and root in the soil so that they are at the same depth they were growing at before you dug the clumps up. Add more soil on top of the root and around the base of the stem. [7] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source If your soil is dense, add some sand to promote better drainage. Make a 3:1 mixture of soil and sand and use this as your potting soil."
    },
    {
      "title": "Water daily to keep the soil moist for the first 3-6 months.",
      "content": "Water daily to keep the soil moist for the first 3-6 months. Never allow the soil to dry out completely after dividing and repotting or replanting a bird or paradise. Water it daily, and check the soil often to ensure that it stays moist. Your plant may require more water when the weather is dry or hot. [8] X Research source If you’re unsure about whether or not the soil is moist, stick your fingertip or a clean wooden popsicle stick into it by about 2 in (5.1 cm). If your fingertip or the wooden stick is dry when you pull it out, the soil is too dry."
    },
    {
      "title": "Place the plant in a spot with bright, indirect light.",
      "content": "Place the plant in a spot with bright, indirect light. Birds of paradise require at least 8 hours of bright, indirect light. Don’t place the plants in direct, harsh sunlight for the first 8 weeks after you’ve divided them. Try placing the plant near a north or east-facing window so that the plant will get lots of bright morning sunlight. [9] X Research source Avoid south or west-facing windows as the light coming in may be too harsh."
    },
    {
      "title": "Keep the temperature in your home above 68 °F (20 °C).",
      "content": "Keep the temperature in your home above 68 °F (20 °C). Check your thermostat regularly if you are keeping the plant indoors, or keep an eye on the temperatures outside if you’re keeping it outdoors. Bring the plant inside on cold days and nights if you’re growing it outside. [10] X Research source If you live in a cold climate, protect the newly repotted plant from drafts by placing it away from windows and doors."
    },
    {
      "title": "Move the plant to a sunny spot after 8 weeks.",
      "content": "Move the plant to a sunny spot after 8 weeks. After 8 weeks, the bird of paradise can be in direct sunlight, so transfer it to a south or west-facing window to ensure that it gets 6-8 hours of bright sunlight. However, if the light is too harsh in these areas, keeping the plant in a north or east-facing window is also fine. [11] X Research source If you’re replanting the bird of paradise outside, make sure that it is not in the shade. Position it in your garden where it will get plenty of bright, direct sunlight during the day."
    },
    {
      "title": "Fertilize the plants after they have been growing for 3 months.",
      "content": "Fertilize the plants after they have been growing for 3 months. Mix a 50% strength liquid fertilizer by combining half water and half fertilizer in a spray bottle. Apply the liquid to the base of the plant so it will permeate the roots—not the flowers, leaves, or stems. Do this after the newly divided plant has been growing for 3 months. [12] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source Check the manufacturer’s instructions for details on how to mix and apply the fertilizer."
    }
  ]
}