{
  "url": "https://www.wikihow.com/Fertilize-a-Citrus-Tree",
  "title": "Fertilizing a Citrus Tree: What Month, How Much, & Best Ratios",
  "steps": [
    {
      "title": "Fertilize your tree throughout the year when you first plant it.",
      "content": "Fertilize your tree throughout the year when you first plant it. Nourish your tree once every 1-2 months when the tree is actively growing. When your tree goes through a dormant period, or a time when it stops growing, fertilize it once every 3 months. [1] X Research source"
    },
    {
      "title": "Nourish your tree throughout the growing season when it starts producing fruit.",
      "content": "Nourish your tree throughout the growing season when it starts producing fruit. Unfortunately, there isn’t a one-size-fits-all recommendation for citrus trees—it really depends on when you live. Most experts agree that you should feed your citrus tree multiple times during the growing season, so it gets plenty of nutrients. [2] X Research source The “growing season” is whenever your citrus tree produces fruit. In a dry, hot climate, fertilize your citrus tree on Valentine’s Day (February 14), Mother’s Day (second Sunday in May), and Father’s Day (third Sunday in June). [3] X Research source If you’re growing your citrus indoors, fertilize it between mid-spring and late summer/early autumn. [4] X Research source"
    },
    {
      "title": "Take a soil test to see what your tree’s needs are.",
      "content": "Take a soil test to see what your tree’s needs are. Unfortunately, there isn’t a universal fertilizer recommendation for citrus trees, since citrus trees can be grown in different climates. Conduct a soil test to see what nutrients your tree is lacking. [5] X Expert Source Cory Schifter Jeweler & Certified Jewelry Appraiser Expert Interview. 21 April 2020. You can buy a soil test online, or from a home improvement store."
    },
    {
      "title": "Pick a fertilizer based on the NPK recommendation in your test results.",
      "content": "Pick a fertilizer based on the NPK recommendation in your test results. Your NPK ratio, or Nitrogen-Phosphate-Potash ratio, describes what percentage of each nutrient your soil should have. Choose a fertilizer that matches this ratio, so your trees get lots of nourishment. [6] X Research source For instance, if your NPK recommendation is 15-5-10, you’d use a fertilizer with a 15-5-10 NPK ratio for your plant. Some experts recommend using a fertilizer designed for acid-loving plants. [7] X Research source Other experts from hot, dry climates suggest using a 13-13-13 or 15-5-10 fertilizer. [8] X Research source It really depends on where you live!"
    },
    {
      "title": "Choose a slow-release fertilizer.",
      "content": "Choose a slow-release fertilizer. Citrus trees need to be watered pretty often; unfortunately, this can wash out the nutrients quickly. To counteract this, pick a slow-release fertilizer, so your tree receives nutrients gradually. [9] X Research source"
    },
    {
      "title": "Epsom salt is another good option.",
      "content": "Epsom salt is another good option. Citrus trees thrive in acidic soil that’s somewhere between 5.5 and 6.5 pH. Thankfully, products like Epsom salt or agricultural gypsum can keep your citrus tree healthy and well-nourished, especially if your tree’s nutrients get washed out. [10] X Research source"
    },
    {
      "title": "Organic fertilizer is a possible option.",
      "content": "Organic fertilizer is a possible option. Some fertilizers are labeled as “organic,” which means they’re made with natural ingredients like manure, compost, and earthworm castings. [11] X Research source Look for an organic fertilizer at your home improvement store, or any place that sells gardening supplies."
    },
    {
      "title": "Mature trees need at least 1 lb (0.45 kg) of fertilizer per year of life.",
      "content": "Mature trees need at least 1 lb (0.45 kg) of fertilizer per year of life. For reference, a 4-year old tree needs 4 to 6 lb (1.8 to 2.7 kg) of fertilizer, a 5-year old tree needs 5 to 7 1 ⁄ 2 lb (2.3 to 3.4 kg), a 6-year old tree needs 6 to 9 lb (2.7 to 4.1 kg), a 7-year old tree needs 7 to 10 1 ⁄ 2 lb (3.2 to 4.8 kg), and so on. If your tree is 12 years or older, use between 12 to 18 lb (5.4 to 8.2 kg) of fertilizer. [12] X Research source Don’t give your citrus tree all of this fertilizer at once! Spread out this total amount over the growing season. These measurements apply to chemical fertilizers."
    },
    {
      "title": "Young trees need more fertilizer than mature trees.",
      "content": "Young trees need more fertilizer than mature trees. During the first year, apply 1 ⁄ 2 lb (0.23 kg) of fertilizer to your tree each month between February and October. During the second year, spread 1 lb (0.45 kg) of fertilizer over your tree each month. Once the third year rolls around, spread 2 lb (0.91 kg) of fertilizer around the tree. [13] X Research source For these particular measurements, use a fertilizer with an 8-13% nitrogen content. If your fertilizer has a 17-21% nitrogen content, divide these measurements in half. If you’re using a balanced fertilizer (like 13-13-13), experts recommend using at least 1 lb (0.45 kg) of fertilizer on 1-year old trees, 2 lb (0.91 kg) on 2-year old trees, and 3 lb (1.4 kg) on 3-year old trees. [14] X Research source"
    },
    {
      "title": "Apply fertilizer along the base of the tree.",
      "content": "Apply fertilizer along the base of the tree. If you’re growing an outdoor tree, spread the fertilizer as wide as the tree’s canopy, so your plant gets plenty of nutrients. [15] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source To be safe, always double-check your fertilizer label to make sure you’re applying it correctly. [16] X Research source Some liquid fertilizers might be sprayed on your tree’s leaves."
    }
  ]
}