{
  "url": "https://www.wikihow.com/Do-Freestyle-Football-Tricks",
  "title": "How to Do Freestyle Football Tricks",
  "steps": [
    {
      "title": "Being a freestyler requires a lot of hard work and extremely a lot of patience, so make sure that is met.",
      "content": "Being a freestyler requires a lot of hard work and extremely a lot of patience, so make sure that is met. [1] X Research source"
    },
    {
      "title": "Yoga is Really Helpful and Stretching your Legs and Shoulders Make you Flexible and Make it easier for you.",
      "content": "Yoga is Really Helpful and Stretching your Legs and Shoulders Make you Flexible and Make it easier for you."
    },
    {
      "title": "The Key is Practicing DO all The Tricks for a Month and After That You WILL Be Good at it in a month.",
      "content": "The Key is Practicing DO all The Tricks for a Month and After That You WILL Be Good at it in a month."
    },
    {
      "title": "Get a soccer ball( not pumped too hard ) and start practicing juggling.",
      "content": "Get a soccer ball( not pumped too hard ) and start practicing juggling. The key to that is to try to keep the ball below your hip and put a backward spin on it. Juggling helps your ball control and the speed of your legs. [2] X Research source Practice juggling for 1 hour every day for about a month, most likely you are going to be an expert in juggling and you are able to do 100 keep-ups no sweat (if you practice)."
    },
    {
      "title": "After you master juggling you should start with basic freestyle tricks like stalling the ball which is holding the ball on your foot (pull the ball back as if your are about to start juggling, but instead balance it on your foot.",
      "content": "After you master juggling you should start with basic freestyle tricks like stalling the ball which is holding the ball on your foot (pull the ball back as if your are about to start juggling, but instead balance it on your foot. [3] X Research source This move is a basic freestyle trick that leads up to other tricks. Once you master this trick you can work up to harder better tricks."
    },
    {
      "title": "Another basic trick is Around the World (ATW) when you flick the ball up go around it, and start juggling after you are done.",
      "content": "Another basic trick is Around the World (ATW) when you flick the ball up go around it, and start juggling after you are done. This is not as easy as it sounds. For this trick you need a lot of speed and again a lot of patience. You should begin with the motion of it, and try doing it as fast as possible. [4] X Research source When you think you are ready, out a ball in the play. Again practice for an hour a day for about 2 months and you can master this. But this trick is a lot harder than juggling so you need more patience. (*You can do this trick from juggling or from a stall, in both cases you should start going around the ball right after you flick it up, for juggling ATW, you should hit the ball from the right side of your foot for right legged people, and from the left side of your foot for left legged people.)"
    },
    {
      "title": "Another basic trick that will get you the oohs and aahs is the neck stall.",
      "content": "Another basic trick that will get you the oohs and aahs is the neck stall. Similar to foot stall you balance it on your neck. You can do this trick from a foot stall, you flick it up this time about half a meter higher than your head. Then you cushion the ball on your neck keeping you back straight on a 90 degree angle and keep your arm pointing back keeping your elbows straight. [5] X Research source The key move in this trick is to cushion the ball on your neck, meaning you take the power of the ball away by going down at the same time as the ball only a bit slower than it so the power can be absorbed to your back/neck. Practice this trick for about half an hour every day for 2 weeks and you can perfect it. This trick is much easier than ATW."
    },
    {
      "title": "After you have perfected these 3 tricks, step your game up and link them all together.",
      "content": "After you have perfected these 3 tricks, step your game up and link them all together. For example you can begin by juggling then going to a foot stall, then do ATW, followed by another foot stall and then a neck stall. If you are able to do all these three moves and keep the ball off the ground, you are going to be given respect."
    }
  ]
}