{
  "url": "https://www.wikihow.com/Create-a-Shirt-in-Roblox",
  "title": "Make a Shirt in Roblox: Create Shirts in GIMP or Photoshop",
  "steps": [
    {
      "title": "Go to https://www.roblox.com in your web browser.",
      "content": "Go to https://www.roblox.com in your web browser. If you are logged in, this should take you to your Home page. If you are not logged in automatically, click Log In in the upper-right corner. Then enter the username and password associated with your Roblox account and click Log In . It costs 10 Rubux to make a shirt, so make sure you buy some Robux before continuing. If you don't want to purchase Robux, you can make a T-shirt for free. The difference between a shirt and a T-shirt is that a shirt wraps around the entire body of the avatar. A T-shirt is just a small graphic that goes on the front of the avatar's chest."
    },
    {
      "title": "Download the shirt template.",
      "content": "Download the shirt template. You can download the shirt template from the Roblox website. Use the following steps to find and download it. Click the Create tab at the top of the page. Click the My Creations tab. Click Shirts in the menu to the left (not T-shirts.\") Click the link in the text that says \"Did you use the template? If not, download it here.\" at the top of the page."
    },
    {
      "title": "Save the shirt template onto your computer.",
      "content": "Save the shirt template onto your computer. To do so, right-click the template, then click Save image as... (or Save as... ) in the resulting drop-down menu. Select a save location (e.g., your \"Documents\" or \"Pictures\" folder), and click Save . If you are using a Mac that doesn't have the right mouse button, hold Control and click instead."
    },
    {
      "title": "Open a photo editing program.",
      "content": "Open a photo editing program. You can use any photo-editing program. Once you have downloaded a photo editing program, click the icon in the Windows Start menu or Applications folder on Mac to open your photo editing program. If you have a subscription to Adobe Photoshop , you can use it to create your shirt. You can download Photoshop (and get a free trial) at https://www.adobe.com/products/photoshop.html Photoshop Elements is an inexpensive version of Photoshop that doesn't have as many features as the full version. You can purchase and download it from https://www.adobe.com/products/photoshop-elements/buy-elements.html Alternatively, you can use GIMP , which is a completely free alternative to Photoshop. You can download GIMP for free from https://www.gimp.org/downloads ."
    },
    {
      "title": "Open the template in your photo editing program.",
      "content": "Open the template in your photo editing program. Click and drag the template into your photo-editing program—or click File , and then click Open . Browse to where you saved the image template to and double-click it to open it."
    },
    {
      "title": "Create a new layer.",
      "content": "Create a new layer. The Layers panel is usually in the lower-right corner. Click the icon that resembles a blank sheet of paper in Photoshop or the icon that resembles a folder with a plus sign in GIMP to create a new layer . Both are at the bottom of the Layers panel. If you don't see the Layers panel in Photoshop, click Window in the menu bar at the top. Then click Layers ."
    },
    {
      "title": "Select the new layer.",
      "content": "Select the new layer. The new layer you just created should be above the layer with the template in the Layers panel. Click this layer to select it. This will ensure that you do not modify the template when creating your art for the shirt. If the new layer is not above the layer with the template, simply click and drag it to the top of the Layers panel."
    },
    {
      "title": "Edit the template.",
      "content": "Edit the template. The template shows all sides of the shirt and sleeves unwrapped and laid out on a flat surface. The color boxes indicate where the front, back, sides, top, and bottom go. The torso is in the upper-right corner. The left and right sleeves are at the bottom of the template. The images of the avatar in the upper-left corner show where each colored box goes on the avatar. Use this as a reference. You can color over the boxes to change the shirt color, and/or place an image on the front or back of the shirt. You can also add text to the front, back, or sleeves of the shirt. Be creative! The dotted lines on the sleeves indicate where the sleeves should end. Leave the area below the top dotted line blank to create short sleeves. Leave the area below the bottom dotted line blank to create long sleeves. Leave any areas blank that you don't want to be covered in clothing."
    },
    {
      "title": "Turn the template layer off.",
      "content": "Turn the template layer off. To do so, click the icon that resembles an eyeball next to the layer with the template in the Layers panel. This will make the layer with the template invisible. You should see the art for your shirt on top of a transparent background. Transparency is usually denoted by a white and grey checkerboard pattern."
    },
    {
      "title": "Save your shirt as PNG image.",
      "content": "Save your shirt as PNG image. A PNG image will preserve the transparent background. This will prevent the colors from the template from discoloring the arms and hands of the avatar. Use the following steps to save the image as a PNG: Photoshop — Click File followed by Save as . Then enter a name for your shirt next to \"File name.\" Use the drop-down menu next to \"Format\" to select \" PNG (*.png) .\" Then click Save in the lower-right corner. GIMP — Click File followed by Export as . Enter a name for your shirt next to \"Name\" at the top of the dialog box. Then click Select File Type (By Extension) at the bottom to display a menu. Select \" PNG Image \" in the menu. Then click Export in the lower-right corner. [1] X Research source"
    },
    {
      "title": "Go to https://www.roblox.com in your browser.",
      "content": "Go to https://www.roblox.com in your browser. Before you spend 10 Robux to upload your shirt, you may want to test it in Roblox Studio to make sure it looks right. You can do that for free, but you need to upload the shirt image as a decal. If you are not logged in automatically, click Log In in the upper-right corner. Then enter the username and password associated with your Roblox account and click Log In ."
    },
    {
      "title": "Click the Create tab.",
      "content": "Click the Create tab. It's the third tab at the top of the website."
    },
    {
      "title": "Click My Creations.",
      "content": "Click My Creations . Its the first tab at the top of the Create page. Normally, you will open to this page automatically. If not, click this tab to display a list of your creations."
    },
    {
      "title": "Click Decals.",
      "content": "Click Decals . It's in the menu to the left. It doesn't cost anything to upload a decal. You can upload as many as you want."
    },
    {
      "title": "Upload your shirt image as a decal.",
      "content": "Upload your shirt image as a decal. Use the following steps to do so: Click Upload file at the top. Select your shirt image file and click Open . Enter a name for the file next to \"Decal name.\" Click Upload ."
    },
    {
      "title": "Click your image file.",
      "content": "Click your image file. All your decals should be listed below the section at the top where you upload an image. Locate the decal you just uploaded in the list and click it."
    },
    {
      "title": "Copy the file code.",
      "content": "Copy the file code. The file code is in the numeric section in the URL in the address bar of your web browser. It is the number section immediately after \"www.roblox.com/library/\" in the URL. You do not need to copy the entire URL. Just highlight and copy the numeric portion of the URL."
    },
    {
      "title": "Open Roblox Studio.",
      "content": "Open Roblox Studio. Roblox Studio has an icon that resembles a blue tilted square. You can use Roblox Studio to make games and assets for games. You can also use it to test your shirt before uploading it. If you haven't already downloaded Roblox Studio, go ahead and use the following steps to download and install Roblox Studio for free: Go to https://www.roblox.com/create in your web browser. Click Start Creating to download the installation file. Double-click the installation file in your Downloads file to open it. Follow the instructions to finish installing Roblox Studio."
    },
    {
      "title": "Open a game.",
      "content": "Open a game. You can open any game in Roblox Studio. It doesn't need to be a completed game. In fact, you can just open one of the game templates. Use the following steps to do so: Click New in the menu to the left. Click the All Templates tab at the top. Click any one of the templates to open it."
    },
    {
      "title": "Test play your game.",
      "content": "Test play your game. Doing so will place your avatar in the game. Use the following steps to test play your game: Click the Home tab at the top. Click Play in the menu panel at the top."
    },
    {
      "title": "Locate your username in the Explorer window.",
      "content": "Locate your username in the Explorer window. By default, the Explorer window is to the right of the play screen. If you don't see the Explorer window, click the View tab at the top, and then click Explorer in the menu panel at the top. To find your username: Click Workspace at the top of the Explorer window to expand the Workspace assets. Locate your username below \"Workspace\" and click it to expand it."
    },
    {
      "title": "Click Shirt below your username.",
      "content": "Click Shirt below your username. This will display the properties of the shirt in the Properties window. By default, the Properties window is just below the Explorer window. If you don't see the Properties window, click the View tab at the top. Then click Properties in the panel at the top."
    },
    {
      "title": "Paste the file code next to \"Shirt Template\" and click Add Attribute.",
      "content": "Paste the file code next to \"Shirt Template\" and click Add Attribute . You should see \"Shirt Template\" in the Properties window below the \"Appearance\" header. Erase the default URL next to \"Shirt Template\" and paste the file code for your shirt image that you copied from the Roblox website. Then click Add Attribute below the Properties panel. This will apply the decal as a shirt and allow you to view what the shirt looks like before uploading it. Walk around in different directions so you can see what the shirt looks like from different angles."
    },
    {
      "title": "Archive the shirt image file.",
      "content": "Archive the shirt image file. Archiving the shirt file ensures that only you have access to the image file. This prevents other users from stealing your shirt graphics. Use the following steps to archive the image file: [2] X Research source Log into https://www.roblox.com/ Click the Create tab at the top. Click the My Creations tab. Click Decals . Click the gear icon next to your shirt image file. Click Configure . Scroll down and click Archive near the bottom. Click Save ."
    },
    {
      "title": "Open the Roblox main page.",
      "content": "Open the Roblox main page. Go to https://www.roblox.com in your browser. If you are already logged in, this should take you to the Home page. If you are not logged in automatically, click Log In in the upper-right corner. Then enter the username and password associated with your Roblox account and click Log In ."
    },
    {
      "title": "Click the Create tab.",
      "content": "Click the Create tab. It's the third tab at the top of the website."
    },
    {
      "title": "Click My Creations.",
      "content": "Click My Creations . It's the first tab at the top of the Create page. Normally, you will open to this page automatically. If not, click this tab to display a list of your creations."
    },
    {
      "title": "Click Shirts.",
      "content": "Click Shirts . This option is near the bottom of the \"My Creations\" list of items."
    },
    {
      "title": "Upload the image of your shirt.",
      "content": "Upload the image of your shirt. Use the following steps to upload the PNG image of your shirt: Click Choose File below the \"Create a Shirt\" header at the top. Browse to where you saved the PNG image of your shirt and click it to select it. Click Open ."
    },
    {
      "title": "Enter a name for your shirt.",
      "content": "Enter a name for your shirt. Enter a name for your shirt in the bar that says \"Shirt Name\" at the top of the page."
    },
    {
      "title": "Click Upload for 10 Robux.",
      "content": "Click Upload for 10 Robux . It's a green button below the \"Shirt Name\" text field. Doing so will charge your Roblox account 10 Robux and upload your shirt to your Roblox profile. Afterward, you can equip or sell your shirt as you please. The image you upload should be 585 pixels wide and 559 pixels high."
    }
  ]
}