{
  "url": "https://www.wikihow.com/Do-a-21-Card-Card-Trick",
  "title": "How to Do a 21 Card Card Trick",
  "steps": [
    {
      "title": "Take any 21 cards out of a 52-card deck.",
      "content": "Take any 21 cards out of a 52-card deck. It can be any 21 cards. What matters is the number of cards, not the suit or color. You can either do it ahead of time or in right in front of your audience members. [1] X Research source"
    },
    {
      "title": "Have someone pick a card and then shuffle it back in.",
      "content": "Have someone pick a card and then shuffle it back in. Fan the cards out upside down, and have someone select a random card from the pile. Make sure they memorize what the card is, and show it to whoever else is in the audience. Then, have them place the card anywhere and the pile, and shuffle the deck . [2] X Research source You can even have a volunteer shuffle the deck, so your audience knows you aren’t performing sleight of hand as you shuffle."
    },
    {
      "title": "Lay out the cards 3 across and 7 down.",
      "content": "Lay out the cards 3 across and 7 down. Start with the top of each column by laying out 3 cards in a horizontal row. Then, lay down the next row, and continue until each of the 3 columns has 7 cards in it. [3] X Research source Make sure each column has 7 cards or else the trick won't work!"
    },
    {
      "title": "Ask the volunteer which column their card is in.",
      "content": "Ask the volunteer which column their card is in. You don’t need to ask this question in a fancy way. Just ask, “Could you point to the column your card is in?” If they lie to you, the trick won’t work, so make sure to emphasize to the volunteer that they need to be truthful about their card's whereabouts. If you’re worried your viewer won’t be honest, say, \"Be honest now, or the trick won't work!\""
    },
    {
      "title": "Sandwich the column with their card between the other two columns.",
      "content": "Sandwich the column with their card between the other two columns. Push together each column into a pile, and then stack the pile with their card in it between the other two piles. Put the deck back together quickly and subtly, so that your viewer doesn’t notice that you are putting the columns back together in any particular order. [4] X Research source For example, if the 2nd pile contained their card, you would need to put it in between the 1st and 3rd columns."
    },
    {
      "title": "Lay out the cards again and repeat the process.",
      "content": "Lay out the cards again and repeat the process. Arrange the cards in 3 columns of 7. Then, ask the volunteer which column their card is in, and sandwich that column in the middle of the other two columns. [5] X Research source Don’t shuffle in between laying out the cards or you’ll mess up the trick."
    },
    {
      "title": "Do the same thing one more time.",
      "content": "Do the same thing one more time. Lay down the cards in 3 columns that have 7 cards each, then have the volunteer point to whichever column their card is in. Pick up the columns as you did before, sandwiching the pile the volunteer chose in between the other two. When the volunteer points to the column with their card in it, their card will be the 4th card down in that column. This is because of how you’ve been moving their column to the middle each time."
    },
    {
      "title": "Reveal that the 11th card in the deck is the volunteer's card.",
      "content": "Reveal that the 11th card in the deck is the volunteer's card. Count out 11 cards and stop at the 11th card. Then, point to that card and announce that it's the volunteer's card. The volunteer will be amazed that you were able to find their card. [6] X Research source . Each time you asked which column the volunteer's card was in, you were narrowing down the potential range where their card could be."
    },
    {
      "title": "Perform the basic trick but don’t reveal the volunteer's card yet.",
      "content": "Perform the basic trick but don’t reveal the volunteer's card yet. Do everything exactly as you would for the normal trick, including laying out and rearranging the cards 3 times. Then, instead of counting out 11 cards and announcing the volunteer's card, make the reveal take longer to build up the suspense and mystery."
    },
    {
      "title": "Ask your audience to spell out “mystery card” as you put down cards.",
      "content": "Ask your audience to spell out “mystery card” as you put down cards. For each letter that they call out, place another card face down on the table. Since “mystery card” contains 11 letters, the card you put down on the \"d\" will be their card. Enjoy their amazed reactions! You can also do this with a phrase that's 10 letters long, like “your card is,” and then flip over their card after they finish spelling it."
    },
    {
      "title": "Deal the cards into 7 face-up piles for another alternative ending.",
      "content": "Deal the cards into 7 face-up piles for another alternative ending. The volunteer's card will be the 11th card you lay down. Ask the volunteer to pick 4 piles. If one of those piles has their card in it, remove the 3 piles they didn't pick. If their card isn't in one of those 4 piles, remove the piles they did pick. Continue asking the volunteer to choose piles and removing the piles that their card isn't in until you're left with 1 pile of 3 cards. Finally, spread out the 3 remaining cards, and announce which one is the volunteer's. [7] X Research source Try running your hand over the 3 cards and closing your eyes to pretend you're sensing which card is theirs."
    }
  ]
}