{
  "url": "https://www.wikihow.com/Find-the-Area-of-a-Shape",
  "title": "How to Find the Area of a Shape",
  "steps": [
    {
      "title": "Measure the width and height.",
      "content": "Measure the width and height. You'll need to start by finding the width and height of the shape (in other words, by finding the measure of two adjoining sides). [1] X Research source For a parallelogram, you'll need to use what are called the base and vertical height, but these are the same idea as width and height. In the real world, you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Multiply the sides.",
      "content": "Multiply the sides. Multiply the sides by each other. [2] X Expert Source David Jia Academic Tutor Expert Interview. 7 January 2021. For example, if you have a rectangle with a height of 16 in and a width of 42 in, you'll need to multiply 16 x 42. [3] X Research source If you're calculating the area of a square you can actually save yourself some time when using a calculator and just square the side. So, if the side is 4 ft, click 4 and then the square button on your calculator to get the answer. Squaring automatically multiples the number by itself."
    },
    {
      "title": "Get your result.",
      "content": "Get your result. The resulting number from the multiplication is the area of your shape, which is written as \"square units\". So the area for our rectangle would be 672 square inches. This is also sometimes referred to as inches square or written with a small 2 above the text line instead of the word \"square\"."
    },
    {
      "title": "Take your measurements.",
      "content": "Take your measurements. You'll need the measurement of the base, the top, and the vertical height. The base and top are the two parallel sides, while the height will be taken on one of the sides with the angle. [4] X Research source In the real world, you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Add the top and base measurements.",
      "content": "Add the top and base measurements. [5] X Research source Let's say ours has a top that's 5cm and a base that's 7cm. That gives us a value of 12."
    },
    {
      "title": "Multiply that value by 1/2.",
      "content": "Multiply that value by 1/2. [6] X Research source That gives us a value of 6."
    },
    {
      "title": "Multiply that value by the height.",
      "content": "Multiply that value by the height. For our trapezoid, let's say that that's 6cm. That gives us a value of 36. [7] X Research source"
    },
    {
      "title": "Get your result.",
      "content": "Get your result. The resulting number after you multiply the height is the area of the trapezoid. So for our 5x6x7 trapezoid, the area is 36 square cm."
    },
    {
      "title": "Find the radius.",
      "content": "Find the radius. In order to find the area of a circle, you'll need to know the radius. This is the measurement of the distance between the center of the circle and the outside edge. You can also find this by taking the diameter, or the measurement of the width of the circle, and dividing it in half. [8] X Research source In the real world, you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Square the radius.",
      "content": "Square the radius. Multiply the radius times itself. Let's say we have a radius that is 8 feet. That gives us a value of 64."
    },
    {
      "title": "Multiply by pi.",
      "content": "Multiply by pi. Pi (π) is a really big number that is used in lots of calculations. If you're using a calculator, use the pi function for a really accurate result. If not, you can round pi (ignore some of the numbers) and just multiply by 3.14159. This gives us a value of 201.06176. [9] X Research source"
    },
    {
      "title": "Get your result.",
      "content": "Get your result. The resulting number, 201.06176 in our case, is the area of the circle. So we get a result of 201.06176 square feet."
    },
    {
      "title": "Take your measurements.",
      "content": "Take your measurements. Sectors are portions of a circle, that come out looking a bit like fans. You'll need to know the radius of the original circle, or one side of your \"fan\", as well as the angle of the point. For us, let's say we have a radius of 14 inches and an angle of 60. [10] X Research source In the real world, you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Square the radius.",
      "content": "Square the radius. Multiply the radius times itself. This gives us a value of 196 (14x14)."
    },
    {
      "title": "Multiply by pi.",
      "content": "Multiply by pi. Pi (π) is a really big number that is used in lots of calculations. If you're using a calculator, use the pi function for a really accurate result. If not, you can round pi (ignore some of the numbers) and just multiply by 3.14159. That gives us a value of 615.75164. [11] X Research source"
    },
    {
      "title": "Divide the angle by 360.",
      "content": "Divide the angle by 360. Now, you'll need to take the angle of the point and divide that number by 360 (which is the number of degrees in a circle). For us, we get a value of roughly .166. It's technically a repeating number, but we're going to round to make the math easier. [12] X Research source"
    },
    {
      "title": "Multiply the resulting number by the number you got earlier.",
      "content": "Multiply the resulting number by the number you got earlier. Multiply the number you get when you divide by 360 by the number you got earlier after you multiply by pi. [13] X Research source For us, this gives a result of about 102.214."
    },
    {
      "title": "Get your result.",
      "content": "Get your result. This resulting number is the area of your sector, making our sector 102.214 square inches."
    },
    {
      "title": "Get your measurements.",
      "content": "Get your measurements. To get the area of an ellipse, you'll need to know the two \"radio\", which you can think of as the width and the height each divided in half. These are the measurements from the center to the middle of the long side and from the center to the middle of the short side. The measurement lines should form a right angle. In the real world, you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Multiply the two radii.",
      "content": "Multiply the two radii. [14] X Research source For us, let's say that the ellipse is 6 inches wide and 4 inches tall. This gives us radii of 3 inches and 2 inches. Now, we'll multiply those numbers by each other, giving us 6 (3x2). [15] X Expert Source David Jia Academic Tutor Expert Interview. 7 January 2021."
    },
    {
      "title": "Multiply that number by pi.",
      "content": "Multiply that number by pi. [16] X Research source Pi (π) is a really big number that is used in lots of calculations. If you're using a calculator, use the pi function for a really accurate result. [17] X Expert Source David Jia Academic Tutor Expert Interview. 7 January 2021. If not, you can round pi (ignore some of the numbers) and just multiply by 3.14159. That gives us a value of 18.84954."
    },
    {
      "title": "Get your result.",
      "content": "Get your result. That resulting number is the area of your ellipse. For us, that means our ellipse is 18.84954 square inches."
    },
    {
      "title": "Find your measurements.",
      "content": "Find your measurements. You'll need to know the base measurement of the triangle as well as the height. The base can be any side of the triangle, as long as you can also measure the height. Let's say that we have a triangle with a base of 3 meters and a height of 1 meter. [18] X Research source In the real world you'll have to measure for yourself but for your homework your teacher should have these measurements listed with the shape."
    },
    {
      "title": "Multiply the base by the height.",
      "content": "Multiply the base by the height. For us, this gives a value of 3 (3x1). [19] X Research source"
    },
    {
      "title": "Multiply that value by 1/2.",
      "content": "Multiply that value by 1/2. [20] X Research source This gives us a value of 1.5."
    },
    {
      "title": "Get your result.",
      "content": "Get your result. That resulting value is the area of the triangle. So we get a result of 1.5 square meters."
    },
    {
      "title": "Break the shape down into sections.",
      "content": "Break the shape down into sections. You'll have to start finding the area for complex shapes by breaking the shape down into geometric shapes, like those discussed above. On homework assignments, it will probably be pretty clear cut what those shapes should be, but in the real world, you might need to break an area up into a lot of shapes in order to get really accurate. [21] X Research source A good place to start is by looking for right angles and parallel lines. These serve as the basis of many shapes."
    },
    {
      "title": "Calculate the area of the separate shapes.",
      "content": "Calculate the area of the separate shapes. Use the instructions above to find the area of the different shapes you find. [22] X Research source"
    },
    {
      "title": "Add the shapes together.",
      "content": "Add the shapes together. Add the resulting areas together in order to get the total area for your shape. [23] X Research source"
    },
    {
      "title": "Use alternative methods.",
      "content": "Use alternative methods. There are other tricks you can try too, depending on the shape. You can also try adding imaginary space in order to make the shape a standard geometric shape, and then subtracting the area of that imaginary space after you get your result, for example."
    }
  ]
}