{
  "url": "https://www.wikihow.com/Do-a-Backbend-Kickover",
  "title": "How to Do a Backbend Kickover",
  "steps": [
    {
      "title": "Stretch your back, wrists, and splits",
      "content": "Stretch your back, wrists, and splits beforehand. [1] X Expert Source Landis Owens Personal Trainer Expert Interview. 8 June 2021. Stretch your wrists and ankles by rolling them gently in circles, and doing lunges will help stretch your legs and hamstrings. [2] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020. Do yoga to stretch your back, or practice doing a bridge to get your back ready for the backbend. [3] X Research source For a more thorough, deep stretch, spell out the alphabet with each wrist and foot. If you can’t do a full split, practice working towards the splits by reaching for your toes and straddling your legs. Stretch for the backbend by bending backwards as far as you can and then standing up straight again slowly."
    },
    {
      "title": "Stand up straight with your feet shoulder-width apart.",
      "content": "Stand up straight with your feet shoulder-width apart. This will put your legs in a natural position to support your body once you bend over. Make sure you have plenty of space behind you so that you're able to do the backbend safely."
    },
    {
      "title": "Fall into a backbend",
      "content": "Fall into a backbend by leaning back with your arms above your head. With your feet planted firmly on the ground, stretch your arms above your head and lean backwards. Continue leaning back slowly until your arms touch the ground. [4] X Research source If this is your first attempt at a backbend kickover, consider getting a spotter to help keep you steady and make sure you don't fall. [5] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020. Practice falling into a backbend using a wall. Stand close to a wall with your back facing it and bend your arms up backwards over your head. Once your hands reach the wall, walk down the wall using your hands until you’ve reached the floor, keeping your feet planted in the same spot. [6] X Expert Source Tanya Berenson Gymnastics Instructor Expert Interview. 22 May 2020."
    },
    {
      "title": "Use a chair to help you adjust to a backbend.",
      "content": "Use a chair to help you adjust to a backbend. If you’re getting nervous as you bend backwards and don’t feel comfortable going all the way down, place a chair behind you with the seat facing your back. As you bend over backwards, reach your arms downwards until you touch the seat of the chair. [7] X Research source It’s a good idea to use a heavy chair or push a chair up against a wall to ensure it doesn’t move while you’re practicing."
    },
    {
      "title": "Start on the floor if you’re unable to form a bridge from standing up.",
      "content": "Start on the floor if you’re unable to form a bridge from standing up. If you can’t do a backbend from standing up, that’s okay! Lay down on the floor with your legs bent and your feet flat on the ground to begin the bridge . Place your hands above your head on the ground with your elbows bent as well. Push your body off of the ground using your arms and legs until you’ve formed a bridge with your body. [8] X Research source Both hands and feet should be flat on the ground with your back up in the air. Keep your hands as close to your feet as possible when you are in the bridge. This will facilitate your movements when you do the kickover."
    },
    {
      "title": "Try your backbend kickover off of heights.",
      "content": "Try your backbend kickover off of heights. Stack mats and do kickovers off of it. As you do it, lower the mats. Finally, try it on the ground. You really have to push all your weight onto your hands to get to the other side. That is the biggest tip of learning a backbend kickover. [9] X Research source Point your toe as you lift your leg up straight. Keep your shoulders directly above your hands."
    },
    {
      "title": "Bend your lead leg to give you more control.",
      "content": "Bend your lead leg to give you more control. If you're nervous about kicking over with both legs straight, keep your lead leg bent the entire time. This will make it easier for you to kick off the ground with the other foot and give your body more control as it lifts up your legs. [10] X Research source Once you’ve mastered the kickover with a bent leg, try it keeping both legs straight."
    },
    {
      "title": "Use your grounded leg to push your legs over your body.",
      "content": "Use your grounded leg to push your legs over your body. Gain momentum from your foot that’s still on the floor so that as you push up with the foot, you’re able to lift both legs over you. Keep both legs straight once they’re off of the ground, and don’t worry if you’re not able to do it on the first try. [11] X Research source If you’re able to move into a split handstand from the backbend, that may help you get your legs over your body. Use your hands and shoulders to support your body as your legs move. Keep your arms straight the entire time."
    },
    {
      "title": "Start on a raised platform to make it easier to kick over.",
      "content": "Start on a raised platform to make it easier to kick over. Get into the bridge position with your hands on the ground and your feet placed on the raised platform. The extra height will make it easier for you to swing your legs over your body and get used to the movement. [12] X Research source This could be something like an ottoman or chair, though it’s important to make sure the surface is stable and won’t move. Try the kickover without a raised surface once you feel more confident."
    },
    {
      "title": "Land on your lead leg with your other leg following.",
      "content": "Land on your lead leg with your other leg following. The leg you lifted into the air first will come to the ground first, and the leg you used to push off with will follow. Keep your hands planted on the ground and your shoulders squared to give you additional strength. [13] X Research source The leg you used to kick off will come down a little bit behind your lead leg. If your feet touch the ground close to the same time, this is also okay."
    },
    {
      "title": "Stand up straight once you’ve stuck the landing.",
      "content": "Stand up straight once you’ve stuck the landing. Once both feet are back on the ground, stand up straight, lifting your arms straight up in the air for a gymnastics finish. You’ve successfully done a backbend kickover! [14] X Research source"
    }
  ]
}