{
  "url": "https://www.wikihow.com/Explain-C-Ptsd-to-Someone-Who-Doesn%27t-Have-It",
  "title": "Explaining CPTSD to Someone Who Doesn't Have It",
  "steps": [
    {
      "title": "Explain that CPTSD develops after enduring trauma over a long period.",
      "content": "Explain that CPTSD develops after enduring trauma over a long period. CPTSD is different than PTSD, which is caused by a single traumatic event like a car crash or sexual assault. [1] X Research source CPTSD isn’t caused by just one bad day; it's caused by repeated trauma over time. Some people struggle to understand PTSD when it doesn’t result from some climatic event or you seem mostly okay. CPTSD developed during childhood “manifests differently,” as psychologist George Sachs explains. “If it happens in childhood, you may have a higher functioning person, but…they do things that are just a little odd to protect themselves or keep themselves safe.”"
    },
    {
      "title": "Use the evidence board analogy.",
      "content": "Use the evidence board analogy. Ask them if they’ve ever seen police shows where they pin pieces of evidence on a board and connect them with string. Events and information that seem unrelated become connected in a haphazard pattern. This same principle is true for CPTSD, where many experiences add up to explain the feelings and struggles you experience today. [2] X Research source"
    },
    {
      "title": "Explain how the body responds to trauma.",
      "content": "Explain how the body responds to trauma. When you’re explaining the causes of CPTSD to a loved one, they may struggle to understand why non-violent abuse had such an impact on you. Tell them that the body cannot tell the difference between types of trauma and fear. When your brain is afraid, it believes your life is in danger, whether it’s being shouted at or shot at. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Ask them what kind of childhood they would want.",
      "content": "Ask them what kind of childhood they would want. Most people will answer with words like happy, safe, or loved. Complex trauma generally develops during childhood. Helping your listener understand that your childhood was the opposite of happy and safe may help them understand the challenges you’re facing. [4] X Research source Besides childhood abuse and neglect, other common causes of complex PTSD are domestic violence, sexual abuse, torture, sex trafficking, slavery, or war. While some of these examples are serious crimes, they are all equally valid in their impact on survivors. CPTSD is more likely to be developed by people who experienced harm at a young age or at the hands of someone they trusted and couldn’t escape, like a parent or family member. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Explain the impact of negative messaging.",
      "content": "Explain the impact of negative messaging. Ask them if they’ve ever been told something negative about themselves that’s stuck with them. Then, ask them how they think it would have affected them if they’d been told their whole lives that they were unworthy, unlovable, or a bad person. [6] X Research source Complex PTSD is often developed by parents or caretakers giving this kind of negative messaging to their children on a daily basis, which is one sign to identify emotional abuse."
    },
    {
      "title": "Point them toward CPTSD resources so they can educate themselves.",
      "content": "Point them toward CPTSD resources so they can educate themselves. Ask them to spend time researching what complex PTSD is and the ways they can support you. There are many physical and virtual support communities for people living with CPTSD and their loved ones. [7] X Research source Get started with resources through the CPTSD Foundation and the National Alliance on Mental Illness (NAMI) . Introduce this idea by saying something like, “As much as I appreciate you sitting here and hearing me out, it’s difficult for me to talk about my trauma in depth. It would mean a lot to me if you were willing to learn more about CPTSD on your own. If it helps, I can give you some resources that have helped me”"
    },
    {
      "title": "Describe the emotional CPTSD symptoms you have.",
      "content": "Describe the emotional CPTSD symptoms you have. Explain how your experiences have influenced your self-esteem, work ethics, self-worth, ability to trust that others care for you. If your loved ones are aware of how your CPTSD affects your behavior, they may be able to help you and are less likely to take it personally. [8] X Research source For example, you could point to a past incident like, “Do you remember when I gave you the silent treatment after that argument? While it doesn’t excuse how I acted, it was really because I felt like I didn’t deserve your friendship and I didn’t think you cared about me. But that wasn’t really about you, it was about the way I was made to feel growing up.” Other symptoms of CPTSD include problems controlling emotion or maintaining long-term relationships. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source In addition to these symptoms, you may be experiencing PTSD symptoms like emotional flashbacks, nightmares, and anger management issues. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Psychologist Allison Broennimann advises you to “remember that individuals who haven't gone through trauma really don't understand what you're experiencing. Trying to explain it in a calm time…[helps] friends and family know not to take certain behaviors personally.”"
    },
    {
      "title": "Give your confidante ways to spot signs of your CPTSD.",
      "content": "Give your confidante ways to spot signs of your CPTSD . Tell them you may look really overwhelmed and not be able to verbalize what’s happening when you’re upset or triggered. Psychologist George Sachs gives two possibilities as to how someone with CPTSD may appear to others: either “withdrawn, depressed and shut down or hypervigilant, anxious and worried,” You can even give them helpful questions and phrases for when they think you are triggered, like “Is it possible you’re having a flashback?” or “It’s okay to be scared, but you’re here with me right now and you’re not in any danger.”"
    },
    {
      "title": "Tell them what your triggers are and how to support you.",
      "content": "Tell them what your triggers are and how to support you. Write your triggers in a journal or discuss them with a therapist to help you understand them and more clearly share them with others. Explain your triggers to people who spend a lot of time with you to help them understand what is happening and how to help in that moment. [11] X Research source In an example given by neuropsychology expert Allison Broenniman, you may frequently get overwhelmed at concerts or sporting events. Dr. Broenniman advises that you have “arrangements made with your family so that you can sit down and wait until you calm down.” Everyone needs different types of support when they’re triggered, so let your loved ones know what you need. Dr. Broennimann explains how “some people will go for a walk, some people will call a friend, some people will just listen to music or find some other way to soothe themselves in a healthy way.” CPTSD triggers happen when you are reminded of your traumatic experience, whether by a sight, sound, smell, or location you associate with a trauma. These triggers may seem harmless or illogical to others, but they have a significant impact on you."
    },
    {
      "title": "Explain why you might struggle with unhealthy coping strategies.",
      "content": "Explain why you might struggle with unhealthy coping strategies. When so much of your life has been shaped by traumatic experiences, you may want to find peace at any cost. Many people turn to drugs, alcohol, or other numbing strategies to escape their pain. [12] X Research source While you should work to find healthier coping strategies , helping your loved ones understand why you’ve sought relief in these ways can help them relate to you better."
    },
    {
      "title": "Consider whether you can fully trust the other person.",
      "content": "Consider whether you can fully trust the other person. Ask yourself if they are someone you feel safe with, both physically and psychologically. You still may feel nervous or anxious or have self-doubt—these are normal feelings when being vulnerable with someone else. But ask yourself if this person has done things in the past to make you think that: [13] X Research source They are likely to minimize your experience or belittle you. They are likely to invalidate your feelings. They don’t have the emotional maturity to hear you out and challenge their own perspectives. If any of these things apply to the person you want to disclose to, you may want to reconsider talking to them. But someone who loves and cares about you will want to hear you out and understand what you’re going through."
    },
    {
      "title": "Prepare yourself for uncomfortable questions.",
      "content": "Prepare yourself for uncomfortable questions. Even with the best intentions, loved ones may say or ask something that feels invalidating. For example, they might wonder aloud why you’re so upset. If they knew you at the time of your traumatic experiences, they may say that their perception of events was different. [14] X Research source It can help to plan the conversation in advance, including responses to common questions and invalidating statements. Write information about CPTSD on a notepad and use it to guide you during the conversation. If you feel invalidated, use an “I” statement like “I feel like my feelings are being invalidated. I just need to be heard right now.”"
    },
    {
      "title": "Understand what you want to achieve through this conversation.",
      "content": "Understand what you want to achieve through this conversation. Do you want support? If so, what kinds of support do you need from this person? Do you want their advice? If not, how will you express that to them if they start giving it to you? If you don’t have a solid idea of what your needs and boundaries are, then it’s difficult to explain that to others. [15] X Research source If someone starts giving you unsolicited advice, say something like, “Thank you for your advice, but right now I just need someone to listen. You don’t need to solve the problem for me, but I appreciate that you would if you could.” Clinical psychologist Allison Broennimann recommends knowing your boundaries as a first step toward explaining CPTSD to others. As Dr. Broennimann explains, “if you know what you need, you can communicate that easier to others…A lot of people get into trouble when they don't know what they need [because] they're already overwhelmed and triggered.”"
    },
    {
      "title": "Seek guidance from a psychologist.",
      "content": "Seek guidance from a psychologist. Speak with a therapist or qualified trauma counselor who can give you tools to explain CPTSD to loved ones who don’t understand it. They can help you name your boundaries and decide the best way to express your experiences. If you don’t already have a therapist, it’s a good idea to start seeing one regularly to help heal from your trauma. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In addition to helping you navigate this conversation, a “therapist will teach you different ways to manage your anxiety and trauma episodes,” according to psychologist George Sachs. To find a therapist, Dr. Sachs names the most important criteria as being someone who knows about PTSD and someone that you like. As Dr. Sachs explains, “research shows that if you like your therapist, you're going to get better…You really need to feel comfortable and safe."
    }
  ]
}