{
  "url": "https://www.wikihow.com/Do-a-Modern-Palm-Reading",
  "title": "How to Do a Modern Palm Reading",
  "steps": [
    {
      "title": "Ask for the dominant hand.",
      "content": "Ask for the dominant hand. In palm reading, the dominant hand is seen as the \"active\" hand. The other hand is seen as the \"passive\" hand. Use the dominant hand for the reading. [1] X Research source In palm reading, the passive hand is said to display what you are born with, what your parents pass down. [2] X Research source Alternatively, the active hand is supposed to show what you have done so far in your life. [3] X Research source"
    },
    {
      "title": "Find the major lines.",
      "content": "Find the major lines. The main lines are the heart line, the head line, and the life line. Some people also have the fate line. [4] X Research source The heart line runs from between the index and middle finger to the edge of the palm. It mostly runs horizontal if you are looking at your own palm with fingers up, though it can curve. [5] X Research source The head line is the horizontal line that runs underneath the heart line. [6] X Research source The life line curves around the thumb pad, while if you have a fate line, it will jut out from the bottom of your palm up towards the middle finger. [7] X Research source To see the lines better, try cupping your hand slightly so you can see where it creases. [8] X Research source"
    },
    {
      "title": "Look for the minor lines.",
      "content": "Look for the minor lines. Some people have other lines as well. These are more minor lines. [9] X Research source For instance, some people have an intuition line that curves in from the middle outside of the palm and then back out at the bottom of the palm. [10] X Research source Many people also have a bracelet line, where the hand meets the wrist. [11] X Research source Others have the Girdle of Venus, which scoops down from the top of the palm and back up, all above the heart line. [12] X Research source A health line can run from the base of the pinky down towards the bottom middle of the base of the palm, while the children and relationship lines are small horizontal lines under the base of the pinky. [13] X Research source"
    },
    {
      "title": "Find the finger lines.",
      "content": "Find the finger lines. Each of the fingers has its own name, as well, which can also give name to creases. The index finger is Jupiter. The middle finger is Saturn. The ring finger is Apollo, and the pinkie is Mercury. [14] X Research source If a person has a ring underneath the creases at the bottom of each finger, they take the name of the finger, such as the ring of Saturn. [15] X Research source These names can also be lent to lines that originate at the base of the finger, such as the Apollo line. It runs from the base of the ring finger down through the palm. [16] X Research source"
    },
    {
      "title": "Consider the heart line.",
      "content": "Consider the heart line. Like its name implies, this line is related to matters of the heart. It tells about your emotional life and relationships. Examine its length, how it curves, and whether it is broken or crossed. For instance, crosses in the line or places where it breaks can mean you've had episodes where you were very sad. [17] X Research source If it's straight and long, that means you're happy with your love life. It also means you're giving emotionally. \"Long\" means it starts underneath the index finger. [18] X Research source If it's long and curved, that means you are emotionally open, and that you're especially affectionate when that curve points towards the index finger. [19] X Research source If the line is straight and short, that means you're not as tied down by romantic notions. \"Short\" means it starts near your middle finger or even further down your palm. [20] X Research source If it's short and curves, that means you keep your emotions closer to the chest, preferring the company of a close group of friends to that of a large party. [21] X Research source"
    },
    {
      "title": "Check up on your life line.",
      "content": "Check up on your life line. Your life line isn't about how long you're going to live. Rather, it points to how you've been taking care of yourself, or more pointedly, if you haven't been taking care of yourself. [22] X Research source If you see a number or breaks a long this line, that could be an indication you need to take better care of yourself. In other words, you need to get more rest and look after your emotional and physical needs. [23] X Research source A short line (one that doesn't go all the way to the bottom of your palm), means you like to distract yourself when tough times hit, while a longer line means you're the person everyone else looks to for support."
    },
    {
      "title": "Take a look at the head line.",
      "content": "Take a look at the head line. The head line displays things to do with your brain, such as your intelligence or the way you communicate. It also can show the ways you learn best. [24] X Research source Pay attention to how the head and heart line interact. If they are pinched together, it can mean you are a bit more reserved and cautious. The more spread apart these two lines are at the beginning, the more adventurous you are. [25] X Research source If the line is straight, it says you're more levelheaded, while if it curves, you're more spontaneous. [26] X Research source If the line splits, that could mean you are more able to step into another person's shoes than most people."
    },
    {
      "title": "Decide if there's a fate line.",
      "content": "Decide if there's a fate line. Because not everyone has a fate line, it can be exciting to find one. It can tell you what your life is going to look like. For instance, if it is often broken in places, that means you have or could have many career and life changes in your lifetime. [27] X Research source"
    },
    {
      "title": "Examine the minor lines.",
      "content": "Examine the minor lines. Not everyone has the minor lines. If they do, it can indicate any number of things. For instance, if a person has a Girdle of Venus, it likely means that person is highly nervous and excitable, [28] X Research source while the intuition line, as it implies, indicates a person who is highly in-tune with other's emotions. [29] X Research source You can actually have more than one relationship line, and those indicate any person you're close to, not just a lover. If you are able to see them easily or they are especially long (past the pinky to the ring finger), that indicates someone who is able to commit. The rings of the fingers each have a different meaning. For instance, the ring of Saturn (middle finger) indicates people who keep themselves away from others, while the ring of Jupiter (index finger) is a highly intelligent person and the ring of Apollo (ring finger) can mean you're feeling blocked in a creative endeavor."
    },
    {
      "title": "Look at the Venus mount.",
      "content": "Look at the Venus mount. The Venus mount is basically your thumb pad. If you found your life line, that generally encircles your Venus mount. [30] X Research source However, it's the part close to the base of your thumb. [31] X Research source If it rises about average, that means you are enjoying life, including the arts and other good things in life. [32] X Research source If it's a little below average or nonexistent, that means you may be lonely or fall on hard times often. If it's above average, it can mean you're a bit gluttonous in how you approach life. [33] X Research source"
    },
    {
      "title": "Check the mount of Jupiter.",
      "content": "Check the mount of Jupiter. This mount is the pad just below the index finger, and it is meant to show how confident you are, how well you manage your life, and how society views you. Check how prominent it is in relation to other mounts on the hand. [34] X Research source If it is especially developed, you're more likely to have a charmed life, as well as you're likely to be very gregarious. [35] X Research source However, it can also go bad, as it can mean you're aggressive and domineering. [36] X Research source If it's average, it means you are meant to be a helper and do good in the world. [37] X Research source It can also mean you're smart and are able to guide others. [38] X Research source If it's less than average, that means you don't have the best self-esteem. [39] X Research source"
    },
    {
      "title": "Look for the mount of Saturn.",
      "content": "Look for the mount of Saturn. This mount is located below your middle finger. It indicates how responsible you are, as well as how much duty you feel and whether you seek solitude or not. [40] X Research source If it is particularly prominent, it can indicate that you put your foot down a bit too much and you tend to not trust others. [41] X Research source If it's average, it shows your likable and capable of surviving on your own. [42] X Research source If it's low, it can mean you don't have a lot of depth and don't spend enough time reflecting. [43] X Research source"
    },
    {
      "title": "Check the mount of Apollo.",
      "content": "Check the mount of Apollo. This mount is below your ring finger. It's connected to happiness, genius, and creativity. [44] X Research source If it's high, you have a lot of pride, maybe too much, which can lead to you snapping at people. You enjoy charming other people, and you may enjoy spending money on yourself and others. [45] X Research source If it's average, it can mean your less excitable, that you're independent and have high self-esteem. You also like people. [46] X Research source If it's low, it shows you are less creative than other people, which can lead to indecision. [47] X Research source"
    },
    {
      "title": "Find the Mercury mount.",
      "content": "Find the Mercury mount. This mount is located below your pinky finger. [48] X Research source It can be indicative of riches and whether a person will go abroad. [49] X Research source If it's below average, you're probably shy and not able to connect to many people, which can mean you won't make as much money over your lifetime. [50] X Research source An average mount can mean that you are a versatile person who is empathetic to others. You find many things interesting. [51] X Research source A high mount shows someone who's full of avarice and who is a bit too talkative. [52] X Research source"
    },
    {
      "title": "Find the moon mount.",
      "content": "Find the moon mount. This mount is at the bottom of your hand, on the opposite side to the thumb. It can also represent creativity, as well as intuition. [53] X Research source If it's below average, you may still have a decent imagination, but you just don't share it with others. [54] X Research source If it's average, it shows it means you're very imaginative without getting too crazy. [55] X Research source If it's highly developed, it means you can let your creativity get a bit too crazy, and you can go off the deep end. [56] X Research source"
    },
    {
      "title": "Read the hand as a whole.",
      "content": "Read the hand as a whole. That is, it's important to look at all the parts together, not just individual pieces. Modern hand readers like to use the whole hand to figure out where a person is in life, and use that to complete the reading. For instance a straight head line and a long life line can indicate that you are levelheaded, which is what makes you so good in times of crisis."
    },
    {
      "title": "Combine palm reading with other types of readings.",
      "content": "Combine palm reading with other types of readings. Many modern readers don't just read hands. They might also read faces or tarot cards, for instance. Learning other types of readings can help you get a sense of the person as a whole, which in turn, gives you a better chance of helping the person with what they're facing. [57] X Research source"
    },
    {
      "title": "Don't be afraid to bring in psychology.",
      "content": "Don't be afraid to bring in psychology. Many modern hand readers use psychology to assist them in their readings. Because so much of modern palm reading is about what makes up a person and how they can use that in the future, having a working knowledge of psychology can help you understand how a person might move forward with a problem. [58] X Research source For instance, if someone is feeling frustrated about a project and showing a ring of Apollo, you might suggest ways that person can open up to creativity. Since the ring of Apollo indicates a creative block, learning new ways to be creative can help the person move forward, a solution that can rely on psychology."
    },
    {
      "title": "Think about holistic healing.",
      "content": "Think about holistic healing. Just like psychology, holistic healing techniques can also help you offer better solutions to the people you're reading for. Modern readers often bring in these techniques. [59] X Research source Holistic healing means looking at the whole person and offering solutions that work for them. For instance, you may look at how the health can affect a person's mental state. As an example, if the person's mount of Jupiter is low, suggesting that he or she doesn't have great self-esteem, you could suggest a two-part approach that includes mind and body to boost self-esteem. For example, you could suggest an exercise program to help the person get in better shape and build confidence, along with a daily regimen of learning to talk positively to themselves so they build better self-esteem. [60] X Research source"
    }
  ]
}