{
  "url": "https://www.wikihow.com/Dress-Like-Barbie",
  "title": "How to Dress Like Barbie",
  "steps": [
    {
      "title": "Go for pink t-shirts and blouses.",
      "content": "Go for pink t-shirts and blouses. Everyone knows that Barbie’s favorite color is pink. Play up the pink in your wardrobe by wearing pink t-shirts and blouses. You can vary the shades of pink in your wardrobe by going for hot pink or pale pink. You may even find pink t-shirts with rhinestones on them, adding an extra Barbie-like sparkle to your outfits. [1] X Research source There is currently a Barbie themed fashion line released by the makers of Barbie, Mattel. This clothing collection is available in adult sizes, featuring items that are based on the actual outfits of Barbie. You can find this clothing collection online and in clothing retailers like Forever 21 and Lord & Taylor. [2] X Research source"
    },
    {
      "title": "Get high waisted acid wash jeans and shorts.",
      "content": "Get high waisted acid wash jeans and shorts. Barbie is also known for her classic, 80s style, including her fondness for high waisted acid wash jeans and shorts. Look for your own pair of acid wash jeans at the mall or online. Get a pair of acid wash shorts too for summer days when you want to rock the Barbie look. [3] X Research source"
    },
    {
      "title": "Look for casual dresses in shades of pink.",
      "content": "Look for casual dresses in shades of pink. If you’re looking for a more feminine day look, you can go for casual dresses in shades of pink, like hot pink, pale pink, or pastel pink. [4] X Research source The dresses should have a figure flattering shape, like A-line or cinched at the waist. That way, they will appear more in the style of Barbie, who is known for her tasteful and feminine appearance."
    },
    {
      "title": "Wear heels, even with casual outfits.",
      "content": "Wear heels, even with casual outfits. Barbie is also known for her perfectly shaped plastic feet, made to fit into any plastic pair of heels you can imagine. Emulate this by wearing high heels or shoes with a slight heel, even with casual outfits. [5] X Research source For comfort, you may decide to wear shoes with a short heel for everyday wear and higher heels for important appointments or meetings, where you want to look a bit more Barbie-like."
    },
    {
      "title": "Get a small pink purse or a pink backpack.",
      "content": "Get a small pink purse or a pink backpack. Accessorize like Barbie by using a small pink purse or a pink backpack for your school books or your important items. Look for bags in a material like vinyl or leather, as Barbie is never without her purse, even for casual days out."
    },
    {
      "title": "Consider a push up bra or a corset.",
      "content": "Consider a push up bra or a corset. If you are an adult dressing up like Barbie, you may want to integrate a push up bra or a corset into your day and night look to emulate the shape of Barbie. You could stuff the push up bra so you have larger breasts and pull the corset tight so your proportions are exaggerated in the waist area. If you are a child or a young person dressing up like Barbie, you can skip this step."
    },
    {
      "title": "Go dramatic like Barbie with a long gown.",
      "content": "Go dramatic like Barbie with a long gown. When Barbie gets dressed up for a night out on the town, she goes big with a long gown. Look for a long gown with sparkles or a sparkle design. You can also go for gowns in luxurious looking fabrics like satin, lace, and chiffon. [6] X Research source If you still want to appear dramatic and glamorous like Barbie, but you aren’t comfortable in long gowns, you can still wear shorter dresses that sit just below your knees. Go for dresses in fabrics like satin or lace, and in Barbie’s signature pink color."
    },
    {
      "title": "Look for pink platform heels.",
      "content": "Look for pink platform heels. Go full Barbie in the shoe department by wearing pink platform heels with a sparkly finish. You can also look for heels with unique touches, like fur buckles or bows, to have fun with your Barbie look."
    },
    {
      "title": "Get a small sparkly clutch or shoulder purse.",
      "content": "Get a small sparkly clutch or shoulder purse. Barbie is never without her purse and you should not be without one either. Compliment your night out look with a small pink sparkly clutch or a small shoulder purse. [7] X Research source You can give your purse an extra element of Barbie by including a keychain on it that says Barbie or a fuzzy pink keychain to symbolize Barbie."
    },
    {
      "title": "Wear sparkly jewellery.",
      "content": "Wear sparkly jewellery. Accessorize your Barbie look with sparkly jewellery or possibly real diamonds. A gemstone or diamond necklace, as well as diamond earrings, can really add some Barbie glamour to your look."
    },
    {
      "title": "Finish your night out look with a faux fur sole.",
      "content": "Finish your night out look with a faux fur sole. Barbie is all about fun and bold statement pieces, like a faux fur stole to compliment her dress or a faux fur jacket in a bold pink shade. Cap off your night out look with a unique and interesting statement piece to really rock the Barbie style. [8] X Research source"
    },
    {
      "title": "Buy a blonde wig",
      "content": "Buy a blonde wig . If you do not have blonde hair but are looking for the classic Barbie look, you may consider buying a blonde wig to look even more like Barbie. You should look for a synthetic or human hair wig in platinum blonde, with long, straight, perfect strands. [9] X Research source"
    },
    {
      "title": "Straighten your hair for a Barbie look.",
      "content": "Straighten your hair for a Barbie look. You can transform your natural hair into a Barbie look by straightening it so it falls long and straight down your shoulders and back. Do a center part so your hair more closely resembles Barbie and use hairspray to remove any fly aways or frizzy hairs. You want to achieve a very clean and perfect hair look. [10] X Trustworthy Source BreastCancer.org Patient-focused nonprofit organization providing resources for those affected by breast cancer Go to source To change up your Barbie hair look, you may want to curl the ends of your hair with a curling iron. Create loose curls for a more relaxed Barbie look, but make sure they look well done and put together, as Barbie often looks perfect."
    },
    {
      "title": "Wear headbands and other hair accessories.",
      "content": "Wear headbands and other hair accessories. Barbie often accessorizes her hair with pink headbands made of lace and sparkly materials, as well as pink ribbons and hair clips. Give your hair the Barbie treatment and integrate pink hair accessories that compliment your outfit to more closely resemble Barbie."
    },
    {
      "title": "Use eyeshadow in pink shades.",
      "content": "Use eyeshadow in pink shades. Apply eyeshadow in shades of pink to emulate Barbie’s makeup. You can also use fake eyelashes to get the doll-like look. Apply the fake lashes on your top and bottom lashes to compliment your eyeshadow."
    },
    {
      "title": "Apply blue contact lenses.",
      "content": "Apply blue contact lenses. To really get into the Barbie look, you can transform your eyes so they match Barbie’s blue eyes. Use contact lenses with blue irises to make your eyes match Barbie’s eyes."
    },
    {
      "title": "Finish your look with pink lipstick.",
      "content": "Finish your look with pink lipstick. Round out your Barbie look by applying a pink shade of lipstick. Make sure the lipstick has gloss, as Barbie often wears glossy lipstick."
    }
  ]
}