{
  "url": "https://www.wikihow.com/Cook-Rice-in-a-Pot",
  "title": "How to Cook Rice in a Pot",
  "steps": [
    {
      "title": "Choose your additional ingredients.",
      "content": "Choose your additional ingredients. You will only need water and rice to make your rice in a pot, but using additional ingredients adds a bit of extra flavor and texture. If desired, add about a pinch of salt per cup of rice. [1] X Research source Use oil or butter to soften the rice and add flavor. Add a half a tablespoon of butter or oil per cup of rice. [2] X Research source Try flavoring the water with some chicken stock or a bouillon cube. Get creative. Add some of your other favorite seeds and spices if you feel inspired. This will definitely change the flavor of your rice, so consult with others before you go too far."
    },
    {
      "title": "Measure the rice.",
      "content": "Measure the rice. Use about a half a cup of rice per person. Measure it, and put it in the pot. The pot should be large enough so the rice fills it to about 1/4 of the entire pot. It is important to have the right sized pot, as a larger pot will alter the rice-to-water ratio, and a smaller pot could overflow. [3] X Research source"
    },
    {
      "title": "Rinse the rice.",
      "content": "Rinse the rice. Not everyone finds this necessary. It is said that a good rinse will remove extra starch from the rice and avoid clumping. Fill the pan with water until the water completely covers all of the rice. Stir with a spoon. Pour the cloudy water back in the sink. [4] X Research source Use a spoon or strainer to avoid pouring the rice out too."
    },
    {
      "title": "Measure the water.",
      "content": "Measure the water. Using the same cup that you used for the rice, add the necessary amount of water. Generally, the ratio of water to rice is two to one. For example, if you are cooking one cup of rice, add two cups of water. This may vary, however, by the type of rice you are using. Remember that too much water will make the rice too soft and not enough water will leave it hard. Ask someone or consult the packaging if you are unsure. [5] X Research source Brown rice varieties will need about 2 ½ cups of water per one cup of rice. Wild rice can take up to four cups of water per one cup of rice."
    },
    {
      "title": "Add the other ingredients.",
      "content": "Add the other ingredients. Add the pinch of salt, oil, or butter."
    },
    {
      "title": "Cover the pot and cook on moderately high heat until the water starts to boil.",
      "content": "Cover the pot and cook on moderately high heat until the water starts to boil. Keep a close eye on the rice. It can burn quickly on high heat. [6] X Research source"
    },
    {
      "title": "Turn the heat down to low once the rice has boiled.",
      "content": "Turn the heat down to low once the rice has boiled. Let the rice simmer for about ten minutes with the lid on. [7] X Research source Quickly check for steam holes in the rice. This is a good sign. It means that the rice is absorbing the water. Don't take the lid off for too long-- you need the steam to cook the rice!"
    },
    {
      "title": "Turn the heat off.",
      "content": "Turn the heat off. Let the rice stand on the same burner with the lid on for 10 minutes. This is important because the steam will finish cooking the rice. [8] X Research source"
    },
    {
      "title": "Gently fluff the rice with a fork or rice paddle.",
      "content": "Gently fluff the rice with a fork or rice paddle. Serve as desired."
    },
    {
      "title": "Decide on the type of rice you want to use for your meal.",
      "content": "Decide on the type of rice you want to use for your meal. There are several different types of rice. Choose the rice that best fits your recipe."
    },
    {
      "title": "Choose a long-grain rice.",
      "content": "Choose a long-grain rice. This will do for average recipes that are not rice-centered. South Asian inspired dishes often call for long-grain rice as well. American long-grain white or brown rice varieties are the most common in the United States. White rice is fluffy and dry. Brown rice tends to be more chewy and grainy in flavor. Jasmine rice is soft with a slight floral aroma. It is used in a lot of Southeast Asian cooking. Basmati rice has a nutty flavor. It is often used in south-central Asian cooking."
    },
    {
      "title": "Choose a medium-grain.",
      "content": "Choose a medium-grain. This type of rice usually absorbs a lot of water and can be quite sticky. Japanese-style rice is firm and often sticky. It is used in a variety of Japanese dishes. Bomba rice is also sticky and absorbs a lot of water. It is commonly used in Spanish dishes like paella."
    },
    {
      "title": "Choose a short-grain rice.",
      "content": "Choose a short-grain rice. Short-grain rice can become sticky, and even creamy, with the right amount of water. Try these for a more soupy rice dish. Arborio rice is quite sticky and creamy. It is used to make Italian dishes like risotto. Short-grain brown rice can also be quite sticky and chewy in flavor."
    },
    {
      "title": "Use a specialty rice.",
      "content": "Use a specialty rice. Mix a specialty rice with a typical long-grain rice to add color, flavor, and texture to your meal. Wehani rice is an American whole grain option. It is reddish-brown in color and mixes well with other rices. Chinese black rice is also a whole grain rice. Unlike other short-grain rices it is firm and non-sticky. It is a deep purple color when cooked. Wild rice cooks firm and chewy with a grainy flavor. It is long-grain and a dark brown color when cooked."
    },
    {
      "title": "Ask for advice.",
      "content": "Ask for advice. Someone in the supermarket or even a friend may be able to help you decide on the right type of rice for your meal. If you don’t have a specific dish in mind, you may enjoy trying a new type of rice just for fun!"
    },
    {
      "title": "Purchase the rice you desire.",
      "content": "Purchase the rice you desire. American long-grain rice is quite common and can be easily found in supermarkets. For specialty rice, try going to health food stores or stores that cater to specific parts of the world."
    }
  ]
}