{
  "url": "https://www.wikihow.com/Get-Rid-of-Genital-Warts-at-Home",
  "title": "The Best Treatments for Removing & Preventing Genital Warts",
  "steps": [
    {
      "title": "Visit your doctor if you experience itching, burning and pain.",
      "content": "Visit your doctor if you experience itching, burning and pain. If your genital warts cause you too much discomfort to go untreated, visit your doctor. Ask them if there are any prescription treatments that can relieve your pain and itching. Describe your symptoms clearly and answer any questions that your doctor may have so they can recommend the best treatment. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Your doctor should be able to diagnose your genital warts by looking at them. They may be flat or raised and singular or in clusters. They may be flesh-colored, pink, or brown. To diagnose genital warts, your doctor may also apply an acetic acid solution to your genitals to make warts visible by whitening them. Your doctor may have you take a pregnancy test if you are a woman because there are some treatments that are not recommended during pregnancy. Your doctor will have to freeze or surgically remove the warts if you are pregnant."
    },
    {
      "title": "Apply podophyllotoxin (Podofilox) solution, gel, or cream twice daily for 3 days.",
      "content": "Apply podophyllotoxin (Podofilox) solution, gel, or cream twice daily for 3 days. Use soap and water to wash your hands and the area that needs to be treated. Pat the skin is dry with a clean towel. Then, apply the medicine with a cotton swab or your finger. Only use the amount recommended by your doctor or pharmacist. Wait for 4 days after treating the area or as instructed by your doctor. You may need to repeat the treatment until the warts clear, which could take 4 to 5 weeks. [2] X Research source Ask your healthcare provider to apply the first treatment so that you can see how it should be done. You can repeat this treatment for up to 4 cycles. Podofilox can cause mild skin irritation in some cases. Do not use this treatment if you are pregnant."
    },
    {
      "title": "Use a 5% Imiquimod cream three times a week at bedtime.",
      "content": "Use a 5% Imiquimod cream three times a week at bedtime. Your doctor will likely prescribe Imiquimod, a cream that stimulates the production of chemicals in the body that strengthen your immune response. Apply the cream to your affected skin with a clean finger or cotton swab in a thin layer. Do this before bed 3 times per week for up to 16 weeks. Ideally, apply the cream at night and wash it off in the morning, 6-10 hours later. [3] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Side effects include redness, blisters, body aches or pain, cough, rashes, and fatigue. Wash off the cream with water and a mild soap. Continue the treatment for up to 16 weeks, or until the lesions are gone. Keep in mind that Imiquimod can weaken condoms and vaginal diaphragms."
    },
    {
      "title": "Apply Sinecatechins 15% ointment 3 times a day.",
      "content": "Apply Sinecatechins 15% ointment 3 times a day. Sinecatechin is a green-tea extract prescribed as a home treatment for genital warts. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Apply this ointment 3 times a day using a clean finger, ensuring that you spread a very thin layer on your skin for up to 16 weeks. This treatment should not be washed off. Side effects include reddening of the skin, itching or burning, and pain that are often mild. Redness, itching, and burning are the most common side effects. Sexual contact should be avoided while this ointment is on your skin."
    },
    {
      "title": "Quit smoking to improve your body's healing power.",
      "content": "Quit smoking to improve your body's healing power. Many prescription treatments for genital warts work more effectively on non-smokers than on smokers. Smoking can worsen your overall health and reduce your body's ability to heal quickly. Ask your doctor about the best smoking cessation plan for you, which may include nicotine replacement therapy or medication. [5] X Research source"
    },
    {
      "title": "Avoid sex while your genital warts are still healing.",
      "content": "Avoid sex while your genital warts are still healing. Oral, genital, and anal sexual contact can irritate affected skin, slowing down your recovery time. Avoid any sexual activity until your genital warts are entirely healed. This will also prevent you from spreading the virus to your partner. [6] X Research source Wear a condom during sex for the first 3 months after your genital warts clear up as the virus may still be active in your skin cells."
    },
    {
      "title": "Use mild, unscented soap and lotion to avoid irritating your skin.",
      "content": "Use mild, unscented soap and lotion to avoid irritating your skin. Perfumed soaps, bath oils, creams, and lotions can irritate already sensitive skin. This will slow down the time it takes for genital warts to heal. To avoid this problem, use only mild soap when bathing, and unscented body lotions or creams. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Keep the skin clean and dry between bath or showers.",
      "content": "Keep the skin clean and dry between bath or showers. Moisture and bacteria can impede the healing of your genital warts. To speed up the recovery process, make sure to keep the affected area clean by washing it regularly with mild soap and water. Dry the area thoroughly by patting it with a clean towel. [8] X Research source If your skin is very sensitive, let it air dry thoroughly before getting dressed. Do not clean the area more than 4 times a day."
    },
    {
      "title": "Ask your doctor about the HPV vaccine.",
      "content": "Ask your doctor about the HPV vaccine. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source HPV is an easily-transmitted STD that can cause genital warts and other problems. To avoid getting HPV, talk to your doctor about getting the HPV vaccine. Your doctor will tell you what brand of the vaccine is best for you. [10] X Research source The HPV vaccine can also lower your risk of cervical cancer."
    },
    {
      "title": "Use condoms or dental dams during sexual contact.",
      "content": "Use condoms or dental dams during sexual contact. To avoid getting an STD like genital warts, wear protection during oral, anal, and vaginal sex. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Purchase condoms and dental dams from pharmacies, convenience stores, or online. You can also get them from community health centers, Planned Parenthood centers, or doctor’s offices. [12] X Research source"
    },
    {
      "title": "Discuss STDs with your partner before engaging in sexual activity.",
      "content": "Discuss STDs with your partner before engaging in sexual activity. Start a non-judgemental conversation about genital warts and other STDs before having sex with a new partner. Knowing if your partner has an STD will allow you to take extra precautions. Make sure that you are on the same page about using protection during sex. [13] X Research source Avoid sex with partners who refuse to use protection or discuss STDs."
    },
    {
      "title": "Get medical attention if you have an adverse reaction to medication.",
      "content": "Get medical attention if you have an adverse reaction to medication. If you’re prescribed a cream or you treat your genital warts with over the counter cream and you have a negative reaction, you could be allergic to an ingredient in the cream. Go to an emergency room or visit an urgent care clinic to make sure the reaction isn’t serious. Mild burning or stinging can be normal for some treatments. A rash that spreads and is painful or itchy could be a sign of an allergic reaction. Symptoms of a serious allergic reaction include: wheezing or difficulty breathing, rapid heart rate, nausea, and vomiting."
    },
    {
      "title": "Contact your doctor if you become pregnant.",
      "content": "Contact your doctor if you become pregnant. If you’re taking medication to treat your genital warts and you become pregnant, you need to talk to your doctor. You may need to stop taking or change medications to prevent harming your baby. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source As soon as you find out you're pregnant, contact your doctor."
    },
    {
      "title": "Talk to your doctor if you develop more warts.",
      "content": "Talk to your doctor if you develop more warts. If your warts don’t get any better and start to multiply, tell your doctor. They may change your medication or try different treatment options. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Genital warts that continue to spread could be a symptom of a deeper problem with your immune system."
    },
    {
      "title": "See your doctor if a wart is painful or bleeding.",
      "content": "See your doctor if a wart is painful or bleeding. If you have a wart that is painful or bleeding, you need to see a doctor to make sure it doesn’t get infected. An infection in your groin could lead to serious health problems. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Look for pus oozing or red streaks in the skin surrounding a wart. These are surefire signs of an infection. Pain or sensitivity in the skin around a wart could be a sign of infection as well."
    },
    {
      "title": "Ask your doctor about prescription treatment for your warts.",
      "content": "Ask your doctor about prescription treatment for your warts. If home remedies aren’t helping you get rid of your genital warts, talk to your doctor. They may be able to prescribe stronger medication that can get rid of your warts. There are different options that they can try. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, a doctor can freeze the warts with liquid nitrogen to remove them. There are creams that can get rid of genital warts that need to be prescribed by a doctor."
    }
  ]
}