{
  "url": "https://www.wikihow.com/Create-a-Household-Budget",
  "title": "How to Create a Household Budget",
  "steps": [
    {
      "title": "Decide how you will document your household spending, earnings, and budget.",
      "content": "Decide how you will document your household spending, earnings, and budget. [2] X Expert Source Samantha Gorelick, CFP® Financial Planner Expert Interview. 6 May 2020. You can use a simple pen and paper but it is much easier to use a spreadsheet program or a simple accounting program if you have access to one. You can find sample budget worksheets from Kiplinger here . Calculations in a simple accounting program, such as Quicken , are virtually automated, as they are made for this type of project. This type of program also has additional features that may come in handy for formulating budget, such as savings tools. Many spreadsheet programs come with a built-in template for calculating a household budget. They will need to be customized for your specific needs but will be easier than starting from scratch. You can also use electronic budgeting software, such as Mint , which will help you keep track of your spending."
    },
    {
      "title": "Format the columns of your spreadsheet.",
      "content": "Format the columns of your spreadsheet. Work from left to right. Use titles for columns such as \"Date of Expense\", \"Amount of Expense\", \"Payment Method\", and \"Fixed/Discretionary\". You need to record in a disciplined way (every day or every week) all of your expenses, as well as your income. Many software programs and apps have mobile apps where you can add your expenses on the go. The Payment Method column will help you to keep track of where records of your expenses can be found. For example, if you pay your electric bills with a credit card every month to earn miles, note that as the payment method in the column."
    },
    {
      "title": "Categorize your expenses.",
      "content": "Categorize your expenses. Each entry should go into a category so you can easily see how much you spend on monthly and yearly bills, regular essentials, and discretionary costs. [3] X Expert Source Samantha Gorelick, CFP® Financial Planner Expert Interview. 6 May 2020. This will help you when you go to input your expenses and when you want to look through them for a specific expenditure. Common categories include: Rent/Mortgage (make sure to include any insurance) Utilities, such as electricity, gas, and water Household Operations, such as lawn or maid service Transportation (car, gas, public transport costs, insurance) Groceries and other food (eating out) Using a software program to do this has the added benefit of being able to easily categorize the type is spending (groceries, gas, utilities, car, insurance etc) as well as calculating totals in different ways that are useful to understand what, when, where, how much and how (credit card, cash, etc) you spend. Software will also allow you to divide your spending into different time periods and priorities. If you are using a paper ledger, you may want to create a separate page for each of these categories, depending on how many expenses you have in each category every month. If you are using software you will be able to add rows easily to fit all of your expenses in."
    },
    {
      "title": "Put your biggest regular expenses into the spreadsheet or ledger.",
      "content": "Put your biggest regular expenses into the spreadsheet or ledger. Some examples would be car payments, rent or mortgage, utilities (such as water, electricity, etc), and insurance (medical, dental, etc). [4] X Expert Source Samantha Gorelick, CFP® Financial Planner Expert Interview. 6 May 2020. Installation payments, such as student loans and credit cards, also go in here. Make a separate row for each expense. Put in estimates as placeholders until the actual bills come. Some bills, such as your rent or mortgage, usually stay the same every month, while others are more variable (like utilities). Put in an estimate of your recurring bills (perhaps what you paid the previous year for that specific expense) but once the bill comes and you pay it, put the actual amount into your ledger. Try to either round up or down to the nearest $10 for an average estimate on how much you spend for each item. Some utility companies will allow you to pay average amounts all year, instead of having your bill fluctuate each month. You may want to investigate this option if regularity is important to you."
    },
    {
      "title": "Calculate your regular essentials.",
      "content": "Calculate your regular essentials. Brainstorm what you regularly spend money on and how much. How much per week do you spend on gas? What is the usual amount that you spend on groceries? Think of other essential things that you need, not want. After you have made rows for each of these expenses, put in an estimate of what you spend on it. Once you have the actual amounts you spend, input them immediately. You should spend as normal, but take a receipt or note down every time you get your wallet or purse out. At the end of the day, tally this up, either on paper, your computer, or your phone. Make sure you note exactly what you spent it on and don't use a generic term such as food or transport. Software such as mint.com help by categorizing your spending into things like Groceries, Utilities, and Miscellaneous Shopping. This can help you see what you usually spend per month on each category."
    },
    {
      "title": "Input your discretionary expenses as well.",
      "content": "Input your discretionary expenses as well. These include big-ticket items that you can cut out or do not provide you with the level of enjoyment worthy of the price. These could range from anything such as expensive nights out to take-away lunches and coffee. Remember that each separate expense should have a separate row. This may make your spreadsheet or ledger pretty long by month's end, but if you have it separated into types of expenses you should be able to keep it manageable."
    },
    {
      "title": "Insert an expense row for savings.",
      "content": "Insert an expense row for savings. While not everyone can afford to save money on a regular basis, everyone should have it as a goal and do it if they possibly can. A great target is 10% of your paycheck. This is enough to make your savings grow fairly quickly while not so much that it will crimp other areas of your life. We all are too familiar with arriving at the end of the month and having nothing left over. That’s why you have to save first. Don’t wait for there to be money left at the end of the month. Adjust the savings amount as necessary, or, better yet, adjust your spending if possible! Money you save can later be used to invest or you can save with some other purpose in mind, like buying a home, college tuition, vacations, or anything else. Some banks have free savings programs you can enroll in, such as Bank of America’s “Keep the Change” program. This program rounds up each transaction you make with your debit card and transfers the difference into your savings account. It will also match a certain percentage of this savings. This type of program can be an easy, painless way to save a little bit each month. [5] X Research source"
    },
    {
      "title": "Add up all your expenditures each month.",
      "content": "Add up all your expenditures each month. Add up each section of rows individually and then add them all together. This way you can see what percentage of your income you spend in each category of expenditure in addition to your total expenses. [6] X Expert Source Samantha Gorelick, CFP® Financial Planner Expert Interview. 6 May 2020."
    },
    {
      "title": "Record all of your earnings and then add them together.",
      "content": "Record all of your earnings and then add them together. Include all earnings, whether it's tips, \"under the table\" jobs (money you take home, without taxes being taken out), money you find on the ground, and your salary (or monthly balance if you're paid every other week). This is the amount on your paycheck, not your total earnings for the time period. Record all income from all sources with the same level of detail as you do for your expenses. Sum these weekly or monthly, as appropriate."
    },
    {
      "title": "Put the totals of your monthly income and your total expenses side-by-side.",
      "content": "Put the totals of your monthly income and your total expenses side-by-side. If the amount of your total expenses is greater than your income, then you need to think about cutting back on your spending or think of ways to cut down your bills. Having the detailed information on hand about how much you spent on what specific items, as well as the priority that each represents for you, will help you to target areas where you can cut back or eliminate spending. If your monthly income is higher than your total expenses, you should be able to put some away in savings. This money can be used towards a second mortgage, college tuition, or anything else big. Or, you can stash some away for something small like a trip to the spa."
    },
    {
      "title": "Target specific areas of your spending to decrease.",
      "content": "Target specific areas of your spending to decrease. Set limits on discretionary spending in particular. Pick a set amount that you cannot go over each month and stick to it. It’s fine to budget for discretionary spending -- you can’t live a life without any fun. [7] X Expert Source Samantha Gorelick, CFP® Financial Planner Expert Interview. 6 May 2020. However, setting a budget and sticking to it will help keep that spending in check. For example, if you routinely go to the movies, set a budget of $40 a month for movie tickets. Once you’ve spent that $40, you can’t go to any more movies until the next month. Even your essentials section should be looked at closely. Regular expenditures should usually only take up so much of your income. For example, food purchases should only take up 5 to 15 percent of your budget. If you are spending more than that, you should consider cutting back on that spending. Obviously, the percentage you spend will vary; for example, for groceries it will vary depending on things like the price of groceries, your family size, and any special nutritional needs. The point is simply to make sure you aren’t spending money you don’t need to. For example, do you spend a lot of money on prepared foods that are more expensive, when you could cook more at home?"
    },
    {
      "title": "Estimate and incorporate contingency expenses into your budget.",
      "content": "Estimate and incorporate contingency expenses into your budget. By incorporating expenses for possible contingencies into your budget, unexpected medical, car, or house maintenance costs will have less impact on your overall budget and financial health. Estimate what you might have to spend on these in a year and divide by 12 for your monthly budget. Your buffer will mean that if you go slightly over your weekly spending limit, it will not affect your hip pocket and will not end up going on the dreaded credit card. If you get to the end of the year and have not needed to use your buffer for these types of expenses, then great! You will have extra money that you can funnel into your savings or retirement investment plans."
    },
    {
      "title": "Calculate how much your short term, medium term, and long term goals are going to cost.",
      "content": "Calculate how much your short term, medium term, and long term goals are going to cost. These are not contingency costs but instead are part of your plan. Do you need to replace any household items this year? Do you need a new pair of boots this year? Do you want to buy a car? Plan for this in advance and you won't need to draw on your long term savings. Another important point to note is that you should aim to only buy these items after you have saved for them. Ask yourself, do you really need it right now? Once you actually send the money that was budgeted as a contingency or planned expenditure, record the actual expense and delete the provisional expense you had created, otherwise they will end up being doubled."
    },
    {
      "title": "Draw up a new budget.",
      "content": "Draw up a new budget. Combine your buffers and goals with your actual expenditures and income. This exercise will not only assist you in making an effective budget and helping you to save, making your life a little less hectic and more relaxed, it will also motivate you to trim your expenses so you can achieve your goals and make the purchases you aspire to without having to go into debt to do it. Try to stick to just spending on the fixed expenses. Cut out the discretionary items wherever possible."
    }
  ]
}