{
  "url": "https://www.wikihow.com/Develop-a-Creative-Mind",
  "title": "How to Develop a Creative Mind",
  "steps": [
    {
      "title": "Set aside time for relaxing and brainstorming.",
      "content": "Set aside time for relaxing and brainstorming. To be creative, your mind should be at ease and free from distractions. Schedule quiet, uninterrupted time to relax and let your mind wander. Once everyday stress and worries have left your mind, you will be apt to imagine and cultivate new ideas. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Schedule this time on a day off from work, or during a part of the day when you have no commitments. Avoid scheduling this time right before an important deadline or appointment, which may distract you."
    },
    {
      "title": "Use your non-dominant hand for a short period of time.",
      "content": "Use your non-dominant hand for a short period of time. For example, you might write for 5 minutes using your non-dominant hand. Make this a daily habit. It will help activate other parts of your brain. It's a good idea to do this before you start your brainstorming session. This will encourage you to think differently."
    },
    {
      "title": "Designate a creative space with natural light.",
      "content": "Designate a creative space with natural light. Artificial lighting can cause a drop in cortisol levels, leading to sleepiness and reduced productivity. Natural light, on the other hand, can make you more alert. Choose a spot for your creative-thinking time that is outdoors, or that has windows that provide ample natural light during the day. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source A balcony, outdoor patio, or quiet garden are excellent options for a creative space. Time your creative sessions in the morning or early afternoon to make the most of daylight hours."
    },
    {
      "title": "Remove all digital distractions to improve your focus.",
      "content": "Remove all digital distractions to improve your focus. One of the most difficult parts of the creative process is finding the discipline to follow through with ideas. Remove hindrances to this goal by eliminating electronic distractions while you brainstorm. Turn off your phone, WiFi connection, television, and radio to immerse yourself in the project at hand. [3] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Have 45-60 minute brainstorming sessions on specific topics.",
      "content": "Have 45-60 minute brainstorming sessions on specific topics. Choose a specific issue, problem, or theme to brainstorm about. Sit down with a piece of paper and pen and write down as many ideas as you can in a 45-60 minute period. To allow unbridled creativity, do not overthink your ideas or second guess them before writing them down. [4] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For instance, you could brainstorm about alternatives to plastic product packaging or ideas for a compelling short story."
    },
    {
      "title": "Make pro and con lists to work through your ideas.",
      "content": "Make pro and con lists to work through your ideas. Part of being creative is evaluating your own work and choosing your best ideas. Interrogate your own ideas by breaking them down into their pros and cons. Being both negative and positive about a concept will allow you to see it through multiple perspectives and develop it accordingly. [5] X Research source For instance, if you are thinking about incorporating velour into a room design, you could weigh practical pros and cons like its soft texture and cleaning requirements."
    },
    {
      "title": "Draw out your ideas to engage your brain in different ways.",
      "content": "Draw out your ideas to engage your brain in different ways. Doodling while you are brainstorming can help you flesh out your ideas by tapping into different cognitive processes. While mulling over ideas, draw simple sketches that pertain to them. Presenting your thoughts visually may allow you to expand and develop them more. [6] X Research source For instance, if you are trying to come up with a concept for a novel, sketch out some of the locations where your story would take place."
    },
    {
      "title": "Create an inspirational collage that relates to a particular theme.",
      "content": "Create an inspirational collage that relates to a particular theme. If you are brainstorming about a particular idea or problem, expand your thinking about it through images. Go through magazines, newspapers, or online image sites to find pictures that are somehow relevant to it. Print or cut out the images and glue them into a collage that you can look at for further inspiration. [7] X Research source For instance, you might find inspiration to write a science fiction story by making a collage of strange natural phenomena and rare animals. Place the collage in your creative space to help your thought process."
    },
    {
      "title": "Practice mindful meditation for a few minutes every day.",
      "content": "Practice mindful meditation for a few minutes every day. Even a few moments of mindful meditation each day can help you relax, improve your awareness, and inspire self-reflection. Sit quietly and focus on clearing your mind and breathing deeply. Do your best to feel present in the moment and forget about past and future worries. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Note that there is no right or wrong way to meditate. You can download meditation apps if you find guided meditation exercises helpful. Reader Poll: We asked 437 wikiHow readers which activity was most effective in improving their overall intelligence and creativity, and only 9% said meditation practices . [Take Poll] So, another tool like reading regularly or playing a musical instrument may be more beneficial for you!"
    },
    {
      "title": "Try positive thinking to strengthen your creative mind.",
      "content": "Try positive thinking to strengthen your creative mind. Positive emotions can strengthen your psyche, increase your attention span, and improve your creative abilities. Build a positive attitude by expressing your emotions in a healthy way, cultivating good relationships, and taking time for self-care. Treat moments of adversity as opportunities for emotional growth and learning. [9] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Engage your sensitive side to heighten your awareness.",
      "content": "Engage your sensitive side to heighten your awareness. Sensitive people are often creative because of their heightened perception of the world around them. They may feel emotions and sensory experiences more deeply and pick up on nuances and unique details easily. Try to access your sensitive side by watching nostalgic films, reading emotional literature, or listening to evocative music. [10] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Go for walks outdoors to encourage creative thought.",
      "content": "Go for walks outdoors to encourage creative thought. Getting outside is an excellent way to stimulate your senses and clear your head. This, combined with the cognitive benefits of exercise, can enable creative thinking. Take walks outside for 15 minutes or more to get the creative juices flowing. [11] X Research source Walking on a treadmill indoors or simply sitting outside do not have the same effect as a walk outdoors."
    },
    {
      "title": "Change your daily routine to expand your thought process.",
      "content": "Change your daily routine to expand your thought process. Routine can be the enemy of creativity because it removes the need for quick thinking and new ideas. New stimuli will keep you on your toes and open your mind up creatively. Try to shake up your everyday life with a few small changes, such as: [12] X Research source Taking new routes to get to work or school. Changing the decor in your home or office regularly. Listening to different music, podcasts, or radio stations."
    },
    {
      "title": "Hang out in different spots to expose yourself to new stimuli.",
      "content": "Hang out in different spots to expose yourself to new stimuli. New environments can inspire us and awaken our sense of creativity by offering new sights, sounds, and experiences. Visit new restaurants, coffee shops or stores in your area to explore. Travel to parks, libraries, and museums in nearby areas to experience new surroundings and get out of your comfort zone. [13] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Try new hobbies to expand your life experiences and gain new talents.",
      "content": "Try new hobbies to expand your life experiences and gain new talents. Learning new things in an enjoyable way is an ideal way to open your mind. Fun hobbies can reawaken your adventurous spirit and improve your overall outlook. [14] X Expert Source Rahti Gorfien, PCC Life Coach Expert Interview. 17 December 2019. Look for hobby-related courses at local community centers or search online for interesting classes in your area. [15] X Research source Fun hobbies could include photography, archery, painting, wood carving, baking, and cooking."
    },
    {
      "title": "Start getting up earlier in the morning to make the most of your time.",
      "content": "Start getting up earlier in the morning to make the most of your time. Waking up earlier in the morning will give you extra time to be creative before you have to deal with other responsibilities. A few extra hours of free time before work may be the ideal window to approach new ideas with a clear mind, free of distractions. Being awake at a different time of day may also inspire new thoughts and insights [16] X Research source Try changing your wake-up time gradually to avoid overwhelming your body’s natural sleep cycle."
    },
    {
      "title": "Surround yourself with other creative people to get inspired.",
      "content": "Surround yourself with other creative people to get inspired. Creativity can be contagious, so it can be valuable to make friends with people who work in a creative field or pursue creative hobbies. Depending on your interests, you may get along well with painters, photographers, writers, sculptors, or filmmakers. Attend events, take lessons, or join groups where you will have the opportunity to meet such people. Seek out artists and painters by attending vernissages, or taking painting or drawing classes. Meet photographers by taking a photography course or visiting photography exhibitions. Get in touch with writers by attending writing seminars or book readings. Look for meet-up groups online that are dedicated to your interests."
    },
    {
      "title": "Read as much as possible to discover new ideas and themes.",
      "content": "Read as much as possible to discover new ideas and themes. Read as many books as you can about a particular niche that interests you. Research the history of a certain topic, or read memoirs or studies about it to understand it better. Knowing subject inside out and reading different perspectives will make it easier to be creative about it. [17] X Research source Gain access to books for free by getting a membership card at your local library. Access peer-reviewed scholarly articles online to get reliable information about different topics."
    },
    {
      "title": "Listen to TED talks or other inspiring lectures.",
      "content": "Listen to TED talks or other inspiring lectures. Motivational speeches can be catalysts for creativity by drumming up your optimism and incentive. Hearing about other people's experiences and creative efforts can be a great push to pursue our own artistic goals. Look online for TED talks pertaining to your creative interests, or attend lectures at a local college or university. [18] X Research source Browse available TED talks at https://www.ted.com/talks . Visit the websites for educational institutions in your area to look at upcoming events."
    },
    {
      "title": "Travel whenever you can to gain new experiences.",
      "content": "Travel whenever you can to gain new experiences. Travelling to new places jump starts our creative processes by exposing us to new cultures and experiences. Since we have been conditioned by our society and local traditions, visiting new destinations can offer unique perspectives. Plan trips whenever your schedule and budget allow you to do so to get inspired. [19] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Even short day trips can improve creativity by exposing us to a new environment for a period of time. Make the most of your trips by visiting cultural landmarks like museums, art galleries, monuments, and famous buildings (e.g. the Smithsonian Museum in Washington, DC or the Metropolitan Museum of Art in New York City.)"
    }
  ]
}