{
  "url": "https://www.wikihow.com/Find-the-Value-of-a-Stamp",
  "title": "Are My Old Stamps Worth Anything? Evaluating Condition, Rarity & More",
  "steps": [
    {
      "title": "Check if the design is perfectly centered on the stamp.",
      "content": "Check if the design is perfectly centered on the stamp. The more centered the illustration or image is inside the white perforated border, the better. The stamp should have an overall balanced, neat look. [1] X Research source"
    },
    {
      "title": "Examine the back of the stamp for clean, unbroken gum.",
      "content": "Examine the back of the stamp for clean, unbroken gum. Stamp gum is the glue that sticks the stamp onto paper. Perfect gum with no skips or heavy creases is the most valuable. A uniform gum color is preferred, but some discoloration from environmental factors is to be expected (especially for very old stamps). Stamp appraisers use “partial original gum” to describe stamps with only some of its gum left due to environmental conditions or previous usage. “Natural gum cracks” refer to cracks that form when the gum dries or wears out naturally. “Crazed gum” is used for large numbers of cracks. “Tropical gum stain” describes any discoloration of the gum from environmental conditions."
    },
    {
      "title": "Check for dull rectangles on the back that show the stamp was hinged.",
      "content": "Check for dull rectangles on the back that show the stamp was hinged. A stamp hinge is a small, transparent piece of folded paper coated in mild adhesive, sometimes glued on the back of a stamp and used to attach it to an album page. A stamp hinge will make the stamp less valuable, even after it’s been removed. [2] X Research source A stamp cannot be considered in mint condition if it is or was hinged at any point. If your stamp has a hinge attached, call a stamp dealer or expert before attempting to pull it off on your own, as you could damage the stamp further."
    },
    {
      "title": "Look for neat, intact, perfectly even perforations around the edges.",
      "content": "Look for neat, intact, perfectly even perforations around the edges. Perforations are the small holes punched along the edges of a stamp that help you peel it away from the sheet. Some stamps will have more perforations or larger circles, but what matters most is that they have full teeth (the intact strips of the border between the perforations) and clean holes. Perforations are classified by the number of holes per 2 cm (0.79 in) of the stamp’s edge. For example, a “perf. 10” has 10 perforated holes per 2 cm."
    },
    {
      "title": "Check for a cancellation mark.",
      "content": "Check for a cancellation mark. If a stamp has been used, it will be marked with a cancellation stamp or pen mark over the design. The heavier or more obvious the cancellation mark, the lower the value of your stamp. Dark marks that block, cover, or penetrate the stamp’s design lower the value more than faint ink strokes near the edge, for example. [3] X Research source Exceptions are “fancy cancels”—cancellation marks from high-quality pens, ink stamps, or cancel machines. These might increase the value. If a “pen cancel” is listed in the Scott U.S. Specialized Catalog under “Cancels” for a specific stamp listing, then the mark does not lower the stamp’s value."
    },
    {
      "title": "Look for bright, original coloring in the stamp’s design.",
      "content": "Look for bright, original coloring in the stamp’s design. The most valuable stamp illustrations are vibrant—faded or eroded colors make it less valuable. Fading color can be caused by things like sunlight or artificial light, dirt, pollution, or skin oils. [4] X Research source Always wear gloves or use stamp tweezers when handling potentially valuable stamps to preserve the quality of the design."
    },
    {
      "title": "Make an estimate of the stamp’s grade based on its imperfections.",
      "content": "Make an estimate of the stamp’s grade based on its imperfections. Stamp grades range from 10 (poor) to 100 (superb). Grades are based on centering (is the design perfectly centered with even margins and clean perforations?) and overall quality (is the stamp used or unused? Was it previously hinged? Is the original gum intact?). There are a few possibilities for grade: poor, average, fine, very fine, and superb (mint condition). Deduct 25 points right away if the stamp has minor faults like small creases or tiny discolored spots. Deduct 50 points right away if the stamp has major faults like big creases, dark cancellation marks, or new gum. Essentially, the worse the centering of the design and the heavier the cancellation mark on the stamp, the closer to a “poor” grade it will receive. Superb grades are quite rare, since the stamp must be perfect in all aspects."
    },
    {
      "title": "Leave the stamp on its envelope if it’s still attached.",
      "content": "Leave the stamp on its envelope if it’s still attached. It’s best not to risk damaging the stamp by pulling it off or cutting it away. Sometimes an old, used stamp on an envelope with a special cancellation will have a higher value than the stamp would have unused and unattached. Ask an expert at a stamp show or get a professional appraisal to see if the stamp should be removed. [5] X Research source"
    },
    {
      "title": "Estimate the stamp’s age based on its artwork.",
      "content": "Estimate the stamp’s age based on its artwork. You may be able to determine the general age or decade of production based on clues in the design, like historical events or figures. Examine or translate any words on the stamp for age clues, too. Exact years are not typically printed on stamps, so it can be tricky to figure out exactly how old your stamp is. [6] X Research source Check a stamp reference book or website and try to find an image that matches your stamp. If the year of production is known, it will be listed with the image. Head to an expert stamp dealer if you need extra help. The older the stamp is, the more valuable it will be, so it’s worth the extra effort! Stamps printed within the last 70 years, even those in mint condition, probably won’t be valued any higher than they were originally."
    },
    {
      "title": "Determine the stamp’s country of origin.",
      "content": "Determine the stamp’s country of origin. As with the stamp’s age, look for historical figures or events on the stamp that tie it to a particular country. Translate all words, too—knowing the language can help you narrow down the country. [7] X Research source A picture of Queen Victoria, for example, is likely from early 20th century Great Britain, while a picture of the Hoover Dam may be mid-century American. Look up “historical currencies of the world” online to help source the stamp since most stamps have a denomination printed on them. Some stamps have their country of origin printed on them, but not all. Stamps from the UK famously only have an image of the reigning monarch, for example."
    },
    {
      "title": "Confirm the stamp's age and origin",
      "content": "Confirm the stamp's age and origin with a reference book. After you’ve looked over the stamp’s physical condition, you’ll know enough about it to be able to find it in a reference book. Look for an image in a reputable book that matches the stamp you have. Most books will provide historical information as well as estimated values based on specific flaws or signs of wear and tear. [8] X Research source American stamp collectors often use the Scott Specialized Catalogue (also available as an e-book), while British philatelists use the Stanley Gibbons catalogue. Check out your local library to see what options you have. You can try looking at online resources and catalogues as well, but do so with a grain of salt. They may not be as accredited or accurate as reference books."
    },
    {
      "title": "Estimate rarity based on the quantity of the stamp's initial print run.",
      "content": "Estimate rarity based on the quantity of the stamp's initial print run. The older and rarer the stamp, the higher the value. Some stamp collectors even say that rarity is the single most important factor in determining stamp value (more than condition or age). Check in reference books or with a professional dealer to figure out the initial print run of your stamp. [9] X Research source An old stamp won’t necessarily be rare and valuable. The 1861 1-cent Benjamin Franklin stamps, for example, aren’t very valuable because 150 million of them were produced."
    },
    {
      "title": "Keep an eye out for valuable errors in the stamp’s design.",
      "content": "Keep an eye out for valuable errors in the stamp’s design. Though valuable stamps are normally as perfect as possible, error stamps are an exception. These rare stamps have an error in the actual design rather than the centering, perforations, gum, or other aspects. Error stamps are extremely valuable because of their scarcity—there may only be 50 or 100 of them in existence. [10] X Research source Valuable stamp errors include design errors, such as a map showing the wrong border; an omission error, such as Thatcher Ferry bridge stamps in which the bridge itself was missing in the design; or an inversion, like the American Inverted Jenny stamps, which printed a biplane upside down."
    },
    {
      "title": "Consult a stamp reference book or online resource to determine value.",
      "content": "Consult a stamp reference book or online resource to determine value. Now that you’ve identified the stamp and any flaws in its condition, head back to your stamp reference book to begin to understand its value. Look for special “price guides” to postage stamps—the newer the guide, the more accurate the estimated value. [11] X Research source Stamp price guides may not be 100% accurate, but you’ll start to get a rough idea of how much your stamp could be worth."
    },
    {
      "title": "Head to stamp shows to have your stamps appraised.",
      "content": "Head to stamp shows to have your stamps appraised. Stamp conventions take place all over the world and provide a place for philatelists to buy, sell, and value their stamps. Check reputable stamp dealers’ websites for show listings, or look at the American Philatelic Society (APS) or the American Stamp Dealers Association (ASDA) websites to find shows near you. Bring along your stamp and ask for a few different opinions. [12] X Research source Try having an auction house expert look at your stamps, too. Auction houses usually expect you to let them auction your stamps afterward, though. Many dealers and appraisers at stamp shows offer appraisals for free, although this is not guaranteed for every dealer at every show."
    },
    {
      "title": "Make an appraisal appointment with a stamp expert.",
      "content": "Make an appraisal appointment with a stamp expert. In the US, look for a dealer who’s a member of the APS or the ASDA. Search online to find a dealer in your area and call them to ask what the cost will be for an appraisal. It shouldn’t take long, and this will give you the most accurate estimate of your stamp’s value. To find a dealer in other countries, search online. Organizations like the APS, despite being an American group, often list dealers and shows in other countries as well, like Canada and Great Britain."
    }
  ]
}