{
  "url": "https://www.wikihow.com/Delete-Books-From-Kindle",
  "title": "How to Remove Books from Your Kindle Library to Save Space",
  "steps": [
    {
      "title": "Go to your Kindle’s library and filter by \"Downloaded.\"",
      "content": "Go to your Kindle’s library and filter by \"Downloaded.\" Turn on and open your Kindle to the home page (this is where Amazon advertises popular titles). Then, select the \"Library\" tab at the bottom left-hand side of the screen to display all the books you currently own. [1] X Research source Next, tap the \"Filters\" icon at the top right corner of the screen and tap \"Downloaded.\" This filter will show you which books are taking up space on your Kindle."
    },
    {
      "title": "Find the book you want to delete and tap the 3 dots on the cover.",
      "content": "Find the book you want to delete and tap the 3 dots on the cover. Locate the book you want to remove from your device. Once you’ve found it, long-press the book cover or tap the 3 vertical dots on the bottom right-hand side. [2] X Research source If you have an extensive library, use the search bar at the top of the screen to find a specific book."
    },
    {
      "title": "Tap \"Remove download.\"",
      "content": "Tap \"Remove download.\" A new menu will appear after you long-press or select the 3 dots. From the options, tap \"Remove download\" if you still want to free up space on your Kindle device. [3] X Research source You can also tap If you ever want to reread the book you removed, simply find the title in your library and tap it to download it again . You can also re-download it on the website."
    },
    {
      "title": "Open the Kindle app on your device.",
      "content": "Open the Kindle app on your device. Use whichever device you read books on, like a phone or tablet. Tap on the app and wait for the homepage to load. If the app opens on a page you were previously reading, tap the \"Home\" button in the bottom left-hand corner."
    },
    {
      "title": "Go to your \"Library\" and view your downloaded books.",
      "content": "Go to your \"Library\" and view your downloaded books. Select the \"Library\" tab with an open book symbol at the bottom of the screen. Next, tap the \"Downloaded\" category at the top of the page under the search bar. If a book cover has a small black check mark in the bottom right-hand corner, it’s downloaded in the app."
    },
    {
      "title": "Press and hold the book you want to remove.",
      "content": "Press and hold the book you want to remove. Place your finger over the book cover(s) you want to delete from your Kindle app. Release your finger when you see a checkmark appear over the cover. [4] X Research source"
    },
    {
      "title": "Tap the 3 vertical dots in the upper right corner, then tap \"Remove download.\"",
      "content": "Tap the 3 vertical dots in the upper right corner, then tap \"Remove download.\" When you tap the 3 dots, options like \"Mark as Read/Unread\" and \"View in store\" will appear. From this menu, select the option to \"Remove Download.\" [5] X Research source The book is now removed from the downloaded library on your Kindle app and can be redownloaded at any time under your library's \"All\" category."
    },
    {
      "title": "Remove multiple books from a Kindle device with \"Manual removal.\"",
      "content": "Remove multiple books from a Kindle device with \"Manual removal.\" Open the \"Menu\" on your Kindle device (or select “More” from the tabs on the bottom of the screen) and tap \"Settings.\" From there, tap \"Device options,\" then \"Storage management,\" then \"Manual removal.\" Choose a content type (\"Books,\" \"Audible,\" “Periodicals,” “Docs,” “Samples,” or “Others”), then scroll through the titles list and check the box next to each book you want to remove. When you're finished, tap Remove at the bottom of the screen. This option removes the books from your Kindle storage, but not your cloud account. You can always download them again from your library."
    },
    {
      "title": "Select multiple books to remove in the Kindle app.",
      "content": "Select multiple books to remove in the Kindle app. Open the library on your Kindle app and long-press on a title you want to remove. When you see a checkmark appear on top of the cover, tap on other book covers you want to delete to add them to your selection. Then, tap the 3 vertical dots in the upper right corner of the screen and select \"Remove Download.\""
    },
    {
      "title": "Select a book and tap \"Permanently delete\" on your Kindle or Kindle app.",
      "content": "Select a book and tap \"Permanently delete\" on your Kindle or Kindle app. On your Kindle device, tap the 3 vertical dots on the book cover and select \"Permanently delete\" from the list of options. In the Kindle app, long-press on the book you want to delete, tap the 3 vertical dots at the top of the screen to the right, then tap \"Permanently delete.\" [6] X Research source Deleting Kindle items permanently means they will be permanently removed from your Amazon account! You won’t be able to re-access the book online or on your Kindle device. If you want to read it again, you'll need to pay the full purchase price. To permanently delete an Audible audiobook from your Kindle and your Amazon account, follow these extra steps: [7] X Research source Sign in to your account on Amazon.com and click \"Manage content and devices.\" Click \"View: Books\" on the left side of the screen and sort by \"Audiobooks.\" Find the audiobook you want to delete and click \"More options.\" Click \"Delete,\" then \"Yes, delete permanently.\" Sync your Kindle device by swiping down from the top of the Kindle screen, bringing up the \"Quick Settings\" toolbar, and tapping the circular \"Sync\" icon. After that, the Audible audiobook should no longer appear in your library."
    },
    {
      "title": "On your Kindle device, tap the 3 vertical dots and select \"Return to library.\"",
      "content": "On your Kindle device, tap the 3 vertical dots and select \"Return to library.\" Once you select this option, tap \"Return\" to confirm your action. The book will disappear from your Kindle device. [8] X Research source You can always borrow it again from the library (if it's available) or buy it from the Amazon Kindle store if you want to re-read it in the future."
    },
    {
      "title": "On the Kindle app, long-press on a title and select \"Remove from library.\"",
      "content": "On the Kindle app, long-press on a title and select \"Remove from library.\" Tap and hold the cover of the library book you want to return until a checkmark appears on top of it. Next, tap the 3 vertical dots in the upper right corner of the app, then tap \"Remove from library.\" This action will remove the book from your Kindle app, so you won't see it anymore. [9] X Research source"
    },
    {
      "title": "Search for the title in your Kindle device or app and tap the cover.",
      "content": "Search for the title in your Kindle device or app and tap the cover. Open your Kindle library and scroll or search for the title you want to re-download. When you find it, simply tap the cover. It should immediately begin downloading from the cloud to your device. [10] X Research source"
    }
  ]
}