{
  "url": "https://www.wikihow.com/Fix-Christmas-Lights",
  "title": "How to Repair Christmas Lights",
  "steps": [
    {
      "title": "Plug in the lights and note how many aren't working.",
      "content": "Plug in the lights and note how many aren't working. If only a few or half of the bulbs are dark, the issue could be a loose bulb connection, a malfunctioning shunt, or dead bulbs. If the entire string is out, the fuse is probably broken and needs to be replaced."
    },
    {
      "title": "Test for loose string light bulb connections by tightening them.",
      "content": "Test for loose string light bulb connections by tightening them. Unplug the Christmas lights and then turn each dark bulb clockwise and press gently down on it to ensure it's secure in its socket. If you hear a clicking sound, that means the bulb was loose and that you just pushed it back in place. After tightening all the bulbs, plug the string back and in and see if that repaired the issue."
    },
    {
      "title": "Test for dead incandescent light bulbs with a Christmas light repair tool.",
      "content": "Test for dead incandescent light bulbs with a Christmas light repair tool. You can use the Christmas light repair tool to evaluate the individual bulbs in a dark section of string and identify the point where the current is failing. [1] X Research source Follow these steps to use it safely: Place the repair tool between the wires coming out of a light bulb socket that's gone dark and press the trigger. If the tool hums or lights up, the current to that socket is live. Keep testing sockets until you come to one that doesn't cause the tool to hum or light up. That's the dead bulb you're looking for. Replace the dead bulb and see if that fixes the problem."
    },
    {
      "title": "Test for dead LED bulbs using a non-contact voltage detector.",
      "content": "Test for dead LED bulbs using a non-contact voltage detector. Plug the string of lights into the wall and hold the pen up to each dark bulb in the string. The non-contact voltage detector will beep if it detects a live current. If it doesn't beep, you've found a dead bulb and need to replace it. [2] X Research source"
    },
    {
      "title": "Clear the shunt to find out which bulbs are dead.",
      "content": "Clear the shunt to find out which bulbs are dead. Christmas lights are connected in a series, meaning a section of it will go dark when one bulb fails. A failsafe called a shunt in each bulb is supposed to prevent this by closing the gap across the burnt-out bulb, but it often doesn't work properly. To identify the dead bulbs quickly, try clearing the shunt with a Christmas light repair tool. [3] X Research source Plug a Christmas repair tool into the wall along with your string lights, then remove one of the dead light bulbs from its socket. Plug the dead light bulb's socket into the repair tool and click the trigger at least 20 times. This will clean the shunt if it's corroded or dirty, which will allow the current to move past the dead bulb and light up the other bulbs in the string. The ones that don't light up are likely dead bulbs."
    },
    {
      "title": "Open the fuse box case and check if the fuses are black.",
      "content": "Open the fuse box case and check if the fuses are black. A string of Christmas lights typically has 1-2 tiny fuses in the plastic box attached to the prongs. Unplug the lights and slide the fuse slot covers out with a small, flat screwdriver. Tip the fuses out into the palm of your hand. If one of them is black or the wire inside it is broken, replace both fuses. [4] X Research source"
    },
    {
      "title": "Purchase replacement bulbs that match your light strings.",
      "content": "Purchase replacement bulbs that match your light strings. Take the burnt-out bulbs to a hardware store, pharmacy, or home improvement store. Look for new bulbs that match the old ones as close as possible. Ideally, check the packaging your lights came in to see what type of bulb you need."
    },
    {
      "title": "Remove each of the blown-out Christmas light bulbs.",
      "content": "Remove each of the blown-out Christmas light bulbs. With one hand, delicately pinch the broken light's plastic socket with your thumb and forefinger. Then, with the other hand, gently pull upward on the bulb to free it from the socket. [5] X Research source If you have a Christmas light repair tool, it may come with a small flat edge that you can use to get underneath the light bulb and pry it out of the socket."
    },
    {
      "title": "Insert the replacement bulb into the old bulb's socket.",
      "content": "Insert the replacement bulb into the old bulb's socket. Make sure the two copper wires on the bottom of the bulb fitting are completely aligned with the holes in the socket. Gently press the bulb into the socket until you hear a soft click. Then plug in your lights and watch them glow. [6] X Research source"
    },
    {
      "title": "Unplug the lights, open the fuse box, and pry out the blown fuses.",
      "content": "Unplug the lights, open the fuse box, and pry out the blown fuses. Electrician Frank Boss suggests gently levering the blown fuses out with a thin screwdriver or another flat implement like a pen knife."
    },
    {
      "title": "Find exact replacement fuses that match the old ones.",
      "content": "Find exact replacement fuses that match the old ones. Most Christmas lights are sold with spare fuses for this purpose. If your spares have escaped from the holiday box, take the blown fuses to an electronics store and ask them to match you with new ones of the same size and voltage rating. 100-light strings typically use 3A fuses, but be cautious and confirm your fuses' rating with a store employee. [7] X Research source Never use a fuse with a higher voltage rating. This can cause a major fire risk in your home."
    },
    {
      "title": "Drop the new fuses into the slots in the fuse box.",
      "content": "Drop the new fuses into the slots in the fuse box. Ensure they're fully inserted, then slide the slot covers back into place and plug the lights into an outlet. If most or all of the lights turn back on, the fuse box is fully repaired. [8] X Research source If the lights still won't come on, try a different outlet in case you blew a house fuse or circuit."
    },
    {
      "title": "The string light wires are torn or damaged",
      "content": "The string light wires are torn or damaged If the string light wires show obvious signs of wear and tear or water damage, the best solution is to throw the lights out and buy a new string. Replacing wires is a challenging task, especially for non-electricians."
    },
    {
      "title": "The light bulb sockets are broken",
      "content": "The light bulb sockets are broken If more than one light bulb socket is broken or smashed, buy new string lights. Replacing or removing the sockets would involve cutting the wires and twisting a cap on top, and at that point, it would simply be easier to get new lights altogether."
    },
    {
      "title": "You can't find the broken current connection in the string",
      "content": "You can't find the broken current connection in the string If you have trouble using a voltage detector or a Christmas light repair tool to find where the current disconnects in the strings, it may be better to get new lights. Boss says replacing it is usually \"the safer course of action.\""
    },
    {
      "title": "Wrap the lights around a piece of cardboard so there's no overlap.",
      "content": "Wrap the lights around a piece of cardboard so there's no overlap. This keeps the wires and bulbs from tangling up and lets you store the lights without taking up a lot of space. You can also purchase a cord wind-up or a reel, which will hold the string more securely than a piece of cardboard. [9] X Research source"
    },
    {
      "title": "Feed the string lights through a paper towel roll and wind it up.",
      "content": "Feed the string lights through a paper towel roll and wind it up. Insert one end of the string through the roll, then secure it with some tape. Then start wrapping the rest of the string around the roll, starting at one end and making your way to the other. When you reach the edge of the roll, tape the other end of the lights in place, as well."
    },
    {
      "title": "Coil the lights and secure them with a tie.",
      "content": "Coil the lights and secure them with a tie. Pick up one end of your lights and wrap it around your elbow and then up over your hand. Repeat this movement until the entire string is coiled around your hand and elbow. Remove it and wrap a wire or fabric tie around the middle of the coil to hold it together. Then store the string lights in a bag with other lights or by themselves. [10] X Research source"
    }
  ]
}