{
  "url": "https://www.wikihow.com/Find-and-Evolve-Riolu",
  "title": "How to Evolve Riolu",
  "steps": [
    {
      "title": "Raise Riolu's Happiness.",
      "content": "Raise Riolu's Happiness . This is also referred to as the Friendship level. There are a variety of actions you can take to raise happiness. Riolu must have a Friendship/Happiness rating of at least 220 to evolve. Capture Riolu in a Luxury Ball. This only works if you are obtaining a wild Riolu. Using a luxury ball will add an extra point to the results of any happiness increase. Have Riolu hold a Soothe Bell. This will increase the amount of friendship gained. Walk 256 steps. Every 256 steps will raise your friendship by 1. Riolu must be in the party. Get a massage at Ribbon Syndicate. This will give you a large boost in your happiness. Use vitamins and EV berries. These include Pomeg, Kelpsy, Qualot, Hondew, Grepa, and Tamato berries. Avoid fainting and using Heal Powder. These will slightly lower your friendship."
    },
    {
      "title": "Only use Riolu during the day.",
      "content": "Only use Riolu during the day. Perform all friendship-raising activities during the day time. Make sure to only fight with Riolu during the day. [1] X Research source Riolu can only evolve in sunlight."
    },
    {
      "title": "Level up Riolu.",
      "content": "Level up Riolu. Once you have Riolu's friendship at 220 or higher, it should evolve the next time that it levels up. You can use the Friendship Checker gadget in Diamond, Pearl, and Platinum to see the friendship rating. It should display 2 large hearts. Riolu will evolve into Lucario. [2] X Research source"
    },
    {
      "title": "Capture Riolu on Route 22.",
      "content": "Capture Riolu on Route 22. Walk through the Grass and Flowers in Route 22 for a chance to find Riolu. Riolu will be Level 6–7. Riolu is very rare, so finding one may take a while. [3] X Research source"
    },
    {
      "title": "Find Riolu in the Friend Safari.",
      "content": "Find Riolu in the Friend Safari. If you've defeated the Elite Four, you can gain access to the Friend Safari in Kiloude City. [4] X Research source You will need to enter a Friend Code that gives you access to the Fighting-type Friend Safari. The friend who's code you enter needs to have beaten the game for Riolu to be available. There is a 25% chance that a Fighting-type Safari will include Riolu in Slot 3. Korrina gives you one of her Lucarios when you obtain the Key Ring."
    },
    {
      "title": "Travel to Floccesy Ranch.",
      "content": "Travel to Floccesy Ranch. The Ranch can be accessed towards the beginning of the game. It is located to the north of Route 20. [5] X Research source"
    },
    {
      "title": "Find Riolu.",
      "content": "Find Riolu. Riolu can be found while walking through the tall grass. Riolu has a 5% chance of appearing. Riolu can be between Level 5 and Level 7."
    },
    {
      "title": "Defeat the Elite Four and Team Plasma.",
      "content": "Defeat the Elite Four and Team Plasma. The only way to get Riolu in Pokémon Black & White is to beat the story first and become the Champion."
    },
    {
      "title": "Travel to Challenger's Cave.",
      "content": "Travel to Challenger's Cave. The cave entrance is located on Route 9. You will not be able to enter the cave until after defeating the Elite Four as well as Team Plasma. Once you have fulfilled the requirements, the person blocking the entrance will allow you to pass. The cave is dark, so you will need Flash to navigate, as well as Surf to traverse the stream."
    },
    {
      "title": "Find Riolu.",
      "content": "Find Riolu. Riolu can appear in the 1st and 2nd basements in the cave. He has a 5% chance of appearing, and will be Level 49 or 50."
    },
    {
      "title": "Travel to the Johto Safari Zone.",
      "content": "Travel to the Johto Safari Zone. In order to access the Safari Zone, you must complete the story events at Glitter Lighthouse. After you do, Baoba will call your character and announce that the Safari Zone is open."
    },
    {
      "title": "Find Geodude to complete the first Safari Zone challenge.",
      "content": "Find Geodude to complete the first Safari Zone challenge. Baoba wants you to catch a Geodude to show you how the Safari Zone works. The Geodude can be found in the Peak area of the Safari Zone, which is always the default first area."
    },
    {
      "title": "Find Sandshrew to complete the second Safari Zone challenge.",
      "content": "Find Sandshrew to complete the second Safari Zone challenge. Three hours after you complete the first challenge, Baoba will contact you again asking you to catch a Sandshrew. In order to do this, you will need to add a Desert area to the Safari Zone. Use the Area Customizer to do this."
    },
    {
      "title": "Beat the Elite Four.",
      "content": "Beat the Elite Four. In order to find Riolu, you will need the National Pokédex. This is obtained after defeating the Johto League, before you board the ship to the Kanto region."
    },
    {
      "title": "Place blocks in the Safari Zone.",
      "content": "Place blocks in the Safari Zone. After you have completed the above steps, Baoba will contact you and you will be given the ability to add blocks to each area of the Safari Zone. Riolu is located in the Meadow area, so focus on placing blocks there. Riolu will be drawn out by Peak (Small Rock, Big Rock, Mossy Rock) and Forest (Tree, Stump, Branches) blocks."
    },
    {
      "title": "Upgrade your blocks.",
      "content": "Upgrade your blocks. You will need 42 Peak blocks and 28 Forest blocks in the Meadow area. You can only place 30 blocks into one area, so you will need to upgrade your blocks. Every 10 days in the Safari Zone, one type of block gets upgraded. After 10 days, Plains blocks double in value. After 20 days, Forest blocks double in value. After 30 days, Peak blocks double in value. After 40 days, Waterside blocks double in value. After 50 days, Plains triples. The cycle continues until every block has quadrupled in value."
    },
    {
      "title": "Find and capture Riolu.",
      "content": "Find and capture Riolu. Once you have enough blocks placed and upgraded, walk through the tall grass in the Meadow area to try to encounter Riolu. The chance of seeing and catching Riolu will still be very low. Safari Zone wild Riolu are Level 45–46."
    },
    {
      "title": "Travel to the Iron Island.",
      "content": "Travel to the Iron Island. In order to reach the Iron Island, you will need access to Canalave City. After entering the city, walk North and cross the bridge to your left. You may have to fight your rival as you cross the bridge if you haven't already. After crossing, walk back down until you see the boats in the harbor. [6] X Research source Talk to the sailor in the harbor and you will be taken by boat to Iron Island."
    },
    {
      "title": "Enter the cave on Iron Island.",
      "content": "Enter the cave on Iron Island. You will be presented with two staircases. Take the staircase on the right to access an elevator to take you to a lower basement. You will again see two staircases. This time take the left staircase and you will meet Riley."
    },
    {
      "title": "Fight through the rest of the cave.",
      "content": "Fight through the rest of the cave. Once Riley has joined you, you need to continue through the rest of the cave, until you reach the Galactic Grunts. Defeat the Galactic Grunts and Riley will leave you. As a parting gift, he will present you with a Riolu Egg. If you don't have room in your party for the Egg, he will wait there until you come back with an open space."
    },
    {
      "title": "Hatch the Egg.",
      "content": "Hatch the Egg . Keep the Egg in your party to hatch it. Eggs are hatched by taking steps in the game. Each Egg has a set number of cycles, and a cycle is complete after 256 steps. When the Egg has less than 5 cycles remaining, the Status screen will display the message: “It's making sounds inside! It's gonna hatch soon!” [7] X Research source Once the Egg is hatched, a Level 1 Riolu will be born."
    }
  ]
}