{
  "url": "https://www.wikihow.com/Dispose-of-Ammonia",
  "title": "How to Dispose of Ammonia",
  "steps": [
    {
      "title": "Turn on a water faucet.",
      "content": "Turn on a water faucet. You need to mix the ammonia with plenty of water, as it's concentrated. Water dilutes the ammonia, making it safer. The best way to do this is to use running water. [1] X Research source You can also flush ammonia down your toilet. Simply pour it into the toilet water before flushing. Make sure you don't pour in more ammonia than there is water, however. If you have a lot of ammonia, use the sink or neutralize it."
    },
    {
      "title": "Pour the ammonia into the stream of water.",
      "content": "Pour the ammonia into the stream of water. Slowly pour out the ammonia so that there is more water than ammonia going down the sink. This ensures that it’s thoroughly diluted as it goes down the sink. [2] X Research source Don’t inhale the ammonia as you pour it. It’s best to open a window or turn on a vent while you pour the ammonia down the sink."
    },
    {
      "title": "Rinse your sink after disposing the ammonia.",
      "content": "Rinse your sink after disposing the ammonia. Splash water over the surface of the sink to remove any ammonia residue that may remain. Wipe the sides and bottom of the sink with a clean towel or cloth to make sure the ammonia is gone. This ensures you won’t accidentally pour another chemical over it. Make sure your sink runs at least 1 additional minute. If you have a spray nozzle, use it to rinse out the sink."
    },
    {
      "title": "Use caution if you have a septic system.",
      "content": "Use caution if you have a septic system. It’s not a good idea to dispose of ammonia down the sink if you have a septic system. [3] X Research source Septic systems discharge wastewater back into the ground, so the ammonia can end up in the ground water. This is especially problematic if you use a well for your water. Instead of pouring the ammonia down the sink, neutralize it and throw it away."
    },
    {
      "title": "Mix together equal parts baking soda, cat litter, and dry sand.",
      "content": "Mix together equal parts baking soda, cat litter, and dry sand. These 3 ingredients will create an effective dry mixture that will soak up the ammonia. You can use the mixture to clean up ammonia you’ve spilled or you can mix it with excess ammonia you want to discard. [4] X Research source The dry mixture is great for when you need to dispose a lot of ammonia at once."
    },
    {
      "title": "Sprinkle the dry mix over the ammonia.",
      "content": "Sprinkle the dry mix over the ammonia. Continue to add dry mixture to the ammonia until you’ve applied enough dry mix to soak up all of the ammonia. You should not have any liquid remaining. [5] X Research source"
    },
    {
      "title": "Collect the mixture into a disposable container.",
      "content": "Collect the mixture into a disposable container. Use a plastic or wooden spoon to scoop the mixture into the container. If you fill up the container and still have more mixture to collect, it’s okay to dump it out in a trash bag. Then, collect the rest of the mixture. [6] X Research source Wear a mask while you clean up the mixture to avoid inhaling any fumes. It’s a good idea to ventilate the area, if it’s indoors. If you have a fume hood, you should turn it on."
    },
    {
      "title": "Dispose of the mixture in the trash.",
      "content": "Dispose of the mixture in the trash. Since the ammonia is neutralized, it’s safe to put it in the trash can. You can throw out the entire container or simply dump out the mixture. [7] X Research source Don’t let the neutralized ammonia sit around your house, however. You need to dispose of it immediately."
    },
    {
      "title": "Empty the container of excess ammonia.",
      "content": "Empty the container of excess ammonia. Don’t throw away a container that still has ammonia in it, even if it’s very little. Since ammonia is concentrated, it can be hazardous even in small amounts. For example, the fumes from the ammonia can be harmful. Also, it could mix with other substances in the trash."
    },
    {
      "title": "Rinse out the container.",
      "content": "Rinse out the container. Use clean water to wash away any ammonia that remains in the bottle. The water will also dilute any droplets that linger in the container. [8] X Research source It’s safe to pour your rinse water down the sink."
    },
    {
      "title": "Check the bottle to see if it’s recyclable.",
      "content": "Check the bottle to see if it’s recyclable. Most plastic cleaner bottles are recyclable. Simply check the bottom of the container to see if it has a symbol indicating you can recycle it. If it is recyclable, you can put it in with your other recyclables. Alternatively, you can take it to your local recycling center."
    },
    {
      "title": "Throw it in the trash if you can’t recycle it.",
      "content": "Throw it in the trash if you can’t recycle it. Put it in with the rest of your trash. It’s best to throw it out in your outdoor trash can, if you can. That way you won’t have to worry about accidental fume emissions."
    }
  ]
}