{
  "url": "https://www.wikihow.com/Fake-a-Cough-in-School",
  "title": "How to Fake a Cough in School",
  "steps": [
    {
      "title": "Inhale a big, deep gust of air.",
      "content": "Inhale a big, deep gust of air. Breathe in through your nose for as long as you can. This is key to getting enough “power” behind your cough. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you don’t take in enough air, you will produce dainty, weak coughs that will not get anyone’s attention. Take care to breathe in discreetly, so that it doesn’t look like you’re preparing for the big coughing show."
    },
    {
      "title": "Expel the air aggressively.",
      "content": "Expel the air aggressively. Begin coughing, but try to add some grit to it. Cough from deep within your diaphragm, as if you were giving a speech and attempting to project to the back row of a big room. This will help produce big, hearty coughs that will hopefully get some concern. As you cough, try to hack up some phlegm to add texture to your cough. If it sounds like your cough is coming up a perfectly smooth airway, it won’t indicate sickness like a really scratchy, phlegmy cough."
    },
    {
      "title": "Hunch your back.",
      "content": "Hunch your back. Remember the last time you had a real cough, and try to mimic the physical effect it had on your body. A real, violent cough will rattle your body, making you bend over a bit. As you cough, hunch over and place one hand on your stomach or your chest. Act as if this cough is coming from deep within and taking a toll on your whole body."
    },
    {
      "title": "Cover your mouth.",
      "content": "Cover your mouth. First, covering your mouth is the polite and appropriate thing to do. Even when your cough is fake, it will still be unpleasant to those around you if you’re showering them with bits of saliva as you hack up a lung. [2] X Research source Second, covering your mouth will allow you to distort the sound of your cough a bit more, so that you can achieve the really muddled, scratchy cough that will convince teachers of your sickness. When you truly have a bad cough, you probably cover your mouth, try to quiet yourself down, and get it under control. Do the same thing when you’re faking a cough. Act as if you desperately want to calm it down to avoid distracting everyone so that the teacher knows you aren’t doing it for attention."
    },
    {
      "title": "Limit your speaking.",
      "content": "Limit your speaking. If one moment you are pretending to violently cough and the next you’re turning around to chat with a friend, you probably won’t convince anyone. When you are faking a cough for the day, keep to yourself and try to avoid talking to others. If anyone asks why you’re so quiet, explain that your throat is tender and talking gives you pain. If you’re typically a very talkative student, this step can be incredibly convincing."
    },
    {
      "title": "Massage your throat.",
      "content": "Massage your throat. Often when you have a sore throat or a bad cough, you probably touch your throat with your hand, even if it’s unconsciously. While you sit in class, working on homework or listening to your teacher, gently rub the outside of your throat and neck area. This will show the teacher that you are experiencing discomfort in that area even when you aren’t smack dab in the middle of a coughing fit."
    },
    {
      "title": "Sip on water.",
      "content": "Sip on water. Many teachers will recommend that you do this if you’re coughing a lot, so show them that you’re already trying this technique. For an added effect, wince a very tiny bit as you take a sip of water, as if your throat is extremely sore. When you begin coughing, continue to drink the water as if you’re desperately trying to quiet your cough."
    },
    {
      "title": "Strain your voice the day before.",
      "content": "Strain your voice the day before. This is for those students who are extremely serious about faking a cough! Sing at the top of your lungs or yell as loud as you can the day before. If you overexert your vocal cords, they will naturally be tender and raspy the following day. Besides, singing and yelling can be a lot of fun (and stress-relieving) anyways! [3] X Research source Find a time to do this when you’re home alone or out with friends, otherwise your raspy voice can be easily explained away by adults."
    },
    {
      "title": "Speak softly.",
      "content": "Speak softly. If the teacher calls on you or a friend asks a question, clear your throat delicately and respond in a quiet voice. If they tell you to speak up, explain that it hurts when you speak loudly. A bad cough can totally ravage your throat, so this will make your sickness seem more realistic. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Apologize for not being able to speak, and act as if you are trying. This will reinforce the idea that your body is out of your control."
    },
    {
      "title": "Clear your throat repeatedly.",
      "content": "Clear your throat repeatedly. Pretend that you constantly have something blocking in your airway, which is a common feeling when you have a real illness. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source By doing this, you will naturally create a bit of rasp in your voice, even if you aren’t sick. As gross as it sounds, try to really hack up some mucus so that it sounds convincing. Continuously sip on water as you do this, to make it look like you’re trying to take care of it. Even though you want your teacher to take notice of your cough and discomfort, try not to become the center of attention. If you act overdramatic, your teacher (and classmates) may start to believe you have ulterior motives."
    }
  ]
}