{
  "url": "https://www.wikihow.com/Do-Ombre-Nails",
  "title": "How to Do Ombre Nails",
  "steps": [
    {
      "title": "Clean up your nails.",
      "content": "Clean up your nails. Use a cotton ball lightly soaked in nail polish remover to remove any nail polish currently on your nails. Gently trim your nails with nail clippers until your nails are at your desired length. Then use a nail file to smooth out rough edges and shape your nails. You can also push back your cuticles using a rounded manicure stick. This will help elongate your nail beds, so your nails look longer. Alternatively, you can push back your cuticles using your thumbnail on your opposite hand."
    },
    {
      "title": "Apply a clear base coat.",
      "content": "Apply a clear base coat. Paint on a thin, clear, base coat to all of your nails. A clear base coat protects your nails from getting stained by colored polishes and helps extend your manicure by decreasing the prevalence of chips in your nail polish."
    },
    {
      "title": "Apply your base color coat.",
      "content": "Apply your base color coat. With ombré nails, your base color is usually a white polish or the lightest color you plan to use for the ombré effect. A white polish will help colors seem more vibrant, but using the lightest of your planned ombré polishes will give a softer, more subtle ombré effect. [1] X Research source Paint this background color on all of your nails. For an opaque base, paint two coats of your base color. Allow the first coat to dry completely before adding the second coat. To help your nails dry faster, it’s better to paint two thin coats of polish rather than one, thick and heavy coat of polish."
    },
    {
      "title": "Paint your ombré colors onto a makeup sponge.",
      "content": "Paint your ombré colors onto a makeup sponge. Paint your ombré colors in straight, horizontal lines side-by-side across a small makeup sponge. [2] X Research source The area of the sponge you paint should relatively be the same width as your nail. Start by painting a line across the width of the sponge with the lightest color of nail polish. Then paint with the next darkest color underneath the first color. Finally, paint the darkest color of polish underneath the second line of polish. Be sure that all the colors are painted right next to each other with no exposed sponge between the colors. [3] X Research source Paint a couple coats of polish onto the sponge for each color so the polish is wet enough to stamp onto your nail. Normally, two or three colors are used to create the ombré effect, but you can experiment with different colors and combinations to see what you like best. It may help to dip the makeup sponge in water first before painting on the colors. Dip the makeup sponge into water. Wring out the sponge until approximately 80% of the water is removed. Then paint on the nail polish colors. Dipping the sponge in water will prevent the sponge from absorbing too much polish and having the polish dry up too quickly on the sponge."
    },
    {
      "title": "Stamp the polish onto your nails.",
      "content": "Stamp the polish onto your nails. Stamp the polish onto your nail by pressing the sponge (with the polish side down) on top of you nail repeatedly, lifting the sponge away every couple of stamps to check and see if the ombré is dark enough and to your liking. [4] X Research source"
    },
    {
      "title": "Roll the polish onto your nails.",
      "content": "Roll the polish onto your nails. Roll the polish onto your nails by placing the side edge of the sponge next to the side of your nail. Slowly roll the sponge (with the polish side down) over your nail to the other side of your nail. [5] X Research source Do this repeatedly to darken the polish colors and increase the ombré effect. This process will transfer some nail polish onto your skin surrounding your nails. To prevent this you can edge the skin around your nails with a thin layer of petroleum jelly or place tape on the skin surrounding your nails. [6] X Research source Otherwise; you can use nail polish remover to clean the sides of your nails later. There is a lot of freedom with how you transfer the paint to your nail. You can adjust the placement of the sponge (stamping vertically on the length of your nail, tilting the sponge to specifically stamp on a certain color) to make your ombré effect unique and original. [7] X Research source"
    },
    {
      "title": "Reload the sponge.",
      "content": "Reload the sponge. When you have finished the ombré effect on one nail, reload the polish onto the sponge, so the ombré colors remain wet and vibrant. Paint the nail polish colors in the same fashion as before, lining the sponge with the lightest color and moving down to the darkest. Make sure all the polish colors are side-by-side touching each other. [8] X Research source Keep in mind, if you try to ombré you nails with a sponge that isn’t damp enough with polish, the dry sponge can actually pull off your base color coat and ruin your polish. [9] X Research source If you stamp or roll your nails quickly, you most likely only need to add polish to the sponge for every other nail."
    },
    {
      "title": "Apply a topcoat.",
      "content": "Apply a topcoat. Once you have given all of your nails adequate time to dry (about 10-15 minutes), add a top coat of clear polish to your nails. You might want to consider doing two coats of a top coat to smooth out your nails, since the sponging makes the surface of your nail a little stippled and bumpy. [10] X Research source"
    },
    {
      "title": "Clean up the skin around your nails.",
      "content": "Clean up the skin around your nails. Use a small paintbrush or cotton swab dipped in nail polish remover to swipe along the edges and cuticles of your nails. [11] X Research source The cotton on the cotton swab will help rub off polish on the skin, whereas the paintbrush can be more exact in removing excess nail polish."
    },
    {
      "title": "Clean up your nails.",
      "content": "Clean up your nails. Whenever you paint your nails, you want to have a nice, clean canvas. Remove any remaining nail polish currently on your nails with a cotton ball lightly soaked in nail polish remover. Cut your nails down to your desired length using nail clippers. File down your nails even more if you want them shorter, and smooth out the sharp corners of your nail. Consider pushing back your cuticles with a manicure stick to expose a bit more of your nail bed. You can also use your thumbnail from your other hand to push back your cuticles if you don’t have a manicure stick."
    },
    {
      "title": "Apply a clear base coat.",
      "content": "Apply a clear base coat. Paint on a clear base coat to protect your nails from being stained by the color in colored nail polishes. A clear base helps to extend your manicure by making chips in the polish less prevalent. Allow your clear base coat to dry about 5-10 minutes before applying any more nail polish."
    },
    {
      "title": "Apply your base color coat.",
      "content": "Apply your base color coat. Paint all of your nails with your base color. Your base color can be whatever color you want; it’s really up to you. To get a solid base, consider painting on two lighter coats of polish as opposed to one, thick and heavy coat. Wait a few minutes in between coats (about 5-10 minutes), so the polish has a chance to dry completely. Two light coats of polish will increase the opacity of the color without making the layers of polish gooey."
    },
    {
      "title": "Add your first coat of glitter.",
      "content": "Add your first coat of glitter. Unscrew the brush from the bottle, and wipe the sides of the brush on the inside neck of the bottle to remove most of the glitter polish. You want tiny glitter on the brush for your first coat of glitter. Paint over your entire nail, making sure that the top portion of your nail near your cuticle is barely speckled with glitter. The bottom portion of your nail can have a bit more glitter since it will be layered with glitter anyhow. [12] X Research source Allow this first layer of glitter to dry for at least five minutes."
    },
    {
      "title": "Paint your second coat of glitter.",
      "content": "Paint your second coat of glitter. Wipe off the brush a little less this time, so there is a little more glitter on the brush. Paint the lower half of your nail, focusing on applying more glitter toward the end tip of your nail. [13] X Research source Allow your nails at least ten minutes to dry completely. Obviously, you can make the bottom half of your nail as glittery as you would like. Just be sure the ombré glitter gradient transitions from thin to thick, smoothly. You can always add another coat of glitter to the bottom 1/3 or 1/4 of your nail, but then you run the risk of having a very wet nail (full of layers of polish). A wet nail heavy with polish will take a long time to dry. Experiment to see what you think looks best and works well regarding drying time."
    },
    {
      "title": "Add a clear topcoat.",
      "content": "Add a clear topcoat. Paint on a clear topcoat to seal your nails and smooth out your nail surface. [14] X Research source You may consider adding two thin coats of your top coat, only because the glitter can make the surface of your nail quite bumpy. You want all the glitter to be covered, so the glitter doesn’t get caught on any clothing or scratches your skin."
    }
  ]
}