{
  "url": "https://www.wikihow.com/Deal-With-a-Bullying-Boss",
  "title": "How to Deal With a Bullying Boss",
  "steps": [
    {
      "title": "Seek out a confidant.",
      "content": "Seek out a confidant. It is preferable to choose a friend outside of your work life to discuss your bullying boss situation. This person can help you clarify your thoughts and figure out if you and your boss have a personality conflict or whether true bullying is taking place. [1] X Research source Find a time when you and a close friend can meet in person. Say something like, “I have a situation at work that I need your opinion on. I think my boss may be bullying me, but I want to see what you think.” Then, give your friend several examples of what you consider to be your boss’s problem behavior. Listen carefully and with an open mind to your friend’s opinions. Perhaps you are a little sensitive. If so, your friend will be able to help you figure out whether you are being bullied or whether you just have thin skin. Your friend may also be helpful in offering suggestions on how to deal with your boss."
    },
    {
      "title": "Think about whether you are the only target or if the boss acts like this with others.",
      "content": "Think about whether you are the only target or if the boss acts like this with others. If there are others who are victimized by your boss, consider discreetly talking with them about the situation. [2] X Research source Without mentioning your own situation, see if you can open a conversation with them. Say something like, “It seems like our boss sometimes acts like a bully to you, such as when he calls you names at meetings.” If you trust this co-worker, mention your own concerns about your situation. Be sure to ask your colleague to keep all conversation between the two of you private."
    },
    {
      "title": "Document the bad behavior.",
      "content": "Document the bad behavior. When your boss demonstrates bullying behavior, take note of it and keep the records in a safe place. Each time bullying occurs, write it down with a time and date. If there were any witnesses to the events, write down their names as well. Note incidents of bullying directed towards others. This can help prove a pattern of bullying. [3] X Research source Save e-mails and memos if they have evidence of your boss’s unprofessional or unfair treatment."
    },
    {
      "title": "Speak up when the bullying occurs.",
      "content": "Speak up when the bullying occurs. You and your boss may have gotten off on the wrong foot. By asserting yourself early in your relationship, you may be able to re-set how you interact going forward. [4] X Research source Some bosses think that just because you work for them, they can speak with you in any manner when you make mistakes. The first time this happens, let them know in a kind way that you accept responsibility for the mistake but that you desire to be spoken to in a respectful manner. You could say something like, “I know I didn’t finish my project on time, but I do not appreciate you berating me about that in front of the whole staff. We should find a time to discuss my late project in private.” Another way to approach your boss could be, “I understand we disagree on how to handle this issue, but I don’t think resorting to name calling will help us come to a good solution.” Calmly and assertively standing up for yourself may be all you need to do to deal with your bullying boss, but in many cases you will need to take further action."
    },
    {
      "title": "Distinguish between a tough boss and a bully.",
      "content": "Distinguish between a tough boss and a bully. Demanding everyone produce stellar work within established timelines may be the sign of a tough boss, but it is not the sign of a bully. By achieving clarity on what constitutes a bullying boss, you will better be able to deal with the problem. If your boss is a demanding perfectionist, they may be difficult to work with but want what is best for the company. This type of boss can usually be reasoned with and may not fall under the definition of a “bully.” A bully is intimidating and will be verbally abusive (yelling, cursing) to you. They may also spread rumors about you. [5] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source Other signs that your boss is a bully include intruding on your privacy, micromanaging your work to the extreme, harshly criticizing your work, and questioning your skills in front of others. [6] X Research source A bullying boss may undermine you, by either setting outrageous deadlines or constantly changing the parameters of projects. A bullying boss may also blame you for things beyond your control or block your attempts to be transferred or promoted."
    },
    {
      "title": "Schedule a meeting.",
      "content": "Schedule a meeting. If you have tried a few times to address your boss’s bullying behavior immediately after it occurred and nothing changed, it may be more productive to schedule a meeting for a less emotional time. [7] X Research source Choose a private setting for your conversation. A neutral location, like a conference room, or an off-site location, such as a coffee shop, is better for the meeting than your boss’s office. Invite a representative from your HR department to sit in on the meeting."
    },
    {
      "title": "Remain calm.",
      "content": "Remain calm. It may seem intimidating to confront your bullying boss, but it is a vital step in developing a better workplace relationship and standing up for yourself. If you maintain a sense of control over your emotions and speak objectively, you will be more persuasive and can help keep the conversation from becoming overheated. Don’t be accusatory. State the issues in your own words and offer ways you both can work together. Stick to the facts and be professional. You can say something like, “I don’t appreciate you calling me names, and I hope we can have more productive, professional interactions in the future.” Cite specific examples: “It is not appropriate for you to yell at me in front of the entire marketing team.” If you stand up for yourself, the bully may back down."
    },
    {
      "title": "Document the meeting.",
      "content": "Document the meeting. After you speak with your boss about the bullying issues, make sure you record what happened at the meeting and what was agreed upon. Follow up this meeting with your boss with an e-mail confirming what transpired. [8] X Research source Forward a copy to the HR department, and keep a copy for yourself."
    },
    {
      "title": "Reach out to the HR department.",
      "content": "Reach out to the HR department. If your boss doesn’t change behavior after you talk with them, seek out your HR representative. Gather your documentation, emails, etc., and ask for a meeting in person. If you are afraid your boss’s bullying may escalate to a physical confrontation, you should proceed directly to the HR department instead of first meeting with your boss. Make clear that you feel unsafe or that your future employment is jeopardized because of your bullying boss. [9] X Research source Maintain a calm demeanor while presenting your case. If others in your department were also bullied, ask whether they will accompany you to the meeting with HR. At the end of the conversation, find out what the next steps are. Write up a summary of the meeting and send a copy to the HR representative and keep one for yourself."
    },
    {
      "title": "Explore other jobs in the company.",
      "content": "Explore other jobs in the company. If you are a good employee, most businesses would rather you transfer within the company rather than leave due to a clash of personalities with your present manager."
    },
    {
      "title": "Consider hiring an attorney to represent you.",
      "content": "Consider hiring an attorney to represent you. If the bullying is race based or involves sexual harassment, your boss may be violating state or federal laws. Remember, however, that bullying in itself is not against the law. Most workplace experts suggest only hiring an attorney if you feel you have a strong case that the bullying is race or gender based."
    },
    {
      "title": "Look for another job.",
      "content": "Look for another job. If your boss does not change behavior after meeting with them or asking the HR department to intervene, you may have no choice but to find another job."
    },
    {
      "title": "Make your situation tolerable while you are trying to resolve the bullying behavior.",
      "content": "Make your situation tolerable while you are trying to resolve the bullying behavior. It may take some time for you to have your bullying case resolved with your HR department or, if necessary, to find a new job. If you have vacation time saved up, it may be a good time to take a break. Take care of your mental and physical needs so that the bullying does not affect your health. Have outlets outside of work for socializing and reducing stress. [10] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Take a few walking breaks during the day to lower your stress level and get some fresh air. Seek out a counselor who specializes in workplace issues and work with them to develop coping skills."
    },
    {
      "title": "Surround yourself with friends and those who support you.",
      "content": "Surround yourself with friends and those who support you. Bully bosses may be more likely to pick on employees who don’t socialize much with others or are alone a lot. To counter this, develop friendships with coworkers and be social with others when possible."
    },
    {
      "title": "Maintain your professionalism.",
      "content": "Maintain your professionalism. Despite the bullying you face from your boss, try to keep your cool and demonstrate that you are just there to do your job. Continue to show up to work on time and complete your projects in a timely manner. Don’t respond to the bullying with an outburst of your own. Try to either diffuse the situation or simply leave the area without responding. Develop good relationships with others in the office. That way, you will be viewed as a true professional if ever there is a choice between you and the bully."
    },
    {
      "title": "Identify your boss’s triggers for bullying.",
      "content": "Identify your boss’s triggers for bullying. Although acknowledging situations that set off your boss does not excuse the bad behavior, this may be useful in helping you avoid some of your boss’s wrath. If your boss tends to act out when corporate supervisors are in town or when the fiscal year ends, try to see if there is a way to diffuse the situation before the bullying starts. [11] X Research source"
    },
    {
      "title": "Stay strong.",
      "content": "Stay strong. Bullies prey on those they consider weak, so don’t let them know that they are getting to you emotionally. Do not take bullying personally. Reframe the bullying behavior as a knock against your boss instead of a criticism of yourself. Don’t let the bully see you cry or get upset by their behavior. If necessary, go to your car or the restroom to decompress or even cry after a bullying episode, rather than breaking down in front of the bully. Just ignore the inflammatory comment and change the subject, or assert yourself calmly and professionally."
    },
    {
      "title": "Update your resume and contact lists.",
      "content": "Update your resume and contact lists. You may need to look for a new job in the near future if you cannot handle your bullying boss. Before that time comes, however, it is wise to lay the ground work to make a potential job search easier. Document every accomplishment, happy client, big sale, etc. By keeping an ongoing record of your accomplishments during this difficult time, you will be able to show you were working hard while in a challenging situation. Volunteer to work on projects with those outside of your department. That way, you’ll be able to demonstrate your skills to others in the company, which will be helpful if you try to transfer departments. Join local networking groups or professional societies. The more contacts you make, the easier it will be to find a new position."
    }
  ]
}