{
  "url": "https://www.wikihow.com/Cope-with-Staying-with-Your-Parents-(As-an-Adult)",
  "title": "13 Tips on Living & Getting Along with Your Parents as an Adult",
  "steps": [
    {
      "title": "Talk over living arrangements and ground rules with your parents.",
      "content": "Talk over living arrangements and ground rules with your parents. In a regular roommate living situation, it’s normal to come to an agreement on rules and responsibilities before moving in together. So, do the same with your parents. Set aside time to have a serious conversation on any past issues that might need to be dealt with, obstacles you anticipate, and how your day-to-day living situation will look. [1] X Research source For example, how much will your parents expect you to contribute to rent, bills, and other costs? Work out a plan ahead of time to ensure no one is surprised later on and that you’ll be able to do your part. How long will you be living together? If you went through a breakup, you might only stay until you can get a place of your own. If you’re unemployed and unsure when that will change, you might stay with them for a longer time. If you tell your parents what to expect right off the bat, this may also keep them from pestering you about when you’re planning to move out. All in all, it’s less stressful for both of you!"
    },
    {
      "title": "Setting boundaries",
      "content": "Setting boundaries helps avoid household conflict. Make sure your parents understand your personal boundaries, especially your need for personal space. You’ll likely need a safe place to retreat to when you want to be alone, and your bedroom is the perfect space for that—so, for example, you might clearly communicate to your parents that whenever your bedroom door is closed, it means you’d prefer not to be disturbed. [2] X Research source You might also control how and when you interact with your parents. Set aside a specific time to spend with them, and make it clear there’ll also be times when you need to be alone. If your parents are in the habit of asking nosy questions like, “Where are you going?” you might set a boundary and explain to them that you’re an adult and need to be able to come and go as you please. If you’re currently dating, it might also be a good idea to discuss whether your parents are okay with you bringing home a date. It’s important to respect their boundaries, too—after all, it’s their home. Setting and respecting boundaries is also a great way to build trust between you and your parents. The more you both do it, the better your relationship with them will be."
    },
    {
      "title": "Make your bedroom feel like a comfortable safe haven you can relax in.",
      "content": "Make your bedroom feel like a comfortable safe haven you can relax in. If you’re moving into your childhood bedroom (or a room your parents decorated), it probably won’t feel very “you” right away. Redecorate your room and make it feel like a true living space, not just a temporary place to stay! Whether you’re going to be there for weeks, months, or years, a bit of coziness and comfort can do wonders for your mental health. For example, if you’re back in your old bedroom, try replacing your old decor with decorations that make you feel more like the adult you are. Ask your parents if it’s okay to repaint the walls in that room. It’s still their house, after all—but you can always offer to paint back over it when you move out or use removable wallpaper. Pick up a few of your favorite scents or candles to make the space feel more comfortable. Consider adding a TV so you don’t always have to go out to the living room to watch something with your parents or a minifridge for your own snacks and drinks."
    },
    {
      "title": "Make plans to ensure you’re not cooped up with your parents 24/7.",
      "content": "Make plans to ensure you’re not cooped up with your parents 24/7. Run errands, go out with friends, spend the night at a friend’s house, or even plan a whole weekend away —whether it’s just for you or for you and a significant other. Living in such close quarters with your parents all the time may end up wearing on you; a little time away can help you feel refreshed and ensure you still have a vibrant social life. [3] X Research source Your parents may also appreciate the alone time! The time you spend out with friends or a significant other is time they get to spend with just one another, too. Don’t feel obligated to spend all your time with your parents. Staying at their house does give you a chance to get more quality time with them, but it’s still a good idea to maintain separate lives and hobbies. For example, you don’t need to invite them out to dinner when you decide to go eat at a restaurant. You’re allowed to keep your life separate from theirs!"
    },
    {
      "title": "Sticking to your old routines helps you keep a sense of independence.",
      "content": "Sticking to your old routines helps you keep a sense of independence. Structure and autonomy are both vital if you feel like you're losing a sense of independence being back home. Don’t let your parents do your laundry or clean up after you just because that’s the way they used to do things. Instead, take charge of the things you can control and keep up your usual routines , with you in charge of your daily chores and activities. [4] X Research source Keep getting up and going to bed at the same times you used to. If there were particular times you always took naps or ate your meals, adhere to those times as well. Is there a particular time you usually set aside for your favorite hobbies? Stick to that as well. For example, if you always read or draw for a couple of hours before bed, continue to do it while staying with your parents. If you do let your parents help you sometimes, make sure it’s part of an arrangement where you help them with something in return."
    },
    {
      "title": "Prioritize your mental and physical health while living with your parents.",
      "content": "Prioritize your mental and physical health while living with your parents. Staying with your parents can come with its own set of challenges—it’s a big adjustment, even if you’re on great terms with them. That’s why it’s more important than ever to take care of yourself! Be proactive and practice self-care every day. Eat well, get plenty of sleep, and make time for things that make you happy, including friends and hobbies. [5] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source Self-care is also your chance to get some “me time” each day. For example, you might take a luxurious bath, set aside a couple of hours to fix up your favorite meal, or clear your mind with meditation ."
    },
    {
      "title": "Learn to see them as adults with their own lives, not authority figures.",
      "content": "Learn to see them as adults with their own lives, not authority figures. A lot will have changed since you last lived together — you and your parents may seem like completely different people. So, rather than treating one another like parents and children, treat one another like roommates. After all, that’s what you are! It’s easier to get along and cohabitate when you’re on equal footing with them, giving you all a chance to grow and build on your relationship. [6] X Research source You may even find that you have a newfound sense of respect for your parents when you get to know them as roommates rather than authority figures! Make sure your parents get reintroduced to you, too. If you’ve been living away from them for a while, they might not be so familiar with the adult you are—so give them a chance to get to know you on those terms. Never be afraid to be yourself! Your parents may even start to like some of the things you like over time as you introduce more of your current interests to them."
    },
    {
      "title": "Try to embrace your differences instead of judging one another for them.",
      "content": "Try to embrace your differences instead of judging one another for them. You and your parents are likely very different people—and that’s okay. You can still cohabitate, even if you don’t lead similar lifestyles. Take a moment to acknowledge that you and your parents are at different points in your lives and therefore have different ways of doing things. Tell your parents that you respect their lifestyle, and ask them to respect yours. [7] X Research source For example, if your parents love getting up early to exercise, they shouldn’t pressure you to join them—and if you like staying out with friends, they shouldn’t get mad at you for getting back late at night. Remember: neither you nor your parents have the “right” or “wrong” lifestyle. You’re both entitled to live your life on your own terms, which is why it’s so important to respect each other’s choices."
    },
    {
      "title": "Learn to compromise instead of yelling or getting defensive.",
      "content": "Learn to compromise instead of yelling or getting defensive. You and your parents may argue from time to time, but if you navigate those conflicts respectfully, it’s much easier to work through them. Keep arguments as civil as possible; the more you get defensive and lose your cool, the more the conflict may escalate. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Look for ways to compromise with your parents to ensure that you both feel like your needs are being addressed. Listen actively to your parents, even if you don’t agree with them. Making them feel heard can go a long way toward smoothing some of the tension. Similarly, ask them to consider your point of view, even if it’s different from theirs. Parents sometimes assume that they and their kids share the same opinions, so respectfully show them that it’s okay to agree to disagree. Avoid attacking their beliefs, values, opinions or perspectives. Share your perspective using \"I\" statements and focus on your own thoughts and feelings. You may be able to agree or compromise with your parents sometimes, but understand that they may not always change their minds or their opinions."
    },
    {
      "title": "Discuss the situation gently if they start to treat you like a child again.",
      "content": "Discuss the situation gently if they start to treat you like a child again. Sometimes, no matter how responsible and independent you prove yourself to be, your parents may slip into the routine of treating you like a teenager again instead of the adult you are. They may be overprotective and pry into your personal business because they’re used to being that way—so don’t be afraid to put your foot down and tell them when you feel you’re being treated unfairly. [9] X Research source For example, you might say, “I appreciate your concern, but I have things under control,” if they start nagging you about looking for a job, or “Thank you for asking, but I have a plan,” when they ask if you know what you’re doing for dinner. If you need to confront them directly, remember to do it respectfully. Try saying something like, “I really appreciate how much you both care about me, but I’m an adult now, and I can take care of myself.”"
    },
    {
      "title": "Set goals for yourself to eventually move back out on your own.",
      "content": "Set goals for yourself to eventually move back out on your own. While there’s nothing wrong with staying in your parent’s home, it’s also natural to want to be on your own again as soon as possible! So, make your eventual departure something to work toward. Figure out how much money you’ll need to move back out of your parent's home, start saving up money , and build a financial safety net to support yourself independently. [10] X Research source Even if you pay rent or contribute financially somehow, staying at your parents’ house should ideally be cheaper than paying rent or your own mortgage—and it’ll save you lots of money. Create a budget for yourself with the goal of saving as much money as possible each month, and set savings goals to work toward. Once you’ve met your goals, you’ll know it’s time to strike out on your own once more! Staying with your parents can sometimes feel like you’re going backward in life, even though there’s nothing wrong with it—so setting (and meeting) your savings goals can be a great way to feel encouraged by the progress you make."
    },
    {
      "title": "Small gestures go a long way toward making a peaceful living situation.",
      "content": "Small gestures go a long way toward making a peaceful living situation. If you’re worried about seeming like a slacker or burden to your parents—or worse, like a kid who needs to be asked to clean up—then take the initiative and help out around the house without being asked. Set aside a few hours every week to run errands and do chores like vacuuming, dusting, washing dishes, and taking out the trash. [11] X Research source Not only will helping out around the house improve your living space, but it’ll also earn your parent’s respect and show them that you’re a mature, responsible adult. Additionally, getting in the habit of tackling household chores while staying with your parents will come in handy when you’re living on your own again. Try doing something sweet for your parents every now and again too! It’ll make them feel loved, and it’s a great way to show your appreciation for being able to stay with them. For example, try cooking their favorite meal, leaving a sweet note on the counter for them, or doing a household chore that they typically take care of."
    },
    {
      "title": "Expressing gratitude may help you build a stronger relationship with them.",
      "content": "Expressing gratitude may help you build a stronger relationship with them. Whether your relationship with your parents is amazing or a little rocky, conveying gratitude can work wonders and make it even better. Remind yourself that, even if they can be a bit much at times, they’ve opened their doors to you and given you a place to stay. Show them that you appreciate their generosity, and focus on making happy memories with them while you’re there. [12] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    }
  ]
}