{
  "url": "https://www.wikihow.com/Find-Story-Ideas",
  "title": "How to Find Story Ideas",
  "steps": [
    {
      "title": "Browse the internet for news items.",
      "content": "Browse the internet for news items. The news can inspire many ideas, especially if the news items provoke feelings of joy, anger, annoyance, compassion, and so on. Bookmark or keep copies of news items that you like, for future reference."
    },
    {
      "title": "Look online for a list or writing topics.",
      "content": "Look online for a list or writing topics. You can find plenty of topics that you would have never thought of by searching websites, search engines and article sites. Look for listicles which list many different things for each topic of interest to you."
    },
    {
      "title": "Watch your favorite video clips, movies or other video material online.",
      "content": "Watch your favorite video clips, movies or other video material online. Go to your country's archives to find films about the past as a great source of historic inspiration."
    },
    {
      "title": "Visit the question/answer sites like Quora or WikiAnswers.",
      "content": "Visit the question/answer sites like Quora or WikiAnswers . It's the place where people expose their most hidden issues they wouldn't even reveal to their spouses or parents. You can read psychological or material issues you would never think people can have. Search on the site using keywords, you will find some stories related to yours. Only focus on the questions; the answers are far less interesting."
    },
    {
      "title": "Look around your home.",
      "content": "Look around your home. Do you see anything with a story behind it? Like that necklace grandma gave you, or the blue ribbon for the soccer tournament? Put that story down on paper."
    },
    {
      "title": "Look around outside.",
      "content": "Look around outside. [1] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021. For example, if you live in a nature filled place, take a look at the leaves and how they sway in the wind and those small, delicate butterflies that flutter from flower to flower. Writing down notes of what you see, touch, taste, hear and smell will help you on the road to coming up with a new story idea. You can do that even if you live in a large urban area, as there's always inspiration to be drawn from human interactions as well. [2] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021. If possible, travel to a place that you've never been before. Doing something different can inspire you to create a new story. [3] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021."
    },
    {
      "title": "Watch random people walk down the street and write a pretend life story for them.",
      "content": "Watch random people walk down the street and write a pretend life story for them. It may seem strange, but you never know where doing this might lead by way of a character leading a curious life. If there aren't people around, try Googling up pictures of random people and using them instead. Try people watching when at your favorite coffee shop or while waiting for a bus. [4] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021. These don't have to be stories that take forever to write, either. You can just quickly jot down ideas or doodle things that interest you or that you think would make for a good story."
    },
    {
      "title": "Use pause when you listen to a story.",
      "content": "Use pause when you listen to a story. When you read a book, watch a movie alone or view videos on YouTube, take the habit to pause at the most confusing moment. At this moment, try to guess the following. Search as many versions as possible. When you resume the story, your version is sometimes more original than the official ending. It's not plagiarism if the idea is different. You can also adapt your new ending to your story, change the names, the place. Eventually, it will be a completely different story."
    },
    {
      "title": "Don't get frustrated when you listen to a story (serendipity).",
      "content": "Don't get frustrated when you listen to a story (serendipity). Sometimes, you see a trailer movie and you think \"Wow! This concept is so original!\" You go to see the movie and you discover that the concept is completely another one... Don't be frustrated! It means that you have found an original idea! Don't lose it."
    },
    {
      "title": "Use the news headlines for inspiration.",
      "content": "Use the news headlines for inspiration. Find a striking and interesting article that catches your eye, and write about it."
    },
    {
      "title": "Listen to conversations.",
      "content": "Listen to conversations. Snippets of conversation can be incorporated into your story."
    },
    {
      "title": "Listen to a song and really pay attention to the lyrics.",
      "content": "Listen to a song and really pay attention to the lyrics. [5] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021. How does the song make you feel? Happy? Sad? Write about a character you can create from these lyrics, or just write about how it makes you feel."
    },
    {
      "title": "Sometimes, just writing the title of a future story will make your words flow and create an impressive story.",
      "content": "Sometimes, just writing the title of a future story will make your words flow and create an impressive story."
    },
    {
      "title": "Write fan-fiction.",
      "content": "Write fan-fiction. Incorporate your favorite band or singer into it and write about their crazy, funny or sad antics. You could write about your interpretation of how a certain song came to be. There are many fan-fiction websites that you can then post your story on, and get reviews."
    },
    {
      "title": "Look through a magazine or borrow some magazines from the library.",
      "content": "Look through a magazine or borrow some magazines from the library. Flip through the pages and see what you find. Embarrassing moments? Incorporate them into a story. Problem/help pages in the magazine? You can use one of those problems for your characters' problem(s) and complications."
    },
    {
      "title": "Look at pictures/photos of people.",
      "content": "Look at pictures/photos of people. Imagine what their name is, who they are, their life story etc. Write about who they really are. If you want to write fantasy stories, try playing with fantasy-themed jigsaw puzzles. As you combine the pieces, you may draw some inspiration for your writing! [6] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021."
    },
    {
      "title": "Take your real life experiences and incorporate them into your story.",
      "content": "Take your real life experiences and incorporate them into your story. Or you could write an auto-biography!"
    },
    {
      "title": "If writing with a pen and paper and not on a computer, having the right stationery can actually improve your writing.",
      "content": "If writing with a pen and paper and not on a computer, having the right stationery can actually improve your writing. You can't expect to use your full writing potential by writing on pre-scribbled paper with a really crummy pen, can you?"
    },
    {
      "title": "Write about your dreams and wildest fantasies coming to reality (don't worry, you can change the names!",
      "content": "Write about your dreams and wildest fantasies coming to reality (don't worry, you can change the names! )."
    },
    {
      "title": "Make a mind map.",
      "content": "Make a mind map. Mind maps are great for organizing information about characters and events, especially if you are more of a visual person."
    },
    {
      "title": "Watch TV, with a notebook or laptop on hand, and study the people, TV shows and commercials you see.",
      "content": "Watch TV, with a notebook or laptop on hand, and study the people, TV shows and commercials you see. TV can actually bring inspiring ideas to mind. Study the people on the commercials, and think of their life after the commercial has passed."
    },
    {
      "title": "Write about your favorite book or movie.",
      "content": "Write about your favorite book or movie. Was it a certain type of character or a setting? Try incorporating similar elements into your own story.Just be sure you don't plagiarize, if you plan on showing your story to others."
    },
    {
      "title": "Prepare ideas from a diary or journal - if you had one.",
      "content": "Prepare ideas from a diary or journal - if you had one. Look through previous entries. Find something in there that you can incorporate into your story."
    },
    {
      "title": "Try free-writing, it only takes about ten minutes a day.",
      "content": "Try free-writing, it only takes about ten minutes a day. Basically, you write non-stop for 10-20 minutes, writing about whatever comes to mind. Don't make corrections as you write, and just keep writing, even if you have to write, 'I don't know what to write' until you can write something else."
    },
    {
      "title": "Make an exquisite corpse.",
      "content": "Make an exquisite corpse. This is a really good writing activity that can strike up ideas with your friends or family when bored. (- denotes a new line). Grab a piece of paper, and write three lines about something (eg. Once upon a time, there lived a bird - named Andy. Andy loved fishing, because - he loved eating). Then fold the first two lines so only the third line is visible (e.g he loved eating) and then pass it to another person to continue. (e.g he loved eating walnuts- in the summer breeze. Suddenly- a huge beast from the) Keep continuing this until the page is filled. When you read back what you have wrote, you will most likely be having fits of laughter; it's very amusing."
    },
    {
      "title": "Think of an event that has happened in your life recently, or maybe something that happened a long time ago.",
      "content": "Think of an event that has happened in your life recently, or maybe something that happened a long time ago. How did it affect you? Did it have a lasting impression, or even impact? Jot down your thoughts and try crafting a story from that. If you had an awesome adventure or a special event that had an impact on your life, you could use this as a story idea. You could also try going back to some childhood activities you used to do. Getting in touch with your past self is a way to understand your motivations and to remind yourself of why you started writing in the first place. [7] X Expert Source Lydia Stevens Author & Developmental Editor Expert Interview. 1 September 2021."
    },
    {
      "title": "Write about the dream you had last night.",
      "content": "Write about the dream you had last night. The plotlines for numerous famous stories and novels were hatched in the dreams of their author's. It may seem unlikely, but your dream could become a bestseller someday! Keeping a journal and pen on your night stand right before you go to sleep is helpful. If you have an insane dream that you must write down, grab your journal and start writing. The dreams don't have to be recent. They can also be ones that you remember from your childhood or many moons ago."
    },
    {
      "title": "Always carry a small notebook or a handheld computer with you so whenever inspiration strikes, you will be ready to record it and always have ideas for stories.",
      "content": "Always carry a small notebook or a handheld computer with you so whenever inspiration strikes, you will be ready to record it and always have ideas for stories. Remember, you might not use a paragraph that you have written now, but who knows, in ten years time it might turn out to be the perfect ending for a story of yours."
    },
    {
      "title": "Try random words or phrases.",
      "content": "Try random words or phrases. For example: a secret diary, a squishy banana and a sneaky babysitter. Take your three phrases or words and try to make a story out of it. You'll never know how it will turn out if you don't try!"
    },
    {
      "title": "Choose a genre to be inspired by.",
      "content": "Choose a genre to be inspired by. The type of story you choose to write about must be developed around a certain genre and is the most important part of coming up with a story. Whether it's a romance, teen fiction or a thriller, selecting the genre may be a good source of inspiration for more ideas."
    },
    {
      "title": "Even when short on ideas, there are still things to write about!",
      "content": "Even when short on ideas, there are still things to write about! I remember an author visited my primary school and was talking to us about a new novel he wrote (I forget his name and what it's called!). He said he was just sitting down at a cafe (I think) with a notebook and pen in his hand, thinking of something to write... when he came up with the idea of a boy who never knew what to write, until he borrowed a strange pen off a boy who was an excellent writer, and when he used that pen his writing became very different."
    },
    {
      "title": "Transfer all of your story ideas onto a laptop, computer or a notebook.",
      "content": "Transfer all of your story ideas onto a laptop, computer or a notebook."
    }
  ]
}