{
  "url": "https://www.wikihow.com/Fight-a-Red-Light-Camera-Ticket-in-Florida",
  "title": "How to Fight a Red Light Camera Ticket in Florida",
  "steps": [
    {
      "title": "Review the information on your violation notice.",
      "content": "Review the information on your violation notice. Red-light camera violations are assessed to the record owner of the car. If you receive a notice of violation, it is because your car was recorded by a red-light camera running a red light. If you've recently loaned your car to someone, it's possible you weren't driving the car. You can verify this by looking at the location of the camera, the photos and video from the camera, and the date and time of the violation. Your violation notice typically has a web address where you can go to watch the video of the actual violation."
    },
    {
      "title": "Download an affidavit form.",
      "content": "Download an affidavit form. When you go online to look at the photos and video from the camera, look for a link to an affidavit form. You may have to enter the notice number or other information on your notice of violation to log in. Some cities and counties provide an affidavit form along with your notice. If you were not driving your car at the time of the violation, you can return this form to the address listed on your violation. If you can't find a form, contact the agency in charge of issuing the red-light camera tickets and ask about filing an affidavit. You'll find contact information listed on the violation notice."
    },
    {
      "title": "Gather information about the person driving your car.",
      "content": "Gather information about the person driving your car. On the affidavit, you must provide the name, address, and birth date of the person who was driving your car when the violation occurred. If you're able to get it, you should also include the person's driver's license number. If your car was stolen when the violation occurred, you may not have any information about the person driving the car. Get a copy of the police report and attach that to your affidavit instead."
    },
    {
      "title": "Evaluate exemptions to the law.",
      "content": "Evaluate exemptions to the law. Violation notices for red-light camera tickets are sent to the registered owner of the car. Even if you didn't loan your car to someone else, there may be another exemption that applies. Assert these exemptions by filing an affidavit. [2] X Research source The exemptions may be listed on your notice, or you may have to check the police department's website. For example, if you sold your car but the registration hadn't been changed over yet, the new owner may be responsible for the violation. Provide information about the new owner of the car in your affidavit."
    },
    {
      "title": "Get your affidavit notarized.",
      "content": "Get your affidavit notarized. Some cities and counties require you to sign your affidavit in front of a notary public. The notary verifies your identity and certifies that you were the person who signed the affidavit. When you sign the affidavit, you are personally certifying that the information contained within the affidavit is true and correct to the best of your knowledge. The notary doesn't verify the truth of the information in the affidavit itself."
    },
    {
      "title": "Submit your affidavit before the due date on your violation notice.",
      "content": "Submit your affidavit before the due date on your violation notice. When you get a notice of violation, you have 60 days to pay it or take another action. Submit your affidavit as soon as possible so it can be processed before that deadline is up. Otherwise a uniform traffic citation may be issued against you for failure to pay the ticket. As long as the information in your affidavit complies with state law, the action against you will be dismissed. The person named in your violation will receive a notice of violation and have 60 days to pay it."
    },
    {
      "title": "Follow the instructions on your notice to request a hearing.",
      "content": "Follow the instructions on your notice to request a hearing. When you get a notice of violation from a red-light camera, it provides information about the violation itself as well as instructions on how to contest the violation. If you request a hearing, there may be additional costs assessed to you. These costs will be listed on your notice of violation. Each city or county has a hearing request form. There may be one included with your notice of violation, or you may be able to download one online. [3] X Research source"
    },
    {
      "title": "Assess the quality of the photos or video.",
      "content": "Assess the quality of the photos or video. View the photo or video taken by the red-light camera that issued your ticket. If the photo of you or your license plate is blurry, argue that it isn't clear the car is really yours. [4] X Research source Any violation of the law must be proven beyond any reasonable doubt – even a traffic infraction. If the photo is so blurry that the license plate can't be identified conclusively, you've introduced reasonable doubt that you didn't commit the violation."
    },
    {
      "title": "Gather evidence to support your defense.",
      "content": "Gather evidence to support your defense. When you go to your hearing, you will be allowed to present evidence in support of your claim. That evidence can include witness testimony or evidence from the scene. [5] X Research source For example, you might argue that you ran the red light to clear the way for a funeral procession or an emergency vehicle. Evidence of the reason you moved would prove that you had a reason for running the light. Particularly if you're turning right, you can introduce evidence that you did stop, or that your movement was safe."
    },
    {
      "title": "Consult a traffic citation attorney.",
      "content": "Consult a traffic citation attorney. A local attorney who specializes in fighting red-light tickets may be your best and easiest way to get your ticket dismissed. However, keep in mind that while an attorney may be able to get your ticket dismissed, you may end up paying more in attorney's fees than you would if you had just paid the ticket. [6] X Research source Florida doesn't assess any points on your license for a red-light camera ticket, and it won't appear on your driving record. Weigh these facts when deciding whether to hire an attorney. Most traffic citation attorneys provide a free initial consultation, so you may be able to use that opportunity to assess the strength of your defense, even if you ultimately decide not to hire the attorney."
    },
    {
      "title": "Appear in court",
      "content": "Appear in court on your hearing date. When you request a hearing, you will receive a notice in the mail with the date and time of your hearing. If you don't receive a hearing within a week or so of submitting your request, contact the court or office where the hearing will be held and find out if they received your request and if a hearing has been scheduled. The hearing officer likely will have several hearings on the same day, so take a seat in the gallery until your name is called. You are allowed to bring witnesses to testify in your defense at your hearing. Understandably, witnesses may be hard to find after the fact. However, if there was anyone riding in your car at the time, you can bring them along to tell the judge what they saw."
    },
    {
      "title": "Present your case",
      "content": "Present your case to the hearing officer. When your name is called, stand and approach the front of the courtroom. The hearing officer will ask you questions about the violation. Stick to the facts, and tell the hearing officer your story in a loud, clear voice. There may be someone there representing the city or county that issued the violation. If present, you will be allowed to ask them questions. They may also ask you questions. Treat them with the same respect that you do the hearing officer. After you've told your story, the hearing officer will issue their decision. If they determine that you are guilty of the violation, you have a short period of time to appeal the decision. You'll receive instructions on how to appeal their decision."
    },
    {
      "title": "Identify the appropriate circuit court.",
      "content": "Identify the appropriate circuit court. The decision of a hearing officer on a red-light camera ticket in Florida is considered an administrative decision, and is appealed to the circuit court with jurisdiction over the city or county where the violation occurred. [7] X Research source There are 20 circuit courts in Florida. Find the right circuit court by visiting the Florida courts website at http://www.flcourts.org/florida-courts/trial-courts-circuit.stml and selecting the right court from the list. This hearing isn't a new trial. The only information the appeals court will consider is what was presented at your hearing. This isn't time to introduce new evidence or try out a new defense."
    },
    {
      "title": "Hire an attorney.",
      "content": "Hire an attorney. Appellate procedure can be complicated, and has many short deadlines. If you don't meet a deadline, your appeal may be thrown out. For this reason alone, if you've decided you want to appeal the hearing officer's decision, it's a good idea to have an attorney on your side. Look for an attorney who specializes in appeals, as they'll be most familiar with appellate rules and procedures. You can start your search for an attorney on the Florida Bar Association website at https://www.floridabar.org/directories/find-mbr/ . If you click on \"More options,\" you can limit your results to those in appellate practice."
    },
    {
      "title": "File your notice of appeal and directions to the clerk.",
      "content": "File your notice of appeal and directions to the clerk. To appeal an administrative decision, you must file a notice of appeal within 10 days of the date the hearing officer issues their decision. The clerk of the court where the hearing took place will have forms. The notice of appeal simply lets the police department know that you plan to appeal the hearing officer's decision. The directions to the clerk instructs the clerk of court to begin assembling the record of your hearing. These are simple, fill-in-the-blank forms. Because of the short deadline, you may have to file your notice of appeal before you've hired an attorney. You'll have to pay a filing fee when you file this notice. The fee varies among circuits, but typically is several hundred dollars. If you can't afford the fee, ask the clerk for an application for a waiver. Fees are waived for low-income appellants, including most who accept some form of public assistance."
    },
    {
      "title": "Put together your record on appeal.",
      "content": "Put together your record on appeal. When you appeal a hearing officer's decision, you don't get a new trial. The appeals court only considers the information the hearing officer considered. The record on appeal consists of your original violation, the photos and video from the red-light camera, and any evidence you presented at your hearing. A court reporter recorded all testimony at the hearing. Request a copy of the transcript of the proceedings. You'll have to pay a fee for the transcript. If you've hired an attorney, they'll take care of this for you."
    },
    {
      "title": "Draft your initial appellate brief.",
      "content": "Draft your initial appellate brief. In your initial appellate brief, you explain to the appeals court why you believe the hearing officer's decision was wrong. Typically, you'll argue that the hearing officer's application of the law to the facts in your case was incorrect. You also may argue that the hearing officer's decision violates your rights under the state or federal constitution. If you've hired an attorney, they'll draft the appellate brief. They may have additional questions for you as they work on this document."
    }
  ]
}