{
  "url": "https://www.wikihow.com/Explain-Autism-to-People",
  "title": "How to Explain Autism to People",
  "steps": [
    {
      "title": "Know what the general definition of autism is.",
      "content": "Know what the general definition of autism is. Autism is a neuro-developmental disability that generally leads to differences in communication and social skills, unique patterns of thought and behavior, and divergent sensory experiences. It is a neurological difference that can present difficulties, but also advantages. [1] X Trustworthy Source Austistic Self Advocacy Network Nonprofit organization run by and for individuals on the autism spectrum that empowers autistic people through education and public advocacy Go to source Autism isn't a behavior disorder, but a different way of thinking. Autistic people don't need punishment or correction for being different, but understanding and support. Unusual behavior often helps them cope and relax, so it shouldn't be discouraged just because it's different."
    },
    {
      "title": "Learn what autistic people have to say about autism.",
      "content": "Learn what autistic people have to say about autism. Autistic people, experiencing the differences and urges themselves, can offer the greatest insight into how autism works. They also present a more inclusive view than many parent-run organizations. [2] X Trustworthy Source Austistic Self Advocacy Network Nonprofit organization run by and for individuals on the autism spectrum that empowers autistic people through education and public advocacy Go to source Steer clear of overly negative sources like Autism Speaks ."
    },
    {
      "title": "Understand that every autistic person is unique.",
      "content": "Understand that every autistic person is unique. Autistic people are extremely diverse, so any two autistic people could be very different from each other. One person might have severe sensory issues with strong social skills and strong executive function, while another may have few sensory issues while struggling with basic social interaction. Not every autistic person flaps their hands, or stims in noticeable ways. Thus, it can be hard to make generalizations or assumptions. Keep this fact in mind when explaining autism to someone else. It is important to express that not all autistic people act the same way, just as not all neurotypical people act the same way. When describing an autistic person, emphasize their unique needs, strengths, and differences."
    },
    {
      "title": "Be aware of communication differences.",
      "content": "Be aware of communication differences. Some autistic people find communicating with others to be very difficult. Some of these difficulties may be easy to spot, while others may be much more subtle. Autistic people may experience: Unusually singsong flat tone of voice, creating odd rhythms and pitches Repeating questions or phrases (echolalia) Difficulty expressing needs and desires Taking longer to process spoken words, not responding quickly to instructions, or becoming confused by too many words spoken too quickly Literal interpretation of language (confused about sarcasm, irony, and figures of speech)"
    },
    {
      "title": "Understand that autistic people interact differently with the world around them.",
      "content": "Understand that autistic people interact differently with the world around them. When speaking with an autistic person, you may find yourself wondering if they are really paying attention to you, or even care that you’re there. Don't let this bother you. Keep in mind that: Some autistic people seem \"lost in their own world\" when they are caught up in their own thoughts. An autistic person might listen differently. It's normal for autistic people to avoid direct eye contact and fidget while they pay attention. This helps them focus. What looks like inattentiveness is actually them making modifications so they can listen better. Autistic people can get overwhelmed in conversations, and look inattentive. They may be distracted, or maybe the conversation is moving too fast. Offer to move to a quieter place, and give pauses in the conversation to let the autistic person think. Autistic children may find it challenging to play with others, because it involves difficult social rules and/or overwhelming sensory experiences. Playing alone might be easier."
    },
    {
      "title": "Realize that autistic people generally enjoy structure.",
      "content": "Realize that autistic people generally enjoy structure. They can create highly structured routines for their day. This is because autistic people can be easily startled by unknown stimuli, and the certainty of a schedule feels more comfortable. Autistic people may: Follow a strict routine. Find unexpected changes very distressing (e.g. change in school environment). Use a comfort object to help deal with stress. Place things in order (e.g. lining toys up by color and size). If you are trying to explain your child's autism to a friend, compare how their child may get ready for school. There's a basic routine when getting ready for school: eating breakfast, brushing one's teeth, getting dressed, packing their schoolbag, etc. Although there's the same routine, some of these steps may get jumbled some mornings. A neurotypical child wouldn't care if they get dressed before breakfast one morning, which would be outside of the normal routine. For an autistic child, these changes can be extremely disorienting. If they're used to a certain routine, it's better to stick to it."
    },
    {
      "title": "Explain that autistic people may act a little differently, and this is okay.",
      "content": "Explain that autistic people may act a little differently , and this is okay. Autistic people deal with barriers and stressors that neurotypicals never face, so they may act unusually or exhibit different social skills. This depends on the individual's needs and strengths. People with stronger social skills may simply seem awkward and a little clumsy. They may have difficulty understanding what is expected of them, so they may say or do things that are surprising to you. Some autistic people face large conversational challenges, and may not be able to carry a typical conversation."
    },
    {
      "title": "Mention that the autistic person may not make eye contact.",
      "content": "Mention that the autistic person may not make eye contact. Eye contact can feel incredibly overwhelming, and the autistic person may not be able to meet someone's eyes and listen to their words at the same time. Explain that for autistic people, looking away is different from not listening. [6] X Research source Never force eye contact. This could make them scared or uncomfortable, their conversational skills may plummet, and it could trigger sensory overload . Some autistic people are capable of making or faking eye contact without it bothering them too much. It depends on the person and their comfort zones."
    },
    {
      "title": "Explain that autistic people are different, not necessarily disinterested.",
      "content": "Explain that autistic people are different, not necessarily disinterested. Teach the person that autistic people may need to fidget or avoid eye contact in order to focus. The autistic person might look at their conversation partner's mouth, hands, or feet—or even in the opposite direction. Becoming angry with the autistic person will only make the autistic person avoid them. Due to sensory and attention differences, it can be hard for some autistic people to focus on a conversation. The autistic person is not ignoring other people; they may be struggling to take part in the interaction at all. Teach others to make it clear when they want to talk to the autistic person. The person should be physically close, use the autistic person's name, and preferably be in the autistic person's line of sight. If the autistic person doesn't react when addressed, try again, because they may not have noticed."
    },
    {
      "title": "Make it clear that some autistic people are nonspeaking.",
      "content": "Make it clear that some autistic people are nonspeaking. They may communicate through sign language, picture charts, typing, body language, or behavior. Explain that just because someone does not talk, it does not mean that they cannot understand speech, or that they have nothing to say. Some people will talk about a nonspeaking autistic person like they aren't in the room. But it's very likely that the autistic person can hear them, and will remember what is said. Remind them that \"talking down\" is always considered condescending. Nonspeaking autistic people should be treated like peers of the same age. Many nonspeaking autistic teens and adults use social media, blogging, or essays to write about what their lives are like."
    },
    {
      "title": "Note that the autistic person may not understand sarcasm, humor, or tone.",
      "content": "Note that the autistic person may not understand sarcasm, humor, or tone. They have a hard time understanding different tones of voice, particularly when the facial features of the person talking do not match the tone of voice. It's good to be extra clear. When explaining this difficulty, you could liken it to the use of emoticons in texts. If a person were to text you “Well that’s just great”, you may assume that the person is being sincere. However, if the person uses an emoticon like “:-P” along with the text, which stands for someone sticking their tongue out, you would interpret the text as being sarcastic. Autistic people can learn to understand figurative language. Some are quite well-versed in the nuances of sarcasm and humor."
    },
    {
      "title": "Help the person to understand that autistic people may show empathy differently.",
      "content": "Help the person to understand that autistic people may show empathy differently. That doesn't mean they have no empathy or kindness. Autistic people are usually very caring people who just struggle with mind-reading. Remind the person you are explaining autism to that many autistic people show empathy differently. Non-autistic people may think the person is being insensitive when really they either don't understand or are being misunderstood. Explain that it's best to be clear about how you are feeling. For example, an autistic person might not understand why you are looking down, but if you tell them that you're feeling sad because your dad is upset with you, they will have a better idea of how to respond to you. Autistic people may not \"know what to say\" but instead go to great lengths to do things that help others. Lacking empathy doesn't make someone a bad person. Some autistic people do lack empathy, all this means is that they struggle to feel what someone else is feeling, it doesn't mean that they don't care."
    },
    {
      "title": "Tell the person about the intense passions that accompany autism.",
      "content": "Tell the person about the intense passions that accompany autism. Many autistic people are deeply passionate about a few specific subjects, and could talk about them for great lengths of time. These interests are healthy and should be encouraged. Talking about the autistic person's special interests can be a great way to connect with them. Some people might think this is rude, but since autistic people can have trouble figuring out what others are thinking, they don't always know when someone is disinterested. Some autistic people are overly cautious about discussing their special interests, for fear of being rude. If that is the case with this person, they should be assured that it is okay to talk about their passions once in a while, especially if their conversation partner is asking questions about them."
    },
    {
      "title": "Express to the person that autistic people may not notice if someone is disinterested in a conversation.",
      "content": "Express to the person that autistic people may not notice if someone is disinterested in a conversation. If you wish to change the subject, or want to end the conversation, they may not realize that you are dropping hints. It is best to be politely direct. There's nothing wrong with saying \"I'm tired of talking about weather patterns. Can we talk about ____\" or \"I have to go now. See you later!\" If you know the person can be clingy, it may help to give a clear reason to leave, such as \"I need to go so I'm not late\" or \"I'm overwhelmed and need some quiet time by myself\" (something that many autistic people can understand )."
    },
    {
      "title": "Help the person to understand that autistic people have feelings like everyone else.",
      "content": "Help the person to understand that autistic people have feelings like everyone else. It is important for people to understand that autistic people feel love, happiness, and pain just like others do. Just because they may seem detached at times does not mean that they are devoid of feelings—in fact, many autistic people feel emotions very deeply. If the person has a hard time with surprises or bad news, try to break it gently, and then comfort them in a way that works for them."
    },
    {
      "title": "Explain that some autistic people cannot handle physical touch.",
      "content": "Explain that some autistic people cannot handle physical touch. This is due to sensory issues. Different autistic people have different sensitivities. To avoid upsetting someone, the easiest way is to just ask. Some autistic people enjoy physical touch. Many autistic people will happily hug close friends and family members. When in doubt, ask. Say \"Would you like a hug?\" or move slowly, where the autistic person can see you and has the chance to ask you to stop. Never come up from behind to touch them, because you may startle them to the point of panic. Don't assume that they'll always feel the same way. For example, maybe your friend likes hugs on a good day, but doesn't like them if he's overwhelmed or busy. Just ask."
    },
    {
      "title": "Explain that many autistic people struggle with sensory sensitivities, sometimes painful ones.",
      "content": "Explain that many autistic people struggle with sensory sensitivities, sometimes painful ones. An autistic person may get a headache from bright lights, or jump and begin to cry if you drop a dish on the floor. Remind the person about the autistic person's sensitivities, so they can help. Explain that it is okay to ask about the autistic person's needs in order to accommodate them. For example, \"Is this room too loud for you? Should we go somewhere else?\" Tell them to intervene if someone is bullying or tormenting the person. Some bullies will trigger sensitivities on purpose, like slamming cabinets to make the person jump or cry. If you see this happening, act quickly to protect the autistic person."
    },
    {
      "title": "Express to the person that it is easier to handle stimuli when the autistic person has warning to prepare.",
      "content": "Express to the person that it is easier to handle stimuli when the autistic person has warning to prepare. In general, autistic individuals handle situations better when they know what to expect, so express to the person that they should ask first before doing something that might startle the autistic person. [7] X Research source Example: \"I'm going to close the garage door now. If you want to leave the room or cover your ears, go ahead.\""
    },
    {
      "title": "Mention that the autistic person may fidget in unusual ways.",
      "content": "Mention that the autistic person may fidget in unusual ways. This is called self-stimulatory behavior, or stimming, because it stimulates the senses. Stimming can help with self-calming, focus, and meltdown prevention. Here are some examples of stimming: [8] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source Rocking back and forth Repeating words or noises (echolalia) Hand flapping Snapping fingers Jumping around and clapping in excitement Singing or humming to themselves"
    },
    {
      "title": "Emphasize that stimming is important for an autistic person's well-being.",
      "content": "Emphasize that stimming is important for an autistic person's well-being. Similar to routines, stimming can create a sense of safety and predictability. For instance, an autistic individual may hop in one spot repeatedly. They may also play the same song over and over, or draw the same picture. Repetitive behaviors help them being comfortable. [9] X Research source [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It is never okay to shame an autistic person for stimming, or try to force them to stop. If an autistic person is stimming in a harmful way (e.g. head-banging or biting themselves), the other person can gently redirect them to something safer ."
    },
    {
      "title": "Encourage patience and acceptance.",
      "content": "Encourage patience and acceptance. Autistic people don't choose to struggle with different things. They're doing their best in a world that's built for non-autistic people and rarely tries to meet them halfway. But if people are willing to make time and space for them, they can show the good parts of who they really are. Autistic people often make lots of accommodations for non-autistic people: doing small talk, putting effort into facial expressions, making or faking eye contact, heavily analyzing conversations, reducing stimming, putting up with tough sensory environments... It's hard and they could use a break."
    },
    {
      "title": "Recognize that most kids can handle this.",
      "content": "Recognize that most kids can handle this. It is important to be honest with a child, particularly if they are autistic, or are wondering about an autistic friend. However, you also don't want to overwhelm them. Keep your explanation as simple as it needs to be. If your child is autistic, it's good to start young. It can be stressful to feel like you are different, but no one will tell you why. Young children can hear something as simple as \"You have a disability called autism, which means your brain works a little differently. That's why you have therapists to help you, why it's hard to talk sometimes, and why you love learning about seashells so much.\""
    },
    {
      "title": "Talk about the good parts of autism as well as the hard parts.",
      "content": "Talk about the good parts of autism as well as the hard parts. Let them know that autism is a difference in ability, not a disease to be sad about, and that it is okay to be autistic. Older children may benefit from being introduced to the concept of neurodiversity and the disability rights movement. Encourage a child to see the good in an autistic friend, sibling, or classmate. For example, \"Yes, Lola does have a hard time talking and dealing with big emotions sometimes. I've noticed that she's sweet, and good at art. What do you think Lola is good at?\" Help your autistic child to understand that their differences make them unique and special. Explain the strengths of autism: strong sense of logic and ethics, compassion, deep passions, focus, loyalty, and desire to help (social responsibility)."
    },
    {
      "title": "Encourage an autistic child.",
      "content": "Encourage an autistic child. Make sure you encourage them, telling them that their autism makes them different but not lesser. Your child can still comfortably take part in school and home activities and lead a happy life. Help them understand that autism isn't only responsible for their struggles, but for some of their best traits too. This helps them not feel sorry for themselves and recognize their strengths. Let them be themselves around you. Let them stim, love their special interests, and be quirky. It's healthy for them not to need to pretend."
    },
    {
      "title": "Make sure to express your love for your autistic child.",
      "content": "Make sure to express your love for your autistic child. Always tell your child how much you love and care for them. It's important to have proper support, particularly when facing a life with a disability, and with help your child can live a happy, productive life."
    }
  ]
}