{
  "url": "https://www.wikihow.com/Fake-Your-Identity-Online",
  "title": "How to Fake Your Identity Online",
  "steps": [
    {
      "title": "Make sure your reasons are good.",
      "content": "Make sure your reasons are good. It's okay to use a fake identity to protect yourself or have fun without offline consequences—but only if you're not hurting anyone or breaking laws. This should be a way to stay safe, not a way to trick people or cause harm. Here are a few legitimate reasons to create a fake identity: To stay safer online To be open about part of your life (such as LGBTQ+ identity, mental illness, or disability) without it being linked back to you offline So you can share things without them coming up when an employer searches your name online To enjoy yourself online without a controlling relative watching"
    },
    {
      "title": "Don't do anything that's disrespectful or too difficult.",
      "content": "Don't do anything that's disrespectful or too difficult. For example, don't pretend to be a biologist if you don't understand biology, [1] X Research source and don't pretend to be a black person if you're white. Your identity should be created respectfully, and it should involve things you're comfortable discussing. Don't pretend to know a lot about something you don't understand. If a real expert comes along, you could end up embarrassing yourself. Stick to things you actually know. Pretending to be a member of a minority group that you aren't part of can feel insulting to them. [2] X Research source You could make a lot of people very upset with you if they found out. Don't pretend to have an illness or disability that you don't have in real life. That's not fair to people who do live with these things."
    },
    {
      "title": "Build a basic identity.",
      "content": "Build a basic identity. Choose something that you understand (such as pretending to live in the western US if you used to live there) that you can reasonably pretend to be. If you want a few extra random traits, try fakenamegenerator.com and refresh it once or twice to get something you like. Name and age Appearance (hair and eye color, height, build) Birthday Family and pets General region (keeping time zone in mind) General life history Career or field of study Personality traits and interests (similar, but not exactly the same as your own)"
    },
    {
      "title": "Make a new email address to use while creating social media accounts.",
      "content": "Make a new email address to use while creating social media accounts. Some websites (like WordPress) make it possible for people to see your email address, so it's best to use something not associated with your real name. Put in your fake name as the name associated with the account. You can make an email address related to your fake name (like violinistjane42) or make it random."
    },
    {
      "title": "Recognize how strict the website is and how much info gets shared.",
      "content": "Recognize how strict the website is and how much info gets shared. Consider avoiding the stricter websites and looking for sites that don't police people's identities too much. Secret identities are more common on sites like Tumblr as opposed to Facebook and LinkedIn. For example, WordPress will share your email address and IP address to any website you comment on. [4] X Research source Consider using a VPN."
    },
    {
      "title": "Pick a good profile picture.",
      "content": "Pick a good profile picture. Make sure that its style and content are different from the profile picture you use in real life. You can use the same picture across multiple platforms. A cartoon drawing (made with Picrew or another profile picture creator) resembling what your fake identity looks like A face from the website This Person Does Not Exist [5] X Research source (Refresh the page until you get a believable image that matches the right demographic) A very generic, zoomed-in photo of a flower, cloud, or other generic nature item"
    },
    {
      "title": "Try a different writing style.",
      "content": "Try a different writing style. Consider changing your attitude, style, vocabulary, and attention to grammar. Here are some examples of different ways to write the same thing: \"man dats bunk dude. i mean really dats sum major bull rite there. you wanna know what i think? he should be locked the heck up\" \"Wow. I can't believe that... That's not right. I think he should be thrown in jail.\" \"Well, I am astonished to hear that. What this man did was unbelievable, and in my opinion, he should be sent to prison.\""
    },
    {
      "title": "Keep track of the story you tell.",
      "content": "Keep track of the story you tell. This can help you avoid inconsistencies. Try creating a document where you track your fake identity's story. Relationship status Family and friend stories Life at work or school"
    },
    {
      "title": "Behave according to your online self's interests.",
      "content": "Behave according to your online self's interests. For example, if you tell people that you love cute animals, it wouldn't hurt to occasionally share pictures or videos of cute animals. Talk about and share content relevant to the things that your online self likes. It's more fun if your online self likes some of the same things that your real-life self does."
    },
    {
      "title": "Try saying you're cautious about privacy.",
      "content": "Try saying you're cautious about privacy. Many people don't want to push others to reveal something that they're uncomfortable sharing. You can tell people that you're shy about showing your face, sharing your location, or other things. Here are a few examples of things you can say: \"I'm not comfortable sharing my face online. That's why I like using avatars I made on Picrew.\" \"I don't like to share details of my location on the internet for safety reasons. Even if I trust you, I know there are hackers and people with bad intentions. I feel better being cautious.\""
    },
    {
      "title": "Avoid posting photos.",
      "content": "Avoid posting photos. Photos (even generic ones) could include recognizable landmarks. Photo metadata includes data about the phone or camera you used. If you think it's important to show a photo, remove the metadata first."
    },
    {
      "title": "Try a few extra measures to make yourself different.",
      "content": "Try a few extra measures to make yourself different. Changing up your habits under the fake identity will help make yourself look different. Pick a few favorite things that don't match up with who you really are. For example, if your favorite color is purple in real life, then pretend it's blue online. Use a different browser. For example, if you usually use Firefox under your real name, try using Chrome for your fake identity. Pick different favorite hangouts. For example, if you prefer Twitter and Facebook under your real name, maybe you'd prefer to use Tumblr and Instagram under your fake name. Use a VPN to hide your IP address. (If anyone mentions your IP address, just say \"I use a VPN for extra security\" and leave it at that.)"
    },
    {
      "title": "Block anyone who starts asking too many personal questions.",
      "content": "Block anyone who starts asking too many personal questions. Friends ask questions about each other, but they also respect boundaries and wouldn't want to make you uncomfortable. Block and ignore someone who pressures you to discuss: Where you live, work, or go to school Your real name Anything sexual"
    },
    {
      "title": "Try being honest if you get called out.",
      "content": "Try being honest if you get called out. Share your motivations and let people know why you're trying to stay private. If you clarify that you're trying to be safe, instead of trying to trick them, they might be understanding. For example: [7] X Research source \"I use a fake identity because my parents are controlling and it would be dangerous if they found out I'm queer. I know it's ironic, but a fake name makes it safe for me to be my real self.\" \"Yes, I realize I was inconsistent. I change a few personal details because I'm using a fake name. If I were found out, I could be outed as autistic under my real name and it could affect my job prospects. I promise I'm being genuine about the real things. Changing some details helps me stay safe.\" \"My parents tell me to always be careful online, so I decided to use a fake name for extra safety.\""
    }
  ]
}