{
  "url": "https://www.wikihow.com/Cope-With-Gender-Dysphoria",
  "title": "How to Deal With Gender Dysphoria: Mental Health, Gender Expression & Medical Treatments",
  "steps": [
    {
      "title": "Express your emotions through writing, art, and other outlets.",
      "content": "Express your emotions through writing, art, and other outlets. Find an outlet that allows you to vent your feelings and release the negative emotions. Pick something that aligns with your interests; for example, if you like to write, try journaling or blogging about your experiences. If you’re artistic, express yourself through art projects. If you play an instrument, make music that reflects your true feelings. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Others prefer to channel their emotions through exercise. Do physical activities like yoga , running, and biking. Try hobbies like horseback riding or swimming as well. Exercise is proven to boost your mood and help you feel calmer. Venting your emotions is cathartic! You can relieve stress and express yourself by channeling your negative energy into something productive. If you’re unsure where to start, just drawing or writing whatever comes to your mind on paper (however dark) can help."
    },
    {
      "title": "Reaffirm your gender with positive affirmations.",
      "content": "Reaffirm your gender with positive affirmations. Recite daily affirmations to remind you to stay true to yourself and love the person that you are. Affirmations can help you start your day with a positive mentality. They’ll also make you feel more confident, even if you’re not ready to show the rest of the world who you are yet. [2] X Research source Examples of positive daily affirmations include: “My gender identity is valid, and so am I.” “My body does not define my gender or who I really am.” “I am important and worthy of happiness.” You can also affirm your identity by making small but positive changes like styling your hair differently, wearing a new accessory, or telling someone your name and pronouns."
    },
    {
      "title": "Practice self-care and make time for things you enjoy.",
      "content": "Practice self-care and make time for things you enjoy. Whether you watch a favorite show, play a game, listen to music, bake, or do something else, set aside time every day for an activity that makes you happy. Pamper yourself with regular self-care, too; eat food you enjoy, take a relaxing bath, or wear your comfiest clothes and cuddle up with a book. [3] X Research source Doing things you love provides a healthy escape that can reduce your feelings of dysphoria. Other healthy self-care habits include eating a balanced diet and getting enough sleep every night."
    },
    {
      "title": "Stimulate your senses as a distraction if you start feeling dysphoric.",
      "content": "Stimulate your senses as a distraction if you start feeling dysphoric. Stimulating your senses is a great way to reduce anxiety! Look for things you enjoy that you can smell, taste, touch, see, and hear. If you’ve been feeling anxious lately, keep something on hand that you can use to stimulate your senses in a pinch. When you experience extreme dysphoria, keep exercising your senses until you feel calm again. [4] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source For example, you might smell a favorite perfume, listen to calming white noises, touch a soft blanket you love, or look at a cute picture of your favorite animal. There are other ways to fend off an intense dysphoria attack. Try meditating or practicing deep breathing exercises to calm yourself down."
    },
    {
      "title": "Develop self-help strategies to help reduce your dysphoria.",
      "content": "Develop self-help strategies to help reduce your dysphoria. First, identify everyday things that make your dysphoria more intense. Then, find clever ways to reduce those feelings or avoid them entirely. For example, if looking at yourself in the mirror feels painful one day, turn on the shower and steam up the room, or cover the mirror with a towel. Other strategies include: [5] X Research source Learn to contour your face with makeup. [6] X Research source Snuggle up to a pillow so it covers your chest while you sleep. Put on a large, shapeless sweater that covers your body’s curves. Use a large loofah or sponge to bathe with."
    },
    {
      "title": "Steer clear of triggers that might make the dysphoria worse.",
      "content": "Steer clear of triggers that might make the dysphoria worse. People who don’t respect your identity aren’t worthy of your time. More importantly, being around them can quickly trigger your dysphoria. Start by setting boundaries: tell those people how you prefer to be addressed and why it’s important. If they don’t listen, reduce the amount of time you spend around them as much as possible. [7] X Research source Say something like, “I identify as a woman, and my name is Jean. When you call me Mike, it makes me feel depressed and unwelcome. I’m asking you to call me Jean and not misgender me anymore.” You might encounter people who deadname or misgender you, unknowingly or on purpose. You can’t always predict it, but you’re certainly allowed to avoid situations where you know it’ll likely happen. For example, a clerk deadnaming you at the bank might be beyond your control, but you can choose to skip a family dinner if you know that your transphobic cousin will be there."
    },
    {
      "title": "Be proud of yourself and embrace your hopes for the future.",
      "content": "Be proud of yourself and embrace your hopes for the future. Dealing with gender dysphoria is never easy, but it can help to reflect on how far you’ve come. You’re here, and that’s an amazing accomplishment in itself! Have faith in yourself and your ability to keep pushing forward. Remind yourself that you’re not alone, you’re stronger for having come this far, and one day you’ll feel like the person you want to be. [8] X Research source Try making a list of things you’re hoping for in the future. It will help you have hope in your daily life. Listen to someone who has been through a similar experience to yours or read stories from transgender and nonbinary people online who have suffered from dysphoria and triumphed. You’ll get a dose of inspiration."
    },
    {
      "title": "Build a support network of friends or family members.",
      "content": "Build a support network of friends or family members. It can help to know there’s someone you can trust to listen to you and understand what you’re feeling. It’s also a huge stress relief to express yourself and talk to someone freely. Establish connections with trusted friends and family who know the real you and accept you wholeheartedly, and confide in them when your dysphoria gets you down. Not everybody has the luxury of an accepting family, and while it’s not fair, it also doesn’t mean you can’t build a support network. Look for trans, nonbinary, or genderfluid online communities to make connections! You might be surprised by the number of people looking for others to talk to about their dysphoria. As lonely as you feel, many other trans people feel the same."
    },
    {
      "title": "Go to therapy or find a support group.",
      "content": "Go to therapy or find a support group. A therapist can provide a safe space to discuss your dysphoria and emotions while giving you additional tools and strategies to help you cope. If a therapist is outside your means (or if you’d like additional help), try attending peer support groups that specifically deal with dysphoria and other LGBTQ+ issues. If you look for a new therapist, choose one who specializes in transgender experiences or is at least trained to help LGBTQ+ clients. Talking to outsiders or a professional can help you gain perspective while allowing you to talk freely about your problems without worrying about their feelings on the matter. Only talk to someone—be it a friend, family member, support group member, or counselor—when you feel safe and comfortable doing so."
    },
    {
      "title": "Wear clothing that makes you feel comfortable and confident.",
      "content": "Wear clothing that makes you feel comfortable and confident. Your appearance can have a huge effect on how intense (or manageable) your dysphoria is on a daily basis. Stock up your wardrobe with clothing that affirms your gender identity and helps you feel more at home in your body, and wear them regularly. [9] X Research source If you don’t feel safe wearing gender-affirming clothes in public yet, do so when you’re at home alone. Alternatively, wear a piece of gender-affirming clothing under your everyday clothes. Learn how to dress for your body type and accentuate or conceal certain body parts as desired. For example, long shirts hide your hips while short ones enhance them. Since stores carry clothing fitted for cis bodies, consider having your clothes tailored to fit your body better, or learn to use a sewing machine and tailor them yourself!"
    },
    {
      "title": "Look for gender-affirming items that help your self-expression.",
      "content": "Look for gender-affirming items that help your self-expression. Use binders , packers , STPs (stand-to-pee devices) , and prosthetics for sex to help you present more masculine. Breast forms, panty girdles, and padded underwear can help you appear more feminine—as can learning to tuck . Regardless of gender identity, things like wigs or haircuts can also help your presentation. [10] X Research source While you can’t wear these items all the time, they can help you with dysphoria in public or other short-term situations. These items can be expensive, but they’re a good investment because they’ll dramatically affect your appearance (and self-esteem). You can also buy some of these second-hand for a reduced price."
    },
    {
      "title": "Take your time and explore your gender in whatever way feels right.",
      "content": "Take your time and explore your gender in whatever way feels right. It's easy to pressure yourself to present yourself the way other people want you to when there are so many beauty standards and stereotypes. Let go of stereotypes and focus on what makes you happy! Remember: there’s no rush to figure out what you like. Experiment with different styles until you find something that feels like you. [11] X Research source Remind yourself that nobody has control over things like body shape and bone structure. People come in all shapes and sizes! Accept your body and focus on the things you can change."
    },
    {
      "title": "Get a medical evaluation from a doctor experienced in transgender care.",
      "content": "Get a medical evaluation from a doctor experienced in transgender care. For some people, changing their outward appearance isn’t enough to get rid of dysphoria. The first step is getting a medical evaluation if you feel you need medical treatment for your dysphoria. Your doctor can formally diagnose the dysphoria and devise a treatment plan that works for you. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Medical treatment for gender dysphoria usually means hormone therapy or gender reassignment surgery (or both). As part of the evaluation, your doctor will also ensure you don’t have any other medical conditions that might affect the treatment. Expect a physical exam and lab tests. Your doctor will also need to establish your medical history and any harmful treatments you may have tried in the past (like self-surgery or unprescribed hormone use)."
    },
    {
      "title": "Consider either feminizing or masculinizing hormone therapy.",
      "content": "Consider either feminizing or masculinizing hormone therapy. Hormone therapy induces changes to help your body match your gender identity. Feminizing hormone therapy involves blocking your body’s testosterone while taking estrogen to develop feminine secondary sex traits, while masculinizing hormone therapy does the exact opposite. Talk to your doctor about hormone therapy if you feel it would help. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Your doctor can also help you weigh the risks and benefits of gender-affirming hormone therapy, so you can decide if it’s right for you. You can decide how much change you want from hormone therapy! Some might want to become as feminine or masculine as possible, while others might only want to minimize certain traits like breasts or facial hair."
    },
    {
      "title": "Explore surgeries to change your face, chest, and genitalia.",
      "content": "Explore surgeries to change your face, chest, and genitalia. Gender reassignment surgery is actually a series of procedures that can help you transition to your self-identified gender. Facial reconstructive surgery can make your face look more feminine or masculine; chest (or “top”) surgery can remove or enhance your breast tissue; genital (or “bottom”) surgery can transform and reconstruct your genitalia. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Discuss all the possibilities with your doctor to figure out the best course of action. Remember that you can do as much or as little as you want—just because you do a single surgery doesn’t mean you need all of them. You (and only you) get to decide what changes your body needs to feel complete. Surgery is only one of many ways to change your gender presentation. It’s tremendously helpful and even life-saving for many trans people, but you don’t need it to socially transition."
    },
    {
      "title": "Use vocal and communication therapy to change your voice.",
      "content": "Use vocal and communication therapy to change your voice. If the sound of your voice triggers dysphoria, consider getting voice therapy. It will help you adjust both the pitch and pattern of your voice; you’ll learn speech patterns that suit your true gender, so your voice will sound closer to the way you want it to. You can start the process on your own! Read aloud to yourself (or sing) and try to sound more masculine or feminine while speaking. Use a voice pitch analyzer app to check your pitch and speaking pattern. Testosterone will naturally lower your voice to a male range, but estrogen for trans women won't do the same—so this practice is helpful even if you haven’t started hormone therapy yet!"
    },
    {
      "title": "Make a plan to tackle coming out and transition goals if you have them.",
      "content": "Make a plan to tackle coming out and transition goals if you have them. Research everything you’ll need to make your transition official. This can include changing your name legally , and deciding how to come out, whether you want to come out as transgender or socially transition as a nonbinary person. If you want to transition medically, look for a GP (general practitioner) doctor who can help you as well. [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source You don’t necessarily have to transition as a part of coping with gender dysphoria. While many trans and nonbinary people transition in some way, it’s just one solution; there are many other methods of coping."
    }
  ]
}