{
  "url": "https://www.wikihow.com/Fix-a-Broken-Car-Horn",
  "title": "How to Fix a Broken Car Horn",
  "steps": [
    {
      "title": "Determine the problem with your horn.",
      "content": "Determine the problem with your horn. Identifying the type of broken car horn you have will help you decide how to approach the fix."
    },
    {
      "title": "Pop the hood and have someone press the horn if it is sounding at low volume.",
      "content": "Pop the hood and have someone press the horn if it is sounding at low volume. Many cars have 2 or more horns. If the sound of the horn is low when you press it, 1 or more of the horns has stopped working."
    },
    {
      "title": "Locate the horn or horns on the radiator core support or behind the car's grille.",
      "content": "Locate the horn or horns on the radiator core support or behind the car's grille."
    },
    {
      "title": "Remove the wire connector.",
      "content": "Remove the wire connector. The horn should resemble a fuse with wires coming out of it. To remove the wire connector, press down on the lower end of the connector and then pull the wiring out. Remove the mounting bolt and the spade lugs, which are attached to the wiring. Clean the components and then reattach them. Ask your helper to honk the horn again. [1] X Research source"
    },
    {
      "title": "Purchase a replacement horn if cleaning the horn parts does not fix your reduced sounding car horn.",
      "content": "Purchase a replacement horn if cleaning the horn parts does not fix your reduced sounding car horn. You may choose to replace the broken horn with the exact horn originally installed in the car or you may choose a universal car horn. [2] X Research source"
    },
    {
      "title": "Check the fuse box if your horn will not make any sound.",
      "content": "Check the fuse box if your horn will not make any sound. Read your owner's manual to find the location of your car's fuse box. Your owner's manual will also inform you of the specific fuse connected to the operation of the car horn. [3] X Research source"
    },
    {
      "title": "Remove the fuse with a pair of tweezers, needle-nosed pliers, or a pair of regular pliers.",
      "content": "Remove the fuse with a pair of tweezers, needle-nosed pliers, or a pair of regular pliers. You may also be able to remove the fuse with your fingers. Your fuse has failed if the metal strip inside it is broken. [4] X Research source"
    },
    {
      "title": "Replace the fuse if it is faulty.",
      "content": "Replace the fuse if it is faulty. You can purchase replacement fuses from an auto supply store. Install the appropriate fuse and then have your helper try the horn again. [5] X Research source"
    },
    {
      "title": "Check to see if the airbag light is illuminated on the dashboard if there is no problem with your fuse.",
      "content": "Check to see if the airbag light is illuminated on the dashboard if there is no problem with your fuse. [6] X Research source A problem with the airbag can result in a malfunctioning horn. If the airbag has expanded, it may be interfering with the component called a clock spring that allows power to reach the horn button from the relay coil which connects to the horn itself."
    },
    {
      "title": "Take your vehicle to a professional mechanic if the airbag light is illuminated.",
      "content": "Take your vehicle to a professional mechanic if the airbag light is illuminated. If your airbag has expanded, a professional mechanic will need to remove and then properly reinstall the airbag. A mechanic can determine other possible issues with your horn if you have been unable to isolate the problem."
    }
  ]
}