{
  "url": "https://www.wikihow.com/Exercise-to-Lose-Belly-Fat",
  "title": "How to Exercise to Lose Belly Fat",
  "steps": [
    {
      "title": "Walk it off.",
      "content": "Walk it off. Walking is a great way to burn fat and work your abdominal muscles. Walk for 30 minutes at least 5 times a week. To burn the most calories, tighten your abdominal muscles while you're walking. Walk at a brisk pace, where you can talk normally but would have trouble singing, and don't forget to swing those arms! [2] X Research source If you need to, start out with shorter walks and work your way up to 30 minutes."
    },
    {
      "title": "Take off running to burn fat quickly.",
      "content": "Take off running to burn fat quickly. If walking seems a bit slow to you, move up to running. Running can burn as many as 600 to 1,000 calories per hour, and best of all, you don't have to hit the gym to run. If you want to increase the intensity, try running up hills. [3] X Expert Source Laura Flinn NASM Certified Personal Trainer Expert Interview. 18 November 2019."
    },
    {
      "title": "Hop on a rowing machine to get your heart pumping.",
      "content": "Hop on a rowing machine to get your heart pumping. Rowing is a great all-body workout, and it gets your blood pumping. Plus, rowing often works muscles that your body isn't accustomed to using, which means it can help ramp up your metabolism. [4] X Research source"
    },
    {
      "title": "Cycle your fat away.",
      "content": "Cycle your fat away. Whether you jump on your bike or hit a cycling class at the gym, cycling is also a great way to burn fat. A cycling class can help you increase your intensity to ensure you're burning as much fat as you can, but you may find it easier to incorporate riding a bike into your routine. For instance, you could bike to work instead of taking your car."
    },
    {
      "title": "Swim laps for an all-body workout.",
      "content": "Swim laps for an all-body workout. Swimming is a great full-body workout, and you can burn up to 750 calories per hour. Try swimming for 30 to 45 minutes 4 or 5 times per week to get the full benefit. If you're just starting out, start out with 10 laps of 50 metres (160 ft) each. You can rest for about half a minute between laps. Add 100 to 200 metres (330 to 660 ft) per week."
    },
    {
      "title": "Row with intensity training.",
      "content": "Row with intensity training. On the rowing machine, row steadily for 20 seconds, and then rest for 10. As you rest, stay on the machine with your legs and arms in place. On the next 20 seconds, try to beat your last 20 seconds. Keep going for 8 rounds of 20 seconds of rowing and 10 seconds of rest. With each round, work on beating your last distance. Finish up by rowing for 500 meters. [5] X Research source"
    },
    {
      "title": "Sprint using HIIT.",
      "content": "Sprint using HIIT. As an example of a HIIT routine, you could run and coast at given intervals. For instance, you can run for 40 yards all-out, then slow down for 40 yards. Rest for half a minute and begin again. Alternatively, you can run for 30 seconds and rest for 1 minute and 15 seconds, repeating 10 times. [6] X Research source"
    },
    {
      "title": "Switch between muscle groups.",
      "content": "Switch between muscle groups. Typically with interval training, you work hard for a short period and then take a rest. However, another way you can do it is to switch between muscle groups without taking a rest. For instance, focus on an exercise that works your legs and then jump into an exercise that primarily works your arms. [7] X Research source For instance, try 30 seconds of pull-ups, doing as many as you can, followed by 60 jumping jacks and 20 burpees, then rest for 30 seconds. [8] X Research source"
    },
    {
      "title": "Try an abs interval workout.",
      "content": "Try an abs interval workout. Start with 50 crunches. Move on to a minute of bicycle crunches, followed by 15 situps. Switch to 15 knee raises and 20 oblique crunches on each side. End with 20 seconds of half burpees. [9] X Research source To do a regular crunch, lie on your back with your knees bent and your hands cupped behind your ears. Lift your upper back and shoulders up off the floor towards the ceiling as you pull your knees in toward your chest. Release to complete 1 rep. For a bicycle crunch, lean up slightly with your hands behind your head and your elbows out. Bring up one knee and bring the opposite elbow toward it, then do the other side. For a hanging knee raise, start by hanging off a pullup bar. Bring your knees up to your chest or as high as you can raise them, and then bring them back towards the floor, only lightly brushing the floor as you do. For oblique crunches, lay on one side with your knees bent a bit. Place the arm that's not next to floor behind your head. Lean up as if doing a normal crunch, and then return to the starting position. [10] X Research source For a half burpee, place your hands on the floor in front of you. Jump your feet backward and forward, from an almost pushup position to your feet up near your hands. Reader Poll: We asked 147 wikiHow readers which type of crunches they found most effective for building ab muscles, and 54% of them said elbow-to-knee crunches. [Take Poll]"
    },
    {
      "title": "Try side planks.",
      "content": "Try side planks. Planks work your core muscles, and side planks are even more effective, because you only have 2 points touching the ground. Start by laying on the floor on your side. Your elbow should be underneath you. [11] X Research source Lift your hips off the ground until your body is in a straight line. Hold that position for about half a minute or as long as you can. If you don't hit the 30 to 45 second mark, lift again until you do. Turn over and do the other side. If you have knee problems, you can modify the planks by resting your knees on the floor."
    },
    {
      "title": "Work on pushup walkouts.",
      "content": "Work on pushup walkouts. Start in a downward dog position with your palms flat on the floor and your body lifted off the ground. Your body should be slightly bent at your waist. Walk your hands forward into a pushup position, and then walk them back toward your feet. Repeat 10 times. [12] X Research source"
    },
    {
      "title": "Do bird-dogs.",
      "content": "Do bird-dogs. Begin on all fours on the ground, looking down. Extend one arm forward while you extend the opposite leg backward at the same time. Stay in this position for 5 seconds, keeping your back straight. Move to the other side, and repeat the whole process 5 to 10 times. [13] X Research source"
    },
    {
      "title": "Add reverse crunches.",
      "content": "Add reverse crunches. Lay on your back with your arms splayed out to the sides. Bring your knees up so that your thighs are perpendicular to the floor. Your calves should be parallel to the floor with your feet in the air. Gently lift your hips off the ground, contracting your abdominal muscles as you do. Inhale as you move your hips back down. Do about 10 repetitions. [14] X Research source"
    },
    {
      "title": "Try arms-up hops.",
      "content": "Try arms-up hops. Start with your arms at your side. Step forward with one leg. As you do, bring your other leg up. Bring your arms up above your head. Simultaneously, hop on the leg that's still on the ground. As you come back down, bring your feet together and your arms back to your sides. Do 20 reps, switching back and forth between your legs."
    }
  ]
}