{
  "url": "https://www.wikihow.com/Cope-with-Receiving-Anonymous-Letters",
  "title": "How to Cope with Receiving Anonymous Letters",
  "steps": [
    {
      "title": "Ignore the letter.",
      "content": "Ignore the letter. One way to deal with an anonymous letter is to ignore it. Some people do not believe that criticism passed through an anonymous platform is worth any attention. [1] X Research source However, notice the tone of the letter. While it is sensible to ignore a hateful letter, it is possible that someone is attempting to give you important information they otherwise feel unable to give you face to face. Getting upset by the contents of an anonymous letter gives the author power. If you have received anonymous hate, don't post about it on social media and try to call them out. Don't address the office, or send e-mails to people you know accusing them of sending you anonymous letters. This validates the anonymous sender because they realize they got to you. It may also cause the author to send you more messages if they know they have gotten to you. [2] X Research source"
    },
    {
      "title": "Dispose of the letter.",
      "content": "Dispose of the letter. Instead of keeping the letter, get rid of it. Throw it away, shred it, tear it up, burn it - whatever you feel you need to do. If you receive an anonymous e-mail or social media message, delete it. Holding on to the letter keeps it around, giving it power over your mind. If you toss it out, you also toss it out of your mind. If the letter contains false or potentially libellous or defamatory information, you could consider destroying the letter by shredding, tearing, or burning. However, it may be advisable to keep the letter in case you wish to show it to a lawyer or the authorities as evidence of threats or harassment. Bear in mind, however, that information would only be defamatory if it is not true."
    },
    {
      "title": "Ponder the contents of the letter.",
      "content": "Ponder the contents of the letter. Take some time to examine what the letter said. Ask yourself: Why would someone send this to me? For example, people who find out about an affair often want to let the betrayed partner know but are worried about 'shooting the messenger. ' If you receive a letter like this, try not to dwell on who wrote the letter but look at the details provided and think about whether the information could be true. If the letter contains criticism of your personality, appearance, or work habits, confront those criticisms. Do they have any merit? Is there something you can learn from this anonymous letter and change about yourself? Can you take this as a wake up call in some way? [3] X Research source"
    },
    {
      "title": "Try to figure out who sent the letter.",
      "content": "Try to figure out who sent the letter. If you really want to get to the bottom of who sends you an anonymous letter, try to figure out who sent it. Narrow it down by the subject of the letter - if it's about work, the letter more than likely came from a co-worker. If it's about your barking dog, the letter is probably from a neighbor who lives nearby. If it's more general, try to decide who might have a problem with you or something you have done. Have you had any confrontations or disagreements with someone recently? Are you in a high-profile position in your company, community, or other organization that might make you a target for criticism? [4] X Research source Sometimes, clues about the writer's identity can be found in the letter itself. Look at the grammar and mechanics usage. Analyze the language being used; sometimes this might help you decide if the person is older or younger, or even what profession they might have. Are there signature words used in the letter that may help lead you to the author? Did they sign it with a nominative like \"A friend,\" \"A concerned neighbor,\" or \"An angry mother\"? These aren't foolproof ways of discovering the identity, but it might help you get started. Often, the senders of anonymous hate are people close to you, like friends, family members, co-workers, neighbors, and people in the same organizations."
    },
    {
      "title": "Determine the seriousness of the letter.",
      "content": "Determine the seriousness of the letter. Evaluate if the letter is random, generic hate, or a serious anonymous allegation that needs to be addressed. This might be especially important if you receive an anonymous letter related to your place of employment. Decide if the letter is outlining something serious enough to be addressed. Think about the specifics of the letter. Does it name times, dates, and specific details? This might give the letter some credit; however, it could also be falsified information. Is there a reason this information might be sent through an anonymous letter instead of in person? Would the writer of the letter risk harm, ridicule, or negative consequences if they came forward? Is the language abusive, hateful in nature, or overly negative and critical? If so, this might be a spiteful, angry letter that doesn't need to be taken seriously. [5] X Research source"
    },
    {
      "title": "Confront the problem.",
      "content": "Confront the problem. In some instances, the letter might accuse people of doing something that you can't forget. You have two options in this scenario: forget what you read or confront the person. Make sure to listen carefully and openly to what they say without your own prejudices based on the contents of the letter. However, look for any inconsistencies in behavior or signals that they may be eluding the truth. The exception to this rule is if you get a letter accusing your spouse of cheating on you. In such a scenario, it is usually recommended that you do NOT raise the issue with your spouse while you quietly look into the matter carefully, so they do not cover their tracks. It is relatively easy to deceive a trusting partner, and sometimes an anonymous letter is the first sign that there might be cause for you to investigate further. [6] X Research source"
    },
    {
      "title": "Talk to a trusted friend.",
      "content": "Talk to a trusted friend. If you got a letter that has bothered you, share it with someone you trust. This person can help give you insight on the contents. If the letter contains hateful criticism and words directed to you, they can help you objectively evaluate if there is any validity in the criticisms. If the anonymous letter accuses someone of something, they might be able to help you determine if it is serious enough to pursue. If the letter suggests some action be taken, they can help you evaluate that, too."
    },
    {
      "title": "Reach out to those in authority.",
      "content": "Reach out to those in authority. If you receive anonymous letters that are a cause of concern, or you repeatedly receive anonymous hate, you may want to ask for help from an authority figure. Contact your local police department if you feel threatened by the letters. [7] X Research source If you involve the police, you will need to keep the letters as evidence. Some states may have laws against anonymous threatening that could help you. If you experience anonymous threats at work, go to your immediate boss or supervisor. They can help you figure out what course of action to take. If you are a youth who is receiving anonymous cyberbullying, talk to your parents, teachers, police officers, or other trusted adults. Schools can help with cyberbullying, and if that doesn't work, try contacting one of the cyberbullying help websites, like End Cyberbullying, Cyberbully Help, or Stop Bullying. [8] X Research source [9] X Research source [10] X Trustworthy Source StopBullying.gov Website run by the U.S. Department of Health and Human Services providing information related to identifying and preventing bullying Go to source"
    },
    {
      "title": "Obtain the author's location.",
      "content": "Obtain the author's location. Sometimes, both physical and electronic letters provide clues to the author's location. If the letter was sent through the mail, check to see if there is a postmark with a city or zip code on it. If the letter was sent electronically, attempt to locate the e-mail's IP address . If the letter was dropped in your mailbox, the person may live in your neighborhood. To view this information in an email, turn on the advanced header. This can be found by opening the e-mail, then clicking on the feature to show more from the e-mail. Look for an option to \"show original,\" \"view full header,\" or \"view message source.\" From there, type the IP address location into Google and use the multiple services shown to obtain a locality."
    },
    {
      "title": "Block the sender.",
      "content": "Block the sender. If you are receiving anonymous letters via e-mail or social media, block the sender. Social media sites like Facebook and Twitter have block functions so you can block the user. Most e-mail providers allow users to block e-mail addresses so they can't receive e-mails, or have options to mark the e-mail address as spam so it gets filtered out. [11] X Research source If you are receiving hate from any social media account, even an anonymous fake account, report them as breaking terms of service. Most social media accounts have guidelines against threatening messages."
    }
  ]
}