{
  "url": "https://www.wikihow.com/Crop-a-Picture-in-Word",
  "title": "How to Crop a Photo in Word: 4 Quick & Easy Ways",
  "steps": [
    {
      "title": "Insert the picture into Microsoft Word.",
      "content": "Insert the picture into Microsoft Word. Open your Microsoft Word document. If you don't already have a picture added , click the Insert tab at the top and select Pictures . You can select a picture from your device, a stock image, or an image from the web. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select the picture.",
      "content": "Select the picture. If it isn't already selected, click it to select it. The Picture Format tab should open at the top."
    },
    {
      "title": "Click Crop.",
      "content": "Click Crop . This is in the Size section of the Picture Format tab. Black lines should appear around the image. If you click the down-arrow instead, select Crop from the drop-down menu."
    },
    {
      "title": "Adjust the picture's crop.",
      "content": "Adjust the picture's crop. Click and drag inward any of the black bars on the edges or in the corners of the picture to do so. To crop equally on two parallel sides at the same time, hold CTRL (Windows) or CMD (Mac) as you drag the cropping handle. The section inside of the black lines is what you'll keep after cropping."
    },
    {
      "title": "Press Esc to apply the crop.",
      "content": "Press Esc to apply the crop. You can also click anywhere outside of the picture. This will remove any section of the picture that falls outside of the black bars' limits. If needed, you can undo the crop by pressing CTRL + Z (Windows) or CMD + Z (Mac). Be sure to save your changes ."
    },
    {
      "title": "Insert the picture into Microsoft Word.",
      "content": "Insert the picture into Microsoft Word. Open your Microsoft Word document. If you don't already have a picture added, click the Insert tab at the top and select Pictures . You can select a picture from your device, a stock image, or an image from the web. Use this method to crop an image to fit a certain shape. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select the picture.",
      "content": "Select the picture. If it isn't already selected, click it to select it. The Picture Format tab should open at the top."
    },
    {
      "title": "Click the down-arrow below \"Crop\".",
      "content": "Click the down-arrow below \"Crop\". This is in the Size section of the Picture Format tab. A drop-down menu should open."
    },
    {
      "title": "Select Crop to Shape.",
      "content": "Select Crop to Shape . This is in the drop-down menu. Doing so prompts a pop-out menu with shapes."
    },
    {
      "title": "Select a shape.",
      "content": "Select a shape. Click the shape in which you want your picture to appear. This will immediately apply the shape to the picture."
    },
    {
      "title": "Adjust the shape's size.",
      "content": "Adjust the shape's size. Click and drag inward or outward any of the circular points around the picture's outline to decrease or increase the picture's size. If needed, you can undo the crop by pressing CTRL + Z (Windows) or CMD + Z (Mac). If the shape isn't applying the way you want, you can try [[#Adding-a-Picture-to-a-Shape |adding the shape first]] followed by the picture. Be sure to save your changes."
    },
    {
      "title": "Insert the picture into Microsoft Word.",
      "content": "Insert the picture into Microsoft Word. Open your Microsoft Word document. If you don't already have a picture added, click the Insert tab at the top and select Pictures . You can select a picture from your device, a stock image, or an image from the web. Using an aspect ratio crop is helpful if you need to resize the picture to fit a certain requirement, or if you want your pictures to be more uniform across the document."
    },
    {
      "title": "Select the picture.",
      "content": "Select the picture. If it isn't already selected, click it to select it. The Picture Format tab should open at the top."
    },
    {
      "title": "Click the down-arrow below \"Crop\".",
      "content": "Click the down-arrow below \"Crop\". This is in the Size section of the Picture Format tab. A drop-down menu should open."
    },
    {
      "title": "Select Aspect Ratio.",
      "content": "Select Aspect Ratio . This option is in the drop-down menu. Doing so prompts a pop-out menu to appear."
    },
    {
      "title": "Select a ratio.",
      "content": "Select a ratio. In the pop-out menu, click one of the aspect ratios you'd like to use to crop your picture."
    },
    {
      "title": "Adjust the crop selection.",
      "content": "Adjust the crop selection. Click and drag your picture around until you've centered the section you want to keep in the aspect ratio's square or rectangle."
    },
    {
      "title": "Press Esc to apply the crop.",
      "content": "Press Esc to apply the crop. You can also click anywhere outside of the picture. This will remove any section of the picture that falls outside of the black bars' limits. If needed, you can undo the crop by pressing CTRL + Z (Windows) or CMD + Z (Mac). Be sure to save your changes."
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. This is in the top toolbar."
    },
    {
      "title": "Click Shapes.",
      "content": "Click Shapes . You can find this in the Illustrations section of the toolbar."
    },
    {
      "title": "Select a shape.",
      "content": "Select a shape. You can use any shape within the drop-down menu."
    },
    {
      "title": "Draw your shape.",
      "content": "Draw your shape. Click one spot on the document and drag your cursor to create the shape. You can make it as big or small as needed. The shape will be created once you release the mouse button. If needed, resize the shape by dragging one of the outer circles inwards or outwards."
    },
    {
      "title": "Click the Shape Format tab.",
      "content": "Click the Shape Format tab. This is in the top toolbar. If you don't see it, double-click the shape."
    },
    {
      "title": "Click Shape Fill.",
      "content": "Click Shape Fill . A drop-down menu will open."
    },
    {
      "title": "Click Picture.",
      "content": "Click Picture . This is towards the bottom of the drop-down menu."
    },
    {
      "title": "Select the picture.",
      "content": "Select the picture. You can select a picture from your device, a stock image, or an image from the web. Once selected, click Insert . The picture will be added to the shape."
    }
  ]
}