{
  "url": "https://www.wikihow.com/Get-More-Lives-on-Candy-Crush",
  "title": "Easy Ways to Get More Lives in Candy Crush for Free",
  "steps": [
    {
      "title": "Connect your Facebook account.",
      "content": "Connect your Facebook account. If you link Candy Crush with your Facebook account, you can ask Facebook friends who also play to send you lives. Click the My Account button on the Candy Crush Saga home screen. Choose Continue with Facebook to connect Candy Crush with your Facebook account. If you’ve been connected to Facebook on Candy Crush in the past, you may see a button that says Retrieve My Progress instead. Tap that, then select Continue with Facebook on the next screen. Follow the prompts to connect your account, then start playing. If you don’t want to bug your Facebook friends, you can also befriend other players in the King community and ask them for lives. [1] X Research source Tap Friends at the bottom of the screen, then tap the Add tab. Tap Add next to players in the Players with similar progress list."
    },
    {
      "title": "Tap your lives at the top of the screen.",
      "content": "Tap your lives at the top of the screen. To the left of your profile picture, locate the heart icon and tap on it."
    },
    {
      "title": "Select Ask friends.",
      "content": "Select Ask friends . This button is located in the card showing your current number of lives."
    },
    {
      "title": "Select the friend you want to ask and tap Request life.",
      "content": "Select the friend you want to ask and tap Request life . If you like, you can also tap Send life to send your friend a life! Keep in mind that if the friends you’re requesting lives from aren’t online, this method isn’t necessarily faster than waiting for your lives to refill on their own."
    },
    {
      "title": "Earn free gold bars in challenges and events.",
      "content": "Earn free gold bars in challenges and events. If you’d rather not ask friends for lives, you can purchase them with gold bars. The easiest way to get this in-game currency is to buy it, but you can also earn gold bars for free just by playing. Participate in tournaments and other special challenges that offer gold bars as a reward. If you’d rather just buy some gold bars, tap the gold bar icon at the top of your screen and select one of the offers from the menu. For example, you can typically purchase 10 gold bars for $1.99."
    },
    {
      "title": "Tap your lives at the top of the screen.",
      "content": "Tap your lives at the top of the screen. When you need a refill of lives, tap the heart icon at the top of the screen, to the left of your profile picture."
    },
    {
      "title": "Select an option to purchase lives with gold bars.",
      "content": "Select an option to purchase lives with gold bars. On the card that displays your lives, you will see one or more options to refill your lives with gold bars. For example, you can purchase 6 hours of unlimited lives with 69 gold bars, or a single life with 4 gold bars. Tap the green button under the option you want to spend the bars and refill your lives. If you don’t have enough gold bars, you’ll be taken to a menu where you can buy more. If you buy an infinite lives booster, your lives will be fully replenished after the timer runs out."
    },
    {
      "title": "Open the time and date settings on your phone.",
      "content": "Open the time and date settings on your phone. This is an old hack for getting free lives on Candy Crush without having to wait or ask your friends. While this method may no longer work reliably, it’s still worth a try—as long as you don’t mind fiddling around with your phone’s date and time settings. On an iPhone, go to Settings > General > Date & Time . On an Android, open the Clock app and select ⋮ > Settings ."
    },
    {
      "title": "Reset your clock to sometime in the future.",
      "content": "Reset your clock to sometime in the future. Depending on your phone’s OS, this may involve changing to a different time zone or selecting your desired date and time."
    },
    {
      "title": "Go back to the game.",
      "content": "Go back to the game. You’ll see you have full lives. Don’t start playing just yet, or the game may detect the time change and penalize you."
    },
    {
      "title": "Reset the time on your phone.",
      "content": "Reset the time on your phone. Go back into your date and time settings and fix the time. It’s easiest to set time to “Set automatically” as it will use your carrier or location to determine the correct time and automatically adjust."
    },
    {
      "title": "Return to Candy Crush and enjoy your new lives.",
      "content": "Return to Candy Crush and enjoy your new lives. If the hack worked properly, you should still have a full set of lives after resetting to the correct date and time."
    },
    {
      "title": "Tap your lives at the top of the screen.",
      "content": "Tap your lives at the top of the screen. If you’re in a rush to get more lives and you don’t have enough gold bars, you can always pay to have your hearts refilled instantly. Tap the heart icon at the top left side of the screen to see your lives."
    },
    {
      "title": "Select the paid booster offer.",
      "content": "Select the paid booster offer. You’ll see an option to purchase a couple of power-ups for a low price (e.g., $0.99) at the bottom of the screen. This usually includes temporary infinite lives. Once the timer runs out on the infinite lives booster, all your hearts will be replenished."
    }
  ]
}