{
  "url": "https://www.wikihow.com/Defrost-an-Upright-Freezer",
  "title": "How to Defrost an Upright Freezer",
  "steps": [
    {
      "title": "Defrost the freezer when the frost is 1⁄4 to 1⁄2 inch (0.64 to 1.27 cm) thick.",
      "content": "Defrost the freezer when the frost is 1 ⁄ 4 to 1 ⁄ 2 inch (0.64 to 1.27 cm) thick. Your freezer works less efficiently when frost starts to build up inside. Once frost reaches a thickness of 1 ⁄ 4 to 1 ⁄ 2 inch (0.64 to 1.27 cm), it’s time to defrost. Defrosting your freezer will take about 3-4 hours, so be sure to plan accordingly. [1] X Research source Most upright freezers need to be defrosted once every six months. [2] X Research source"
    },
    {
      "title": "Transfer all frozen items from your freezer into a large cooler.",
      "content": "Transfer all frozen items from your freezer into a large cooler. Work quickly so the food doesn’t start to thaw. Place the biggest items at the bottom of the cooler and layer the flat packages on top to efficiently use your cooler space. Close the lid securely once the cooler is full. [3] X Research source Use a cooler or ice chest that can accommodate the amount of food you have. If necessary, use more than 1 cooler. [4] X Research source Be sure to get everything out! Check the back corners and shelves carefully."
    },
    {
      "title": "Unplug your freezer from the outlet.",
      "content": "Unplug your freezer from the outlet. Find your freezer’s electrical cord and follow it all the way back to the wall socket. Carefully pull the plug out of the socket and place the cord on floor. [5] X Research source Always double-check that your freezer is unplugged before you proceed for safety purposes."
    },
    {
      "title": "Bring the freezer outside or put down old towels to catch melted frost.",
      "content": "Bring the freezer outside or put down old towels to catch melted frost. Defrosting your freezer outdoors makes cleanup easier, but if you can’t move your freezer, that’s totally fine. Grab several old towels and cover the floor around the freezer to catch melted runoff. [6] X Research source You can also place towels on the freezer shelves to catch melted frost. Wring them out over your sink once they’re saturated."
    },
    {
      "title": "Remove the drain plug and put a shallow pan under the drain, if needed.",
      "content": "Remove the drain plug and put a shallow pan under the drain, if needed. Not all upright freezer models have a drain plug. If it does, it will be located at the bottom of the freezer. Remove the drain plug by pulling it straight out. Then, position a large pan underneath the drain to catch melted frost. [7] X Research source Remember to empty the pan periodically so that it doesn’t overflow."
    },
    {
      "title": "Open the freezer door and let it defrost on its own if you aren’t in a hurry.",
      "content": "Open the freezer door and let it defrost on its own if you aren’t in a hurry. If your upright freezer is outside and it’s nice and sunny, you can just prop the freezer door open and let nature do the work for you. This technique usually takes 3-4 hours, but since your food is safely packed away in coolers, you have nothing to worry about. [8] X Research source If your freezer has a drain plug and it's indoors, check the progress about once an hour and empty the pan, if needed."
    },
    {
      "title": "Place bowls of hot water on the freezer’s shelves to encourage melting.",
      "content": "Place bowls of hot water on the freezer’s shelves to encourage melting. Place thick towels under each shelf in your freezer to catch the melted frost. Then, heat water in your microwave or put a kettle on the stove. Fill medium-sized bowls with the heated water and place 1-2 bowls on each shelf in the freezer. Close the freezer door and let the steam loosen and melt the frost. [9] X Research source Dump out the water in the bowls and replace it every 10-15 minutes for the best results. This technique usually takes 30 minutes to an hour."
    },
    {
      "title": "Melt the frost with a hair dryer to speed things up.",
      "content": "Melt the frost with a hair dryer to speed things up. Plug a regular hair dryer into the nearest outlet and turn it on using the highest setting. Hold the nozzle of the hair dryer about 1 inch (2.5 cm) above the frost and blast it with the hot air until it melts. [10] X Research source This technique takes about 30-40 minutes to complete. Make sure no melted runoff gets near the power outlet to prevent electrocution."
    },
    {
      "title": "Scrape out the softened frost with a rubber spatula.",
      "content": "Scrape out the softened frost with a rubber spatula. No matter which technique you’re using, the frost will start to soften and turn into chunks after a few minutes. To save even more time, scrape the flat surfaces in the freezer with a rubber spatula to remove the chunks. Use a baking sheet to catch the chunks as you scrape them out. [11] X Research source You don’t have to do this, but it will speed things up significantly! Avoid using a metal spatula for this; metal can damage your freezer’s interior. Stay away from the freezer element when you’re scraping the frost."
    },
    {
      "title": "Dry the interior surfaces with a thick towel to remove excess moisture.",
      "content": "Dry the interior surfaces with a thick towel to remove excess moisture. Your freezer’s shelves and walls will be wet after the defrosting process. There may also be little puddles of water pooled here and there. Grab a towel and wipe all of the surfaces to soak up any water. Keep wiping until the inside is totally dry. [12] X Research source You can use paper towels for this if you prefer. Be sure to dry the surfaces thoroughly! Any leftover water will freeze and create more frost to deal with after you plug your freezer back in."
    },
    {
      "title": "Remove the shelves and wash them with warm, soapy water.",
      "content": "Remove the shelves and wash them with warm, soapy water. If you have time, this is a great opportunity to clean and sanitize the inside of your freezer! Take out the shelves and any removable drawers and wash them in warm, soapy water. Place them on a clean towel to air-dry. [13] X Research source Wipe the pieces down with a towel to remove excess moisture before you put elements back into the freezer."
    },
    {
      "title": "Mix equal parts vinegar and water in a spray bottle.",
      "content": "Mix equal parts vinegar and water in a spray bottle. Whip up a simple cleaning solution with distilled white vinegar and water. Simply fill a spray bottle halfway with the vinegar, and then add warm water to fill it up the rest of the way. Give the spray bottle a good shake to combine the water and vinegar. [14] X Research source You can use a commercial antibacterial cleaner if you prefer."
    },
    {
      "title": "Spray the surfaces with the vinegar solution and wipe them down.",
      "content": "Spray the surfaces with the vinegar solution and wipe them down. Apply the cleaning solution liberally to every surface in the freezer. Grab a sponge and wipe each surface down thoroughly. The sponge will soak up a lot of the solution, but make 1 more pass with a dry towel to get rid of lingering moisture. [15] X Research source Be sure to work the sponge into the nooks and crannies for a thorough job."
    },
    {
      "title": "Replace the shelves and put the frozen food back into the clean freezer.",
      "content": "Replace the shelves and put the frozen food back into the clean freezer. Insert any removable parts that were cleaned separately. Then, turn on your freezer and quickly move the frozen food from the coolers to the freezer. Organize however you see fit to make the most efficient use of the space. [16] X Research source If your freezer has a drain plug, don’t forget to put that back before stacking the food inside."
    }
  ]
}