{
  "url": "https://www.wikihow.com/Eat-a-Jawbreaker",
  "title": "How to Eat a Jawbreaker",
  "steps": [
    {
      "title": "Lick your jawbreaker until it’s small enough to fit in your mouth.",
      "content": "Lick your jawbreaker until it’s small enough to fit in your mouth. Some jawbreakers are going to be way too big to put in your mouth right away. Therefore, instead of sucking on your jawbreaker right away, you’ll have to lick it while holding it, sort of like a lollipop without the stick. Eventually, the jawbreaker should get small enough to fit into your mouth. [2] X Research source Jawbreakers have multiple layers that are typically different colours. As you lick a jawbreaker, your tongue will likely be stained with the colour of the layer your licking. Actual studies have been conducted that determined it takes about 1,000 licks to completely eat an average-sized jawbreaker! [3] X Research source"
    },
    {
      "title": "Suck on your jawbreaker until it’s soft enough to bite.",
      "content": "Suck on your jawbreaker until it’s soft enough to bite. [4] X Research source If you have a jawbreaker that fits completely into your mouth, don’t try to bite it right away. Jawbreakers are extremely hard and you could injure your jaw or even break a tooth. Avoid biting or chewing on the jawbreaker until it’s really small and soft. [5] X Research source Hard candy is one of the most common things on which kids can choke. Be very careful when sucking on a jawbreaker that you don’t also perform any activities that may cause you to suddenly inhale or swallow whatever is in your mouth (e.g., riding your bike, skateboarding, rollerblading, playing sports, etc.). [6] X Research source"
    },
    {
      "title": "Bite or chew smaller pieces when they get soft.",
      "content": "Bite or chew smaller pieces when they get soft. For a jawbreaker that started off the size of a baseball, it should be ready to bite or chew once it’s small enough to fit in your mouth. For a jawbreaker that started off small, you may need to suck on it to make it soft before you attempt to bite into it. [7] X Research source Be careful when you first attempt to bite into a jawbreaker, you don’t want to damage your teeth. Try biting it with your back teeth (molars) gently to see if it’s soft enough. If not, keep sucking."
    },
    {
      "title": "Store your jawbreaker in a plastic bag between eating sessions.",
      "content": "Store your jawbreaker in a plastic bag between eating sessions. Since you’ll never get through a jawbreaker in one day, you’ll likely have to store it between eating sessions. The best way to store a jawbreaker is to put it in a plastic bag. [8] X Research source Before starting to eat your jawbreaker again, you may want to rinse it with water first."
    },
    {
      "title": "Break the jawbreaker into smaller pieces using a kitchen mallet.",
      "content": "Break the jawbreaker into smaller pieces using a kitchen mallet. Even if your jawbreaker can fit into your mouth, you may prefer to break it into multiple pieces you can enjoy over time. Place your jawbreaker into a plastic freezer bag (or a plastic bag made of thicker plastic). Put the jawbreaker (in the bag) onto a hard surface that cannot be damaged, like a cement floor, paving stones, or a sidewalk. Then take a kitchen mallet and hit the jawbreaker until it’s broken into smaller pieces. [9] X Research source If a kitchen mallet isn’t strong enough, try using a hammer instead. When sucking on or eating the smaller, broken pieces of a jawbreaker, make sure to select pieces that aren’t too sharp or you may cut the inside of your mouth. [10] X Research source"
    },
    {
      "title": "Soak your jawbreaker in warm water to make it softer.",
      "content": "Soak your jawbreaker in warm water to make it softer. Jawbreakers, even those small enough to fit in your mouth, are extremely hard and can’t be bitten right away. If you don’t have the patience to either suck on your jawbreaker, or lick it over several days or weeks, try soaking it in warm water. Eventually, the water will make the various layers of the jawbreaker soft enough to bite, chew, or lick off without a lot of effort. [11] X Research source Once you’ve removed one layer of the jawbreaker using this method, you may need to soak it in warm water again in order to soften the next layer."
    },
    {
      "title": "Melt your jawbreaker in a microwave.",
      "content": "Melt your jawbreaker in a microwave. Put your jawbreaker into a microwaveable-safe bowl (something made of glass or ceramic), then place the bowl in the microwave. Set the timer on the microwave for about 10 minutes at a time and turn it on. Check to see how melted the jawbreaker is after 10 minutes and continue to microwave it if it’s not melted. [12] X Research source Melting a jawbreaker may turn it into a liquid substance, or it may just make the jawbreaker softer. Either way, let the jawbreaker cool down before biting into it or putting the pieces in your mouth."
    }
  ]
}