{
  "url": "https://www.wikihow.com/Get-Someone-to-Stop-Ignoring-You",
  "title": "Being Ignored? Here’s How to Get Them to Stop",
  "steps": [
    {
      "title": "Try to figure out why they’re ignoring you.",
      "content": "Try to figure out why they’re ignoring you. Depending on the situation, this may be pretty obvious. For instance, if you’ve had a huge fight with your wife, you may know exactly why she’s giving you the cold shoulder. If you aren’t aware of any problems between yourself and the person ignoring you, consider if you might have done something to upset them. [1] X Research source For instance, maybe you were gossiping about a friend behind their back. Whatever you said could have gotten back to them. If you left someone out of your plans or didn’t return their calls or messages, your behavior may have hurt their feelings."
    },
    {
      "title": "Let them cool off.",
      "content": "Let them cool off. Regardless of why you’re being ignored, the worst thing you can do is to hound the person constantly in hopes of a response, which will annoy them and give them more reasons to ignore you. Don’t spam them, call repeatedly, or keep asking them why they’re ignoring you. Give them some time to figure out how they feel and if they want to get in touch with you. [2] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. A single message or call is fine, but don’t send a bunch of texts like, “Why are you ignoring me?” “What did I do wrong?” or “Please talk to me!” These messages may annoy the person rather than get them to open up. It can be tough to avoid trying to solve the problem immediately. However, you can’t control the other person, so giving them space is best. You can also send something heartfelt, like “I've tried reaching out a couple of times. Maybe you're going through something you're uncomfortable sharing with me, or maybe you're just not up for connecting with me right now. I just want to let you know that I'm here. And I hope we can connect in the future.” [3] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020."
    },
    {
      "title": "Distract yourself with work, school, or hobbies.",
      "content": "Distract yourself with work, school, or hobbies. Trying to figure out why someone is ignoring you or obsessing over the fact that they are ignoring you can take up a lot of time and energy, plus it can affect your mental and physical health! However, it’s not productive and will only make you miserable. Continue with your daily life and activities. Throwing yourself into your job or schoolwork is a productive way to keep from thinking about the problem. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source During your free time, do things you enjoy , whether that’s fishing , baking, playing soccer, woodworking, writing poetry , swimming, knitting, or coding !"
    },
    {
      "title": "Spend time with people",
      "content": "Spend time with people who care about you. While being on the outs with someone important in your life can feel terrible, they’re probably not the only person you enjoy spending time with. Reach out to other friends and family members and ask them to hang out. Take the time to build up your other relationships and spend quality time together. [5] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. It’s essential to ensure your emotional needs are met, especially when you’re struggling with a relationship that’s important to you. It can be helpful to speak with someone you trust about the situation, who you know won’t say anything about it to anyone else."
    },
    {
      "title": "Think about how you’ve reacted to being ignored in the past.",
      "content": "Think about how you’ve reacted to being ignored in the past. If this person has given you the silent treatment before and you’ve responded by giving them lots of attention to get them to talk to you, they may be trying to get you to do it again. Showering them with attention in an effort to reconnect shows them that ignoring you will get them what they want when it’s not a healthy way to deal with problems, but rather, a manipulative one. [6] X Research source This is another reason why it’s important to avoid being clingy or begging for their attention—they might be ignoring you just to get you to respond."
    },
    {
      "title": "Reach out to arrange a face-to-face meeting.",
      "content": "Reach out to arrange a face-to-face meeting. Addressing the issue is important if you care about the person ignoring you and want to resolve the conflict . Speaking in person is better than texting or talking on the phone since you’ll be able to see each other’s facial expressions and determine how genuine each other’s words and actions are. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can call, text, or even send a note to arrange the meeting. Try saying something like, “I know you’re upset with me, and I’d really like to talk things through. Can we meet for coffee at 10 am on Saturday?” Try to choose a neutral meeting place, so no one has the “home field” advantage. Coffee shops are great because you’re surrounded by people and don’t have to commit to having a long sit-down meal like you would a restaurant."
    },
    {
      "title": "Ask them directly why they’re ignoring you.",
      "content": "Ask them directly why they’re ignoring you. Now that you’ve gotten the person to agree to talk to you, it's time to get down to business. Even if you have a good idea of why they’ve been ignoring you, ask them to explain it from their perspective. An honest and open conversation may be all it takes to get your relationship back on track. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You may be surprised at what the issue is between you or why they think ignoring you is the right way to handle the problem."
    },
    {
      "title": "Listen carefully",
      "content": "Listen carefully to what they have to say. Avoid being defensive or thinking of a rebuttal while they’re talking. This can be difficult, especially if they accuse you of something or think you’re in the wrong. However, do your best to listen to what they’re saying, read between the lines, and try to see the situation from their side. [9] X Research source Use your body language to show them you’re listening by making eye contact and nodding when you understand or agree. Don’t be afraid to ask questions if you need clarification. You can also repeat what they said to make sure you understand."
    },
    {
      "title": "Apologize",
      "content": "Apologize if you’re in the wrong. Take responsibility for your actions if you did something to upset or hurt the other person. Put your ego aside so you can acknowledge your mistakes and apologize sincerely. Validating their feelings can go a long way toward restoring your relationship. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Say something like, “I’m sorry I didn’t invite you to girls’ night out, Jen. I can see that I hurt your feelings. I’ll be sure to include you in the future.”"
    },
    {
      "title": "Explain your side of the story.",
      "content": "Explain your side of the story. Once the other person has aired their grievances and feels heard, it’s your turn to explain how this conflict affected you . Share your perspective on the situation without pointing the finger at them. Use “I” statements to frame your feelings, and don’t forget to tell them how you felt when they ignored you. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source For instance, you might say, “I felt really sad and anxious when you refused to talk to me. I value our friendship and want to make things right.”"
    },
    {
      "title": "Come up with a compromise",
      "content": "Come up with a compromise or solution together, if possible. At this point, you probably have a pretty good idea of whether the relationship can be mended. In some cases, an apology might be enough. In others, it may take time and dedication to repair your relationship . Work together to determine what the next steps will be. [12] X Research source You can each offer solutions and compromise to find one that works for both of you. It’s easy to make promises but harder to follow through. Make sure you’re willing to do the work necessary to rebuild trust in your relationship if that’s the issue."
    },
    {
      "title": "Accept that the relationship may not be worth saving.",
      "content": "Accept that the relationship may not be worth saving. If the person ignoring you does so to get you to do something they want (or not do something they don’t want), they’re likely manipulating you. This is a sign of an unhealthy relationship. If you notice that a friend or family member often uses this type of behavior , especially after confronting them about it, you may be better off without this person in your life. [13] X Research source Similarly, if you’re just not that invested in the relationship, you may decide that moving on is in your best interest. Some friendships and relationships naturally fade as you grow. While it's painful, it's also normal. You'll find plenty of other wonderful people to befriend out there! [14] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020."
    }
  ]
}