{
  "url": "https://www.wikihow.com/Find-the-Average-of-a-Group-of-Numbers",
  "title": "How to Find the Average of a Group of Numbers",
  "steps": [
    {
      "title": "Find the sum of the numbers in the set.",
      "content": "Find the sum of the numbers in the set. The first thing you need to do is to add up all of the numbers in the set. [1] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020. Let's say you're working the following set of numbers: 1, 2, 3, and 6. 1 + 2 + 3 + 6 = 12 {\\displaystyle 1+2+3+6=12} . [2] X Research source"
    },
    {
      "title": "Divide the result by the amount of numbers in the set.",
      "content": "Divide the result by the amount of numbers in the set. There are 4 distinct numbers in the set. So, take the sum of the numbers, 12, and divide it by 4 to get the average. 12 / 4 = 3 {\\displaystyle 12/4=3} . [3] X Research source The average of the group of numbers is 3. [4] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020."
    },
    {
      "title": "Write down the average of each category.",
      "content": "Write down the average of each category. Use the method of finding the average -- adding up all of the numbers in the set and dividing the result by the amount of numbers -- to find the average of each category. [5] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020. Let's say you're trying to find your weighted average for a class and you're working with the following averages and weight categories: [6] X Research source Homework average = 93% Test average = 88% Quiz average = 91 %"
    },
    {
      "title": "Write down the weight category of each average.",
      "content": "Write down the weight category of each average. Remember that the weight categories should add up to 100%. [7] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020. Let's say you're working with the following weight categories: [8] X Research source Homework average = 30 % of final grade Test average = 50 % of final grade Quiz average = 20 % of final grade"
    },
    {
      "title": "Multiply each average by its weight category.",
      "content": "Multiply each average by its weight category. Now, simply convert each weight category into a decimal and then multiply it by the average it represents. 30% is really .3, or 3/10 of the final grade, 50% is really .5, or 1/2 of the total grade, and 20% is really .2, or 2/10 of the final grade. [9] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020. Now, multiply these decimal-converted weight categories by the averages they represent. [10] X Research source Homework average = 93 x .3 = 27.9 {\\displaystyle 93x.3=27.9} Test average = 88 x .5 = 44 {\\displaystyle 88x.5=44} Quiz average = 91 x .2 = 18.2 {\\displaystyle 91x.2=18.2}"
    },
    {
      "title": "Add the results.",
      "content": "Add the results. [11] X Research source To find the final weighted average, simply add up the three results. 27.9 + 44 + 18.2 = 90.1 {\\displaystyle 27.9+44+18.2=90.1} . The final weighted average of the three groups of numbers is 90.1 {\\displaystyle 90.1} . [12] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2020."
    }
  ]
}