{
  "url": "https://www.wikihow.com/Drift-a-Car",
  "title": "How to Drift a Car",
  "steps": [
    {
      "title": "Pick a manual transmission car to make drifting easier.",
      "content": "Pick a manual transmission car to make drifting easier. Manual transmission cars have a clutch pedal and a gear shift you use to control the engine. Automatic cars take care of this for you. When you’re drifting, the extra control enables you to achieve the correct speed and angle required to get around a bend. [1] X Research source"
    },
    {
      "title": "Choose a car with rear-wheel drive for more effective drifting.",
      "content": "Choose a car with rear-wheel drive for more effective drifting. When a car has rear-wheel drive, the engine controls the rear wheels only. Other cars have engines responsible for the front wheels or all 4 wheels. The rear wheels are what you need during a drift, so a car with a rear-wheel drive system is much easier to control. When choosing a car , figure out what kind of system it has by checking the owner’s manual or researching it online. [2] X Research source Another option is to use a 4-wheel drive car where the engine controls all 4 wheels. The best 4-wheel drive cars are ones that have stronger back wheels. You will have to test drive the car to determine which wheels adhere to the road more. Cars with front-wheel drive are very difficult to drift without a lot of practice. The front wheels control the car in order to prevent it from sliding. You end up understeering, which means the car doesn’t turn as much as you desire."
    },
    {
      "title": "Drive on worn-out tires for an easier time starting a drift.",
      "content": "Drive on worn-out tires for an easier time starting a drift. Worn-out tires have less traction, so your car slides more easily when you round a bend. The front tires don’t matter as much, but using old rear tires makes a difference if your car doesn’t drift well. Try saving a spare set of tires to put on your car before you practice. Inexpensive tires, even if they are new, often can help with drifting. Many cars come equipped with automatic stability or steering control systems. Turning these systems off makes drifting much easier if a change of tires aren’t enough to make a difference. However, driving without these systems is dangerous unless you’re good at controlling the car."
    },
    {
      "title": "Select a safe spot away from traffic to practice drifting.",
      "content": "Select a safe spot away from traffic to practice drifting. Drifting is dangerous and should never be done on busy roads, near buildings, or anywhere else you might hit something. Ideally, find a racetrack you can practice on. Otherwise, look for a deserted parking lot and place a barrel on it to drift around. [3] X Research source Search online for racetracks in your area and contact the owners. You may be able to book time where you have the track all to yourself. Driving when the road or track is damp can also make drifting easier. Try going out after a light rain or a little snow. Keep in mind that the slippery surface can make drifting even more dangerous than usual."
    },
    {
      "title": "Head toward a turn at about 30 mi (48 km) per hour.",
      "content": "Head toward a turn at about 30 mi (48 km) per hour. This is the ideal speed for sliding around the bend. If you have a manual gear shift, put the car into second gear and rev the engine up to 3,000 RPM. If you go too fast, you may lose control during the drift. If you go any slower than this, you may not have enough speed to get all the way around the bend. [4] X Research source In drifting, speed isn’t the most important part. Good control is necessary for both destabilizing the car’s balance and also keeping you safe while drifting."
    },
    {
      "title": "Turn the steering wheel in the direction of the bend.",
      "content": "Turn the steering wheel in the direction of the bend. As soon as you enter the turn, begin turning toward it. Spin the wheel gently and without a lot of force. This will set you up for the drift, but you’re not quite ready to start it yet. Keep the car close to the inside part of the turn for now. Keep your hands on the wheel so you’re ready to maneuver it at all times. In a power on, it is responsible for the drift as well as the car’s positioning."
    },
    {
      "title": "Spin the wheel toward the corner while applying the throttle.",
      "content": "Spin the wheel toward the corner while applying the throttle. Try to do both simultaneously. Press down hard on the gas pedal and turn the wheel with force this time. If the move was successful, you will feel the car begin to spin as the back wheels lose traction. If you’re having a hard time starting the drift, using the handbrake or clutch could help. Combine the handbrake or clutch kick technique with the power over."
    },
    {
      "title": "Steer away from the bend to begin drifting around the turn.",
      "content": "Steer away from the bend to begin drifting around the turn. Be quick about it to keep control of the car. If you’re successful, the car will point toward where you want to go. Remember to turn the wheel with force to straighten out the car. Also, continue pressing on the gas to apply even more throttle. If you don’t apply enough force, the car’s back end will come all the way around, causing you to spin out."
    },
    {
      "title": "Straighten out the car once you get around the bend.",
      "content": "Straighten out the car once you get around the bend. Let go of the throttle to reduce your speed. As the car begins stabilizing again, gradually rotate the wheel back toward the bend. Focus on moving the car toward where you want to go. Once the front part of the car gets around the bend, you can begin driving toward the road. As soon as the car is stable, you can also press down on the gas to drive away."
    },
    {
      "title": "Approach a turn at about 30 mi (48 km) per hour.",
      "content": "Approach a turn at about 30 mi (48 km) per hour. This speed may seem too low, but it is enough to get around the curve without losing control of the car. Use the gear shift to put the car into second gear. Also, watch the tachymeter on the dashboard as you bring the car up to 3,000 RPM. [5] X Research source Contrary to what you might expect, speed isn’t the essential part of drifting. Instead of going for a speed record, enter the bend at a reasonable pace that will allow you to control the car without spinning."
    },
    {
      "title": "Flick the wheel to the side as you begin turning around the bend.",
      "content": "Flick the wheel to the side as you begin turning around the bend. If you have room, steer the car to the outer edge of the road and then drift toward the inner part of the turn as you approach. This will give you plenty of opportunity to arc the car around the curve by turning the wheel slightly. Once you come upon the turn, flick the steering wheel in the opposite direction, away from the turn. [6] X Research source"
    },
    {
      "title": "Pull the handbrake and press the clutch to destabilize the back wheels.",
      "content": "Pull the handbrake and press the clutch to destabilize the back wheels. Push the clutch down hard to open up the throttle. If you’re too gentle, you may not generate enough power to initiate the power slide. At the same time, pull the handbrake up to cause the rear wheels to lose traction. Once you feel the car begin to slide, you can focus on bringing it around the curve. [7] X Research source With some vehicles, accelerating and turning may be enough to initiate the drift. Many vehicles handle well enough that a sudden pump of the handbrake is also required. Oversteering happens when the car car turns more than you expect. If your car is in the right position, oversteering will allow you to power slide around the bend."
    },
    {
      "title": "Accelerate while approaching the middle of the turn.",
      "content": "Accelerate while approaching the middle of the turn. Let the car continue to slide. Leave the handbrake alone for now, but prepare to release the clutch as soon as you step on the accelerator. Step down hard on the pedal to keep the tires spinning. The extra power will help you get through the turn. [8] X Research source Keep your foot on the gas pedal. Finishing a drift doesn’t require much acceleration, but make sure your car doesn’t have an opportunity to slow down. If you feel the car turning too far to complete the drift, more acceleration usually helps. Too much could cause you to spin out, though!"
    },
    {
      "title": "Steer",
      "content": "Steer toward the curve once you’re halfway through it. Maintain your speed and trajectory as you enter the turn. Once you get about halfway, turn the steering wheel to point the car in the direction you want to go. Keep it pointed toward the inner part of the road ahead. As you drift around the curve, the car will continue to turn a little until you have a chance to straighten it out. [9] X Research source You’re going to be busy trying to maintain the car’s balance and direction at the same time. Remember to keep your foot on the gas while steering and watching where the car is headed."
    },
    {
      "title": "Use the throttle more if you need the car to turn more.",
      "content": "Use the throttle more if you need the car to turn more. Increase the throttle by pressing down on the gas pedal. It opens the throttle, which lets more air into the engine. You will get better traction this way and be able to turn more toward the corner. In general, keep the pedal down about 80% of the way and change it if needed depending on how your car handles. [10] X Research source If you need to, let off the gas a little bit so the car drifts further from the center of the turn. Try to keep the car near the middle of the road as the front end begins shifting toward the inner part of the turn. Keep tabs on the back end of the car. If it seems to come around too far, release the gas pedal a little to prevent it from continuing to rotate."
    },
    {
      "title": "Hold the throttle steady while steering to straighten out the car.",
      "content": "Hold the throttle steady while steering to straighten out the car. As you begin exiting the turn, begin turning the wheel in the opposite direction. Do it slowly to avoid fishtailing. You may think you need to let off the gas, but that will actually cause the slide to end too early. Keep your foot steady until you’re able to drive away. [11] X Research source Your instinct will be to release the gas pedal and let the car drift on its own. It’s a normal reaction that is easy to forget when you’re first learning. However, remember that, if you made it this far, the car won’t spin out when you use the gas pedal to control it. If you’re going too fast and feel the car beginning to spin, rapidly activate the brakes a couple of times. If you’re having a hard time finishing the slide, you may need more power. Press down harder on the gas or approach the turn at a faster speed."
    },
    {
      "title": "Approach the inside edge of a turn at a moderate speed.",
      "content": "Approach the inside edge of a turn at a moderate speed. Use the gear shift to put the car into second gear. Step on the gas to bring the car up to 30 mi (48 km) per hour and 3,000 RPM. When you reach the turn, make sure the car is near the inner part of the track so you have plenty of room to slide around it. [12] X Research source Don’t go too fast or else you will have a hard time drifting. If you find the car hard to control around a bend, try approaching it with a little less speed."
    },
    {
      "title": "Steer toward the turn to begin power sliding.",
      "content": "Steer toward the turn to begin power sliding. Spin the wheel in the direction of the turn like you normally would when rounding a corner. Keep your foot on the gas, pressing it down about 80% of the way to open up the throttle. As you enter the turn, continue steering toward the direction you want to travel. [13] X Research source"
    },
    {
      "title": "Kick the clutch pedal in and out a few times to drift.",
      "content": "Kick the clutch pedal in and out a few times to drift. The car will begin stabilizing as the rear wheels gain traction. Keep the drift going by preventing that from happening. Press down hard on the clutch, release it, and repeat as quickly as you can. You can tell it is working when the car continues rotating without slowing down at all. [14] X Research source While you’re working the clutch, keep your other foot firmly placed on the gas pedal. The car needs the power generated from the open throttle to get through the turn."
    },
    {
      "title": "Use the clutch again if you feel the car losing power or positioning.",
      "content": "Use the clutch again if you feel the car losing power or positioning. Pressing the clutch down rapidly again can rev the engine back up so the car powers through the turn. When you approach the end of the turn, the car should end up in the middle of the road. Make sure the car has enough power to get there and finish drifting through the turn. If the car can’t reach the correct position, pumping the clutch can help. [15] X Research source Similarly, don’t press down on the clutch if you experience understeering, where the car doesn’t turn as much as you desire. Let it regain some traction as you focus on gently steering it around the curve."
    },
    {
      "title": "Straighten out the car by releasing the wheel and clutch.",
      "content": "Straighten out the car by releasing the wheel and clutch. After you get around the bend, gradually turn the steering wheel in the opposite direction. The car will be almost facing the near side of the road until you do this. Keep your foot on the gas pedal to ensure the car doesn’t spin out while you’re correcting its course. Press down on the accelerator to speed away when you’re done. [16] X Research source If you turn the wheel too sharply, the back end of the car will rock back and forth like a pendulum when the wheels fail to gain traction. If you let off the gas, the car won’t have enough power to completely drift around the curve. You will probably feel tempted to ease off to avoid a crash, but remind yourself that you have more control over the car by maintaining its acceleration."
    }
  ]
}