{
  "url": "https://www.wikihow.com/Defrost-Frozen-Milk",
  "title": "Easy Ways to Safely Defrost Frozen Milk",
  "steps": [
    {
      "title": "The sooner you defrost and use the milk, the better the texture will be.",
      "content": "The sooner you defrost and use the milk, the better the texture will be. If you've ever drunk milk that was frozen, you might have noticed its grainy texture. This is because the longer milk is frozen, the more the fat separates from the liquid. For the best quality, aim to thaw the milk within the first month of freezing it. [1] X Research source If you don't get around to using the milk within a month, don't worry! You can safely freeze milk for up to 4 months."
    },
    {
      "title": "Give the milk 1 to 2 days to defrost for the best quality.",
      "content": "Give the milk 1 to 2 days to defrost for the best quality. There's no need to transfer the milk to a different container—just stick it in the fridge! Defrosting at a steady temperature over a day or two gives the milk a smoother texture than if you defrost it quickly. [2] X Research source"
    },
    {
      "title": "Submerge the frozen milk in cold water to thaw the milk in a hurry.",
      "content": "Submerge the frozen milk in cold water to thaw the milk in a hurry. If you forgot to stick the milk in the fridge, it's totally fine! Fill a large bowl with cold water and put your frozen milk in it so the water covers it. Then, put the bowl in the fridge for 30 minutes. Replace the water and refrigerate the milk for another 30 minutes so it thaws completely. [3] X Research source This works best for cartons of milk that are smaller than 1 ⁄ 2 gallon (1.9 L) in size. If you're trying to defrost 1 gallon (3.8 L) of milk, it may take a few hours using this method."
    },
    {
      "title": "Stick ice cube-sized portions in the microwave for the fastest way to thaw milk.",
      "content": "Stick ice cube-sized portions in the microwave for the fastest way to thaw milk. If you need just a little milk and you froze it in an ice cube tray, pop out a few frozen cubes and put them in a microwave-safe dish. Then, microwave the milk in 15-second intervals until they're liquid. [4] X Research source When you microwave the milk, you're heating it up, which helps bacteria grow. Plan on drinking or using the milk right away instead of leaving it out at room temperature or sticking it back in the fridge."
    },
    {
      "title": "The USDA warns that thawing milk on the counter can cause bacterial growth.",
      "content": "The USDA warns that thawing milk on the counter can cause bacterial growth. This is because bacteria multiply between temperatures of 40 to 140 °F (4 to 60 °C). Instead of taking the chance, stick frozen milk in the fridge, a bowl of cold water, or the microwave. [5] X Trustworthy Source Food Safety and Inspection Service of the USDA Food safety information provided by the U.S. Department of Agriculture. Go to source"
    },
    {
      "title": "Mix the thawed milk so it's smoother to drink.",
      "content": "Mix the thawed milk so it's smoother to drink. Most milk is homogenized which means that the fat in the milk is mixed with the liquid under extreme pressure. This is why you don't have fat floating to the top of the milk. Unfortunately, defrosting frozen milk separates the fat. To make the thawed milk more appetizing, whisk, shake, or blend it until it's smooth. [6] X Research source Drink the milk quickly after you do this since the milk fat will separate again as it sits."
    },
    {
      "title": "Label the milk with the date that you thawed it so know when to toss it.",
      "content": "Label the milk with the date that you thawed it so know when to toss it. Since you won't be able to use the expiration date printed on the milk container, it's important to use the milk within 3 days of the date you took it out of the freezer. [7] X Research source You can only freeze milk once so use it or pitch it after you've thawed it."
    },
    {
      "title": "Bake or cook with milk if your milk is still a little grainy.",
      "content": "Bake or cook with milk if your milk is still a little grainy. If you can still tell that the milk isn't completely smooth even after you've shaken or blended it, don't throw it out! Use the thawed milk in your next baking or cooking recipe that calls for milk—you won't notice the graininess at all. [8] X Research source You can also use the thawed milk in smoothies or milkshakes."
    }
  ]
}