{
  "url": "https://www.wikihow.com/Cope-With-Hurtful-Insults",
  "title": "How to Cope With Hurtful Insults",
  "steps": [
    {
      "title": "Speak to the person privately.",
      "content": "Speak to the person privately. Oftentimes, it is beneficial to privately address the individual who has insulted you. Speaking privately is best to avoid the situation from escalating in front of others and to lessen the insulting person’s likeliness of becoming embarrassed or defensive. Before speaking with the individual, take a deep breath, and calmly ask the person to speak with you privately. Once alone, let the person know that you did not appreciate his insult, and inform him of your expectations and what action you’ll take it happens again. For example, you might tell a coworker, “I felt hurt and insulted when you called me stupid. I want you to speak to me in the same respectful manner as I speak to you. I’ve asked you not to call me names before. If it happens again, I’m going to file a formal complaint to HR about your harassment.” Sometimes saying less is better. You can address the insult by briefly addressing the problem. For example, you could say, “That statement was completely uncalled for. I won’t stand for you talking to me in that manner; if it happens again I will no longer invite you to family gatherings.”"
    },
    {
      "title": "Inquire about the intent behind the insult.",
      "content": "Inquire about the intent behind the insult. An effective strategy for responding to an insult is to inquire about what is actually at the heart of the insult. Do this by asking the individual what has led her to make a comment that could be potentially hurtful. Like a counselor, you are getting the individual to personally reflect on the root causes of her actions, which forces the person to accept personal responsibility for her words and actions. Be sure to focus on the actual intent behind the insult, and not the actual words that were said. For example, you might say, “Can you help me understand what is going here? What happened to cause you to want to hurt me by insulting me like that?” You could also take a guess at the underlying feeling of insult. For example, “I understand that we don’t agree on this topic and that upsets you; however, I’d prefer that you stick to the topic rather than resorting to personal insults.”"
    },
    {
      "title": "Set boundaries.",
      "content": "Set boundaries. It’s critical that you establish communication boundaries when dealing with people who resort to personal insults. Sometimes it requires directly stating what topics of conversation the person is allowed to engage you in. In addition, you might also might need to set boundaries for when the person should speak with you. [1] X Research source If you are dealing with a coworker who tends to launch insults, you could tell him, “Sean, I am asking you very kindly to please not bring up my personal life during our staff meetings. In fact, I would prefer that we engage in professional conversation at all times here in the office.”"
    },
    {
      "title": "Use humor.",
      "content": "Use humor. Humor can oftentimes be an effective way to respond to an insult for several reasons. It weakens the insult, it lessens the tension in the situation, and it gets others on your side. Consider using humor the next time someone puts you down. You might find it appropriate to even exaggerate or extend the put down, which serves to further lessen the power of the insult. [2] X Research source For example, if someone insulted you with the comment, “Your ears are so big,” you could offer a humorous response by saying, “Oh yes. The better to hear you with, my dear” (a reference to Little Miss Riding Hood)."
    },
    {
      "title": "Laugh.",
      "content": "Laugh. Laughing at an insult can be a very powerful response. Laughter makes the insult seem insignificant, and it also communicates that you were not hurt by the insult. Furthermore, it takes away the emotional power that the insulting person was hoping to gain from putting you down."
    },
    {
      "title": "Agree with the person.",
      "content": "Agree with the person. [3] X Research source Bullies are typically looking for a reaction or disagreement from you to fuel their desire to cause you pain. Instead of giving the bully what she is looking for, give her the unexpected by agreeing with whatever she said to insult you. Just say something like, “You are so right. I couldn’t agree more,” and keep agreeing as she continues the insult. She will get bored of teasing you of you don't provide a reaction."
    },
    {
      "title": "Walk away and ignore the bully.",
      "content": "Walk away and ignore the bully. The person launching the insult is probably seeking for you to engage negatively. By walking away, you are essentially ignoring the person’s insult and the individual himself. [4] X Research source Try to walk away the next time someone says something unkind. If you want, you can provide a brief comment as you walk away. For example, if your spouse were to say, “You are such a slob,” you response could be, “Okay,” and then walk away."
    },
    {
      "title": "Resist returning an insult.",
      "content": "Resist returning an insult. As tempting and second-nature as it may be, avoid responding to an insult with an insult of your own. It only brings you down to the same level as the insulter. You become just as much of a problem as the person who initiated the attack. [5] X Research source Instead of returning an insult, simply choose to ignore or even acknowledge it. This sends the message to your offender that her insult was completely insignificant and powerless."
    },
    {
      "title": "Conceal your pain from the insulter.",
      "content": "Conceal your pain from the insulter. Nothing excites a bully more than seeing the hurt and pain that he has inflicted on his victim. Don’t give a bully the pleasure of witnessing your pain. Doing so only confirms that his insult worked just as he planned. Instead, keep a smile on your face, and tell yourself, “I will not allow this person to see my pain.”"
    },
    {
      "title": "Avoid internalizing the insult.",
      "content": "Avoid internalizing the insult. Chance are, the insult is really not about you but about the other person’s insecurity. Bullies will oftentimes try to make others feel bad as a way of feeling better about themselves. Remember that you are not defined by someone else’s opinion of you. If you find yourself replaying hurtful words in your mind, replace the negative words with positive thoughts or words. For example, if someone insulted you by calling you ugly, tell yourself, “I am beautiful both inside and outside,” or imagine yourself standing in the mirror wearing your best outfit."
    },
    {
      "title": "Avoid reacting without thinking first.",
      "content": "Avoid reacting without thinking first. Regardless of how tempting it may be to blurt out the first comment that comes to mind or to quickly put up your forbidden middle finger, think before you respond. [6] X Research source Delay your response by taking a deep breath and slowly counting down from 10 to one. This will give you enough time to be in more control of your emotions."
    },
    {
      "title": "Allow yourself to be upset.",
      "content": "Allow yourself to be upset. It’s okay if you are upset when someone says hurtful things; feeling hurt after being insulted is natural. Be okay with truly allowing yourself to feel the hurt. It’s unhealthy to not personally acknowledge and accept when someone has hurt you. Take the alone time that you need to privately deal with your pain. Just try to avoid dwelling on it. Don’t hesitate to talk to someone you trust if you find that you are really struggling with getting over your hurt feelings. This will help you to vocalize your feelings, and as a result, it might allow you to finally move on."
    },
    {
      "title": "Reflect on your reaction and response.",
      "content": "Reflect on your reaction and response. You can respond and react to an insult in a number of different ways. For example, you might feel angry, sad, vindictive, or maybe even resentful towards the individual who insulted you. You might have responded by retaliating with an insult or by bursting into to tears. Take time to analyze why you reacted and responded in the way that you did. If, for example, you recall that the insult made you so angry that you couldn’t think clearly, take time to reflect on why. You could ask yourself, “What caused me to feel so angry and enraged inside? Was it the embarrassment of the insult, or do I feel that the insult was unwarranted?”"
    },
    {
      "title": "Consider whether or not the insult is valid.",
      "content": "Consider whether or not the insult is valid. When someone insults you, it’s helpful to take time to consider a few things. Think about who the insult came from, why it happened, and whether the insult is actually true. Usually, if the insult came from someone you respect like a parent, teacher, or best friend, taking the insult into consideration makes sense. On the other hand, if you were insulted by someone who you don’t respect, it makes sense to not consider the validity of the insult. [7] X Research source For example, if your mother said, “Stop being lazy and try keeping a job past 30 days,” take time to reflect on what she said. If in fact you are now unemployed and just quit your third job in six months, the statement is actually not an insult but the truth, though not stated in an ideal way. You can use that revealed truth for self-improvement."
    },
    {
      "title": "Acknowledge if you are at fault and apologize.",
      "content": "Acknowledge if you are at fault and apologize. Sometimes it’s hard to admit and accept when you are deserving of someone’s hurtful words. It takes courage to admit and offer an apology when you are at fault; however, you must acknowledge and admit to your mistakes so you can be a better person. [8] X Research source For example, your brother suffered life-threatening injuries after being in a serious car accident; when you call him two days later, he calls you a heartless human being for choosing to attend a party instead of visiting him in the hospital. You’re best bet would be saying, “I’m deeply sorry for my selfishness and not putting you first when you really needed me the most. I hope in time you will forgive me.”"
    }
  ]
}