{
  "url": "https://www.wikihow.com/Find-the-Editor-of-a-Book",
  "title": "How to Find the Editor of a Book",
  "steps": [
    {
      "title": "Open the book and start turning the pages until you see the title page.",
      "content": "Open the book and start turning the pages until you see the title page. Some books will have a single blank page, while some will include marketing materials or quotes. Novels will often list an author’s other books. Turn pages until you find the title page, which will have the book’s title in large letters in the center or upper-portion of the page. Look underneath the author’s name at the bottom to see if there is an editor listed. [1] X Research source The editor’s name will almost always be printed in a smaller font than the author’s. If you have an anthology, academic textbook, research compilation, or set of essays, the editor’s name will almost certainly be on the title page. Some newer books will use a minimalistic, tiny font on their title page. Don’t turn the pages too quickly or you’ll miss it. Some books don’t have editors, while others use ghost editors, whom are always uncredited. Some editors prefer to keep their name off of a book."
    },
    {
      "title": "Turn the title page over to find the copyright page.",
      "content": "Turn the title page over to find the copyright page. Turn the title page over to find the copyright page. It is usually printed on the back of the title page. The copyright page almost always uses a smaller font than the rest of the book, and is often flush with the bottom margin of the page, instead of the top. It contains publisher information, citation information, the date, locations, and information used to catalogue a text. [2] X Research source If you see a lot of copyright symbols, you’re on the right page. Copyright pages also include a books ISBN, or International Standard Book Number. This is a 10-13 digit number, and is only printed on the copyright page or back panel. The copyright page always goes before the dedication or acknowledgements page, if there is one. Otherwise, the copyright page is before the table of contents, index, or epigraph."
    },
    {
      "title": "Start at the top of the copyright page and work your way down.",
      "content": "Start at the top of the copyright page and work your way down. Copyright pages can be formatted differently, but they usually start with the publisher, date, and location of publication. Slowly scan each line to look for an editor’s line listing. The editor (or group of editors) are usually listed in the middle, underneath the publisher’s information, but above the country and printing number. [3] X Research source The editors name is often included alongside credits for the cover art and any photographers with images in the book. This is more common on older books, collections, and translations with multiple authors."
    },
    {
      "title": "Look at the front and back of the next page for acknowledgements.",
      "content": "Look at the front and back of the next page for acknowledgements. If an author worked closely with an editor throughout the writing process, they may choose to include their name in the acknowledgements page. The acknowledgements page is usually a few lines of text centered on a blank page after the copyright information. Read it to see if the editor is mentioned. [4] X Research source Some books don’t have an acknowledgement page."
    },
    {
      "title": "Inspect the spine of the book and look for a smaller name under the author.",
      "content": "Inspect the spine of the book and look for a smaller name under the author. Turn the book over and look at the spine—the thin side of the book where the pages are bound to the cover. If there are multiple names on the spine of the book, they are always ordered with the author’s name first, and the editor’s name after it. On most books, the editor’s name will be smaller so that a passerby can quickly tell who the author is. [5] X Research source If the book is a translation, the translator’s name will usually appear on the spine instead of an editor. A translator will often make editing decisions on their own and then use a proofreader to check their work."
    },
    {
      "title": "Contact the publisher directly by phone or email.",
      "content": "Contact the publisher directly by phone or email. The publisher’s website and contact information will likely be printed at the top or bottom of the copyright page. If it isn’t, you can look it up online. Contact the publisher by calling or emailing them to ask about a book’s editor. Publishers keep detailed records on each of their texts, so if anyone would be able to find a book’s editor, it would be them. [6] X Research source A publisher isn’t under any sort of legal obligation to release information, so be polite when contacting them. They usually won’t care about releasing this kind of information, but they may be resistant if you’re rude. Larger presses, like HarperCollins or Penguin, have customer service numbers and email addresses where you can ask for information pertaining to a book’s publication."
    },
    {
      "title": "Send a letter or email to the author of a text and ask them.",
      "content": "Send a letter or email to the author of a text and ask them. If a book is self-published or printed by a smaller press, finding the editor can be tricky. The author of a book will be sure to know who edited their work though! Perform an internet search and look for an author’s website or personal information. Most author websites have a contact tab with information on where to send a letter or email. [7] X Research source Be cordial in your letter and ask politely about the editorial information. An author is less likely to reply to your letter or email if you start off by making demands. Click university links in your searches! A lot of authors teach writing classes and you’ll be able to address a letter or email to their university office."
    },
    {
      "title": "Use the Library of Congress database to find publication information.",
      "content": "Use the Library of Congress database to find publication information. The Library of Congress is the national library of the United States, and has one of the largest databases of books in the world. Go to https://www.loc.gov/ and click the search bar. Type in the name of the book and the author’s name if you have it. Scroll through the results until you see the version of a book that you’re looking for. Click the title to open the book’s informational page and look for the editor. [8] X Trustworthy Source Library of Congress Official library of the U.S. and main research institution for Congress and the American public Go to source The editor will sometimes have their own row, but it may be in parentheses after the author’s with a note that they edited the book. If your search produces too many results, see if you can narrow down your search by filtering results on the left side of the screen. This is a particularly good method for finding editors of archaic or nontraditional texts."
    },
    {
      "title": "Reach out through an editor’s professional website.",
      "content": "Reach out through an editor’s professional website. Many professional editors offer their services on a freelance basis or use their website to advertise their press’s opportunities. Perform a simple search online using the editor’s name and look for a professional or personal webpage. There will be information about contacting an editor on their website. [9] X Research source If you’re trying to confirm that an editor worked on a text, look for a link to the editor’s curriculum vitae or resume. This will usually be linked on the editor’s personal website. A CV or resume will show what the editor has worked on recently. Many authors and editors network through social media sites like Linkedin. If you have a profile on a social media site that the editor uses, send them a message to see if they respond."
    },
    {
      "title": "Call or write to the publishing company the editor works for to see if you can talk to them.",
      "content": "Call or write to the publishing company the editor works for to see if you can talk to them. You may be able to reach an editor directly by asking to speak with them at work. Send a formal letter or place a friendly call asking to speak with the editor. Ensure that you’re able to articulate why you want to speak with them ahead of time by practicing the conversation. [10] X Research source “I want to interview the editor for my college paper,” or, “I loved their work on a book I’ve just read and would love to ask about their method” are both potential reasons for wanting to contact an editor."
    },
    {
      "title": "Use the media press kit on an editor’s or publisher’s website.",
      "content": "Use the media press kit on an editor’s or publisher’s website. A media press kit is a prepackaged group of marketing materials that provides commonly-sought information to reporters, other writers, and members of the general public. Look on a publisher or editor’s website for a tab that says “media” or “press” and review their press kit for information on how to contact an editor. [11] X Research source If there aren’t instructions on how to get a hold of the editor, use the other contact information to ask the editor or publisher’s public relations department about contacting them."
    }
  ]
}