{
  "url": "https://www.wikihow.com/Do-a-Layered-Haircut",
  "title": "How to Do a Layered Haircut",
  "steps": [
    {
      "title": "Get your hair ready for layering.",
      "content": "Get your hair ready for layering. Start with clean, damp hair, since it's more difficult to control the length when you work with wet hair. [2] X Research source Use a wide-toothed comb to comb all of the tangles from your hair, so that the layers you create will be neat."
    },
    {
      "title": "Gather your hair",
      "content": "Gather your hair at the top of your head. Keep the ponytail at the apex of your head, the flat area towards the back of the top of your head where you can balance a comb. Bend over so your head is upside down, comb your hair forward, and use your hands to form a ponytail at the top of your head. [3] X Research source Fasten it there with a hair elastic, then turn your head right side up. Make sure your hair is smooth against your head; any lumps or tangled parts could result in messy layering."
    },
    {
      "title": "Move the elastic down the ponytail.",
      "content": "Move the elastic down the ponytail . Use one hand to hold the ponytail and the other hand to slide the elastic down until it's a couple of inches from the end of the ponytail. [4] X Research source If you want subtle layering, slide the elastic down so there is only an inch or so of hair remaining in the ponytail. For more drastic layers, leave a few inches of hair in the ponytail. To prevent this from becoming a mullet, slide the elastic until a few pieces of hair slide out around the nape of your neck."
    },
    {
      "title": "Cut",
      "content": "Cut the end of the ponytail. Hold your hair at the elastic to keep it from coming loose. Use a sharp pair of haircutting scissors to cut your hair just above the elastic, then shake out your hair. [5] X Research source If your hair is quite thick , you may have to cut through the ponytail in more than one section. Just make sure you cut each section at the same length, just above the elastic. Be careful not to cut at an angle or let the scissors slip. Cut straight across for even layers ."
    },
    {
      "title": "Examine your layers.",
      "content": "Examine your layers. This method creates a few face-framing layers in the front with longer layers in the back. If you'd like to adjust the length of your layers, use the scissors to carefully cut individual locks of hair. Make sure that you go slow and cut with caution to reduce the chances of making a mistake or cutting off too much hair."
    },
    {
      "title": "Get your hair ready for layering.",
      "content": "Get your hair ready for layering. It's better to layer short hair when it's evenly damp, so that you can cut the hair with greater precision. Wash and condition your hair as usual, then towel it dry in preparation for the haircut. Layering short hair is more difficult to do by yourself than layering long hair, since you're creating each layer individually. Keep in mind that this method will only work for pixie style cuts. Take a look at your hair and decide exactly where you want the layers to be and how short you want them before you begin. Plan to cut your hair in a well-lit bathroom with at least two mirrors, so you can check your progress often and see the back of your head as well."
    },
    {
      "title": "Comb your hair into sections.",
      "content": "Comb your hair into sections . Short hair must be divided into sections before layering. Use a comb to carefully divide your hair in the following way: Make a \"top box\" section by creating a part on either side of the crown of the head where the head begins to round. The two parts create a section of hair in the middle of the head. Comb this \"top box\" forward and comb the hair to either side straight down, so that the sections are clearly delineated. It may also help to twist your hair before clipping it. Divide the rest into two parts: the first part extends from the crown of your head to your forehead, and the second part extends from the crown of your head to the nape of your neck."
    },
    {
      "title": "Use a comb to lift the frontmost section of the top box.",
      "content": "Use a comb to lift the frontmost section of the top box. Lift the hair at a ninety-degree angle from your head and hold it straight between your forefinger and middle finger. Your fingers should be perpendicular to your forehead."
    },
    {
      "title": "Trim",
      "content": "Trim the top box. Use a sharp scissors to trim the tips of the hair extending from between your fingers. Let the hair fall, then use the comb to lift another section of hair in the section of hair that is immediately behind the front section. Then comb a bit of the hair from the first section into this new section. This will serve as a guide for the correct length. Hold it at a 90-degree angle from your head between your forefinger and middle finger, then trim the tips to the exact same length as the first section of hair you trimmed. Continue trimming hair from the top until you've trimmed the entire front and back sections of the box. Use a spray bottle filled with water to keep the hair damp as you go. If your hair gets too wet, then dry it off with a towel. Pay careful attention to which sections of hair have been cut and which still need to be cut. When you're working with short hair, cutting the same section twice can make a big difference. All hair should be trimmed to the same length. When the cut is finished, it will be layered in appearance."
    },
    {
      "title": "Part your hair",
      "content": "Part your hair down the middle. Once the entire top box has been trimmed, change the part of your hair by combing it to the sides so that you have a part straight down the middle."
    },
    {
      "title": "Trim the sides of your hair.",
      "content": "Trim the sides of your hair. Working from the front of your hair around the side to the back, lift sections of hair straight from the top of your head and hold them between your fingers. Hold your hair so that your fingers are perpendicular to your forehead. Use the scissors to trim the tips of your hair, then move on to the next section. Repeat until you've trimmed the top layer of hair on the side of your head, then do the other side."
    },
    {
      "title": "Examine your layers.",
      "content": "Examine your layers. If you see a spot that is uneven, or you want shorter layers, use the scissors to carefully trim your hair a small section at a time. At this point, you can also refine the edges. Comb your hair into the style you plan to wear it in and trim the edges. Check around the ears and the back of the hairline especially."
    }
  ]
}