{
  "url": "https://www.wikihow.com/Deal-with-a-Toxic-Roommate",
  "title": "How to Deal with Roommate Issues",
  "steps": [
    {
      "title": "An official agreement helps avoid a lot of conflict.",
      "content": "An official agreement helps avoid a lot of conflict. If you find that you and your roommate are arguing about who should do what around the house, sit down and come up with an agreement together. Talk about cleaning schedules, having guests over, and an acceptable quiet period when it’s time to go to sleep. [1] X Research source Make sure you listen to your roommate’s input about the agreement as well. Go into the conversation without judgment, and aim to be supportive. When you have your agreement all written out, post it in a common area where you can both reference it at any time."
    },
    {
      "title": "Keep yourself safe from manipulation by standing up for yourself.",
      "content": "Keep yourself safe from manipulation by standing up for yourself. When you have a toxic roommate, they might try to manipulate you into doing their chores or letting bad behavior slide. Let your roommate know that you won’t stand for that by stating your boundaries clearly. [2] X Research source “From now on, I won’t be able to help you with your chores anymore. I have a ton of school work to do, and I also have my own chores.” “I’d appreciate it if you wouldn’t talk badly about me to your friends. It’s hurtful to hear the things you’ve said about me, and I’d rather you bring up problems with me face to face.”"
    },
    {
      "title": "Letting things fester might make your living situation worse.",
      "content": "Letting things fester might make your living situation worse. While it can seem easier to let things go, in the long-run, you’ll be much happier if you confront your roommate head-on. If your roommate isn’t holding up their end of the bargain, have a chat with them and talk about what’s going on. [3] X Research source “Hey, could we talk for a second? There are some dirty dishes in the kitchen, and they’ve been there for a few days. Just wanted to see if you’re going to do them soon.” “Could we maybe have a set quiet period at night? I’m having trouble sleeping, especially when you have a lot of people over.”"
    },
    {
      "title": "Your roommate will be more likely to change if you have a solution in mind.",
      "content": "Your roommate will be more likely to change if you have a solution in mind. When you bring up a problem with them, don’t treat it like an attack or a blame session. Instead, come up with a solution ahead of time, then get their input on it. Toxic people are usually more receptive if they feel like you’re having a conversation instead of attacking them. [4] X Research source “I was wondering if we could both agree to check in with each other before we throw parties. That way, we can fit them into our schedule so they work for both of us.” “What if we made a chore chart? It would definitely help me track my chores so I know I’m getting them done.”"
    },
    {
      "title": "Having empathy might make them a little easier to live with.",
      "content": "Having empathy might make them a little easier to live with. Although your roommate’s toxic behavior can be annoying, they’re probably not doing it on purpose. A lot of times, toxic people do the things they do because they aren’t sure how to express themselves. Try to see the good in your roommate, too. [5] X Research source If they’re constantly passive aggressive, they might not know how to bring up things that are bothering them. If they always gossip about other people, they might be feeling insecure or jealous of others. Try to recognize that your roommate’s problems are their own, not yours. The more energy you can put into your own well-being, the better."
    },
    {
      "title": "Calling them out might shut them down before they can continue.",
      "content": "Calling them out might shut them down before they can continue. A lot of toxic people keep being toxic because no one calls them out on it. If your roommate does or says something that rubs you the wrong way, calmly but firmly tell them that it wasn’t okay. Try to do it privately so they don’t feel attacked, and don’t back down if they make excuses or push back. [6] X Research source If your roommate overreacts about something super small: “Don’t you think you might be overreacting a little? You did pretty much the same thing last week, and I didn’t yell at you about it.” If your roommate is being passive aggressive: “Hey, is something bothering you? I can tell you’re upset because you aren’t talking to me. Why don’t we sit down and have a conversation about whatever it is.” If your roommate talks about you behind your back: “If you have a problem with me, I’d love it if we could talk it out together. Hearing about our issues from other people isn’t fun.”"
    },
    {
      "title": "Positive reinforcement can help your roommate continue to do better.",
      "content": "Positive reinforcement can help your roommate continue to do better. If you notice that your roommate is trying hard to be a better person to live with, thank them for it so they know you’ve noticed. You don’t have to go over the top (since that could seem a little patronizing), but a quick “Hey, thanks,” can really encourage them to keep going. [7] X Research source “Thanks for doing the dishes. The kitchen looks great!” “Hey, thanks for using headphones last night to listen to music. I slept great.”"
    },
    {
      "title": "Let your roommate know that they can’t talk badly about others with you.",
      "content": "Let your roommate know that they can’t talk badly about others with you. It can be exhausting to come home after a long day and immediately hear your roommate launch into a long, negative rant. Give them as little of a reaction as possible so they get the hint and stop complaining to you all the time. [8] X Research source If they really aren’t getting the hint, try saying something like, “Hey, sorry to interrupt, but I’ve got a huge day tomorrow and I need to get to bed.” If your roommate gossips about you, try to surround yourself with supportive friends. They can help deflect rumors and prove that what your roommate said isn’t true."
    },
    {
      "title": "Unfortunately, gossip usually makes situations worse.",
      "content": "Unfortunately, gossip usually makes situations worse. While it might be tempting to vent about your roommate to your friends or on social media, you don’t want to talk badly about them. More often than not, your words will get back to them, and it can break down any relationship you had with each other. [9] X Research source Plus, you want to hold yourself to the same standards that you hold your roommate. If you ask them not to talk badly about you, you shouldn’t talk badly about them, either."
    },
    {
      "title": "Find somewhere you can relax if your place isn’t ideal.",
      "content": "Find somewhere you can relax if your place isn’t ideal. Roommate problems can really take a lot out of you, and your home might not be the most comfortable place to be. Try hanging out with friends or going to the library when you just need some peace and quiet. [10] X Research source If you have a partner, consider spending a few nights a week at their place, if they’re okay with it. You may also want to start looking for a new living situation. Living with a toxic person can be exhausting, and you deserve to feel relaxed in your own home."
    },
    {
      "title": "Headphones help you tune out your roommate’s annoying habits.",
      "content": "Headphones help you tune out your roommate’s annoying habits. If your roommate won’t stop listening to loud music or making tons of noise in the kitchen, headphones can be your best friend. Buy a good pair that you can use when you need some alone time in your room to tune everything else out. [11] X Research source If you’re having trouble sleeping, invest in a good pair of earplugs, too."
    }
  ]
}