{
  "url": "https://www.wikihow.com/Gain-Weight",
  "title": "How to Gain Weight Fast (and Safely): Expert-Backed Advice",
  "steps": [
    {
      "title": "Add calories to the meals you make.",
      "content": "Add calories to the meals you make. When you are preparing food, think of some creative ways to bump up the calorie count . Could your sandwich use a slice of cheese? How about poaching an egg in your reheated soup? Drizzle olive oil on your vegetables, or sprinkle seeds, nuts, or cheese on your salad. [1] X Research source"
    },
    {
      "title": "Stock up on high-fat snacks.",
      "content": "Stock up on high-fat snacks. Fat is an essential part of your diet, and eating it can be a healthy way to regulate your weight. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Eat nuts, seeds, and seed and nut butters. Try cheese and crackers, or dried fruit and full-fat yogurt. Hummus is great on bread or vegetables, and with plenty of tahini and olive oil it can help you up your calories. Olives and cheese are great when you want something really savory. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Keep spreads such as guacamole, tapenade, pesto, and hummus in your fridge for easy snacking. Carry nut-bars to fill your cravings when you're out and about."
    },
    {
      "title": "Drink milk",
      "content": "Drink milk and other high-calorie beverages. Drinking water is good for you, but it can blunt your appetite. If you find yourself filling up on liquids during meals, try to make those liquids count. Drink milk, smoothies , and shakes . [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Go for full-fat milk rather than skim. [5] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source Put peanut butter or protein powder in your smoothies and shakes. Plant-based milks like coconut milk and peanut milk are fattening and delicious. Try traditional nutritious drinks from around the world. Kefir, horchata, chia fresca, lassi, misugaru, and telba are all high in calories and proteins. Drink water and low-calorie beverages after you have eaten."
    },
    {
      "title": "Get your proteins",
      "content": "Get your proteins . Protein is essential for weight gain. Red meat can help you gain weight, especially if you are working on building muscle. Salmon is high in calories and healthy fats. Yogurt is high in protein. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Other oily fish can also help you gain weight. Keep canned sardines and tuna in your pantry. Beans are a great source of proteins and of starch. If you are struggling to include enough protein, you can use a supplement such as whey protein ."
    },
    {
      "title": "Eat vegetables and fruits with some heft.",
      "content": "Eat vegetables and fruits with some heft. Instead of filling up on celery and other watery vegetables, eat vegetables with some calories. Avocados have healthy fat and are a versatile ingredient. Starchy vegetables like potatoes , sweet potatoes , squash, and corn can help you gain weight as well. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Fruits like bananas , blueberries , grapes, and mangoes can give you calories and fiber."
    },
    {
      "title": "Get whole grain bread.",
      "content": "Get whole grain bread. Whole-grain bread, kinds of pasta, and crackers have more nutrients and more calories than processed grains. Enjoy your bread with butter, olive oil, peanut butter, avocado, or a drizzle of tahini and honey. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Have some dessert.",
      "content": "Have some dessert. While you shouldn't rely on sugary food, the occasional sweet snack is fine. Don't worry about occasionally indulging in cake or ice cream. If you crave dessert every night, try for small portions and healthier options: dark chocolate, whole fat yogurt with fruit and granola, trail mix, granola bars, or whole grain pastries. [9] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source"
    },
    {
      "title": "Eat more meals.",
      "content": "Eat more meals. If you are underweight, you may fill up quickly. To remedy this, eat more meals. Try to fit 5-6 smaller meals into your day, rather than relying on three. Eat snacks in between. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Eat one meal or snack right before bed. Eating before sleeping can help you gain weight."
    },
    {
      "title": "Build your muscles with strength training.",
      "content": "Build your muscles with strength training. Muscle weighs more than fat, so you'll gain weight as you build muscle. Get some strength training exercise at least twice a week. You can strength train at home by doing crunches , lunges , and squats . Lift weights , exercise with kettlebells and medicine balls, or use tubes. [11] X Research source If you belong to a gym, you can train on the weight machines. Sign up for a Pilates class. Take a class or watch an exercise video before embarking on a new form of exercise. Remember, stop if you are in pain. If something hurts, you are at risk of injury."
    },
    {
      "title": "Get aerobic exercise.",
      "content": "Get aerobic exercise. Regular aerobic activity won't pack on the muscle as quickly as strength-training, but it will help you balance your workout routine. Cardiovascular exercises strengthen your heart, improve or manage some chronic health conditions like high blood pressure or diabetes, and give you more stamina throughout the day. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Cardio exercises can include: jogging or walking , biking, swimming or hiking . If you're performing aerobic exercises and are having trouble maintaining your weight, you may need to decrease the intensity, frequency, or duration of your aerobic exercises."
    },
    {
      "title": "Eat before and after your workout.",
      "content": "Eat before and after your workout. Carbohydrates will help your stamina before you work out, while carbohydrates and protein together will help your muscles heal after you work out. [13] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Get a small meal or a snack in at least an hour before exercising. If you have eaten a large meal, wait three to four hours before you exercise. Good post-exercise snacks might include peanut butter sandwiches, yogurt, and fruit, chocolate milk and crackers, or a smoothie with milk, yogurt, or whey protein."
    },
    {
      "title": "See a personal trainer.",
      "content": "See a personal trainer. If you're having trouble finding a workout routine that works for you, a personal trainer can get you on track. They'll be able to guide you through specific exercises or routines that can help you add weight. Check at a local gym for a trainer. Many times you can see a trainer there and they may even offer a discounted consult for your first visit. Talk to your trainer about your weight and goals. Tell them you're interested in healthy weight gain."
    },
    {
      "title": "Gain weight slowly.",
      "content": "Gain weight slowly. Quick weight gain is neither healthy nor practical. If you are eating so much you feel uncomfortable, you might be doing other harm to your body. Avoid binging: stop eating when you feel full. If you're worried you didn't eat enough, make it up with a small snack later. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Set your weight gain goal in cooperation with your physician, dietitian, or personal trainer. You can realistically gain 1 to 2 pounds (0.45 to 0.91 kg) of muscle weight per month if you are committed to your weight gain and work out regimen. You may gain more per month, but it will be a mix of muscle and fat. Healthy weight gain is about 1 to 2 pounds per week. If you’re not a weight lifter, you can gain about 2 to 4 pounds (0.91 to 1.81 kg) of both muscle and fat weight a month. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Skip junk food",
      "content": "Skip junk food . While increasing your calorie intake would be a lot easier if you just ate fast food every meal, your health would suffer in every other way. Instead, focus on preparing your own food if you have the time. If you hate cooking or are too busy, find healthy ways to eat out. Stores that list all the ingredients of your meal, like sandwich shops and smoothie shops, are a good bet. If you would like to make your own food but are always busy during the week, try to make a lot of food over the weekend. You can freeze half of what you make if you're worried about it going bad. As a rule, avoid fried food, sugary snacks, soda, and candy."
    },
    {
      "title": "Talk to a doctor or dietitian.",
      "content": "Talk to a doctor or dietitian. If you are having unintended weight loss, talk to your doctor. It's possible that there's an underlying problem causing you to lose weight. Your doctor can check your thyroid and see if you have a hormonal imbalance. If your doctor can't help you, visit a dietitian for advice. [16] X Research source"
    }
  ]
}