{
  "url": "https://www.wikihow.com/Fish-on-Animal-Crossing",
  "title": "How to Fish on Animal Crossing",
  "steps": [
    {
      "title": "Buy a fishing rod.",
      "content": "Buy a fishing rod. In most Animal Crossing games, you can purchase a fishing rod from Tom Nook's Shop from Tom Nook or his nephews Timmy and Tommy. You can buy a fishing rod at the following locations in each game: Animal Crossing (original), and Wild World ー Purchase a fishing rod from Tom Nook's shop for 500 Bells. City Folk ー Purchase a fishing rod from Tom Nook's shop for 500 Bells. A silver fishing rod is available for 500 Bells on rare occasions. New Leaf ー Purchase a fishing rod from the Nookling's Shop for 500 Bells. You can get a silver fishing rod after donating 30 fish to the museum. You can get a gold fishing rod from Chip during the next fishing tourney if you have every fish in your encyclopedia. [1] X Research source New Horizons ー Purchase a flimsy fishing rod from Timmy Nook at Resident Services for 400 Bells. Alternatively, you can take Tom Nook's DIY course after Day Two. Upon completion, you will receive a recipe to craft a flimsy fishing rod from five tree branches at a crafting table. You can find a crafting table at Resident Services. A regular fishing rod is available after you purchase \"Everyday tools A-Z\" from the Nook Stop for 3000 Nook miles. Better quality fishing rods are available for 2,500 Bells at the cabinet at Nook's Cranny after the first upgrade. [2] X Research source Golden Fishing rod ー In order to receive the golden fishing rod, a player must catch all of the fish in the game and donate them to the museum. The number of fish is 40 in Animal Crossing, 56 in Wild World, 64 in City Folk, 72 in New Leaf, and 80 in New Horizons."
    },
    {
      "title": "Choose a fishing spot.",
      "content": "Choose a fishing spot. In each Animal Crossing game, certain types of fish can be found in different bodies of water. Some fish can be found in multiple locations. Some fish can only be found at certain times of the day or certain times of the year. The following is a list of the fish: [3] X Research source [4] X Research source Ocean ー Sharks, barred knife-jaw, blue marlin, butterflyfish, clownfish, coelacanth, dab, football fish, hammerhead shark, horse mackerel, jellyfish, lobster, moray eel, napoleon fish, ocean sunfish, octopus, olive flounder, pufferfish, ray, red snapper, sea bass, sea butterfly, seahorse, shark, squid, surgeonfish, tuna, and zebra turkey-fish. Holding pond ー Frogs, crawfish, killifish, tadpole, koi, goldfish, carp, gar, catfish, giant snakehead, goldfish, pop-eyed goldfish, ranchu goldfish. River ー Guppy, nibblefish, bitterling, angelfish, neon tetra, piranha, arowana, dorado, gar, arapaima, pike, black bass, yellow perch, bluegill, eel, giant snakehead, loach, freshwater goby, soft-shelled turtle, barbed steed, carp, dace, crucian carp, pale chub, sweetfish. River mouth ー Salmon, king salmon, sturgeon. Pier (New Horizons) ー Tuna, blue marlin, sturgeon, giant trevally. Clifftop (New Horizons) ー Cherry salmon, char, golden trout, stringfish. Keep in mind that some of this varies in each game. For example, in New Leaf, a char is found at the bottom of the waterfall and a catfish can be found in the river pond (the part of your river that is significantly wider than the rest). In New Leaf, some ocean fish can only be found at the island."
    },
    {
      "title": "Equip the fishing rod.",
      "content": "Equip the fishing rod. In order to use the fishing rod, you must have it in your inventory and equip it. Use the following steps to equip your fishing rod: Press Y to open your inventory. Press A select the fishing rod. Select \" Hold \". You can also use the D-pad on your DS to equip your fishing rod. This is a quicker and more efficient way of equipping tools. Press the side buttons until you get to the fishing rod."
    },
    {
      "title": "Look for silhouettes of fish.",
      "content": "Look for silhouettes of fish. Fish that you can catch appear as shadows in the water. Do not run. This scares the fish away. In New Horizons, you can get fish to appear by using bait. To use bait, get the DIY recipe for fish bait. Fish bait is crafted from manila clams which are found along the beach. Look for holes that squirt water along the beach. Use the shovel to dig up a manila clam. The first time you dig one up, you will get a DIY recipe for fish bait. Craft fish bait using the crafting table. Select the fish bait in your inventory and select Scatter food while standing before water. This causes fish to appear. [5] X Research source All fish take on different sizes, if they have one rounded edge anyone pointy edge, it's a fish. If you notice a silhouette that looks more like a bug than a fish, it is likely a diving beetle, you can catch them with your net. See this guide to catch a diving beetle."
    },
    {
      "title": "Press the A button to cast the line.",
      "content": "Press the A button to cast the line. Try to cast your line so that the lure lands in front of the fish. This will make it easier for the fish to see your line."
    },
    {
      "title": "Wait until the fish bites.",
      "content": "Wait until the fish bites. A fish nibbles four or five times before a bite. Watch the bobber for when the fish bites. You will also hear a \"bloop\" sound, which is louder than the rest, when the fish bites. There would be times where a fish will nibble on the bait and swim away. If this happens, you'll need to recast your line. Sometimes the fish will turn around and come back, so wait a moment to see if it does. If you pull out the rod prematurely, while the fish is facing the rod, it will disappear."
    },
    {
      "title": "Press the A button as soon as the fish bites.",
      "content": "Press the A button as soon as the fish bites. When the fish pulls the bobber below the water surface, press A immediately. There are some fish that you can be relaxed on to catch them, but there are others that you need precise timing to get them successfully."
    }
  ]
}