{
  "url": "https://www.wikihow.com/Feed-a-Betta-Fish",
  "title": "How to Feed a Betta Fish",
  "steps": [
    {
      "title": "Get an amount the size of its eyeball.",
      "content": "Get an amount the size of its eyeball. A betta’s stomach is roughly the size of its eyeball and should not be fed a meal larger than that at once. [2] X Expert Source Craig Morton Aquarium Specialist, Aquarium Doctor Inc. Expert Interview. 21 July 2020. This translates to about three pellets or brine shrimp per feeding. If you feed gel food, it should be about the same amount. A betta can be fed this amount once or twice a day. [3] X Research source It's advisable to soak dried foods (such as pellets) before feeding, because some of these items may expand in the betta's stomach when dry."
    },
    {
      "title": "Reduce if they aren’t eating it all.",
      "content": "Reduce if they aren’t eating it all. If your fish isn’t eating all of its food, reduce the amount you’re feeding them. If you usually feed four pellets per fish, try reducing to three for a while. If you notice the fish is eating very quickly, you can increase back to 4."
    },
    {
      "title": "Scoop out uneaten food.",
      "content": "Scoop out uneaten food. Uneaten food can attract bacteria that is bad for water chemistry and the fish. This is especially problematic if the fish eats the food after it has gone bad. Use a small net that you would use to scoop out excrement or transfer the fish to another container."
    },
    {
      "title": "Feed it regularly.",
      "content": "Feed it regularly. A betta should be fed every day or nearly every day. Two feedings evenly spaced out should do it. If you keep a betta in the office and you can’t feed it on the weekends, it will be just fine as long as you feed him the other five days per week. Remember to leave one day of fasting for your betta fish. It will suit its needs. [4] X Research source It takes a betta about two weeks to starve to death, so if your fish doesn’t eat for a few days due to illness or adjusting to a new home, don’t panic. But you obviously should not test the limits of how long a betta can go without food!"
    },
    {
      "title": "Add some variety.",
      "content": "Add some variety. In the wild, betta fish prey on a variety of smaller animals. Feeding your betta the same type over a long period can harm their immune system and cause them to eat less. [5] X Research source You can change up the type of food as often as you’d like. Try to feed the betta at least one type of food that is different from what you normally feed it at least once a week."
    },
    {
      "title": "Feed it worms.",
      "content": "Feed it worms. Various species of small aquatic worms make up the core diet of betta fish in the wild. The most common worm for betta fish is the bloodworm, which comes live, freeze-dried, frozen, or in a gel, but these aren't very nutritious and are better used as treats. Brine shrimp is a good option or glassworms (tubifex worms), but specially made betta pellets and gels are best. [6] X Research source Live tubifex often carry parasites or bacteria, so they should be avoided. The best live worms to use are white worms, grindal worms, and black worms. These worms are available at most major pet stores."
    },
    {
      "title": "Feed it insects.",
      "content": "Feed it insects. You can use either live or frozen insects. The best options are Daphnia, also known as a water flea, and fruit flies. [7] X Research source These insects will be available at most pet stores. Flightless fruit flies are often sold live in jars for reptile use but are also useful for feeding fish. To serve the flies, shake some into a plastic bag and place in the freezer for a few minutes. This will slow down the insects. Then, quickly pour the flies into the tank. Scoop out any that are not eaten."
    },
    {
      "title": "Feed it other options.",
      "content": "Feed it other options. There are various frozen meats that betta fish can also eat. You can use brine shrimp, mysis shrimp, or frozen beef heart. These options will be available at most major pet stores. [8] X Research source Beef heart and rich meats can dirty the tank with oils and proteins, so this should be a rarer treat."
    },
    {
      "title": "Avoid overuse of dry food.",
      "content": "Avoid overuse of dry food. This includes flakes or freeze-dried foods. Some fish foods will be marketed as being for bettas but could still cause digestion problems because of indigestible fillers and a lack of moisture. These pellet foods absorb water and expand in the fish’s stomach to 2 or 3 times their original size. Some bettas will have bad reactions, potentially developing problems with constipation or bladder disorders."
    },
    {
      "title": "Soak dried pellets.",
      "content": "Soak dried pellets. If dried foods are the only thing available, soak them in a glass of water for a few minutes before feeding them to your betta. This will expand the pellet to its full size before the betta digests it. [9] X Research source Do not overfeed your betta and cut its portion if you notice abdominal bloating. You may want to switch to live foods if your betta is consistently bloated."
    },
    {
      "title": "Don’t always follow the directions on food labels.",
      "content": "Don’t always follow the directions on food labels. Fish pellets or flake containers often say “Feed what your fish will eat in 5 minutes or until it stops eating.” This does not apply to betta fish. In the wild, their instinct is to eat as much as possible because they don’t know when their next meal is coming. Overfeeding can also lead harm the water quality and cause obesity. [10] X Research source"
    }
  ]
}