{
  "url": "https://www.wikihow.com/Dominate-at-Thumb-Wars",
  "title": "How to Dominate at Thumb Wars",
  "steps": [
    {
      "title": "Inspect your hand.",
      "content": "Inspect your hand. Every hand is different, and some hand shapes can give a person an edge in thumb wars. Long thumbs are great for offense, but terrible for defense. A hitchhiker's thumb is useful for defense, as you can bend it upwards while pinned to make the pin no longer count. A double jointed thumb is the greatest advantage a thumb wrestler can have - it doubles your reach and makes your thumb too agile to pin. A short thumb has concentrated muscle, which is useful for offense, getting out of a pin, and being hard for your opponent to reach. A large hand is good for reach and gives you the ability to move your thumb out of your opponent's reach so you can rest a minute. A small hand makes it easy to get out of a pin, but offense can be difficult."
    },
    {
      "title": "Keep your hands clean.",
      "content": "Keep your hands clean. If thumb wrestling is a consistent part of your week, wash your hands often."
    },
    {
      "title": "Pick a chant that you like and keep it consistent.",
      "content": "Pick a chant that you like and keep it consistent. Using the same chant will give you knowledge of which side your thumb will end up on after the chant, which will let you get a quick attack or dodge once it is over. \"One two three four, let's have a thumb war\" is a common one. Also, make sure that you know the joke chants just in case you have an opponent who thinks they are clever. If they use one such as \"One two three four, let's have a thumb war\", you don't want that to throw you off your quick attack or quick dodge. If they use joke chants, they may look for your reaction or possibly laugh themselves. This puts them in a vulnerable position. If you do a quick attack you will almost always be successful and immediately win. You will also look more mature if you do not react to their joke."
    },
    {
      "title": "Learn the quick attack.",
      "content": "Learn the quick attack. This is a term used for attacking immediately after the chant. Position your thumb before the chant so that after the chant you can get them with a counterclockwise (clockwise if lefty) attack. Counterclockwise is the more powerful direction for right handed thumb wrestlers. Be careful to make this attack quickly, powerfully, and carefully. If it is well executed, you are likely to win. If something goes wrong, a key element of this attack is getting out of the attack fast. You are very susceptible to counterattack if anything goes wrong. Being able to get out of the attack quickly if it fails is more important than being able to consistently score a fast win. After all, there are no points for winning quickly. If properly executed, this attack should look like a semicircle mostly vertical yet slanted a bit away from your body."
    },
    {
      "title": "Get good at maneuvering your thumb with no intention of attacking.",
      "content": "Get good at maneuvering your thumb with no intention of attacking. Between battles you should move your thumb in a pattern that you can do quickly. If done properly, you're opponent should have a hard time aiming an attack at your thumb, and it should put you in a position that you are comfortable coming in to an attack with, or moving your thumb farther away."
    },
    {
      "title": "Familiarize yourself with the main different types of pins.",
      "content": "Familiarize yourself with the main different types of pins. Thumb on the fingernail is the weakest pin there is. Being pinned down on the joint in the middle of the thumb The one who is pinned should force their thumb downwards and then a quick jerk directly own in a straight line towards their body. Being pinned down behind the joint in the middle of your thumb. Note that this pin can come from either side of your thumb whereas the other two usually come from head on. If you get in this type of pin (the opponents thumb horizontal across the stem of your thumb) look where the thumb has an opening, on the side where it is not connected to the hand. force your thumb towards the opening and you should get out okay. That is the most difficult pin to escape. As a general rule of thumb for escaping pins, push down as you make your escape, and quick jerks always beat constant outward pressure."
    },
    {
      "title": "When you get your opponent in a pin, try to feel them out.",
      "content": "When you get your opponent in a pin, try to feel them out. Pin with as little pressure as you need to. If you feel a quick jerk coming, add pressure as try to get away, moving your hand with theirs."
    },
    {
      "title": "Counter Attack",
      "content": "Counter Attack The method for a counterattack is to slide out and pin your opponent very quickly. Counterattacks have a higher chance of landing a fatal pin because you can your opponents downward force against them for a second or two. Counterattacking takes some planning. For a fingernail pin, you want to slide downwards and then swoop over their thumb to get a behind the joint pin. The other two types of pins require you to slide downwards, touching their thumb for the downward slide and then using the base of your thumb, which is most likely touching the tip of their thumb, as a fulcrum you can leverage a strong pin either on or behind the joint. Counterattacks are the most effective attacks but are the hardest to execute and require you to be in a dangerous situation to even attempt one. A good thumb wrestler won't rely on them but will never miss a chance. You can also set up a counter attack to take place by leaning your thumb forward and making it a vulnerable target. Your opponent will then try to pin you down and as they're coming down come out of the position from the side and collapse on top of their thumb. You must be very skilled and have fast reflexes. If you are not a godly thumb wrestler you may just lose abruptly when they pin you too fast for you to counter, so be careful!"
    },
    {
      "title": "Never fast count.",
      "content": "Never fast count. If you are going to be a pro you have to be perfectly fair. Every win must be indisputable."
    },
    {
      "title": "Rely on your sense of touch primarily.",
      "content": "Rely on your sense of touch primarily. Feeling something and having a reflex is much quicker than seeing something, considering your next move, and then reacting. Practice by looking away during some of the thumb wars against opponents that you are confident about beating."
    }
  ]
}