{
  "url": "https://www.wikihow.com/Do-Padme-Hairstyles",
  "title": "How to Do Padme Hairstyles",
  "steps": [
    {
      "title": "Brush out your hair.",
      "content": "Brush out your hair. This method will show you how to make the mini buns that Padme wore during the celebration at the end of The Phantom Menace. Your hair should fall past your collarbone and shoulders in order for this to work. If you have curly or wavy hair, use a straightening iron to smooth out your hair and fit the look."
    },
    {
      "title": "Choose a necklace to use as the headpiece.",
      "content": "Choose a necklace to use as the headpiece. In the movie, Padme wears a circlet in her hair that droops down across her forehead. Find a silver necklace with a crystal or pendant that looks similar to the one in the movie. Make sure that the necklace is closed. [1] X Research source Choose a necklace with a smaller chain. It needs to sit on top of your head, like a crown, with the pendant falling over your forehead. A smaller necklace would work best. You can also use an actual hair circlet instead, but the necklace may be more comfortable to wear."
    },
    {
      "title": "Gather and clip a U-shaped section of hair from the top of your head.",
      "content": "Gather and clip a U-shaped section of hair from the top of your head. The section should span the width of your forehead, and extend towards your crown in a curved U-shape. Twist the section into a temporary bun, and secure it with a clip. [2] X Research source For best results, use the handle of a rat-tail comb to separate the hair. How far back you extend the section depends on the length of your necklace. You want the necklace to droop past your hairline, with the pendant over your forehead."
    },
    {
      "title": "Place the necklace over your head.",
      "content": "Place the necklace over your head. Nestle the chain around the back and side edges of the gathered hair. Let the pendant fall forward, past your hairline and across your forehead. Make sure that the clasp of the necklace is on the back of your head, out of sight. [3] X Research source If the chain is too long, take the necklace off and re-gather the hair at the back of your head, this time extending it further back. Your hair will hold the necklace in place. You do not need to pin the necklace."
    },
    {
      "title": "Gather all of your hair into mid-high ponytail.",
      "content": "Gather all of your hair into mid-high ponytail. Use your hands to smooth all of your hair, including the hair on the top of your head, back into a ponytail. Secure the ponytail with a hair tie that matches your hair color. [4] X Research source Make sure that your hair covers the necklace's chain. The only part of the chain that should be visible is the part that is sticking out of your hairline at the front."
    },
    {
      "title": "Take a thin section of hair from the top of the ponytail and tie it into a looped bun.",
      "content": "Take a thin section of hair from the top of the ponytail and tie it into a looped bun. Gather about a fifth of the ponytail, and begin to tie it into a mini ponytail with a clear hair elastic. On the second-to-last wrap, pull the ponytail only partway through the elastic. Wrap the elastic two more times around the looped bun. [5] X Research source Keep the looped bun small—no taller than your pinkie. You will have a long tail of hair sticking out from under the bun. Make sure it is pointing downward. You will be splitting the hair in your ponytail into five buns, so plan accordingly."
    },
    {
      "title": "Create four more mini buns, two on each side.",
      "content": "Create four more mini buns, two on each side. Make sure that you are pulling the same amount of hair into each bun. Have all of the tails pointing towards the middle of the ponytail. This means that the two left buns should be pointing to the right, and the two right buns should be pointing to the left. [6] X Research source"
    },
    {
      "title": "Twist the tails into thin ropes, then coil and pin them.",
      "content": "Twist the tails into thin ropes, then coil and pin them. Pluck out a tail from one of the buns. Twist it into a tight, thin rope. coil it into a random, abstract shape between the buns, and secure it with a bobby pin. Repeat this step for the other tails. [7] X Research source Make sure that you use bobby pins that match your hair color."
    },
    {
      "title": "Spread the buns apart to form fan shapes.",
      "content": "Spread the buns apart to form fan shapes. Gently pull on the side edge of your first bun until it flattens and turns into a fan. If you need to, lightly mist the bun with hairspray first. Repeat this step for the other buns. [8] X Research source The final look will create a segmented halo. The side buns should be parallel to each other on the side of your head, and the top fan should be perpendicular to the buns."
    },
    {
      "title": "Set the style with hairspray.",
      "content": "Set the style with hairspray. Once the hairspray dries, you are good to go. If this is for a costume and you did not put on your makeup yet, now is the time to do so. You will need to lift the pendant up and out of the way while applying your foundation and powder, however."
    },
    {
      "title": "Brush out your hair.",
      "content": "Brush out your hair. T is the hairstyle Padme wore in the Gladiator Ring during Attack of the Clones. It will look a little like a funnel cake. [9] X Research source Your hair should fall at least pat your shoulder for this to work, although longer will be better."
    },
    {
      "title": "Gather your hair into a mid-high pony on the back of your head.",
      "content": "Gather your hair into a mid-high pony on the back of your head. Tie the ponytail off with a hair tie that matches your hair color. Make sure that the hair going into the ponytail is nice and smooth, with no bumps. Use a hairbrush while making the ponytail, if necessary. [10] X Research source"
    },
    {
      "title": "Twist a thin section of hair from the ponytail into a rope.",
      "content": "Twist a thin section of hair from the ponytail into a rope. Take a ½-inch (1.27-centimeter) thick section of hair from the ponytail. Twist it into a tight rope. Apply pomade to the hair as you twist it to help keep it smooth. [11] X Research source"
    },
    {
      "title": "Pin the end of the rope to a random spot on the outside of the hair tie.",
      "content": "Pin the end of the rope to a random spot on the outside of the hair tie. Hold the rope in such a way that it remains twisted. Pull it over to a random spot on the outer edge of the hair tie, and secure it with a bobby pin that matches your hair color. [12] X Research source"
    },
    {
      "title": "Repeat the process until you run out of hair in your ponytail.",
      "content": "Repeat the process until you run out of hair in your ponytail. Keep twisting and pinning ½-inch (1.27-centimeter) thick sections of hair. Try to distribute the ropes evenly around the ponytail. If the loops are too big, pin them down by the middle. [13] X Research source"
    },
    {
      "title": "Add more bobby pins to refine your look, if necessary.",
      "content": "Add more bobby pins to refine your look, if necessary. If you have very long hair, your twisted rope may be sticking out in a big loop. Find the middle of that loop and press it down against the edge of the hair tie. Secure the rope with another bobby pin. [14] X Research source Work your way around your hair adding pins where necessary. If you have short hair, you may not need to do this."
    },
    {
      "title": "Adjust the loops, as needed, then set your style with hairspray.",
      "content": "Adjust the loops, as needed, then set your style with hairspray. Take a look at your updo in the mirror. If any loops look out of place or awkward, take a moment to adjust them. Once you are happy with the style, mist your hair with hairspray. [15] X Research source"
    },
    {
      "title": "Comb out your hair and add some extensions, if needed.",
      "content": "Comb out your hair and add some extensions, if needed. This is the hairstyle Padme wore on Mustafar during Revenge of the Sith. It has long braids that fall down Padme's back. Long, thick hair will work the best for this. If your hair is short or thin, you can braid extensions into your hair. Just make sure that they match your hair color! [16] X Research source If you are adding extensions, wrap a weft of the extensions around the base of your ponytail and blend it into your hair. Alternatively, you could braid loose hair extensions into your hair individually."
    },
    {
      "title": "Gather and pin the top half of your hair out of the way.",
      "content": "Gather and pin the top half of your hair out of the way. Use the handle of a rat-tail comb to split your hair in half horizontally, just above the tips of your ears. Gather the top section into a temporary bun and secure it with a hair clip. [17] X Research source"
    },
    {
      "title": "Braid the bottom half of your hair.",
      "content": "Braid the bottom half of your hair. This is a regular braid, with nothing special about it. Simply braid your hair until you have 1 to 2 inches (2.54 to 5.08 centimeters) left, then secure it with a hair tie, preferably a clear one. [18] X Research source For a more accurate look, wrap a brown, leather cord around the end of the braid to help hide the elastic. Tie the ends into a secure knot. If you added extensions, the wefts may show up at this point. Don't worry, they won't be visible in the end."
    },
    {
      "title": "Release and part the top half of your hair.",
      "content": "Release and part the top half of your hair. Undo the top half of your hair and part it down the middle. Drape the left side over your left shoulder. Keep the right side behind your right shoulder; you will be braiding this first. [19] X Research source"
    },
    {
      "title": "Rope braid the right side of your hair.",
      "content": "Rope braid the right side of your hair. Split the right side of your hair into two equal sections first. Twist each one separately clockwise into a rope. Next, twist the two ropes together counterclockwise to form a single rope. Secure the end with a clear hair elastic. [20] X Research source"
    },
    {
      "title": "Repeat the process for the other side.",
      "content": "Repeat the process for the other side. This time, do everything in reverse. Split the left side into two sections, then twist each one counterclockwise. Twist the ropes together clockwise to form a thicker rope, then secure it with a hair tie."
    },
    {
      "title": "Wrap the right rope braid counterclockwise once.",
      "content": "Wrap the right rope braid counterclockwise once. Find the point on your head where you started the rope braid; this will probably be somewhere along the lower-back of your head. Coil the rope counterclockwise once into a loose bun. Secure the bun with bobby pins that match your hair color. [21] X Research source Keep the bun loose for a fluffy, romantic look. Drape the rest of the rope over the top of your head so that it doesn't tug on the bun; you will come back to this later."
    },
    {
      "title": "Repeat the process with the left rope braid, but in reverse.",
      "content": "Repeat the process with the left rope braid, but in reverse. Find the spot on your head where you started the left rope braid. Coil it clockwise just one time into a loose bun, then secure it with bobby pins. Drape the tail end over the top of your head as well."
    },
    {
      "title": "Wrap the right rope braid around the left bun and back towards the right.",
      "content": "Wrap the right rope braid around the left bun and back towards the right. Take the right rope braid and pull it towards the left bun. Drape it over the top edge of the left bun, down the side, and around the bottom. Pull the braid back towards the top of the right bun, forming a figure 8, then secure it with bobby pins to both buns. [22] X Research source Remember to keep the wraps loose for a fluffy, romantic look. If you think your hair is too loose or it feels too heavy, you can add more bobby pins to stabilize your hair."
    },
    {
      "title": "Repeat the process for the left rope braid.",
      "content": "Repeat the process for the left rope braid. Pull the left rope braid towards the top of the right bun. Wrap it around the outside edge of the right bun, then cross it back over to the left. Pin the rope in place to both buns."
    },
    {
      "title": "Tuck and pin the ends of the rope braids under the buns.",
      "content": "Tuck and pin the ends of the rope braids under the buns. If you have very long hair, you may need to do the above two steps a few more times, or until you reach the ends. Once you reach the hair ties, tuck the end of each rope braid under each bun, and secure it with more bobby pins. [23] X Research source"
    },
    {
      "title": "Set the style with hairspray.",
      "content": "Set the style with hairspray. Focus on the buns themselves, as they will need more security than the braid. Once the hairspray is dry, you are all set!"
    }
  ]
}