{
  "url": "https://www.wikihow.com/Do-a-Sleeper-Choke-Hold",
  "title": "How to Perform a Sleeper Hold: Expert-Approved Instructions",
  "steps": [
    {
      "title": "Grip your opponent’s shoulders or arm to anchor yourself.",
      "content": "Grip your opponent’s shoulders or arm to anchor yourself. If your opponent is trying to fight you , grab their wrist with your nondominant hand and their upper shoulder with your dominant hand. If you’re wrestling your opponent, quickly grab your opponent’s shoulders and wrap your fingers around their shoulder blades to orient yourself. [1] X Research source Apply firm pressure with your hands after you’ve grabbed them to keep them from fighting their way free. You can drag your opponent to the ground to perform this hold or you do it while the both of you are standing. The mechanics don’t change much on the ground."
    },
    {
      "title": "Fight your way behind your opponent.",
      "content": "Fight your way behind your opponent. If you’ve grabbed your opponent’s shoulders, push them with your dominant hand. At the same time, pull with your nondominant hand to flip them around. Wrap your dominant arm around their chest or neck to hold them in place. If you grabbed their arm, pull their wrist towards you and shuffle to the side before sliding your dominant arm around their chest to spin them around. [2] X Research source If you’re smaller or they’re resisting your hold, place your inside leg behind them and pivot to move behind them. If you’re actively being attacked and you’ve grabbed their wrist, twist their wrist inwards as you pull them to disarm them . In a real street fight scenario, claw, kick, bite, or punch. Do whatever you have to in order to get behind your opponent."
    },
    {
      "title": "Wrap your dominant arm around your opponent’s neck.",
      "content": "Wrap your dominant arm around your opponent’s neck. Once you’re behind your opponent, hold them close and tight. Move your dominant forearm around their neck. Your opponent will likely raise their arms to protect their neck. This’ll give you the opening you need to place your nondominant hand behind their head. [3] X Research source If you’re being actively attacked, yank them from side to side while setting your grip up to disorient them and make it harder to fight back. When your opponent raises their arms to protect their neck, they’ll probably wrap their hands around your forearm and try to pull it off. Grab the back of their shoulder with your dominant arm—they won’t be able to pull you off."
    },
    {
      "title": "Tuck your forearm under their chin and wrap their neck tight.",
      "content": "Tuck your forearm under their chin and wrap their neck tight. Adjust your dominant arm by raising it up until your forearm is lodged firmly between your opponent’s chin and chest. Keep your arm wrapped tight around their neck to hold them in place. Grab their shoulder with your dominant hand to stabilize your grip. [4] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021. Unless you’re being attacked, do not yank them side to side once your arm is under their neck. You could damage your opponent’s spine permanently if you twist them."
    },
    {
      "title": "Put your nondominant hand behind their head.",
      "content": "Put your nondominant hand behind their head. Keep your dominant arm wrapped around their neck and move your nondominant hand behind your opponent’s head. This gives you the leverage you need to control where you’re applying pressure. [5] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021. The difference between a sleeper choke hold and a regular choke is where you apply pressure. That’s why controlling your opponent’s head is essential."
    },
    {
      "title": "Grab your nondominant bicep with your dominant hand.",
      "content": "Grab your nondominant bicep with your dominant hand. To stabilize your grip, thread your dominant hand inside the fold of your nondominant elbow. Wrap your fingers around your bicep to lock your opponent in place. This way, if your opponent tries to slide out, you can use the tension from your grip to easily increase pressure. [6] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021. This also gives your dominant hand something to hold on to. If you don’t grip your arm, you’re relying on the strength of your arm alone to keep your opponent grappled."
    },
    {
      "title": "Apply pressure to the sides of your opponent’s neck.",
      "content": "Apply pressure to the sides of your opponent’s neck. Bend your elbow and flex your dominant arm so that your forearm is applying pressure to one side of their neck and your bicep is applying pressure to the opposite side of their neck. [7] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021. Push your nondominant arm forward to tilt their neck forward towards their chest. This presses their chin into your forearm and provides additional pressure so you can begin restricting blood flow to their brain. [8] X Research source Lean back and spread your feet out as you’re applying pressure to brace for resistance. If you’re struggling to apply enough pressure, put your hip into the opponent’s back. The goal of a sleeper hold is not to restrict air. If you’re pushing down on your opponent’s throat, you’re not doing it correctly."
    },
    {
      "title": "Keep applying pressure until your opponent goes limp.",
      "content": "Keep applying pressure until your opponent goes limp. You’re now restricting blood flow to each of your opponent’s carotid arteries, so blood can’t flow to their brain. Eventually, they’ll pass out. [9] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021. If your opponent stops fighting back or they suddenly become really heavy in your arms, they’re out cold. Slowly lower them to the floor. [10] X Research source If you were being actively attacked, run away and get help immediately. Your opponent may go down in as little as 3-4 seconds! However, it may take up to 10-15 seconds for your opponent to pass out. If you restrict air instead of blood flow, you may kill your opponent. [11] X Research source"
    },
    {
      "title": "Perform a side-hold if you can only partially wrap them up.",
      "content": "Perform a side-hold if you can only partially wrap them up. If your opponent misses a punch, slide under their shoulder while their arm is extended. Wrap your dominant hand arm around the side of their neck and lock your arms together. Lift your opponent up and squeeze the side of your opponent’s neck. It’ll take a little longer for them to pass out, but they’ll go down soon. [12] X Research source"
    },
    {
      "title": "Opt for a front sleeper choke hold if you can’t get behind them.",
      "content": "Opt for a front sleeper choke hold if you can’t get behind them. If you can’t get behind your opponent, wrap your arms around the back of their neck when they lunge at you. Throw your feet behind you to put more weight on your opponent’s back and squeeze the sides of their neck. They’ll go limp eventually! [13] X Research source This is the same thing as a rear choke hold except you’re using your body weight instead of your upper body strength to keep your opponent locked in place."
    },
    {
      "title": "Use a guillotine choke if you end up on the ground.",
      "content": "Use a guillotine choke if you end up on the ground. If the fight is messy and you end up on the ground, get an arm around your opponent’s neck (either arm works). Then, grip the wrist of whatever arm you’ve got around their neck and pull. Either wrap your legs around your opponent’s torso to keep them from fighting back, or kick your legs out at an angle to tilt your opponent’s head down. [14] X Research source"
    },
    {
      "title": "Release your choke hold after 10 seconds unless you’re in immediate danger.",
      "content": "Release your choke hold after 10 seconds unless you’re in immediate danger. Unless you’re actively being attacked, release your choke hold after 10 seconds or so. If you continue to apply pressure to your opponent’s neck for 20-30 seconds, you may permanently injure them or even kill them. [15] X Research source If you’ve correctly applied pressure to the neck’s major arteries, your opponent should go limp after 5-10 seconds."
    },
    {
      "title": "Don’t restrict your opponent’s airflow unless it’s life or death.",
      "content": "Don’t restrict your opponent’s airflow unless it’s life or death. If you apply too much pressure to your opponent’s throat (the front of their neck), you may damage their windpipe. The goal of a sleeper hold is to restrict blood flow, not air, so only use force on the sides of your opponent’s neck. [16] X Expert Source Derrek Hofrichter Self-Defense Specialist Expert Interview. 26 January 2021."
    },
    {
      "title": "Stop choking your opponent if they tap on your forearm.",
      "content": "Stop choking your opponent if they tap on your forearm. The universal sign of surrender in martial combat is a light double-tap on an exposed section of your skin. This means that your opponent is giving up. Release your grip immediately if your opponent taps on your forearm while you’re choking them. You’ll see mixed martial artists do this when they’ve been placed in a submission hold that they can’t get out of. This is where the term “tap out” comes from."
    },
    {
      "title": "Avoid using the choke hold on someone with cardiovascular issues.",
      "content": "Avoid using the choke hold on someone with cardiovascular issues. The sleeper choke hold restricts blood flow to the brain. This means that individuals with heart or blood pressure problems can suffer a serious cardiac event if their blood flow is disrupted. Never perform this move on someone struggling with a heart condition unless you’re being actively attacked. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Call emergency services immediately if someone suffers a cardiovascular attack while you’re choking them or they don’t wake up after 10-15 seconds."
    }
  ]
}