{
  "url": "https://www.wikihow.com/Fix-a-Broken-Friendship",
  "title": "How to Fix a Broken Friendship",
  "steps": [
    {
      "title": "Be the one to reach out before the other.",
      "content": "Be the one to reach out before the other. If you aren’t talking to each other, someone will have to make the first move. Let it be you this time! It will show them that you want to be friends again and you’re serious about resolving things. Think about how you can reach them. Depending on the person and the severity of your argument, you may need to try a few different ways to get in touch. [1] X Research source"
    },
    {
      "title": "Get in touch with them however you can.",
      "content": "Get in touch with them however you can. If they won’t answer your phone call, leave a voicemail saying you really want to fix things, then text them with a similar message. [2] X Research source If they block your texts, email them. If your email is ignored, try to communicate with a private message through social media. If all else fails, you can try visiting them in person at their house. Reach out once and wait for a response before trying to reach them a different way. You don't want to make them feel harassed or pressured. If they agree to meet you via text or email, it may be best to meet in a mutual, public place so that neither of you feels intimidated or under pressure."
    },
    {
      "title": "Respect your friend’s need for space.",
      "content": "Respect your friend’s need for space. [3] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. If your friend refuses to see or speak with you, or if visiting them in person isn’t an option, you may want to just back off for a while. Your friend wants space and that should be respected. Use the time to reflect on the situation and prepare what you want to say. [4] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [5] X Research source Don’t push your friend if it’s clear they want space. It will only upset them and make them frustrated with you."
    },
    {
      "title": "Talk about the problem honestly and openly.",
      "content": "Talk about the problem honestly and openly. [6] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. Explain what you feel is the problem and be honest about it. Then ask them to do the same. Let them talk for as long as they need to. Really listen and don’t interrupt them. This way, you both get to tell your side of the story and get everything out on the table. [7] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [8] X Research source Express your feelings without using inflammatory or accusatory words. For example, instead of saying, \"You made a really dumb decision,\" ask your friend, \"Why did you decide to do that? I'm having trouble understanding.\""
    },
    {
      "title": "Use “I” statements when talking to them.",
      "content": "Use “I” statements when talking to them. This will prevent blame from being thrown around and create a more peaceful tone while you talk. For example, instead of saying \"You were a selfish jerk,\" say something like, \"I felt like you didn't care about my feelings, and I felt really hurt by the things you said.\""
    },
    {
      "title": "Apologize to them and accept their apology.",
      "content": "Apologize to them and accept their apology. Even if you didn’t do anything and you believe the situation is their fault, opening with an apology sets the tone. You could say, “I’m really sorry things have gotten to this point. I want things to be better between us.” [9] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [10] X Research source If you did wrong them in some way, apologize to them sincerely. If they apologize to you, accept their apology graciously. Reader Poll: We asked 598 wikiHow readers who’ve argued with a loved one, and 59% of them agreed that the best way to show your commitment to rebuilding the relationship is by apologizing and taking responsibility for your actions . [Take Poll]"
    },
    {
      "title": "Avoid restarting an argument.",
      "content": "Avoid restarting an argument. It's important that you don't say or do anything hurtful during this conversation. This will only further damage the friendship, and it may make things irreparable. Do your best to keep things peaceful. If things get heated, don’t allow them to escalate. [11] X Research source For example, if your friend says to you, “I just can’t believe you did that to me! I will never trust you again!” you can say something like, “I know, it was a really dumb thing for me to do. I am so sorry. I want to make things right, please tell me how I can do that.”"
    },
    {
      "title": "Let go of your anger or frustration.",
      "content": "Let go of your anger or frustration. If you’re really serious about rebuilding your friendship, it all starts with you releasing your negative feelings about the situation and truly forgiving your friend. Urge your friend to do the same. Leave the past behind and look to the future. [12] X Research source"
    },
    {
      "title": "Come up with a plan for rebuilding the friendship.",
      "content": "Come up with a plan for rebuilding the friendship. Ask your friend if there’s anything you can do differently in the future to keep the friendship strong. You could say, “Tell me how we can avoid something like this in the future. What do you need from me, as your friend, to prevent it?” If you have any requests of them, make them now. You could say something like, “In the future, I just want you to respect my feelings when I express them. I want to feel like they matter to you.” [13] X Research source"
    },
    {
      "title": "Discuss behaviors that are necessary for the friendship to heal.",
      "content": "Discuss behaviors that are necessary for the friendship to heal. [14] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. After you've said your apologies, you'll need to back them up with actions. Talk to your friend about the issues that caused your friendship to become broken, as well as what needs to change for your friendship to heal. Identify what each of you need to do to make this successful."
    },
    {
      "title": "Take things slowly.",
      "content": "Take things slowly. If you and your best friend had a major falling out, hanging out every day after school like you used to do probably isn’t the healthiest way to rebuild things. Don’t revert back to any of your old habits. Start slowly with occasional hang outs and phone calls. This will give you both time to heal as you rebuild your friendship together. It will likely take a lot of time for you to rebuild trust. Give the friendship time to grow together."
    },
    {
      "title": "Avoid falling into the same bad behavior in the future.",
      "content": "Avoid falling into the same bad behavior in the future. Apologies are meaningless if you don't correct the behavior you apologized for. Make the changes needed to keep your friendship on track. Pay attention to the way you speak and interact with each other. If nothing changes between you and things still feel negative, you may want to reevaluate the friendship. [15] X Research source"
    },
    {
      "title": "Examine the way you treat each other.",
      "content": "Examine the way you treat each other. It's a difficult fact to come to terms with, but some friendships aren't worth repairing. If your friend consistently treated you poorly or made you feel bad about yourself, you may not want to keep that friend in your life. [16] X Research source Your friend should show you kindness, encouragement, respect, and empathy. If your friend is generally incapable of giving you these things, or vice versa, it may not be a healthy friendship."
    },
    {
      "title": "Determine if you feel like you can be your true self around them.",
      "content": "Determine if you feel like you can be your true self around them. [17] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. A surefire sign of a toxic friendship is if you feel like you can't be yourself around that person. If you're forced to walk on eggshells, it's probably not a good friendship. If your friend criticizes your personality consistently, this is a toxic relationship. [18] X Research source If you don't feel comfortable being yourself around them, then it may be a sign that you don't trust them not to use the information you share with them against you. Since healthy relationships are based on trust, your friendship may never be close if this feeling remains. A good friend offers criticism with compassion."
    },
    {
      "title": "Make sure there’s balance in your friendship.",
      "content": "Make sure there’s balance in your friendship. Healthy, mutual friendships involve a balance of both friends reaching out to the other. If your friend never calls or texts you, or if you are always the one who has to make plans, there may be an imbalance in the friendship. [19] X Research source A toxic friend may make you compete for their friendship, whereas a good friend will accept you and make time for you without exception. Toxic people tend to force you to abandon your own problems to deal with theirs."
    },
    {
      "title": "Evaluate whether your friendship is healthy and mutually-beneficial.",
      "content": "Evaluate whether your friendship is healthy and mutually-beneficial. Think about how you felt around this person and ask yourself whether it was honestly supportive and comfortable to be friends with that individual. You should feel like you can generally trust your friend. You should also feel supported by one another. [20] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. [21] X Research source Your friend should inspire you to grow, and you should do the same for your friend."
    },
    {
      "title": "Cut off ties with toxic friends.",
      "content": "Cut off ties with toxic friends. [22] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 7 August 2019. If you've decided that a friendship isn't worth saving, you'll need to cut off all ties with that person. Be firm and direct. Don't just block someone's phone number and avoid them forever – get some type of closure by verbally ending the friendship. For example, you might say something like, \"I've been thinking about our friendship and I think I need to take a break. I don't like the way I feel when we're around each other – I think I need to sort some things out for myself.\""
    }
  ]
}