{
  "url": "https://www.wikihow.com/Crochet-Left-Handed",
  "title": "How to Crochet Left Handed",
  "steps": [
    {
      "title": "Hold the hook in your left hand.",
      "content": "Hold the hook in your left hand. To crochet left-handed, you will need to hold the hook in your left hand and use your right hand to hold your work. Grip the crochet hook with your left hand so that your thumb and forefinger are gripping the flat part of the hook. [1] X Research source"
    },
    {
      "title": "Practice chaining",
      "content": "Practice chaining . Chaining is how you start your foundation for a crochet project and it is the simplest technique in crocheting. Start by looping the yarn over your index finger twice. Then, pull the second loop through the first loop. This will create a slipstitch. Next, slide this loop on your hook and loop the free end of your yarn over the hook. Pull this new yarn through the loop on the hook to make another loop. [2] X Research source Continue to yarn over and pull the yarn through to form loops. This will create a chain. Make the chain as long as it needs to be for your project. Chaining is often abbreviated as “ch.”"
    },
    {
      "title": "Do a slipstitch.",
      "content": "Do a slipstitch. A slipstitch is also sometimes called a joining stitch. To slipstitch, insert the hook through a stitch, and then yarn over. Pull this new yarn through the stitch to complete the slipstitch. [3] X Research source A slipstitch may be used to move from one location to another on your yarn, or it may be used to join two stitches together, such as when you are crocheting in the round."
    },
    {
      "title": "Try a single crochet",
      "content": "Try a single crochet . A single crochet stitch is another simple stitch that often comes up in patterns. To single crochet, insert the hook through the stitch, yarn over, and then pull it back to the front (you'll be left with two stitches on the hook). Then, yarn over again and pull the yarn through the two loops on the hook. [4] X Research source A single crochet stitch is usually abbreviated as “sc.”"
    },
    {
      "title": "Do a double crochet",
      "content": "Do a double crochet . Double crochet stitches are also quite common. To double crochet, yarn over the hook, then insert the hook through the stitch and yarn over again. Then, pull it back to the front, and yarn over again. Then, pull through the first two stitches and yarn over again. Pull through the last two stitches to complete the stitch. [5] X Research source Double crochet is usually abbreviated as “dc.”"
    },
    {
      "title": "Try a half double crochet.",
      "content": "Try a half double crochet. Half double crochet is not as common, but it is important to know for more advanced work. A half-double crochet stitch is done by yarning over and then inserting the hook into the stitch. Then, yarning over again and pulling back to the front (you'll be left with three stitches on the hook). Then, yarn over again and pull through three stitches again. [6] X Research source Half-double crochet is usually abbreviated as “hdc.”"
    },
    {
      "title": "Attempt a triple crochet.",
      "content": "Attempt a triple crochet. A triple crochet stitch is also not as common, but it is important to learn. To do a triple crochet stitch, start by yarning over twice. Then, insert the hook into the stitch and yarn over again. Next, pull the yarn back to the front (you'll be left with four loops on the hook) and yarn over again. Then, pull through two loops and yarn over again. Then, pull through two loops again and yarn over one more time. Then, pull through the last two loops to finish the stitch. [7] X Research source A triple crochet stitch is usually abbreviated in patterns with “tr.”"
    },
    {
      "title": "Crochet in the round",
      "content": "Crochet in the round . Crocheting in the round is the same when you are left handed as well. Start by making a chain, and then secure it in a circle with a slipstitch. [8] X Research source Then, continue to work your stitches into the chain. You can crochet in the round to create hats, heavy scarves, and cowls."
    },
    {
      "title": "Experiment with special stitches.",
      "content": "Experiment with special stitches. There are many different types of stitches that you can use to create interesting patterns in your crocheted work. Once you feel comfortable with the basic stitches, you can try out some more advanced ones. Some stitches you might like to try include: Shell stitch Popcorn stitch Box stitch"
    },
    {
      "title": "Seek out left-handed tutorials.",
      "content": "Seek out left-handed tutorials. Having reference pictures can be helpful when following pattern or learning a new stitch, but many of the tutorials you will find are made for right-handed crocheters. However, there are lots of left-handed picture and video tutorials available, so seek them out. [9] X Research source Check out blogs and videos made by other left handed crocheters. You might even consider getting yourself a left handed crocheter pattern book."
    },
    {
      "title": "Follow the pattern as usual.",
      "content": "Follow the pattern as usual. Crocheting left-handed does not mean that you can’t use the same patterns as right-handed crocheters. Follow the pattern instructions exactly as they are written. Just use your left hand to crochet the stitches. [10] X Research source"
    },
    {
      "title": "Take pictures of images and flip them.",
      "content": "Take pictures of images and flip them. One of the difficult parts of using tutorials when you are a left-handed crocheter is that the images usually show a right-handed crocheter. One way to change the image into something you can try to do with your left hand is to save the images and then flip them horizontally . This will reverse the image so that it looks like the crocheter is left handed."
    }
  ]
}