{
  "url": "https://www.wikihow.com/Countersink",
  "title": "How to Countersink a Screw",
  "steps": [
    {
      "title": "Measure the diameter of the screw’s shaft with calipers.",
      "content": "Measure the diameter of the screw’s shaft with calipers . Make sure the screw you’re using has a flat head with a cone-shaped bottom, or else it won’t countersink easily. Open the jaws of the calipers wide enough so you can put the screw between them. Tighten the jaws around the main shaft of the screw, but not on the threading, which is the raised area that rotates around the screw. Read the measurement on the side of the calipers to know the diameter of the screw’s shaft. [1] X Research source You can buy calipers from your local hardware store. Don’t include the threading in your diameter measurement. Otherwise, the hole you drill will be too big and the screw will slip out."
    },
    {
      "title": "Install a drill bit that’s the same diameter as the screw’s shaft onto your drill.",
      "content": "Install a drill bit that’s the same diameter as the screw’s shaft onto your drill. Look through a set of drill bits and use your calipers to measure their diameters. Search for a bit that either has the same size or is about 1 ⁄ 16 inch (1.6 mm) smaller than the screw to make your pilot hole. Install the bit you’re using in the drill’s chuck, which is the rotating part that locks it in place. [2] X Research source You can buy a set of multiple drill bits from your local hardware store. There are many tables and guides online that specify how big pilot holes need to be depending on what size screw you have."
    },
    {
      "title": "Clamp the wood down to secure it.",
      "content": "Clamp the wood down to secure it. Set the wood on a flat, well-lit work surface so you can easily see what you’re doing. Open the jaws of your C-clamp and secure them around the piece of wood you're drilling into. Tighten the jaws on the clamp to secure the piece of wood so it doesn’t rotate or shift while you’re trying to drill into it. [3] X Research source Try pushing the piece of wood to see if it moves or shifts. If it does, put another C-clamp on the opposite side."
    },
    {
      "title": "Mark the location you’re drilling with the end of your screw.",
      "content": "Mark the location you’re drilling with the end of your screw. Put a dot on the piece of wood with a pen or pencil where you want to make your hole. Then take the pointed end of your screw and push it lightly into the surface to make a small dent. The dent will give the drill a good starting point so it doesn’t slip or shift while you’re making your hole. [4] X Research source If you aren’t able to make a dent in the wood with the screw by itself, lightly tap on the screw’s head with a hammer."
    },
    {
      "title": "Drill the pilot hole so it’s the same depth as the screw length.",
      "content": "Drill the pilot hole so it’s the same depth as the screw length. Hold the drill so the bit is perpendicular to the wood. Press down on the drill’s trigger to start making your hole. Apply light pressure to push the bit deeper into the wood until it reaches the same depth as your screw. Let go of the trigger and pull the bit straight out so you don’t damage it. [5] X Research source Wear safety glasses while you drill your hole so you don’t get sawdust in your eyes. Don’t force the drill bit into the wood since you could cause it to break, and you could seriously hurt yourself. If you want an easy reminder of how deep you need to drill, wrap a piece of masking tape around the drill bit so it’s at the same length as the screw. That way, you won’t be able to push the drill any farther than you need to."
    },
    {
      "title": "Secure a fluted countersink cutter in your drill that’s the same size as your screw.",
      "content": "Secure a fluted countersink cutter in your drill that’s the same size as your screw. A fluted countersink cutter has a wider base that comes to a point and contains multiple cutting edges so you can make larger holes for the screw’s head. [6] X Expert Source Josh Goldenberg Residential Remodeling Expert Expert Interview. 25 January 2022. Use a cutter that matches the numbered size of your screw, which is usually #6, #8, or #10. Pick a countersink cutter that has an 82-degree taper since it’s the most common angle on the bottom of the screw’s head. Secure the countersink cutter to the end of your drill so it fits tightly. [7] X Research source You can buy a countersink cutter from your local hardware store. You can also get countersink cutters with a flat bottom if the screws you’re using don’t have an angled head."
    },
    {
      "title": "Drill slowly into the pilot hole with the cutter to make countersink.",
      "content": "Drill slowly into the pilot hole with the cutter to make countersink. Place the point of the countersink cutter in the middle of the pilot hole so it’s perpendicular to the wood. Pull the trigger slowly and apply light pressure as you push the cutter further into the pilot hole. Stop drilling every 5–6 seconds to clear away sawdust and check the size of the countersink. [8] X Research source Put on safety glasses while you’re drilling to protect your eyes in case the cutter breaks or comes loose. Don’t force the countersink cutter into the wood since you could make the hole too deep or damage the bit."
    },
    {
      "title": "Hold the screw’s head against the hole to check if it’s the same size.",
      "content": "Hold the screw’s head against the hole to check if it’s the same size. Take the countersink cutter out from the hole and clear away any sawdust that built up around it. Turn your screw upside down and press the head against the countersink hole. If the hole is the same diameter as the screw’s head, then you’re ready to screw it in. If the hole is smaller than the screw head, continue using the countersink cutter to make the hole larger. [9] X Research source"
    },
    {
      "title": "Use your drill to secure the screw in the hole until the top is flush.",
      "content": "Use your drill to secure the screw in the hole until the top is flush. Remove the countersink cutter from the end of your drill and replace it with a screwdriver bit. Position the point of the screw so it lines up with your pilot hole and put the screwdriver bit into the slots on top. Pull the trigger to slowly drive the screw into the hole until it’s level with the wood surface. [10] X Expert Source Josh Goldenberg Residential Remodeling Expert Expert Interview. 25 January 2022. [11] X Research source You can drive the screw further into the wood if you want to conceal it later on."
    },
    {
      "title": "Spread wood putty over the screw and hole if you want to hide them.",
      "content": "Spread wood putty over the screw and hole if you want to hide them. Wood putty has a clay-like consistency, but it hardens to mimic the texture and grain of the wood. Scoop wood putty out of the container with a putty knife and press it into the countersink hole over the screw. Pull the putty knife in multiple directions over the hole to make sure it fills in evenly. Scrape off any excess putty with the knife and return it to the container. [12] X Research source You can buy wood putty from your local hardware store. You will not be able to remove the screw if you cover it with putty. Only use putty if you want the screw to be permanent."
    },
    {
      "title": "Let the wood putty dry for up to 8 hours.",
      "content": "Let the wood putty dry for up to 8 hours. Leave the putty in a cool, dry place so it has time to set. The time it takes for your putty to dry depends on how much you use and how deep the hole is, but it usually takes around 6-8 hours for it to fully harden. Try touching it with your finger to see if any lifts up or still feels tacky to the touch. [13] X Research source Some wood putties come with a hardening agent to help promote faster drying. Mix the hardening agent with the putty before you apply it for it to take effect."
    },
    {
      "title": "Sand the putty with 120-grit sandpaper until it’s flush with the rest of the wood.",
      "content": "Sand the putty with 120-grit sandpaper until it’s flush with the rest of the wood. Rub the surface of the wood in circular or back-and-forth strokes to smooth out any raised or bumpy areas. Change which direction you sand the wood often so the surface looks even. Wipe away any sawdust and run your hand over the wood to check if it feels level. [14] X Research source You can use an electric sander to speed up the process if you want, but it’s not required. If you do, wear a dust mask so you don’t breathe any sawdust."
    },
    {
      "title": "Paint",
      "content": "Paint or stain the wood to help conceal the putty. The putty may have a slightly different color than the rest of the wood once it dries. If you want to make the wood look like it’s a single solid piece, coat the surface with a thin layer of paint or stain to change the color of the wood. As the wood and putty absorb the color, you won’t be able to see the area where you put the screw anymore. [15] X Research source"
    }
  ]
}