{
  "url": "https://www.wikihow.com/Get-Rid-of-Bats",
  "title": "How to Remove Bats from Your Home",
  "steps": [
    {
      "title": "Install a one-way exclusion device.",
      "content": "Install a one-way exclusion device. By fitting suspected entry points with exclusion devices like a one-way valve or tube, invading bats will be free to exit a space but won’t be able to get back in. [1] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. This way, bats will simply leave on their own, and be unable to return. These devices are the most effective and professionally-used method for ridding your home of bats once and for all. [2] X Research source Denying bats reentry is preferable to trapping them, which is often difficult and dangerous. There are a number of different exclusion devices, but each is relatively simple to install. Follow the included manufacturer’s instructions. Only install exclusion devices in September through April, when there aren’t any young bats that may be harmed."
    },
    {
      "title": "Create disturbances to drive the bats away.",
      "content": "Create disturbances to drive the bats away. Bats favor dark, quiet hideouts and have an aversion to lots of light and commotion. Leave a bright light on in the attic or another area you think bats might be inhabiting. In addition, lower the thermostat or turn on the AC in the room to make the space uncomfortable for the intruders. [3] X Research source If the roost is visible, apply a contact repellant such as sticky bird gel during the day or when the bat is not present. Note that ultrasonic devices are unproven to work against bats, and are most often ineffective."
    },
    {
      "title": "Set up a bat box near your home.",
      "content": "Set up a bat box near your home. Bat boxes are small enclosed structures that provide a hospitable temporary environment for bats seeking a place to roost. The idea is to flush them out of your home while attracting them to the box so that they won’t be tempted to return. For people living in wooded areas, bat boxes are a good way to relocate bats without the need for more costly measures. [4] X Research source Build your own bat box or purchase one online and mount it on a tree or fence near your home, in a place with ample shade."
    },
    {
      "title": "Call a pest removal service.",
      "content": "Call a pest removal service. If you’re not having any luck getting rid of the bats on your own, or you suspect you might be housing an entire bat colony, your best bet is to have the problem dealt with professionally. Pest control specialists will be able to pinpoint the places where bats are likely getting in, then remove them and seal vulnerable entry points to keep them from coming back. [5] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. This is the safest and most convenient option if you can afford to have it done. Contact your local wildlife authority or conservation group, which may offer to remove the colony at no cost."
    },
    {
      "title": "Seal off all potential entry points.",
      "content": "Seal off all potential entry points. Once the bats are gone, bar any openings that they might be using to make their way in. [6] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Repairing long-standing cracks and damage, installing exclusion devices or in some cases applying new mortar, fixing plaster, or laying new shingles . [7] X Research source With these things in place, bats will find it difficult or impossible to regain access to your home in the future. [8] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Have a contractor go over the exterior of your home with you to look for places that might admit bats. Attach industrial bird netting over problem areas with staples or duct tape for an effective but temporary solution. [9] X Research source"
    },
    {
      "title": "Dispose of any remaining bat waste.",
      "content": "Dispose of any remaining bat waste. Vacuum up dried droppings or scoop them into a garbage bag with a plastic scraper. Afterward, scrub the area thoroughly using an enzyme-based cleaning solution . This helps break down any remaining biological waste products so that no traces are left behind. [10] X Research source Be sure to take the proper safety precautions when cleaning bat guano—wear thick rubber gloves, eye protection, and a face mask or respirator to filter the surrounding air. If the problem is especially extensive, call a professional pest or cleaning service to safely handle the mess."
    },
    {
      "title": "Check inhabitable spaces frequently.",
      "content": "Check inhabitable spaces frequently. Perform thorough inspections of your attic, basement, crawlspace or other affected areas periodically to search for signs of reinfestation. Look for bats themselves as well as their droppings. Chances are that bats will stay out after you’ve sealed their entryways, but if they do happen to sneak back in, it helps to find out as soon as possible to keep the problem from getting out of hand. [11] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Unexplainable drafts or debris can offer a clue that bats have gnawed their way in. Though they usually wind up in attics and chimneys, bats have also been known to roost beneath decks, inside screened-in porches and under roofing tiles."
    },
    {
      "title": "Confirm that bats are the problem.",
      "content": "Confirm that bats are the problem. The occasional rustling in the attic may just be an old water pipe or the sound of the house settling. Make sure you’ve excluded all other possibilities before you spend time and energy on a false bat problem. If possible, confirm their presence with a sighting, or listen closely for sustained squeaking, especially at night. [12] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source If a single bat has wandered into your house, catch it with a bucket against a wall. Alternatively, leave the lights on, open a single exit and block off the rest of the house, then wait for the bat to leave on its own."
    },
    {
      "title": "Be on the lookout for droppings.",
      "content": "Be on the lookout for droppings. Bat excrement (commonly known as “guano”) most often takes the form of small, dark pellets. These are round in shape, give off a musky stench, and collect in piles beneath a bat’s roost. Should you encounter bat guano in any part of your home, there’s a good chance that bats have recently been roosting there. [13] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source While bat urine isn’t typically visible, it may leave behind small stains and a sharp odor. Bat guano sometimes contains fungal mold spores that may be hazardous to breathe. If you identify bat droppings during your search, proceed with a face mask."
    },
    {
      "title": "Research local bat species and laws regarding them.",
      "content": "Research local bat species and laws regarding them. There are many different varieties of bats, and some homeowners decide to allow the smaller, less intrusive, or endangered species to coexist in their attics or eaves. [14] X Research source Additionally, depending on the species’ mating season, you may inadvertently try to remove young bats that are unable to fly away. [15] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Observe the bats from a distance to get a good look, then identify it using an online database or by calling your local pest control or wildlife foundation for aid. Note that in the UK, bats are a protected animal and it’s illegal to tamper with any sort of bat roost—in this case, you’ll need to isolate and coexist with the bats."
    },
    {
      "title": "Identify places where bats might be getting in.",
      "content": "Identify places where bats might be getting in. Bats gravitate toward dark, enclosed spaces because they most closely resemble their natural cave habitats. Take a look around your attic, chimney flue, basement, or crawlspace and search for small crevices through which a bat might enter. [16] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Pay special attention to things like broken windows, decaying brickwork, or gaps in the roof. Bats are capable of squeezing into spaces as narrow as 0.25 in (0.64 cm), so don’t discount small or inconspicuous openings. Watch bats as they come and go at night to see what entrances they’re using."
    }
  ]
}