{
  "url": "https://www.wikihow.com/Figure-Out-Who-You-Are",
  "title": "How to Figure Out Who You Are",
  "steps": [
    {
      "title": "Take a personal inventory.",
      "content": "Take a personal inventory. By taking an inventory of your strengths and areas that need improvement, you will begin to see what you do well and what you need to work on. This can be a good starting point for figuring out who you are. When you create your inventory, phrase your list so that the strengths use “I am” statements and the areas of improvement use “I want” statements. For example, for strengths, you might include things like “I am a good friend” and “I am generous with my time.” For areas of improvement you might include things like “I want to be a better listener” and “I want to care less about what other people think of me.”"
    },
    {
      "title": "Ask people you trust for help.",
      "content": "Ask people you trust for help. To make your list even longer, you can ask your friends what they think your strengths are and where you could use improvement. Make sure you're asking people who know you well and who will provide you with constructive, positive feedback. Do not ask your friends for help with your list if you think that it might hurt your feelings."
    },
    {
      "title": "Make time for yourself.",
      "content": "Make time for yourself. Schedule some alone time so that you can look over your list. Scheduling some alone time will also give you a chance to do some self-exploration. You may even want to make scheduled alone time a regular part of your day for a while so that you can have the time and privacy to get to know yourself better. Keep in mind that you don't need to spend your alone time meditating or being reflective. You can discover something new about yourself, even if you're just watching your favorite movie or getting some light exercise. The important thing is to make time that is just for you and enjoy it. Alone time and self-reflection are often overlooked in our culture. Human beings tend to look outward and see what is happening around them. Sometimes, it can be hard to see ourselves. It can impact our ability to get the things we want and need in our lives."
    },
    {
      "title": "Start small.",
      "content": "Start small. Deciding what you want to change about yourself can also tell you about your priorities and help you better understand who you are. If you have identified some areas that you want to improve, then try setting a small goal for yourself. Think about what this goal says about you. What does it say about who you are? [1] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Make sure that your goal is small and measurable.For example, if you have decided that you want to be more assertive, then set a goal to speak up for yourself once per day. This can be as simple as voicing your choice for dinner or telling someone “No.”"
    },
    {
      "title": "Create art.",
      "content": "Create art. You may think that you're the least creative person on the planet, but maybe you never gave yourself a chance. Try writing a poem, story, or song. Paint something or sketch whatever you see outside your window. Take an acting class or make videos with your friends. Hang out with creative people and see if they can teach you something. Forcing yourself to be creative will take you out of your comfort zone and may help you to discover something new about yourself. [2] X Research source Don't be too critical of your art when you are just getting started. Remember that the point is to explore who you are and enjoy yourself."
    },
    {
      "title": "Challenge yourself.",
      "content": "Challenge yourself. Do something that you would never do because it scares or intimidates you. Don't let obstacles stop you. Instead, start with small challenges and work your way up to larger ones. You may discover that you're more determined than you thought and you may even discover a talent that you did not know you had. [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For example, you could go up to a new group of people and try to make friends, sign up for a 10K though you've never run more than two miles, or see how long you can go without logging onto your Facebook account."
    },
    {
      "title": "Spend time with people who make you happy.",
      "content": "Spend time with people who make you happy. You'll learn more about yourself if the people around you encourage you and make you feel good about yourself. Steer clear of people who are negative of critical of you and seek out people who build you up. Try to find people who excite you, live their lives in a way you admire, and who are fun to be around."
    },
    {
      "title": "Keep a journal.",
      "content": "Keep a journal. Writing in a journal can make you more accountable to yourself, reduce your stress, and bring about positive change. Try to write in your journal for at least 20 minutes every day. [4] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source For example, you could write down your thoughts at the end of every day, write when you're feeling troubled, or write when you have a good idea. Be sure to include how you feel about your life, what your goals are, and what questions you have about going forward. When you're feeling lost, you can read over your journal and try to identify things that help you to find your way again. For example, if you have a bad day, then reading about something that made you feel happy might help you to start feeling like yourself again."
    },
    {
      "title": "Let go of perfection.",
      "content": "Let go of perfection. Perfection is an ideal that we impose on ourselves that is impossible to achieve. Forgive yourself for past mistakes and accept who you are. What matters is not that you're perfect, but that you do your best. [5] X Research source"
    },
    {
      "title": "Keep in mind that your identity is always changing.",
      "content": "Keep in mind that your identity is always changing. Finding your identity can be hard because it may change over time depending on what you are doing with your life. Remember that these changes are a normal part of life, so try to welcome them and accept your changing identity. [6] X Research source Right now, you might define yourself as a son, an accountant, and someone who values honesty. But your identity may change over time, as your situation changes. For example, if you have kids, then you might start identifying yourself as a father. If you start a business, then you might start identifying yourself as an entrepreneur."
    },
    {
      "title": "Make a list of your priorities.",
      "content": "Make a list of your priorities. These should be the things that matter the most to you. Rank the list in order of importance. Knowing what matters to you can help you see what really can make your life feel important and meaningful, so take your time with the list. The list may surprise you. Some things you value might include: your friends, family, studies, certain classes or your job, or a skill. Consider what value these things or people add to your life. Take more time to include them in your life."
    },
    {
      "title": "Accept responsibility for your actions.",
      "content": "Accept responsibility for your actions. It's easy to blame all your failures or setbacks on other people. But once you accept that you have control over your life, including the failures, you'll be able to change your life for the better. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Make sure that you accept responsibility for your achievements too. Your accomplishments are a result of your personal drive and ambition. Whether you are a top tennis player in your state or learning a new language, make sure that you give yourself credit for your accomplishments."
    },
    {
      "title": "Honor yourself.",
      "content": "Honor yourself. Remember that you are unique and that you deserve love and attention. That is why it is important to give yourself the praise that you deserve. Make a list of the things you love about yourself. It might also help you to look in the mirror and identify some of your favorite physical features. Compliment yourself like you would compliment a friend. [8] X Research source"
    },
    {
      "title": "Make a list of 100 things that you want to achieve.",
      "content": "Make a list of 100 things that you want to achieve. Your goals can have an impact on how you see yourself, so make a list of 100 things (big and small) that you would like to achieve in your lifetime. See what unites the items on your list and make a plan for achieving as many of these things as you can. Some of your goals may seem unrealistic, but write them down anyways. Writing them down can help you to discover what excites you. By writing down your goals, you're also more likely to complete them. [9] X Research source Don't be afraid to change or add onto your list as you think of new things that you want to do."
    },
    {
      "title": "Work on boosting your confidence.",
      "content": "Work on boosting your confidence. Building confidence is a constant challenge, but if you pay attention to making little steps and achieving your goals, this will help boost your confidence and maybe your self-esteem. Being confident will also allow you to challenge yourself. This can help you grow as a person. [10] X Research source If you have trouble with low-confidence, stop comparing yourself to others, appreciate your accomplishments, and set realistic goals for yourself."
    },
    {
      "title": "Try to be patient.",
      "content": "Try to be patient. Searching for your true self is a lifelong journey, so don't worry if you can't figure it out right away. If the search is overwhelming you, then take a break to slow down. You may discover something important about yourself just by letting yourself be for a while. [11] X Research source"
    },
    {
      "title": "Let your mind wander.",
      "content": "Let your mind wander. Stare out the window or close your eyes and see what thoughts come to you. It is good to daydream now and then and let your mind go where it wants to go instead of forcing yourself to think about something specific. You might even learn something about yourself in the process. [12] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Daydreaming can help you relax and it may also help you to be more creative and productive."
    },
    {
      "title": "Question yourself.",
      "content": "Question yourself. You may think that all your beliefs are set in stone, but take a moment to step back and think about why you think the way you do. Making a constant effort to question yourself can help you be an inquisitive thinker. Being curious about yourself will help you figure out who you are. [13] X Research source"
    },
    {
      "title": "Write down what you love and appreciate.",
      "content": "Write down what you love and appreciate. If you make a list of the people and things that you most care about, you can get a sense of what is really important to you. Use this list to help you define for yourself who you are."
    }
  ]
}