{
  "url": "https://www.wikihow.com/Forget-Someone-You-Love",
  "title": "How to Forget Someone You Love",
  "steps": [
    {
      "title": "Break off contact completely.",
      "content": "Break off contact completely. It's hard to get over someone or forget them if you're still talking to them or even if you're still just friends on social media. Unfriend the person on all your social media accounts. Let the person know you need a long break from them, even if you want to be friends in the future. [1] X Research source You could say, \"Even though I would like to be on friendly terms in the future, I'm having a hard time right now. I need to step away from our friendship.\" If you must see the person, try to be friendly without moving into friendship. For instance, say hello if you pass them in the hall or make polite chitchat about logistics if you're sharing kids. However, leave it at that and don't try to go deeper."
    },
    {
      "title": "Give up the possibility that you could get the person back.",
      "content": "Give up the possibility that you could get the person back. Don't dwell on the thought that you might get back together. That only makes you hope and fantasize about the person. Instead, focus on letting go of the relationship, reminding yourself that it's over when you need to. Tell yourself, \"We broke up for a reason, and I deserve to move on with someone new.\""
    },
    {
      "title": "Write a letter to the person that you don't send.",
      "content": "Write a letter to the person that you don't send. Get all your feelings out on paper. Tell your ex how they hurt you. Write down the good memories and the bad, and just use the time to get out some of your emotions. The letter is for you; there's no need to send it."
    },
    {
      "title": "Delete the person's emails, texts, and voicemails.",
      "content": "Delete the person's emails , texts, and voicemails. When you have text or messages from your ex, you're likely to go back and read them, dwelling in the past. Go through all of your accounts, and delete all messages, so you won't be tempted. [2] X Research source If you're afraid you might want the memories later, try saving them on an external hard drive and give it to a friend. Then you can't take it out at will to remember."
    },
    {
      "title": "Take down or delete all the photos you have of the person.",
      "content": "Take down or delete all the photos you have of the person. Remove the photos from the walls and your picture albums. Delete any photos you have on your phone or computer, as well as any on your social media accounts. You don't need those reminders around. Once again, if you can't quite let go, put them on an external hard drive along with any hard copies you have and ask a friend to hold them for a while."
    },
    {
      "title": "Have a ceremonial burning of any reminders you have around.",
      "content": "Have a ceremonial burning of any reminders you have around. Sometimes, you just need to cleanse your mind of the other person. One way to do that is to gather up items you have around that remind you of them. Put them in a metal trash can, and set them on fire. You can do this with old letters, photos, or clothing, for instance. Just be sure to do this outside in a non-windy area. Have a bucket of water or fire extinguisher nearby just in case."
    },
    {
      "title": "Remind yourself why it didn't work out.",
      "content": "Remind yourself why it didn't work out. If you're having a hard time getting over someone, it's likely because you're remembering all the good times without the bad. Take time to remember why you broke up, so you can break through the fantasy. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Try writing about it. Journal about the painful memories you have with the intention of letting go of that hurt, too, so you can move on. Your relationship ended because something happened or it wasn't going well, and if you put that relationship on a pedestal of perfection, it's hard to get over it."
    },
    {
      "title": "Forgive",
      "content": "Forgive the person to let go of your anger . One way to work on forgiving them is to remember the good parts of the person, too. Think about what made you like them in the first place, so you can think of them as a whole person who makes mistakes. It's only when you think of them as a fallible human being with both good and bad qualities that you can forgive them their mistakes. [4] X Research source Another way to work on forgiveness is to think about how you feel about what the person did to you. Think about how those emotions are affecting your life. For instance, if you feel angry and bitter, how is that coloring how you see the world? Of course, some \"mistakes\" are bigger than others. With serious issues like emotional and physical abuse, it's much harder to forgive the other person. Keep in mind, though, that forgiveness is mainly for your benefit; it doesn't absolve the other person for what they've done. Forgiveness is about letting go of the bitterness you have against the other person. It's hard to let go of your negative feelings towards the person if you're not willing to forgive them. You don't forget your pain, just that you stop harboring anger in your heart towards the person. [5] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Reframe the breakup as \"no-fault\" instead of casting blame.",
      "content": "Reframe the breakup as \"no-fault\" instead of casting blame. You may blame yourself for the breakup, or you may feel the need to blame the other person. But, in the end, the fact is you just weren't compatible with the other person, and no one deserves the blame for that. If you had a fairly amiable relationship, try to remember that you were both trying your best to make the relationship work, and work on letting go of the blaming cycle."
    },
    {
      "title": "Work on changing your response to the past rather than wishing it away.",
      "content": "Work on changing your response to the past rather than wishing it away. Sometimes, you may wish you could go back in time and change how things happened. It's a fairly natural response, but in the end, fruitless. All you can change is how you respond to the past. Accept that fact instead of constantly wishing you could take back something you said or did. [6] X Research source Try thinking about a particular moment that bugs you. You might be thinking, \"I wish I could take back what I said.\" Instead, rephrase the statement: \"I regret that I said that, but I've learned from my mistake. I'll do better in the future.\""
    },
    {
      "title": "See a therapist if you're struggling.",
      "content": "See a therapist if you're struggling. You may feel like seeing a therapist carries a social stigma. However, keep in mind that millions of people just like you go to therapists, counselors, advisers, and other professionals for advice and guidance during difficult times, and you can, too. There's no reason to be afraid to get help. [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Some of the people you may consider talking to are professional therapists, psychiatrists, school and occupational counselors, and, if desired, authoritative voices in your community like priests or rabbis. Just find a voice you trust who has some professional expertise. Ask your friends or family for recommendations if you're not sure who to talk to."
    },
    {
      "title": "Teach yourself to be independent again.",
      "content": "Teach yourself to be independent again. During this time, remember that you are a whole person on your own. You don't need someone else to make you complete, so take this time to discover yourself again without the other person. [8] X Research source Make a list of all the things you can do now that you're not in a relationship. For instance, maybe you can spend more time with your friends and family, go on solo trips , move out of town, or stay up as late as you want. This list can you remind you of how fun it can be to be independent."
    },
    {
      "title": "Remind yourself of your strength.",
      "content": "Remind yourself of your strength. When you break up with someone, you may be feeling vulnerable and like you don't have the power to get over the pain. But you are strong enough, you just need to give yourself some reminders. Take time to write down a few of your strengths and past triumphs to show yourself that you can and will get through this time. [9] X Research source For instance, you might write, \"I have great tenacity. It only took me a year from when I started running to complete a marathon! And if I have tenacity, I can get through this, too.\""
    },
    {
      "title": "Make some new friends that aren't in the same circle.",
      "content": "Make some new friends that aren't in the same circle. If you've been in a relationship for a while, you may have a lot of mutual friends with your ex. Work on making new friends who won't constantly bring up the person's name or want to do things with both of you, which will make it easier to move on. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You don't need to completely give up on your old friends, but having a new circle gives you a safe space to socialize. You can also rely on friends you don't have in common. Try rekindling an old friendship you may have let go by the wayside a bit. To make new friends, try going to community meetups, taking fun classes at your library or with your parks and recreation department, or even striking up a conversation with someone at a local coffee shop."
    },
    {
      "title": "Date",
      "content": "Date again, when you're ready. Give yourself some time to grieve, but when you start feeling a little better, try dating someone new. You don't have to commit to a relationship. Just go on a few dates with a person you like, or even just a few first dates with a couple of different people. Let yourself go as slow as you need when you start dating again. There's no rush. In fact, it might be a good idea to bring that up with anyone you're dating. You might say, \"Hey, I should let you know that I just got out of a difficult relationship, so I'm just looking for something casual right now.\""
    },
    {
      "title": "Let your emotions out physically in laughter and tears.",
      "content": "Let your emotions out physically in laughter and tears. Sometimes, the pain is just going to hit you again, and you may feel like you need to cry. That's fine! Take some time to cry . But, don't forget to laugh, too. Watch some silly videos on the internet, check out some cute memes, or put in your favorite comedy. Laughter is good for the soul, and it can make you feel as good or better than a good cry. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Go out with friends and have a good laugh together!"
    },
    {
      "title": "Eat healthy",
      "content": "Eat healthy food every day. When you're grieving, you may not want to eat at all, or you may want to just eat junk food. However, that can just make you feel worse, when you crash from a sugar high, for instance. Make sure you're getting in some fruits, vegetables, and lean proteins at the very least. Of course, you can still have that piece of chocolate cake or a bag of chips, especially in the first day or so. Just try not to only eat chips and cake. Opt for some healthy foods, too."
    },
    {
      "title": "Get some exercise, especially if it's outside.",
      "content": "Get some exercise, especially if it's outside. Take a hike in the woods or go for a walk with a friend. Kayak across a nearby lake or go for a swim in your favorite pool. Play a game of tennis , run in a park, or just hit the gym. Yoga is also a great option. Whatever you do will help get you out of your head and make you feel better. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Aim for at least 30 minutes of exercise most days of the week. Exercise is great for the brain because it releases feel-good chemicals in your body. If you're outside, you'll also get the benefit of vitamin D! Plus, it's great for your body and gets you out of the house."
    },
    {
      "title": "Leave plenty of time for sleep.",
      "content": "Leave plenty of time for sleep . Sleep is your body's way of healing, and that's true for emotional pain, too. If you're having trouble sleeping, make sure to leave extra time to get to sleep, and work on getting at least 8 hours each night. Try getting into a nighttime routine. Shut off your electronics at least an hour before you want to go to bed, so your brain starts winding down. Have some warm milk or herbal tea , or take a warm bath to soothe your mind. You may have the opposite problem, too, where you want to sleep all the time. While getting some extra sleep isn't a bad idea (9-10 hours a night), try not to overdo it. Force yourself to get up and get out in the world."
    },
    {
      "title": "Fall back on your friends and family for support.",
      "content": "Fall back on your friends and family for support. The people who love you--your family members, personal mentors, and close friends--want to see you happy. Don't be afraid to ask these people for a little extra love. Talk to an old friend, a parent, or a sibling to help you work through your stress and emotions. Your ex was not the only person that loved you; use this time to remember that and spend time with those that matter. Even if you find that the advice you receive from your close confidants isn't perfect, the sense of comradeship can still make you feel better. Reader Poll: We asked 523 wikiHow readers who they’d reach out to when they needed to vent about losing someone they love, and 53% said they’d connect with their closest friends to find the support they need. [Take Poll]"
    },
    {
      "title": "Get back into a regular schedule.",
      "content": "Get back into a regular schedule . A regular schedule helps you stay in a routine, which helps you feel more normal. Try to get up and go to bed at the same time each day, eat your meals at the same time, and so on. However, it's okay to go easy on yourself. You are going through a hard time, and it's okay to take breaks when you need them. Just try to keep up as much as you can."
    },
    {
      "title": "Pamper yourself a little.",
      "content": "Pamper yourself a little. Take a hot bubble bath or get a massage. Now is the perfect time for a little pampering. Go to a movie you've wanted to see, take a little shopping spree, or even get out of town for a few days. Just do something that makes you feel good. You can even do something as simple as getting cup of coffee from your favorite coffee shop and curling up with a good book."
    },
    {
      "title": "Try a new hobby to break out of your old habits.",
      "content": "Try a new hobby to break out of your old habits. Work on learning a new language or take a fun cooking class. Pick up books at your library to learn a hobby you've always wanted to try or just watch some videos online. You could even take a class at a local community college in a subject that interests you. [13] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Striking out on your own with a new pastime gives you a sense of independence and freedom, plus it can be invigorating, sparking creativity."
    }
  ]
}