{
  "url": "https://www.wikihow.com/Dress-for-Desert-Conditions",
  "title": "How to Dress for Desert Conditions",
  "steps": [
    {
      "title": "Wear wicking underwear.",
      "content": "Wear wicking underwear. Start with undergarments that are made from synthetic nylon, polyester or spandex blends and offer moisture wicking. That means less chafing and more comfort. Women might want to wear a sports bra, which are built for warm and sweaty conditions. [1] X Research source"
    },
    {
      "title": "Wear long pants.",
      "content": "Wear long pants. Yes, it's hot, but protecting your skin from the elements is vital. Think loose, lightweight cotton pants in light colors, such as khakis or cargo pants. Looser pants keep air moving and help evaporate sweat. Long pants also help protect your legs from spiny plants."
    },
    {
      "title": "Cover your arms.",
      "content": "Cover your arms. Long-sleeved, slightly loose cotton shirts are your best bet. Make sure your collarbone and chest are covered too. Choose light colors that help reflect the sun's rays. [2] X Research source Layering a t-shirt or tank top may be helpful under your long-sleeved shirt, so you can remove your top layer in shady spots and cool off a bit. Choose a close-fitting, wicking fabric."
    },
    {
      "title": "Dress for the weather.",
      "content": "Dress for the weather. Deserts can get surprisingly cold at night. A windproof shell will protect against gusts. For cooler months or nights, a fleece pullover is ideal. Fleece dries quickly and can be used as a pillow in a pinch. If you get lost or stuck, a jacket or space blanket can help prevent hypothermia."
    },
    {
      "title": "Wear moisture-wicking socks.",
      "content": "Wear moisture-wicking socks. If your feet aren't happy, the rest of you won't be either. Make sure they're a snug-fitting blend that wicks moisture, and rise to crew length (mid-calf), so no sun or scorpions can sneak through. [3] X Research source It may seem counterintuitive, but merino wool is a great bet for a natural wicking fabric on hot summer days. It also repels odors. Avoid all-cotton socks, which keep moisture close to your feet and can cause blisters."
    },
    {
      "title": "Invest in good boots.",
      "content": "Invest in good boots. This is the place to spend the most money. Boots are a vital part of your gear, and can protect you from injury, snakes, spines and heat. Wearing higher-cut hiking boots offers additional ankle support. You may need to go a size up from your normal shoes. Choose a sturdy, slip-free sole that will work well on rocks and rough terrain. Depending on terrain, you'll probably want trail or rough-trail rated boots. Look for a pair that's got some ventilation for hot desert conditions. Look for adequate padding around your ankle, which is critical for long-wear comfort. When trying on boots, make sure you wear the same socks you'll be wearing to hike."
    },
    {
      "title": "Don't forget a hat.",
      "content": "Don't forget a hat. Wide-brimmed is best, but if you're attached to your baseball cap, add a bandana to cover your neck. Add a strap to make sure strong winds don't carry your hat away."
    },
    {
      "title": "Remember sunglasses and sunscreen.",
      "content": "Remember sunglasses and sunscreen. Make sure they offer complete UV protection. Look for a broad-spectrum sunscreen, at least SPF 30. Apply liberally to any exposed skin, including lips and hands. Bring a small tube for reapplying."
    },
    {
      "title": "Use a lightweight backpack.",
      "content": "Use a lightweight backpack. Pick one that fits comfortably and distributes weight evenly. Travel light. Your heaviest items should be water and food. [4] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source"
    },
    {
      "title": "Bring plenty of water.",
      "content": "Bring plenty of water. Being dehydrated in the desert can be deadly. A good rule of thumb is to drink a liter per hour, more if you're hiking in temperatures above 85F/30C."
    },
    {
      "title": "Bring food.",
      "content": "Bring food. You'll need quick energy with all the calories hiking in the desert can burn. Sports bars, trail mix, sandwiches, dried fruit and jerky are popular options. Look for non-perishable options."
    },
    {
      "title": "Pack vital survival supplies.",
      "content": "Pack vital survival supplies. A first aid kit, signal mirror, flashlight and compass should be in your pack. You may not need them, but if you do, you'll be glad to have them on hand. [5] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source"
    }
  ]
}