{
  "url": "https://www.wikihow.com/Eat-at-a-Buffet",
  "title": "How to Eat at a Buffet",
  "steps": [
    {
      "title": "Wear loose clothing.",
      "content": "Wear loose clothing. Put on loose, comfortable clothing when going to a buffet. A pair of tight jeans or a form-fitting dress may get uncomfortable as you eat. Wear clothing that is made of a soft material that can easily expand and avoid pants with buttons if possible. [1] X Research source"
    },
    {
      "title": "Eat expensive foods first.",
      "content": "Eat expensive foods first. Start with pricier foods, like steak or shrimp. If you are vegetarian, start with gourmet foods or complicated dishes that you couldn't easily make for yourself. This way, you can ensure that you are getting what you paid for or even more than what you paid for. [2] X Research source"
    },
    {
      "title": "Use a salad or soup bowl for dessert.",
      "content": "Use a salad or soup bowl for dessert. Dessert bowls are often small, so get more dessert by using a soup or salad bowl for desserts like ice cream. If you aren't getting ice cream, use a plate that is made for main courses to get a piece of pie or cake. Do not do this if it is forbidden by the buffet you are eating at. [3] X Research source"
    },
    {
      "title": "Drink water the day before going to the buffet.",
      "content": "Drink water the day before going to the buffet. Staying hydrated will keep your stomach stretched, which will allow you to eat more food. However, don't drink a lot of water just before going into the buffet or you may feel full. [4] X Research source"
    },
    {
      "title": "Eat a snack before the buffet.",
      "content": "Eat a snack before the buffet. Being too hungry can lead you to eating quickly at the beginning of your meal, which may make you feel full very fast. Eat a light snack about an hour before going to the buffet. A handful of peanuts, an apple, or a yogurt would be a good snack. [5] X Research source"
    },
    {
      "title": "Start with lighter foods.",
      "content": "Start with lighter foods. Don't load up on pasta or starchy foods when you begin eating. Start with lighter foods so that you will still have room in your stomach. Begin with a salad or shrimp as an appetizer before diving into heavier food. [6] X Research source"
    },
    {
      "title": "Eat slowly.",
      "content": "Eat slowly. Eating your food too fast will make you feel too full to eat as much as you would've been able to eat if you'd paced yourself. Chew slowly as you eat and take breaths between bites. Wait a minute or two before going back up for seconds. [7] X Research source"
    },
    {
      "title": "Avoid soda.",
      "content": "Avoid soda. The carbonation in soda may make you feel more full than water would. Instead, go for juice or water. If you want soda, wait to have it at the end of your meal. [8] X Research source"
    },
    {
      "title": "Avoid wasting food.",
      "content": "Avoid wasting food. Although you may want to get the most out of the buffet, try not to get more food than you can eat. It is better to get a lot of small plates and making multiple trips rather than wasting food. Also, keep in mind that some bargain buffets will charge for the price of the food you don't eat. [9] X Research source"
    },
    {
      "title": "Walk around before you eat.",
      "content": "Walk around before you eat. Do not choose the first thing that looks appetizing. Instead, take a walk around the entire buffet, and check out what is being offered. Take note of the things that look best to you. [10] X Research source Exploring the contents of the buffet will also help you to avoid eating food that you don't really like or eating too much."
    },
    {
      "title": "Grab a tray, plate, and utensils.",
      "content": "Grab a tray, plate, and utensils. You can't get the food you want without having a plate to put it on. Get one smaller appetizer plate in the beginning. Remember, you can always go back for another plate when you want something else. Check to make sure the plate is actually clean before grabbing it. It shouldn't have any food particles or oily residues left on it. Get another plate if yours is dirty."
    },
    {
      "title": "Recognize lines.",
      "content": "Recognize lines. There may be lines in front of the serving stations. If you see multiple people lined up and they appear to be waiting, get behind the last person. If you aren't sure if it is a line, simple ask one of the people if they're waiting. Some buffets may be more formal than others so take a look around to see how other people are behaving before serving yourself."
    },
    {
      "title": "Get an appetizer.",
      "content": "Get an appetizer. Start your meal with an appetizer. This could be a salad, soup, breadsticks, or whatever you'd like. Take a small portion of it to save room for the rest of your meal. Starting with an appetizer will also help you to pace yourself during the meal. [11] X Research source If you don't want an appetizer, you can begin with the main course."
    },
    {
      "title": "Choose a main course and side.",
      "content": "Choose a main course and side. After finishing the appetizer, set aside your plate or put it in a bin for dirty dishes. Then, put a fresh plate on your tray. You do not have to replace your utensils. Get the main dish and side (or sides) of your choice. For example, you can get a chicken breast with mashed potatoes. [12] X Research source"
    },
    {
      "title": "Go back for seconds.",
      "content": "Go back for seconds. If you're still hungry, go back for seconds. This is perfectly acceptable at a buffet. Just make sure to get a fresh plate each time you get a new food. You can even go up for thirds if you're still hungry. [13] X Research source If you're at a buffet you haven't paid for, like at a party, be considerate of others before getting seconds or thirds. Leave some food for someone else that hasn't gotten any food yet."
    },
    {
      "title": "Eat dessert.",
      "content": "Eat dessert. Look at every dessert option before choosing one. You can try something new, but you should consider what you typically like and dislike before taking something. For example, don't get pumpkin pie if you don't typically like pumpkin dishes. If you can't decide, take a small amount of multiple desserts. [14] X Research source"
    },
    {
      "title": "Be cautious about how long the food has been sitting out.",
      "content": "Be cautious about how long the food has been sitting out. It's difficult to tell how long food has been out unless you ask, but there are ways to avoid eating food that has potentially gone bad. Often, it's a good idea to avoid foods that are sitting out in large vats. Foods that are in large vats are more likely to have been there for longer than other foods. Also, if the food appears to be discolored, a different texture than usual, or has an unusual smell, it is best to move on to another dish. [15] X Research source Tell a staff member if you think any food has gone bad. You can ask how long a food has been out if you are unsure."
    },
    {
      "title": "Choose small portions.",
      "content": "Choose small portions. It's tempting to take a huge portion of the lasagna that looks delicious, but avoid this. Take a small portion of every food. It's even okay to get unhealthy foods you wouldn't normally eat as long as you take a small amount. If you decide you want more, you can always go back. [16] X Research source"
    },
    {
      "title": "Pick foods you wouldn't cook for yourself.",
      "content": "Pick foods you wouldn't cook for yourself. Buffets often offer foods like toast and scrambled eggs. While these are tasty, look for healthy options you wouldn't normally cook for yourself so that the meal feels like a treat. For example, choose the smoked salmon or grilled trout if you don't normally make it at home. [17] X Research source"
    },
    {
      "title": "Avoid too many starchy foods.",
      "content": "Avoid too many starchy foods. It's okay to have some starchy foods, but these foods are usually unhealthy and will fill you up quickly. Starchy foods are foods like potatoes, rice, and pasta. Take a small portion of these foods. [18] X Research source"
    },
    {
      "title": "Don't overeat.",
      "content": "Don't overeat. It's tempting to continue going back for food at a buffet simply because it's there. Avoid this temptation. Stop eating as soon as you feel full. [19] X Research source Sit facing away from the buffet. This is thought to help you take fewer trips to the serving station. Skipping the tray will help you avoid overeating because you can not take as much food during one trip."
    },
    {
      "title": "Choose frozen yogurt or fruit as dessert.",
      "content": "Choose frozen yogurt or fruit as dessert. If it's your splurge meal, it's okay to go for a piece of cake or ice cream. But, if you want to stay healthy, choose a dessert that isn't so loaded in calories. Frozen yogurt or a bowl of fresh fruit would be a good idea. [20] X Research source"
    }
  ]
}