{
  "url": "https://www.wikihow.com/Dispute-a-Hospital-Bill",
  "title": "How to Dispute a Hospital Bill",
  "steps": [
    {
      "title": "Hold onto all of your bills.",
      "content": "Hold onto all of your bills. Effectively disputing a hospital bill requires that you know exactly what you are being charged for. Preserve every bill that you receive from the hospital. Also hang onto bills from medical centers, labs, and the doctor’s office. When a hospital bills for medical care, the bills are often incredibly vague and wordy. Also, you may receive multiple bills for one procedure or visit. Oftentimes you will get separate bills from surgeons, hospitals, medical groups, specialists, and other physicians. Finally, it is not uncommon to receive a bill six to eight months after treatment. Be aware of all of these things when collecting your medical bills. To make things easier, have a giant folder that you can throw bills into once you have looked over them. You can also scan bills so that you have a PDF of the bill on your computer. All bills should be itemized, i.e., broken down by individual charge. These are called “line-item” or “detailed” bills. Call the hospital and request a detailed bill if you are not sent one. [1] X Research source"
    },
    {
      "title": "Review your bills.",
      "content": "Review your bills. You want to make sure that the hospital hasn’t double-billed you or made other errors. [2] X Research source For example, an exam charge could show up on a hospital bill but also on your doctor’s bill. You want to make sure that you catch all errors. Make sure that the hospital doesn’t charge you for medications you brought from home. Also, check that the hospital does not charge the full-day rate for the room if you were discharged in the morning. Also look to see if you were charged for supplies like sheets, gowns, or gloves. These supplies should already be included in the cost of the hospital room."
    },
    {
      "title": "Find out how much your insurer will cover.",
      "content": "Find out how much your insurer will cover. Before disputing the hospital bill, you should see how much of the bill is covered by your insurance. [3] X Research source Try to get your insurer to cover all legitimate charges. Your insurer might claim that your policy does not cover certain drugs or procedures. Take out your policy and check. You can appeal any rejection by a health insurer. For more information, see Resolve a Claim Dispute With Your Health Insurance Provider."
    },
    {
      "title": "Research the fair price of each procedure.",
      "content": "Research the fair price of each procedure. To challenge a bill, you will need proof that the hospital’s prices are out of line compared to those charged by other hospitals. You can find the prices that other hospitals charge by looking online. Visit the websites for Healthcare Blue Book and FAIR Health to find prices. Medical costs will vary greatly among hospitals even though they are in the same town or region. In addition, the cost of procedures are not typically transparent or rational. You may have to do some digging to uncover competitor pricing. You also might want to use the Medicaid rates as a guide. They can be found at https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/Medicare-Provider-Charge-Data/index.html . If you find that your hospital is charging more than other hospitals in your area, offer your hospital what other hospitals in your area are charging. This is a great way to cut your costs and having other hospitals' pricing is great evidence of what your cost should be."
    },
    {
      "title": "Think about paying with cash.",
      "content": "Think about paying with cash. If you do not have insurance or if insurance is not covering all of your costs, you can usually get a sizable discount if you offer to pay in cash. Healthcare providers will often cut their prices by 66% or more if you are willing to pay everything up front in cash. In some cases, hospitals and doctors have taken 1/10 of the original bill. Wen you negotiate an all cash deal, start with a lower offer, maybe around 1/4 the original bill. You and the other party will negotiate from there. If you cannot pay everything up front and you have to create a payment plan, be prepared to pay a little bit more. However, never be afraid to negotiate."
    },
    {
      "title": "Call the hospital.",
      "content": "Call the hospital. You can begin the dispute by calling the hospital. Share with them that you are unhappy with the charges and explain why. Keep careful notes of who you talk to. Note the person’s name, the day and time, as well as the substance of the conversation. You need to keep careful notes because you are likely to talk to a new person each time you call the hospital. [4] X Research source"
    },
    {
      "title": "Write a dispute letter.",
      "content": "Write a dispute letter. After calling, you should follow up with a letter. Summarize the conversation and repeat the reasons why you are challenging the bill. Be sure your letter includes the following: Your account information. State your name and whatever patient identification number the hospital gave you. The charges you are disputing. Make reference to specific charges on the bill. For example, “In particular, I don’t think I should have to pay the charges of $24.55 for rubber gloves on both March 21 and 22.” The reason why you are disputing the charge. You might write, “As I explained over the phone, items like rubber gloves should be included in the room rate, as they are standard items used.” Supporting documents. Here, you can print off any information that shows what other hospitals charge. You can reference them in your letter. “As you can see, the average cost for the other two hospitals in the city is less than half what you have charged me. I have included a print-out of costs for your competitors.”"
    },
    {
      "title": "Think about hiring an advocate.",
      "content": "Think about hiring an advocate. If the hospital won’t lower the bill to an amount that makes you happy, then you need to think about hiring a patient or medical-billing advocate. These advocates often work on contingency; that is, they will take a portion of your savings (e.g. 20-30%) as their fee. [5] X Research source If the advocate saves you $20,000, then he or she might get $5,000. Some advocates may also be willing to work for an hourly fee. Typically, they can charge from $50 to $175 an hour. You can find a patient advocate online or in your phone book. They can be listed under different names, including “claims assistance professionals,” “medical-claims professionals” or “health-care claims advocates.” You might also want to hire an attorney instead of a patient advocate. Like advocates, many attorneys will work on contingency, and they will charge around 30% of whatever savings they get for you."
    },
    {
      "title": "Negotiate with the hospital.",
      "content": "Negotiate with the hospital. If you have an advocate or lawyer, they can negotiate with the hospital to lower the amount of the bill. Should you attempt to handle negotiations on your own, then keep the following in mind: Refuse to pay for anything you didn’t use. If a charge appears on the bill erroneously, refuse to pay. Ask the hospital to look at your medical reports to confirm that the doctors and nurses actually used the item you have been charged for. If the hospital made a mistake, then insist that they pay for it. For example, if you got an infection while in the hospital, try to get the hospital to cover the extra time spent in the hospital. Be frank about your financial situation. If the bill is so high you don’t think you can ever pay it, say so. Offer to pay a lump sum in exchange for a discount. Some hospitals might agree to cut the bill significantly if you can pay it all at once."
    },
    {
      "title": "Negotiate directly with the doctor.",
      "content": "Negotiate directly with the doctor. If your bill comes from the doctor or another healthcare professional directly, negotiate with them directly. Use the same tactics as if you were negotiating with the hospital. If you have an advocate to help you, discuss a strategy with them."
    },
    {
      "title": "Ask about financial assistance.",
      "content": "Ask about financial assistance. By law, non-profit hospitals must offer financial assistance programs. You should check with the hospital to find out the eligibility requirements. Typically, eligibility is based on your savings and income. Ask the hospital about any financial assistance, as hospitals tend not to advertise these programs. [6] X Research source Even if you used a for-profit hospital, you should still ask about potential financial assistance programs. These programs can reduce the overall amount that you owe or offer flexible repayment plans."
    },
    {
      "title": "Use the threat of bankruptcy.",
      "content": "Use the threat of bankruptcy. As a last ditch effort to come to a deal, consider discussing your willingness to file for bankruptcy with the doctor or hospital. If you file for bankruptcy and have medical debt, a doctor's or hospital's ability to collect is greatly diminished. You can use this to come to a deal as a doctor will not want their debt to go through bankruptcy. Don't ever be afraid to put your cards on the table and tell the other party what you are looking into. You will be surprised at the deals you can make if you try."
    }
  ]
}