{
  "url": "https://www.wikihow.com/Determine-the-Fair-Market-Value-of-a-Vehicle",
  "title": "How to Determine the Fair Market Value of a Vehicle",
  "steps": [
    {
      "title": "Go to Edmunds (www.edmunds.com) or Kelley Blue Book (www.kbb.com).",
      "content": "Go to Edmunds (www.edmunds.com) or Kelley Blue Book (www.kbb.com). On the main page of each site, look for a tab or icon that states “Price My Car” or something similar. After you click on this tab it will take you to a brief form to fill out. The website will then use the information that you supply to come up with a market value estimate for your car. [1] X Research source These sites will give you an estimate free of charge in most cases. If you choose to list your vehicle for sale on their site, there may be additional fees."
    },
    {
      "title": "Enter in the exact year and model for your vehicle.",
      "content": "Enter in the exact year and model for your vehicle. After you leave the main website and head into the used car category, one of the first pieces of information that you’ll need to supply will be the date of creation for the vehicle and the model (or type of body) for the vehicle. This information should be listed on your owner’s manual or may even appear on the inside of your driver’s door. If you are uncertain of the year, enter in a date range. If you are uncertain about the model, look up similar vehicles online until you find one that looks that same as yours."
    },
    {
      "title": "Provide your car’s mileage.",
      "content": "Provide your car’s mileage. Look at the odometer on your car and you’ll see a series of numbers that shows the car’s mileage. You may need to turn on your car to see this display on newer vehicles. Then, enter in this number where prompted on the FMV website. Put simply, cars with fewer miles are almost always worth more than those with many miles."
    },
    {
      "title": "Plug in your zipcode or city name.",
      "content": "Plug in your zipcode or city name. This information allows the website to tailor your car’s FMV to your particular area. This is important because the FMV of a vehicle can shift according to supply and demand. If the demand for your type of car is high in your area, then your FMV will reflect this. For example, if you live in a city area, then smaller vehicles may be in demand and could end up with high FMVs."
    },
    {
      "title": "List out all of your car’s options and amenities.",
      "content": "List out all of your car’s options and amenities. Walk around your car from bumper to bumper and write down everything that makes it unique compared to other vehicles. Many of these options will be for a driver’s convenience or comfort, such as power windows and locks. You might also list chrome bumpers/mirrors, AC, window tinting, sunroof, leather interior, sound system extras, and any guidance systems."
    },
    {
      "title": "Be honest about your car’s condition.",
      "content": "Be honest about your car’s condition. It sometimes helps to assess your car in terms of exterior, interior, and mechanical condition. [2] X Expert Source Bryan Hamby Car Buying Expert Expert Interview. 11 June 2019. Note any flaws in these separate areas. Then, read over the levels provided by the website and chose the one that most closely fits your vehicle. For example, a car that no longer runs might be assessed as “Poor” or “Not Running” in the mechanical category."
    },
    {
      "title": "Save or print out copies of your final report.",
      "content": "Save or print out copies of your final report. After you’ve entered in all of the requested information, click the tab on the bottom to get your pricing report. When the report pulls up, read over it. Then, save a PDF to your computer and print out a few copies for your reference. Potential buyers might also want a copy of the FMV estimate. This lets them know that your asking price is fair and reasonable."
    },
    {
      "title": "Recognize that FMV is different than trade-in value.",
      "content": "Recognize that FMV is different than trade-in value. According to the Internal Revenue Service, a FMV is an estimate of the sales amount that a private seller and buyer would agree to for a vehicle. In contrast, a trade-in value is what a dealership would offer. It’s also important to note that the FMV is calculated based on the actions of willing buyers/sellers, not ones under duress. [3] X Research source Trade-in values for used cars are also often altered by dealers to boost vehicle sales. An FMV estimate is more consistent."
    },
    {
      "title": "Enter in reasonable comparison details if you don’t know the exact information.",
      "content": "Enter in reasonable comparison details if you don’t know the exact information. If you are looking up an estimate for someone else or if you are researching an older vehicle, you may not know every detail requested by the website. That’s okay. Enter in a number of years or a series of options to create a workable value range. [4] X Research source For example, if you know that the car was made in the late 1990s, enter in 1996, 1997, 1998, and, 1999. Note how the values differ with each year."
    },
    {
      "title": "Compare your car to others currently for sale.",
      "content": "Compare your car to others currently for sale. [5] X Expert Source Bryan Hamby Car Buying Expert Expert Interview. 11 June 2019. Look at the automobile listings in your local newspaper. Or, go to a used auto sales website such as www.autotrader.com, enter in your zipcode, and search for similar cars in your area. Make note of the asking prices for cars that are similar to your own. [6] X Research source For example, if you are selling a 1999 Mustang and see a 2000 model in your local paper, note the price. It’s probably a bit higher than your car’s FMV, but may be pretty close to it."
    },
    {
      "title": "Adjust your FMV if you take a while to sell your car.",
      "content": "Adjust your FMV if you take a while to sell your car. Your car’s FMV is time-specific, meaning that it can change if you take months or even years to donate or sell your vehicle. Every month or so re-visit the estimate websites and enter in your car’s information to get an up-to-date FMV. You may also want to change your car’s asking price based on this new estimate. For example, you may find that the FMV for a convertible might actually go up during the warmer months, as they are more in demand."
    },
    {
      "title": "Clean your car on the inside and out.",
      "content": "Clean your car on the inside and out. You can do this yourself or you can take it to a detailing place. If you can remove any imperfections, such as stains on the upholstery, then this will increase your car’s value. [7] X Expert Source Bryan Hamby Car Buying Expert Expert Interview. 11 June 2019. If you have a few dings on the exterior, buy touch-up paint and make these corrections, too. [8] X Research source Professional detailing can be costly. Weigh the benefits of a boosted FMV versus the out-of-pocket cost for cleaning."
    },
    {
      "title": "Pay a mechanic to assess and fix any mechanical problems.",
      "content": "Pay a mechanic to assess and fix any mechanical problems. If your car is newer or collectible, take it a local, trusted mechanic and ask them to evaluate it for any issues. [9] X Expert Source Bryan Hamby Car Buying Expert Expert Interview. 11 June 2019. Then, decide if the cost of fixing these problems will boost your FMV up enough to warrant the expense. Even making minor repairs, such as replacing the window wipers, might pay off if you can report a higher condition rating for your vehicle. [10] X Research source"
    }
  ]
}