{
  "url": "https://www.wikihow.com/Do-Victory-Rolls",
  "title": "How to Do Victory Rolls",
  "steps": [
    {
      "title": "Apply a light mousse to make your hair easier to manipulate.",
      "content": "Apply a light mousse to make your hair easier to manipulate. Dispense a dollop of light hair mousse into the palm of your hand. Rub your hands together to spread it, then work the mousse into your hair, moving from the bottom up. [1] X Research source You don't need a strong mousse for this. It's not meant to hold your hair in your place—hairspray will be used for that later—it will just make it easier to work with. If you don't have mousse, work with hair that hasn't been washed in a full 24 hours. The oils from your scalp should have coated your hair during this time, giving it more structure and making it easier to shape than freshly washed hair. Apply dry shampoo for the same effect. It adds texture and a coating to your hair so the bobby pins will stick. This is especially good if you have very healthy, silky hair that doesn't hold curls or bobby pins well. [2] X Research source"
    },
    {
      "title": "Separate your hair into a top and a bottom section.",
      "content": "Separate your hair into a top and a bottom section. Beginning at one temple, use the end of a comb to draw a line around the back of your head to your other temple. This will create a horizontal part that separates your hair into top and bottom. Secure the bottom with an elastic hair tie. [3] X Research source The line should gradually curve upward from one temple, then curve downward as it reaches the other temple. The highest part of the curve should be the back center of your head, and it should be nearly high enough to reach your natural part. When creating the victory rolls, you'll only work with the top portion of hair. Tying back the bottom portion keeps it out of your way and makes it easier to complete the rolls."
    },
    {
      "title": "Create a straight part from your forehead to the back of your head on either side.",
      "content": "Create a straight part from your forehead to the back of your head on either side. You can choose either side of your head to create the part, but you want it to be just about midway between the center of the top of your head and your ear. Whichever side has more hair will have a higher, bigger curl until you get very good at manipulating the curls and can change their sizes. [4] X Research source If you have side-swept bangs, section your hair so that the part lands on the opposite side of your bangs. If you don't have bangs, draw the part on either side. It's not common to use a center part for this style."
    },
    {
      "title": "Split the top half of your hair into two sections to begin making the rolls.",
      "content": "Split the top half of your hair into two sections to begin making the rolls. Keeping your part intact, reach around the back of your hair and use your fingers to separate the top section in two separate and roughly equal left and right sections. Secure one section with a clip and hold the other section in your hand. [5] X Research source"
    },
    {
      "title": "Brush the free section of hair upward until all the tangles are removed.",
      "content": "Brush the free section of hair upward until all the tangles are removed. Holding your hair in one hand and a brush in the other, pull your hair straight up in the air and brush all the tangles out by brushing from your scalp upwards. If you brush your hair while it hangs down naturally around your face, it will not fold into the curls well. [6] X Research source Some people like to tease their hair at this stage to make it more workable. If you hair is very thin, you can tease it if you like, but the dry shampoo or mousse should eliminate the need to damage your hair by teasing."
    },
    {
      "title": "Spray hair spray all over the section for added control.",
      "content": "Spray hair spray all over the section for added control. As you are holding the hair up with one hand, grab a can of hairspray with the other and spray your hair liberally. The more hairspray you use, the stickier your hair will become, which will make it easier to curl and easier to pin in place. [7] X Research source If your hair is already pretty stiff from the dry shampoo or mousse, you may be able to skip the hairspray."
    },
    {
      "title": "Begin the first curl by wrapping the end around two fingers.",
      "content": "Begin the first curl by wrapping the end around two fingers. After brushing your hair, keep holding it straight up to form the first curl. While holding the section of hair in one hand, wrap the end of your hair toward the back of your head around your middle and ring fingers. Do this 3 or 4 times until you form a solid curl around your fingers. [8] X Research source"
    },
    {
      "title": "Slip your fingers out of the curl, then continue rolling toward your scalp.",
      "content": "Slip your fingers out of the curl, then continue rolling toward your scalp. Once you've made a good curl around your two fingers, carefully remove your fingers from the center of the curl and instead hold the outside of the curl with both hands. Then, slowly and neatly, roll the curl all the way down until it is tightly up against your scalp. [9] X Research source Instead of rolling around your fingers, you can also roll the section around a 1 in (2.5 cm) cool curling iron. Doing so can produce a smoother, neater roll."
    },
    {
      "title": "Spray the curl liberally with hairspray if you like the way it looks.",
      "content": "Spray the curl liberally with hairspray if you like the way it looks. If it looks smooth and curled the way you want it, spray it with hairspray to help hold it into place. If it's messy or you don't think you did it right, drop the curl and start again with brushing the hair upward and making the curl. [10] X Research source At this point, the roll should look like a small \"o\" with a hollow center."
    },
    {
      "title": "Pin the curl into place along your scalp using 3-4 bobby pins.",
      "content": "Pin the curl into place along your scalp using 3-4 bobby pins. Gently remove one hand from the curl, using the other hand to keep the curl firmly in place against your head. Then, take your free hand and slide bobby pins in the front and back sides of the curl. [11] X Research source If you have very thick hair, you may need to use more bobby pins to hold the roll in place."
    },
    {
      "title": "Touch up the shape of the roll.",
      "content": "Touch up the shape of the roll. Use your hand to gently flatten the back of the roll, closing it off. Pin the bottom of the roll in place using another bobby pin or two. [12] X Research source If necessary, shape the front of the roll during this step as well, making it as rounded as possible. You can use more bobby pins to help hold the shape of the roll, but make sure that each one remains hidden somewhere within the roll itself."
    },
    {
      "title": "Create the second curl by following the same steps on other top half.",
      "content": "Create the second curl by following the same steps on other top half. Gather the hair together along the other side of your part. Follow the same steps—brush, spray, roll, pin—to create another victory roll from this portion of hair. [13] X Research source . The victory rolls are complete, but you'll still need to style the bottom portion of hair previously tied back."
    },
    {
      "title": "Release the bottom portion of hair from the elastic hair tie.",
      "content": "Release the bottom portion of hair from the elastic hair tie. Brush out any tangles, working the brush straight down until your hair seems smooth again. Take extra care not to disturb the curls. [14] X Research source There are several ways to match the bottom of your hair to the victory curls, but the simplest is to leave the lower section down and give a loose, wavy curl."
    },
    {
      "title": "Curl the loose hair with a hair dryer and round brush.",
      "content": "Curl the loose hair with a hair dryer and round brush. Work around your entire head using a hair dryer and large-barrel round brush to make loose, flowy curls. Don't brush the curls out, or that will make them frizzy. [15] X Research source The waves or curls of this section should spiral down vertically. Do not curl the hair in horizontal sections. You can also use a 2 in (5.1 cm) to 3 in (7.6 cm) curling iron to curl the bottom section of your hair."
    },
    {
      "title": "Secure the whole style in place with a final coat of hairspray.",
      "content": "Secure the whole style in place with a final coat of hairspray. Use enough spray to hold both the rolls and your loose-hanging waves. Up-dos require a lot of hairspray to tame flyaways and hold everything in place. [16] X Research source Hold the hairspray about 12 inches (30 cm) from your hair and mist it evenly all over. If your hair looks frizzy at this point, you can also use a small amount of hair cream or serum to help tame the frizz and create a smoother style."
    },
    {
      "title": "Accessorize if you want to add a little pizazz or color.",
      "content": "Accessorize if you want to add a little pizazz or color. You can leave the victory rolls as they are, or you can give the look even more retro, feminine flair by highlighting them with a large flower or colorful bow. Just clip your chosen accessory into the style wherever you think looks best. [17] X Research source Position the accessory on the side with the smaller victory roll to keep the look balanced. Slide the hair clip into the flat hair toward the front of your face and just above your ear. The ornament should not grab into the hair used to complete the victory roll itself."
    }
  ]
}