{
  "url": "https://www.wikihow.com/Get-Rid-of-Flesh-Flies",
  "title": "How to Get Rid of Flesh Flies",
  "steps": [
    {
      "title": "Track the flies to find out where they originated from.",
      "content": "Track the flies to find out where they originated from. Flesh flies get their name because they lay their eggs inside decaying plant and animal material. They also love garbage. When you first spot the flies, walk towards them. By finding where the majority of flies gather, you may end up finding the source of the infestation. Figuring out where most of the flies are helps narrow down your search. If you see lots of big flies or white maggots in a single spot, you know where to look for the cause. Flesh flies are relatively harmless and don’t bite people, so you don’t need to worry about getting attacked by them while you search."
    },
    {
      "title": "Check near walls for large amounts of flies.",
      "content": "Check near walls for large amounts of flies. Sometimes flesh flies appear on a wall all at once. When this happens, the source of the infestation is near the wall. Search the area, including underneath furniture. If you don’t see anything unusual, the problem may be inside the wall. Flesh flies will find animals like rats, squirrels, and birds that wander into your home. [1] X Research source Flesh flies often reach animal carcasses while they are fresh. The animal begins stinking after about 3 days. You can locate it by detecting its smell through the wall, then dispose of it after enclosing it in a garbage bag. Animals entering your home may also end up in the ceiling or behind light fixtures. Search around for off-putting odors or other animal tracks. If you have a pet cat that goes outdoors, search areas near where your cat comes indoors. Sometimes cats bring presents that attract flesh flies."
    },
    {
      "title": "Search inside garbage cans and dumpsters for flesh flies.",
      "content": "Search inside garbage cans and dumpsters for flesh flies. Garbage bins are common starting points for flesh flies. Expect them to be inside open containers and untied bags. They often feed on raw meat but will infest almost any food you throw away. Check the garbage areas for large numbers of flies to identify the problem. [2] X Research source Look underneath garbage bins for anything unusual. Check for animal carcasses and flesh flies. If you see nothing but flies, then you know the garbage is the problem."
    },
    {
      "title": "Inspect the outside of your home for organic waste.",
      "content": "Inspect the outside of your home for organic waste. If you don’t see anything inside your home, the source of the infestation may be outside. Check around the walls, including underneath bushes and furniture, for animals. Look around for animal droppings or litter. If you have a compost pile, inspect it for flies. Any sort of organic material close to your home is a problem. Flesh fly larvae don’t crawl very far, but sometimes they slip inside buildings."
    },
    {
      "title": "Seal dead animals in an airtight container, then throw them away.",
      "content": "Seal dead animals in an airtight container, then throw them away. Remove rats and other animals as soon as possible to stop flesh flies from forming. Put on a pair of rubber gloves to protect yourself from bacteria. Move the animal into a plastic bag, garbage bag, or another container. Then, tie it up tight before throwing it away. Cut walls to remove animals inside your home. Use a drywall or keyhole saw to remove a square section of the wall and access the animal."
    },
    {
      "title": "Pick up animal droppings and other organic waste.",
      "content": "Pick up animal droppings and other organic waste. Scoop up the waste with a shovel or paper towel. Throw it into a plastic bag or garbage bag to tie shut when you’re done. Dispose of it with the rest of your trash during trash removal day or take it to a landfill. Burying or burning waste also stops flies from reaching your home. [3] X Research source Inspect waste first for signs of flies and maggots. Waste, especially animal droppings, is the main food source for flesh flies. To reduce the chances of attracting flesh flies, discourage stray animals from visiting your home. Hide food sources and install barriers to make your yard less appealing."
    },
    {
      "title": "Maintain compost piles to keep them warm.",
      "content": "Maintain compost piles to keep them warm. Composting is a great way to recycle, but compost piles give flesh flies a home. To prevent new flies from growing, maintain your compost pile by stirring and watering it. The heat inside the compost pile kills most maggots before they grow. [4] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source If you notice flies around a compost pile, try covering it with black plastic sheeting from a hardware store. The plastic causes the compost to heat up more, eliminating flies before they escape."
    },
    {
      "title": "Spray pyrethrin or another insecticide to eliminate adult flies.",
      "content": "Spray pyrethrin or another insecticide to eliminate adult flies. Pick an insecticide safe for indoor use. Read the label to make sure the spray is effective on flies. Then, spray around the infested area to knock out the flesh flies. [5] X Research source Pyrethrin and similar sprays are not very toxic to humans, but keep pets and other people away from the area. Air the area out for a couple of hours before returning to it."
    },
    {
      "title": "Swat leftover flies to remove them by force.",
      "content": "Swat leftover flies to remove them by force. Get a traditional flyswatter, a rolled newspaper, or another item for a brute force solution. This is a natural way to eliminate pesky flies. Use it in place of an insecticide or to take care of any stragglers left after spraying the area. [6] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Keep in mind that flies are pretty quick and you may not spot them all right away. As long as you took care of the source of the infestation, this won’t matter much, but the adult flies can lay new eggs."
    },
    {
      "title": "Vacuum the area to clean up flies and maggots.",
      "content": "Vacuum the area to clean up flies and maggots. Keep your vacuum cleaner handy. Go over the infested area to clear out dead flies and other debris. Also, try using a hose attachment to suck up flies still in the air. [7] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. After you’re done, throw away the bag without opening it. [8] X Research source Any flies that are still alive get mixed in with the dust in the bag and die quickly. Still, replace the bag to ensure none of them can escape. This doesn’t work well with bagless vacuums unless you are willing to wait. Wait for up to 7 days before emptying the vacuum to ensure the flies are all dead."
    },
    {
      "title": "Seal gaps in your home with foam and caulk.",
      "content": "Seal gaps in your home with foam and caulk. [9] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Note any gaps around your home, including spaces around exterior fittings and crevasses near interior molding. Fill cracks less than 1 ⁄ 2 in (1.3 cm) wide with silicone caulk. For spaces wider than 1 ⁄ 2 in (1.3 cm), spray an expanding foam. [10] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Pick up foam and caulk canisters at a hardware store. You will need a caulk gun to spray silicone caulk. Expanding foams are often sprayed directly from a canister. Expanding foam isn’t waterproof, so don’t use it on areas exposed to moisture."
    },
    {
      "title": "Close doors and windows or install screens over them.",
      "content": "Close doors and windows or install screens over them. [11] X Expert Source Scott McCombe Pest Control Specialist Expert Interview. 19 November 2019. Flesh flies often slip in through open these open spaces. If you know the flies are around your home, keeping everything shut prevents them from getting in. The only way to protect an open door or window is with a good screen. Choose a screen that has between 14 and 16 wire strands per 1 sq in (6.5 cm 2 ) to prevent the flies from squeezing through. [12] X Research source Adult flesh flies are active during the spring and summer months. Have screens in place so you can open up your home during warm periods."
    },
    {
      "title": "Secure trash in closed bags and trash cans.",
      "content": "Secure trash in closed bags and trash cans. Prevent trash cans from getting dirty by putting plastic liners in them. Keep your disposal areas covered until you need to throw them away. During trash day, remove the trash bag, tie it up, and take it to an outdoor trash can for disposal. Cover the trash can with a tightly-fitting lid to prevent flies and other animals from getting into it. [13] X Research source Trash is a big source of flesh flies, so secure anything you throw away. Never put food directly into a trash can. Keep in mind that flesh flies smell trash. Remove trash bags regularly to avoid odors. When a bag leaks, wash out the trash can to eliminate food particles before flesh flies have a chance to reach it."
    },
    {
      "title": "Clean up organic waste in and around your house regularly.",
      "content": "Clean up organic waste in and around your house regularly. Keeping your house clean is the best way to prevent flesh flies from returning. That means inspecting your yard, trash, and compost areas for waste. Remove all garbage, pet food, animal droppings, and pests from your home right away. Wash your home with soap, water, and commercial cleaners often to eliminate odors that attract flies. [14] X Research source Bad odors tend to linger for a long time. The only way to eliminate odors is to remove the source, sanitize the area , then spray products like air fresheners repeatedly."
    },
    {
      "title": "Install light traps to attract stray flesh flies.",
      "content": "Install light traps to attract stray flesh flies. Like most flies, flesh flies can’t resist light. Hang a light trap about 15 ft (4.6 m) away from your doors and windows. Keep it about 6 ft (1.8 m) off of the floor. At night, when you turn it on, any flesh flies that see it will fly straight for it. Clean out the trap on occasion to remove the dead flies. Light traps are available online and at some general and hardware stores. You can also make your own with a light bulb, funnel, and container. Adding bait to a trap will also lure in flesh flies. Try a chemical fly bait so you don’t have to have rotting meat or plant matter stinking up your home."
    }
  ]
}