{
  "url": "https://www.wikihow.com/Deal-with-Cherry-Tree-Pests",
  "title": "How to Deal with Cherry Tree Pests",
  "steps": [
    {
      "title": "Check leaves and shoots for colonies of aphids.",
      "content": "Check leaves and shoots for colonies of aphids. Aphids are small, black insects that love to eat both leaves and cherries. Adult aphids live higher up in the tree, while you can spot young aphids and larvae lower on the tree. [1] X Research source When you go to pick out a cherry tree, take a few minutes to carefully examine the leaves. If you see a lot of small, black, shiny bugs on the leaves, it’s best to choose another plant. Look underneath the leaves for clusters of eggs. Individual eggs are tiny but are laid in bunches. If you see small, white flecks on the leaves, choose another plant."
    },
    {
      "title": "Look for damage to your leaves to find mites.",
      "content": "Look for damage to your leaves to find mites. Examine your tree at the beginning of the growing season (early spring) so that you can catch any problems, such as mites. These tiny pests range in color from reddish to brown to gray. They are hard to see with the naked eye, but if you see leaves that are curling or have holes in them, there's a good chance you have a mite problem. [2] X Research source Mites can also stunt tree growth, so it's important to check your leaves regularly so that an infestation doesn't get out of hand."
    },
    {
      "title": "Keep an eye out for damaged cherries to spot fruit flies.",
      "content": "Keep an eye out for damaged cherries to spot fruit flies. If you notice small punctures in your cherries, you could have a problem with fruit flies. You might not be able to see these small pests, but holes in your fruit could indicate that the bugs are laying eggs in the cherries. Start checking your fruit as soon as it begins to grow so that an infestation doesn't get out of hand. [3] X Trustworthy Source University of California Division of Agriculture and Natural Resources Extension program of the University of California system devoted to educating and improving local communities Go to source Gently squeeze cherries to check for damage. If they leak juice, look for a tiny hole. If you see one, get rid of the fruit."
    },
    {
      "title": "Examine the trunk and branches for small, beetle-like borers.",
      "content": "Examine the trunk and branches for small, beetle-like borers. Adult borers resemble tiny, blackish-brown beetles. The larvae are white, legless, and can sometimes be seen in clumps. These pests are hard to see, so you should look for damage to help determine whether you are dealing with borers. [4] X Research source Both the adults and larvae burrow through trunks and branches, creating visible tunnel-like structures."
    },
    {
      "title": "Don’t take action if you see adult aphids or their enemies.",
      "content": "Don’t take action if you see adult aphids or their enemies. In the early spring, look over your cherry tree to see if you can spot any aphids. If you see aphids with wings in the higher branches, you don't have a problem. That means they will be taking flight and leaving soon, so you don’t need to take any action. When you’re examining the leaves, keep an eye out for ladybugs and lacewing larvae. These are aphid predators and will likely clear up your aphid problem for you. [5] X Research source"
    },
    {
      "title": "Spray the leaves with plain water to easily eliminate mites and aphids.",
      "content": "Spray the leaves with plain water to easily eliminate mites and aphids. If you have spotted aphids without wings or mites, use a hose to spray the leaves with cold water. The cold will often cause the aphids and mites to leave; they usually can’t find their way back to the same plant. Spray them thoroughly and then spray a couple of days later. [6] X Research source"
    },
    {
      "title": "Apply soapy water to the leaves every 2-3 days if pests persist.",
      "content": "Apply soapy water to the leaves every 2-3 days if pests persist. Fill a spray bottle with water and add a few drops of dish soap. Shake the bottle to combine the mixture, and then spray it on the leaves. Spray the leaves once every couple of days for 2 weeks. This should get rid of the pests. [7] X Research source Some people choose to add a pinch of cayenne pepper to the soap and water mixture. It’s possible that this might make it more effective. If you have a spray bottle attachment that goes on your hose, you can certainly use that to spray your tree. This should work on multiple pests unless you have a large infestation, in which case you'll need to try additional treatments."
    },
    {
      "title": "Dust the leaves with flour if water and soap don't work.",
      "content": "Dust the leaves with flour if water and soap don't work. Basic flour from your kitchen is fine, and you can just sprinkle it on the leaves. There’s no need to wipe it off. If you still see pests in a few days, you can try other sprays. [8] X Research source This can work on aphids and mites, but won't work on fruit flies or borers since they don't live on leaves."
    },
    {
      "title": "Harvest your fruit early if you have a fly infestation.",
      "content": "Harvest your fruit early if you have a fly infestation. If you spot damaged cherries, it’s likely too late to prevent an infestation, but you can pick all of the cherries that look healthy and don’t have holes. Pick the damaged fruit, too, but keep it separate. Seal the damaged fruit in a plastic bag and dispose of it far away from your trees. This will keep the flies from spreading. [9] X Trustworthy Source University of California Division of Agriculture and Natural Resources Extension program of the University of California system devoted to educating and improving local communities Go to source To prevent the flies from coming back next season, you can try spraying your tree with a half and half mixture of water and apple cider vinegar at the beginning of the growing season."
    },
    {
      "title": "Get rid of old and damaged leaves to keep the tree healthy.",
      "content": "Get rid of old and damaged leaves to keep the tree healthy. Healthy trees are less susceptible to infestations. Sometimes you might not be able to see pests, but you can tell that some leaves don’t look healthy. If you notice leaves that are curled, spotted, or look otherwise unhealthy, pick them off of your tree. If it’s too many for you to pick, contact a local garden center to ask about other treatment options. [10] X Research source If you see sick-looking leaves on the ground, gather them up and safely burn them. If you leave them on the ground, they can keep hosting pests that could migrate to your tree. Clean up old leaves and fruit in the fall so that they don’t rot, which can attract a variety of pests. [11] X Research source"
    },
    {
      "title": "Prune your trees regularly to contain borer damage.",
      "content": "Prune your trees regularly to contain borer damage. Check your branches once or twice a week to spot wilting or multiple small holes. If you see these signs of damage, carefully prune those branches to prevent borers from spreading. Trees that have recently been moved are especially susceptible to damage, so keep a close eye on them. [12] X Research source"
    },
    {
      "title": "Learn about pests in your area.",
      "content": "Learn about pests in your area. When dealing with pests, a lot depends on where you live. Contact a local expert and ask them for advice. Your local garden center can probably point you in the right direction. You can also contact a nearby college for information. [13] X Research source For example, peachtree borers are common in the Eastern United States and the midwest, while shot-hole borers are the common pest in the Pacific Northwest. Learning about the specific type of pest you're dealing with can help you figure out how to best keep your tree healthy. Try purchasing sprays locally. You're more likely to get a product that is specific to your region than if you purchase something online."
    },
    {
      "title": "Use dormant oil in spring to prevent mites and borers.",
      "content": "Use dormant oil in spring to prevent mites and borers. Stop by your local gardening center to pick up a dormant oil spray, or look for one online. These oils are used to kill any eggs or larva before they have a chance to grow and spread. Follow the directions on the packaging to make sure you use the product correctly. [14] X Research source Mites can quickly grow resistant to many pesticides. How to best treat them really depends on your geographical location, so contact a local expert to learn how to rotate pesticides for the best results. [15] X Research source If you’re not sure which spray to buy, ask an employee to help you out."
    },
    {
      "title": "Use a pesticide spray as a last resort.",
      "content": "Use a pesticide spray as a last resort. If you notice damage or pests in the late spring or early summer, and you’ve already tried other methods to get rid of them, you can try using pesticides. If you are going to use pesticides, choose a product with Diazinon or Malathion, as these are the safest. [16] X Research source Make sure to carefully follow the instructions on the packaging. If you aren’t sure which pesticide to use, ask an employee at your local garden center. Wait for a cool day to spray to avoid damaging the leaves. Temperatures above 80 degrees F (26.7 degrees C) combined with sprays can damage your leaves, causing them to curl or burn. [17] X Research source"
    },
    {
      "title": "Use a long-lasting insecticide to fight borers.",
      "content": "Use a long-lasting insecticide to fight borers. The best way to combat these pests is to preventatively use an insecticide spray. Ask an employee at your local garden center to recommend a long-lasting spray, then carefully follow the directions on the label. Spraying the bottom half of the tree trunk will typically kill any eggs and larvae, which will prevent and infestation. [18] X Research source Check to see which type of borer is common in your area and ask an expert for a recommendation on what to spray."
    }
  ]
}