{
  "url": "https://www.wikihow.com/Get-Over-Your-Celebrity-Crush",
  "title": "How to Get Over Your Celebrity Crush",
  "steps": [
    {
      "title": "Ask yourself whether you really know enough about that celebrity as a person to like them.",
      "content": "Ask yourself whether you really know enough about that celebrity as a person to like them. A person's career and lifestyle may be interesting and desirable — and even perfect —, but that doesn't necessarily make the person a good potential partner. [1] X Research source They may be polite and funny on camera, but they could be boring, a snob, greedy, or mean to people less fortunate than them in real life. You don’t really know, so it's likely that outside of their work, your crush is just like anyone else with faults and flaws. Nobody is perfect, not even celebrities!"
    },
    {
      "title": "Think about the likelihood of meeting them and having them start a relationship with you.",
      "content": "Think about the likelihood of meeting them and having them start a relationship with you. It's likely that you will never meet your celebrity crush, since they’re busy and have tons of fans. Even if you do, it's also possible that they wouldn’t take an interest in you. This can be hard to accept, but celebrities are normal people who can choose who they date, just like you."
    },
    {
      "title": "Prioritize a relationship that is both real and mutual.",
      "content": "Prioritize a relationship that is both real and mutual. While people in your real life might not be as attractive or famous as your celebrity crush, that does not mean that they’re not worth dating. True connection forms by trusting your partner, being able to communicate openly, and sharing common interests. [2] X Research source You can’t really do that with a person you’ve never seen in person or talked to one-on-one."
    },
    {
      "title": "Remove things from your life that remind you of your crush.",
      "content": "Remove things from your life that remind you of your crush. Take down all of your posters with pictures of them, and don't see the new movie they are in or listen to their new song. Don’t talk about them with your friends or family, and don’t spend time on the internet researching their lives. Everyone deserves privacy, even famous people. [3] X Research source You can do these things gradually over the course of several days, or stop it all in one go, like ripping off a Band-Aid. Whichever way you choose to do it, make sure all of the things that remind you of them eventually make it out of your life! Try not to be jealous if you find out they’re dating someone else, or happy if they’re breaking up with their partner. It doesn’t bring you any closer to them, and it only makes it harder to separate from them."
    },
    {
      "title": "Replace daydreams about them with thoughts about goals you have for your own life.",
      "content": "Replace daydreams about them with thoughts about goals you have for your own life. Concrete goals that focus on the bigger picture, like how you can improve yourself or do something nice for someone else, will help you far more than dwelling on an unlikely possibility. [4] X Research source Make sure your goals are reasonable and attainable. Think about how you want to study hard and get an “A” on your next paper or test. If you’re working on a new move in karate class, imagine yourself being able to do it perfectly, and practice when you get home. Help someone in need by volunteering at an organization, or doing something small like giving up your seat on the bus for an elderly person. Allow yourself to be inspired by the celebrity you have a crush on! Think about what are their qualities and then try to embody them in yourself!"
    },
    {
      "title": "Do something else that you like to do.",
      "content": "Do something else that you like to do. If you are having intense thoughts about this celebrity, an engaging but calming activity can help get your mind off of it. Finish that poem, book, painting, or other project you’ve been working on. Go for a walk and look around at all the beautiful trees, houses, and people that are right in front of you. Grab a coloring book or a print-out of a detailed pattern like a mandala and some colored pencils. Color to your heart’s content, and try to stay inside the lines. [5] X Research source Get some exercise by asking your friends if they want to play a pickup game of soccer or frisbee, or go on a run by yourself."
    },
    {
      "title": "Date someone who is in your life now.",
      "content": "Date someone who is in your life now. It can sometimes help to fill that hole that your celebrity crush left by dating someone else. Relationships with a real person are more fulfilling than imaginary ones. It can help if you already have a solid friendship, too! Don’t rush into a relationship to try to replace your crush. Take it slowly, and realize that real relationships can be both more complicated and rewarding than imagined ones."
    },
    {
      "title": "Date",
      "content": "Date a new person. Strike up a conversation with someone you think is cute, and keep it going by maintaining a positive attitude. Use your body language to let them know you’re interested, like standing a little closer and making eye contact. When you feel like you want to ask them out, suggest an activity that you think they might like to do, like getting some ice cream or going to a sports game. [6] X Research source"
    },
    {
      "title": "Stay single for a while.",
      "content": "Stay single for a while. It’s okay to take a break from dating and work on your own goals. Spending some time “alone” (that is, surrounded by friends and family) can even help you gain some perspective on what you need out of your next relationship. [7] X Research source"
    }
  ]
}