{
  "url": "https://www.wikihow.com/Dermaplane-at-Home",
  "title": "How to Safely Dermaplane at Home: Do's & Don'ts",
  "steps": [
    {
      "title": "Wash and dry your face.",
      "content": "Wash and dry your face. After applying a dime-sized amount of a gentle cleanser and washing it off, pat dry your skin with a towel. The drier your face is, the easier it will be for you to run the blade over the surface of your skin. [1] X Research source A clean base helps you prevent breakouts that could occur from your dermaplaning tool spreading bacteria from dirty skin into your freshly exfoliated pores."
    },
    {
      "title": "Use a single-blade dermaplaning tool.",
      "content": "Use a single-blade dermaplaning tool. Single-blade dermaplaning tools are made for dermaplaning, making them the perfect tool for removing dead skin and peach fuzz. While a traditional, single-blade dermaplaning tool is the most popular, standard option, there are countless dermaplaning tools to choose from, such as the following: Derma Flash Luxe : This is one of the most expensive options, but it’s likely to have the best effects as it uses sonic pulsations to brighten and exfoliate the skin. Stacked Skincare Dermaplaning Tool : This dermatologist-recommended tool boasts a lightweight yet sturdy design, as well as the option to replace the blades after use. Single-Use Dermaplaning Tool : You can’t go wrong with a classic! A single-use blade gets the job done and is super affordable. Never use the same blade more than once. A dirty, used blade can cause infection and irritation."
    },
    {
      "title": "Pull the skin taught, moving the blade in short, light strokes.",
      "content": "Pull the skin taught, moving the blade in short, light strokes. Starting near your ear, pull the skin at your jawline taught with your free hand. Then, hold your blade at a 45-degree angle and move in light, downward strokes as you work your way across your face from ear to mouth. [2] X Research source Pulling your skin taught ensures that your blade lightly glides over your skin and minimizes the potential of knicking yourself. Be sure to work in short strokes. Using longer strokes across your face will result in a patchy finish and an irritated skin barrier."
    },
    {
      "title": "Work in sections over your cheeks, jaw, forehead, chin, and mouth.",
      "content": "Work in sections over your cheeks, jaw, forehead, chin, and mouth. After you’ve dermaplaned your cheeks and jawline, use the same light, downward strokes to dermaplane your chin, upper lip, and forehead. Avoid going over the same spot more than 3 times to protect from over-exfoliating your skin. [3] X Research source Always hold your blade at a 45-degree angle, dermaplaning your skin in the direction that your hair grows (towards your chin). Remove any built-up skin and hair on the blade by wiping it with a clean paper towel or rinsing it under the sink. Sucking in your lips, so they lie taught against your teeth will make dermaplaning your upper mouth area easier."
    },
    {
      "title": "Finish by hydrating with a gentle moisturizer.",
      "content": "Finish by hydrating with a gentle moisturizer. Now that you’ve dermaplaned your entire face finish up by applying a dime-sized amount of hydrating moisturizer to protect your skin and amplify that gorgeous glow! Moisturizing after exfoliating is important because your skin is extra-prone to dryness and irritation after removing that top layer of dead skin. [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source To soothe nicks or irritation, tone your face with witch hazel before moisturizing."
    },
    {
      "title": "Wait 4 weeks before you dermaplane again.",
      "content": "Wait 4 weeks before you dermaplane again. Dermaplaning strips the top layer of dead, dry skin and hair, leaving renewed and refreshed skin underneath. This new layer of skin is extra-sensitive and must be nourished rather than exfoliated until the 4-week mark when it's ok to dermaplane again. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Over-exfoliation can weaken the skin’s barrier making it more prone to infection and irritation."
    },
    {
      "title": "Add a hydrating serum to your routine for extra-glowing skin.",
      "content": "Add a hydrating serum to your routine for extra-glowing skin. The more you moisturize your skin, the better! Applying a hyaluronic acid serum before your moisturizer is a great way to give your skin the drink it needs, keeping it supple and luminous. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Hyaluronic acid reduces the appearance of wrinkles and fine lines—oh ya!"
    },
    {
      "title": "If you can, don’t wear any makeup for at least 1 day after dermaplaning.",
      "content": "If you can, don’t wear any makeup for at least 1 day after dermaplaning. It’s best to avoid wearing makeup for at least 1 day after your at-home treatment to avoid clogging your pores. Exfoliation opens up your pores, making them more susceptible to bacteria, resulting in skin irritation or acne. [7] X Research source Avoid makeup for 48 hours for best results, but 24 is sufficient. While refraining from wearing makeup after your treatment may be frustrating, the pros far outweigh the cons of aftercare. Smoothed wrinkles, fine lines, and a brighter complexion overall? Yes, please!"
    },
    {
      "title": "Wear sunscreen daily.",
      "content": "Wear sunscreen daily. Apply sunscreen every morning to protect your skin from the sun’s damaging UV rays. [8] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Be sure to avoid the sun as best you can for at least 3 days after dermaplaning. Because you’ve removed the top layer of dead skin, you’ll be more prone to sunburn and sun-related skin damage like wrinkles."
    },
    {
      "title": "Avoid chlorine for 3 days.",
      "content": "Avoid chlorine for 3 days. While swimming in pools is heavenly, irritating your freshly exfoliated skin is not. Chlorine is a harsh, skin-stripping chemical best avoided for at least 3 days after your at-home treatment. [9] X Research source Sitting in a chlorinated pool or hot tub is fine. Just be sure not to get your face wet."
    }
  ]
}