{
  "url": "https://www.wikihow.com/Copy-Someone%27s-Handwriting",
  "title": "How to Copy Someone's Handwriting",
  "steps": [
    {
      "title": "Find a source document to trace.",
      "content": "Find a source document to trace. To trace someone’s handwriting, you will need to locate a good source document that offers examples of most letters. In order to trace it, the document should not be on particularly thick paper, as light will need to pass through. [1] X Research source If you find a good example of handwriting you like online, print it out onto a sheet of regular printer paper. Historical documents with decorative handwriting can be found many places online, and copies of documents can be found at museums and national parks for purchase."
    },
    {
      "title": "Place the source document over a light source.",
      "content": "Place the source document over a light source. There are a number of options when it comes to using a light source to trace handwriting, depending on your budget. Regardless of your choice, place the original over the light source, then place a blank sheet of paper over it. You may choose to use tracing paper, but most white sheets of paper will work provided they aren’t too thick. You should be able to see the handwriting on the original through your blank sheet of paper. Some light source options are: [2] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Architect Tables are desks with internal light sources that light your documents from below as you work on them. Light boxes are usually made of wood, with a white plastic top and an internal light source. They are usually small enough to place on top of a desk or table to use in the same way as an architect table. Windows can suffice if you don’t mind writing with your documents upright instead of flat on a table. Simply tape your original to the window, then place your blank piece of paper over the original on the window. Pencils work better than pens when using this method."
    },
    {
      "title": "Trace over their writing.",
      "content": "Trace over their writing. Now that you have the original document lit from below or behind and a blank sheet of paper over it, trace over the handwriting on the document. Pay close attention to how each letter is shaped as you trace them. [3] X Research source Once you have traced the entire document, use a new blank sheet of paper to keep practicing. Choose individual letters or words to trace for practice or trace the entire document. Choosing a document that uses all of the letters in the alphabet will ensure you can capture how each letter is formed."
    },
    {
      "title": "Attempt to recreate the handwriting without a source document.",
      "content": "Attempt to recreate the handwriting without a source document. Once you have practiced this method a number of times, place the source document nearby as a reference and attempt to write in that style freehand. When you forget how to properly shape a letter, refer to the original document as a refresher. Form new words so you are not getting too caught up in copying the content of the source. Keep practicing or go back to tracing until you have mastered the style."
    },
    {
      "title": "Locate a source document to analyze.",
      "content": "Locate a source document to analyze. Find a document that offers as many of the letters in the alphabet as possible to ensure you have a good grasp of how to write each letter. If you can blow the writing up into a larger image, it may help you to identify the correct way to draw each letter. You may be able to scan a document and then blow up the image with your computer. The more space between letters and words, the easier it will be to identify the different letters and how they are drawn."
    },
    {
      "title": "Find and analyze each letter individually.",
      "content": "Find and analyze each letter individually. Look for each letter within the source document and analyze the way it is shaped. Look at the angle the letter is written at, if there are any decorative touches, and the way the letter is shaped as a whole. Recreate each letter individually with a particular focus on the separate elements of the letter. Tails or serifs, for instance, can change the shape of a letter through the use of decorative additions. Focus on creating one letter at a time until you have mastered it."
    },
    {
      "title": "Start with the source document directly above your paper.",
      "content": "Start with the source document directly above your paper. It’s important that you keep the source document close by as you practice the elements of the handwriting you are attempting to copy. In order to do so, keep the sheet you are writing on just below the source document when you begin. [4] X Research source Look at the source document as often as you look at your sheet to ensure that the way you are writing matches what you are copying. Eventually move on to just keeping the source document close by as a reference, once you have a better grasp of the style."
    },
    {
      "title": "Practice and compare your writing to the source document.",
      "content": "Practice and compare your writing to the source document. Once you have practiced the letters individually, it’s time to start forming words with them. Look closely to how the words are spaced within themselves and from one another on the source document. Use the source document as a reference to better understand proper spacing within your writing. Identify letters you struggle with and go back to practicing their individual elements while analyzing the source document."
    }
  ]
}