{
  "url": "https://www.wikihow.com/Do-a-Chinese-Split",
  "title": "How to Do a Chinese Split",
  "steps": [
    {
      "title": "Know whether you're ready.",
      "content": "Know whether you're ready. Most people can do a split, but it takes a lot of stretching and strength training. Some experts recommend taking at least one month to train and prepare your body to do a split. Follow the stretching and strength training regimen outlined in this article. Do not attempt to do a split without any training or preparation."
    },
    {
      "title": "Dress properly.",
      "content": "Dress properly. In addition to preparing your body, wearing the right clothes is important for doing the split. You'll want to wear loose-fitting clothes like sweatpants to help with your range of motion. It would also help to wear socks on a wooden or tile floor, so you can easily slide your feet out to the side."
    },
    {
      "title": "Warm up.",
      "content": "Warm up. Just like with any stretching regimen, you can't attempt a Chinese split without first warming up your muscles. If you've been following a daily stretch and exercise regimen for several weeks to prepare for a split, perform your usual warm up regimen (about 15 to 20 minutes of physical activity) to make sure your muscles are ready for a split."
    },
    {
      "title": "Do a stretching regimen.",
      "content": "Do a stretching regimen. After you warm up, you need to do some preliminary stretches. Stretch every major muscle group that's involved in doing the split before trying to do the actual split. Try to work through all of the stretches you've done in the previous weeks leading up to your Chinese split attempt. These are the muscle groups you will be using to do the actual split, so loosen your body the same way you've been training."
    },
    {
      "title": "Work on the split gradually.",
      "content": "Work on the split gradually. After you've warmed up, you can start working on the split. It will probably take several attempts over days or weeks to do this split, so don't expect to get it your first time. Remember to stop at any point if you feel pain. Stand with your feet greater than shoulder width apart. Bend down and put your hands on the ground. If you can't get your hands to the ground, you need to work on stretching more. Shift your weight to your heels and rotate your toes and knees so that they're facing up. Then gradually walk your feet out from under you. Keep your hands on the ground to maintain stability -- you don't want to go down too suddenly, or you could injure yourself. Stop and hold when you've reached your limit. Even if you don't fully complete the split, try to hold the position to get your body conditioned."
    },
    {
      "title": "Repeat the split routine as needed.",
      "content": "Repeat the split routine as needed. It's very unlikely that you'll be able to to a full split right away. It's not unusual for people to take months to get it down properly, even when they stretch every day. Keep up your routine and you'll be able to loosen up your muscle enough to perform a full Chinese split. Try to extend the duration of your splits each day. Stay hydrated. Not drinking enough water can cause muscle cramps and may make you less flexible. Reduce inflammation in your legs and hips to help increase flexibility. One way to do this is by taking Omega 3 fatty acid supplements. [1] X Research source"
    },
    {
      "title": "Work up to doing a drop split.",
      "content": "Work up to doing a drop split. Once you've completed the necessary flexibility and strength training, and once you've worked your way up to being able to slowly do a split, you'll eventually be able to simply drop into a split the way entertainers do in movies and martial arts competitions. Being able to drop into a split will take some time and work - most people need over a month of consistent training and stretching to be capable of dropping into a split. You will need to develop a consistent stretching and strength-training regimen before attempting to drop into a split."
    },
    {
      "title": "Do a side split test.",
      "content": "Do a side split test. Before you invest in training to do a split, it's important to be sure you're physically able to hold this position. Most people are capable of performing a split after proper training and stretching, but some people have a rare condition like coxa vara, which causes an abnormally deep-seated hip socket. This condition limits the range of movement in the legs and hips. [2] X Research source A simple side split test can help determine if you're physically capable of doing splits. Stand next to a table or chair that is about as tall as your waist. [3] X Research source Keep one foot planted on the ground and lift the leg closest to the chair or table. Position your raised leg on the top of the chair or table. [4] X Research source Repeat this test with your other leg to ensure both hips are adequately flexible. [5] X Research source If you cannot perform this stretch painlessly, you may be unable to do a split."
    },
    {
      "title": "Warm up before stretching.",
      "content": "Warm up before stretching. When your muscles are cold, they're less flexible and more brittle. If you stretch cold muscles, you could hyper-extend or tear them. To avoid this, do some light exercising before you stretch. That way, you'll increase the circulation to your muscles and loosen them up for stretching. [6] X Research source The general rule is that a warm up exercise should just make you break a light sweat. This usually translates to about 15 minutes of activity. Some good workouts to try are a brisk walk, running in place for a few minutes, or doing jumping jacks."
    },
    {
      "title": "Start a flexibility regimen.",
      "content": "Start a flexibility regimen. Chinese stretches require flexibility in almost all the muscles in your lower body, so you'll need to put in a lot of work before you can complete one. Do not try to do a side split right off the bat . You risk damaging your muscles and could even end up with a tear. To avoid injuring yourself, work to increase your flexibility before attempting a full split. Some techniques you should keep in mind for a proper stretching regimen are: Spend about 30 seconds on each muscle, and repeat the stretch two to six times per session. Try to practice your sessions every day, unless you're sore or injured. [7] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source At a minimum, you should be practicing your sessions three to four times each week. Keep your breathing under control . Quick breaths will cause your muscles to tense up. Learning how to breathe properly while you stretch can help you manage your range of motion. Never use a bouncing motion while stretching. Bouncing does not increase flexibility and can even be dangerous because it puts too much stress on the joints. Bouncing may have value for activities that require very quick bursts of motion, like sprinting, but since a split requires a sustained stretch, this technique will not be helpful. Go slowly with your stretches. Don't try to stretch as far as you can right away. Ease into a stretch and repeat it several times to make sure your body is properly warmed up. Never push your body past its limits. While some level of discomfort might arise from a deep stretch, it shouldn't be painful. When a stretch hurts, you've gone far enough. Stop at this point to prevent injury."
    },
    {
      "title": "Do a butterfly stretch.",
      "content": "Do a butterfly stretch. This stretch is very useful at loosening up your groin and inner thigh muscles, which are crucial to executing a Chinese split. Sit on the floor with your back straight. [8] X Research source Bend your knees and bring the soles of your feet together in front of you. [9] X Research source Slowly pull your heels in towards your groin. Try to get your heels as close to you as you comfortably can, and keep your hands gripping your ankles. [10] X Research source Gently flex your knees down until they are touching the floor, or as close to the floor as you can comfortably get them. You can use your elbows to push your knees downward. [11] X Research source While exhaling, bend forward at the waist, and try to get your chest as close to the floor as possible. Hold the position for 20 seconds, then release it. [12] X Research source"
    },
    {
      "title": "Practice the Happy Baby pose.",
      "content": "Practice the Happy Baby pose. This yoga position will help you stretch and loosen the muscles in your groin, calves, and quads, all major muscle groups needed to do a Chinese split. Begin by lying flat on your back. As you exhale, pull your knees up towards your stomach. [13] X Research source While holding the outsides of each foot in your hands, open your knees just past the width of your abdomen, and pull your knees towards your armpits. [14] X Research source Try to keep your shins perpendicular to the floor. Hold the position for as long as you comfortably can (around 10 to 30 seconds should be sufficient), then release the pose. [15] X Research source"
    },
    {
      "title": "Do a wide-angle seated forward bend.",
      "content": "Do a wide-angle seated forward bend. This yoga pose might be one of the best stretches to prepare your body for doing Chinese splits. Take it slow, though, as this position may be strenuous for first-time practitioners. Since the groin is a sensitive area, you want to carefully stretch it. Begin by entering a staff pose. Sit on the floor with your back straight and your legs fully extended in front of you, with the insides of your feet touching. [16] X Research source Spread both legs outward. Try to form both legs into 90 degree angles with your hips. Slide your bottom slightly forward while keeping your legs spread to help push your legs as wide as you can comfortably spread them. [17] X Research source While keeping your knee caps pointed upward, stretch your hands forward between your legs as far as you can go without bending at the waist. [18] X Research source Hold the pose for around one minute, or as long as you comfortably can. Then release the pose. [19] X Research source"
    },
    {
      "title": "Do a standing quad stretch.",
      "content": "Do a standing quad stretch. The quads are the large muscles that make up the front of your thigh. They aren't the main muscle that works during the Chinese split, but if they're too tight it will impede the stretch. The easiest way to stretch your quads is by doing a standing stretch. Stand up straight. If you're a beginner or have trouble with balance, stand in front of a wall and place one hand on it for support. Lift one foot up behind you, grabbing it with your free hand. Pull it up until you feel a good stretch in your thigh. Hold the position for 10 to 30 seconds, or as long as you can comfortably hold it. Repeat this motion for the other leg."
    },
    {
      "title": "Practice the crescent lunge stretch.",
      "content": "Practice the crescent lunge stretch. This position is a common yoga pose, and it can help stretch your quads and build strength as you work towards doing a Chinese split. Start in a downward facing dog position, with your hands and feet (or at least the balls of your feet) firmly planted on the floor. [20] X Research source While breathing out, bring your right foot forward between your hands. [21] X Research source While breathing in, straighten your torso into an upright position while lifting your arms over your head. You should be kneeling on your left knee with your arms and torso vertically straight. [22] X Research source Hold the pose for as long as you comfortably can, then return to downward facing dog. Repeat the pose on your right side. [23] X Research source"
    },
    {
      "title": "Practice the Reclining Hero pose",
      "content": "Practice the Reclining Hero pose . This pose is not for novice yoga practitioners, but if you've mastered the Virasana pose, you should be able to work toward a Reclining Hero pose. This position will help stretch your quad muscles even further. Start by entering the Hero pose. Kneel on the floor with your knees touching slightly and the tops of your feet flat against the floor. Slowly slide your feet apart until they extend out past your hips. [24] X Research source Lean back, first on your hands, and gradually stretching back so that your forearms and elbows are touching the floor behind you. [25] X Research source Slowly lower your back towards the floor behind you. If you cannot stretch backwards to the floor (which will take a lot of time and practice), you can stack cushions behind you to lay your back against. [26] X Research source Try to hold the pose for 30 to 60 seconds, or as long as you comfortably can. [27] X Research source"
    },
    {
      "title": "Do a seated calf stretch.",
      "content": "Do a seated calf stretch. Your calf muscles make up the back of your lower leg. They are important to doing a split because they're attached to the hamstrings, and if the calves are tight they'll inhibit the hamstrings' stretching ability. Sit on the floor with your right leg extended in front of you. [28] X Research source Bend your right knee slightly and grab the ball of your foot with both hands. [29] X Research source Slowly pull back at the ball of your foot as far as you can. [30] X Research source Hold the position for about 20 seconds, then release the pose. Repeat for your left leg. [31] X Research source"
    },
    {
      "title": "Practice a seated hamstring stretch.",
      "content": "Practice a seated hamstring stretch. The hamstring is attached to your calf muscles, and is an important component in performing a Chinese split. Sit on the floor with your right leg extended in front of you. [32] X Research source Grab your right heel with both hands and slowly straighten your leg straight ahead of you. [33] X Research source Bend forward while exhaling, slowly bring your chest as close to your right knee as you can. Keep your leg extended straight ahead so that you feel the tension in the back of your leg. [34] X Research source Hold the stretch for about 20 seconds, then release the pose. Repeat for your left leg. [35] X Research source"
    },
    {
      "title": "Try a kneeling hamstring stretch.",
      "content": "Try a kneeling hamstring stretch. This stretch will build off of the previous two stretches, helping you get your calves and hamstrings as flexible as possible. Kneel on your left knee with your right leg straight ahead of you. Keep your right heel on the ground and the toes on your right foot pointed straight upward. With your back as straight as possible, reach toward your toes, or as close to your toes as you can reach. Hold the stretch for around 20 seconds, or as long as you comfortably can. Then release the pose, and repeat for your left leg."
    },
    {
      "title": "Commit to a strength-building regimen.",
      "content": "Commit to a strength-building regimen. Contrary to popular belief, strength is very important for flexibility. Stretching pushes your muscles hard, and weak muscles could hyper-extend or tear. Make sure to strengthen your muscles before attempting a Chinese split. [36] X Research source Unlike stretching, working out the muscles shouldn't be done every day. Your body needs recovery time after working out. Aim to do these workouts three to four days a week, with rests in between."
    },
    {
      "title": "Perform a wide leg squat.",
      "content": "Perform a wide leg squat. Squats work out the entire leg, so performing these will help boost your leg strength. They are performed slightly different than traditional squats, so be sure to use the proper technique to get the best results. Start with your legs slightly greater than shoulder width apart and your toes pointed out at a 45 degree angle. Bend your knees and squat down. Keep your back straight and make sure your knees don't go past your toes. Aim to get your thighs and shins to form a 90 degree angle. Don't go further than that or you could hurt your knees. Do two sets of 20 repetitions. When you get used to this motion and build some strength, you can hold dumbbells in each hand. Start with light weights and then gradually increase them."
    },
    {
      "title": "Perform deep lunges.",
      "content": "Perform deep lunges. Deep lunges are performed slightly different from traditional lunges. They involve a quick jump and a switch of your feet. This action both stretches and works out your entire leg. Start out performing a traditional lunge. Put your right foot forward with your left leg behind you. While lunging forward, twist your upper body to the right, toward your knee. Try to get your left elbow past your right thigh. Switch sides, lunging with your left foot forward and your right leg behind you. Change things up by twisting your upper body away from your knee. Do ten repetitions on each side twisting towards your knee, and ten repetitions on each side twisting away from your knee."
    },
    {
      "title": "Do side lunges.",
      "content": "Do side lunges. Side lunges help strengthen your legs and also help stretch out the main muscles that perform the Chinese split. Include them in your workout regimen to train your legs for a Chinese split. [37] X Research source Start by standing with your knees and feet together, and your knees slightly bent. Take a wide step to the right. Keep your toes pointed forward and lean into the stretch until your left leg is straight out to your side. Place your hands on the back of a chair to help yourself balance. Return to your starting position. Then perform the same motion leaning to the left, with your right leg straightened outward. Repeat the process, doing ten repetitions on each side."
    }
  ]
}