{
  "url": "https://www.wikihow.com/Do-Faux-Locs",
  "title": "How to Do Faux Locs",
  "steps": [
    {
      "title": "Take a thin section of hair, and apply moisturizer to it.",
      "content": "Take a thin section of hair, and apply moisturizer to it. Use the handle of a rat-tail comb to take a 1 to 2-inch (2.54 to 5,08-centimeter) square-shaped section of hair from your hairline. Lightly mist the section with water, then apply a moisturizing hair cream to it. [1] X Research source A combination of castor oil and coconut or olive oil would work especially well for this. You can also use any other cream you'd normally use for making corn rows."
    },
    {
      "title": "Place a thick strand of braiding hair behind it.",
      "content": "Place a thick strand of braiding hair behind it. Purchase some braiding hair or Marley hair. Select a thick strand, find the center, then place it behind the section of natural hair. You will have three strands of hair: a left synthetic strand, a center natural strand, and a right synthetic strand. [2] X Research source Make sure that the hair you are using is synthetic."
    },
    {
      "title": "Braid the two together.",
      "content": "Braid the two together. Cross the left strand over the middle one, then cross the right strand over the middle one. Keep braiding, making the stitches nice and right, until you run out of natural hair to braid. You will be left with two strands of synthetic braiding hair. [3] X Research source"
    },
    {
      "title": "Finish off with a rope braid for a few inches.",
      "content": "Finish off with a rope braid for a few inches. Twist each strand of synthetic hair clockwise form two ropes. Next, twist the two ropes together counterclockwise to form a thicker rope. Do this for a few stitches, then stop. [4] X Research source If the hair is very slippery and does not have a lot of texture to it, it may unravel during the next step. Secure it with a small hair elastic."
    },
    {
      "title": "Add a new strand of synthetic hair to the top of your braided hair.",
      "content": "Add a new strand of synthetic hair to the top of your braided hair. Hold the first 1½ inches (1.91 centimeters) of the synthetic strand against your braid. Make sure that the tip of the synthetic hair is pointing down towards the end of the braid, and not up towards your scalp. [5] X Research source Secure the strand with a small hair elastic, if needed."
    },
    {
      "title": "Wrap the synthetic strand around the braid.",
      "content": "Wrap the synthetic strand around the braid. Hold the 1½-inch (1.91-centimeter) tip of the synthetic strand against your braid with one hand. Use your other hand to wrap the rest of the strand around braid and tip tightly. Start at your root, and continue downwards until you run out of hair to wrap. [6] X Research source Overlap the hair slightly as you wrap so that you have no gaps."
    },
    {
      "title": "Add more synthetic strands using the same technique.",
      "content": "Add more synthetic strands using the same technique. Hold the first 1½ inches (1.91 centimeters) of the new strand against the rest of your hair section. Secure it with a small hair elastic, if needed, then wrap the rest of the strand downward. Keep doing this until your faux loc is the length you want it to be. [7] X Research source"
    },
    {
      "title": "Trim off the excess hair.",
      "content": "Trim off the excess hair. Hold the synthetic hair you were wrapping with away from the core. Trim the excess hair from the bottom of the core with a pair of scissors. Do not cut the hair you were wrapping with just yet. The \"core\" is the first strand of synthetic hair that you braided into your hair at the very begging."
    },
    {
      "title": "Finish wrapping the synthetic hair, then trim it off with a razor comb.",
      "content": "Finish wrapping the synthetic hair, then trim it off with a razor comb. Wrap the synthetic hair downwards until it covers the core hair completely. Trim it off using a razor comb, then wrap it back upwards until you have nothing left to wrap with. [8] X Research source You don't have to use a razor comb, but it will give you a nicer finish."
    },
    {
      "title": "Seal the hair with a lighter.",
      "content": "Seal the hair with a lighter. Turn on a lighter and pass it up and down the length of your faux loc. If using fire around your faux hair makes you nervous, use a drop of nail glue instead. [9] X Research source"
    },
    {
      "title": "Repeat the process for the rest of your hair.",
      "content": "Repeat the process for the rest of your hair. This process can take a while, so it would be a good idea to get some help or take lots of breaks. Work your way in sections, row by row, until you are done."
    },
    {
      "title": "Start with freshly washed, braided hair.",
      "content": "Start with freshly washed, braided hair. Wash and condition you hair. Section it off into 1 to 2-inch (2.54 to 5,08-centimeter) square-shaped sections using the handle of a rat-tail comb. Mist each section with water, then apply a moisturizing hair cream to it. Braid each section of hair. [10] X Research source A simple mixture of castor oil and coconut or oil will work just fine for this. You can also use your favorite braiding cream instead."
    },
    {
      "title": "Pick a braid to start with, then add some braiding hair to it.",
      "content": "Pick a braid to start with, then add some braiding hair to it. Buy some braiding hair that has a water wave texture. Select a thin strand, find the middle, then hold it behind your first braid, about 1 inch (2.54 centimeters) above the root. [11] X Research source"
    },
    {
      "title": "Braid the two together.",
      "content": "Braid the two together. You should have three strands: a left synthetic strand, your natural braid, then a right synthetic strand. Braid these strands together until you reach the end of your natural braid. [12] X Research source"
    },
    {
      "title": "Finish off with a regular braid for a few inches/centimeters.",
      "content": "Finish off with a regular braid for a few inches/centimeters. Split the synthetic hair into three sections, then braid them together for about 1 to 2 inches (2.54 to 5.08 centimeters). You can also simply twist the two strands into a rope braid instead. [13] X Research source"
    },
    {
      "title": "Pull a faux loc through the base of your braid.",
      "content": "Pull a faux loc through the base of your braid. Buy a package of pre-made faux locs. Slide a crochet hook or a latch hook through the base of your braid, close to the root. Catch the top of the faux loc, then pull it back through the braid to form a 1-inch (2.54-centimeter) long loop. [14] X Research source Pre-made faux locs are strands of synthetic hair coiled into a tube. Choose faux locs that match the color of your braiding hair."
    },
    {
      "title": "Pull the rest of the faux loc through the loop.",
      "content": "Pull the rest of the faux loc through the loop. Give the loop a slight twist first, then slide the hook under the braid. Use the hook to catch the rest of the faux loc. Hold the loop with your fingers, then slide the faux loc through the loop. Gently tug on the loc to tighten the knot. [15] X Research source"
    },
    {
      "title": "Wrap the faux loc around the braid.",
      "content": "Wrap the faux loc around the braid. Unravel the top of the faux loc a little. Wrap it around the braid, letting it coil back into its natural shape. Do this for 1 to 2 inches (2.54 to 5.08 centimeters), then stop. [16] X Research source"
    },
    {
      "title": "Push the hook up through the faux loc.",
      "content": "Push the hook up through the faux loc. Find the bottom of your faux loc. Slid the tip of the crochet or latch hook up through the loc until it comes out the top. Scrunch the loc down the hook as needed to get it all to fit. [17] X Research source"
    },
    {
      "title": "Catch the braiding hair with your hook.",
      "content": "Catch the braiding hair with your hook. Do not catch the braided part that includes your natural hair. Instead, catch the part that only contains the synthetic braiding hair. [18] X Research source"
    },
    {
      "title": "Slide the braiding hair down through the faux loc.",
      "content": "Slide the braiding hair down through the faux loc. Gently tug down on the hook, pulling the braiding hair and the braid down through the faux look. Slip the hook off of the hair. If there are any loops of braiding hair sticking out the side of your loc, tug downward on the braiding hair. Slide the faux loc up and down the braiding hair as needed to adjust the look. [19] X Research source The faux loc won't cover all of the braiding hair, but blend into it."
    },
    {
      "title": "Repeat the process for the rest of your hair.",
      "content": "Repeat the process for the rest of your hair. Since your hair is already all braided, all you have to do is add faux locs to it. It would be easier, however, if you start from the bottom of your head, and work your way upwards."
    }
  ]
}