{
  "url": "https://www.wikihow.com/Deal-With-Sexual-Harassment-in-School",
  "title": "How to Deal With Sexual Harassment in School",
  "steps": [
    {
      "title": "Tell an adult.",
      "content": "Tell an adult. It’s important that you let an adult know what is going on right away. Speak to an adult that you trust about what has happened and what should be done to stop it from continuing. [1] X Research source If you aren’t sure who to talk to, consider speaking to a parent, teacher or your coach. If you are being sexually harassed by an adult at the school, it is extremely important that you let an adult know right away. Some schools have people appointed to anti-bullying roles. If your school has one, that person could be a great person to seek guidance from."
    },
    {
      "title": "Tell them to stop.",
      "content": "Tell them to stop. Although it’s not always the case, there are times when the harasser may not realize that what they are doing or saying is making you uncomfortable. Begin by telling the person that what they are doing is inappropriate and that you want them to stop. [2] X Research source Sometimes simply saying to stop will be enough and the harasser will leave you alone or cease their inappropriate behavior. Make sure that you make it perfectly clear. Don’t allow the harasser to interpret your statement as anything but what it is: time for them to change their behavior. Try saying something like, \"What you are saying or doing makes me uncomfortable. Please stop right now.\" If that does not work, use the word harassment in your statement to them: \"Stop harassing me. I am going to get a teacher right now.\" Do not lose your temper or escalate the situation to violence. [3] X Research source"
    },
    {
      "title": "Don’t blame yourself.",
      "content": "Don’t blame yourself. People who sexually harass or bully others can sometimes be extremely manipulative. They may try to make you feel as though you are the one in the wrong for rejecting their advances or telling them to stop. Don’t be fooled; they have no right to make you uncomfortable in such a manner. [4] X Research source No one has the right to sexually harass another person, regardless of their age, position, or level of authority. There is no such thing as “asking for it.”"
    },
    {
      "title": "Keep a record of what happens.",
      "content": "Keep a record of what happens. If your harasser does not stop after you've clearly told them to, you should begin writing down what happens each time you interact with him or her. This record can help you while reporting the harassment. [5] X Research source Save any offensive notes, messages, texts or e-mails that you receive from the harasser as evidence of their inappropriate behavior. Keep the evidence someplace you don’t have to see unless you want to if it makes you upset to look at."
    },
    {
      "title": "Tell your parents.",
      "content": "Tell your parents. Before you decide to file a complaint with your school, let your parents know what is going on. The school will likely contact your parents after speaking with you and your parents will want to know what is going on. Listen to your parent’s guidance about the situation. Ask them if they will help you speak to your teacher or other authority figure if you’re uncomfortable doing it alone."
    },
    {
      "title": "Speak to a teacher.",
      "content": "Speak to a teacher. Speaking to a teacher is often the first step to reporting sexual harassment in a school environment. If it is your teacher harassing you, speak to a teacher you trust, your guidance counselor, or the principal. [6] X Research source If you have been keeping a record of the harassment, bring that with you when you go to speak to the teacher. Make sure you explain what you have already done to prevent the harassment from continuing."
    },
    {
      "title": "Ask for a copy of the school’s sexual harassment policy.",
      "content": "Ask for a copy of the school’s sexual harassment policy. Each school is required to maintain a sexual harassment policy that dictates how they address complaints such as yours. Most schools also have an appointed official responsible for addressing such situations. Ask to speak to the appointed official if there is one; he or she can provide you with information, answer your questions, and help you move forward with the complaint. Read the policy completely to make sure you have a thorough understanding of what the school’s policy considers to be sexual harassment."
    },
    {
      "title": "File a complaint with the Department of Education.",
      "content": "File a complaint with the Department of Education. It is very likely that your teachers and the school’s administration will be able to resolve your sexual harassment issue for you, but in the event the school fails to take your claims seriously, you may need to escalate your complaint to the Department of Education to seek help. Contact the U.S. Department of Education’s Office of Civil Rights (OCR) by phone or on their webpage: http://www.ed.gov/about/offices/list/ocr/complaintintro.html . Complaints generally need to be received within 180 days of the harassment incident to be investigated by the Department of Education."
    },
    {
      "title": "Differentiate between harassment and other social circumstances.",
      "content": "Differentiate between harassment and other social circumstances. While some interactions with people at school may make you uncomfortable inherently, these situations may not be considered harassment unless they cross the line into being inappropriate. [7] X Research source Another student asking you on a date or to a dance more than once may not be harassment if the person is unaware that they are making you uncomfortable. If the person becomes forceful, however, that may be harassment. Someone complimenting your appearance may not be harassment if they are simply being polite. Saying you “look great in your new jeans,” may not be considered harassment, but if the conversation turns sexual in any way, it could be."
    },
    {
      "title": "Recognize the forms of sexual harassment.",
      "content": "Recognize the forms of sexual harassment. Sexual harassment can come in many forms and is not always easily defined. What is considered appropriate and inappropriate is hard to delineate for all people at all times, but harassment can take on any of the following forms: Verbal harassment is made up of comments about your body, making sexual remarks, or speaking in a generally inappropriate and sexual manner. This could include making any comments about body parts that are generally covered by a swimsuit (even if the comments are ostensibly positive), pressuring a student to make negative or demeaning comments to someone or something else in exchange for companionship or a better reputation, or offering companionship or sexual favors in exchange for helping someone else do something immoral such as cheating on a test. Physical harassment is any time someone makes contact with your body in a sexual and unwelcome manner. This includes physical contact of any kind that continues after the other student requests that it stop. Visual harassment involves obscene gestures, exposure to inappropriate pictures or sexual objects. This could include photographing another student who is urinating or changing clothes, performing a sexual act such as masturbation in full view of other students, or deliberately fouling up a toilet or toilet area for the purpose of intimidating those who need to use it."
    },
    {
      "title": "Identify who can be victims and who can be harassers.",
      "content": "Identify who can be victims and who can be harassers. Sexual harassment does not have to be across genders or have anything to do with sexual advances. Anyone can be a victim of sexual harassment and anyone can be a harasser if they behave in a sexually inappropriate manner. Calling someone names like “slut” or “whore” is sexual harassment regardless of the gender of the person doing the name calling. Harassing someone because they do not conform to social gender norms is sexual harassment. Mocking someone for developing or maturing at a different rate than their peers is sexual harassment."
    }
  ]
}