{
  "url": "https://www.wikihow.com/Get-Along-with-Others-Well",
  "title": "How to Get Along with Others Well",
  "steps": [
    {
      "title": "Be a good listener.",
      "content": "Be a good listener. To start a conversation, it is important to listen first, especially when you are in a group. Don’t indulge yourself in instant chat when you have just arrived. First, examine the situation and the conversation, then say whatever you deem fit. It is better to say something substantial, rather than engage in meaningless banter. So it is better to listen to what the conversation is about before speaking. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source To learn more about other people, try asking open-ended questions, like \"What do you think about this class?\" or \"How did you learn to play guitar so well?\" Then, really listen to the answer so you can build on the conversation. [2] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 26 April 2021."
    },
    {
      "title": "Don't try to change people.",
      "content": "Don't try to change people. It is not your job or in your power to change anyone else. You can only change how you interact with people. You cannot change them. If you do not like how someone acts, you can arrange things so that you interact with them as little as possible. [3] X Research source"
    },
    {
      "title": "Keep your sense of humor.",
      "content": "Keep your sense of humor. A little laughter goes a long way, and a smile eases tensions, whereas a frown can create tension. If someone teases you, try to laugh it off. If someone is frowning, smile at them. Be mindful of your countenance (facial expression). If you are persistently cheerful and optimistic, people will cheer up when they see you coming. [4] X Research source"
    },
    {
      "title": "State outright that you want to get along.",
      "content": "State outright that you want to get along. Some people do not take hints. Some people do not read body language. For these people, it really works to just say with a cheerful face and voice, \"I really want us to work well together, and I want to back you up and help you.\""
    },
    {
      "title": "Radiate positivity.",
      "content": "Radiate positivity. How you project your feelings affects the people within your proximity. It can have a ripple effect on the people around you. Therefore, it would be advisable to remain thoughtful of how you conduct yourself and deal with others around you. In other words, do not allow yourself to take out your negative emotions on others. [5] X Research source"
    },
    {
      "title": "Give genuine compliments.",
      "content": "Give genuine compliments. People love compliments, especially when they are genuine. Don't be so proud as to never congratulate someone on their work or ideas. A good compliment is sincere and succinct. No one likes a brown-noser or a suck-up, but no one likes people who seem better than everyone else either. [6] X Research source Aim for one good compliment per conversation as a good benchmark."
    },
    {
      "title": "Do things for others.",
      "content": "Do things for others. Being kind is its own reward. It could be as simple as bringing in doughnuts for people or offering to help someone who is struggling to carry something. This will show you care about other people and this will make people want to be around you."
    },
    {
      "title": "Know that good manners and polite demeanor can help you get along with anyone.",
      "content": "Know that good manners and polite demeanor can help you get along with anyone. Think of your manners as the coat of paint on your personality-- if you keep it clean and pleasant, it leaves a wonderful first impression when you meet someone."
    },
    {
      "title": "Make eye contact and smile when talking to someone.",
      "content": "Make eye contact and smile when talking to someone. This tells them that you are interested in what they have to say and want to be comfortable around them. When meeting someone for the first time, make good eye contact and shake their hand firmly as you introduce yourself."
    },
    {
      "title": "Always smile; that way people won’t think you are serious and hard to get along with.",
      "content": "Always smile; that way people won’t think you are serious and hard to get along with."
    },
    {
      "title": "Be polite",
      "content": "Be polite and humble . If you are rude and arrogant, people will not like you."
    },
    {
      "title": "Treat others how you wish to be treated.",
      "content": "Treat others how you wish to be treated. The golden rule is still the most important rule for getting along with others. Think of how you would like your friends to act around you. If you treat people with love and respect, they will treat you with the same."
    },
    {
      "title": "Never say anything about someone you wouldn't say to them in person.",
      "content": "Never say anything about someone you wouldn't say to them in person. Gossip has a way of traveling around, and hearing that someone has been speaking ill of you behind your back is a sure-fire way to ruin a friendship. If you wouldn't say it to them in person, it is best not to say it at all."
    },
    {
      "title": "Speak in a clear, confident manner.",
      "content": "Speak in a clear, confident manner. Be confident. Talk loudly and clearly, speaking slowly enough to get your words out without mumbling. You don't need to yell, interject, or rush—take your time and make each word count."
    },
    {
      "title": "Understand that people make mistakes.",
      "content": "Understand that people make mistakes. Forgiveness is not only polite, it leads to stronger friendships. No one is perfect, so judging someone for a fault is not fair when you expect them to forgive your mistakes too. Be willing to accept an apology and try and think of things through someone else's perspective -- were they really trying to be hurtful, or did they make an honest mistake? [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Having the humility to give and accept forgiveness is a great way to show people that you are a reasonable, kind person."
    },
    {
      "title": "Discuss and negotiate with others when your opinions differ.",
      "content": "Discuss and negotiate with others when your opinions differ. You do not have to completely avoid contentious issues. However, it is important to refrain from yelling, judging, or blocking out people with whom you disagree. There are very few people who will agree with you on everything, so it important to learn how to have a civil, polite argument or debate. If people have challenges, offer them support."
    },
    {
      "title": "Avoid making quarrels personal.",
      "content": "Avoid making quarrels personal. While you can have a civil discussion about political differences, for example, saying that their view makes them \"a bad person\" is a perfect way to ruin a relationship."
    },
    {
      "title": "Look for common ground.",
      "content": "Look for common ground. While you might have different ideas on who should be president, try and bond over a common topic or hobby. Find discussion topics and activities that you can both enjoy instead of focusing on the things that divide you."
    },
    {
      "title": "Agree with them when appropriate.",
      "content": "Agree with them when appropriate. Even on contentious topics like religion or politics, there are likely to be a few things that you both can agree on. Don't be afraid to agree with someone when they make a good point -- this will make it easier to keep the conversation civil."
    }
  ]
}