{
  "url": "https://www.wikihow.com/Deal-With-a-Difficult-Co%E2%80%90worker",
  "title": "How to Deal with Difficult Coworkers: 14 Effective Strategies & Coping Tactics",
  "steps": [
    {
      "title": "The easiest way to avoid drama is simply to avoid them when you can.",
      "content": "The easiest way to avoid drama is simply to avoid them when you can. Stay away from difficult coworkers if you don't have to work with them directly. By limiting your interactions, you’ll also reduce the amount of frustration you feel when dealing with them. When you do need to speak with them, keep the discussion brief but pleasant. Be professional instead of giving the person the cold shoulder. [1] X Research source It’s important to be polite on the few occasions you speak to your coworker to maintain a positive and drama-free work environment."
    },
    {
      "title": "Instead of taking their behavior personally, ignore it and move on.",
      "content": "Instead of taking their behavior personally, ignore it and move on. Depending on the situation, it’s healthiest to let go of your anger when a colleague acts out. Their bad behavior isn’t your fault—and so long as it doesn’t interfere with your work, it’s not your problem, either. Letting difficult behavior slide right off your shoulders is often the easiest way to deal with it. [2] X Expert Source Meredith Walters, MBA Certified Career Coach Expert Interview. 22 November 2019. Consider the possibility that your coworker didn’t intend to upset you. They may not even realize they’ve done something you don’t like. You’re more than justified in confronting a coworker’s difficult behavior when they’re interfering with you and your work performance, but more often than not, it’s not personal."
    },
    {
      "title": "Combat a coworker’s negativity with your own optimistic perspective.",
      "content": "Combat a coworker’s negativity with your own optimistic perspective. Does your coworker seem to complain constantly? If you’re faced with a lot of negativity at work, build a positive attitude in response. Your coworker will get the hint when if you subtly change the topic or offer a contrasting positive point of view. Without someone to fuel their negativity, they’ll get bored and move on. [3] X Research source If they don’t get the hint, let them know how you feel about their negativity. Everyone has different ways of venting frustration, and they may not have any idea how their attitude affects you. Try not to complain unnecessarily yourself, either. It’s hard to get along with a whiny colleague, and sinking to your coworker’s level won’t make them stop."
    },
    {
      "title": "Take the high road and show this coworker that you’re more mature.",
      "content": "Take the high road and show this coworker that you’re more mature. If you’re dealing with jealous or overly competitive coworkers, getting them to work with you can be as simple as acknowledging the role they play on your team. Show respect to all of your coworkers , praise the whole team's achievements and show them that you value their input. You can be a role model of good workplace behavior! [4] X Research source"
    },
    {
      "title": "If your coworker is a know-it-all, asking for advice might appease them.",
      "content": "If your coworker is a know-it-all, asking for advice might appease them. Does your coworker act like they know everything and refuse to listen to your opinions? Instead of arguing, try acknowledging their ideas and asking them to explain further. When difficult coworkers feel like their ideas are seen and valued, they might be more open to your ideas and listen to you in turn. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Hotshot coworkers can be frustrating, but asking for their advice will show them that you’re willing to work with them and have a positive professional relationship."
    },
    {
      "title": "It’s easier to get out of stressful situations when you know your triggers.",
      "content": "It’s easier to get out of stressful situations when you know your triggers. What about your coworker do you find difficult? Reflect on your interactions with them to figure out exactly what rubbed you the wrong way. Then, when you see them start to act that way in the future, excuse yourself before they get under your skin. This way, you’ll be calmer and less stressed at work overall. [6] X Research source Try developing a few other coping mechanisms to help you deal with negative interactions, too. For example, you might practice deep breathing or meditation, or step away and take a walk or exercise when you feel upset."
    },
    {
      "title": "Understanding and empathizing with them makes it easier to get along.",
      "content": "Understanding and empathizing with them makes it easier to get along. As you learn about your coworker , you’ll also gain insight into why they behave the way they do. They might be overworked, going through a rough time, or dealing with an unreasonable customer. [7] X Expert Source Meredith Walters, MBA Certified Career Coach Expert Interview. 22 November 2019. You deserve to be treated respectfully regardless, but your relationship may improve when you can empathize with their situation. You might even realize that your coworker has insecurities about their own job performance or feels jealous of your success."
    },
    {
      "title": "Consider why you dislike this coworker to ensure you’re being fair.",
      "content": "Consider why you dislike this coworker to ensure you’re being fair. Are you upset because of things that this specific person has done, or are you holding a grudge because they remind you of someone else you don’t like? [8] X Expert Source Meredith Walters, MBA Certified Career Coach Expert Interview. 22 November 2019. It’s easy to get annoyed if someone brings up bad memories, but understanding your own feelings can help you let go of unnecessary anger. Don’t expect your coworker to work the same way you do, either. Consider what you expect them to do before assuming they're being difficult. You might find that your demands have been a little unrealistic."
    },
    {
      "title": "Getting an explanation for their actions may clarify the situation.",
      "content": "Getting an explanation for their actions may clarify the situation. If you're having a problem with a coworker who you really do need to work with, try talking to them privately about the issue. Communicate what the problem is, listen to their explanation and side of the story, and let them offer solutions for resolving the problem in addition to making suggestions of your own. [9] X Expert Source Meredith Walters, MBA Certified Career Coach Expert Interview. 22 November 2019. Reference the specific issue at hand instead of making it about your coworker as a person. For example, instead of saying, \"Get your act together, or we're going to miss our deadline,\" say, \"I'd like to talk to you about what we can do to get that project you're working on finished sooner.\" Getting an explanation might even reveal that your coworker has personal issues you don’t know about. You might find that you understand them better after talking."
    },
    {
      "title": "They may change their behavior if you explain how it affects you.",
      "content": "They may change their behavior if you explain how it affects you. If your coworker’s behavior is adversely affecting you, share your thoughts using “I” language to help them understand your position. Statements beginning with “you” sound more accusatory and might actually escalate the problem, whereas “I” statements keep things focused on your feelings rather than your coworker. [10] X Research source For example, you might say, “I find it hard to focus when there’s a lot of background noise,” instead of, “You’re being irritating, and you need to quiet down.” Similarly, say, \"I work best when I know about a presentation two days in advance. Can you try to let me know in the future?\" instead of, \"You never give me enough time to prepare for presentations.” Don't take offense if your coworker offers you some constructive criticism in return. Do your best to learn from it, assuming it’s reasonable."
    },
    {
      "title": "Steer clear of office gossip",
      "content": "Steer clear of office gossip to create a positive work environment. It may be tempting to spread gossip about the coworker you don't like, but it’s always best not to get involved. If another coworker is spreading gossip, just walk away or tell them that you're not interested in hearing about it. You could also simply bring up a new topic and redirect the conversation to something not so negative. [11] X Research source When speaking to a known gossip, avoid discussing anything not directly related to work. You can always use professionalism as an excuse to avoid being rude! You could say, “I’m sorry, but I generally try not to talk about non-work issues while in the office.”"
    },
    {
      "title": "The best parts of your job will distract you from your coworker's issues.",
      "content": "The best parts of your job will distract you from your coworker's issues. When you have to deal with a difficult coworker day in and day out, it’s easy to feel burned out from stress. To combat this, remember all the reasons you enjoy your job! Spend time building friendships with other coworkers; the more you have to look forward to, the easier dealing with your problem coworker will be. [12] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "It’s important to remember that there are just some people you won’t like.",
      "content": "It’s important to remember that there are just some people you won’t like. It's great to be friendly with your coworkers, and you should always try to be nice to everyone at work, but that doesn't mean that every coworker will be your best friend. If your coworker isn’t doing anything wrong, but you just don't vibe with their personality, simply accept that and don’t let your differences bother you. [13] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source Look for ways to tolerate one another enough to work together effectively. You don’t need to be best friends to do good work together!"
    },
    {
      "title": "Escalate the issue if your coworker’s behavior violates company policy.",
      "content": "Escalate the issue if your coworker’s behavior violates company policy. In some cases, the best thing to do is tell a superior (such as a manager or your company's HR department) about your coworker's behavior. That way, they can deal with the employee according to company policy. Before reporting them, take a moment to consider whether the situation is worth reporting to avoid unnecessary conflict. [14] X Research source Document your grievances, so you have evidence if you escalate the issue to a supervisor. If possible, keep a log of their behavior, along with hard evidence like emails and messages. Besides breaking company rules, if the coworker’s behavior is actively impacting your performance or making you feel unsafe, it may be worth reporting them. The appropriateness of this option will depend upon the unique situation and your office culture. Use your best judgment!"
    }
  ]
}