{
  "url": "https://www.wikihow.com/Draw-a-Skull",
  "title": "How to Draw a Skull",
  "steps": [
    {
      "title": "Make a circle.",
      "content": "Make a circle. Press lightly with your pencil to make a faint circle . Sketch the circle so it's as wide as you'd like the whole skull to be. You'll use this outline to make the top portion of the skull. [1] X Research source If you're struggling to draw a circle, use a compass or trace a round object that's as large as you want the skull to be."
    },
    {
      "title": "Draw a straight horizontal and vertical line through the center of the circle.",
      "content": "Draw a straight horizontal and vertical line through the center of the circle. To make guidelines for placing features, lay a ruler on your paper so it passes through the middle of the circle. Make a straight horizontal line and then turn the ruler to make a vertical line. [2] X Research source Make the vertical line extend below the circle so you can use it to draw the jaw."
    },
    {
      "title": "Create 2 hexagons along the bottom of the horizontal line.",
      "content": "Create 2 hexagons along the bottom of the horizontal line. Draw an eye socket in both of the bottom quarters of the circle. Make the top line of each hexagon along the horizontal guideline and sketch each hexagon large enough to fill half of each quarter. [3] X Research source Leave a space that's 1/5 the width of the circle between the hexagons."
    },
    {
      "title": "Sketch the nose cavity along the vertical guideline.",
      "content": "Sketch the nose cavity along the vertical guideline. Make a short horizontal line on the vertical guideline so it's halfway down the eye sockets. Draw a straight line that comes down from each end and away from the center of the circle. When your pencil is close to the bottom of the circle, bring the 2 lines together in a point at the very bottom of the circle on the vertical line. [4] X Research source The nose cavity is diamond-shaped near the bottom, but boxier near the top."
    },
    {
      "title": "Draw the angular outline of the sides and middle of the skull.",
      "content": "Draw the angular outline of the sides and middle of the skull. Lightly sketch from the temples towards the eye socket so the skull bulges out a little. Curve the line back towards the center of the skull before making it curve away at the level of the nose cavity. Then, draw a straight line down at an angle below the nose cavity. Make this line go across horizontally to connect to the opposite side of the skull. [5] X Research source Repeat this on the opposite side so it connects with the line you just drew. Draw the horizontal line of the middle of the skull so it's about twice the width of the nose cavity."
    },
    {
      "title": "Make the upper teeth along the horizontal line in the middle of the skull.",
      "content": "Make the upper teeth along the horizontal line in the middle of the skull. Draw vertical ovals that extend below the line to make the teeth. Each tooth should be about 1/2 the size of the distance between the bottom of the nasal cavity and line for teeth. Sketch 3 full-size teeth to the right and the left of the vertical guideline. Then, draw 2 smaller ovals that at both ends to show teeth that are receding. [6] X Research source Draw the teeth as rounded or square as you like. Consider using a reference photo to help you draw anatomically since people's teeth are quite unique. If you want the skull to be missing a few teeth, leave some of them out as you draw."
    },
    {
      "title": "Draw the outline of the jaw.",
      "content": "Draw the outline of the jaw. Measure the distance from the top of the skull to the point where the horizontal and vertical guidelines meet. Draw a horizontal line that's the same distance from the bottom of the nose cavity to the bottom of jaw. Sketch the line so it's about half the length of the teeth and draw a straight line at each end that angles up and away from the center. Then, draw a straight line that connects the bottom of the jaw to each side of the skull. [7] X Research source Make both of the straight lines at an angle the same length as the horizontal line in the center of the jaw."
    },
    {
      "title": "Sketch the lower teeth along the jaw.",
      "content": "Sketch the lower teeth along the jaw. Make the teeth about the same size as the upper teeth and draw the teeth in the front larger than the ones on the sides. Draw 4 or 5 teeth on each side of the vertical guideline and make 1 or 2 small teeth off to the sides. [8] X Research source To give the skull some perspective, you can draw a small gap at each end of the line of teeth. This shows space between the skull and the jaw."
    },
    {
      "title": "Fill in the nasal and eye cavities.",
      "content": "Fill in the nasal and eye cavities. Use a darker pencil or press firmly to shade in each eye socket and the nasal cavity. Since these are deep and empty, make them darker than other parts of the skull that you'll be shading. [9] X Research source If you want the cavities to be smooth, go back with a blending stump to rub the graphite. To make the teeth stand out, go over the lines between the teeth and the skull and jaw again."
    },
    {
      "title": "Erase unnecessary guidelines.",
      "content": "Erase unnecessary guidelines. Before you start shading in the skull, take an eraser and remove the horizontal and vertical guidelines that are still visible. Lightly erase the lines for the circle as well. Take care to not erase the actual drawing when you're removing the guidelines."
    },
    {
      "title": "Shade in the skull to show depth.",
      "content": "Shade in the skull to show depth. Lightly cross-hatch or shade in the space above the eye cavities where the brow would be. Keep going over the spaces until they appear deeper-set than the rest of the skull. Other areas to shade include: [10] X Research source The top sides of the skull Along the jawline To the sides of the nasal cavity"
    },
    {
      "title": "Draw a circle that's slightly longer at the ends.",
      "content": "Draw a circle that's slightly longer at the ends. Instead of making an oval with narrow ends, sketch a circle that's as big as you want the skull to be. Make the circle a little longer than it is wide, but don't make the ends taper. [11] X Research source"
    },
    {
      "title": "Sketch a concentric circle and make guidelines through the skull.",
      "content": "Sketch a concentric circle and make guidelines through the skull. Lightly draw another circle inside the one you just drew. Make this circle 1/4 the distance from the larger circle. Then, draw a horizontal line through the center of the skull and make a vertical line that also passes through the middle. To help you draw the jaw, put your pencil on the vertical line where it touches the bottom of the smaller circle. Draw a straight horizontal line to 1 side of the skull. [12] X Research source Draw lightly so you can erase the guidelines later."
    },
    {
      "title": "Create the outline of the jaw to 1 side of the skull.",
      "content": "Create the outline of the jaw to 1 side of the skull. Sketch a faint vertical line coming straight down from the side of the skull where you're positioning the jaw. Put your pencil where the jaw's vertical guideline meets the horizontal line you just drew. Create a curved line that extends away from the skull and down towards the bottom of the jaw. Once this line is the same length as half of the skull's width, make it into a straight line that angles back up towards the skull. [13] X Research source Make the outline of the jaw stop at the smaller concentric circle where it meets the vertical guideline."
    },
    {
      "title": "Draw the nose cavity and where the brow sticks out.",
      "content": "Draw the nose cavity and where the brow sticks out. Place your pencil on the top of the jawline where it sticks away from the skull. As you draw up towards where the nose would be, make the line curve in towards where the bottom horizontal guideline meets the vertical guideline of the jaw. Then, draw the line back up at an angle and make it bump out a little. [14] X Research source The top bump is the brow before it reconnects to the skull."
    },
    {
      "title": "Sketch the eyesocket and shade it in.",
      "content": "Sketch the eyesocket and shade it in. Draw a vertical crescent shape just behind and below the brow. Extend the crescent until it's halfway down the length of the nose cavity. Then, shade in the eye socket so it looks empty and deep. [15] X Research source"
    },
    {
      "title": "Draw a jagged line at the bottom of the skull where it meets the jawline.",
      "content": "Draw a jagged line at the bottom of the skull where it meets the jawline. Sketch a line coming down below the eye socket and bring it up towards the center of the skull. Keep drawing the line in a horizontal direction that zigs and zags a little until it reaches the center jawline. Then, make the jagged line bend down so it connects to the curve of the skull. [16] X Research source This creates the bottom of the skull itself."
    },
    {
      "title": "Make the upper and lower rows of teeth.",
      "content": "Make the upper and lower rows of teeth. Draw an elongated S-shape down the middle of the jaw and make 2 faint horizontal lines that go from the side of the jaw to the shape. Leave a gap between the lines that's big enough to fit the teeth. Then, draw 6 or 7 teeth along each horizontal line. Make the teeth that are closest to the S-shape about the same width as the eye socket. Sketch the teeth at the other end of the row progressively smaller until they're only slivers at the end. [17] X Research source"
    },
    {
      "title": "Erase visible guidelines.",
      "content": "Erase visible guidelines. To make your drawing look finished, use a small eraser and remove the horizontal and vertical guidelines that you can still see. If you've already drawn over them, leave them. Just erase the ones that stand out. [18] X Research source Instead of using a large eraser, try working with the eraser on the end of a pencil."
    },
    {
      "title": "Shade in parts of the skull where you want to show depth.",
      "content": "Shade in parts of the skull where you want to show depth. Press firmly as you sketch along the back of the skull to show its curve. Then, shade in the center of the skull behind the eye socket. Make this a large crescent shape and use cross-hatching to make the skull appear bumpy. [19] X Research source Make the jaw look distinctive by shading the top of it where it meets the bottom of the skull."
    }
  ]
}