{
  "url": "https://www.wikihow.com/Develop-Personality",
  "title": "How to Develop Personality",
  "steps": [
    {
      "title": "Write down five personalities traits about yourself.",
      "content": "Write down five personalities traits about yourself. Think about at least five or more personality traits that you have. Write them down, and take a few sentences to describe why you think this personality trait applies to you. Make sure at least one of them is a positive, good personality trait that you see in yourself. Also, list one personality trait that is negative or bothering you in some way. Don't use your physical appearance as a way to describe yourself. Focus only on your personality."
    },
    {
      "title": "Evaluate the positive and negative.",
      "content": "Evaluate the positive and negative. When you wrote down these personality traits, did you seem to focus on mostly positive or mostly negative traits? For example, did you have four negative traits, and only one good one? Understand if you are only seeing the negative in yourself. You may feel like you're not worthy or don't believe in yourself. Find ways to boost your self-esteem. If you only mentioned one negative trait, you may have greater confidence in yourself, but lack insight into what needs improvement. Consider healthily evaluating your limits and finding more humility ."
    },
    {
      "title": "Identify activities you enjoy.",
      "content": "Identify activities you enjoy. If you are not sure about how to develop your personality, think about what makes you happy. What activities do you enjoy? Do you like spending time with others, or do more things alone? Do you like fixing or creating things? Are you more artistic or science-oriented? There are no right or wrong answers about which activities make you happier or more personable. This is just a way to figure out the context of what makes you happy. Some people enjoy activities by themselves or with a few people more than others. Some people love to be at big parties with lots of people. No matter the activity, it's important to learn how to interact with and respect others. Good communication skills with others helps to show the best parts of your personality. Reader Poll: We asked 179 wikiHow readers if social media distracts them from things they’d rather be doing with their time, and 85% of them said yes. [Take Poll] If you’re not sure what activities you enjoy, try swapping out the time you spend on social media for trying new hobbies."
    },
    {
      "title": "Assess what you want to improve.",
      "content": "Assess what you want to improve. Think about what is bothering you in particular about your personality. What do you want to see differently in yourself? Having greater insight, is an important step to change. Think about how you could improve in the following areas: Your anxiety, anger, or temper Your shyness, fearfulness, or awkwardness Your loneliness, sadness, or depression Your stubbornness, irritability, or frustration Your lack of trust Your arrogance"
    },
    {
      "title": "Find your confidence.",
      "content": "Find your confidence. Confidence is an attractive personality trait. Often people who believe in themselves are happier. While being arrogant can make others uneasy, believing in yourself is key. Identify the different ways to feel and look confident . Have good body language that shows you're not fearful of others. Maintain good eye contact. Smile. Look interested in what others say and do. Gain confidence by focusing on the positive things in your life, and what you do well. Think about any recent events in which you worked hard, did well in something, or overcame a struggle. Remember these times, rather than the times where you messed up. Besides thinking of what you do well, imagine what you're capable of learning to do well. While you might lack confidence in a particular skill you haven't developed yet, you can access immediate confidence by focusing on your determination and adaptability to learn and grow. [1] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020."
    },
    {
      "title": "Be open to new experiences.",
      "content": "Be open to new experiences. While it may feel comfortable to do the same old things you always do, be adventurous and consider trying other things. You may be shy or unsure if it will go well. Oftentimes, things aren't as bad as you imagine them to be. Being open to new things makes you seem more flexible, interesting, and attractive to others. If you're nervous about trying something new, ask yourself what's the worst that could happen. Likely your only risk is feeling awkward or embarrassed. If you tell yourself you can handle those emotions, then you'll be able to be more adventurous. [2] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. If you're not ready to do something new on your own, try things in groups or with a trusted friend or family member. New experiences don't necessarily have to be risky adventures that put you or others in danger. It's just something that gets you out of your comfort zone."
    },
    {
      "title": "Be agreeable and friendly.",
      "content": "Be agreeable and friendly. While it may be tough to be agreeable all the time, people are more likely to respond positively and help you if you're kind and friendly. Show others that you are interested in getting to know them. Be willing to listen and understand another person's perspective. [3] X Research source Show empathy when others need to talk or vent. Imagine what it would be like in their shoes. Listen without interruption. Put away your electronics and devices, and focus on being present with others in need. Try to remain kind and polite even when others are rude. While it's important to know your limits, avoid trying to pick a fight when someone disagrees with you."
    },
    {
      "title": "Be respectful and humble.",
      "content": "Be respectful and humble. Don't brag, even if you're doing well for yourself. Don't be jealous of other people, either. Respect that each person has their own path, and just focus on yourself and reaching your goals. Show self-control. Forgive yourself and others. Put the past in the past. Avoid dwelling on past mistakes, and focus on how to find solutions and be future-oriented. [4] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Consider saying these self-affirmations: \"I release the past so that I can step into the future with pure intentions\" or \"I forgive myself one day at a time until it's complete.\" [5] X Research source Focus on how you can give rather than take."
    },
    {
      "title": "Tune into your resilience.",
      "content": "Tune into your resilience. Resilience is the ability to positively adapt in response to a challenge. It's a belief that you can persevere. This is an important trait, particularly to cope with and even thrive after adversity, and even if you haven't used it much, it's one that you already possess. [6] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Focus on how to be strong in your daily life. If you're experiencing challenges, identify what's within your control and decide what you want to take action on. It's also important to be objective about what's outside of your control, so you don't feel disempowered. [7] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Develop your resilience by not taking things too seriously. Believe in second and third chances to improve and become better. Take care of your body, mind, and spirit by finding ways to stay positive and be healthy. [8] X Research source Avoid being disheartened or disillusioned. When thinking of past stressful events, focus on what good came from them: what you learned or what you appreciate more now. This will help you believe that something good can come from future challenges, and not feel hopeless. [9] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020."
    },
    {
      "title": "Avoid rigidity and stubbornness.",
      "content": "Avoid rigidity and stubbornness. Being stubborn often means it's your way or the highway. You see things in black and white, and have a rigid sense of how things are or should be. [10] X Research source Imagine that things can be confusing, unclear, and gray. And that's okay. Imagine alternative ways of understanding a situation or person. Avoid assuming that there is no alternative way of thinking."
    },
    {
      "title": "Exercise patience rather than anger.",
      "content": "Exercise patience rather than anger. Anger and anxiety happens to everyone. You may feel out of control at times, or like you don't know what to do with your emotions. Find ways to stay calm and patient. Identify ways to control your anger . If you feel yourself getting out of control, make your exhales longer than your inhales for a few breaths, to get yourself out of fight-or-flight mode. [11] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Look at what triggers your frustration, and find ways to reduce these stressors. Instead of thinking about how much something makes you anxious and angry, take a minute. Breathe. Imagine yourself in a calm and relaxed place."
    },
    {
      "title": "Help others more.",
      "content": "Help others more. Do you avoid sharing with others? Or seem to always want to put your needs ahead of others' for some reason? Break this habit of selfish behavior, and focus on how you can help others more. [12] X Research source Do things that you normally would avoid or complain about. Help others that need your help. Focus first on how you can help those closest to you--your family, relatives, friends, neighbors, classmates, or co-workers. Branch out of your comfort zone, and consider volunteering your time to others. Give back to your community."
    },
    {
      "title": "Speak up more.",
      "content": "Speak up more. Learn to stand up for yourself and others. Shyness can be hard to overcome, and takes practice. The more you try, the better you will be with time. Learn to say what you want to say without fear of rejection or judgment. Consider taking a public speaking course. There are also many meetings nationwide via Toastmasters that help you learn public speaking: https://www.toastmasters.org/ If you are in school, there may also be debate classes or other opportunities to learn public speaking. Try talking more often with acquaintances through school, social gatherings, work. Build your communication skills ."
    },
    {
      "title": "Stop comparing yourself too much to others.",
      "content": "Stop comparing yourself too much to others. You may see someone who's happier, smarter, and better looking than you, and wish that you could be them. If you continue to dwell on what you don't have, you miss out on appreciating what you do have. [13] X Research source Instead of wishing for things to be better, be grateful for you've got. Remember at least three things each day that make you grateful for your life. Appreciate what the world has to offer rather than fixating on how you've been ill-treated."
    },
    {
      "title": "Remember that each person is unique.",
      "content": "Remember that each person is unique. You don't have to pretend to be someone that you're not. Be true to a personality that fits you, and that feels natural to you. Uniqueness in your personality is itself an attractive quality. Avoid seeing your personality as static. You will likely change over time. You may become less shy. You may become more open-minded. Or maybe, you become more stubborn as you grow older. Whatever your personality is or becomes, it is adaptable. It is uniquely yours, and you have the ability to adapt it, change it, or keep it as is."
    },
    {
      "title": "Find your inner happiness.",
      "content": "Find your inner happiness. Ultimately, your personality may tied to your sense of happiness. You may wonder how you can change your personality to be a happier and healthier you. It starts with finding your inner happiness. What gives you peace? What makes you feel calm, relaxed, and rested? [14] X Research source Learn ways to cultivate happiness in yourself. Do relaxing activities. Meditate. Listen to music. Take a walk in nature. Take time for yourself."
    },
    {
      "title": "Focus on loving yourself.",
      "content": "Focus on loving yourself. Remember that developing a sense of yourself and your own unique personality starts and ends with loving yourself. Appreciate who you are and what you have to offer to others. Believe in yourself. Avoid negative talk or thinking. If there are others putting you down, avoid defining yourself on their terms. You determine who you are. [15] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Find supports that boost your positive personality traits. Find others that welcome you, and make you feel loved. Share with them your concerns. Be kind to yourself every day."
    }
  ]
}