{
  "url": "https://www.wikihow.com/French-Crop",
  "title": "How to Ask for a French Crop Haircut, Plus How to Style It",
  "steps": [
    {
      "title": "A French Crop is a textured, cropped style with a long fringe.",
      "content": "A French Crop is a textured, cropped style with a long fringe. The classic French Crop features a short, tapered back and sides. The top of the style is slightly longer, with a fringe that falls straight across the forehead. The French Crop’s short back and sides are polished, while the longer top gives you plenty of styling options. [1] X Research source The short sides define the jawline and cheekbones for a more angular, masculine look. The longer top allows you to choose a style that flatters any face shape. The French Crop dates back to the early 20th century. It caught on with European military men, and then became popular with French artists and intellectuals. The cut was revived by British Mods in the 1960s, and then it became popular again in the 1990s. [2] X Research source The style is particularly trendy now because it's worn by characters on the television show Peaky Blinders. [3] X Research source"
    },
    {
      "title": "Ask your barber or hairstylist for a French Crop or textured crop.",
      "content": "Ask your barber or hairstylist for a French Crop or textured crop. The popularity of this cut means that most barbers and hairstylists will recognize the name French Crop. However, some may refer to the style as a textured crop. If they’re still unsure of what you want, ask them to use clippers with a short guard on the back and sides with a longer top. [4] X Research source Due to the adaptability of this style, be specific about your preferred length for the top, back, and sides. For example, you can ask for the back and side to be buzzed and the top a few inches longer. The length of the top is typically 1 - 2 inches (2.5 - 5 cm), with the back and sides tapering down to the shortest length at the nape. The tapering on a Classic French Crop is roughly ⅛ to ¼ inch (3.125 - 6.25 mm) at its shortest, or a clipper guard 2 or 3. Clipper guard sizes vary by manufacturer, so take a picture to show your barber exactly what you want. Let them know whether you want a more textured cut or a sleeker style. Head back to the barber shop for trims every 2-4 weeks to maintain the style."
    },
    {
      "title": "Use styling products for texture and hold.",
      "content": "Use styling products for texture and hold. Wash your hair using shampoo and conditioner designed for your hair type to help keep your hair healthy and looking its best, then towel dry your hair. Apply a dime-sized amount of styling product to your hands and rub them together. Run your hands through the ends of your hair, avoiding the roots, then push your hair forward over your forehead. For a sleek look, run a brush or comb through your hair to smooth it. For wavy or curly hair, scrunch your hair with your hands to encourage the wave or curl pattern. Hair gel is great for sleek looks because it has a stronger hold. Try serums to smooth frizzy hair or slick the top of your hair back. Hair wax , pomade , or hair clay to add texture and flexible hold for more tousled styles. Pomade usually has a shiny finish, while waxes and clays are more matte. [5] X Research source"
    },
    {
      "title": "Try styling tools for a more finished look.",
      "content": "Try styling tools for a more finished look. While the French Crop is a wash-and-go cut, use a blow dryer for more control over your style. For the Classic French Crop, hold the blow dryer above the crown of your head, directing the airflow along the top of your head toward the front. Using a brush, sweep the hair forward so your fringe falls over your forehead. Use a flat iron if you have curly or wavy hair and want a sleeker look. Section off pieces of dry hair. Clamp the heated flat iron as close to your scalp as possible without burning yourself. Run the flat iron along the length of your hair, pulling in the direction you want the hair to lay. Continue until you have straightened all of the sections of your hair. When you’re done straightening, run your fingers through your hair to break up the sections."
    },
    {
      "title": "Classic French Crop",
      "content": "Classic French Crop A Classic French Crop features a short back and sides that fade up to the slightly longer top. [6] X Research source The fringe falls straight across your forehead. How to Get the Look: This is the basic style most barbers will have in mind when you ask for a French Crop or textured crop, so you can just ask for it by name. It’s also called a Mid-Fade French Crop or Tapered French Crop."
    },
    {
      "title": "French Crop Mullet",
      "content": "French Crop Mullet A French Crop Mullet combines elements of the French Crop and the Mullet. The cut is exactly like the Classic French Crop on the top and sides, but with a longer back to get a Mullet's traditional “business up front & party in the back” look. [7] X Research source How to Get the Look: Tell your barber you want a French Crop, but lightly tapered into a longer back like a Mullet that gradually blends into the longer hair at the top."
    },
    {
      "title": "French Crop Fauxhawk",
      "content": "French Crop Fauxhawk A French Crop Fauxhawk leaves the top longer than a French Crop and the sides longer than a traditional Mohawk. Use wax or pomade to style the top up and toward the center like a Mohawk. How to Get the Look: Ask your barber for a French Crop with tapered sides and a longer top and back to style into a Fauxhawk. When styling the Fauxhawk, you may need more product than a dime or quarter-size to get the look. Gradually add product a little at a time until your hair stays where you want it."
    },
    {
      "title": "Low-Fade French Crop",
      "content": "Low-Fade French Crop This French Crop style features a low fade that begins transitioning from short to long hair lower on your head, usually close to the tops of your ears. This fade works well if you want a longer top that doesn’t appear disconnected. [8] X Research source How to Get the Look: Tell your barber you want a French Crop with a fade that starts at the top of your ears. A temp fade is similar to a low fade, but the taper starts slightly higher at the temples instead of the top of the ears."
    },
    {
      "title": "High-Fade French Crop",
      "content": "High-Fade French Crop A High-Fade French Crop is more dramatic than the Low-Fade version. While the low fade starts at the tops of your ears, the high fade begins at your forehead. [9] X Research source How to Get the Look: Ask for a French Crop with a short back and sides that start the fade to the longer hair on top at your forehead level."
    },
    {
      "title": "Messy French Crop",
      "content": "Messy French Crop The Messy French Crop dials up the texture with light layering or razored ends to give it more texture and movement. This is flattering for sharper facial features, like strong cheekbones and jawlines. How to Get the Look: Ask your barber for a French Crop with extra texture. When styling, run a quarter-sized amount of hair clay through the top of your hair then push your hair in different directions to get a messier look."
    },
    {
      "title": "Long French Crop",
      "content": "Long French Crop A Long French Crop has longer hair on the top. The back and sides are shorter than the top but not as short as a classic skin fade. This cut is a neater version of what it looks like when you had a French Crop cut and let it grow out. [10] X Research source How to Get the Look: Tell your barber you want a French Crop that’s longer on top and tapered at the sides and back."
    },
    {
      "title": "Side-Swept French Crop",
      "content": "Side-Swept French Crop For this French Crop, the fringe is left slightly longer and pushed to the side for a more casual look. These bangs look great on rounder face shapes, making them appear more chiseled. [11] X Research source Ask your barber to leave the fringe long so you can style them to the side."
    },
    {
      "title": "Angular French Crop",
      "content": "Angular French Crop This type of French Crop features fringe at an angle or cut into a point at the center of the forehead. It’s great for square faces because it draws the eye to the center of your face. How to Get the Look: Ask for a French Crop with the top and front of your hair cut at an angle styled into a point."
    },
    {
      "title": "French Crop Quiff",
      "content": "French Crop Quiff The quiff bangs stands up from the forehead to make a “wall” of hair. They’re flattering for round face shapes because they make them appear longer. This style may require styling with a blow dryer and hair product. How to Get the Look: Tell your barber you want a French Crop with a quiffed fringe. When styling, use gel to give the quiffed bangs enough hold to stand up all day."
    },
    {
      "title": "Undercut French Crop",
      "content": "Undercut French Crop This version of the French Crop features a longer top with closely cut or buzzed back and sides. The length of the top can vary depending on whether you like longer or shorter hair. [12] X Research source How to Get the Look: Tell your barber you want a French Crop with an undercut instead of a fade."
    },
    {
      "title": "Disconnected French Crop",
      "content": "Disconnected French Crop A disconnected style is an undercut that is drastically shorter than the top of the hair with little to no blending between the lengths, giving it an edgier look. In some cases, there’s a sharp line of demarcation between the longer top and the shorter back and sides. [13] X Research source How to Get the Look: Ask your barber for a French Crop with a strong line without tapering or fading."
    },
    {
      "title": "French Crop with a Skin Fade",
      "content": "French Crop with a Skin Fade This French Crop features a more drastic fade that tapers down to bare skin at the bottom. A skin fade starts very close to the scalp near your hairline on the sides of your head and at the nape, and then the hair very gradually gets longer as you move toward the crown. [14] X Research source How to Get the Look: Tell your barber you want a French Crop with tapered sides that fade all the way down to the skin. Drop fades are similar to skin fades, but the fade appears to dip and the front and back of your head instead of being symmetrical all the way around."
    },
    {
      "title": "Does a French Crop suit everyone?",
      "content": "Does a French Crop suit everyone? With a few tweaks, the French Crop looks good on everyone. It’s a classic style that can look trendy and sophisticated, making it popular throughout the 20th century and into the 21st."
    },
    {
      "title": "What’s the difference between a Caesar Cut and a French Crop?",
      "content": "What’s the difference between a Caesar Cut and a French Crop? The Caesar Cut usually has a shorter fringe than the French Crop. The Caesar Cut gets its name from Julius Caesar and has a short length, with the top brushed forward. [15] X Research source The Caesar Cut is a timeless, low-maintenance haircut."
    },
    {
      "title": "How is a French Crop different than a Crew Cut?",
      "content": "How is a French Crop different than a Crew Cut? The main difference between a French Crop and a Crew Cut is length. A Crew Cut is much shorter and closer to a Buzz Cut than a French Crop. The Crew Cut offers a sharp look and requires minimal effort. [16] X Research source Crew Cuts are often worn in the military and are said to have inspired the French Crop."
    },
    {
      "title": "Is French Crop good for thinning hair?",
      "content": "Is French Crop good for thinning hair? This style is especially good for men with thinning hair or receding hairlines because the fringe hangs over the forehead. It also allows longer pieces to cover thinning spots. The flexibility of the cut allows the barber to adjust for the most coverage. [17] X Research source"
    }
  ]
}