{
  "url": "https://www.wikihow.com/Dap-Someone-Up",
  "title": "How to Dap Someone Up Correctly: 5 Effortless Examples",
  "steps": [
    {
      "title": "The dap is a friendly greeting between 2 people to express solidarity.",
      "content": "The dap is a friendly greeting between 2 people to express solidarity. It includes a wide variety of gestures, but it can be any handshake you have with a close friend. Most people create their own dap with unique snaps, slaps, and fist bumps—there’s no “right” or “wrong” way to dap someone up! [1] X Research source Many athletes use the dap to show unity with their teammates before a game, or they use it as a celebratory gesture after they score a goal."
    },
    {
      "title": "The fist bump",
      "content": "The fist bump For a foolproof dap, ball your hand into a fist, and place it in front of you (with your knuckles facing forward). When your friend puts their fist up, push your arm forward so your knuckles meet their knuckles. [2] X Research source When in doubt, fist bump it out. Unless you and the other person have clearly established a handshake, there’s no way to tell which dap is going down. Fist bumping is the most standard and casual form of the dap so it's appropriate in any situation."
    },
    {
      "title": "The pound hug",
      "content": "The pound hug If you want to show your bro some extra love, extend your hand like you're about to give a handshake. When your friend meets your hand, interlock your thumbs and lean in for a quick half-hug—keep holding their hand at chest level, tilt your head to one side of their shoulders, and use your free hand to pat them on the back. [3] X Research source Also known as the bro hug, this form of the dap is typically reserved for close friends. If you mess up when your friend goes in for a hug, make a joke out of the situation, or say, “Wait, let’s try that again.” Remember, the situation is only awkward if you make it awkward."
    },
    {
      "title": "The pound",
      "content": "The pound To execute this dap, hold out a fist, thumb facing up. When your friend makes a fist, bump the top with the bottom of your fist, then vice versa. Finally, slap their hand with your hand and slide your hand away from theirs, folding your fingers inward to briefly grip their fingers as you do. [4] X Research source This form of the dap is also known as a vertical fist bump. To customize the pound, add an extra fist pound or snap, or say a fun phrase like “Sheesh!” at the end of your handshake."
    },
    {
      "title": "The chest bump",
      "content": "The chest bump To celebrate a major win with your homie, look in their eyes and give them the heads up to go in for a chest bump. Stand several feet apart, and then carefully run towards them. When you meet in the middle, jump up and gently bump chests together. [5] X Research source Make sure to keep your arms by your side when you jump up so you don’t accidentally elbow your friend."
    },
    {
      "title": "The ice in my veins",
      "content": "The ice in my veins If you just scored a goal, slap your friend's right hand with your right hand, then slap the back of their hand with the back of your hand. Wrap your thumb around the crook of their thumb and gently squeeze. Let go and straighten your arm, then use your index finger to point to the inner part of their forearm. [6] X Research source Lakers basketball player D’Angelo Russel created this dap to celebrate scoring a goal. [7] X Research source"
    },
    {
      "title": "Black G.I.s created the dap as a symbol of unity in the 1960s.",
      "content": "Black G.I.s created the dap as a symbol of unity in the 1960s. The dap (an acronym for dignity and pride) became a movement for black soldiers to express solidarity during the Vietnam War—it was another way to say, “I’ve got your back, we’re in this together.\" While it began as a greeting, the dap quickly evolved into a secret form of communication between black soldiers to convey information about the battlefield. Since white soldiers and officers falsely believed the dap was a symbol of black insurrection, it was banned at all levels of the military, increasing the desire for a symbol of unity and protection among black men."
    }
  ]
}