{
  "url": "https://www.wikihow.com/Decorate-an-Unfinished-Wooden-Box",
  "title": "How to Decorate an Unfinished Wooden Box",
  "steps": [
    {
      "title": "Remove the hinges and clasp if you don’t want to paint them.",
      "content": "Remove the hinges and clasp if you don’t want to paint them. Use a screwdriver that’s small enough to fit in the screws holding the metal pieces in place. Turn the screws counterclockwise until they’re loose and pull them out of the box. Set the screws in a small dish so you don’t misplace or lose them while you’re working. [1] X Research source You do not have to remove the hinges and clasp from the box if you want to paint them the same color as the wood. If your box doesn’t have any hinges or clasps, you may skip this step."
    },
    {
      "title": "Smooth the surface of the box with 180–220-grit sandpaper.",
      "content": "Smooth the surface of the box with 180–220-grit sandpaper. Fold a piece of 180- or 220-grit sandpaper in half so it’s easier to hold and rub it over the surfaces of the box. Use small circular motions across the flat surfaces and apply firm pressure to smooth out any raised areas so the paint can adhere to the wood easier. Blow any sawdust off the wood’s surface as you work so you see the areas that you already smoothed out. [2] X Research source Be careful as you work around the corners or edges since you could make them rounded and affect how well the box closes. Avoid using lower grit sandpaper since you could leave scratches or marks on the surface that become more noticeable after you paint the box."
    },
    {
      "title": "Choose and mix the paint color you want to use for your box.",
      "content": "Choose and mix the paint color you want to use for your box. Opt for an acrylic paint if you want the box to have a semi-glossy appearance. If you’d rather have a matte finish, select a farmhouse paint, which is a type of chalk paint. Open the paint and stir it thoroughly to ensure the color spreads through it evenly. [3] X Research source You can buy farmhouse or acrylic paints from your local craft store. Avoid using oil paints since they take a long time to dry."
    },
    {
      "title": "Apply a thin coat of paint to the outside of the box and let it dry for 15–20 minutes.",
      "content": "Apply a thin coat of paint to the outside of the box and let it dry for 15–20 minutes. Put a thin layer of paint on the end of a natural-bristle or foam paintbrush and spread it evenly over the wood. Work on the outside surfaces of the box first, using long, straight strokes so the brush lines aren’t as visible while you’re working. After painting the exterior of the box, let it dry for 15–20 minutes. [4] X Research source You do not have to use a primer on the box before you start painting it."
    },
    {
      "title": "Paint 1–2 more coats on the box if you want a more solid color.",
      "content": "Paint 1–2 more coats on the box if you want a more solid color. Paint the next coat of paint in the opposite direction as the first one to help hide the brush strokes more. Make sure each layer has the same thickness so it dries evenly. Allow each coat of paint to dry for at least 15–20 minutes before you apply the next one. [5] X Research source For example, if you painted horizontally across the box for the first coat, then paint them vertically on the second coat. Additional layers of paint will make the color stand out more and ensure the wood grain doesn’t show through to the final piece."
    },
    {
      "title": "Brush paint on the inside of the box if you don’t want to leave it unfinished.",
      "content": "Brush paint on the inside of the box if you don’t want to leave it unfinished. If you took off the hinges and clasp, set the lid upside-down while you’re working. Otherwise, leave the box open on the hinges. Paint around each of the edges and the interior of the box with a thin layer of acrylic or farmhouse paint. Allow the coat to dry for at least 15–20 minutes before applying the next coat. Use 2–3 coats total on the inside of the box. [6] X Research source You do not need to paint the inside of the box if you don’t want to. Try using a different color of paint if you want the inside of the box to add an accent. For example, you may paint the outside of the box white and the interior a metallic gold color."
    },
    {
      "title": "Use a paint marker if you want to draw intricate designs.",
      "content": "Use a paint marker if you want to draw intricate designs. Shake the paint marker thoroughly so the paint evenly spreads inside. Remove the cap from the marker and draw any designs you want. You may try writing names, making letters, or adding detailed line work as decoration. Make sure to put the cap back on the marker when you’re finished using it so it doesn’t dry out. [7] X Research source You can buy paint markers from your local craft store. Experiment using the paint markers on a scrap piece of wood or paper before using them on your box to ensure they’re the color you want."
    },
    {
      "title": "Distress the edges of the box with sandpaper if you want a rustic look.",
      "content": "Distress the edges of the box with sandpaper if you want a rustic look. Use a piece of 180- or 220-grit sandpaper and apply light pressure around the sharp edges of the box to lift up the paint. Press slightly harder if you want to remove more paint and expose some of the natural wood underneath it. Try to focus around areas that would naturally distress over time, such as around the hinges or clasp. [8] X Research source You do not have to distress the wood if you want your painted box to have a clean, finished look."
    },
    {
      "title": "Apply 2 coats of varnish to protect the painted surface.",
      "content": "Apply 2 coats of varnish to protect the painted surface. Stir the varnish slowly so it doesn’t develop any bubbles before using it. Dip the ends of a natural bristle paintbrush in the varnish and pull it in long, straight lines across the surfaces of the box. Drag the tip of the brush over the areas you’ve gone over to help smooth it out. Allow the varnish to dry for about 4 hours until it’s no longer tacky. Then apply a second coat. [9] X Research source If there are bumps or uneven surfaces, lightly sand the varnish smooth with 220-grit sandpaper. You can choose glossy or matte varnish depending on how much you want the box to shine. Varnish can create harmful fumes, so be sure to work in a well-ventilated area to avoid any irritation."
    },
    {
      "title": "Paint a layer of acrylic paint on the box if you don’t want visible wood grain.",
      "content": "Paint a layer of acrylic paint on the box if you don’t want visible wood grain. You can use any color of acrylic paint you want as the undercoat for your box. Dip a natural-bristle or foam brush in the paint and start painting the exterior of the box in long, straight strokes. Allow the outside of the box to dry for 15–20 minutes before painting the inside of the box. [10] X Research source You can choose to leave the box unpainted if you want. You do not need to prime the box before you paint it. Avoid applying thick layers of paint since they will dry unevenly and may affect the color of the box."
    },
    {
      "title": "Sand the paint smooth with a piece of 180-grit sandpaper.",
      "content": "Sand the paint smooth with a piece of 180-grit sandpaper. Only apply light pressure as you go over the surface of the box with the sandpaper to get rid of any raised areas of paint. Be careful not to press too hard, or else you may expose the wood underneath the paint. Work in small circular motions so you don’t leave any noticeable scratch marks on the surface. Frequently blow the dust off of the box so you can see where you’ve already worked. [11] X Research source Avoid using sandpaper with a lower grit since it will leave scratches in the paint that could affect how the decoupage adheres to the surface. If you don't blow the sawdust off the surface, it'll get stuck in your glue and create a textured surface—you don't want that."
    },
    {
      "title": "Print the image you want to attach to the box.",
      "content": "Print the image you want to attach to the box. Resize the image in editing software so it’s the same size as the final design you want to attach on to the box. Preview the image before printing it out to ensure it doesn’t get cut off around the edges. Turn the image settings to the highest quality before clicking the Print button. [12] X Research source If you don’t have access to a printer, try going to a library or local print shop to print the image for you."
    },
    {
      "title": "Apply a layer of decoupage glue on the box where you want your image.",
      "content": "Apply a layer of decoupage glue on the box where you want your image. Dip a foam brush into the decoupage glue and wipe off any excess that's dripping off. Paint a thin layer of the glue on the surface of the box where you want to attach the image. Make sure the glue doesn’t have any bubbles or raised areas that may affect how the image lays on the box. [13] X Research source You can buy decoupage glue from your local craft store or online. Decoupage glue will start to dry within an hour, so work quickly when you start applying it."
    },
    {
      "title": "Lay the printed image flat on the box.",
      "content": "Lay the printed image flat on the box. Carefully set the image down on the wood and press it down firmly. Push out any bubbles or wrinkles from the center toward the edges of the image with your fingers to smooth it out. Use gentle pressure so you don’t rip the paper, or else you’ll have to start over. [14] X Research source Make sure the image you’re using doesn’t have any wrinkles or creases, or else it may not lie properly on the wood."
    },
    {
      "title": "Brush the decoupage glue over the image and let it dry for 1 day.",
      "content": "Brush the decoupage glue over the image and let it dry for 1 day. Dip your brush in the decoupage glue again and wipe off any excess. Work from the center of the image toward the edges so you apply a thin layer across the entire surface. Use gentle pressure so you don’t damage the image or rip the paper. Let the decoupage glue set completely for 24 hours. [15] X Research source Decoupage glue dries clear so you’ll still be able to see the image when you’re finished. Carefully wipe off any excess decoupage glue with a paper towel if there are still large drops left on the box. Always apply the glue in thin layers rather than applying it thickly. Thick layers of glue won't dry well or will take a super long time to dry. Don't overbrush the glue! Those extra brush strokes will get dried into the surface."
    },
    {
      "title": "Rub away any edges around the image with a damp sponge.",
      "content": "Rub away any edges around the image with a damp sponge. Wet a sponge in warm water and wring it out completely so it doesn’t drip. Gently rub around any exposed edges of the paper that aren’t part of the design. Wipe away any balled-up paper that forms around the edges so only the parts of your design are left attached to the box. [16] X Research source You can also try using 220-grit sandpaper, but you may also scratch off some of the paint from the box."
    },
    {
      "title": "Spread a layer of acrylic varnish on the box to seal it.",
      "content": "Spread a layer of acrylic varnish on the box to seal it. Get a glossy or matte finish varnish and mix it slowly with a stir stick. Dip the tip of a natural-bristle brush into the varnish and wipe off any excess drops. Pull the brush gently over the wood in long straight strokes to apply a thin layer of the varnish. Allow the varnish to dry for at least 4 hours so it has time to set. [17] X Research source Work in a well-ventilated area while working with varnish since it may create harmful fumes that cause irritation. Make sure that the glue is completely dry before you add any varnish."
    },
    {
      "title": "Print out the design you want to add onto the box.",
      "content": "Print out the design you want to add onto the box. Resize the design on your computer with editing software so it’s as large as you want the final image to appear on the box. Use the Print Preview function to make sure the design doesn’t get cut off when you print it. Set it to the highest quality image before printing it out for your design. [18] X Research source You may also draw your design by hand if you don’t want to print one out. If you don’t have access to a printer, check for local print shops or libraries to see if you can print your design there."
    },
    {
      "title": "Place a piece of carbon paper between the printed design and the box.",
      "content": "Place a piece of carbon paper between the printed design and the box. Set the layer of carbon paper on your box where you want to engrave your design. Make sure the darker side of the carbon paper touches the wood, or else the image won’t transfer correctly. Put your design face-up on top of the carbon paper and tape it to the box so it doesn’t move or shift around while you’re working. [19] X Research source Carbon paper has a dark layer of carbon on one side, so when you write or draw something on the light side, the image will transfer onto the surface underneath it. You can buy carbon paper from your local hardware store or online."
    },
    {
      "title": "Trace around the outline of your design with a pencil.",
      "content": "Trace around the outline of your design with a pencil. Apply firm pressure with a pencil around the outline of your design. Make sure you go around the entire outline, or the design won’t transfer onto the box. Lift up a corner of the paper while you’re working to check if you’re able to see the lines on the wood. If not, tape the paper back down and press harder with your pencil. [20] X Research source You may also use a pen or any other sharp writing instrument. Be careful not to rip through the paper since you could damage the wood."
    },
    {
      "title": "Carve around the outlines with a Dremel rotary tool.",
      "content": "Carve around the outlines with a Dremel rotary tool . Use the cone-shaped attachment in the Dremel tool so you have the most control while you’re working. Hold the tool like a pencil before turning it on so it comes up to full speed. Press the tip into the wood and follow along with your outline. Lift the tool up frequently and blow away any sawdust so you can see where you’re working. Keep working around the outline until you’ve carved out the entire outline. [21] X Research source Dremel rotary tools have small spinning heads that make them easy to work with for carving designs into wood. You can buy them from your local hardware store. You may also hold the tool sideways so the wider end presses against the wood if you want to make larger recessed areas in the wood. You can carve into the wood as deep as you want, but be careful not to punch through to the inside of the box. Never touch the rotating head while the Dremel tool is on since you could seriously injure yourself."
    },
    {
      "title": "Sand any rough edges with 180-grit sandpaper.",
      "content": "Sand any rough edges with 180-grit sandpaper. Go around your design and apply light pressure with the sandpaper to remove any raised or rough areas. Work in short back and forth motions so you don’t ruin the carved design. Blow away the sawdust while you’re working so you can clearly see which areas you’ve already sanded. [22] X Research source If there are still rough edges, try using 220-grit sandpaper to smooth it out more."
    },
    {
      "title": "Rub wood stain onto the box with a rag or shop cloth.",
      "content": "Rub wood stain onto the box with a rag or shop cloth. Choose the color stain you want for your box, and dip the end of a rag or shop cloth in it. Rub the stain onto the wood following the direction of the grain so it absorbs the best. Keep applying the stain until you coat the entire surface of the wood so it has a uniform color. Allow the stain to dry for about 4 hours. [23] X Research source The stain will usually look darker in engraved areas, which will help your design look more prominent."
    },
    {
      "title": "Seal the box with polyurethane wood finish to seal the stain.",
      "content": "Seal the box with polyurethane wood finish to seal the stain. Mix the wood finish with a stir stick slowly so it doesn’t form any bubbles. Dip the end of a natural-bristle brush into the finish and wipe off any excess. Use long, straight strokes across the surface of the wood, making sure to apply a thin and even layer. Smooth out the finish with the tips of the bristles before letting it dry for 4 hours. [24] X Research source You can apply a second layer of wood finish if you want additional protection. Wood finish creates harmful fumes, so work in a well-ventilated area while using it."
    }
  ]
}