{
  "url": "https://www.wikihow.com/Draft-a-Motion-to-Dismiss",
  "title": "How to Draft a Motion to Dismiss",
  "steps": [
    {
      "title": "Search for forms.",
      "content": "Search for forms. Many states have court-approved forms you can use for your motion to dismiss so you don't have to format the document yourself. [2] X Research source You typically can find forms available for download by visiting the website for the state court system or the state's highest court. Forms also may be available at the websites of state legal aid societies. Paper forms typically are available at the clerk's offices of individual courts."
    },
    {
      "title": "Set up your page.",
      "content": "Set up your page. You must use the correct size paper with the correct margins for all court documents. [3] X Research source You typically can find these state or local rules on the court's website. The rules also may have a sample or document template that you can use as a guide. [4] X Research source Generally, you should use standard 8.5 x 11 white paper with one-inch margins all the way around. Some courts may have different margin specifications for the first page. Some courts may require you to use a special \"pleading paper,\" which contains line numbers down the left-hand side. Most word processing applications such as Microsoft Word have pleading paper templates you can use. Set up your footer to print consecutive page numbers at the bottom of each page. Use a common font such as Times New Roman or Arial in a 12-point size, and double-space your text. Make sure you're set to print your document using black ink."
    },
    {
      "title": "Create your caption.",
      "content": "Create your caption. Your caption identifies the case to which your document applies, and must be identical to the caption for the complaint in the case. The caption includes the court name and location, the names of the parties in the case, and the case or file number assigned by the court. [5] X Research source You also can copy the format of the caption on the complaint so everything is in the right place on the page."
    },
    {
      "title": "Title your motion.",
      "content": "Title your motion. At the top of your motion you must include a title that identifies the purpose of the document for the court. [6] X Research source The title can be as simple as \"Defendant's Motion to Dismiss\" or can include the reason you want the court to dismiss the case, such as \"Defendant's Motion to Dismiss for Failure to State a Claim.\" Traditionally, the title is centered on the page in all caps. It also may be bolded or underlined. Check the court's rules or look at other documents filed in the same court to get a sense of the style that court uses."
    },
    {
      "title": "Create your signature block.",
      "content": "Create your signature block. Your signature block gives you space to sign your motion and provides your legal name and contact information. [7] X Research source Typically you want to leave about four lines, or two double-spaced lines, for your signature. Make a solid black line to sign, then type your name directly below the line. Under your name, you should type your address. You also may want to include your phone number and your email address. Your signature block also should include a line and space for you to write the date on which you signed the motion."
    },
    {
      "title": "Add other pages as necessary.",
      "content": "Add other pages as necessary. Depending on the court, you may need to attach other documents such as a certificate of service or a notice of hearing. These forms generally are available in the clerk's office. [8] X Research source If you've found a packet of court-approved forms to use for your motion to dismiss, any additional documents should be included. Certificates of service and notices of hearing always use the same format, but you'll have to put in the name and address of the other party, as well as your own name and address. Leave the date and time of the hearing on the notice blank. The clerk of court will fill those in when the hearing is scheduled."
    },
    {
      "title": "Research the law that applies to your case.",
      "content": "Research the law that applies to your case. You must have sufficient legal grounds to request that the judge dismiss the complaint against you. In most cases, if you're early in the proceedings, your motion to dismiss will be for procedural reasons such as a lack of jurisdiction. Your state's rules of civil procedure will determine which of these reasons applies to your case. You typically can access these rules by going to the website for your state court system. Specific court websites often have information about jurisdiction as well. Keep in mind that some reasons for dismissing a lawsuit must be mentioned in your first filing with the court, or the court will consider them waived. [9] X Trustworthy Source Civil Law Help Center Nonprofit law firm dedicated to civil legal services to all people Go to source For more substantive grounds, you must look at the law that governs the plaintiff's claim. For example, if you were in a car accident, you should look at your state's personal injury law. That law will list all the elements the plaintiff must prove to state a valid claim against you. If he or she has failed to include one or more of those elements in the complaint, you have grounds to request that the judge dismiss the case. It also may be that the complaint lists something for which there is no legal remedy. For example, suppose your neighbor sued you because you didn't say \"good morning\" to him when he passed by your house as you were sitting on the porch. Since there's no law requiring you to say \"good morning\" to your neighbor, your neighbor's complaint fails to state a claim for which the court can award him damages. If the legal research becomes too intense, you might consider hiring an attorney to research and draft your motion for you. In most states you can hire an attorney to perform unbundled legal services, through which he or she will conduct your research or draft your motion without taking you on as a client for full-scale representation."
    },
    {
      "title": "Write your introduction.",
      "content": "Write your introduction. The first lines of your motion should state your name and role in the case, and what you are asking the judge to do. Traditionally, the first line begins \"Comes now the defendant,\" followed by your name. Then you state that you're asking the court to dismiss the plaintiff's complaint. After this, you can write a line such as \"In support of its motion, Defendant states as follows.\" The body of your motion then continues in paragraph form as you lay out the reasons you believe the complaint should be dismissed."
    },
    {
      "title": "Outline the grounds for your motion.",
      "content": "Outline the grounds for your motion. Using the information you've gathered from your research, tell the judge the reasons the complaint is legally or procedurally insufficient and should be dismissed. [10] X Research source If you're using a procedural rule, you may want to reference the rule of procedure that the complaint violates. If your argument is that the complaint fails to state a claim, you should refer to the applicable law if possible. Some forms may include a list of reasons, and you simply have to check off the ones that apply in your case. Make sure you read each of these reasons carefully and mark each one that applies."
    },
    {
      "title": "Close your motion.",
      "content": "Close your motion. Once you've finished listing the reasons the complaint should be dismissed, you end your motion by asking the judge to dismiss the case. Typically the closing would say something like \"For the foregoing reasons, the defendant respectfully requests the court dismiss the complaint in this case.\""
    },
    {
      "title": "Gather any documents or affidavits.",
      "content": "Gather any documents or affidavits. If you have any documentation that supports your motion, you should attach it to the motion and submit it to the court. [11] X Research source If your motion to dismiss is supported by an affidavit, it should be sworn under oath and signed before a notary public. For example, if your landlord has sued you for failure to pay your rent, but you've already paid it, you might include a copy of the cancelled check or a receipt from your landlord as evidence that the rent was paid. [12] X Research source"
    },
    {
      "title": "Sign your motion.",
      "content": "Sign your motion. Some jurisdictions may require you to sign your motion or other documents in front of a notary public. After you've signed and notarized your paperwork, make at least two copies of everything you plan to file with the court. You will need one copy for your own records and one for the other party in the case. The court will keep the originals. [13] X Research source"
    },
    {
      "title": "Take your motion to the clerk's office.",
      "content": "Take your motion to the clerk's office. You must file your motion with the clerk of the court where the case was originally filed. [14] X Research source You will have a deadline by which you must file your motion, particularly if it is the first thing you've filed in the case. This deadline typically is about 20 calendar days from the day you are served with the complaint and summons. [15] X Trustworthy Source Civil Law Help Center Nonprofit law firm dedicated to civil legal services to all people Go to source You can find the deadline by looking at the summons you received, or by calling the clerk's office. Get this deadline as soon as possible after you are served and write it down so you can make sure you don't miss it. You will have to pay a fee to file your motion with the court. This fee varies among jurisdictions and based on whether the motion is the first thing you've filed in the case. The fee for your first filing may be several hundred dollars, while the fee for a later motion is less than a hundred. If you don't think you can afford the filing fees, you can apply with the court to have the fees waived. You will have to disclose details about your income and assets, which the court will compare to a set minimum threshold. If your finances fall below that threshold, you typically will qualify to have the fees waived."
    },
    {
      "title": "Have the other party served.",
      "content": "Have the other party served. Once you've filed your motion, the other party must have notice of the action you've asked the judge to take. You may choose personal service, in which you get a sheriff's deputy or private process server to hand-deliver the motion to the other party. Typically, though, you also have the option to mail the motion using certified mail with returned receipt requested. [16] X Research source If you have the option of using certified mail, keep in mind that typically will be the easiest and most cost-effective way for you to complete service."
    },
    {
      "title": "Wait for a response.",
      "content": "Wait for a response. The other party has a period of time before the hearing to respond to your motion. In some jurisdictions, the party has a certain number of days after they are served with your motion to respond. This deadline may be extended if you served them by mailing the motion rather than hand-delivering it using a sheriff's deputy or other process server. [17] X Research source This period also may defined with reference to the date of the hearing. If the other side is going to respond to your motion, it must be filed and served within a certain number of days before the hearing is set. For example, if the lawsuit was filed in federal court, the plaintiff must file and serve a response to your motion to dismiss no later than 21 days before the date the hearing of the motion is scheduled."
    },
    {
      "title": "Prepare for your hearing.",
      "content": "Prepare for your hearing. The judge will hear arguments from both sides regarding your motion to dismiss in open court and make his or her decision based on the evidence presented. [18] X Trustworthy Source Civil Law Help Center Nonprofit law firm dedicated to civil legal services to all people Go to source While you can begin your preparation before you receive a response from the other side, if you do receive a response you should use that to finesse your argument. Knowing how the other side plans to oppose your argument means you can address the points they plan to make. Organize the paperwork you've filed as well as any other documents you plan to present to the court to support your claim that the case should be dismissed. Write out an outline to plan what you will say to the judge to present your case. Focus on the facts in the case that support dismissal."
    }
  ]
}