{
  "url": "https://www.wikihow.com/Fit-Concrete-Gravel-Boards",
  "title": "How to Fit Concrete Gravel Boards",
  "steps": [
    {
      "title": "Plant the fence posts if they haven’t already been installed.",
      "content": "Plant the fence posts if they haven’t already been installed. Measure the perimeter of your yard, or wherever you plan on installing fencing. Space the fence posts 6 to 8 ft (1.8 to 2.4 m) apart. As a rule of thumb, dig holes that are about ⅓ the height of the posts to provide plenty of stability for your fence. Then, secure the posts by filling the holes in with cement . [1] X Research source For example, if you have a stretch of ground 48 ft (15 m) long, you could use 8 posts spaced 6 ft (1.8 m) apart. That way, each part of the fence will be equal. You could also space 6 posts 8 ft (2.4 m) apart. Concrete gravel boards are easiest to install along metal posts with slots in the side. They can be used with other types of posts, so you don’t have to start from scratch if you already have posts installed. You could also fill the holes with gravel instead of concrete. It’s a possibility for wood posts. They won’t be as secure, but it makes them easier to remove and replace as they wear out."
    },
    {
      "title": "Purchase 1 gravel board to fit between each fence post.",
      "content": "Purchase 1 gravel board to fit between each fence post. The number of boards required depends on the length of your fence. Count the number of posts and subtract 1 from the total to figure out how many boards to get. Each board fits between 2 adjacent fence posts. [2] X Research source For example, if you have a 48 ft (15 m) fence with 8 posts, you will need 7 gravel boards. The boards are available online and at many hardware stores. They can also be bought from fencing companies. The boards tend to come in a single size, usually 12 in (30 cm) long. Fence posts are never spaced further apart than that, so the boards will always be long enough for your fence."
    },
    {
      "title": "Pull off any panels that have already been hung on the fence.",
      "content": "Pull off any panels that have already been hung on the fence. Search each panel for any screws or nails holding it in place. Use a cordless screwdriver in reverse to remove screws. If you’re dealing with nail-on boards, pry the nails back gradually with a claw hammer or pry bar. Slotted fence posts are different and won’t have fasteners, so you can slide the panels up to remove them. [3] X Research source Before removing anything, take a look at how the panels are positioned. If you have horizontal panels, try removing the lowest one first. The concrete board may fit while the other panels are still in place. If you’re working on a new fence, wait to install the panels until after you have finished fitting the gravel boards in place."
    },
    {
      "title": "Measure the available space between the fence posts.",
      "content": "Measure the available space between the fence posts. Stretch a tape measure from one post to the other to determine the length of each section. This measurement is useful for cutting the boards to the proper length. Then, measure from the ground-up to determine how tall you want the gravel boards to be. The gravel boards usually do not need to be thinned at all, so it’s better to avoid doing this unless absolutely necessary. [4] X Research source Instead of shortening the gravel boards, use shorter panels on your fence. You could also cut existing fence panels shorter to ensure your fence is at the height you desire. If you’re fitting boards on a single length of fence with multiple posts, you usually won’t need to measure more than 1 section. Unless the fence posts were placed incorrectly, they will be spaced evenly. If you’re fitting boards along multiple fences, take separate measurements for each one."
    },
    {
      "title": "Use a pencil to mark where you plan on cutting each board.",
      "content": "Use a pencil to mark where you plan on cutting each board. Set the boards on a flat surface, such as a cutting bench. Transfer your measurements from earlier to outline how to cut the boards. Make sure they are marked to the correct size to fit your fence. Double-check the guidelines afterward for accuracy. [5] X Research source Remember, you can always trim boards if they are too big. They can’t be fixed once they have been cut too short. Unless your fence posts have been spaced unevenly, the boards will all be the same size when cut. You could cut one board, then use it to outline the remaining boards."
    },
    {
      "title": "Put on safety glasses and a dust mask before cutting gravel boards.",
      "content": "Put on safety glasses and a dust mask before cutting gravel boards. Plan on working outdoors, if possible, to prevent any concrete dust from getting into your home. If you’re working indoors, open nearby doors and windows to let out the dust, or use any ventilation fans you have installed. Avoid wearing a long-sleeved shirt, jewelry, or anything else that could get caught by the blade. [6] X Research source If you’re not prepared to cut with concrete, ask a professional for assistance. Some stores will cut the boards to size for you when you buy them. Wood gravel boards are also easier to cut."
    },
    {
      "title": "Cut the boards to size with an angle grinder fitted with a diamond disk.",
      "content": "Cut the boards to size with an angle grinder fitted with a diamond disk. Make sure you have a diamond-studded blade or another disk that works on concrete. To use the angle grinder, hold onto it with both hands and move it slowly along the board. Cut across the boards first to trim them to the proper length. Take care of the board’s height afterward, if needed. [7] X Research source Move the angle grinder at a slow but steady pace to ensure it cuts in a straight line. Other tools, such as a circular saw fit with a concrete-cutting blade, may also work."
    },
    {
      "title": "Fit the gravel boards into the slots on the posts.",
      "content": "Fit the gravel boards into the slots on the posts. Make sure all of the fence panels are out from between the posts. Install the boards by lifting them up and sliding them into the slots on the posts. They can be pretty heavy, so ask a friend to lend a hand. Push them firmly against the ground to ensure they are stable and level. [8] X Research source Make sure the boards are stable and even with one another across the entire fence. If one board is off, the fence panels won’t be at the same height once they are installed."
    },
    {
      "title": "Use a bubble level to make sure the boards are even.",
      "content": "Use a bubble level to make sure the boards are even. Test the boards one by one. Set the level on top of one of the boards, then watch the liquid capsule in its middle. It has a bubble that will shift to one side, depending on which one is higher. Make adjustments to each board until they are all level. [9] X Research source You can make adjustments by spreading out the soil underneath the board. Pack more soil under the lower side to raise it up. Remove soil to lower a side. For example, if the bubble is on the right side of the level, that side is higher than the other. Remove dirt from underneath the right side or pack more dirt underneath the left side."
    },
    {
      "title": "Place the remaining fence panels into the post slots.",
      "content": "Place the remaining fence panels into the post slots. Finishing the installation depends on the type of fence you have. Most slotted fences have horizontal panels that fit over the gravel boards. Raise the panels up one at a time to slide them into the slots on the fence posts. Stack the remaining boards on top of one another to complete the fence. [10] X Research source You can often assemble the fence panels on the ground, then lift the entire panel up and slot it onto the posts. Slotted fencing is often very easy to install! You can test the fence again with a level when you’re done. Make sure the entire fence is well-positioned and stable. If it isn’t level, lift the gravel boards and continue adjusting the soil underneath them."
    },
    {
      "title": "Purchase gravel board clips to hold the boards to the fence posts.",
      "content": "Purchase gravel board clips to hold the boards to the fence posts. Gravel board clips are necessary for any fence posts without slots, including wood ones. The clips screw onto the posts to essentially create slots for the boards. There are also gravel board cleats you could use, but they have to be bolted to the boards as well as to the fence posts. [11] X Research source You will need 2 clips for each gravel board you plan on installing. If you have a 48 ft (15 m) fence with 7 gravel boards, get 14 clips. Another option is to cut small wood blocks out of pine or cedar boards. Make them the same width and thickness as the gravel boards. Fit the gravel boards on the fence, then place the gravel boards around them on the posts. Screw them to the posts to hold the gravel boards in place."
    },
    {
      "title": "Measure and mark the center point on each post.",
      "content": "Measure and mark the center point on each post. To figure out where the center is, measure the width of the post. Take the measurement on the inside part of the post where the boards and fencing panels will be installed. Then, divide the result by 2. This number will be the center part of the post. Measure across the post a second time and mark the spot in pencil to indicate where the clip will be. [12] X Research source Mark each fence post. They will all have 2 clips (1 on each side). The fence posts are typically all the same size, so you only need to measure the width once to figure out where to place the clips."
    },
    {
      "title": "Position the fence clips in the middle along the width of the posts.",
      "content": "Position the fence clips in the middle along the width of the posts. Fit each clip on the inside part of a post so they are facing the opposite post. Gravel clips typically look like 3-sided boxes. Turn each clip so the open end is face-up. Press the clip firmly against the ground afterward. When the clips are positioned the right way, you will be able to slide the gravel boards down through the open ends of the clips. [13] X Research source Be sure to rotate each clip the same way. Make sure they are all positioned correctly so they are level with one another across the fence posts."
    },
    {
      "title": "Trace the screw holes on the clips with a pencil.",
      "content": "Trace the screw holes on the clips with a pencil. The clips usually have a pair of screw holes on the top end. Mark these spots in pencil so you know where to drill the main pilot holes. Then, look for any additional holes the clips may have. Many of them have at least one extra hole near the bottom edge. [14] X Research source The number of holes varies depending on the clip. They all have at least 2 holes, but some of them have more."
    },
    {
      "title": "Use a masonry drill bit to make 7 mm (0.28 in) holes in the posts.",
      "content": "Use a masonry drill bit to make 7 mm (0.28 in) holes in the posts. Plan on making the pilot holes roughly the same size as the screws you’re using. Fit the bit on a power drill, then carefully drill through the spots you marked. Make each hole about 7 mm (0.28 in) deep, or about the same length as the screws you’re going to use. [15] X Research source If you’re able to, use a drill bit one size smaller than the screws. It creates small pilot holes that hold the screws more firmly in place. If the holes are too big, the screws won’t stay in. Solid posts are prone to cracking, but the pilot holes prevent that. Screwing or nailing the clips directly onto the posts could permanently damage them."
    },
    {
      "title": "Screw the clips in place with 8 mm (0.31 in)-diameter metal screws.",
      "content": "Screw the clips in place with 8 mm (0.31 in)-diameter metal screws. Use galvanized metal screws for the rust resistance they provide. Get ones that are about 7 mm (0.28 in) in length. Place the clips back on the posts, lining up the screw holes with the pilot holes you drilled on the posts. Then, secure the screws to hold them in place. [16] X Research source Nails can be used on wood posts, but they aren’t as secure as screws. Use screws for a stronger attachment."
    },
    {
      "title": "Install the gravel boards by sliding them into the clips.",
      "content": "Install the gravel boards by sliding them into the clips. Make sure all of the fence panels are out of the way. Then, lift them and fit them into the open clips. Push each board as far down as you can. Once the boards are in place, you can begin assembling the fence panels. [17] X Research source Test the boards with a level afterward if you wish to make sure they are placed perfectly. If the boards aren’t level, remove them and reposition the soil. Pack soil into any areas where the boards are too low, and remove soil from areas where they are too high."
    },
    {
      "title": "Hang the fence panels over the boards and nail them to the fence.",
      "content": "Hang the fence panels over the boards and nail them to the fence. Secure a pair of horizontal rails to the fence posts if they haven’t already been installed. You can use 2 1 ⁄ 2 in (6.4 cm) deck screws or nails to fasten them to the posts. Then, space the fence panels out evenly along the length of the fence. Screw or nail the panels to each rail to finish setting up the fence. [18] X Research source You can cut rails out of pine or cedar wood boards. Trim them to the same length as the gravel boards. Place one in the center of the fence, then another along the top. The fence panels can usually be cut with a circular saw or angle grinder if they are longer than you desire. Trim the bottoms flat so they fit squarely on top of the gravel boards."
    }
  ]
}