{
  "url": "https://www.wikihow.com/Deal-With-Backstabbers",
  "title": "How to Deal With Backstabbers",
  "steps": [
    {
      "title": "Check and cross check your stories before acting on them.",
      "content": "Check and cross check your stories before acting on them. Things expand in translation as others spread rumors and maybe you're over-reacting to something that hasn't really happened the way it was told to you. If it is true though, proceed."
    },
    {
      "title": "Keep gossiping to a minimum.",
      "content": "Keep gossiping to a minimum. If you're in front of people you don't know, don't spread rumors. You may be tempted to be helpful by telling a newcomer all the terrible things about a teacher or a boss, but you never know who they might tell. If you can't resist gossiping or complaining, try to do it only in front of people who have never met the person you're talking about. [1] X Research source It's fine to listen to gossip and rumors from anyone, so long as you don't contribute anything yourself. Try to listen more and talk less if you can't give up gossip."
    },
    {
      "title": "Build good relationships with everyone around you.",
      "content": "Build good relationships with everyone around you. Try to be friendly and positive, even when dealing with people you don't know. Even if someone turns on you anyway, others will be less likely to side against you. If you're at work, treat everyone with respect, not just immediate coworkers and bosses. If you're too focused on those relationships, you could carelessly give a receptionist, intern, or lower level employee a reason to hold a grudge against you."
    },
    {
      "title": "Learn to spot the signs of backstabbing as early as possible.",
      "content": "Learn to spot the signs of backstabbing as early as possible. The longer a backstabber is allowed to spread lies or sabotage you, the harder it will be to repair the damage. If you can spot signs of backstabbing early, this can help you to head the acts off before they increase. Look for the following warning signs: False rumors reach you about what you've supposedly done or said. You said something in private, and now everyone knows you said it. People stop entrusting you with information, assigning you tasks at work, or asking you to events that they once did. People act cold or unfriendly toward you for no clear reason."
    },
    {
      "title": "Understand that not all irritating behavior is a sign of backstabbing.",
      "content": "Understand that not all irritating behavior is a sign of backstabbing. Make sure you're not making a mountain out of a molehill in assuming that someone is a backstabber. Some poor behaviors, such as being persistently late, sloppy, or selfish are a sign of a thoughtless person, not necessarily a scheming backstabber. The occasional minor slip-up, such as canceling lunch at the last minute or neglecting to return a phone call, is not a sign of backstabbing either."
    },
    {
      "title": "Keep a record of what goes on.",
      "content": "Keep a record of what goes on. As soon as you suspect backstabbing might be occurring, start documenting the events that make you suspicious. Write down what happened, as well as the reasons you think someone might have hurt you intentionally. This makes your experiences easier to examine, so you can figure out whether the incident is part of a larger pattern or just a misunderstanding. If you think you're being sabotaged at work, keep a business-like record of how your work was adversely affected. In this record, include details of the work you accomplish, positive feedback you receive, and other concrete evidence that you can use to defend yourself if the sabotage gets serious."
    },
    {
      "title": "Identify the backstabber.",
      "content": "Identify the backstabber. Once you've noticed signs that someone may be sabotaging you, examine people's behavior and action to narrow down the culprit. Observe the suspects several times at least before you leap to a conclusion, as rude behavior could just be the sign of a bad day. Here are some ways a backstabber might behave: If someone gives you insincere compliments, or acts as though a criticism is a compliment, they may be hiding jealousy or anger. Someone agrees with you when you're alone together, then sides with other people when you talk about the same subject in a group. The possible backstabber recalls all their past grievances and slights without missing a beat. This person probably holds grudges for a long time and feels entitled to take revenge. The suspect treats you with disrespect, ignoring your opinion or failing to change their behavior when you ask them to stop. Besides these signs, keep in mind who is able to betray you. If someone keeps repeating what you said in private, it has to be someone whom you confide in. If a project you're working on is being undermined, the backstabber has access to the project materials."
    },
    {
      "title": "Confide in a friend about your suspicions.",
      "content": "Confide in a friend about your suspicions. Don't assume someone is sabotaging you. Ask for a friend's honest opinion, and describe why you are suspicious. Find out if other people think the idea is reasonable, or if you're reading too much into things. Talk to someone you can trust not to gossip, and tell them to keep the conversation private. If you suspect a specific person, talk to someone who knows them but isn't their friend. If you don't have any trusted friends who fit that description, talk to someone who doesn't know them, and describe their specific actions and behavior, not your opinion on their character."
    },
    {
      "title": "Don't become a backstabber yourself.",
      "content": "Don't become a backstabber yourself. You might be tempted to take revenge on your backstabber by hurting them in the same way. Getting sucked into this behavior will likely make the problem worse and make you more upset and emotionally involved. [2] X Research source It also won't do any favors for your reputation, so even if you drive off the backstabber (which is unlikely), you may have the same problem."
    },
    {
      "title": "Stay calm.",
      "content": "Stay calm. Sometimes people do nasty things, and sometimes this results in betrayal. Reacting with outrage won't fix the situation. It is better for you, both now and in the long run, to remain calm and focus on practical matters. Don't ignore the situation, but go about your daily life without obsessing over the outrageous behavior."
    },
    {
      "title": "Encourage the backstabber's good side.",
      "content": "Encourage the backstabber's good side. Being nice to the backstabber is probably the last thing you feel like doing, but if you are calm enough and sincerely agree with some of their points, this could fix the situation. Many passive-aggressive people, backstabbers included, feel they have to use devious and hurtful methods because their direct contributions aren't valued. [3] X Research source [4] X Expert Source Allison Broennimann, PhD Clinical Psychologist Expert Interview. 29 January 2021. Invite them to join you in activities. Do something fun and distracting that will make the backstabber feel welcome again."
    },
    {
      "title": "Ask to speak to the backstabber directly.",
      "content": "Ask to speak to the backstabber directly. Approach the backstabber privately, using text or email if you can't talk to them in person. Politely tell them that you would like to talk about recent occurrences. Set up a private conversation."
    },
    {
      "title": "Honestly describe the situation without making the other person feel threatened.",
      "content": "Honestly describe the situation without making the other person feel threatened. Describe the incidents that have been bothering you, and how they have affected you. Ask the other person to confirm the facts, such as whether they sent a particular text. If you feel like the backstabber is still a friend in some sense, make it very clear that you do not approve of their behavior and that it threatens your friendship. Avoid starting sentences with \"you\", which can make the backstabber feel accused and defensive. [5] X Research source Instead, use sentences like \"I heard there have been some false rumors about me.\" Backstabbers usually don't betray someone just once, their behavior is part of a larger pattern of mistreatment. If someone continues to treat you poorly after you after you have warned them about it, you should seriously consider working the person out of your life if possible."
    },
    {
      "title": "Listen to the other person's story.",
      "content": "Listen to the other person's story. Your friend probably doesn't want to stay mad at you forever. Let them say their side of the story without interrupting or getting angry. It's always possible you were mistaken, or that the situation is more complicated than you thought."
    },
    {
      "title": "Apologize for anything you did wrong.",
      "content": "Apologize for anything you did wrong. Even if you think your friend was mostly at fault, examine the situation from their perspective. Apologize if you misunderstood your friend or accidentally hurt them, even if you were only responsible for one of the many incidents."
    },
    {
      "title": "Forgive your friend when you are ready.",
      "content": "Forgive your friend when you are ready. If you want to rebuild your friendship, you need to forgive each other for your mistakes. Even if you can't repair the relationship, forgiveness can help you move on and stop stressing over the betrayal."
    },
    {
      "title": "Talk about your friendship and any other problems that come up.",
      "content": "Talk about your friendship and any other problems that come up. Be honest and open. Have private conversations whenever you feel like something is wrong. If one of you feels unhappy about specific behavior or repeated patterns in the relationship, let the other person know how you feel."
    },
    {
      "title": "Be willing to change.",
      "content": "Be willing to change. As you tell each other about problems in the relationship, you each need to be prepared to change in order to improve your trust and happiness. You may need to find a different activity if your usual way to spend time together makes your friend uncomfortable. If your friend says something you say often makes them uncomfortable, be aware of it in conversation and try to avoid the nickname, tone of voice, or habit that bothers them. Mistakes will happen, especially when trying to break old habits. Apologize when you make them and forgive when your friend makes them."
    },
    {
      "title": "If all else fails, end the friendship",
      "content": "If all else fails, end the friendship . Sometimes, you can't recover the trust the betrayal cost your friendship. If you've made an honest effort and it's not working out, you'll need to figure out how to move on. At this point, you've probably had at least one conversation about the betrayal and your friendship. If your friend was unwilling to repair the situation, just stop talking to them. If both of you have made an effort to rebuild the friendship, but haven't succeeded, the friend probably already knows why you're upset. Calmly let the friend know that it's not working out, and cut off contact with them. Sometimes, you can let the friendship fade naturally. Invite them to fewer events, and don't pick up the phone every time that friend calls. Ignoring them completely could hurt them, but gradually letting go achieves the same result with less pain."
    },
    {
      "title": "Don't let the coworker interfere with your work.",
      "content": "Don't let the coworker interfere with your work. Focus on the work you can do without the coworker, and don't let your anger get in the way of other work relationships or responsibilities. Don't give anyone else reason to be angry or disappointed in you."
    },
    {
      "title": "Give the backstabbing coworker positive ways to contribute.",
      "content": "Give the backstabbing coworker positive ways to contribute. Most backstabbing coworkers aren't sociopaths, but people who think underhanded tactics are the only way to get ahead. Make an honest effort to recognize the coworker's positive contributions, and encourage those behaviors instead. Making an extra effort to be the better person is always more constructive than stooping to their level. During a meeting or conversation, ask the backstabber for input on topics they know a lot about. Back them up when they make contributions and suggestions you agree with. Only do this when you sincerely agree, and don't go overboard and flatter them. Sometimes you may learn positive things about your backstabber and be able to clear up misconceptions that caused them to backstab you in the first place. Understanding how to resolve conflict is a valuable skill that will last much longer than any obstacle a dishonest person tries to put in your way. If the backstabber treats these gestures rudely, stop and move on to other methods. Some people are not interested in changing their behavior, and there's only a limited amount of effort you can be expected to make."
    },
    {
      "title": "Discuss the situation privately with the backstabber.",
      "content": "Discuss the situation privately with the backstabber. Describe the incidents that have upset you privately, in person or via email. Bring the problem into the open and see if the other person is mature enough to discuss it. Avoid sounding like you're making accusations. Use passive statements such as \"I noticed the project wasn't completed in time\" instead of active statements such as \"You didn't complete the project.\" [6] X Research source"
    },
    {
      "title": "Back up your claims with records.",
      "content": "Back up your claims with records. As described under Protecting Yourself, you should be prepared with detailed information on the incidents that occurred. If the coworker denies these events ever happened, show them the email or other document that proves it did. If the backstabber still denies it, get a witness to confirm."
    },
    {
      "title": "Set up a meeting with a manager if your employment is in jeopardy.",
      "content": "Set up a meeting with a manager if your employment is in jeopardy. If the backstabbing threatens to have serious consequences, and talking to the person responsible was unsuccessful, ask to meet with your manager, or a manager from Human Resources. This is especially true if there are rumors about you violating workplace policy, or committing other actions that are grounds for punishment. Come prepared with as much information as you can. Documents, emails, and anything else that shows concrete evidence of sabotage will help your case. Positive feedback and a record of the work you completed can help put to rest rumors of laziness or unprofessional behavior."
    }
  ]
}