{
  "url": "https://www.wikihow.com/Do-the-Time-Warp",
  "title": "How to Do the Time Warp",
  "steps": [
    {
      "title": "Jump to the left!",
      "content": "Jump to the left! Position your legs close together, with your feet pointed forward or slightly apart. Jump with both feet off the ground, and land a short distance to your left. Keep facing the same direction during this jump. If you want to make the jump more exciting, wiggle your hands in the air as you jump, or bob to the beat after you land."
    },
    {
      "title": "Step to the right (four times)!",
      "content": "Step to the right (four times)! Keep your left foot planted on the ground, and stay facing the same direction during this dance move. Move your right foot way out to the right, then bring your legs back together. Usually, the dancers actually repeat this movement four times, just touching their toes to the ground the first three times. [1] X Research source On the fourth time, plant your foot on the ground, so you're standing with a wide stance. If you like, move your hands out and in again in time with your feet."
    },
    {
      "title": "Put your hands on your hips!",
      "content": "Put your hands on your hips! Throw your hands right over your head. Make an exaggerated wiggling movement back down to your hips."
    },
    {
      "title": "Bring your knees in tight!",
      "content": "Bring your knees in tight! Keep still for a moment, long enough for someone to sing \"bring your knees in–.\" When they would say \"tight,\" rapidly bring your knees toward each other, without moving your feet. Keep your hands on your hips, bending at the hips if you need to to keep your balance. Don't worry too much about the timing of this move while you are practicing. It's easier to get the timing down with the music playing, or when practicing synchronized with other people."
    },
    {
      "title": "Do the pelvic thrust (twice)!",
      "content": "Do the pelvic thrust (twice)! Bring your butt back, then thrust your hips and pelvis suddenly forward. Lean your legs forward and your head and shoulders backward slightly while you thrust, to make it more exaggerated. Repeat this motion a second time. Keep your hands on your hips."
    },
    {
      "title": "Swivel your hips!",
      "content": "Swivel your hips! This isn't part of the song lyrics, but it's still one of the dance motions. Keep your hands on your hips, and rotate your hips and pelvis in a circle. You can do this in one smooth motion, as though you were spinning a hula hoop, or wiggle as you rotate in time to the song's beat. If you're listening to the song, do this motion during the lyrics \"that really drives you insa-a-ane.\""
    },
    {
      "title": "End by jumping back and forth and waving your hands to the beat.",
      "content": "End by jumping back and forth and waving your hands to the beat. Jump in place, turning 90º to the right, so you're facing where your right arm was before. Jump a second time, turning 180º, so you turn completely around and face the opposite direction. Move your arms and legs in and out to the beat as the chorus finishes. If you're listening to the song, time it so the first jump happens during \"Let's do,\" the second jump during \"the Time Warp,\" and the arm motions during \"Again.\" You can come up with your own dance moves for this part of the song, since there are no specific instructions. You could even just wave your arms and jump around during this part."
    },
    {
      "title": "Fall to the ground.",
      "content": "Fall to the ground. At the end of the song, after you've done the Time Warp during all three choruses, fall to the ground dramatically as the music fades. [2] X Research source"
    },
    {
      "title": "Wear a Halloween costume.",
      "content": "Wear a Halloween costume. From zombies to princesses, Halloween costumes fit right in for the Time Warp. The flashier and zanier the better, whether that's piles of pink ruffles and glitter, or skeleton face paint."
    },
    {
      "title": "Dress in glitter and sequins.",
      "content": "Dress in glitter and sequins. One of the dancing characters from the Rocky Horror film version, Columbia, has the flashiest costume of all. Cover yourself in gold or rainbow sequins and glittery makeup to imitate her. Bonus points if you wear a glittery top hat and fishnet stockings, or cover your eyebrows with makeup. [3] X Research source"
    },
    {
      "title": "Dress with one of the simpler costumes from the show.",
      "content": "Dress with one of the simpler costumes from the show. The characters Janet and Brad are the quiet, \"normal\" people caught in a group of strange people, which means their costumes are usually easier to imitate. Dress as Janet by wearing a light pink dress and a white sweater, plus a sun hat. Dress as Brad with \"hipster\" clothing, for instance a tucked-in button-up shirt, khaki pants, and combed-back hair. [4] X Research source"
    },
    {
      "title": "Avoid stripes if you're going to a Rocky Horror show.",
      "content": "Avoid stripes if you're going to a Rocky Horror show. At many performances of the Rocky Horror Picture Show, where the Time Warp dance comes from, people might make fun of you for wearing stripes. This supposedly references a scene in the movie when someone wearing a striped shirt was caught on camera accidentally, but it's a tradition of it's own at this point. [5] X Research source"
    }
  ]
}