{
  "url": "https://www.wikihow.com/Do-Oil-Pulling",
  "title": "How to Do Oil Pulling",
  "steps": [
    {
      "title": "Purchase a variety of cold-pressed organic oil.",
      "content": "Purchase a variety of cold-pressed organic oil. Some oil pullers suggest that sesame oil is the most effective oil for oil pulling, while others prefer the taste and texture of coconut oil. Consider alternating oil varieties every couple of days to get the full benefit of all the oils and see what works best for you. Virgin olive oil and sunflower oil are also commonly used for oil pulling. Avoid canola oil and other varieties processed with additives."
    },
    {
      "title": "Measure out 1 tablespoon (14.8 ml) of the oil first thing in the morning.",
      "content": "Measure out 1 tablespoon (14.8 ml) of the oil first thing in the morning. It's important to do a pulling before you've consumed any food or drink in the day [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source and also before you've brushed your teeth. You'll have the opportunity to clean your mouth out afterward, and it won't take long to complete the routine."
    },
    {
      "title": "Swirl the oil around your mouth for 10-15 minutes.",
      "content": "Swirl the oil around your mouth for 10-15 minutes. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The oil will mix with your saliva and as the oil is swished around the mouth, teeth, gums, and tongue, it is thought to absorb toxins. Usually it will turn somewhat viscous and milky. The health benefits of oil pulling, including whether they absorb toxins, are still being studied and require more evidence to know if it is effective. [3] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source"
    },
    {
      "title": "Spit out the oil and rinse your mouth out thoroughly with warm water.",
      "content": "Spit out the oil and rinse your mouth out thoroughly with warm water. It's important to spit out the oil when it starts to feel thick. This usually takes somewhere between 10 and 15 minutes, and certainly no longer than 20. Spit into the trash can and rinse your mouth thoroughly with warm water, which tends to do a better job getting the oil out than cold. Make sure not to spit it into a sink or toilet, because it may clog the drain."
    },
    {
      "title": "Switch up the variety of oil every couple days.",
      "content": "Switch up the variety of oil every couple days. If you want extra power, try adding other ingredients - some people like a bit of mint or some apple cider vinegar for whitening, although results may vary. If you want to try out different oils to see what works best for you and yields the best results, get as many as you'd like and to try to use a different one each morning for a full week. Keep a fully stocked kitchen with a variety of organic oils and experiment with their benefits and uses. Organic virgin oils like coconut oil aren't always the cheapest thing at the market, but they're incredibly versatile: you can use coconut oil to make your own toothpaste , massage oil , in your hair , and in your next stir-fry."
    },
    {
      "title": "Prepare the oil the night before.",
      "content": "Prepare the oil the night before. Some people are turned off by the concept of making a mouthful of cooking oil the first taste of the morning, but it is important to do before you clean your mouth or consume anything, so make it easy on yourself. Consider measuring out the oil before you go to sleep and leaving it by your bedside, or set out on the bathroom counter top so that you don't have to think about it. Put it in your mouth and start swishing. If you usually keep your toothbrush on the counter, put it away and put a tiny glass of oil in its place. It'll become a habit in no time."
    },
    {
      "title": "Make it part of a light exercise routine.",
      "content": "Make it part of a light exercise routine . If you typically do some calisthenics or light stretching in the morning before breakfast, make oil pulling part of the regimen. Wake up your body and get your day started right. The more you make it part of some routine, the easier it will be to make oil pulling a regular thing in your life. Whatever you typically do in the morning, add oil pulling to the routine. Look over the newspaper briefly while swishing the oil, or read your favorite blog."
    },
    {
      "title": "Help keep your teeth clean with oil.",
      "content": "Help keep your teeth clean with oil. [4] X Expert Source Ritu Thakur, MA Natural Health Care Professional Expert Interview. 13 December 2021. Some studies have shown that regular oil pulling reduces the amount of s. mutans, a common oral bacteria responsible for a variety of oral diseases and a major contributor to tooth decay, plaque, gingivitis, and cavities. The lipids in the oil may help kill bacteria and keep bacteria from sticking to the walls of the mouth. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Vegetable oils can increase saponification, which could account for the cleansing, soap-like texture you may notice when doing an oil pulling. Oil pulling may help gum health. [6] X Expert Source Ritu Thakur, MA Natural Health Care Professional Expert Interview. 13 December 2021."
    },
    {
      "title": "Consider oil pulling to remedy bad breath.",
      "content": "Consider oil pulling to remedy bad breath. Halitosis is caused by bacteria and fungus in the mouth and on the tongue, and using virgin oils regularly to oil pull will reduce these bacteria and fungi, fighting bad breath and contributing to a clean, healthy mouth. If you struggle with bad breath, work oil pulling into your routine. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use oil pullings to contribute to all-around holistic health regimens.",
      "content": "Use oil pullings to contribute to all-around holistic health regimens . Some people attribute oil pulling to the general detoxification of the body and a diversity of positive effects, including reduced hangovers, reduced pain, headache relief, insomnia relief, and other cures. These benefits are not currently supported by studies and should not take the place of any medical treatment. [8] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source"
    }
  ]
}