{
  "url": "https://www.wikihow.com/Cure-Feeling-Like-You%27re-About-to-Faint",
  "title": "How to Stop Feeling Like You’re Going to Pass Out: Prevent Yourself from Fainting",
  "steps": [
    {
      "title": "If you can, lay down.",
      "content": "If you can, lay down. When you feel like you’re about to faint, it’s because there’s not enough blood getting to your brain. Even just a few seconds of this can bring on a fainting spell. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Combat gravity’s effect on your body by laying down and ensuring your blood is not pooling in your core or legs, sending it back to your heart and brain. It’s best to do this on the ground, if possible. That way, if you do faint you don’t run the risk of rolling off the surface you’re on and hurting yourself."
    },
    {
      "title": "If you can’t lay down, sit down with your knees up and put your head between your legs.",
      "content": "If you can’t lay down, sit down with your knees up and put your head between your legs. If you’re not in an open area or you’re in public and can’t lay down, sitting with your head between your knees may be the best thing you can do to get rid of the faintness. You may wish to stay in this position until the dizziness goes away. Again, this is all about redirecting the blood to your head. When it’s lower and on the same plane as the rest of your body, your blood pressure stabilizes, your body relaxes, and the feeling that you’re about to faint dissipates."
    },
    {
      "title": "Drink plenty of fluids to keep hydrated.",
      "content": "Drink plenty of fluids to keep hydrated. If you’re perfectly healthy otherwise, it’s possible that faintness is due to dehydration. Be sure to keep well hydrated by drinking plenty of fluids, especially water. Juices or sport drinks can work, too. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Choose an un caffeinated drink, if possible. Caffeine de hydrates you, defeating the purpose of the drink."
    },
    {
      "title": "Eat something salty.",
      "content": "Eat something salty. Consider eating something with a little salt. Only do this if you have low to normal blood pressure, though, as salt will elevate your blood pressure. Drink water instead, in that case. [4] X Research source If you’re watching your salt intake, go for some unsalted crackers or toast – nothing that runs the risk of making you nauseated. And, of course, avoid salty fried goods like potato chips."
    },
    {
      "title": "Take deep breaths in through your nose and out through your mouth to keep calm and relaxed.",
      "content": "Take deep breaths in through your nose and out through your mouth to keep calm and relaxed. Fainting, or even feeling like you’re about to faint, can be quite stressful. To keep your blood pressure and anxiety down, concentrate on your breathing. It’ll lower your heart rate and relax your body, centering it on the here and now. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Sometimes fainting is the result of being nervous. Do you know someone who faints at the sight of blood or on getting an injection? This is a reaction called the vasovagal reflex. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The vasovagal reflex causes the heart to slow and blood vessels to dilate or widen. As a result, blood pools in the lower body and not as much reaches the brain. It can be triggered by many things, including stress, pain, fear, coughing, holding your breath, or even urinating. You can also feel faint when you change positions. This is called orthostatic hypotension and can happen when you stand up too fast, but also when you get dehydrated or take certain medicines. [7] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Eat regularly.",
      "content": "Eat regularly. Thinking of skipping breakfast? Don’t do it. Your body needs the salt and sugar to keep you standing up. In fact, if you keep your blood pressure and glucose levels stable, barring any other outlying physical condition, syncope (fainting) is hopefully completely avoidable. To keep your body working normally, all you may have to do is eat (and drink) regularly. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source That said, some people do suffer from postprandial hypotension, which can lead to fainting. That’s a fancy word for your blood pressure dropping after you eat too much. Your blood starts congregating in and around your stomach, leaving none for your heart and brain – the perfect recipe for a fainting spell. If this sounds familiar, it might help to eat frequent, low-carbohydrate meals. Eat regularly, but don’t eat too much at one time. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Avoid excess fatigue.",
      "content": "Avoid excess fatigue. Another reason some people experience fainting spells is because they’re overly fatigued. It could be because you’re not sleeping enough or you exercise too much – both states can affect your blood pressure and get your body off-kilter. [10] X Research source If you’re exercising too much, you may not be getting enough liquids either (you’re sweating them all out). Make doubly sure you drink plenty if this describes you. Between dehydration and overexertion, you could be asking for trouble."
    },
    {
      "title": "Keep your stress and anxiety to a minimum.",
      "content": "Keep your stress and anxiety to a minimum. Some people have triggers when it comes to fainting, and it doesn’t take fainting too many times to figure out what that trigger is. If you know what causes you stress and makes you anxious, avoiding it may be all you have to do. [11] X Research source Needles, blood, and even more personal topics can bring about the urge to faint. The heart starts pumping profusely, you start sweating, your breathing changes, and all of a sudden you’re down for the count. Can you think of any possible triggers for the way you’re feeling? [12] X Research source"
    },
    {
      "title": "Stay in comfortable, cool environments.",
      "content": "Stay in comfortable, cool environments. Heat is another culprit when it comes to fainting. It can dehydrate your body, shut down your systems, and spell disaster for vertical consciousness. If you’re in a stuffy, overheated, or crowded room, you may just have to leave. The fresh air will awaken your senses, your blood pressure will rise, and you’ll be back to normal before you know it. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Crowds don't generally help. If you know you're going to be in a crowded, stuffy area, prepare by eating a good breakfast, wearing light clothing, bringing a snack, and always knowing where the nearest exit is should you need it."
    },
    {
      "title": "Avoid alcohol.",
      "content": "Avoid alcohol. In addition to caffeinated beverages, alcohol should also make the “avoid” list if you’re worried about fainting. It, too, is dehydrating, can lower your blood pressure, and send you to the ground. [14] X Trustworthy Source Journals of the American Heart Association Open Access, peer-reviewed journals focusing on cardiovascular and cerebrovascular diseases, as well as related scientific research. Go to source If you do drink alcohol, stick to one drink a day. And if you haven’t eaten or drunk much that day, be sure to combine that drink with some food and other non-alcoholic beverage."
    },
    {
      "title": "Don’t lock your knees.",
      "content": "Don’t lock your knees. If you have ever watched a military event where soldiers stand for long periods, usually one or two end up fainting. It’s not locking the knees as such that causes faintness, but the immobilization of the leg muscles. [15] X Research source You might try a technique called “tilt training,” which involves training your muscles over the course of weeks to combat the urge. You simply stand with your back and head against a wall with your heels about 6 inches (15 cm) out from it. Do this for about 5 minutes every other day. Slowly increase the time up to 20-minute sessions. It sounds simple, but this stance can help uncross the wires in your brain (the vagus nerve) that lead to fainting. [16] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Move slowly.",
      "content": "Move slowly. Some people experience extreme dizziness upon first getting up in the morning – in part because they get up too quickly. This can happen at any time of day, though it’s most notable when getting out of bed or arising after a long period of time. Whenever you move, be sure to move slowly to give your heart and brain time to adjust for a change in blood flow. This is mainly important when switching from sitting, standing, and lying down. Once you’re up and stable you should be fine; it’s getting up and getting stable that needs to be done carefully."
    },
    {
      "title": "Rest for at least an hour or so after fainting.",
      "content": "Rest for at least an hour or so after fainting. Don't exercise or take part in serious movement after a fainting episode. This is your body telling you that you need to take it easy, so listen. Have a snack and lay down. You should feel better shortly. If you don’t feel better within a few hours (provided you’re taking good care of yourself, of course), that may be a sign that this is the symptom of a larger problem. In that case, it is very appropriate to seek medical assistance as soon as possible."
    },
    {
      "title": "Eat and drink something.",
      "content": "Eat and drink something. Drink something to rehydrate and eat a small snack. The nutrients and sugar will give you energy and a small boost. Your body needs it. It’s a good idea to keep a snack with you handy if you’re worried about fainting again."
    },
    {
      "title": "Talk to your doctor.",
      "content": "Talk to your doctor. If you know the cause of your fainting – it was overly hot, you hadn’t eaten, etc. – it’s probably safe to assume this was just an ordinary fainting episode and something that shouldn’t be alarming. However, if you’re not really sure where it came from, don’t hesitate to talk to your doctor. He or she may be able to pinpoint the issue for you and help you avoid health complications in the future. Review your medications with him or her, too. Some medicines are known to cause symptoms of dizziness, fatigue, dehydration, and fainting. If this is the case, your doctor should be able to provide you with a suitable alternative."
    }
  ]
}