{
  "url": "https://www.wikihow.com/Get-Tested-for-HIV",
  "title": "How to Get Tested for HIV",
  "steps": [
    {
      "title": "Ask your primary healthcare provider about getting tested.",
      "content": "Ask your primary healthcare provider about getting tested. It’s recommended that people between ages 13 and 64 get tested for HIV at least once as part of their routine care. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Additionally, you should get tested if you have practiced unprotected sex or shared needles within the last 3 months. [3] X Research source Prokupek, Dale, MD. Personal interview. 16 April 2020. Discuss your risk factors, such as blood transfusions from outside the US or between 1977 and 1985, with your primary doctor and ask how often you should be tested for HIV and other sexually transmitted infections (STI). In general, you should get tested at least once a year if you've had more than 1 sexual partner since your last test, have had unprotected sex, have had sex with an HIV-positive partner or someone who could potentially be infected, are a gay or bisexual man, use intravenous drugs, have contracted another STI, or have exchanged sex for drugs or money. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Additionally, you should get tested if you've had sex with anyone who falls into one of these categories. For instance, a woman who's had sex with a bisexual man since her last HIV test should get tested again. Consider getting tested if you’ve recently been diagnosed with or treated for an STD, hepatitis, or tuberculosis."
    },
    {
      "title": "Search for a local testing center.",
      "content": "Search for a local testing center. If you don’t have a primary doctor or health insurance, you should be able to find a nearby testing center or health clinic that offers free or affordable services. [5] X Research source Prokupek, Dale, MD. Personal interview. 16 April 2020. Try searching online for “free HIV testing center,” along with your country, state, or province. [6] X Research source In a clinical setting, such as a doctor’s office or testing center, you’ll likely have a blood sample collected for testing. Some testing centers also offer rapid oral tests, which generate results in 20 to 40 minutes. In the United States, search for local testing centers at https://gettested.cdc.gov . You can also call 1-800-CDC-INFO (232-4636) or text your ZIP code to KNOW IT (566948). If you live in the European Union, look for local testing centers at https://ecdc.europa.eu/en/test-finder ."
    },
    {
      "title": "Buy a home test kit online or at a local pharmacy.",
      "content": "Buy a home test kit online or at a local pharmacy. There are 2 types of home test kits available. The first involves pricking your finger to collect a blood sample, sending the sample to a laboratory, and calling the lab for results. The second is a rapid oral test that offers at-home results within 20 to 40 minutes. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Look for home test kits approved by your nation’s regulatory agency, such as the U.S. Food and Drug Administration (FDA) or, in Europe, products that bear the European Conformity mark (CE). As of 2018, self-testing isn’t legally available in some nations, such as Canada. However, many countries that formerly banned self-testing have reversed their policies. The United Kingdom, for instance, now offers free home test kits at https://www.test.hiv ."
    },
    {
      "title": "Ask your doctor if they recommend a nucleic acid test (NAT).",
      "content": "Ask your doctor if they recommend a nucleic acid test (NAT). If you suspect you’ve been exposed to HIV, your doctor may order a NAT, which detects the virus itself. A NAT is a blood test that can detect an infection within 1 to 4 weeks after exposure to HIV, which is faster than other tests. [8] X Research source Other tests detect the antigens and antibodies that the body produces in response to HIV. Typically, antibodies don't show up in detectable quantities until 3 to 12 weeks after infection. NATs are expensive and are usually only recommended if it’s likely that a person has recently been exposed to HIV. Examples include having unprotected sex or sharing intravenous needles with an HIV-positive partner."
    },
    {
      "title": "Allow your healthcare provider to collect and test a sample.",
      "content": "Allow your healthcare provider to collect and test a sample. As of 2018, the most common HIV test in the United States detects both antigens antibodies in the blood. Your healthcare provider will draw a blood sample, then send it to a lab for testing. If you’re getting tested as part of your annual physical, your sample will likely be tested for other STI as well. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source There are no side effects, but the area on your arm where blood was drawn might be tender for 1 or 2 days. Results usually take at least 48 hours. In the U.S., if you get tested at your doctor’s office, your results are confidential. This means they’re part of your medical record, but protected by privacy laws. If you're concerned about privacy, some testing centers offer anonymous testing."
    },
    {
      "title": "Use a home oral saliva test for rapid results.",
      "content": "Use a home oral saliva test for rapid results. If you are unable to go to a doctor, you can purchase a saliva testing kit, which will give you results in as little as 15 minutes, from a pharmacy. [10] X Research source Prokupek, Dale, MD. Personal interview. 16 April 2020. Swab your upper and lower gums with the test device, then place the device into the developing solution. The device’s indicator will either show 1 line, which means negative, or 2 lines, which means positive. [11] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Read your product’s instructions carefully, and use it as directed. Home oral test kits do not reliably detect HIV infections until at least 3 months after exposure. Additionally, about 1 in 12 negative results are false negatives. A false negative is when a negative test result is wrong and fails to detect an infection."
    },
    {
      "title": "Choose a home blood test kit for anonymous, more reliable results.",
      "content": "Choose a home blood test kit for anonymous, more reliable results. Blood tests are used to check for HIV antibodies or the presence of the virus in the blood. [12] X Research source Prokupek, Dale, MD. Personal interview. 16 April 2020. To use a home collection kit, prick the tip of your finger with the included device. Typically, you’ll then collect a drop of blood with special paper, place the sample in a container, and send it to a lab for testing. [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Your kit includes a number to call for results, which may be available within 1 business day. No identifying information is tied to the tested sample, so your results are anonymous. Home blood collection kits can reliably detect an infection earlier than home oral tests, but not as early as blood tests drawn from a vein in a clinical setting."
    },
    {
      "title": "Get tested at least once a year if you’re at a higher risk of infection.",
      "content": "Get tested at least once a year if you’re at a higher risk of infection. If your results were negative, regular testing is still wise, especially if you fall into a higher risk group. Additionally, a negative result does not mean it’s okay to engage in risky behaviors, such as unprotected sex or intravenous drug use. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Get tested every 6 to 12 months if you have had more than 1 sexual partner since your last test, have had unprotected sex, are a gay or bisexual man, have been diagnosed with another STI, use intravenous drugs, or have exchanged sex for drugs or money. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You should also get tested if you’ve had sex with anyone who fits into any of these categories, or if you’ve had sex with someone and don’t know their sexual history. Keep in mind test results may not be reliable within 3 months of exposure. This means if someone contracts HIV and gets tested less than 3 months after exposure, it’s possible that their test results will be negative."
    },
    {
      "title": "Verify the results with a follow-up test.",
      "content": "Verify the results with a follow-up test. If you’ve received positive results, the first step is to get a follow-up test. If you received a blood test in a clinical setting, such as your doctor’s office or a testing center, the lab will likely retest the same sample. If you took a rapid oral test, you’ll need to get a follow-up blood test. [16] X Research source An HIV diagnosis requires both a positive initial test and positive follow-up test."
    },
    {
      "title": "Begin treatment as soon as possible.",
      "content": "Begin treatment as soon as possible. If you were tested at your doctor’s office, they’ll work with you to develop a treatment plan. If not, testing centers and home test kit manufacturers offer counseling services that can help you find a healthcare provider. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You’ll need to start antiretroviral therapy (ART) as soon as possible. Side effects may include nausea, diarrhea, flu-like symptoms, trouble sleeping, fatigue and dizziness. Not everyone experiences side effects, and symptoms often subside after a few weeks. With early detection and treatment, it’s possible to achieve undetectable status. A person who’s undetectable has a much lower risk of transmitting HIV to others. Keep in mind low-risk doesn’t mean no risk, and it’s still important to practice safe sex."
    },
    {
      "title": "Get assistance paying for treatment, if necessary.",
      "content": "Get assistance paying for treatment, if necessary. In the U.S., insurers are required to cover HIV medications but, even if you're insured, copays and deductibles can still get expensive. If you need help paying for your medication, there are a number of federal resources and charitable organizations that provide assistance. [18] X Research source Call your state’s toll-free HIV/AIDS hotline, which can put you in touch with local assistance programs: https://hab.hrsa.gov/get-care/state-hivaids-hotlines . Search for care centers in your area at https://locator.aids.gov ."
    },
    {
      "title": "Seek counseling to help cope with the diagnosis.",
      "content": "Seek counseling to help cope with the diagnosis. Being diagnosed with HIV is a life-changing event. A counselor can help you cope with the diagnosis and guide you through the early stages of treatment. Your doctor or testing center can put you in touch with free or affordable counseling services. [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source You can also look for a local support group for people living with HIV/AIDS. Talking to people in similar circumstances can remind you that you’re not alone."
    },
    {
      "title": "Inform your current and former sexual partners.",
      "content": "Inform your current and former sexual partners. Disclosing your status is uncomfortable, but it’s required by law in some locations. Early detection is an essential part of managing HIV, so it’s vital to inform your sexual partners and anyone else at risk of exposure as soon as possible. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you’re nervous about disclosing your status, your doctor or local HIV care center may offer partner notification services. If so, they’ll inform your former sexual or needle-sharing partners without revealing your identity. [21] X Research source If you choose to inform a former or current partner in person, do your best to relax, and try to be matter-of-fact. Say, “This is a difficult subject, but I recently learned that I’m HIV-positive. If you haven’t been tested, you should check your status.”"
    },
    {
      "title": "Practice safe sex and don’t engage in risky behaviors.",
      "content": "Practice safe sex and don’t engage in risky behaviors. To avoid transmitting HIV to others, always use condoms during sex. If your partner is HIV-negative, they should also consider taking PrEP, or pre-exposure prophylaxis. This is a daily medication that lowers the risk of HIV transmission. [22] X Research source While PrEP lowers the risk of HIV transmission, it’s still vital to use condoms during sex. Even if your partner is positive, safe sex practice are still important. It’s possible to contract multiple strains of HIV. Additionally, avoid using intravenous drugs or sharing needles, razors, or other hygiene products that could be exposed to bodily fluids, such as blood or semen. If you use needles for medical purposes, such as to inject insulin or monitor glucose levels, discard used needles a sharps container."
    }
  ]
}