{
  "url": "https://www.wikihow.com/Get-Over-a-Crush-on-Your-Best-Friend",
  "title": "How to Get Over a Friend Crush: What to Say and Do",
  "steps": [
    {
      "title": "\"Date yourself\" for a while to focus on yourself.",
      "content": "\"Date yourself\" for a while to focus on yourself. Bilotta tells us that to get over someone, sometimes you have to “put more value into yourself” first. [1] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Learn to love yourself on a deeper level to focus less on your crush and more on yourself. Think about your goals in life and what's important to you. Explore your strengths and weaknesses as a human being. Knowing yourself better will help you define what you're seeking in a relationship. [2] X Research source Take yourself on a cafe date and spend some time journaling about your hopes, dreams, and desires. Ask yourself questions you’d ask a date. What are you interested in? What do you want out of a relationship?"
    },
    {
      "title": "Take up a new hobby.",
      "content": "Take up a new hobby. Bilotta encourages us not to “sit around and feel bad,” but to get out there and have fun instead! [3] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Exploring your passions and learning something new will give you something else to think about besides your friend. You'll also be able to learn new skills and regain some self-confidence. Join a cooking class, volunteer at a local shelter, learn an instrument , or try out an activity you've always wanted to do. Pick a hobby that requires a lot of time and concentration. You can then use it to escape your mind for a while and focus on something productive. Now is the time to revisit an activity you used to do but for whatever reason let go. Doing something you love again will help you reconnect with your inner self."
    },
    {
      "title": "Spend time with your other friends.",
      "content": "Spend time with your other friends. “Learn how to just be a friend again,” Bilotta advises. [4] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. One way to do that is to just hang out with your other friends. As you develop meaningful relationships with other friends, you'll gain emotional support outside of your best friend. Invite a friend over to chat, see a movie with them, or even send them a text to let them know you care. Just don’t distract yourself constantly with friends. Spending time alone is important, too. If you need some space from others for a while, let yourself have that time. [5] X Research source Also, having a crush on your best friend can cause you to neglect other friendships. Take this chance to get closer to more people."
    },
    {
      "title": "Meet or date other people, when you're ready.",
      "content": "Meet or date other people, when you're ready. “Go out on more dates,” Bilotta says, \"and meet new people.” [6] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Getting your mind off of someone often means getting your mind on someone else. Once you're ready to fall in love again, re-enter the dating scene. You don't have to fall into a serious relationship right away: date a few different people for a while and have fun just getting to know them. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Join a club, volunteer somewhere new, chat with a classmate or co-worker, or visit your local game store, cafe, or bar. Recognize the qualities that you liked in your friend and look for them in others. Understand that you won't find someone exactly like your friend, however. This way, you’ll realize that your friend may not have been the one, and start to understand that eventually you will meet the right person."
    },
    {
      "title": "Spend some time apart for a while.",
      "content": "Spend some time apart for a while. “A little bit of distance can do wonders,” Bilotta tells us, “less contact is key.” [8] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. You might need some time away from this person to work through your feelings. Tell your friend that you need space for a while. While you're spending time away from them, focus on other things, like trying a new hobby or meeting new people. Rebuilding a friendship can take weeks or months. You may not feel \"over\" your crush until you find someone new. Take as much time as you need to process your emotions. Let your friend know why you need space so that they don't feel hurt or confused. Let them know that it isn't their fault and that you still care about them. [9] X Research source"
    },
    {
      "title": "Get off of social media for a little bit.",
      "content": "Get off of social media for a little bit. Again, it’s all about giving your friend—and yourself—some space. [10] X Research source These days, part of that is giving yourself some digital space. Log out of your social media until you feel better, Bilotta suggests. [11] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Or, unfollow, or even block, your friend, so you don’t have to see their posts. Keep in mind that if you block your friend, they may ask for an explanation. It might be better just to log off. Start with one week, then check in on your feelings, and take another week or two if your feelings are still raw."
    },
    {
      "title": "Do things you’re good at to regain your confidence.",
      "content": "Do things you’re good at to regain your confidence. Having an unrequited crush can be hard on your self-esteem. It can make you feel like you won’t find love, or aren’t worthy. Believing in yourself again can help you cope with the pain and cultivate hope in the future. Regain that self-esteem by doing something you know you’re good at, whether it’s art, sports, or even video games. Write down your strengths on a piece of paper to remember when you're feeling low, and set reachable goals every day to remind yourself that you can do hard things. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Low self-esteem can be a sign of depression, which is difficult to cure alone. If you think you may be depressed, tell a loved one or see a counselor."
    },
    {
      "title": "Let yourself laugh.",
      "content": "Let yourself laugh. Humor really can be the best medicine. Comic relief can help you de-stress and keep a light perspective in life. Watch a silly movie, read humorous novels, or visit a local comedy club. At the very least, laughter can distract you when you need time away from your thoughts. [13] X Research source Sometimes people use humor as a coping mechanism in hard times. Make sure that you're not using jokes to repress painful feelings. [14] X Research source"
    },
    {
      "title": "Allow yourself to feel your feelings for a little while.",
      "content": "Allow yourself to feel your feelings for a little while. Facing your feelings is key. Don't bottle up your emotions! Trying to repress feelings often leads to more pain. Rather than ignoring the pain, open yourself up to the full spectrum of emotions. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Grieve for what could have been. Express gratitude that this friend has been in your life. Think of the good and bad times. Whatever emotions come, accept them. If the emotions are too overwhelming, take a break from thinking about your friend. Relax, recharge, and revisit the situation when you're ready. Talk to other friends or someone you trust. Getting your feelings out can keep you from dwelling on the situation. Third parties can also give you an outside perspective. Sometimes a good cry can be cathartic. If you need to cry, find somewhere you're comfortable and let it out."
    },
    {
      "title": "Practice self-care to keep you happy.",
      "content": "Practice self-care to keep you happy. While you have these strong feelings for your friend, you may neglect taking care of yourself. But practicing self-care will help you regain confidence and maintain supportive relationships as you process your emotions. Do activities that strengthen your physical and emotional well-being, and take care of your personal hygiene. [16] X Research source Emotional self-care might include: Reading a book, spending time with a friend, listening to music, getting a massage, or learning something new. [17] X Research source Physical self-care might include: Going for a walk, exercising, getting enough sleep, staying hydrated, or scheduling a medical check-up. [18] X Research source"
    },
    {
      "title": "Express your feelings creatively.",
      "content": "Express your feelings creatively. Getting your feelings out (whether in words, art, or song) will help you collect your thoughts and process all the emotions you might be feeling. You can share your work with others, or you can just keep it for yourself. The important part is expressing yourself fully. If you're not the creative type, start a journal. Seeing your emotions on paper will help you work through them. [19] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Accept that falling out of love takes time.",
      "content": "Accept that falling out of love takes time. “Eventually, you will meet the right person,” Bilotta reminds us. [20] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Getting over a crush takes time as your heart heals. In a way, you might always love and care for this person. What matters is moving past the pain and opening yourself up to loving again, even if not for a while. Don't beat yourself up if you're still pining for this person. You can—and will—find new love in the future. Holding onto feelings like sadness or bitterness only makes you angry, which isn’t fun for anyone. Accept your emotions, but do your best not to cling to the negative ones. [21] X Research source"
    },
    {
      "title": "Talk to a professional to sort through your feelings.",
      "content": "Talk to a professional to sort through your feelings. Sometimes, our own feelings can be confusing and overwhelming, and we don’t know how to sort them out ourselves. In these cases, it’s often best to talk to a therapist or a counselor, who can help you figure out your feelings in a safe, private, and judgment-free environment. [22] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source"
    },
    {
      "title": "Ask yourself if you’re willing to risk the friendship by telling them.",
      "content": "Ask yourself if you’re willing to risk the friendship by telling them. “There's always going to be a risk,” Rosenfeld says. “You have to accept that risk, in my opinion…if you're really going to share that with someone…On the other hand, are you going to sit there just kind of pining after them and not saying anything?” [23] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021. It’s not easy, but being honest with your feelings is often the best course of action. That said, if you do decide to tell them, wait a few weeks. By then, your feelings may have faded. If not, then it might be time to say something. Understand that every friendship changes. If you’re good friends, your friendship will endure this, even if it’s uncomfortable for a while. Also, you never know! Best case scenario, your friend also feels the same way."
    },
    {
      "title": "Tell your friend you have a crush if you need closure.",
      "content": "Tell your friend you have a crush if you need closure. Rosenfeld reminds us that the only way to know how your friend feels is to reveal your own feelings. [24] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021. Letting your friend know how you feel might set you free from emotional pressure and pain. You won't have as many questions about how they feel, whether they reciprocate your feelings, or how to read into moments with them. You won't have to deal with \"what-ifs\" or what could have been because you'll have your closure. Closure is especially important if you want to move on from this crush and feel ready to date other people. Talking to your friend will require vulnerability . This takes courage because you might face disappointment. It's an important communication skill, however, and something you'll need in future relationships. If you don't tell your friend you care for them, they might never know the extent of your feelings. Letting them know can help them understand your friendship and support you, if needed. [25] X Research source Reader Poll: We asked 715 wikiHow readers who've told their friend they like them, and 55% of them agreed that their goal in doing so is to see if there’s a chance for a romantic relationship. [Take Poll] You’ll never know how your friend feels if you don’t tell them, and even if they don’t share your feelings, you’ll get the closure you need to move on."
    },
    {
      "title": "Reveal how you feel if your friend asks why things are different.",
      "content": "Reveal how you feel if your friend asks why things are different. If you just distance yourself from your friend with no explanation, they might feel hurt. “Talk it out with them so no one is left feeling awkward,” Bilotta suggests. [26] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Otherwise, your friend might worry that they did something wrong or that you don't care for them anymore, which isn’t true, and also isn’t fair to them. Opening up about your feelings can get rid of miscommunication. Being vulnerable about feelings is important. If you can't express your emotions, you and your friend may not feel connected or safe around each other, even when you’re not crushing on them. Check out these dating tips from wikiHow users on the \"Help, I have a crush on my best friend!\" forum page."
    },
    {
      "title": "Reconsider telling your friend if one of you is in a relationship.",
      "content": "Reconsider telling your friend if one of you is in a relationship. When you or your friend is dating another person, things are a little more complicated. Telling them you like them could bring conflicting emotions into the friendship and introduce distance. [27] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source If you’re the one in a relationship, word might get around to your partner. It might be best to hold your tongue until the existing relationship runs its course. Don't tell them immediately after they break up with their significant other. This will come off as callous and unsympathetic. Give them time to heal. Sometimes, though, it’s still worth it to open up. Your relationship as their friend might be just as important as their relationship with their partner, and honest communication is always a positive thing."
    },
    {
      "title": "Find out if your friend is okay with same-sex relationships if that’s the case.",
      "content": "Find out if your friend is okay with same-sex relationships if that’s the case. When your best friend is someone of the same gender as you, it adds another layer to the situation. Before you confess your feelings, you might want to find out how they feel about LGBT+ people, since it’ll probably affect their reaction. [28] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source For example, bring up a famous LGBT+ person and see how your friend reacts. If your friend is open-minded, then you may want to come out to them first, as a next step, before you confess your feelings."
    },
    {
      "title": "Talk about your feelings in person.",
      "content": "Talk about your feelings in person. If you're nervous, you might be tempted to reveal your feelings over text or online messaging. But having serious conversations is much better in person, and Rosenfeld recommends face-to-face. [29] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021. Being able to see and hear the other person will leave less room for miscommunication. You'll see each other's body language and be able to respond immediately. Try a few deep breathing exercises before you have the conversation to get rid of nerves. Write out your feelings before you tell them, if you feel overwhelmed. This will give you an outlet and help you express your emotions in a healthy way. Invite them out to do someone you usually enjoy together, so that you’re both comfortable and in a familiar head space."
    },
    {
      "title": "Let them know how deeply you care about them.",
      "content": "Let them know how deeply you care about them. Rosenfeld suggests reminding yourself, and your friend, how strong your relationship is and how much you care. [30] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021. Sometimes when people reveal romantic feelings, the recipient may worry that you're only interested in dating them. If they don't reciprocate the feeling, they might wonder if you're still interested in a friendship. Make it clear that you appreciate your relationship with them regardless of their response. How you tell your friend about your crush may determine their reaction. For example, if you tell them that you care about them, they react sympathetically. If you only make it seem like you want to date, they may react defensively. Say, “I love and appreciate you no matter what our relationship looks like, but I need to tell you how I feel.”"
    },
    {
      "title": "Speak honestly and from the heart.",
      "content": "Speak honestly and from the heart. If you’re going to tell them, there’s no point in holding back. An honest, open conversation shows how much you care, but also gives them the opportunity to be open and honest themself. Talking it out is the best practice, Bilotta reminds us. [31] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Stay cool and calm , but speak plainly and let it out. You might say something like: “No pressure to feel any sort of way about it, but I think I want to be more than friends.” “You don’t have to say anything, but I need to tell you about my feelings.” “I don’t have any expectations, but I want us to be on the same page so we can stay friends, no matter what our relationship looks like.”"
    },
    {
      "title": "Accept their reaction, no matter what.",
      "content": "Accept their reaction, no matter what. If they say they reciprocate your feelings, you might feel anxious and unsure what to do next. If they say they don't, you might feel crushed. Their emotions are as valid as yours, and it is important for you to respect them. “Don’t make a big deal of it,” Bilotta says. [32] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Don't argue with them or react angrily if their response isn't what you hoped for. Thank them for being honest, and distance yourself if you need time alone. However, even if you need less contact than before, don't ghost your friend and disappear completely. Try remembering how important the friendship was to you before you developed the crush. Hurt, grief, and pain are all part of grieving. Don't suppress your emotions or feel ashamed. It's all part of the healing process. If your feelings cause significant distress and you're unable to move on, you may be dealing with depression. Talk to a psychologist or therapist ."
    },
    {
      "title": "Avoid getting stuck in your fantasies.",
      "content": "Avoid getting stuck in your fantasies. Your crush might linger if you daydream about what could be, but holding onto your fantasies will only lead to more pain. Accept the reality of the situation and your feelings of attraction equally. Gradually avoid thinking about what your relationship would be like if it could only work out. [33] X Research source Don't dwell on the past or worry about the future. If you find yourself fantasizing, ground yourself in the present. List something you see, taste, hear, touch, and feel. Instead of building up a fantasy life, work on yourself. Set goals in your work or hobbies, spend time with loved ones, and work on self-improvement to love the life you have."
    },
    {
      "title": "Appreciate your friendship for what you have.",
      "content": "Appreciate your friendship for what you have. Your friendship with this person can still be meaningful, even if you can't pursue a romantic relationship with them. Think about all the good times you've had with this person and the positive qualities they have. Have gratitude that this person is in your life and that you've had the opportunity to know them. [34] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source You don't have to stop being friends, but spending time with just this person can cause you to dwell more on your feelings. Spend time with other friends, too, to balance your social life. Ask yourself: Even though you can’t date them, would you rather they not be in your life at all? This can help you find the silver lining."
    },
    {
      "title": "Set boundaries about the relationship.",
      "content": "Set boundaries about the relationship. If you want to fall out of love with your crush, set boundaries for yourself and your friend to avoid sparking old flames . You might avoid extended physical contact with your friend, stop flirting with them, or steer away from intimate conversations for a while. Share the boundaries with your friend (if you're comfortable) so they know to avoid those situations. [35] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might tell your friend to hold off on cuddling or hugging, even if they just mean it in a platonic way. On the flip side, you may have to hold yourself back from hugging or holding them. Let them know why you are doing this so they don't feel hurt or abandoned."
    },
    {
      "title": "Understand that friendships can be as rewarding as romances.",
      "content": "Understand that friendships can be as rewarding as romances. Just because you’re not dating your friend doesn’t mean that the relationship isn’t important, meaningful, or cherished. Friendships can be even more meaningful than relationships! And sometimes, the lines can blur, and it won’t even matter. [36] X Research source Instead of being sad you can’t date, ask yourself how to make the most of being friends, rather than being “just friends.” For example, hanging out can be just as fun and engaging as going on a date. You don’t have to be partners to say things like, “I love you!”"
    },
    {
      "title": "Distract yourself with other relationships until the feeling clears up.",
      "content": "Distract yourself with other relationships until the feeling clears up. Bilotta says the best thing you can do is to get out into the world and make new experiences. [37] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Not only will it distract you from your feelings, but you’ll learn more about yourself, and you might find something—or someone—that grabs your attention, other than your crush. Get involved in clubs, classes, or sports teams. Try dating other people. Even if it’s just casually, you might find someone that clicks with you more. Focus on your hobbies and passions. Invest time in yourself rather than worrying about another person."
    },
    {
      "title": "Have an honest conversation with your friend, if the feeling lasts.",
      "content": "Have an honest conversation with your friend, if the feeling lasts. Bilotta also tells us that talking it out is sometimes the best medicine. [38] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. If you’re always wondering what would have happened, this wound may never heal completely. And if you’re true friends, you’ll find a way through this situation, even if your friend doesn’t feel the same way about you. Do it in private, and in person, so you can have an honest, face-to-face discussion. Make is casual and low-stakes. Make sure your friend knows that their answer doesn’t have to change the friendship. Respect your friend’s answer. They can’t control how they feel, same as how you can’t control how you feel."
    }
  ]
}