{
  "url": "https://www.wikihow.com/End-a-Rebound-Relationship",
  "title": "How to End a Rebound Relationship",
  "steps": [
    {
      "title": "If you’re not over your ex, you’re probably not ready for a relationship.",
      "content": "If you’re not over your ex, you’re probably not ready for a relationship. Rebounds happen, but they aren’t super fair to your new partner. Try to be honest with yourself and recognize that staying single might be the best thing for you right now. [1] X Research source You might know that you aren’t over your ex if you can’t stop thinking about them or you’re comparing your new partner to your old relationship. If you aren’t 100% sure about what you need to do yet, consider talking it through with a friend first."
    },
    {
      "title": "Don’t drag it out for the sake of your new partner.",
      "content": "Don’t drag it out for the sake of your new partner. As soon as you realize you want to break up with them, sit them down for a talk. If they know that you held on out of pity for them, they’ll probably feel even worse. [2] X Research source Breaking up can be scary, and it’s never fun for anyone. However, out of respect for your partner, you should try to do it quickly."
    },
    {
      "title": "Avoid breaking the news over text or a phone call.",
      "content": "Avoid breaking the news over text or a phone call. Head to your partner’s house and ask to talk with them privately. That way, you can leave after you two have talked it out to give your ex some space. [3] X Research source It’s better to break up in a private place than a public one. You and your soon-to-be-ex will probably both express some emotions, and that can be tough to do when you’re surrounded by other people. You can start the conversation by saying, “Hey, could we sit down and talk for a minute?” Note: If there was absolutely no genuine intimacy and the two of you didn't really get to know each other, this is the only case when it's okay to have a break up that isn't in person. Reader Poll: We asked 949 wikiHow readers about how they’d prefer to end a very casual or short-term relationship, and 64% agreed that it’s okay to end these types of romantic connections over text or phone. [Take Poll]"
    },
    {
      "title": "Let them know that you’re not ready to be in a relationship.",
      "content": "Let them know that you’re not ready to be in a relationship. Assure your partner that it’s not anything that they did, but you just aren’t ready to date after your breakup. Try not to compare them to your ex or make them feel like the relationship didn’t mean anything. [4] X Research source You might say something like, “I jumped back into dating too quickly, and I realized I’m not ready for it yet. This has nothing to do with you and everything to do with my own feelings.” Alternatively, you could say, “I really enjoy your company, I just don’t see this relationship going anywhere. I don't want to waste your time.”"
    },
    {
      "title": "Let them know that it’s your fault the relationship is ending.",
      "content": "Let them know that it’s your fault the relationship is ending. You don’t have to beat yourself up about it, but you can tell your ex-partner that you’re the reason you two won’t work out. That way, they might feel slightly better about themselves. [5] X Research source For instance, you might say, “It’s my fault for trying to be in a relationship so quickly after my last one. I should have given myself more time.” If you want to, you could even apologize to soften the blow a bit. Try something like, “I’m sorry if I led you on at all, because that wasn’t my intention.”"
    },
    {
      "title": "They might want to know more about why this is happening.",
      "content": "They might want to know more about why this is happening. [6] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 10 September 2021. Try to answer their questions as best you can, and reassure them that the breakup isn’t their fault. They might get a little teary or upset, but you should try to stick around just in case they need anything else from you. [7] X Research source They might ask about your old relationship, if you’re going to date again soon, or if you two can get back together one day. You might want to have some answers prepared ahead of time!"
    },
    {
      "title": "It will probably hurt their feelings.",
      "content": "It will probably hurt their feelings. If you are planning to pursue your ex again, keep it private and don’t let the person you’re breaking up with know. They could feel like you were just using them as a placeholder until you got back with the person you actually wanted to be with. [8] X Research source If they ask you directly about going back to your ex, say something like, “That’s not the reason I’m breaking up with you.”"
    },
    {
      "title": "Vague language can give your ex false hope.",
      "content": "Vague language can give your ex false hope. [9] X Expert Source Kate Dreyfus Holistic Love Coach & Intuitive Healer Expert Interview. 10 September 2021. Don’t leave the door open for a potential romance in the future. Tell them that you’re ending the relationship to work on yourself, and that they should try to move on and find someone new. [10] X Research source They might try to hang onto hope that you'll reconnect after you’ve recovered from your old breakup. If you know that's not in the cards, be sure to say that as plainly as possible."
    },
    {
      "title": "A clean break helps the other person heal and move on faster.",
      "content": "A clean break helps the other person heal and move on faster. You two can stay friendly and say hello if you bump into each other, but don’t reach out or initiate any contact with them. Let them move on from you on their own terms, and don’t stay in their life to remind them of your breakup. [11] X Research source If they want to be friends with you, you can hang out with them again after some time. Just make sure you’re clear about keeping things platonic, and don’t lead them on."
    }
  ]
}