{
  "url": "https://www.wikihow.com/Fix-a-Slow-Toilet",
  "title": "Solutions for a Slow Flushing Toilet (+ How to Find the Problem)",
  "steps": [
    {
      "title": "Find the source of the problem.",
      "content": "Find the source of the problem. “Slow toilet” can mean one of two things. Either the bowl isn’t filling quickly, or it isn’t draining quickly. If you’re dealing with the latter, the drain is likely clogged. You’ll need to unclog the toilet . If the bowl isn’t filling quickly enough, it could be an issue with the tank, like a low water level ."
    },
    {
      "title": "Lift the tank cover.",
      "content": "Lift the tank cover. The tank is the upright portion of the toilet, where you find the flushing handle. Lay the tank cover on the floor carefully; the heavy porcelain can potentially damage your floors."
    },
    {
      "title": "Check the chain connecting the flushing handle to the flapper.",
      "content": "Check the chain connecting the flushing handle to the flapper. The flapper is a piece of plastic or rubber which sits over the valve at the bottom of the tank. Unless your toilet isn’t flushing at all, there should be a chain connecting this to the trip lever, a small arm running from the flushing handle. [1] X Research source The chain should have just enough slack for the flapper to rest over the valve, sealing it. But it should be tight enough to lift the flapper when the flushing handle is used. When you flush the toilet, the flapper should stay open for 2-3 seconds. Otherwise, the bowl won't be getting enough water."
    },
    {
      "title": "Adjust the chain if needed.",
      "content": "Adjust the chain if needed. Performing this adjustment is rather simple. The chain should run through a hole in the flushing handle. You can easily disconnect the chain, and place a different link through the hole to adjust the chain’s overall length. The chain should be left with about half an inch of slack. Adjusting the chain means you may come into contact with the water in the toilet’s tank. As long as you wash your hands afterwards, this is perfectly safe."
    },
    {
      "title": "Pour a gallon of hot water into the toilet.",
      "content": "Pour a gallon of hot water into the toilet. Use a bucket to pour the water into the bowl. The hot water will help dislodge the residue that might be slowing the flow of water out of the bowl. [2] X Research source Let the hot water sit in the toilet, don’t flush it. Warning, heating porcelain quickly or unevenly may crack the bowl."
    },
    {
      "title": "Pour drain cleaner into the toilet.",
      "content": "Pour drain cleaner into the toilet. Make sure to use a product suitable for a toilet. The product you choose should have instructions detailing the amount you should be using. Make sure to read the label carefully. Some products aren’t meant for use on ceramics, and may require that you use protective equipment. Always follow the instructions listed on the product. Some drain cleaner may require immediate flushing, whereas others need time to work before being flushed."
    },
    {
      "title": "Put dishwashing liquid in the overflow pipe.",
      "content": "Put dishwashing liquid in the overflow pipe. You can find this upright pipe in the toilet’s tank. It will usually have a small tube running into it. [3] X Research source You should put a small amount of dishwashing liquid in, only about a tablespoon. If you have a lime or calcium remover, like CLR, you can use that instead of liquid dish soap. It may be more effective."
    },
    {
      "title": "Let the toilet sit for 10 minutes.",
      "content": "Let the toilet sit for 10 minutes. This will give the dishwashing liquid time to seep down the overflow pipe. Additionally, the calcium and other deposits will slowly dislodge from the toilet’s walls, making for an easy clean."
    },
    {
      "title": "Flush the toilet.",
      "content": "Flush the toilet. This will send water through the tank’s pipes, and out through the holes below the toilet rim. The dishwashing liquid will dislodge any residue in the tank. The drain cleaner will remove any clogs or mineral deposits in the drain, improving the toilet’s flow. [4] X Research source"
    },
    {
      "title": "Take the necessary safety precautions.",
      "content": "Take the necessary safety precautions. Make sure to wear gloves, mask and eye protection. You should also wear an apron and rubber boots to protect yourself. Muriatic acid is caustic and can cause burns. You should maximize ventilation by placing a running fan in the bathroom window to exhaust air. If you have a bathroom exhaust fan, turn that on too."
    },
    {
      "title": "Turn off the water",
      "content": "Turn off the water to the toilet and flush. Use a sponge to remove the water left in bowl. This will ensure the acid will clean the bowl to the bottom, including the critical jet-hole. This is a smaller hole at the bottom of the toilet bowl; water is pushed out of it forcefully to help the toilet flush. You’ll see it in action at the end of a flush, and buildup here may be responsible for a slow flush."
    },
    {
      "title": "Take off the tank cover and insert a plastic funnel into the overflow tube.",
      "content": "Take off the tank cover and insert a plastic funnel into the overflow tube. If there is a fill tube on top of the overflow tube, carefully take that off first. The funnel’s opening should be as large as possible, to facilitate pouring, but fit snugly in the overflow tube. Make sure not to use a metal funnel; the acid will corrode it. Rinse the funnel well after use and do not reuse it for food."
    },
    {
      "title": "Carefully pour diluted muriatic acid through the funnel.",
      "content": "Carefully pour diluted muriatic acid through the funnel. You should only pour a few ounces of diluted acid into the tube. You should pour fast enough that it begins to flow out of the holes in the toilet bowl rim but not so fast that the funnel overflows or falls out, as this would splash acid and be extremely dangerous. Pour the rest of the gallon into the toilet bowl; this will help clear the drain."
    },
    {
      "title": "Tape a clear piece of poly-film over the toilet bowl and tank opening.",
      "content": "Tape a clear piece of poly-film over the toilet bowl and tank opening. The tighter the seal the better. Just cover the bowl portion, do not include the seat. This will keep the acid’s fumes from filling the bathroom. Alternatively you can use a clear trash bag to cover the toilet bowl."
    },
    {
      "title": "Let the acid sit in the toilet for 24 hours.",
      "content": "Let the acid sit in the toilet for 24 hours. If there are children or pets in your home, make sure the door to the bathroom is closed and locked. The acid will dislodge mineral deposits in the toilet bowl and the drain over time."
    },
    {
      "title": "Remove the poly-film and flush a few times.",
      "content": "Remove the poly-film and flush a few times. You’ll have to make sure to turn on the water first. Extra flushes are advisable in older homes with iron drain pipes, as prolonged contact with concentrated acid will damage them."
    },
    {
      "title": "Check the rim holes for proper flow.",
      "content": "Check the rim holes for proper flow. You can find these holes under the toilet rim. They propel water to fill the bowl whenever you flush. Make sure that water flows freely from these holes whenever you flush. You can also use a coat hanger to check the holes for obstructions and other build ups. If you see any build up under the rim, use a baby bottle brush to scrub it off. Repeat the procedure if necessary."
    }
  ]
}