{
  "url": "https://www.wikihow.com/Delete-Apps-on-Mac-That-Won%27t-Delete",
  "title": "How to Delete Apps on Mac That Won't Delete: Simple Fixes",
  "steps": [
    {
      "title": "Click the Launchpad.",
      "content": "Click the Launchpad. This is the icon with multicolored squares on your dock. This method will work on apps installed through the App Store . If you're trying to uninstall an app from another source, use the Finder ."
    },
    {
      "title": "Click and hold the app you want to delete.",
      "content": "Click and hold the app you want to delete. Similar to deleting apps on an iPhone, the icon will start to shake."
    },
    {
      "title": "Click x.",
      "content": "Click x . This will be at the corner of the app. The app will be deleted."
    },
    {
      "title": "Open the Finder.",
      "content": "Open the Finder. You can find this on the Dock. [1] X Research source If you can't find the x button to delete an app, then you've likely downloaded it from somewhere other than the App Store. You can use the Finder to delete apps downloaded from another source. Make sure the app is closed before you try to delete it. You can't delete apps that are required on your Mac, such as Mail, Music, Books, etc."
    },
    {
      "title": "Locate the app you want to delete.",
      "content": "Locate the app you want to delete. You can find most apps in your Applications folder, unless you specified a different save location."
    },
    {
      "title": "Drag the app to the Trash.",
      "content": "Drag the app to the Trash. You can also select the app and click File > Delete or press Command + Delete on your keyboard. You may be asked to verify the administrator account name and password to do so."
    },
    {
      "title": "Click Finder.",
      "content": "Click Finder . This is in the top menu bar."
    },
    {
      "title": "Select Empty Trash.",
      "content": "Select Empty Trash . The app will be deleted."
    },
    {
      "title": "Open the Terminal.",
      "content": "Open the Terminal. Click the Launchpad icon and type \"terminal\". Click the app to open it. You can also find the Terminal in the Finder > Applications > Utilities ."
    },
    {
      "title": "Type sudo uninstall file:// and press ⏎ Return.",
      "content": "Type sudo uninstall file:// and press ⏎ Return . The command will run."
    },
    {
      "title": "Drag and drop the app icon into the Terminal.",
      "content": "Drag and drop the app icon into the Terminal. This will add the app's path."
    },
    {
      "title": "Press ⏎ Return.",
      "content": "Press ⏎ Return . The code will run."
    },
    {
      "title": "Enter your admin password.",
      "content": "Enter your admin password. Once your credentials are entered, the Terminal will remove the app."
    },
    {
      "title": "Check for an Uninstaller.",
      "content": "Check for an Uninstaller. If you downloaded your app from another website, you may find an Uninstaller in the app's folder. Locate the folder, and then run the Uninstaller. [2] X Research source The Uninstaller will remove all files associated with the app."
    },
    {
      "title": "Make sure the app is fully closed.",
      "content": "Make sure the app is fully closed. If the app is open in the background, you won't be able to delete or uninstall the app. You can use the Force Quit window to confirm it's closed. [3] X Research source Click the Apple menu and select Force Quit . If you see your app open, click it, and then click Force Quit ."
    },
    {
      "title": "Restart your Mac.",
      "content": "Restart your Mac. If you can't delete the app, a simple restart could help. Once restarted, try the methods again."
    }
  ]
}