{
  "url": "https://www.wikihow.com/Familial-Ties-Meaning",
  "title": "What Does “Familial Ties” Mean?",
  "steps": [
    {
      "title": "Familial ties are the bonds or connections between family members.",
      "content": "Familial ties are the bonds or connections between family members. Also known as family ties or blood ties, familial ties are the relationships between multiple members of a family. It’s an umbrella term (usually used in a legal context) to describe how you’re connected to relatives. [1] X Research source For instance, when someone marries into a family, they gain familial ties with a mother-in-law, father-in-law, etc. To break it down even further, “familial” relates to families. [2] X Research source Meanwhile, “tie” describes a connection between 2 things. [3] X Research source"
    },
    {
      "title": "",
      "content": "Historically, houses were divided by familial ties. Back in the day, familial ties determined the highest social classes. She allegedly has familial ties with him. Maybe it’s her brother. To gain custody, you must declare your familial ties with the minor. I have familial ties with them on my father’s side, but we don’t really talk."
    },
    {
      "title": "Blood relatives refer to people you're biologically tied to.",
      "content": "Blood relatives refer to people you're biologically tied to. In other words, people you’re related to by birth. This includes your biological parents, siblings, grandparents, and biological children. [4] X Research source"
    },
    {
      "title": "Legally recognized family is bound by contract.",
      "content": "Legally recognized family is bound by contract. These family members aren’t biologically related to you, but they’re members of your family through marriage or adoption. In other words, the state recognizes them as family members because of legal papers. [5] X Research source For example, a sister-in-law is a legally recognized family member because she became your sister when you married her sibling."
    },
    {
      "title": "De facto relationships connect 2 people who live together.",
      "content": "De facto relationships connect 2 people who live together. In some states, 2 people who live together as a couple (whether of the same or opposite sex) but aren’t married can have legally recognized familial ties. To be recognized, the couple must: [6] X Research source Be of a certain age (this depends on the state). Have a long-term relationship."
    }
  ]
}