{
  "url": "https://www.wikihow.com/Dance-at-a-Middle-School-Dance",
  "title": "How to Dance at a Middle School Dance",
  "steps": [
    {
      "title": "Approach who you want to dance with and just ask if they can dance with you.",
      "content": "Approach who you want to dance with and just ask if they can dance with you. Many slow dance songs will require a dance partner, which may be a little nerve-wracking the first time through. All you have to do is ask “Want to dance with me?” Anything more is often unnecessary. [1] X Research source If the other person accepts your offer to dance, choose whatever open spot on the floor is available. If someone declines your offer to dance, don’t push as to why. Simply say “Okay” or “No problem” and move on. There may be multiple reasons why that person does not want to dance, and plenty of other people are available. If you’re a girl, it’s accepted practice for girls to ask guys to dance with them. In fact, you may be surprised how many guys prefer it! [2] X Research source"
    },
    {
      "title": "Place your hands on your slow dancing partner.",
      "content": "Place your hands on your slow dancing partner. While there are some slow dances that have you simply holding hands, these songs are usually seen as “old-fashioned.” Nowadays, where you put your hands depends on your dance partner’s gender. Girls often place their arms around their dance partner’s shoulders or hang their arms around the partner’s neck. Boys should place hands on their dance partner’s waist or around their back. If you are dancing with someone who is the same gender or nonbinary, it will depend on who places their hands first. The second dancer will follow the first’s lead."
    },
    {
      "title": "Mind the distance between you and your partner when dancing.",
      "content": "Mind the distance between you and your partner when dancing. If you are not sure how far or close you should be with your dance partner, the best thing to do is ask them early on. A simple “Is this okay?” will be fine and can help save you some embarrassment. Take a moment to look down at where your partner’s feet are. You won’t have to move much when slow dancing, so not stepping on anyone’s toes will be simple. Different schools have different ideas about what is “ok” in terms of distance between dance partners. If you’re not sure about your school, look at how other dancers are spacing themselves apart."
    },
    {
      "title": "Thank your dance partner after the song finishes.",
      "content": "Thank your dance partner after the song finishes. It is common practice to thank your dance partner for the chance to spend time with them. Again, don’t think too much about what to say, a simple “That was fun” or “Thanks for dancing with me” will suffice. While it’s not taboo to ask the same person to dance to another song, it’s best not to do so right away. Until then, try dancing with other people."
    },
    {
      "title": "Keep things simple during your first dance.",
      "content": "Keep things simple during your first dance. If this is your first time dancing, don’t try out complicated moves you might have seen in a music video. No one is expecting you to do so, and many of your classmates are probably thinking too much about how they look themselves. [3] X Research source Try to blend in by mimicking your classmates’ movements. Most DJs at your middle school dance will probably play simple, high energy songs with an identifiable rhythm. If a song comes up that has a certain dance associated with it, don’t panic! Take a step back and watch the specific motions your classmates perform. If it seems like too much at once, there’s nothing wrong with sitting it out."
    },
    {
      "title": "Warm up to dancing with the two-step.",
      "content": "Warm up to dancing with the two-step. The two-step is one of the most basic moves in dancing. You will probably see your classmates do the two-step without even knowing what it is. For most people, the two-step is enough dancing to get by. [4] X Research source Move your right leg to the right, and then have your left leg move until it meets the right leg. Then, repeat the motion in reverse with the left leg. Move your legs to the rhythm of the music. To switch things up, you can try the triangle two-step, where your foot moves back to form a triangle, then moves forward to its original position. Repeat with the other leg, again to the rhythm of the song."
    },
    {
      "title": "Plant your feet and focus on rhythm with the bounce.",
      "content": "Plant your feet and focus on rhythm with the bounce. If the dance floor is a little crowded - or you just don’t want to step on anyone’s toes - you can keep dancing with the bounce. The bounce is easier than the two-step, all you have to do is bob your body to the beat. Once you get used to the bounce, you can mix it up by changing how intense the bounce is, how much you sway your arms, and bobbing your head a bit more."
    },
    {
      "title": "Move your arms back and forth to the beat.",
      "content": "Move your arms back and forth to the beat. Many new dancers are not sure what to do with their arms even if they have the rhythm down. One easy rule to follow is always keeping one arm raised up, with the other raised down. At every beat, your arms should switch position. If your left arm is up and your right is down, move your right arm up at the next beat while dropping your left. Make sure your arms are separated from your body! You don’t want to keep them too close to your chest, otherwise you’ll look stiff."
    },
    {
      "title": "Avoid showing off if you already know how to dance.",
      "content": "Avoid showing off if you already know how to dance. While it may feel great to pull off a flip in front of everyone, many of your classmates can feel intimidated when you steal the spotlight. As an experienced dancer, you have the opportunity to encourage others to dance with you. It may be tempting to correct your classmates on-the-spot, but doing so is more likely to discourage them. Compliments towards others' dancing can make for a more fun night for everyone."
    },
    {
      "title": "Dance with your friend group.",
      "content": "Dance with your friend group. A lot of people at the middle school dance will want to try dancing with someone they like, but don’t count your friend group out! Sometimes, getting on the floor with your friends is enough for a fun night. Be aware of your surroundings, and be courteous to other people. Don't spread out so much that others don't have room to dance."
    },
    {
      "title": "Take breaks from dancing when you feel tired.",
      "content": "Take breaks from dancing when you feel tired. Your school dance will probably last several hours, and you don’t want to exhaust yourself early on. Make sure to give yourself some rest between dances so you can keep up the energy. Hydration is most important when it comes to taking care of yourself. Your school should have tables nearby where you can get glasses of water for free. [5] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source If you need a break from being around people, ask a chaperone where you can go outside and breathe some fresh air. Sometimes a little alone time is all you need to get back into the groove!"
    },
    {
      "title": "Don’t worry about feeling judged when you are dancing.",
      "content": "Don’t worry about feeling judged when you are dancing. It warrants repeating that almost everyone in the room is going to be just as nervous as you are during the school dance. If other people see you dance, they are often more inclined to join in when they see how much fun it is! [6] X Research source On the rare chance that someone is causing trouble during the school dance, inform a chaperone immediately. It is likely they are bothering other people as well. Be confident in yourself and don't let others get you down. If you catch yourself thinking negatively, replace those negative thoughts with positive ones. [7] X Expert Source Yolanda Thomas Dance Instructor Expert Interview. 15 November 2019."
    },
    {
      "title": "Choose a dress or uniform that is comfortable for you.",
      "content": "Choose a dress or uniform that is comfortable for you. Even if the middle school dance is themed as formal or semi-formal, you want to make sure you pick an outfit that you are comfortable moving in. The fanciest dress or tuxedo won’t mean much when it feels too stiff or heavy. Girls who are preparing for a formal event can choose form fitting dresses, sundresses, maxi-skirts, and skirts with matching shoes. Take care that the uniform is not too revealing, as the middle school dance chaperone may stop you from entering. Boys who want to look formal can wear slacks, dress pants and dress shoes. Make sure the outfit isn’t too tight and that the shoes are not constricting, otherwise your feet will get sore quickly. If the dress code is casual, both boys and girls can get by with a simple shirt and jean combo with comfortable footwear like loafers, sneakers, or boat shoes. Don’t feel as if you are trapped with your gender when it comes to clothing. If the school allows it, girls can wear tuxedos and boys can wear skirts if doing so feels better."
    },
    {
      "title": "Avoid graphic tees, open-toed shoes, and clothes that show too much skin.",
      "content": "Avoid graphic tees, open-toed shoes, and clothes that show too much skin. There are certain outfits or clothes that are simply not allowed or advisable regardless of the dance rules. For example, if you wear open-toed shoes, someone may accidentally step on your toes, which will hurt! If you really want to wear a graphic tee, make sure it's not offensive. If you won't wear it to school, then don't wear it to the dance. Many dances have a dress code. Double-check with your school to find out what it is."
    },
    {
      "title": "Style your hair to complete your look.",
      "content": "Style your hair to complete your look. Looking nice isn’t just about wearing the right clothes - your hair plays a large role as well. Taking the time to wash, condition, and style your hair can help boost your confidence at the dance. If you have short hair, style it with some pomade while it is still damp, just after you finish your shower. If you have longer hair, choose a style that can tuck your hair into a bun so you have more freedom moving around."
    }
  ]
}