{
  "url": "https://www.wikihow.com/Create-a-Mailing-List-for-Blogger",
  "title": "How to Create a Mailing List for Blogger",
  "steps": [
    {
      "title": "Set your Google Groups account.",
      "content": "Set your Google Groups account. You must have a be logged in to a Google account account to do this. You can sign up for a Google account free. Once set up, make a note of the address you will use to send e-mail to your group."
    },
    {
      "title": "Add people to your group.",
      "content": "Add people to your group. Click on the \"Members\" tab on the side and \"+ invite new members\". Now you can either invite members by e-mail, or add members directly. Write a quick note to explain why they are receiving this e-mail."
    },
    {
      "title": "Set your blog to send e-mail to your new Google Group.",
      "content": "Set your blog to send e-mail to your new Google Group. In your Blogger Dashboard click on \"Settings\" and then \"Email\". In Blog Send Address enter the e-mail address for your Google Group. Alternatively, you can also just manually send an e-mail to your Google Group from your normal e-mail address whenever you update your blog."
    },
    {
      "title": "Create a Subscribe box for your blog for new users to subscribe to updates.",
      "content": "Create a Subscribe box for your blog for new users to subscribe to updates. Back on your Google Group homepage, click on \"Tune your group's settings\" at the bottom. Now click on \"Get a promotion box for your website\". Scroll down to the \"Subscribe box for your web page\". Copy the HTML code below this to the clipboard. Now go back to your Blogger Dashboard (in a different tab/window) and click on \"Layout\". Click on \"Add a Page Element\" (the sidebar one will be best). Select the \"HTML/JavaScript\" option. Now paste in the HTML code you copied earlier. Click \"Save Changes\" and take a look at your blog! You'll see a subscription signup option on the sidebar of your blog."
    },
    {
      "title": "Repeat the steps above to edit or remove your subscription box from the sidebar.",
      "content": "Repeat the steps above to edit or remove your subscription box from the sidebar."
    }
  ]
}