{
  "url": "https://www.wikihow.com/Find-out-if-Your-Crush-Likes-Someone-Else",
  "title": "How to Tell if Your Crush Likes Someone Else (Plus, How to Move On)",
  "steps": [
    {
      "title": "Your crush may be more moody when you spend time together.",
      "content": "Your crush may be more moody when you spend time together. If you and your crush talk often or hang out in or outside of school , pay attention to changes in their attitude. If they used to be friendly and playful but suddenly start acting distant and moody, it’s possible that they are having conflicting feelings. [1] X Research source If this is happening, try not to get super clingy. Give your crush a little bit of space so they can figure out how they feel. It could be a good time to evaluate your feelings, too."
    },
    {
      "title": "They may act more distant when they see you in person.",
      "content": "They may act more distant when they see you in person. If you see your crush regularly, you may notice that they start to greet you differently. They may no longer say “hi” to you in the hallway or wait to walk to class with you. If these were previously normal interactions with your crush and they start to change or diminish, your crush may have feelings for someone else. [2] X Research source Being ignored outright is often a sign that your crush doesn’t feel the same way about you anymore, especially if they’ve started to treat someone else more affectionately."
    },
    {
      "title": "Pay attention to canceled plans as a sign your crush is into someone else.",
      "content": "Pay attention to canceled plans as a sign your crush is into someone else. If you and your crush are friends and hang out regularly, pick up on times when they bail on plans or ditch you. This is a pretty good sign that there might be something or someone else they are hoping to spend time with. [3] X Research source Similarly, if your crush suddenly becomes hard to pin down or avoids making plans with you, it could be a sign of a similar situation."
    },
    {
      "title": "Your crush may respond to your messages more slowly.",
      "content": "Your crush may respond to your messages more slowly. When a person likes someone, they’ll typically respond to texts and other messages quickly. [4] X Research source If you’re used to quick responses and frequent messages with your crush and these messages suddenly slow down or stop, they may like someone else. It’s possible that something else is going on, but if this change is consistent for several weeks, it might be because they are busy messaging someone else. Try asking them directly if everything is okay. Maybe they’re having a hard time or are overwhelmed with school or work. If this is the case, they may not be texting someone else."
    },
    {
      "title": "Your crush may frequently name-drop someone in your conversations.",
      "content": "Your crush may frequently name-drop someone in your conversations. If your crush is continually talking about a new person, they may be attracted to or interested in them. If the same name keeps creeping up every time you interact, pay attention—this could be the sign you’re looking for. [5] X Research source Your crush may not even realize they’re doing this. Think about how many times you’ve mentioned your crush to your friends in passing before you realized you were talking about them so much."
    },
    {
      "title": "Check your crush’s social media to see what they’re up to.",
      "content": "Check your crush’s social media to see what they’re up to. While you shouldn’t stalk their page repeatedly, taking a glance at your crush’s social media can tell you a lot about who they’re talking to and where they’re going. You might be able to see who they’ve become friends with recently or if they’re liking a lot of posts from a particular person. [6] X Research source To avoid torturing yourself, put a limit on how often you’ll look at their social media, like once a day instead of once every hour."
    },
    {
      "title": "Listen to rumors you hear about your crush and their love life.",
      "content": "Listen to rumors you hear about your crush and their love life. Rumors aren’t always true or good sources of information, so take them with a grain of salt. However, if the source is a trustworthy person, you may be able to find out who your crush likes. Just be sure you don’t help spread any false information. For example, if you hear from three different people that your crush was holding hands with someone at the movies, it’s probably true and a sign that they are into someone else."
    },
    {
      "title": "Get input from your friends about the situation.",
      "content": "Get input from your friends about the situation. Your friends may be able to see your situation with your crush more clearly than you can. Ask them for their opinion on whether they think your crush likes you or someone else, and see if they’ll keep an eye on your crush so they can clue you in to what’s going on. If you do this, there’s always a chance you might get news you don’t want. It’s okay to be upset, but don’t get mad at your friend."
    },
    {
      "title": "Discreetly talk to your crush’s friends to see what they know.",
      "content": "Discreetly talk to your crush’s friends to see what they know. This works best if you know your crush’s friends and can have a conversation with them without it seeming too weird. Keep in mind that this person may tell your crush that you were asking about them, but it could also give you some important insider information. [7] X Research source For example, you might say something like, “Hey, Ryan, I noticed that Jade has been spending a lot of time with Ben. Is there something going on there?”"
    },
    {
      "title": "Directly ask your crush if they like someone.",
      "content": "Directly ask your crush if they like someone. This can be a little risky, but if you feel like your crush has their eye on someone else, you may want to know for sure so you can move on with your own life. Try to phrase the question in a non-confrontational way and make it seem like you’re just generally curious about it. [8] X Research source For example, you could say something like, “Hey, Max, I was wondering if you were interested in Kylie. I noticed you guys have been spending a lot of time together.” If they ask why you want to know, say, “Oh, I was just curious.”"
    },
    {
      "title": "See if your crush’s eyes follow a certain person.",
      "content": "See if your crush’s eyes follow a certain person. One of the key ways to find out who your crush is, well, crushing on is to figure out who they’re paying attention to. If you’re in class, at an event, or out with friends, take a peek to see who your crush is watching. If they’re consistently gazing at a specific individual, that could be a sign that they’re developing a crush of their own. [9] X Research source"
    },
    {
      "title": "Observe who they sit by or start conversations with.",
      "content": "Observe who they sit by or start conversations with. When you have a crush, you’re often drawn to them and end up in the same space so you can be close to them. Watch your crush—are they moving desks to sit by someone else during class or switching tables at lunchtime? Do they go out of their way to talk to a specific person? If so, there’s a good chance they like them. [10] X Research source"
    },
    {
      "title": "Notice if your crush gets nervous or excited around a specific person.",
      "content": "Notice if your crush gets nervous or excited around a specific person. When you see your crush interacting with the same person often, pay attention to how they act. Are they nervous? Do they get a little hyper? Do they blush or fumble their words? These are all signs that your crush may be experiencing some romantic feelings of their own. [11] X Research source Think about how you feel or act when you see or talk to your crush or how you know someone has a crush on you. You can often apply those same principles to your crush to figure out how they’re feeling."
    },
    {
      "title": "Check out how much time they’re on their phone.",
      "content": "Check out how much time they’re on their phone. Of course, there are lots of reasons why someone might be spending a lot of time on their phone. However, if your crush is texting all the time and is constantly checking their phone for notifications, they’re probably talking to someone they like. [12] X Research source Pay attention to how your crush reacts when their friends ask them what they’re doing or who they’re talking to. If they get defensive or start acting embarrassed, chances are they’re talking to someone they’re developing feelings for."
    },
    {
      "title": "Pay attention to changes in your crush’s personal style.",
      "content": "Pay attention to changes in your crush’s personal style. When someone likes someone else, it’s common for them to start dressing or acting in a way they think that person will like. For example, if you notice that your crush has suddenly started wearing band T-shirts and dyeing their hair, perhaps they’ve started to spend time with an avid concert-goer. They may also simply start putting more effort into their appearance in general to impress the person they like. [13] X Research source Keep in mind that people experiment with their look all the time, so this might not be a sure-fire sign that they have a crush on someone else. But, if it pairs up with some other signals, it could be true."
    },
    {
      "title": "Don’t blame yourself or think you’re not good enough.",
      "content": "Don’t blame yourself or think you’re not good enough. If you find out your crush likes someone else, don’t beat yourself up! Steer clear of negative self-talk and instead focus on the things you love about yourself. Just because this person doesn’t like you romantically doesn’t mean you’re not worthy of being liked—it just isn’t working out in this particular situation. [14] X Research source Think of it this way: odds are, you don’t like everyone who likes you, either. This doesn’t mean you think those people are unworthy of love. You just don’t personally connect with them, and that’s okay."
    },
    {
      "title": "Remember that your crush is allowed to be with other people.",
      "content": "Remember that your crush is allowed to be with other people. To keep yourself from being bitter, avoid villainizing the person your crush chose to be with. Instead, work on accepting the fact that your crush doesn’t like you . They’re their own person who can make their own choices. It might hurt at first, but remember that it’ll be okay in the end. [15] X Research source Remember, you shouldn’t want to be with someone who doesn’t want to be with you, too. Dating coach John Keegan says, “When someone doesn’t like you back, [decide] to stop being attracted to them. Make [your mind] up quickly instead of longing after them [or] chasing them.” [16] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019."
    },
    {
      "title": "Let yourself feel sad, but only temporarily.",
      "content": "Let yourself feel sad, but only temporarily. In order to truly get over someone, it’s important to first allow yourself to feel your emotions. When you first find out your crush likes someone else, it’s okay to cry. Listen to sad music, write in your journal, and do whatever you need to feel better. Give yourself a set amount of time to feel sad, then start working on getting over your crush. [17] X Research source"
    },
    {
      "title": "Give yourself time and space to get over your crush.",
      "content": "Give yourself time and space to get over your crush. Odds are, your feelings won’t go away overnight. Even if you’re friends with this person, it might be healthy to put a little space between you. Seeing them regularly may remind you of your feelings and prevent you from getting over your crush and moving forward with your life. Consider hanging out with other people, sitting somewhere else at lunch, or blocking them on social media—at least temporarily. [18] X Research source Take some time to readjust your expectations for this person. If you were friends before, think about their role in your life. Maybe you can still be friends, just not as close as you used to be. When someone you like likes someone else, matchmaker Courtney Quinlan says, “It’s probably best to accept it and move on…. Let them go date that other person and see how it goes rather than being clingy and stalkerish and holding onto a dream.” [19] X Expert Source Courtney Quinlan Matchmaker & Dating Coach Expert Interview. 27 August 2021."
    },
    {
      "title": "Focus on yourself, your friends, and the things you enjoy.",
      "content": "Focus on yourself, your friends, and the things you enjoy. Try your best to get out of your head and focus on living your life while you try to get over your crush. It can be really hard, and you may feel like hibernating for a few weeks while you nurse your heartache, but take this time to invest in your friendships, practice some self-care , and enjoy your hobbies . [20] X Research source It’s totally okay to be sad and let yourself feel your emotions. Just try not to dwell in that sadness for too long."
    },
    {
      "title": "Confide in a friend to talk about your feelings.",
      "content": "Confide in a friend to talk about your feelings. Sometimes, simply verbalizing what you’ve been feeling can help you heal and make those feelings less intense. Ask a trusted friend if you can talk to them about something, and then just let it all out. Even if they already knew about your crush, letting your feelings out might help you feel better. [21] X Research source Try to talk about other things, too, so your friend doesn’t feel stressed trying to help you out. Remember to ask how they’re doing, as well."
    },
    {
      "title": "Allow yourself to like someone else (or no one at all).",
      "content": "Allow yourself to like someone else (or no one at all). Instead of pining over your crush for weeks or months, give yourself permission to be attracted to other people. This way, you may find someone who likes you and gives you the attention you deserve! Or, if you want a break from romance, it’s okay to focus on yourself and steer clear of crushes for a while. [22] X Research source Remember that there are other things in your life, like your friends, family, and hobbies, that can help make you feel fulfilled. If you want to focus on other things right now, that is perfectly fine! When attempting to get over someone, Keegan suggests telling yourself something like, “There’s seven billion people. I’m sure I can be attracted to someone else [and] find a new crush.” [23] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019."
    },
    {
      "title": "They want to be around you.",
      "content": "They want to be around you. When someone likes you, you may notice that they’re constantly near you. They may go out of their way to sit next to you or walk with you, or they may seem to pop up out of nowhere. They’ll also find excuses to talk to you, like asking about the homework for a class you share. [24] X Research source"
    },
    {
      "title": "They make a lot of eye contact.",
      "content": "They make a lot of eye contact. Pay attention to how often someone looks at you. Making a lot of eye contact is often a sign that someone has a crush on you because it’s intimate and shows that they’re paying attention to you. Similarly, you may catch them staring at you a lot, even if they look away once you see them. [25] X Research source"
    },
    {
      "title": "They mirror you.",
      "content": "They mirror you. If someone likes you, they’ll subconsciously start mirroring your behaviors. They may mimic your posture or movements during a face-to-face conversation, or they might pick up on your use of emojis when you’re texting . Mirroring is a subconscious way to show interest and build connection with someone. [26] X Research source Dating coach Cher Gopman says, “Body language is key here. If someone is interested in you, they’re going to lean in and be engaged [in the conversation].” [27] X Expert Source Cher Gopman Relationship Coach Expert Interview. 17 May 2019."
    },
    {
      "title": "They remember small details about you.",
      "content": "They remember small details about you. When someone has a crush on you , they’ll be very interested in your life. They’ll ask about your hobbies and friends and remember the details in future conversations. This shows that they’re truly interested in getting to know you. [28] X Research source"
    },
    {
      "title": "They look for excuses to touch you.",
      "content": "They look for excuses to touch you. Pay attention to how often the person touches you when you’re together. They may touch your arm during a conversation, brush your back or shoulder when walking past you, or go in for a hug more frequently. Initiating physical contact is a common sign someone likes someone. [29] X Research source"
    }
  ]
}