{
  "url": "https://www.wikihow.com/Cut-an-Onion",
  "title": "How to Cut an Onion: Slicing, Chopping, & More",
  "steps": [
    {
      "title": "Slice an onion in half lengthwise.",
      "content": "Slice an onion in half lengthwise. Stand an onion on its root end. Use a sharp knife to cut it from the top, stem end down towards the root. You will be left with two halves, each containing half of a root and half of a stem. [1] X Research source Use this technique if your recipe calls for any of the following: \"French-cut,\" \"julienned,\" \"thinly-sliced,\" or \"thin-cut.\" [2] X Research source"
    },
    {
      "title": "Cut away the stem end.",
      "content": "Cut away the stem end. Do not cut away the root end. It will give you something to grip onto and help hold the onion together as you cut it. [3] X Research source"
    },
    {
      "title": "Peel away the papery skin.",
      "content": "Peel away the papery skin. Some onions have several layers of this thin, papery skin. Keep peeling until you reach the thicker, moist, tender skin."
    },
    {
      "title": "Cut the onion into thin slices.",
      "content": "Cut the onion into thin slices. Take one of the onion halves, and set it down on the cutting board, like a dome. Begin cutting at one end and finish cutting at the other. You can cut the onion widthwise or lengthwise. How thick or thin you cut the slices is up to you, but something between ⅛ and ¼-inch (0.32 and 0.64-centimeter) thick would be idea. Cutting an onion widthwise, or against the grain, will give it a sharper taste. [4] X Research source Cutting an onion lengthwise, or with the grain, will give it a milder flavor. [5] X Research source"
    },
    {
      "title": "Repeat the process for the other half, then separate the pieces.",
      "content": "Repeat the process for the other half, then separate the pieces. If you cut your onion lengthwise or with the grain, the pieces may still be attached to the root end. In this case, hold the onion by the sides, then slice off the root end. [6] X Research source Use your fingers to pull apart the pieces. Find the root ends, then discard them."
    },
    {
      "title": "Slice an onion in half vertically.",
      "content": "Slice an onion in half vertically. Stand an onion down on its root end. Pick up a sharp knife, and slice it down the middle, from top to bottom. Pull apart the two halves. Each half should have a root at one end, and a stem at the other. Chopping, dicing, and mincing all requires the same technique; the differences is only in how small you cut the pieces."
    },
    {
      "title": "Trim the stem away.",
      "content": "Trim the stem away. Place one of the onion halves down so that it looks like a dome. Slice off the stem end and discard it. Leave the root end intact. Repeat this step for the other onion half."
    },
    {
      "title": "Peel the skin away.",
      "content": "Peel the skin away. Some onions have several layers of thin, papery skin. Keep peeling until you reach the thicker, moister skin underneath."
    },
    {
      "title": "Slice the onion lengthwise.",
      "content": "Slice the onion lengthwise. Push the tip of the knife into the root end and slice downwards towards the stem end. Work your way from one side of the onion to the other. Hold the onion by the root end, and avoid cutting through it. [7] X Research source Here is how thick you should cut the pieces based on different cooking terms: [8] X Research source \"Minced\": cut it into ⅛-inch (0.32-centimeter) thick slices. \"Finely-chopped or diced\": cut it into ¼-inch (0.64-centimeter) thick slices. \"Medium-cut\": cut it into ½-inch (1.27-centimeter) thick slices. \"Coarsely-chopped\": cut it into ¾-inch (1.91-centimeter) thick slices."
    },
    {
      "title": "Slice the onion in half widthwise.",
      "content": "Slice the onion in half widthwise. Cut straight across the cuts you made in the previous step. Start at the cut, stem end, and work your way towards the root end. The closer together you make the slices, the smaller the pieces will be. [9] X Research source Cut your widthwise slices the same thickness as you did your lengthwise slices."
    },
    {
      "title": "Chop the onion widthwise.",
      "content": "Chop the onion widthwise. Cut the onion from the top down, just like you did for the lengthwise cuts. This will cause the pieces to detach from the root, so start at the edge and work your way towards the root. When you’re done, you’ll have a thinly cut onion!"
    },
    {
      "title": "Repeat the process for the other half.",
      "content": "Repeat the process for the other half. Chop, mince, or dice up the other onion half. When you're done, use your fingers to pull apart and separate the pieces. You should end up with lots of tiny chunks of onion. Find the root pieces, and discard them."
    },
    {
      "title": "Cut a ¼-inch (0.64-centimeter) thick slice from the side of an onion.",
      "content": "Cut a ¼-inch (0.64-centimeter) thick slice from the side of an onion. Set the onion down on its side, with the root and tapered ends sticking out to the sides. Use a sharp knife to slice off one of the curved sides by ¼-inch (0.64-centimeter). [10] X Research source Do not cut off the root or tapered end just yet."
    },
    {
      "title": "Peel off the papery skin.",
      "content": "Peel off the papery skin. Use your fingers of a knife to pry the dry, papery outer layer from the onion. Grab it from the side you just cut, and pull it away. You may have to peel away several layers."
    },
    {
      "title": "Set the onion down onto the side you just cut.",
      "content": "Set the onion down onto the side you just cut. This will help keep the onion steady and prevent it from rolling around as you cut. The root and tapered ends should still be sticking out to the sides. [11] X Research source"
    },
    {
      "title": "Place your non-dominant hand on the tapered end of the onion.",
      "content": "Place your non-dominant hand on the tapered end of the onion. Leave the stubby, root-end exposed. You will be cutting from this end first."
    },
    {
      "title": "Slice the onion into rings, from one end to the other.",
      "content": "Slice the onion into rings, from one end to the other. Begin slicing the onion at the root end, and finish slicing at the tapered end. [12] X Research source Make sure that the knife is very sharp. You can slice the onion as thick or as thin as you want to. Something between ⅛ and ¼ inch (0.32 and 0.64 centimeters) would be ideal. Thicker slices are great for frying, while medium ones are ideal for burgers. Slice the onion as thin as possible if you are making a salad."
    },
    {
      "title": "Discard the ends and pull apart the rings.",
      "content": "Discard the ends and pull apart the rings. Once you have finished slicing the onion, discard the root and tapered ends. Use your fingers to gently pop the rings out of each other."
    },
    {
      "title": "Trim off both ends of the onion.",
      "content": "Trim off both ends of the onion. In most cases, you will want to leave the root end on the onion. When you are cutting an onion into chunks, however, you want to cut off both the root end and the stem end. [13] X Research source This method is ideal for roasting and grilling onions. [14] X Research source"
    },
    {
      "title": "Cut the onion in half, lengthwise.",
      "content": "Cut the onion in half, lengthwise. Stand the onion up on one of its cut ends. Use a very sharp knife to slice it in half, from top to bottom."
    },
    {
      "title": "Peel away the outer skin.",
      "content": "Peel away the outer skin. Most onions will have 1 to 2 layers of thin, papery skin; some may have more. Use your fingers to peel this skin away. You are ready for the next step once you reach the moist, tender skin underneath."
    },
    {
      "title": "Cut the onion in half again lengthwise.",
      "content": "Cut the onion in half again lengthwise. Take one of the onion halves and set it down so that it looks like a dome. Cut it in half from one cut end to the other. Cut the onion further into wedges, if required. Continue cutting the onion lengthwise, but this time at an angle. [15] X Research source"
    },
    {
      "title": "Cut the onion in half horizontally.",
      "content": "Cut the onion in half horizontally. Hold the onion by the curved side edges. Rotate it so that the cut root/stem ends are pointing up and down. Cut the onion in half horizontally. [16] X Research source"
    },
    {
      "title": "Cut the onion in half, then separate the layers, if desired.",
      "content": "Cut the onion in half, then separate the layers, if desired. How much you separate the layers is up to you. If you are roasting the onion, you might want to separate all of the layers into individual flakes. If you are making kabobs, you might want to keep the pieces about two layers thick instead. You can also leave the onion quarters/wedges as they are, and roast them."
    }
  ]
}