{
  "url": "https://www.wikihow.com/Cook-Sweetbreads",
  "title": "How to Prep and Cook Sweetbreads",
  "steps": [
    {
      "title": "Soak the sweetbreads in cold water or milk for at least 8 hours.",
      "content": "Soak the sweetbreads in cold water or milk for at least 8 hours. Place the raw sweetbreads in a bowl and pour 2 cups (470 mL) of milk or water over them. Then, cover the bowl with plastic wrap or a paper towel and place it in the refrigerator overnight. [2] X Research source Soaking your sweetbreads removes any impurities and blood in the tissues. Use milk or buttermilk to mellow out the gamey taste that sweetbreads, like all organ meats, can have. Buttermilk gives your sweetbreads a slightly sweeter flavor that works well with \"southern-fried\" recipes. [3] X Research source Some chefs recommend soaking the sweetbreads for as long as 24 hours to ensure that they’re clean and firm. If you're soaking your sweetbreads in water, change the water 2-3 times to keep it fresh. [4] X Research source"
    },
    {
      "title": "Place the sweetbreads in a large pot and add water.",
      "content": "Place the sweetbreads in a large pot and add water. Carefully remove the soaked sweetbreads from the water or milk with your hands and put them in a large pot. Then, fill the pot with 1 gallon (3.8 L) of water, leaving at least 2 inches (5.1 cm) of headspace. [5] X Research source You don’t need to rinse or dry the sweetbreads before putting them in the pot. Because sweetbreads are delicate, don't use tongs or any other utensil at this stage—you want to handle them as gently as possible."
    },
    {
      "title": "Add salt and vinegar to the water.",
      "content": "Add salt and vinegar to the water. Put 2 tablespoons (30 mL) of salt and 1 cup (240 mL) of distilled white vinegar into the water with the sweetbreads. Stir the water gently with a wooden spoon to distribute the salt and vinegar. [6] X Research source Sweetbreads can be very delicate, so be careful! If you stir too vigorously, you might break them apart."
    },
    {
      "title": "Bring the water to a boil and simmer for 10 minutes.",
      "content": "Bring the water to a boil and simmer for 10 minutes. Set the pot on a burner and turn the heat up to medium-high. Once the water is boiling, lower the heat until the water is simmering. Let the sweetbreads sit in the simmering water for 10 minutes. [7] X Research source As you’re waiting for the water to boil, fill a large bowl with ice and water and set it to the side."
    },
    {
      "title": "Move your sweetbreads to the ice bath.",
      "content": "Move your sweetbreads to the ice bath. Carefully pull your sweetbreads out of the water with tongs and place them in the ice water. This concludes the \"blanching\" process and cools your sweetbreads quickly so the heat doesn't continue to cook them. Let them sit for 5 minutes to cool, then lay them out on a paper towel. [8] X Research source Even though your sweetbreads will be a bit firmer than they were before, they're still pretty delicate. Don't squeeze them too tightly with the tongs—use just enough pressure to hold them firmly."
    },
    {
      "title": "Peel off the membrane and pick away any gristly bits.",
      "content": "Peel off the membrane and pick away any gristly bits. After the ice bath, the outer membrane is relatively easy to peel away from the meat. Gently pick away any veins or gristle that you see as well—you don't want to eat those. [9] X Research source"
    },
    {
      "title": "Tear blanched sweetbreads into 1.5 in (3.8 cm) cubes for kebabs.",
      "content": "Tear blanched sweetbreads into 1.5 in (3.8 cm) cubes for kebabs. If you're planning on grilling your sweetbreads, smaller pieces are easier to work with. Try to make them roughly the same size and shape so they'll cook evenly on your skewers. [10] X Research source"
    },
    {
      "title": "Press the sweetbreads if you want them to be uniform.",
      "content": "Press the sweetbreads if you want them to be uniform. Lay a damp kitchen towel on a baking sheet, then arrange the sweetbreads in rows on top. Put another damp kitchen towel on top of them, then cap them off with another baking sheet. Add some weight on top (a couple of cans of vegetables work nicely) and refrigerate the sweetbreads for anywhere from 2-24 hours. [11] X Research source The longer you press your sweetbreads, the firmer they'll be. Pressing sweetbreads is optional, but it gives all of your sweetbreads a uniform shape and texture. Think in terms of the difference between chicken nuggets and chicken tenders—pressed sweetbreads are more like nuggets."
    },
    {
      "title": "Pour 1 in (2.5 cm) of oil into a skillet and heat to 350 °F (177 °C).",
      "content": "Pour 1 in (2.5 cm) of oil into a skillet and heat to 350 °F (177 °C). Use a medium-sized skillet and an oil with a high smoking point and mild taste, such as vegetable oil or canola oil. Turn the heat to medium-high and check the temperature of the oil with a candy or oil thermometer after 5-7 minutes on the burner. [12] X Research source If you don't have a thermometer, just use a wooden spoon! Set the end of the handle into the oil. When the oil is hot enough for frying, it will bubble around the handle. Check the temperature of the oil periodically while frying to make sure it stays hot enough."
    },
    {
      "title": "Mix flour and seasoning in a bowl for the breading.",
      "content": "Mix flour and seasoning in a bowl for the breading. Pour 1.5 cups (350 mL) of all-purpose flour into a medium-sized mixing bowl, then add seasoning to taste. Try 1 tablespoon (15 mL) of paprika, 2 teaspoons (9.9 mL) of garlic powder, and 1.5 teaspoons (7.4 mL) of onion powder. A pinch of cayenne pepper is also delicious. Stir the seasoning into the flour with a fork until well combined. [13] X Research source For crispier breading, add 1 cup (240 mL) of bread crumbs. If you have a breading recipe for fried chicken, you might want to try that instead. The mild flavor of sweetbreads is similar to chicken so the same spices work well."
    },
    {
      "title": "Beat 2 eggs in a bowl to create an egg wash.",
      "content": "Beat 2 eggs in a bowl to create an egg wash. Whisk the eggs until your egg wash is a consistent yellow color. You'll dip your sweetbreads in the egg wash before dipping them in the flour, so the flour will stick to the sweetbreads. [14] X Research source For a more southern-fried flavor, soak your blanched sweetbreads in buttermilk for about 10 minutes, then dredge them in the seasoned flour. [15] X Research source"
    },
    {
      "title": "Roll your sweetbreads in the seasoned flour and dip in egg wash.",
      "content": "Roll your sweetbreads in the seasoned flour and dip in egg wash. Hold each sweetbread up to let the excess egg drip off, then roll it in seasoned flour. If you previously dipped your sweetbreads in buttermilk, you can skip the egg wash. [16] X Research source If your oil's ready, put your sweetbreads straight from the flour into the oil. Otherwise, let them sit on a plate. Looking to cut some calories? Skip the breading and egg wash and drop your sweetbreads straight into the oil to sauté them."
    },
    {
      "title": "Fry your sweetbreads for about 3-5 minutes until golden brown.",
      "content": "Fry your sweetbreads for about 3-5 minutes until golden brown. Turn the sweetbreads periodically so they cook evenly. Fry 3-4 pieces at a time, depending on the size of your pan, so they're not crowded together. Place finished sweetbreads on a paper towel to absorb the excess oil. [17] X Research source"
    },
    {
      "title": "Let the sweetbreads cool for 5 minutes, then serve with dipping sauce.",
      "content": "Let the sweetbreads cool for 5 minutes, then serve with dipping sauce. Since sweetbreads have a mild taste, they're very versatile and pair well with many different sauces. Here are some delicious options: [18] X Research source Try an aioli if you want a creamy sauce that complements the mild flavor of the sweetbreads. If something sweet and spicy is more to your liking, you could whip up an easy honey mustard. Make a Madeira sauce for a more traditional European dish. [19] X Research source"
    },
    {
      "title": "Prep a charcoal or gas grill for cooking on medium-hot heat.",
      "content": "Prep a charcoal or gas grill for cooking on medium-hot heat. For your charcoal grill, simply open the vents on the bottom of the grill and light the charcoal. When the charcoal turns grayish-white, hold your hand 5 inches (13 cm) above the grill rack. The grill is medium-hot if you can hold your hand there for 3-4 seconds before you pull it away. [20] X Research source For a gas grill, preheat your burners on high for 10 minutes, then lower to medium-high. [21] X Research source While you're heating up your grill, soak your wooden skewers in warm water. That'll keep the skewers from burning while they're on the grill."
    },
    {
      "title": "Toss the sweetbread pieces with oil in a bowl.",
      "content": "Toss the sweetbread pieces with oil in a bowl. Place your pieces of blanched sweetbreads in a large bowl and drizzle with 2 tablespoons (30 mL) of extra virgin olive oil. Mix them around with your hands until all of the pieces are thoroughly covered in oil. [22] X Research source For an Argentinian take, season your sweetbreads with salt and lemon or lime juice and place them directly on the grill whole. [23] X Research source"
    },
    {
      "title": "Thread the pieces onto skewers to grill.",
      "content": "Thread the pieces onto skewers to grill. You can usually fit about 5 pieces on a skewer, depending on how closely you push them together. You might also alternate sweetbreads with vegetables. Sprinkle with salt, pepper, or any other seasonings you might like. [24] X Research source"
    },
    {
      "title": "Grill kebabs for 5-7 minutes on a lightly-oiled grill rack.",
      "content": "Grill kebabs for 5-7 minutes on a lightly-oiled grill rack. Turn the kebabs occasionally and cook until all sides are golden-brown. Then, take them off and put them on a platter. Cover them in aluminum foil and give them about 5 minutes to cool before serving them. [25] X Research source Cover the grill only if you're using a gas grill. To make sure the sweetbreads are done, cut a piece open—if it's a milky white color throughout, you're good to go."
    },
    {
      "title": "Serve with a dipping sauce that complements the mild taste of sweetbreads.",
      "content": "Serve with a dipping sauce that complements the mild taste of sweetbreads. The light, delicate flavor of sweetbreads makes them extremely versatile. They'll work with just about any kind of flavor profile you want, so get creative! Here are some ideas: Add a little tang by making your own barbecue sauce. Use buffalo sauce to give your sweetbreads a spicy kick. Make chimichurri for an authentic South American dish. [26] X Research source"
    }
  ]
}