{
  "url": "https://www.wikihow.com/Determine-If-You-Had-a-Miscarriage",
  "title": "How Do You Know If You’ve Had a Miscarriage?",
  "steps": [
    {
      "title": "Vaginal bleeding",
      "content": "Vaginal bleeding Heavy vaginal bleeding with clotting is the most common sign of a miscarriage. It’s often accompanied by severe cramps similar to those you might feel during your period. The blood is typically brown or bright red. [2] X Research source Keep in mind that light spotting, and even moderate bleeding, can occur in healthy pregnancies. Notify your physician any time you experience bleeding during pregnancy. Vaginal bleeding can also be a sign of ectopic pregnancy—but only when combined with other symptoms like severe abdominal pain, shoulder pain, and lightheadedness. If you’re experiencing these symptoms, seek medical attention immediately. Reader Poll: We asked 275 wikiHow readers and 59% of them agreed that they would immediately seek emergency medical care if they suspected an ectopic pregnancy. [Take Poll]"
    },
    {
      "title": "Clotted vaginal discharge",
      "content": "Clotted vaginal discharge A common symptom of miscarriage is pink-white vaginal mucus that may contain pregnancy tissue. If your discharge looks like clotted tissue or is solid in any way, this may be a sign that miscarriage is occurring or has occurred. [3] X Research source Most pregnant people experience increased levels of clear or milky vaginal discharge called Leukorrhea. [4] X Research source If you have high levels of this type of discharge, there's no need for alarm, as this is normal. Urine can often be mistaken for vaginal discharge. Vaginal discharge is typically gooey and sticky, whereas urine is not."
    },
    {
      "title": "Lower back or stomach pain",
      "content": "Lower back or stomach pain Pregnancy comes with various aches and pains; however, mild to severe pain in your lower back or stomach may indicate a miscarriage. Miscarriage pain is persistent, comes in waves, and is often paired with bleeding. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It’s also possible to experience “true contractions” if you're having a miscarriage. The contractions occur every 15 to 20 minutes and are extremely painful. [6] X Research source These can occur during early or later miscarriages and often resemble labor. [7] X Research source"
    },
    {
      "title": "Pregnancy symptoms subsiding",
      "content": "Pregnancy symptoms subsiding With pregnancy comes a slew of symptoms (mood swings, nausea, etc.) caused by an increased level of hormones. If you experience a reduction in symptoms, it may be a sign that a miscarriage has occurred and your hormone levels are returning to their pre-pregnancy state. [8] X Research source For instance, if you’ve had a miscarriage, you may notice less morning sickness, swelling, and tenderness of the breasts. In healthy pregnancies, these early symptoms often subside on their own at about 13 weeks, which is also when miscarriage risks decrease. Symptom occurrence and severity varies in every pregnancy. A sudden change before 13 weeks warrants a call to your physician's office."
    },
    {
      "title": "Call your physician if the bleeding stops on its own.",
      "content": "Call your physician if the bleeding stops on its own. If you experience heavy bleeding that eventually subsides, and it's still early in your pregnancy, you may not have to go to the hospital. [9] X Research source Many people prefer not to have an extra hospital visit and would rather rest at home and let the miscarriage happen naturally. This is usually fine if the bleeding stops within 10 days to 2 weeks. If you want to confirm that a miscarriage occurred, schedule an ultrasound."
    },
    {
      "title": "Seek medical treatment if the bleeding doesn't stop.",
      "content": "Seek medical treatment if the bleeding doesn't stop. If you experience heavy bleeding and other miscarriage symptoms and aren’t sure whether the miscarriage is complete, your physician may proceed using one of the following strategies: [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Expectant management: Waiting to see if the remaining tissue passes and the bleeding stops on its own. Medical management: Medication is given to cause the remaining tissue to expel from the body. This requires a short hospital stay, and the bleeding that follows can last up to 3 weeks. Surgical management: Dilation and curettage, known as a D&C, is performed to remove the remaining tissue. The bleeding usually stops quickly, but medication may be administered to help manage it."
    },
    {
      "title": "Visit a doctor immediately if your symptoms don’t improve.",
      "content": "Visit a doctor immediately if your symptoms don’t improve. If your bleeding continues past when your physician said it would slow or stop, seek medical attention immediately. If you experience any other symptoms, such as chills or fever, go to the hospital right away, as this may indicate an underlying issue."
    },
    {
      "title": "Consider getting help from a grief counselor.",
      "content": "Consider getting help from a grief counselor. Losing a pregnancy at any stage can be emotionally traumatic, and you don’t need to go through it alone. Ask your physician for a referral for grief counseling, or book an appointment with a therapist in your area. Sometimes, talking through what you’re feeling can make a big difference. Give yourself as much time as you need to grieve. There’s no set amount of time that you need to feel better. Take each day at your own pace. Talk to your partner and/or loved ones about how you’re feeling. It may be hard, but opening up can help you heal. If you don’t feel comfortable talking to your loved ones yet, that’s okay. Try reaching out to the MA Hotline at 1-833-246-2623 or Backline at 1-888-493-0092 for support. Hold a remembrance with a memorial or burial service. Some hospitals or clinics may be able to arrange a burial within the grounds. Along with this, remembrance picture frames, jewlery, candles, and flowers can be made. [11] X Research source"
    },
    {
      "title": "Miscarriages can happen for many reasons in the first trimester.",
      "content": "Miscarriages can happen for many reasons in the first trimester. Miscarriages typically occur in the early weeks of pregnancy. Chromosome abnormalities are the most common cause, and in most cases, there's nothing the mother could’ve done to prevent it. [12] X Expert Source Rebecca Levy-Gantt, MPT, DO Board Certified Obstetrician & Gynecologist Expert Interview. 3 April 2020. The risk of miscarriage drops after 13 weeks of gestation. Along with chromosomal abnormalities, the following factors can put people at higher risk of having miscarriages: [13] X Research source Being older than 35. Those who are 35 to 45 years old have a 20 to 30% chance of miscarriage, and those over 45 have up to a 50% chance. Being chronically ill. Chronic conditions such as diabetes or lupus have a higher risk of miscarriage. Having uterus abnormalities, such as scar tissue. Smoking, using drugs, and drinking alcohol. Being overweight or underweight. Having had more than 1 miscarriage before."
    },
    {
      "title": "There are different types of miscarriages that can affect a pregnancy.",
      "content": "There are different types of miscarriages that can affect a pregnancy. Miscarriages affect every person's body differently. In some cases, all pregnancy tissues leave the body quickly, while the process is longer and more difficult in others. Take a look at the different types of miscarriage below, and they affect the body: [14] X Research source Threatened miscarriage: The cervix remains closed, and it’s possible that the bleeding and other miscarriage symptoms will stop and the pregnancy will proceed as normal. Inevitable miscarriage: Heavy bleeding occurs, and the cervix begins to open. At this point, the pregnancy can’t continue. Incomplete miscarriage: Some pregnancy tissue leaves the body, but some stay inside. A procedure may be necessary to remove the remaining tissue. Complete miscarriage: All pregnancy tissue leaves the body, and the pregnancy ends. Missed abortion: Even though the pregnancy has ended, the tissue stays in the body. Sometimes it comes out on its own, while other times, treatment is needed to remove it."
    },
    {
      "title": "See your doctor to confirm that you’ve had a miscarriage.",
      "content": "See your doctor to confirm that you’ve had a miscarriage. Visit your physician's office, emergency room, or your hospital's labor and delivery area for a definitive answer as to whether or not you miscarried. Even if you experience all the above symptoms, there still may be a chance that the fetus can survive, depending on the type of miscarriage. Depending on how far your pregnancy has progressed, the physician will use blood tests, a pelvic exam, or an ultrasound to check the viability of the pregnancy. If you experience heavy bleeding early in your pregnancy, your physician may not have you come into the office unless you want to."
    }
  ]
}