{
  "url": "https://www.wikihow.com/Export-Messages-on-Facebook",
  "title": "4 Simple Ways to Export Chats from Facebook Messenger",
  "steps": [
    {
      "title": "Open the Facebook Messenger app on a mobile device.",
      "content": "Open the Facebook Messenger app on a mobile device. Since Meta recently enabled end-to-end encryption on all Messenger chats, the process for downloading your messages has changed. The easiest way to do it is from the mobile Messenger app. To get started, open Messenger on your iPhone, iPad, or Android device. [1] X Research source You may not be able to save more recent encrypted chats from the Facebook website, according to current Meta documentation. However, you might still be able to download earlier, unencrypted chats from the Facebook website . You can also download encrypted messages from secure storage on the Messenger website ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . Depending on your version of the app, you may see this at the top left side of the screen or the bottom right."
    },
    {
      "title": "Tap .",
      "content": "Tap . You’ll see the Settings icon near the top of the menu."
    },
    {
      "title": "Select See more in Accounts Center.",
      "content": "Select See more in Accounts Center . Scroll all the way down to the bottom of the Settings menu to find this link."
    },
    {
      "title": "Tap Your information and permissions.",
      "content": "Tap Your information and permissions . This is located under the Account settings header."
    },
    {
      "title": "Tap Download your information.",
      "content": "Tap Download your information . This is the second option on the menu."
    },
    {
      "title": "Tap Download or transfer information.",
      "content": "Tap Download or transfer information . A new page will open."
    },
    {
      "title": "Select the accounts and profiles you want information from.",
      "content": "Select the accounts and profiles you want information from. Tap the box next to the Facebook account with the messages you want to save. Tap Next to continue."
    },
    {
      "title": "Select Specific types of information.",
      "content": "Select Specific types of information . This option will allow you to specifically download your messages. If you’d rather download all the data associated with your Facebook account, select Available information instead."
    },
    {
      "title": "Tap the box next to “Messages”.",
      "content": "Tap the box next to “Messages”. If you like, you can also select any other type of data you want to download, such as posts, events, profile information, friends, and so on. When you’re done making your selections, tap Next ."
    },
    {
      "title": "Select a destination for your messages.",
      "content": "Select a destination for your messages. If you want to save them directly to your phone or tablet, tap Download to device . If you’d rather save them to a cloud service, like Google Drive or Dropbox, tap Transfer to destination instead."
    },
    {
      "title": "Set your preferences and create the files.",
      "content": "Set your preferences and create the files. What happens next depends on which type of destination you chose for your download. If you selected Download to device : You’ll be prompted to choose a date range for the data you’re downloading (e.g., from just the last week to all time). You can also set a custom range. You can choose between downloading your chats as an HTML file or a JSON file, and select the file quality of any attachments, like videos or images. You can also select which email you’d like the download notification sent to. It must be an address already associated with your Facebook account. When you’re finished, tap Create files . You’ll get an email notification when they’re ready. Depending on how much data you downloaded, this may take a few days. You’ll get an email when the download is ready. Go back to ☰ > Settings > See more in Accounts Center > Your information and permissions > Download your information and find the download in the Available copies section. Tap Download and enter your Facebook password when prompted. If you selected Transfer to destination : Tap Where to to select a destination. You can choose from Google Drive or Dropbox. When you make your selection, tap Save . Select how often you want the selected data transferred. If you just want to do a single transfer, select One Time . If you also want to save future messages to the cloud, select Daily , Monthly , or Yearly . When you’re done, tap Save . Tap Next , then follow the prompts to connect your cloud account to Facebook. Choose the date range, notification email, file format, and media quality settings for your transfer. Tap Start transfer to begin the file creation and transfer process. You may be prompted to re-enter your Facebook password before you can continue. Your files will be sent to the cloud service you selected once they’re ready."
    },
    {
      "title": "Go to https://www.messenger.com in a web browser.",
      "content": "Go to https://www.messenger.com in a web browser. If you have Secure Storage enabled on Messenger, you can download encrypted chats to your computer from the Messenger website. Navigate to the website and sign in, if you aren’t logged in already. [2] X Research source"
    },
    {
      "title": "Click your profile picture.",
      "content": "Click your profile picture. It’s at the bottom left corner of the page, in the left-hand menu bar."
    },
    {
      "title": "Select Privacy & safety.",
      "content": "Select Privacy & safety . It’s the third option from the top of the menu."
    },
    {
      "title": "Click End-to-end encrypted chats.",
      "content": "Click End-to-end encrypted chats . A new pop-up menu will open."
    },
    {
      "title": "Click Message storage and turn on Secure Storage (if necessary).",
      "content": "Click Message storage and turn on Secure Storage (if necessary). In the menu that pops up, click Message storage . If Secure Storage is already turned on, you can proceed to the next step. Otherwise, you’ll need to select the option to turn it on. You’ll be prompted to either enter your Messenger PIN or use a one-time security code, which will be sent to the phone number associated with your account."
    },
    {
      "title": "Select Download secure storage data.",
      "content": "Select Download secure storage data . It’s near the bottom of the Message storage menu. When prompted, enter your PIN or request a one-time code."
    },
    {
      "title": "Click Download file.",
      "content": "Click Download file . This will download a JSON file containing your messages and attachments to your computer. Enter your password when prompted, then click Confirm to begin the download. This process might take several minutes."
    },
    {
      "title": "Sign in to your Facebook account at www.facebook.com.",
      "content": "Sign in to your Facebook account at www.facebook.com . If you're using a computer, you can export your Facebook messages from the Facebook website. While Facebook’s help documentation claims it is no longer possible to download messages this way, the option is available in the Accounts Center menu. Some users report that this method will only download earlier, unencrypted chats and not more recent encrypted conversations."
    },
    {
      "title": "Click your profile photo at the top-right.",
      "content": "Click your profile photo at the top-right. A menu will expand."
    },
    {
      "title": "Click Settings & Privacy and then Settings.",
      "content": "Click Settings & Privacy and then Settings . This displays the Facebook Settings page. [3] X Research source"
    },
    {
      "title": "Click See more in Accounts Center.",
      "content": "Click See more in Accounts Center . You'll see this in the left panel."
    },
    {
      "title": "Click Your information and permissions.",
      "content": "Click Your information and permissions . This is in the left-hand menu pane under the Account settings header."
    },
    {
      "title": "Select Download your information.",
      "content": "Select Download your information . A new window will pop open."
    },
    {
      "title": "Click Download or transfer information.",
      "content": "Click Download or transfer information ."
    },
    {
      "title": "Select your Facebook account.",
      "content": "Select your Facebook account. You’ll see a list of all your linked Meta accounts. Click the box next to the Facebook account you want to save your messages from, then click Next ."
    },
    {
      "title": "Click Specific types of information.",
      "content": "Click Specific types of information . If you want to save all your Facebook data, select Available information instead."
    },
    {
      "title": "Click the checkbox next to “Messages”.",
      "content": "Click the checkbox next to “Messages”. You can also select any additional data you want to save, such as posts or profile information. Click Next to continue."
    },
    {
      "title": "Select a destination for your messages.",
      "content": "Select a destination for your messages. If you want to save them directly to your computer, click Download to device . If you’d rather save them to a cloud service, like Google Drive or Dropbox, tap Transfer to destination instead."
    },
    {
      "title": "Set your preferences and create the files.",
      "content": "Set your preferences and create the files. What happens next depends on which type of destination you chose for your download. If you selected Download to device : You’ll be prompted to choose a date range for the data you’re downloading (e.g., anywhere from just the last week to all time). You can also set a custom range. You can choose between downloading your chats as an HTML file or a JSON file, and select the file quality of any attachments, like videos or images. You can also select which email you’d like the download notification sent to. It must be an address already associated with your Facebook account. When you’re finished, click Create files . You’ll get an email notification when they’re ready. Depending on how much data you downloaded, this may take a few days. You’ll only have 4 days to download your files before they are deleted. You’ll get an email when the download is ready. Go back to the same menu to download your files. You may be prompted to enter your Facebook information to complete the download. If you selected Transfer to destination : Click Where to to select a destination. You can choose from Google Drive or Dropbox. When you make your selection, click Save . Select how often you want the selected data transferred. If you just want to do a single transfer, select One Time . If you also want to save future messages to the cloud, select Daily , Monthly , or Yearly . When you’re done, click Save . Click Next , then follow the prompts to connect your cloud account to Facebook. Choose the date range, notification email, file format, and media quality settings for your transfer. Click Start transfer to begin the file creation and transfer process. You may be prompted to re-enter your Facebook password before you can continue. Your files will be sent to the cloud service you selected once they’re ready."
    },
    {
      "title": "Open the Facebook Messenger app.",
      "content": "Open the Facebook Messenger app. It’s the blue chat bubble icon with a lightning bolt inside. Since there is no way to export an individual Facebook conversation, it may be easier to take screenshots of the chat than to export all of your chats at once. Take screenshots of a conversation if you want to keep picture-proof of your chat. This isn't a good method to use for lengthy conversations, but it works well for shorter chats."
    },
    {
      "title": "Tap a conversation you want to save.",
      "content": "Tap a conversation you want to save. It'll open in a new window."
    },
    {
      "title": "Scroll to the part of the conversation you want to save.",
      "content": "Scroll to the part of the conversation you want to save."
    },
    {
      "title": "Take a screenshot.",
      "content": "Take a screenshot. The steps to do this are different depending on your device, but it's very easy: Android : Not all Androids are the same, but you can typically take a screenshot by pressing the power and volume down buttons simultaneously. This saves the screenshot to your gallery. iPhone/iPad : If your iPhone or iPad has Face ID, press the side and volume up buttons at the same time, then quickly release the buttons. If you have Touch ID, press and hold the side button and the Home button at the same time, then quickly release the buttons. [4] X Research source Your screenshot will be saved to your camera roll."
    }
  ]
}