{
  "url": "https://www.wikihow.com/Do-Scoliosis-Treatment-Exercises",
  "title": "How to Do Scoliosis Treatment Exercises",
  "steps": [
    {
      "title": "Consult your doctor.",
      "content": "Consult your doctor. The following exercises can be adapted to both C- and S-curve types of scoliosis whether the curves veer to the left or to the right. However, you should always consult your doctor to ensure you adapt the exercises correctly. With assistance, choose the right scoliosis exercises for effective treatment. Scoliosis exercises should be specific to your curve pattern. General, balanced, exercise is well accepted as a non-operative way to reduce the mild back pain symptoms associated with mild to moderate scoliotic curves. Do not work only one side of your body in hopes of correcting any imbalances. While these exercises can be used as part of a larger exercise program, focusing on one side of you body only can cause a muscular imbalance and can make symptoms worse, and has not been shown to be effective at reducing or even delaying curve progression."
    },
    {
      "title": "Perform the exercise ball stretch.",
      "content": "Perform the exercise ball stretch. Situate yourself in a kneeling position on a workout mat. Rest a large exercise ball against your hip on the convex side of your curvature. Lean sideways over the ball until your side is resting against the ball between the hip and the bottom of the rib cage. Balance yourself with both feet and your lower hand, while stretching your upper hand out to deepen the stretch. [1] X Research source Abelson, B. and Mylenax, E. Kinetic Health Video: Exercising for Scoliosis Hold this position for 20-30 seconds, and do 2-3 reps. This exercise can be done daily."
    },
    {
      "title": "Do the foam roller towel stretch.",
      "content": "Do the foam roller towel stretch. Wrap a towel around a foam roller and lay it width-wise across the exercise mat. Lay across the foam roller so that it is perpendicular to your body. It should rest in the space between your hip and the bottom of your rib cage. Your top leg should be straight and your bottom leg bent at the knee behind you. Stretch your upper arm out until your hand touches the floor. [2] X Research source Abelson, B. and Mylenax, E. Kinetic Health Video: Exercising for Scoliosis Try to hold the pose for 20-30 seconds, and do 2-3 reps. You can do this exercise daily."
    },
    {
      "title": "Perform the partner stretch exercise.",
      "content": "Perform the partner stretch exercise. Lay flat on the floor on your stomach. Raise your body up in a plank position, so that your toes, forearms, and elbows are all holding you up. Your partner will kneel beside you on the convex side of your curve, put his or her hands on your midriff, and gently pull your midriff towards him or her, giving a nice, deep stretch. [3] X Research source Abelson, B. and Mylenax, E. Kinetic Health Video: Exercising for Scoliosis Hold this position for 20-30 seconds, and do 3-4 reps. You can do this exercise daily."
    },
    {
      "title": "Do the stair step exercise.",
      "content": "Do the stair step exercise. As previously mentioned, one common defect that can contribute to scoliosis is a difference in leg length. Step up on a stair with the longer leg. Lower the opposite leg to the floor as you bend onto one knee. While bending, raise the arm that is on the same side as your lowered leg up as high as possible. For example, if you are lowering your left leg, raise up your left arm. [4] X Research source Perform 2-3 sets of 5-10 reps of this exercise. Do it on the one side only. You can do this exercise daily."
    },
    {
      "title": "Perform downward-facing dog stretches.",
      "content": "Perform downward-facing dog stretches. This classic yoga position is also effective for scoliosis treatment. Begin in a plank position—on your stomach, with legs and arms stretched out in front of you and your palms down against the floor. Keep your hands on the floor for balance and push your hips and buttocks slowly into the air, so that your body makes a triangle shape with the floor as the base of the triangle. [5] X Research source Hold this position for 5 seconds, then lower down slowly into plank position once more. Do two to three sets of five to 10 reps each. You can perform this exercise daily."
    },
    {
      "title": "Do a split stance stretch.",
      "content": "Do a split stance stretch. This stretch is also tailored to scoliosis stemming from unequal-length legs. Step forward with the longer leg in front of you. Keep your torso upright then begin shifting your weight back and forth between the front and back legs. Allow the forward knee to bend as you shift your weight onto it. Raise the arm that is opposite of your forward leg as high as possible. While you raise the one arm, reach back with the other arm with the palm up as far as you can comfortably go. [6] X Research source This movement causes the torso and spine to turn toward the side of the forward leg. Perform this exercise only on the one side. Do two to three sets of five to 10 reps each. You can do this exercise daily."
    },
    {
      "title": "Perform forward bend exercises.",
      "content": "Perform forward bend exercises. Begin this exercise with your knees on the mat and your stomach on top of a large exercise ball. Allow yourself to fall forward over the ball in a relaxed position. From this position, ease yourself up to the point where your back is perpendicular to the ball itself. Hold your arms and legs out straight so that they, too, run perpendicular to the ball. Hold this position for a count of 10 and do 10 repetitions."
    },
    {
      "title": "Do bent-over raise stretches.",
      "content": "Do bent-over raise stretches. Start this exercise by sitting on top of a large exercise ball with your feet flat on the floor in front of your for balance. Bend over so that your body appears to be in the shape of a table and you can wrap your arms around the middle of your thighs. Pick up the light hand weights in your hands and, keeping your elbows soft and your arms close to your sides, pick up the light weights until they are parallel with the ground, then lower them back down again. For this exercise, you can do three sets of 10 reps. You can perform this exercise daily."
    },
    {
      "title": "Determine the type of scoliosis you have.",
      "content": "Determine the type of scoliosis you have. There are three primary forms of scoliosis, and each may have different treatment options. These forms include functional, neuromuscular, and idiopathic scoliosis. Patients also vary between having a C-curve or S-curve to their spines. Your doctor will be able to help diagnose your scoliosis, and the best treatment options. Functional scoliosis is a curvature of the spine due to some form of structural defect somewhere else in the body. One common defect that causes this is a difference in length between the legs. This can usually be corrected by an orthotic wedge, which the wearer can insert into a shoe. This will help correct the difference in the leg length and keep the spine from curving abnormally. Neuromuscular scoliosis is curvature of the spine due to structural abnormalities in the spine itself. Because of its high potential to get worse, this is often treated with surgery. Idiopathic scoliosis, as the name implies, is a curvature of the spine for unknown reasons. The condition often corrects itself in infancy but requires observation. If it occurs in school-aged children, there is also a high potential for it to worsen. [7] X Research source If the curve is below 25 degrees, no treatment is needed."
    },
    {
      "title": "Research braces and surgical options.",
      "content": "Research braces and surgical options. Generally speaking, curves between 25 and 40 degrees may require a brace. Surgery is recommended for curves over 40 degrees. Your doctor will determine if a back brace, surgery, or another option is best for your specific case."
    },
    {
      "title": "Consult with your doctor about treatment methods.",
      "content": "Consult with your doctor about treatment methods. Apart from the home exercises in Method 1, your doctor or physical therapist may suggest a more rigorous treatment option based on one of the major scoliosis treatment methodologies, which include the Schroth, Nu Schroth, and Scientific Exercises Approach to Scoliosis (SEAS) methods. Each methods uses different principles and techniques tailored to the exact spinal curvature of a specific patient. The Schroth Method treats scoliosis by striving to reverse the abnormal posture. The exercises seek to correct the position of the pelvis, use spinal elongation and then rotational angular breathing to help achieve the best possible posture, and use tension in the trunk muscles to strengthen them and promote the best possible posture. [8] X Research source The Nu Schroth Method reflects new knowledge and understanding of this disease in recent decades. Some advantages of this method include a home exercise routine that makes it easier to perform regularly, regular imaging studies to track the progress and effects of the exercises, and chiropractic and manual therapy techniques to enhance the effectiveness of the exercises. [9] X Research source The SEAS Method calls for exercises that are done twice a week either at home or at a physical therapy center. The advantages of the SEAS method include exercises based on Active Self-Correction (ASC) that are completely tailored to the individual patient, positions that help the patient to achieve maximum function, and the inclusion of exercises to enhance neuro-motor control and stability. [10] X Research source"
    }
  ]
}