{
  "url": "https://www.wikihow.com/Fix-a-Squeaking-Bed-Frame",
  "title": "How to Fix a Squeaking Bed Frame",
  "steps": [
    {
      "title": "Take the mattress and box spring off the bed frame.",
      "content": "Take the mattress and box spring off the bed frame. The box spring is the wooden base underneath the mattress. Lay the mattress and box spring on the floor. [1] X Research source"
    },
    {
      "title": "Check if it’s the mattress that’s squeaking.",
      "content": "Check if it’s the mattress that’s squeaking. You’ll want to rule it out as the cause of the squeaking before you start working on the bed frame. Get on the mattress and move around a little bit - if it squeaks, you know the mattress is the culprit. [2] X Research source"
    },
    {
      "title": "Check if it's the box spring that's squeaking.",
      "content": "Check if it's the box spring that's squeaking. Apply pressure to the top of the box spring and move it around. If you hear squeaking, it's probably the box spring rather than the bed frame that's causing the problem. [3] X Research source"
    },
    {
      "title": "Rock the posts on the bed frame and listen closely.",
      "content": "Rock the posts on the bed frame and listen closely. Squeaking can occur where the posts attach to the rest of the bed frame, so try rocking each post. Try to pinpoint the exact location that the squeaking is coming from."
    },
    {
      "title": "Rock the slats on the bottom of the bed frame.",
      "content": "Rock the slats on the bottom of the bed frame. The slats are the metal or wooden planks that stretch from one side of the bed frame to the other. They’re what hold up the mattress and box spring. Apply pressure to the slats to see if they're causing the squeaking. [4] X Research source Wood rubbing against wood will often cause squeaking."
    },
    {
      "title": "Get the right tools for the part of the bed frame you’re working on.",
      "content": "Get the right tools for the part of the bed frame you’re working on. Check to see what’s holding the bed frame together in the area the squeaking is coming from. If it’s a screw, get a matching-size screwdriver. If it’s a bolt, you’ll need a wrench."
    },
    {
      "title": "Tighten the joint that’s squeaking.",
      "content": "Tighten the joint that’s squeaking. Sometimes all that’s causing a bed frame to squeak is a loose joint. Before you take apart the bed frame, try tightening any screws and bolts in the area the squeaking is coming from. You’ll know they’re tight enough when you can’t turn them anymore. [5] X Research source"
    },
    {
      "title": "Use a washer if you're having trouble tightening a bolt.",
      "content": "Use a washer if you're having trouble tightening a bolt. If you can't get a bolt to tighten all the way up against the frame, place a washer in between the frame and the bolt to fill in the extra space. [6] X Research source"
    },
    {
      "title": "Take apart the joint if the squeaking persists.",
      "content": "Take apart the joint if the squeaking persists. Use your tools to loosen and remove the bolts or screws holding the joint together. Place any loose bolts or screws in a plastic bag so you don’t lose them. Separate the two pieces of the bed frame that make up the joint. [7] X Research source"
    },
    {
      "title": "Lubricate each component of the joint.",
      "content": "Lubricate each component of the joint. Apply a lubricant to any surface where both parts of the joint come into contact, including any fasteners, hooks, or flat surfaces. [8] X Research source Some good lubricants you can try are: Paraffin. Paraffin is a waxy substance that comes in bar form, making it easy to rub on surfaces. [9] X Research source WD-40. WD-40 is a spray on lubricant that works well on metal bed frames, but it eventually dries out. Candle wax. If you don’t have access to a store-bought lubricant, try using candle wax. Rub the candle wax on like you would with any other waxy lubricant. [10] X Research source White grease or siliconized lubricant. Purchase white grease or a siliconized lubricant from the hardware store and apply it to the joint components to keep the squeaking at bay."
    },
    {
      "title": "Reassemble the bed frame.",
      "content": "Reassemble the bed frame. Put back all of the screws and bolts you removed and tighten them with your tools. Make sure they’re tightened all the way so you don’t accidentally cause more squeaking to occur."
    },
    {
      "title": "Listen to see if the squeaking is gone.",
      "content": "Listen to see if the squeaking is gone. Rock the bed and see if you can still hear squeaking. If the squeaking persists, try to pinpoint where it’s coming from. If it’s coming from a different joint than the one you worked on, follow the same steps you did for the other joint. If the squeaking is coming from the same joint, try tightening the bolts or screws holding the joint together some more."
    },
    {
      "title": "Line the slats on the bed frame with old clothes.",
      "content": "Line the slats on the bed frame with old clothes. Use old socks or shirts that you don't wear anymore. The fabric will prevent the box spring or mattress from rubbing against the bed frame and squeaking."
    },
    {
      "title": "Use cork to fill in gaps if you have a wooden bed frame.",
      "content": "Use cork to fill in gaps if you have a wooden bed frame. Check the bed frame for any spaces where the mattress or box spring could potentially move and rub against the frame. Stick cork into the gaps so every component of the bed is firmly in place."
    },
    {
      "title": "Slip a towel under any uneven legs on the bed frame.",
      "content": "Slip a towel under any uneven legs on the bed frame. A leg is uneven if it doesn't touch the floor. Put a towel in the space between the leg and the floor so the bed frame doesn't wobble and make noise."
    },
    {
      "title": "Put a book under the mattress near the source of the squeak.",
      "content": "Put a book under the mattress near the source of the squeak. If the squeak is coming from one of the slats, remove the mattress and box spring and place a book on the squeaking slat. Move the mattress and box spring back onto the bed frame."
    }
  ]
}