{
  "url": "https://www.wikihow.com/Deal-with-Being-Exploited",
  "title": "How to Deal with Being Exploited",
  "steps": [
    {
      "title": "Consider some reasons you may be the subject of exploitation and the types.",
      "content": "Consider some reasons you may be the subject of exploitation and the types. As with so many things, once you have understood the cause the effect becomes clearer and you have a far better way of making beneficial action. For the most pathological of cases, the exploiter often sees people as simply asking to be exploited. These are the most dangerous as the exploiter has no sense of boundaries. There are also so many levels of exploitation from low to dangerous and types, such as: Emotional, Financial, Influential (such as in business or political circles), Spiritual, Personal (often power-lust or ego-mania of the exploiter), Addictions (there have been historical cases often in less developed lands where people/s are exposed to drugs of controlling them through their addiction. It is far more subtle in modern times, focusing on mental addictions, such as personal beliefs, lifestyle and routines, media and technology etc), Relationships (including physical relationships), or a mix - they often blend. While there are so many reasons a person may be a target, the most common are: [1] X Research source You may be a person who feels the need to change the world for the better, to be part of a project or community (including personal relationships), or to make a contribution. These are the most common victims of manipulation and exploitation as these people want to believe they are making a difference and sometimes neglect to read fine print or consider the validity of the cause. The old rule of thumb that \"if it sounds too good to be true, it usually is\", is useful to bear in mind. [2] X Research source Your age may make you a target. It is frequent the elderly are targeted when they are perceived to be lonely, or are experiencing mental decay associated with age related illnesses. Likewise, the young or immature are often targeted because of their perceived lack of experience. You may be someone who feels excessive empathy. A person who sympathizes too much is often a target as they can easily place themselves in the other person's shoes when being told a tragic story. For these cases, it is wise to remember that you need strength and compassion to say no when it is not helping yourself and the other person. [3] X Research source You may be an ambitious person who wants wealth, influence, career or achievement. These are also very common targets of exploitation as ambition makes a person blind to seeing the bigger picture. You may be a person who has not experienced the scope of human nature in yourself and in others of both the beneficial and harmful aspects. You may be a person who is targeted by a loved one or a close friend who is using the relationship as leverage. Often people don't wish to accept that they are being exploited as the implications are too difficult to bear. These cases are often the most dangerous as the exploitation can continue to very unhealthy levels and it is far harder to deal with the fall-out if it is not identified and addressed very early. You may be a target because of your position. Often the older relatives are cruelly exploited because they have trust and want to help the next generation of the family. Sometimes it is because you have showed signs of wealth or influence, or oppositely that you are a person who is not in the limelight (such as reclusive people) or people who are naturally introverted, without many relatives or contacts or lacking in confidence as there would usually be less people around who would notice the exploitation."
    },
    {
      "title": "Consider the level of danger you and the other person may be involved in.",
      "content": "Consider the level of danger you and the other person may be involved in. Always seek advice from a friend, counselor, or social worker should there be any risks. The aim is to be able to minimize harm to all people, even though they are taking advantage of you. If you feel smitten with feelings of revenge and lust for justice, then you are still the prisoner. It is often said the best revenge is living a good, healthy life, but any desire for revenge overall simply downgrades or even voids any chance of happiness and recovery. People may be caught up to their necks, but the tide of exploitation can always go much higher. You have to discern if it has gone too far or too late. In these cases consulting with a legal advisor, counsellor or social worker, or local law enforcement may be required."
    },
    {
      "title": "Draw the line in the sand.",
      "content": "Draw the line in the sand. If possible, set yourself ground-rules and stick to them and making a commitment to reduce the damage. A person who has very few ground rules and is perhaps naively forgiving every problem is most often easy to be \"used\". Decide for yourself what constitutes exploitation and how much you can or are prepared to take. Don't stop forgiveness, but understand that without any commitment from yourself, or sign of the exploitation ending, then it is time to forgive and move away. Don't be afraid to say enough is enough. Its also important to remember its all about doing things in balance with the need - making a fortress to keep others out may still make you a prisoner. However you should naturally consider the implications. Is the other person likely to get violent either to you, themselves or others? If this is the case it would be inevitable to seek legal intervention if it cannot be avoided."
    },
    {
      "title": "Avoid putting your head in the noose.",
      "content": "Avoid putting your head in the noose. Identify any methods used to manipulate you so you can see the techniques and be more aware of when they are being used. There may be many them, but if you respect your own limits, you can much better decide when to step back and not get involved. Often the aim of the game is to provoke you, as then you are trapped. [4] X Research source The problem basically is that your head might already by in it as an exploiter or manipulator so often looks to get their victim in a place of no escape, or completely hooked in before they even start. Try not to be judgmental to yourself, especially if the methods seem disturbingly simple. Many people have gone into despair when realising not only that they were abused, but also that all so often we allowed it to happen to ourselves. This realization has a tragically high human cost as people decide they cannot live with the shame rather than to seek help. At the same time however, learn to be both wise and how to use wisdom. However tempting it may be, avoid any attempt to use their methods and manipulate them back as a means to get them to change. They are likely to be far more experienced at this than you are, will see through your actions, and quickly change the rules to suit them. [5] X Research source Ensure that you yourself have somewhere to go to get distance if required for a break to take things into account. You are far more vulnerable if you are trapped and the most dangerous cases will set their strategy to ensure you remain tied to them. Somewhere to turn to may be a trusted friend, relative, or counselor that you know you can turn to for advice and space. It is better to have several places you can go."
    },
    {
      "title": "In most cases simply sitting down and talking about it with the person can make positive change, but again you have to know the situation and the person well enough to know if this has any chance of working.",
      "content": "In most cases simply sitting down and talking about it with the person can make positive change, but again you have to know the situation and the person well enough to know if this has any chance of working. Make it clear what is and is not acceptable with the exploiter if it is a friend or relative. For cases where the person is a stranger, then it is usually far easier for the victim to seek legal intervention, as there are less emotional ties. If there is true respect in the friend or relative, they will usually accept reasonable requests. This is perhaps the hardest and most telling part - if the person refuses or denies there is any wrongdoing, and then change on their part is not likely to occur. Encourage and support any real effort to change. It may come to the final crunch that you have to terminate any association with them. This is when you will need to seek support the most. The hardest lesson in all this, is sometimes the other person will simply never understand what they are doing is harmful or actually see there is a problem. Occasionally these repeat offenders can be exceptionally manipulative and be skilled at \"game-playing\" and \"point-scoring\", but their motives and methods are not always universal. When it is a family member, your partner or close friend, it is one of the difficult facts of human nature that trying to change them may make them defensive, evasive or aggressive. For those who don't see their own need for personal change, most forms and ways of dealing with the experience become a fruitless endeavour. It is also possible that trying to make them change you have set yourself up to be the scapegoat so they can continue to have someone else to blame for their problems. Ultimately you will need to accept your position and the facts to consider a way to suit your own case to the least harmful outcome. Often it is by considering that you cannot always change another person, but that you can make yourself a wiser person and consider ways to move on from the event and continue your life."
    },
    {
      "title": "To deal with the experience, it is important to let go of aspects of shame or other emotions that cause you harm.",
      "content": "To deal with the experience, it is important to let go of aspects of shame or other emotions that cause you harm. Shame, disappointment and pain can be an important teacher for us to be smarter and wiser about how we live in order to avoid future manipulators, but it can become indulgent and self destructive if you allow these feelings to rule your life. By finding ways to move on and to build from the experience can make you a happier and better human being."
    }
  ]
}