{
  "url": "https://www.wikihow.com/Disguise-Your-Voice-over-the-Phone",
  "title": "How to Disguise Your Voice over the Phone",
  "steps": [
    {
      "title": "Download a voice-changing app to your phone from the app store.",
      "content": "Download a voice-changing app to your phone from the app store. These apps use digital filters to change your voice; they can lower or raise your voice, add accents, or make your voice sound funny. Look for one that specifically lets you change your voice while you're on a call, as some just do it for a recording. You can find apps for both Android and iOS. Try apps like Voice Changer Calling, Funcalls, or Call Voice Changer, all of which are available on Android and iOS."
    },
    {
      "title": "Connect to wifi",
      "content": "Connect to wifi . Typically, these apps work on wifi, not on your cellphone line. You can turn wifi on in your settings; you must connect to a nearby network, such as one in your home or a free one at a coffee shop. Keep in mind that most of these apps charge per phone call."
    },
    {
      "title": "Use the app's settings to change your voice until it's unrecognizable.",
      "content": "Use the app's settings to change your voice until it's unrecognizable. Often, you can make your voice higher or lower. You may be able to add an accent or change it to a silly voice, such as a squeaky voice. Others may let you sound like a celebrity. Play around until you find a combination that's right. [1] X Research source Some also let you add sound effects throughout the call. Pick a voice based on what you're trying to do. If you're making a prank call, pick a silly voice. If you're trying to do something serious, pick a more serious voice."
    },
    {
      "title": "Dial through the app.",
      "content": "Dial through the app. Don't switch to your regular phone to dial. The app will have a keypad where you can put in the number; some may let you import your contacts to make it easier. Otherwise, you'll need to look up the number and then put it in yourself. [2] X Research source Because you are dialing through the app, typically your number won't show up."
    },
    {
      "title": "Make your call like you normally would.",
      "content": "Make your call like you normally would. Once the person answers, all you need to do is talk. The app will change your voice in real time as you speak. Keep in mind that the other person may get frustrated or angry if you're making a prank call! [3] X Research source Also, bear in mind that your voice can be returned to \"normal\" by the other person with decryption apps."
    },
    {
      "title": "Open Pages in a Mac to use text to speech.",
      "content": "Open Pages in a Mac to use text to speech. Pages in a Mac or other Apple devices will read text to speech automatically. Type out what you want to say initially. With your volume turned up on your computer, make your call. Right-click on the text, then click \"Speech\" and \"Start Speaking.\" The computer will read the text on the page for you. If you need to respond to the person, type in your response and repeat the process. [4] X Research source Make sure to hold the phone up to the computer's speakers so the person can hear it! Keep in mind, you have to be a fast typist for this to work."
    },
    {
      "title": "Try a text-to-speech website if you have a PC.",
      "content": "Try a text-to-speech website if you have a PC. Type in the text you want to begin your phone call with. Turn the volume up on your computer and make your call. When the person picks up, hit the \"Play\" button on the page. If you need to respond to the person, type it out on the computer and hit the play button to have it read for you. [5] X Research source You can find any number of websites that will do text to speech. Just search for \"text-to-speech website\" in a search engine."
    },
    {
      "title": "Borrow someone else's phone for a text-to-speech app.",
      "content": "Borrow someone else's phone for a text-to-speech app. For this one, you'll need an extra phone, as your phone likely won't play text-to-speech while on a call. Write out what you want to say in the app on someone else's phone and then make the call on your phone. Hold the phones up to each other or put the call on speakerphone so the person can hear the text. Push \"Play\" in the app to make it read your text. [6] X Research source One app you can try is the TK Solution Text-to-Speech app."
    },
    {
      "title": "Make your voice high pitched with helium.",
      "content": "Make your voice high pitched with helium. Grab a helium balloon and untie it, making sure to hold onto the end so it doesn't float away. When you make the call, breathe in the helium and speak as you normally would. This will change your voice for 5-10 seconds at a time, so you'll need to keep breathing in the helium throughout the call. [7] X Research source"
    },
    {
      "title": "Hold your nose while you're speaking.",
      "content": "Hold your nose while you're speaking. Holding your nose can also change the pitch a little and make it sound more nasally. All you have to do is squeeze your nostrils together and start speaking for it to change your voice."
    },
    {
      "title": "Speak in a really low voice.",
      "content": "Speak in a really low voice. If you have a naturally high voice, try to make your voice very low instead so it's not recognizable. You can also try making it gravelly or textured by putting your chin on your chest and speaking with the lower part of your throat. [8] X Research source"
    },
    {
      "title": "Adjust the position of your mouth to change the sound.",
      "content": "Adjust the position of your mouth to change the sound. Clamp your teeth together while you talk, for instance. Alternatively, keep your mouth open very wide the whole time. This will change how you enunciate words and may disguise your voice. [9] X Research source Try combining this with other techniques, such as changing the pitch of your voice."
    },
    {
      "title": "Place something over the phone to muffle your voice.",
      "content": "Place something over the phone to muffle your voice. While this won't change your voice that much, it can help in addition to other techniques. Try putting a washcloth or blanket over the phone as you hold it up to your mouth. [10] X Research source"
    }
  ]
}