{
  "url": "https://www.wikihow.com/Eat-Bitter-Melon",
  "title": "How to Eat Bitter Melon",
  "steps": [
    {
      "title": "Look for a long, green warty fruit at the summer farmer’s market.",
      "content": "Look for a long, green warty fruit at the summer farmer’s market. Despite its name, bitter melon doesn’t look like typical melon. Head to the farmer’s market in July and August and keep an eye out for a vegetable that resembles a cucumber, but with much bumpier skin. [1] X Research source"
    },
    {
      "title": "Choose small, firm melon.",
      "content": "Choose small, firm melon. When choosing from a group of bitter melon, it’s best to go for the smaller, harder ones that are light green, as these won’t be quite as bitter. As bitter melon age and grow, they become more bitter. [2] X Research source If you see any bitter melon with a touch of orange or yellow, get them. These tend to be milder in flavor."
    },
    {
      "title": "Store bitter melon in your refrigerator for up to 5 days.",
      "content": "Store bitter melon in your refrigerator for up to 5 days. Once you’ve acquired some bitter melon and have brought them home, put them in an airtight container. Keep them stored in the vegetable drawer in your refrigerator until you’re ready to prepare, cook, and eat them. Don’t wait longer than 5 days or so, or else the bitter melon may start to spoil. [3] X Research source"
    },
    {
      "title": "Wash the melon.",
      "content": "Wash the melon. Before you cut and cook your melon, turn the kitchen faucet on cold and hold it under the water. Rub it with your hands or scrub it softly with a clean sponge to remove any dirt and/or pesticides. [4] X Research source"
    },
    {
      "title": "Slice the melon in half lengthwise and scoop out the core.",
      "content": "Slice the melon in half lengthwise and scoop out the core. Put the bitter melon on a cutting board and carefully slice it in half down the middle. Then take a spoon and scoop out the pith and seeds. Finally, slice the melon into thin half-moon-shaped pieces. [5] X Research source"
    },
    {
      "title": "Sprinkle salt onto the melon.",
      "content": "Sprinkle salt onto the melon. Lightly and uniformly sprinkle salt all over the bitter melon pieces and let the salt sit on them for about 10 minutes. This will minimize the bitter taste of the melon, making it more palatable. [6] X Research source"
    },
    {
      "title": "Heat some oil in a wok on the stove.",
      "content": "Heat some oil in a wok on the stove. Get a wok or large, deep saucepan and pour in 1 tablespoon (14.8 mL) of vegetable or olive oil. Place the wok on a burner and turn the burner on medium-high heat."
    },
    {
      "title": "Add chopped garlic and onion to the wok.",
      "content": "Add chopped garlic and onion to the wok. Use a knife to finely chop one small onion and 3-4 cloves of garlic on a cutting board. Put the chopped garlic and onion into the wok and stir it with a large wooden spoon until it’s cooked and appears brown. For more flavor, chop and stir in tomatoes once the garlic and onion have browned."
    },
    {
      "title": "Add the sliced melon and stir fry for 2-3 minutes.",
      "content": "Add the sliced melon and stir fry for 2-3 minutes. Put 2 sliced melons into the wok and continuously stir it while it cooks. After about 2 or 3 minutes, you should notice that the melon is beginning to turn slightly translucent, which means it’s almost cooked. [7] X Research source"
    },
    {
      "title": "Beat and pour 2 eggs into the wok.",
      "content": "Beat and pour 2 eggs into the wok. After the melon has been cooking for 2-3 minutes, whisk 2 eggs and slowly pour them into the wok and over the melon pieces. Continue to stir fry until the eggs are cooked and dry."
    },
    {
      "title": "Remove the wok from heat, and season with salt.",
      "content": "Remove the wok from heat, and season with salt. Move the wok to a cold burner and turn off the warm burner. Use your wooden spoon to scrape the food out of the wok and into a bowl. Sprinkle in some salt to taste, and serve with rice or noodles. [8] X Research source"
    },
    {
      "title": "Make a bitter melon smoothie.",
      "content": "Make a bitter melon smoothie. Use a knife to chop the bitter melon as finely as possible on a cutting board and put it into a blender or food processor. Add in some pomegranate seeds and/or chopped mango to create a nice flavor. Either blend the chopped melon and fruit into a thin liquid and drink it as a juice, or add in some yogurt to make a smoothie. [9] X Research source"
    },
    {
      "title": "Drink bitter melon tea.",
      "content": "Drink bitter melon tea. Oftentimes, Asian markets carry bitter melon tea in the form of tea bags. The taste is similar to green tea. Drink a cup in the morning and cup at night to get a healthy daily dose. [10] X Research source"
    },
    {
      "title": "Have a cocktail made with bitter melon extraction.",
      "content": "Have a cocktail made with bitter melon extraction. If you’re of legal drinking age and are looking for a more creative way to consume bitter melon, try it in a cocktail. Use a box grater to finely grate the skin of one medium melon. Wrap the skin in a cheesecloth and twist it to squeeze out the juice. Put 1 tablespoon (14.8 mL) of juice into a cocktail shaker and add in 1 oz (29.6 mL) of simple syrup, ¾ oz (22.2 mL) of lime juice, ¾ oz (22.2 mL) of gin, and ice. Shake and pour the drink into a glass. Stir in 2 oz (59.1 mL) of soda water and enjoy! [11] X Research source"
    }
  ]
}