{
  "url": "https://www.wikihow.com/Draw-Adolf-Hitler",
  "title": "How to Draw Adolf Hitler",
  "steps": [
    {
      "title": "Draw a medium circle for his head at the top center of the paper.",
      "content": "Draw a medium circle for his head at the top center of the paper."
    },
    {
      "title": "Attach a tip-of-a-spade-like shape below the circle.",
      "content": "Attach a tip-of-a-spade-like shape below the circle. This will serve as the outline for his chin and jaw."
    },
    {
      "title": "Draw a vertical line across the center of the circle turning down to form chin-jaw part.",
      "content": "Draw a vertical line across the center of the circle turning down to form chin-jaw part. Draw a horizontal line across the circle slightly below the center. Draw another horizontal line parallel to the first one, within and near the bottom of the circle. Let all these horizontal lines intersect the vertical line by their middle."
    },
    {
      "title": "Start drawing the eyes, nose, mouth and his trademark toothbrush mustache.",
      "content": "Start drawing the eyes, nose, mouth and his trademark toothbrush mustache. Use the horizontal-vertical line guides. Trace the outline of his ears, jaws and chin."
    },
    {
      "title": "Draw his curtained hair.",
      "content": "Draw his curtained hair. As a guide for his body, draw polygon patterns. Make it smaller in proportion to his head."
    },
    {
      "title": "Draw the miniaturized body of this dictator using these polygons.",
      "content": "Draw the miniaturized body of this dictator using these polygons. Start with the uniform details of his torso."
    },
    {
      "title": "Continue tracing his entire body and its details.",
      "content": "Continue tracing his entire body and its details."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    },
    {
      "title": "Draw a medium circle for the head, near the top center of the paper.",
      "content": "Draw a medium circle for the head, near the top center of the paper."
    },
    {
      "title": "Attach a tip-of-a-spade-like shape below the circle.",
      "content": "Attach a tip-of-a-spade-like shape below the circle. This will serve as the outline for his chin and jaw."
    },
    {
      "title": "Draw a vertical line across the center of the circle going down to the chin-jaw part.",
      "content": "Draw a vertical line across the center of the circle going down to the chin-jaw part. Draw a pair of parallel horizontal line near the bottom of the circle. Draw another horizontal line below and outside the circle; about halfway within the spade-shape. Let all these horizontal lines intersect the vertical line by their middle."
    },
    {
      "title": "Draw a horizontal rectangle below and near the chin-jaw part.",
      "content": "Draw a horizontal rectangle below and near the chin-jaw part. On each side of this rectangle, draw an arc to be a guide for his shoulders."
    },
    {
      "title": "Attach the shoulders to the head using straight diagonal lines.",
      "content": "Attach the shoulders to the head using straight diagonal lines. Using the horizontal-vertical line guides you've traced earlier, start drawing the eyes, nose, mouth and his trademark toothbrush mustache."
    },
    {
      "title": "Trace the outline of his ears, jaws, chin and neck.",
      "content": "Trace the outline of his ears, jaws, chin and neck."
    },
    {
      "title": "Draw his curtained hair.",
      "content": "Draw his curtained hair."
    },
    {
      "title": "Start tracing his shoulder and upper torso.",
      "content": "Start tracing his shoulder and upper torso. Draw his uniform details."
    },
    {
      "title": "Continue to draw more details on his face, body and clothes.",
      "content": "Continue to draw more details on his face, body and clothes."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    }
  ]
}