{
  "url": "https://www.wikihow.com/Enable-a-Fingerprint-Reader-in-Windows-10",
  "title": "How to Enable a Fingerprint Reader in Windows 10",
  "steps": [
    {
      "title": "Connect your external fingerprint reader to your computer (if not built-in).",
      "content": "Connect your external fingerprint reader to your computer (if not built-in). If your fingerprint reader is not built into your computer or keyboard, connect it to your PC's USB port now. Refer to the manual that came with the fingerprint reader if you're having trouble connecting it to your computer. To make sure your reader is compatible with Windows 10, check its packaging or the manufacturer's website. One or both will usually state that the reader is compatible with Microsoft Hello or Windows 10."
    },
    {
      "title": "Open your Windows Settings .",
      "content": "Open your Windows Settings . To do this, click the Start icon at the bottom-left corner of the screen, and then click Settings or the gear icon."
    },
    {
      "title": "Click Accounts.",
      "content": "Click Accounts . This looks like a silhouette of a person that you'll most likely find at the bottom of the Settings screen."
    },
    {
      "title": "Click Sign-in options.",
      "content": "Click Sign-in options . You'll see this on the left side of the window near the center."
    },
    {
      "title": "Click Windows Hello Fingerprint.",
      "content": "Click Windows Hello Fingerprint . The option will expand."
    },
    {
      "title": "Click Set up.",
      "content": "Click Set up . If this is greyed out, it is not an available feature. Refer to the manual that came with the external fingerprint reader if you have one. If the option is grayed-out, you'll either need a new fingerprint reader, troubleshoot the one you have, or set up a different type of sign-in."
    },
    {
      "title": "Follow the on-screen instructions to set up your fingerprint log-in.",
      "content": "Follow the on-screen instructions to set up your fingerprint log-in. You'll be prompted to lift and rest your finger on the fingerprint reader repeatedly until your entire fingerprint is captured. Make sure you tilt your finger to capture different angles of your fingerprint. When you're done, you have the option to add more fingerprints. You should add a few more in case you forget which finger you used to originally set up the fingerprint or if one finger is having problems signing in. [1] X Research source"
    }
  ]
}