{
  "url": "https://www.wikihow.com/Get-Dogs-to-Stop-Barking",
  "title": "How to Get Dogs to Stop Barking",
  "steps": [
    {
      "title": "Discontinue reinforcement.",
      "content": "Discontinue reinforcement. Also called \"attention-seeking barking,\" request barking is a common problem for dog owners. The first step to breaking a dog's request barking is to stop giving your dog what she wants whenever she barks. This will, of course, take some time to train out of your dog, especially if she has been \"rewarded\" for her barking over many years. [1] X Research source [2] X Expert Source Dominik Feichtner Dog Trainer & Behaviorist Expert Interview. 18 March 2021. Try to distinguish between barking that stems from needing to use the bathroom (which is a valid need to vocalize) and barking over every minor desire, such as wanting to come on the couch or be given more attention. [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Do not give in to your dog's barking, no matter how much she barks. Any concession to a dog's request barking will undo whatever progress you may have been making. [4] X Research source"
    },
    {
      "title": "Ignore the barking.",
      "content": "Ignore the barking. Attention-seeking or request barking may be the only way your dog knows how to behave. Even after you've discontinued your reinforcement of that behavior, it will most likely take a while to break your dog of the habit. In the meantime, it's best to ignore - rather than punish - this attention-seeking behavior. [5] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source In a dog's mind, even yelling at her to stop is considered attention. If you lose your patience and yell at your dog, she will probably bark for even longer next time, because she will have been conditioned to expect any kind of response (even a negative response). [6] X Expert Source Jaimie Scott Dog Owner Trainer Expert Interview. 16 June 2020. If your dog is barking, do not yell at her, or pet her, or give her what she wants. Do not even look at her. The best strategy is to distract yourself, like reading a book or newspaper, until your dog calms down or tires herself out. [7] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Reward good behavior.",
      "content": "Reward good behavior. [8] X Expert Source Jaimie Scott Dog Owner Trainer Expert Interview. 16 June 2020. When your dog finally does stop barking, it's important that you praise and reward her for her silence. Over time, your dog will learn that being silent and obedient will achieve greater results than acting out and barking. [9] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Keep treats on hand for when she does stop barking. Rewards should be given as quickly as possible after the desired behavior to most effectively teach the dog. [10] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Vocally praise your dog when she stops barking. Say, \"Good dog!\" and give her a treat. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source As your dog learns that silence is rewarded with treats and barking is ignored, you'll need to gradually extend the period of time that your dog must be quiet before receiving a treat. For example, once she has passed the initial stages of getting a treat after the barking has stopped, you may want to prolong the required quiet time by a few seconds each day and work your way up to a minute or two before rewarding her. [12] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source For best results, vary the amount of time your dog must remain quiet before getting a treat. That way she won't come to expect a treat after a certain duration of time, and the anticipation will keep her in quiet suspense. For example, after a few weeks of training, alternate between 20 seconds of silence, a whole minute of silence, and 30 or 40 seconds of silence. [13] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Find a replacement behavior.",
      "content": "Find a replacement behavior. One of the best ways to train an animal out of undesirable behavior is to teach her an alternative behavior. That way, instead of growing increasingly frustrated and irritated that you are not responding to her desires, your dog will eventually realize that if she wants to get her way, she'll need to engage in the other, more-desirable behavior. [14] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Teaching replacement behaviors may be time consuming, but ultimately it is the best way to encourage desirable behavior. Instead of responding to your dog's vocal requests to play, for example, teach her to bring her favorite toy to you and set it on the floor. [15] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can also prevent undesirable behavior by reducing the chances of those situations arising. For example, if your dog barks for your help whenever her ball rolls underneath the couch, try putting something under the couch to block her toys from rolling under there. [16] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Continue the training.",
      "content": "Continue the training. Don't stop at discontinuing barking for attention. Continue your training to eventually cover all aspects of request/attention-seeking barking. Eventually, your dog will learn to wait patiently whether she wants to play, eat, or receive pets. [17] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Recognize separation anxiety.",
      "content": "Recognize separation anxiety. Separation anxiety can take various forms in a dog, but the most common signs of separation anxiety are destroying the house/apartment and barking incessantly. These behaviors are typically only engaged in when the dog's owner is at work or otherwise out of the house, and if the dog is not destructive, some owners may not even be aware that their dogs have separation anxiety. [18] X Research source Common signs of separation anxiety to look out for include: following you from room to room, no matter how briefly you are gone [19] X Research source shaking, panting, or crying when you get ready to leave for the day [20] X Research source urinating or defecating indoors while you're not home [21] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source chewing household objects when you're not home [22] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source scratching or \"digging\" at the floor, walls, or doors when left alone [23] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source possible complaints from neighbors about barking or howling when left at home alone [24] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Try counterconditioning your dog.",
      "content": "Try counterconditioning your dog. Counterconditioning is a common treatment method for dogs that typically involves training the dog to associate something fearful with a reward. In the case of separation anxiety, instead of fearing someone or something, the dog fears being left alone. To counter condition separation anxiety, you'll need to train your dog to associate being left alone with something the dog enjoys (like treats). [25] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Whenever you leave the house, try giving your dog a puzzle toy stuffed with food. Something hollow that can be stuffed with treats, spray cheese, or low-fat peanut butter will keep your dog occupied for at least 20 to 30 minutes, which may be long enough for her to forget that she was afraid of you leaving. [26] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source When you get home, remove or hide the puzzle toy(s) so that your dog becomes conditioned to only having access when you're out of the house. [27] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Be aware that counterconditioning typically only works for mild cases of separation anxiety. Though puzzle toys will certainly be enjoyed by your dog no matter how severe her condition, you may need to resort to stronger approaches if your dog suffers from moderate to severe anxiety. [28] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Desensitize your dog to solitude.",
      "content": "Desensitize your dog to solitude. If your dog has moderate to severe separation anxiety, she most likely will not be cured overnight. A good way to get your dog more accustomed to solitude is to gradually desensitize her to being left alone and reinforce the fact that getting ready to leave does not mean abandonment. This is a slow process that will take several weeks of practice and consistency, but should prove effective for long-term results. [29] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Work on pre-departure anxiety by exposing your dog to your various departure cues, like putting on a coat or picking up/jingling your keys. Try engaging in these behaviors at various times throughout the day without actually leaving the house. [30] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Teach your dog to become more comfortable alone by working on \"out-of-sight stays.\" This entails having your dog sit or lie down and then stepping out of the room or otherwise out of sight. [31] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source As your dog gets comfortable with you being out of her sight, try closing a door to block her access to you, and gradually extend the duration of time that you are out of the room or behind a closed door. [32] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Start out doing out-of-sight stays at a low-stakes door, like a bathroom or bedroom door. Do not attempt to jump right to the front door, as this may alarm your dog. [33] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source After several weeks, you should progress to practicing out-of-sight stays at an exit door. But even then, it's best to use an alternate door (if possible) than the one you typically use to leave for work. For example, instead of going out the front door or the door to the garage, try going out the back door. [34] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source As you extend the amount of time that you're out of your dog's sight or behind closed doors, you should incorporate counterconditioning methods like a puzzle toy to keep her distracted. Try adding this component once you're behind closed doors or out the back door for at least 10 to 20 seconds at a time. [35] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. It takes a lot of training and practice to get your dog comfortable with prolonged absences. Most of an anxious dog's undesirable behavior will take place within the first 40 minutes that you're gone, and it will take many, many training sessions before you can comfortably reach a 40 minute absence. [36] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Only increase your absence by a few seconds each training session. Anything more than that may upset your dog and trigger her panic reactions. [37] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Once your dog can be comfortably left alone for 90 minutes, she will most likely be able to handle four to eight hours of solitude. However, in the early stages of that comfort level, it's best to \"test\" your dog at four hours of solitude, rather than jumping right to a full work day (if possible). [38] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you are consistent with your training and practice several times each day on the weekends and at least twice a day on weekdays (such as before work and in the evening), you may be able to accomplish long-term comfort in under a month. [39] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source However, every dog is different, and your dog may need a longer training period or more training sessions each day. Be patient, and remember that your dog is only acting out because she loves you and is afraid you'll abandon her. [40] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Consider alternative arrangements.",
      "content": "Consider alternative arrangements. If your dog absolutely will not calm down in spite of training, or if your landlord or neighbors have expressed impatience with your dog's need for training, you may need to consider alternative arrangements. [41] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source See if you can bring your dog to work with you (depending on your workplace). It may not be ideal, but many offices are dog-friendly, especially if you explain your circumstances to your boss. [42] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Make arrangements for a friend or family member to watch your dog while you're gone. Most dogs only experience separation anxiety if they are left completely alone. In other words, having anyone there will usually help. [43] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Consider crate training. Crate training's success varies considerably from one dog to another. Some dogs are frightened by having to be left in a crate, while others see the crate as their own safe space and an assurance that someone will be home at some point to open the crate. [44] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source In many cases, crates give dogs structure and help them feel safe. [45] X Expert Source Dominik Feichtner Dog Trainer & Behaviorist Expert Interview. 18 March 2021. Seek assistance from a Certified Professional Dog Trainer (CPDT) if all else fails. A CPDT will know how to help your dog in the best way possible. Find a CPDT in your area by searching online, or ask your vet for a recommendation. [46] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Recognize alarm barking.",
      "content": "Recognize alarm barking. Alarm barking is any pattern of barking at perceived intruders. While barking at a real intruder is useful and may save a person's life, barking at perceived intruders like mail carriers, parcel deliverers, or even just neighbors passing by the property can be annoying and troublesome. [47] X Research source Alarm barking does not always require a visual confirmation of the perceived intruder. Some dogs may engage in alarm barking simply from hearing a car door outside or hearing voices on the sidewalk. [48] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Alarm barking is often accompanied by a slight lunge or pounce forward (one to two inches) with each bark. [49] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Teach your dog the quiet command.",
      "content": "Teach your dog the quiet command. The best way to quell alarm barking is by teaching your dog to be quiet on command. Like any training, this will most likely be a time-consuming process that requires patience and consistency. But if you're willing to put in the time and effort, even the most territorial dog will learn to behave better. [50] X Research source When your dog starts engaging in alarm barking, hold up a treat after three or four barks. This will get her attention and will most likely distract her from the perceived intruder. [51] X Research source Wait until she stops barking. Simply be patient and continue to hold up the treat. [52] X Research source Once your dog stops barking, say \"quiet\" in a calm but stern voice and give her the treat. [53] X Research source Repeat this process until your dog learns to associate the word \"quiet\" with her silence. Once your dog has done this successfully on 10 or more occasions, you can begin giving the quiet command without showing her a treat. If she still complies with your command, then give her a treat. If she does not, you may need to show her the treat for several more training sessions. [54] X Research source Eventually your dog will learn to be quiet on command without getting a treat. Even after you've reached this stage of training, however, you should still give your dog verbal praise when she stops barking. [55] X Research source"
    },
    {
      "title": "Apply the quiet command.",
      "content": "Apply the quiet command. Once your dog has learned the quiet command in training sessions, you'll need to apply the quiet command to real-world scenarios. You can do this by having a friend slam a car door in front of your house, rattle your mailbox, or approach your front door. [56] X Research source Have a treat ready every time your friend comes to the door. Even if you've passed the point of giving treats during regular training, you may need to use treats for applied training sessions involving an actual perceived intruder. [57] X Research source When you have someone come to the door pretending to be the mailman, it's imperative that your friend does not leave the porch until your dog is quiet. If he leaves while she is still barking, she may come to think that it was her barking which drove him away. [58] X Research source"
    },
    {
      "title": "Recognize compulsive/boredom barking.",
      "content": "Recognize compulsive/boredom barking. If your dog barks compulsively for no reason, or tends to bark when she's left alone (in the yard, for example), she may be engaging in boredom barking. [59] X Expert Source Jaimie Scott Dog Owner Trainer Expert Interview. 16 June 2020. Dogs that bark when left alone may be experiencing separation anxiety, but there are usually other symptoms which accompany that problem, like destructive behavior, bathroom problems, and following you around when you're home. Common signs of compulsive or boredom barking include: excessive barking in a repetitive pattern [60] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source pacing or running back and forth, usually while barking or shortly before/after barking [61] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source barking whenever left alone (without other signs of separation anxiety) [62] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source barking whenever you stop paying attention to her [63] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Give your dog more exercise.",
      "content": "Give your dog more exercise. Exercise and play time are the best remedies for compulsive and boredom barking. [64] X Expert Source Jaimie Scott Dog Owner Trainer Expert Interview. 16 June 2020. While walking your dog is, of course, an important part of getting her exercise (even if you have a fenced-in yard), it may not be enough. Try having your dog run back and forth between two people for 10 to 20 minutes, chase a ball or toy, or take your dog jogging with you before you leave for work. [65] X Research source Giving your dog at least 20 minutes of vigorous exercise each day is important for her physical and mental well being, and may help reduce incidents of problem behavior like boredom barking. [66] X Research source You should also spend some time each day playing with your dog. You can play hide and seek, or just toss a ball around and have her chase or fetch the ball. [67] X Research source"
    },
    {
      "title": "Teach your dog tricks.",
      "content": "Teach your dog tricks. Learning and practicing tricks is an excellent way to prevent boredom in dogs and discourage compulsive behavior. Tricks require focus, attention, and retention of lessons, which can occupy your dog both physically and mentally. [68] X Research source Once your dog has learned a few tricks, have her perform them everyday. This will help her remember the tricks she's learned and also help keep her occupied and engaged. [69] X Research source"
    },
    {
      "title": "Leave distractions for your dog.",
      "content": "Leave distractions for your dog. In addition to exercise, leaving distractions around the house is a great way to inhibit problem behaviors like boredom barking. You can use a puzzle toy stuffed with peanut butter, or simply toss a handful of treats in various places around the room. You can also leave a radio or television on for the dog so the sound will distract her. [70] X Research source"
    },
    {
      "title": "Meet your dog's needs.",
      "content": "Meet your dog's needs. If your dog is hungry or left out in the yard all day every day, she will probably bark. No amount of training or behavioral techniques will subdue her need for food and comfort. Make sure your dog always has plenty of cool, clean water to drink any time she needs it, two to three nutritious meals each day, and access to the inside of your home."
    },
    {
      "title": "Rule out medical problems.",
      "content": "Rule out medical problems. Sometimes barking is your dog's way of indicating to you that she is injured or sick. If there is a chance that your dog might have some medical problem or injury, you should take her to see a vet as soon as possible. [71] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Use training methods.",
      "content": "Use training methods. Teaching your dog the \"quiet\" command is an excellent training technique. It will be useful for any kind of problem barking, though it may be the only option for certain behavioral problems like territorial alarm barking. [72] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Any time your dog starts barking unnecessarily, hold up a treat to distract her from the perceived intruder. [73] X Research source Once your dog has stopped barking, say the word \"quiet\" and give her the treat. [74] X Research source Gradually lengthen the duration of time she must be quiet before getting the treat. Eventually, she should reach a point where simply saying the word \"quiet\" without showing her a treat will elicit a silent response. [75] X Research source"
    },
    {
      "title": "Give her more exercise.",
      "content": "Give her more exercise. Exercise is a great way to curb problem behavior, including excessive barking. Whether your dog is anxious, territorial, or simply bored, getting a good workout will probably help reduce the frequency and intensity of her problem barking. [76] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Depending on your dog's age and physical abilities, you can exercise her in a number of ways. Long walks are good for older dogs, while younger dogs might enjoy going jogging with you, chasing a ball for a game of fetch, playing tug-of-war, or other interactive toys. [77] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Block what bothers her.",
      "content": "Block what bothers her. If your dog has barking problems whenever she sees or hears something outside, a simple solution might be to block her access to seeing or hearing that trigger. If she stands at the window and barks, try putting up curtains or blinds so she can't see passing people or animals. If the sounds she hears outside tend to set her off, try leaving a radio on during the day to distract her and muffle the sounds outside your home. [78] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Consult an expert.",
      "content": "Consult an expert. There are many different types of dog behavior specialists, each with their own unique qualifications. No matter what kind of expert you choose, you should always check the person's qualifications and look for recommendations or reviews online. If you can't find an expert online, ask your vet for recommendations on an expert who can help your dog with her unique needs. [79] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source [80] X Expert Source Dominik Feichtner Dog Trainer & Behaviorist Expert Interview. 18 March 2021. Trainers are often certified, but not always. Trainers may also go by other titles, such as behavior counselor, pet therapist, and pet psychologist. [81] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Certified Professional Dog Trainers (CPDTs) are certified by an independent organization. In order to become certified, a prospective CPDT must complete a rigorous hands-on training program, pass a standardized test, and provide letters of recommendation. [82] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Behaviorists may have a number of different types of titles, but essentially any kind of behaviorist must have earned a master's degree or a PhD in animal behavior. Typically a behaviorist with a doctoral degree will be called a Certified Applied Animal Behaviorist (CAAB), while a behaviorist with a master's degree will be called an Associate Certified Applied Animal Behaviorist (ACAAB). [83] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Try bark deterrents.",
      "content": "Try bark deterrents. Bark deterrents like anti-bark collars are very unpleasant for dogs, and should only be used as a last resort when no other method has worked. Some people oppose bark collars because of the perception that these bark deterrents are punishment devices. Training works much better than punishment devices, and training will of course provide the best long-term solutions to behavioral problems, but if training hasn't worked for your dog and your landlord has threatened eviction or police intervention, you may need to resort to a bark collar. [84] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Citronella collars deliver a small, short blast of citronella every time the dog barks. These types of collars have been shown to be at least as effective as electronic collars, and do not risk causing any pain or real discomfort to the dog. [85] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Ultrasonic bark collars deliver an ultrasonic noise that only dogs can hear. It is unpleasant for the dog, but does not cause any real pain. [86] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Shock collars are similar to citronella and ultrasonic collars, but instead deliver a brief electric shock to the dog's neck. These collars typically have a number of different settings to change how intense the shock is, and if using one of these collars it is best to use the lowest setting possible to prevent injury to the dog. Again, these should only be used as an absolute last resort. [87] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    }
  ]
}