{
  "url": "https://www.wikihow.com/Display-HDMI-on-a-Laptop",
  "title": "How to Display HDMI on a Laptop: Quickstart Guide",
  "steps": [
    {
      "title": "Get a capture card.",
      "content": "Get a capture card. Most laptops only have HDMI-out ports, not HDMI-in. Unfortunately, there's no way to connect an HDMI device to your laptop's HDMI-out port and see it on your laptop's display without a capture card. A capture card will come in handy if you want to stream your Nintendo Switch to Discord through your laptop, stream gameplay from other consoles to Twitch, or record video from other sources. If you don't want to get a capture card, you may be able to project your device to your laptop wirelessly . If your laptop does have an HDMI input, you can use software like OBS Studio to display the other device's video on your screen."
    },
    {
      "title": "Install OBS Studio on your laptop.",
      "content": "Install OBS Studio on your laptop. You can get it from https://obsproject.com ."
    },
    {
      "title": "Connect the devices to the capture card with HDMI cables.",
      "content": "Connect the devices to the capture card with HDMI cables. As long as the other device has an HDMI output, you'll have no problem displaying it on your screen using your capture card. You'll need two HDMI cables—one for the other device, and one for your laptop. You'll also need to connect the capture card to your computer using its USB cable, which may be USB-A or USB-C. This is to ensure your laptop recognizes the capture card."
    },
    {
      "title": "Open OBS Studio and create a new source.",
      "content": "Open OBS Studio and create a new source. When you launch OBS, go through the automatic configuration wizard, which will take you through some basic settings. Once finished, click + and select Video Capture Source to tell OBS to use your connected capture card. [1] X Research source"
    },
    {
      "title": "Select your capture card from the \"Device\" menu and click OK.",
      "content": "Select your capture card from the \"Device\" menu and click OK . As long as your capture card is connected to a USB port on your computer, you should see it on the list. [2] X Research source Once selected, you'll see a preview on the screen. Feel free to tweak the properties on this screen for the best quality before clicking OK to display the HDMI source on your laptop's screen."
    },
    {
      "title": "Open your Projection Settings.",
      "content": "Open your Projection Settings. Use the search field in the lower left-hand corner of your Windows taskbar. You may also access it by holding down ⊞ Win + K simultaneously, and clicking \"Projection Settings\" on the pop-up page. [3] X Research source The software for your PC's projection settings is called \"Miracast\" and the settings may be named accordingly on older editions of Windows. From Windows 8 onwards, however, the section will be labeled with the aforementioned \"Projection Settings.\""
    },
    {
      "title": "Activate Wireless Display.",
      "content": "Activate Wireless Display. You must first add \"Wireless Display\" as a feature to use any of your projection settings. The \"Projection Settings\" homepage will prompt you to do so, allowing you to return to the page immediately after. [4] X Research source If Windows does not prompt you to activate \"Wireless Display,\" you can do so manually by visiting the \"Add or remove programs\" section of your computer's settings, clicking on Optional features , then Add a feature , and searching for \"Wireless Display.\" To complete the feature's installation, simply click on it and select Install . If you have already used your PC's projection settings in the past, you likely already have \"Wireless Display\" activated. If you are unsure, see whether you can interact with any of the options on the \"Projection Settings\" page. A PC without \"Wireless Display\" activated will gray out everything on the page."
    },
    {
      "title": "Set your PC to be available for projection from other devices.",
      "content": "Set your PC to be available for projection from other devices. You can do this from the first drop-down menu on the \"Projection Settings\" page. Choose from one of two options: Available everywhere. This setting allows you to project to your PC from any location on any network. Available everywhere on secure networks. This setting allows you to project to your PC only when connected to a secure/trusted network, such as your home network."
    },
    {
      "title": "Adjust other settings as needed.",
      "content": "Adjust other settings as needed. The \"Projection Settings\" page includes a few different options. Tinkering with these settings is not necessary, but you may want to change a few things depending on your needs: Ask to project to this PC. In the second drop-down menu on the page, you can either choose to be asked for your approval every time you try to project to your PC or to be asked only the first time you try to project to your PC. Require PIN for pairing. For added security, you may opt to require a PIN every time a device tries to project onto your PC. Because you have to confirm your willingness to project from your second device anyway, we recommend turning this setting off. [5] X Research source Towards the bottom of the page, you may also decide whether or not you can project to your PC when it is not plugged into a power source. You may also rename your PC to make it easier to discover on other devices."
    },
    {
      "title": "Open the Connect app.",
      "content": "Open the Connect app. Atop the \"Projection Settings\" page, Windows will remind you to use the \"Connect\" app when trying to project to your PC. Click on this message, and the app will load. In the future, you can load the app from anywhere on your PC by holding ⊞ Win + P simultaneously."
    },
    {
      "title": "Prepare your second device (laptop/phone) for projection.",
      "content": "Prepare your second device (laptop/phone) for projection. Projecting to your laptop is slightly different depending on whether you are trying to send content from a PC or a phone: On a PC, right-click the Notifications Center in the bottom right corner of your screen. Then, select Connect from the notifications menu at the bottom of the pull-out page. On an Android or Windows device, simply select Cast from your notifications panel, and look for your laptop amongst the available options. You may also search your Android's settings for \"Cast.\" [6] X Research source"
    },
    {
      "title": "Connect to your laptop's display.",
      "content": "Connect to your laptop's display. Select your laptop from the available options on either the projection panel on your PC or the \"Cast\" section of your mobile phone. If your laptop does not appear, it may be an older model or may not include an Intel HD graphics card. You should still be able to connect to it from a PC by navigating to your PC's Display Settings and clicking Detect to make your PC manually search for another wireless display."
    },
    {
      "title": "Confirm the connection.",
      "content": "Confirm the connection. On the laptop you intend to use as a second display, approve the attempt to connect from the PC/smartphone. Depending on which settings you choose, you may be able to skip this step."
    },
    {
      "title": "Right-click on your desktop for your PC's Display Settings.",
      "content": "Right-click on your desktop for your PC's Display Settings. Be sure to do this on the PC whose content you are projecting to your laptop."
    },
    {
      "title": "Choose Extend desktop to this display under Multiple Displays.",
      "content": "Choose Extend desktop to this display under Multiple Displays. The \"Multiple Displays\" section of your display settings includes several options that only appear when connected to another display. While connected, be sure to extend your desktop to the second display so that you can perfectly match the two displays. You should now be ready to use your second display as if it was connected via HDMI."
    }
  ]
}