{
  "url": "https://www.wikihow.com/Get-Urine-Out-of-Memory-Foam-Mattress",
  "title": "How to Clean Pee Out of a Memory Foam Mattress & Get the Smell Out",
  "steps": [
    {
      "title": "Remove and wash your bedding in warm water.",
      "content": "Remove and wash your bedding in warm water. Take off your covers, sheets, and pillowcases and throw them in your laundry machine. If your mattress has a removable and washable protective cover, wash it, too. [1] X Research source Wash your covers, sheets, and mattress protector in the warmest water that’s safe for them. Hot water is effective at killing germs and deodorizing fabric. Check the care label on your bedding and protector to determine what water temperature and wash cycle are safe for them so they don’t get damaged. If your bedding is very smelly, remove the urine smell by adding 1 cup (237 ml) of white distilled vinegar to the washer’s drum. Or, use an enzyme-based detergent ."
    },
    {
      "title": "Blot the urine stain with a clean white cloth or paper towel.",
      "content": "Blot the urine stain with a clean white cloth or paper towel. Cleaning expert Nat Ismaeil say to repeatedly dab the urine stain with a cloth or paper towel to absorb as much of the liquid as possible. Do not rub or scrub the spot, as this can cause the urine to soak deeper into your mattress. [2] X Research source House cleaning professional James Sears recommends putting on a pair of cleaning gloves as you blot and clean the stain to protect your skin."
    },
    {
      "title": "Spray the stain with white vinegar and water until it is damp.",
      "content": "Spray the stain with white vinegar and water until it is damp. Fill a spray bottle with 1 part white distilled vinegar and 10 parts cool water. Then, lightly spray the stain so it’s damp, but not soaking wet. [3] X Research source White vinegar is great for cleaning urine stains because it kills bacteria, neutralizes smells, and lifts stains. [4] X Research source The vinegar smell usually disappears as the vinegar dries and evaporates. Add a few drops of your favorite essential oil , like lavender or lemon, to give the cleaner a fresher scent. Note : Memory foam mattresses are more absorbent than regular mattresses, so they take longer to dry. Soaking your mattress can make your mattress difficult to dry, which can cause mold and mildew to grow."
    },
    {
      "title": "Let the vinegar sit for 15 minutes, then blot it with a white cloth.",
      "content": "Let the vinegar sit for 15 minutes, then blot it with a white cloth. Leave the vinegar to clean the urine stain and remove the smell for about 15 minutes. Then, grab a clean white cloth or paper towel and dab at the spot. This soaks up the urine stain and removes any excess moisture so your mattress dries faster. [5] X Research source"
    },
    {
      "title": "Sprinkle baking soda on top of the stain and let it sit for 8 hours.",
      "content": "Sprinkle baking soda on top of the stain and let it sit for 8 hours. Ismaeil says baking soda is a powerful deodorizer that also absorbs moisture. [6] X Research source Simply sprinkle a light dusting of baking soda over the urine stain and leave it be for at least 8 to 12 hours. [7] X Research source This gives the baking soda plenty of time to neutralize any odors and draw out any remaining urine. The baking soda might bubble when you sprinkle it on the stain. This is a natural reaction when baking soda and vinegar mix."
    },
    {
      "title": "Vacuum up the baking soda and let the mattress completely dry.",
      "content": "Vacuum up the baking soda and let the mattress completely dry. Use a small handheld vacuum or a brush attachment to clean off the baking soda on your mattress. Then, dry the spot completely. Leave your mattress in a well-ventilated room, turn on an overhead fan, and open your windows. [8] X Research source Note : It can take memory foam mattresses several days to completely dry because they are so dense. House cleaning professional Amy Mikhaiel also recommends taking the mattress outside to dry in the fresh air. Speed up the drying process by placing fans directly over the stain and leaving the mattress in the sun for up to 30 minutes each day. Do not use heat to dry the stained spot, as heat can damage memory foam. Do not put any bedding on your mattress until it is dry to prevent mold and mildew from growing."
    },
    {
      "title": "Apply more cleaner if the stain or smell isn’t gone.",
      "content": "Apply more cleaner if the stain or smell isn’t gone. Once the mattress is completely dry, check that the stain and urine odor are completely gone. If the mattress still smells or the spot is still visible, spray on more vinegar cleaner and sprinkle on more baking soda until the stain is gone. Add more vinegar to the spray bottle to make the cleaner more potent, if needed. If the stain and smell are still present after reapplying the vinegar cleaner, use the method below to get rid of the urine stain."
    },
    {
      "title": "Take off the bedding on the mattress and wash it.",
      "content": "Take off the bedding on the mattress and wash it. Strip your bed of your covers, sheets, and pillowcases. If your mattress has a protective cover that’s removable and washable, take it off too. Then, wash your bedding in your laundry machine. [9] X Research source Use the warmest water that’s safe for your bedding, as hot water helps disinfect and deodorize fabric. Read the care labels on your bedding to determine what water temperature and washing cycle are safe to use."
    },
    {
      "title": "Spray the stain with hydrogen peroxide, baking soda, and dish soap.",
      "content": "Spray the stain with hydrogen peroxide, baking soda, and dish soap. Fill a spray bottle with 1 cup (237 ml) of 3% hydrogen peroxide, 3 tablespoons (51 g) of baking soda, and a squirt of dish soap. Mix the ingredients together and then spray the urine stain so it’s damp but not soaking wet. [10] X Research source Ismaeil says hydrogen peroxide is a powerful disinfectant and stain remover. It works through oxidation, which kills germs and lifts off stains. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Feel free to add a few drops of your favorite essential oil to the cleaner, or squeeze in some lemon juice for a fresh scent. Note : Hydrogen peroxide can potentially bleach your mattress, so spot-test the cleaner on a hidden spot before spraying it on the stain. Note : Do not soak the mattress with cleaner, as memory foam is dense and takes long to dry. Lightly dampening the spot helps prevent mold and mildew from forming."
    },
    {
      "title": "Let the cleaner sit for 15 minutes and then blot it with a white cloth.",
      "content": "Let the cleaner sit for 15 minutes and then blot it with a white cloth . Allow the hydrogen peroxide to soak into the urine stain for about 15 minutes. Then, use a white clean cloth or paper towel to dab and blot at the spot. This lifts up the stain and helps remove excess moisture. [12] X Research source"
    },
    {
      "title": "Pour baking soda on top of the stain and let it sit for 8 to 12 hours.",
      "content": "Pour baking soda on top of the stain and let it sit for 8 to 12 hours. Apply a light dusting of baking soda directly on the urine stain. Then, leave it to sit for at least 8 hours. [13] X Research source Sears says the baking soda works to neutralize odors, absorb moisture, and sanitize the mattress."
    },
    {
      "title": "Sweep up the baking soda and allow the mattress to dry.",
      "content": "Sweep up the baking soda and allow the mattress to dry. Use a brush attachment or handheld vacuum to clean up the baking soda on your mattress. Then, keep your mattress in a well-ventilated room to dry it completely. Turn on an overhead fan and open any windows to help it dry faster. [14] X Research source Note : It can take several days for your memory foam mattresses to completely dry. Place fans on top of your mattress or leave it in direct sun for up to 30 minutes to help speed up its dry time."
    },
    {
      "title": "Apply more cleaner or switch to a stronger cleaner if the stain isn’t gone.",
      "content": "Apply more cleaner or switch to a stronger cleaner if the stain isn’t gone. If your mattress still has a visible stain or smells like urine, Ismaeil recommends spraying it with more hydrogen peroxide cleaner and apply more baking soda. Or, spray it with an enzyme cleaner . [15] X Research source Ismaeil says enzyme cleaners are specifically made to remove protein-based stains, like urine, and remove urine odors, especially those caused by pets. [16] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Clean stains as soon as you notice them.",
      "content": "Clean stains as soon as you notice them. The best way to keep your memory foam mattress clean and extend its lifespan is to remove stains as soon as they happen. Simply blot the stain with a white cloth or paper towel. Then, spray it with a vinegar and water mixture or a dish soap and water mixture. Simply sprinkle baking soda on top to absorb odors and moisture. [17] X Research source Let your mattress completely dry before putting your mattress protector and bedding back on."
    },
    {
      "title": "Put on a waterproof mattress protector.",
      "content": "Put on a waterproof mattress protector . To prevent urine and other spills from staining your mattress, protect it with a waterproof mattress protector. This covers all sides of your mattress to keep liquids, dirt, sweat, and bugs from damaging it. [18] X Research source Clean your mattress protector about every 2 months. Read the protector’s care label to determine what water temperature and cycle to use."
    },
    {
      "title": "Vacuum your memory foam mattress",
      "content": "Vacuum your memory foam mattress weekly. Cleaning your memory foam mattress about once per week gets rid of dust, skin cells, and other debris that can degrade it and cause it to smell. Simply use a brush attachment or a small handheld vacuum to sweep the entire mattress. [19] X Research source Clean your mattress when you change your sheets, which you typically wash once per week."
    }
  ]
}