{
  "url": "https://www.wikihow.com/Draw-Countryballs",
  "title": "How to Draw Countryballs",
  "steps": [
    {
      "title": "Draw a circle.",
      "content": "Draw a circle. If you want a perfectly circular one, use a compass. If you don't have a compass, there are many ways to make one yourself. You can also freehand one by sketching a rough oval shape and fixing your sketch by erasing any uneven parts. [1] X Research source It may help to measure out how long you want your radius to be. A circle's radius length is the same from the center to any point on the circumference (edge). You can also draw a long diameter across your paper with a ruler. A diameter goes through two endpoints on the circumference (edge) and through the center of the circle. It is twice the length of the radius, so if you have your radius length, multiply that by two to get your diameter."
    },
    {
      "title": "Add eyes.",
      "content": "Add eyes. You can draw all sorts of eyes for your countryballs. Most countryballs have simple white eyes with black outlines around them, but you can change the shape of the eyes. The eyes are the most expressive part of a countryball since not many are drawn with mouths. Draw them as long ovals (like zeros) to make the countryball look surprised. Try upside-down triangle-shaped eyes for happiness, and chevron-shaped (V-shaped) eyes for sadness. Huge round eyes can indicate shock and fear. To make your countryball look symmetrical, draw a line where you will draw your eyes. Measure the length of that line and figure out how large your eyes should be. You should draw details like this lightly at first in case you want to change them later. Next, measure out a space between the eyes. Lastly, draw the eyes around the space. Crescent shapes also work for the eyes. If you want to draw a sad countryball, draw a crescent with the two points facing upward, or with the two points facing downward for a happy expression. For a bored expression, try two semicircles (straight side up). Turn both semicircles slightly inward to indicate anger, or outward for a scared look."
    },
    {
      "title": "Get a copy of the flag's emblem.",
      "content": "Get a copy of the flag's emblem. Some countries have emblems that are tricky to draw freehand. So, you should print out a copy of the emblem on a piece of paper if you are drawing your countryballs on paper. If you are drawing yours digitally, download a picture of the emblem and upload it to your preferred drawing software/website to start."
    },
    {
      "title": "Trace the emblem.",
      "content": "Trace the emblem. If you are drawing on paper, print out your emblem. Then, put the paper with the emblem behind your drawing paper. If the drawing paper is thin enough, you can easily see the outline of the emblem, which makes it easier to transfer. If you are drawing online, upload the image of the emblem, trace it with line, and fill the colors in last. [2] X Research source If the emblem is symmetrical (such as the Canadian maple leaf), many drawing apps have a symmetry tool that can duplicate your strokes the other side of the mirror line, so you only have to manually draw one side."
    },
    {
      "title": "Draw a circle.",
      "content": "Draw a circle. If you want a perfectly circular one, use a compass. If you don't have a compass, there are many ways to make one yourself. You can also freehand one by sketching a rough oval shape and fixing your sketch by erasing any uneven parts. It may help to measure out how long you want your radius to be. A circle's radius length is the same from the center to any point on the circumference (edge). You can also draw a long diameter across your paper with a ruler. A diameter goes through two endpoints on the circumference (edge) and through the center of the circle. It is twice the length of the radius, so if you have your radius length, multiply that by two to get your diameter."
    },
    {
      "title": "Add eyes.",
      "content": "Add eyes. You can draw all sorts of eyes for your countryballs. Most countryballs have simple white eyes with black outlines around them, but you can change the shape of the eyes. The eyes are the most expressive part of a countryball since not many are drawn with mouths. Draw them as long ovals (like zeros) to make the countryball look surprised. Try upside-down triangle-shaped eyes for happiness, and chevron-shaped (V-shaped) eyes for sadness. Huge round eyes can indicate shock and fear. To make your countryball look symmetrical, draw a line where you will draw your eyes. Measure the length of that line and figure out how large your eyes should be. You should draw details like this lightly at first in case you want to change them later. Next, measure out a space between the eyes. Lastly, draw the eyes around the space. Crescent shapes also work for the eyes. If you want to draw a sad countryball, draw a crescent with the two points facing upward, or with the two points facing downward for a happy expression. For a bored expression, try two semicircles (straight side up). Turn both semicircles slightly inward to indicate anger, or outward for a scared look."
    },
    {
      "title": "Divide your circle into two halves horizontally or vertically depending on your flag.",
      "content": "Divide your circle into two halves horizontally or vertically depending on your flag. For flags like Indonesia's or Angola's, divide them horizontally. For flags like Malta's or Qatar's, divide them vertically. Check your flag to see if it divides evenly. Some flags, such as Qatar's, are divided off center. Don't draw the line over the eyes. You can do that and erase parts of the line that goes through the eyes. You can also draw the line and put gaps that connect to the eyes."
    },
    {
      "title": "Shade in your flag.",
      "content": "Shade in your flag. Shade your first half a color, and shade the second half a different color based on what flag you drew. Because countryballs are spherical, make sure to rotate your paper as you color to make it easier. Color along the curves of the circle instead of coloring straight and filling in the gaps later. Lastly, erase the border line that you drew to separate the two sections. Color very carefully around items of a different color on your flag, such as emblems or other symbols."
    },
    {
      "title": "Draw a circle.",
      "content": "Draw a circle. If you want a perfectly circular one, use a compass. If you don't have a compass, there are many ways to make one yourself. You can also freehand one by sketching a rough oval shape and fixing your sketch by erasing any uneven parts. It may help to measure out how long you want your radius to be. A circle's radius length is the same from the center to any point on the circumference (edge). You can also draw a long diameter across your paper with a ruler. A diameter goes through two endpoints on the circumference (edge) and through the center of the circle. It is twice the length of the radius, so if you have your radius length, multiply that by two to get your diameter."
    },
    {
      "title": "Add eyes.",
      "content": "Add eyes. You can draw all sorts of eyes for your countryballs. Most countryballs have simple white eyes with black outlines around them, but you can change the shape of the eyes. The eyes are the most expressive part of a countryball since not many are drawn with mouths. Make them long ovals to make the countryball look surprised. Try upside-down triangle-shaped eyes for happiness, and chevron-shaped (V-shaped) eyes for sadness. Huge round eyes can indicate shock and fear. To make your countryball look symmetrical, draw a line where you will draw your eyes. Measure the length of that line and figure out how large your eyes should be. You should draw details like this lightly at first in case you want to change them later. Next, measure out a space between the eyes. Lastly, draw the eyes around the space. Crescent shapes also work for the eyes. If you want to draw a sad countryball, draw a crescent with the two points facing upward, or with the two points facing downward for a happy expression. For a bored expression, try two semicircles (straight side up). Turn both semicircles slightly inward to indicate anger, or outward for a scared look."
    },
    {
      "title": "Divide your circle into thirds horizontally or vertically depending on your flag.",
      "content": "Divide your circle into thirds horizontally or vertically depending on your flag. For flags like Austria, divide the circle horizontally. For flags like Belgium, divide the circle vertically. Check your flag to see if the three sections are the same size. [3] X Research source Don't draw the line over the eyes. You can do that and erase parts of the line that goes through the eyes. You can also draw the line and put gaps that connect to the eyes."
    },
    {
      "title": "Shade in your flag.",
      "content": "Shade in your flag. Shade your first third a color, second third a color, and last third another color based on what flag you drew. Because countryballs are spherical, make sure to rotate your paper as you color to make it easier. Color along the curves of the circle instead of coloring straight and filling in the gaps later. Lastly, erase the border lines that you drew to separate the three sections. Color very carefully around items of a different color on your flag, such as emblems or other symbols."
    }
  ]
}