{
  "url": "https://www.wikihow.com/Deal-With-a-Friend%27s-Death",
  "title": "How to Cope with the Death of a Friend",
  "steps": [
    {
      "title": "Attend the memorial to say “goodbye.”",
      "content": "Attend the memorial to say “goodbye.” Participating in ceremonies like funerals, wakes, or shivas help the living say their goodbyes to the deceased. If your friend has a memorial service, try to attend. You might also bring along flowers to place on the casket, or check with the family to see if you can leave a memento in the casket. Sit near their family and/or other friends. Being near others who loved this person will help you grieve."
    },
    {
      "title": "Grieve in the way that works for you.",
      "content": "Grieve in the way that works for you. There are many myths out there about how a person should grieve. The reality is you need to grieve in the way that suits you. This may include crying, shouting, getting lost in your work, or sitting silently. Don’t hold yourself up to any comparisons about what grief should look like—just feel your feelings, however they come. You might find it helpful to do something on behalf of your friend who passed, like creating a memorial for them. [1] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020. If you're more comfortable grieving in private, you might journal, write a letter to your friend, or visit the grave occasionally. [2] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020."
    },
    {
      "title": "Let others help you.",
      "content": "Let others help you. You might want to withdraw from others because you don’t think they can understand. However, it's best to reach out to others rather than keeping to yourself. Talk to friends and family about how you are feeling and ask for their support as well. They may be affected by your friend’s death, too, or they may just want to comfort you. Accept help when others offer to keep you company, talk to you, or bring you food or snacks. [3] X Research source"
    },
    {
      "title": "Channel your feelings into creative pursuits.",
      "content": "Channel your feelings into creative pursuits. Negative emotions may feel awful, but you can actually use this energy to create something new. Focus your grief towards creative activities like writing, painting, or dancing. You’ll find that making art can be therapeutic. When you can’t sleep, eat, or talk, turn to your journal or an empty canvas and release the emotions inside you. [4] X Research source"
    },
    {
      "title": "Try to create something positive out of your friend's death.",
      "content": "Try to create something positive out of your friend's death. Work through your grief by using your friend's death to help others. You could start a charity, raise money, educate the public, or look for other ways to give back. For example, if your friend died from a disease, you could create a charity walk to benefit a nonprofit that finances research into that disease. If your friend died in an accident, volunteer to speak to others about how to avoid such accidents."
    },
    {
      "title": "Take it easy.",
      "content": "Take it easy. Don’t be too hard or set the bar too high for yourself. Be gentle with yourself and do plenty of self-care. You might set a simple goal each day to eat breakfast or shower and get dressed. Such feats will help you feel better about yourself, while still being manageable. [5] X Research source Try to incorporate self-care into each day. Pray, do yoga, meditate, perform a self-massage, read a book, or listen to calming music."
    },
    {
      "title": "Say their name.",
      "content": "Say their name. A lot of times when someone dies, others may have a hard time talking about them without getting upset. However, this makes those who do want to share stories feel isolated. If you feel comfortable talking about your friend, use their name in conversation. They lived and they were very important to you. That doesn’t have to change because they died. [6] X Research source"
    },
    {
      "title": "Request a keepsake from their family.",
      "content": "Request a keepsake from their family. Holding on to an item that was important to your friendship can help you cope with your grief and feel closer to your friend. Reach out to their family in the weeks after the death. Ask if they will allow you to take a special item as a keepsake of your friendship. [7] X Research source For example, you might take the book you lent them that they never returned, or the t-shirt they wore on the day you met. The best keepsakes will have symbolic value for the friendship."
    },
    {
      "title": "Recall fond memories.",
      "content": "Recall fond memories. A great way to remember someone who has died is reliving the good times you shared with them. Spend some time thinking about special occasions you had with the person: birthdays, milestones, and even just days hanging out at home. [8] X Research source Find others who were close to your friend, such as a boyfriend/girlfriend, sibling, or other friends. Talk to these people about them when you want to relive the memories. Spending time with the memories of your friend is a healthy part of the grieving process, and it can help you process how you're feeling. [9] X Expert Source Ken Breniman, LCSW, C-IAYT Licensed Clinical Social Worker & Certified Yoga Therapist Expert Interview. 24 April 2020."
    },
    {
      "title": "Re-visit sacred places or recreate favorite practices.",
      "content": "Re-visit sacred places or recreate favorite practices. Another great way to your friend’s memory alive is by recreating the memories you shared with the person. Just because they are gone doesn’t mean you can’t continue to have lunch at the pizza parlor on Fridays or watch your favorite TV show. [10] X Research source It might be hard at first, but you may find that visiting certain places or doing certain activities may help you feel closer to your friend."
    },
    {
      "title": "Make a scrapbook of your friend's life.",
      "content": "Make a scrapbook of your friend's life. Include photos of your friend at different points in life. Also, include pictures of the two of you together. Write little captions or stories next to the pictures. Look at it when you are feeling down, and share it with other friends. [11] X Research source"
    },
    {
      "title": "Create a digital memorial page.",
      "content": "Create a digital memorial page. You can honor your friend on the internet with a digital memorial page. It's a great way to acknowledge future anniversaries and just generally share your feelings with others. You can even invite mutual friends to work on the page with you. Here is an example of a good memorial page: https://www.muchloved.com/g_home.aspx"
    },
    {
      "title": "Do something cool in your friend's honor.",
      "content": "Do something cool in your friend's honor. If your friend liked riding their bike, find out when the next MS ride is, and ride in your friend's honor. Or, if they were a lifelong reader, start a book club in their memory. Raise money and start a scholarship fund in your friend's name. Find ways to honor your friend by keeping their legacy alive. [12] X Research source"
    },
    {
      "title": "Stick to your routine.",
      "content": "Stick to your routine. At some point, you will feel able to return to your daily life. Things won’t go back to normal, but you can cope with the adjustment by creating a schedule. Having structure can almost feel like a warm blanket when the world has otherwise spun out of our control. So, develop a routine that works for you and stick to it. Think about the things you typically do in a day and write them down in a planner. Allot enough time for different events and activities, like eating lunch or commuting to work or school. Try to keep a stable sleep schedule by waking and lying down at the same times each day."
    },
    {
      "title": "Redefine yourself.",
      "content": "Redefine yourself. The time after a death often leads people to think about the meaning of life. Your friend’s death may have made you more aware of things within yourself you’d like to change. Take some time to decide what kind of person you want to be moving forward. [13] X Research source A death is usually an important time to reflect on your own life and how you wish to live it. Be sure to do some self-reflection and determine if you are living up to your personal values . For instance, maybe you didn’t feel like you spent enough time with family. If so, start making that a priority. Or, perhaps your friend’s life was cut short and you are more inspired to live your own life more fully."
    },
    {
      "title": "Spend time with supportive loved ones.",
      "content": "Spend time with supportive loved ones. In the weeks and months after your friend’s death, it pays to surround yourself with positive and supportive people. This might be another close friend, a sibling, a parent, a teacher, or a spiritual advisor. You might talk about your grief or simply ask the person to support you in some way. [14] X Research source For example, you might say, “I was preparing to apply to college when Jenny died. Can you help me get back on track with my applications?”"
    },
    {
      "title": "Talk to a grief counselor.",
      "content": "Talk to a grief counselor. If you can’t seem to resume your place in the world after your friend’s death, you may need professional help. Some people experience complicated grief. You may blame yourself for the death, stop going to school or work, neglect your appearance, and even have thoughts of suicide. A grief counselor can help you come to terms with the death and learn how to better cope with your emotions. Also, if you are depressed, they may refer you to a psychiatrist who can prescribe antidepressant medications. [15] X Research source"
    }
  ]
}