{
  "url": "https://www.wikihow.com/Get-Rid-of-Centipedes",
  "title": "How to Kill House Centipedes Quickly",
  "steps": [
    {
      "title": "Set up sticky traps in your home's corners and crevices.",
      "content": "Set up sticky traps in your home's corners and crevices. Sticky traps are effective at catching centipedes, and they'll also capture other insects in your home that the centipedes are feasting on. Centipedes will definitely be less interested in hanging out at your house if you eliminate their food source. [1] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Don't forget to check your sticky traps regularly and dispose of the insects. Sticky traps can also alert you to heavy traffic areas. If one of your sticky traps turns out to be really popular, you can focus your efforts there. Sticky traps work best for smaller centipedes. Larger centipedes may walk over sticky traps and escape by simply leaving behind a few of their legs."
    },
    {
      "title": "Spray chemical insecticides around baseboards, windows, and doors.",
      "content": "Spray chemical insecticides around baseboards, windows, and doors. To kill centipedes on contact, look for synthetic insecticides that contain pyrethroids (cyfluthrin, deltamethrin, lambda-cyhalothrin, cypermethrin, permethrin or tralomethrin). Apply the insecticide spray along points of entry like baseboards, cracks, crevices, doors, and windows to create a barrier of protection. [2] X Research source Apply a barrier of insecticide around the exterior of your home, as well, to prevent new centipedes from coming in. Remember that chemical pesticides are poisonous! Read and follow the product's directions carefully, and keep these chemicals away from kids and pets."
    },
    {
      "title": "Use diatomaceous earth or boric acid if you prefer non-toxic options.",
      "content": "Use diatomaceous earth or boric acid if you prefer non-toxic options. Natural dusts like boric acid and food grade diatomaceous earth kill centipedes and work well for continual centipede control. Sprinkle the dust at points of entry (baseboards, cracks, crevices, doors, and windows). [3] X Research source Sprinkle the dust around the exterior perimeter of your home, too, so new centipedes can't make it indoors. If they happen to make it inside, they should be dead or near death by the time you find them. Just wipe or vacuum them up when you see them."
    },
    {
      "title": "Repel centipedes naturally with essential oils like cedar and peppermint.",
      "content": "Repel centipedes naturally with essential oils like cedar and peppermint. Add 20-50 drops of your chosen essential oil to a spray bottle. Then, fill the bottle the rest of the way with water and screw on the nozzle. Saturate entry points and any other areas where you've spotted centipedes with the mixture. [4] X Research source As a bonus, the essential oils will make your home smell lovely. If you're dealing with just a handful of centipedes, spray them with undiluted vinegar to kill them on the spot. [5] X Research source"
    },
    {
      "title": "Hire a professional exterminator to knock out tough infestations.",
      "content": "Hire a professional exterminator to knock out tough infestations. If you've tried everything to get rid of the centipedes and you're still seeing them around your home, it may be time to hire an exterminator. Exterminators crawl your home for potential entrance points, locate and destroy centipede eggs, and spray with effective commercial pesticides to get rid of centipedes for good."
    },
    {
      "title": "Get rid of other pests",
      "content": "Get rid of other pests in your home. Centipedes feast on spiders and other types of small insects that are common in and around residential spaces. Eliminating their food source is a great way to keep centipedes from coming back (and starve out any that are still hanging around). To prevent pests: [6] X Research source Store food in airtight containers and clean up any food spills right away. Remove household clutter like stacks of newspapers, magazines, and cardboard (which pests love to munch on). Get rid of any organic debris, like leaf litter, around your home and always use trash cans with tight-fitting lids."
    },
    {
      "title": "Reduce moisture indoors and keep your home dry.",
      "content": "Reduce moisture indoors and keep your home dry. Centipedes are attracted to moist environments and need moisture to survive; without it, they'll dry out and die. Use a dehumidifier inside your home to get rid of moisture in the air and repair any indoor water leaks that you have. [7] X Research source Run the exhaust fan in your bathroom when you're taking a shower to minimize moisture and humidity. Place packets of silica in the dampest places of your home. Silica is an absorbent that wicks away moisture from the air and ground. Close or block off your sink and tub drains, if possible."
    },
    {
      "title": "Remove organic material around your home's exterior.",
      "content": "Remove organic material around your home's exterior. Place firewood, mulch, tarpaulins, and compost bins away from the perimeter of the house and as far away as possible. Move or dispose of compost, leaves, wood, and any other organic debris in your yard. Trim any shrubbery back at least 1–2 ft (30–61 cm) from the sides of your home. [8] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Clean out the gutters and downspouts around your home, as well. Leaves, branches, and other debris can block the water flow and create the perfect environment for centipedes. Cleaning up clutter in damp indoor areas, like basements, can also discourage centipedes from taking up residence there."
    },
    {
      "title": "Seal cracks and crevices with caulk or expanding foam.",
      "content": "Seal cracks and crevices with caulk or expanding foam . Check around your home for cracks in concrete foundation and fill them in with caulk. It also helps to caulk the spaces around doors and windows to eliminate gaps where centipedes get inside. [9] X Research source Apply weatherstripping to discourage centipedes. Caulk any holes between the walls in your home, and seal sump pump covers with screen and caulk."
    }
  ]
}