{
  "url": "https://www.wikihow.com/Drag-Click",
  "title": "How to Drag-Click on a Mouse",
  "steps": [
    {
      "title": "Drag-clicking is dragging your finger across the mouse button to get multiple clicks quickly.",
      "content": "Drag-clicking is dragging your finger across the mouse button to get multiple clicks quickly. When you drag your finger across the mouse button while applying very light pressure, the friction causes your finger to skip across the mouse button and click the mouse with each skip. Doing so can greatly your improve your click speed . The average person can quick-click at an average rate of about 6 clicks per second (CPS). Someone with really quick fingers may be able to click upwards of 15 clicks per second. Drag-clicking can increase your CPS to more than 30 clicks per second."
    },
    {
      "title": "Purchase a good mouse for drag-clicking.",
      "content": "Purchase a good mouse for drag-clicking. Not all mouses are built for drag-clicking. It has to have the right texture and be able to withstand the pressure of rapid clicking. The material of the mouse buttons should be a textured, matte, or grip surface. The mouse should also be durable with strong switches that can endure the stress of drag-clicking. If your mouse button surface is too smooth for drag-clicking, you may be able to apply different types of tape in order to provide an adequate texture."
    },
    {
      "title": "Clean your mouse.",
      "content": "Clean your mouse. Repeat use of your mouse can leave it covered in gunk and sweat. This can interfere with drag-clicking. Make sure your mouse is clean before you begin. You can clean the surface of your mouse using alcohol wipes. Then dry it using a microfiber cloth. [1] X Research source"
    },
    {
      "title": "Make sure your hands are dry.",
      "content": "Make sure your hands are dry. In addition to making sure your mouse is clean, you also need to make sure your fingers are dry and aren't covered in sweat or liquid. [2] X Research source"
    },
    {
      "title": "Grip the sides of your mouse with your thumb and pinky or ring finger.",
      "content": "Grip the sides of your mouse with your thumb and pinky or ring finger. Start by gripping the mouse the way you normally would with your thumb on the left side and your pinky or ring finger on the right side."
    },
    {
      "title": "Place your index finger at the base of the mouse button.",
      "content": "Place your index finger at the base of the mouse button. Make sure you are not pressing down on the mouse button. You should barely be making contact with the mouse. For a short burst of drag-clicking, place your index finger in the middle of the mouse button rather than at the base of it."
    },
    {
      "title": "Slide your finger forward while arching your wrist.",
      "content": "Slide your finger forward while arching your wrist. Lift your wrist while rotating your thumb and pinky or ring finger. Slide your finger forward from the base of the mouse button to the front. Apply light but even pressure throughout the entire motion. If it worked, you should hear a grinding or rapid-clicking noise. Don't press too hard or it won't be effective. Allow your finger to slide across the mouse button. Your finger should skip across the mouse button like stones skipping across a pond. Different sides of the mouse button make work better than others. If the center of the mouse button doesn't work, try the side or wing."
    },
    {
      "title": "Practice.",
      "content": "Practice. You probably won't master this technique on your first try. You may not even master it in a few hours. It takes lots of practice to get good at drag-clicking. Don't give up. Keep practicing and you will eventually get it. [3] X Research source"
    },
    {
      "title": "Test your speed",
      "content": "Test your speed . Once you get good at drag-clicking, there are many websites you can use to test your click speed and verify that the technique is working. These sites include the following: https://clickspeedtest.com/ https://cpstest.org/ https://www.computerhope.com/issues/ch000816.htm"
    },
    {
      "title": "Use electrical tape.",
      "content": "Use electrical tape. If your mouse buttons are too smooth and not very conducive to drag-clicking, you can apply strips of electrical tape along the length of the mouse button. Electrical tape has the right texture for drag-clicking, plus it is inexpensive and readily available."
    },
    {
      "title": "Use Razer tape.",
      "content": "Use Razer tape. Razer is a tech company that also produces textured tape that is meant to improve your mouse grip. It is also conducive to drag-clicking. It's a little more expensive than electrical tape, but it may be worth it."
    },
    {
      "title": "Drag-clicking is used to improve your click speed in gaming.",
      "content": "Drag-clicking is used to improve your click speed in gaming. The most common game drag-clicking is used in is Minecraft . When building large structures, like a bridge, drag-clicking allows you to place multiple blocks at once instead of one at a time. In a Minecraft PVP battle , drag-clicking allows you to get more hits in while taking less knockback damage. [4] X Research source Drag clicking is also useful in first-person shooters. It allows you to get more shots in and cause more damage."
    },
    {
      "title": "Drag-clicking can wear out your mouse.",
      "content": "Drag-clicking can wear out your mouse. Drag-clicking causes a lot of stress on the switches of your mouse buttons, which can greatly reduce the life of your mouse. It's recommended that you use a good quality mouse that is built sturdily. Good mouses you can use for drag-clicking include the following: [5] X Research source Roccat Kone AIMO Glorious Model O Razer DeathAdder Elite Redragon M711"
    },
    {
      "title": "Drag-clicking may get you banned or booted from some servers.",
      "content": "Drag-clicking may get you banned or booted from some servers. Some multiplayer PVP or PVE servers have limits on how high your clicks-per-second rate can be. This is to prevent players from cheating by using auto-clickers. If they detect that your click speed is too high, you will get kicked out of or possibly banned from the server. Check the rules of any server you are in before using drag-clicking. [6] X Research source"
    }
  ]
}