{
  "url": "https://www.wikihow.com/Develop-Film-on-Disposable-Cameras",
  "title": "How to Develop Film on Disposable Cameras",
  "steps": [
    {
      "title": "Locate a store that processes disposable camera film.",
      "content": "Locate a store that processes disposable camera film. Do an Internet search for film developers in your area. Most drugstores have a film development department that will develop disposable camera film. Some superstores and camera stores will, too. [1] X Research source [2] X Research source"
    },
    {
      "title": "Take your camera in to the store.",
      "content": "Take your camera in to the store. You'll need the whole camera in order to get your film developed. Fill out a film envelope with your name, contact information, and amount of film you're having developed. Drop your camera into the envelope and remove the detachable tag that tracks your film. Once you're ready, you can give the envelope to an employee there or drop it in the film development box. [3] X Research source [4] X Research source The detachable tag will your order number on it. Make sure you hold on to this since you'll need it to pick up your photos when they come in."
    },
    {
      "title": "Wait 7 to 10 days to pick up your photos.",
      "content": "Wait 7 to 10 days to pick up your photos. Depending on the amount of other work the processor has, it can take 7 to 10 business days to get your pictures back. You should receive either a phone call or email telling you that your film is ready and you can pick it up. [5] X Research source"
    },
    {
      "title": "Pay for your prints.",
      "content": "Pay for your prints. The price of your photos will depend on the finish you choose, the size of your prints, and how many copies you order. You may have to pay ahead of time, but some stores will let you pay when you pick up your photos. Make sure you ask ahead of time so you know what to expect. Matte finish photos tend to cost more —up to $2.50 per print for a 4 in (10 cm) by 6 in (15 cm) print. Glossy photos are the cheapest, and can be printed for about $0.50 per 4 in (10 cm) by 6 in (15 cm) print. Larger sizes are more expensive — up to $4 per print for an 8 in (20 cm) by 10 in (25 cm) print."
    },
    {
      "title": "Select a film processor company that accepts film by mail.",
      "content": "Select a film processor company that accepts film by mail. There are a lot of companies that will still develop disposable camera film. Perform an Internet search for \"film processing companies\" or \"companies that develop disposable camera film\" and allow you to mail in your film. Most companies will require that you register on their website before you send the film in. [6] X Research source Some companies that will accept your camera by mail are Kodak, York, and Clark Color Labs."
    },
    {
      "title": "Print your postage labels and order form.",
      "content": "Print your postage labels and order form. Depending on the company, you might be able to print the postage label directly from the website. You'll also need to print out an order form, which you'll include in your envelope. [7] X Research source Some companies will send you a pre-addressed mailing envelope if you ask. Check the website of the company you choose to see if this is an option. You can also call their customer service number."
    },
    {
      "title": "Fill out your order form.",
      "content": "Fill out your order form. The order form will let you choose how many of what size prints you'd like printed from your film. You'll also include your name, contact information, and payment information. [8] X Research source Most companies will accept either a personal check or ask for your credit card information. You'll have to list your credit card number, expiration date, and possibly the security code on the back of your card. The price of your prints will depend on the size, number, and finish of the prints. You can get glossy 4 in (10 cm) by 6 in (15 cm) photos for as little as $.09 per photo, but could pay as much as $3.00 for each 8 in (20 cm) by 10 in (25 cm) print."
    },
    {
      "title": "Take the package to the post office.",
      "content": "Take the package to the post office. Once you've got your order form and postage label, you're ready to send in your film. Stick your postage label on your envelope, and place your order form and camera in the envelope. Then you'll need to take your envelope in to the nearest post office and pay for postage. [9] X Research source Depending on the speed of delivery and where you are, shipping can cost up to $10."
    },
    {
      "title": "Wait about 3 weeks for your prints to come in the mail.",
      "content": "Wait about 3 weeks for your prints to come in the mail. A few things will affect how long it takes to get your prints back, including how much other work the processor has. Once your order is ready and shipped, you might receive a tracking email. [10] X Research source If you're worried about how long you've waited for your prints, call the customer service number for the company you've chosen. They should be able to give you an update."
    }
  ]
}