{
  "url": "https://www.wikihow.com/Find-Your-Astrological-Sun-and-Moon",
  "title": "How to Find Your Sun, Moon, & Rising Signs: A Guide to Your “Big Three”",
  "steps": [
    {
      "title": "Find the sign that corresponds to your birthday.",
      "content": "Find the sign that corresponds to your birthday. The sun sign is probably the easiest sign to find, which is why most people know theirs. All you need to know is your birth date! Since you only have 1 sun sign, just use this list to find the sign that correlates with your birthday: [1] X Research source Aries : March 21 to April 19 Taurus : April 20 to May 20 Gemini : May 21 to June 20 Cancer : June 21 to July 22 Leo : July 23 to August 22 Virgo : August 23 to September 22 Libra : September 23 to October 22 Scorpio : October 23 to November 21 Sagittarius : November 22 to December 21 Capricorn : December 22 to January 19 Aquarius : January 20 to February 18 Pisces : February 19 to March 20"
    },
    {
      "title": "Read traits about your sun sign to reveal your personality and ego.",
      "content": "Read traits about your sun sign to reveal your personality and ego. Most astrologers, like Garbis, agree that your sun sign reveals personality traits that can tell you how you interact with the world and others. In other words, it describes your core identity and essential traits. Do a web search for your sun sign to come up with a detailed zodiac profile. [2] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 14 February 2022. Here are some common sun sign traits for each sign: [3] X Research source Aries : You have leadership skills along with courage and competitiveness. You have a temper, but you're kind and trusting. Taurus : You're practical and stubborn, but you value luxurious things. You're loyal to those you trust and you love routine. Gemini : You're a great communicator, but you can be erratic. Your fun personality and curiosity keep you interested in life. Cancer : You're intuitive and emotional, but you keep a tough shell to protect yourself. You're a caring person, but you'll make others earn your trust. Leo : You love being the center of attention and you're pretty competitive. Your friends are rewarded with your fierce loyalty and warm personality. Virgo : You're known for being practical, logical, and a bit of a neat freak. While your perfectionism can make some signs anxious, you're a supportive, kind person. Libra : You're all about balance and being fair. You work toward justice and finding the equilibrium in all things. Scorpio : You're mysterious and intense with strong energy. You might appear reserved or standoffish, but you keep your emotions close. Sagittarius : You love to travel and you have a fun, adventurous personality. You're known as the philosopher of the zodiac since you thrive on intellectual stimulation. Capricorn : You're a hard worker with an ambitious personality. You're also known for your patience and dedication, so you're a loyal friend. Aquarius : You're the humanitarian of the zodiac. You're caring, eccentric, and progressive, so you love trying new things. Pisces : You have a sensitive nature and are creative. You're caring and known as a bit of a dreamer."
    },
    {
      "title": "Find your exact birth date and time.",
      "content": "Find your exact birth date and time. If you're not sure of the time, check your birth certificate or ask a parent if they remember the time. In order to see where the other planets were when you were born, you need the specifics of your birthday in order to pull up your birth chart . Not sure when you were born and can't find out? Estimate and try to be as close as you can. For instance, if you know that you were born in the morning, pick a time in the morning and use the calculator. Some calculators will let you skip this information, although your moon and rising sign might be incorrect. Eyedealism agrees, saying that “if somebody doesn't know their time of birth, it's very hard to get an exact ascendant” or moon sign. [4] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021."
    },
    {
      "title": "Find out what city you were born in.",
      "content": "Find out what city you were born in. Location is important to get an accurate chart of the sky when you were born. Since the stars and planets appear differently depending on where you're at in the world, you need to know what city you were born in. If you're not sure, check your birth certificate or ask one of your parents. If you still can't find the city of your birth, try to use the state you were born in."
    },
    {
      "title": "Do a web search for \"birth chart calculator\" and plug in your information.",
      "content": "Do a web search for \"birth chart calculator\" and plug in your information. To use the calculator, Garbis says to enter your full birth date, birth time (as detailed as possible), and your birth city. [5] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 14 February 2022. It will probably use a drop-down menu so you can select the correct city. If it asks for your name, you can put your real name or a fake name. Then, hit enter and you'll get your birth chart. [6] X Research source Popular birth chart calculators include Cafe Astrology , Astro-Seek , and Astro . You can also do a search for astrology chart apps that show you your birth chart, like Co-Star , TimePassages , and CHANI ."
    },
    {
      "title": "Read about your moon sign to reveal your emotional self.",
      "content": "Read about your moon sign to reveal your emotional self. According to Garbis, the moon symbolizes your inner self: it represents how you feel or express yourself, your instincts and reactions, and what you need to feel safe. [7] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Look for \"moon\" on your birth chart to find that sign. Then, do a web search for the zodiac sign and read about its emotional characteristics. This helps you learn more about how you react to your emotions and what you need to feel nurtured. Here are the common traits of each moon sign: [8] X Research source Aries : You’re direct with your feelings and unafraid of confrontation. You put your feelings into action and are always go, go, go. So, you can be a bit impatient. Taurus : With your strong and unwavering emotions, you’re a true romantic. You’re focused on building a safe, secure, and stable life, so change can be difficult for you. Gemini : Stimulation and communication are critical to your emotional well-being. You’re driven by curiosity and a desire to socialize—you always seem to be doing a million things at once. Cancer : You’re warm and caring, easily getting in touch with your feelings and reading the emotions of the people around you. You like things that are familiar and can be quite nostalgic. Leo : You’re the entertainer of your friend group and love to make people laugh. Loyalty is vital to your relationships—you crave the constant care and attention that you give your pals, too. Virgo : You’re the happiest when you feel needed and useful to your loved ones. With your practical nature and calm composure, you never let your emotions get the best of you. Libra : You strive for harmony, peace, and balance in everything you do, so you’re not really one to rock the boat. Your relationships are very important to you, so you love for a friend or partner to always be around. Scorpio : Depth and intensity are your superpowers: you dig below the surface to see what makes people tick. You seek out people and experiences that make you grow and feel deeply. Sagittarius : You’re a free-spirit who craves excitement, from meeting new people to going on thrilling adventures. You need change to feel your happiest and tend to run from routine and stability. Capricorn : You prefer to keep your cards close to the chest and make your decisions based on facts and logic. Your goals and ambitions guide you and you easily take control to ensure things get done. Aquarius : You’re fiercely independent and aim to rise above your emotions, so you can come off as detached and distant. However, you’re deeply compassionate and driven to change the world. Pisces : You’re deeply empathetic, putting yourself into the shoes of every person you meet. You’re the happiest when you’re dreaming and expressing your feelings through art."
    },
    {
      "title": "Locate your rising sign on your astrological birth chart.",
      "content": "Locate your rising sign on your astrological birth chart. Also called the ascendant sign, your rising sign is usually listed near the sun and moon signs, which is why it's considered to be one of the \"big three\" signs. You might find that your rising sign is the same as your sun or moon sign, or it might be completely different. [9] X Research source Most birth chart calculators provide you with your rising sign when you look up your sun and moon signs. Like your moon sign, you need your birth time and location to get an accurate result."
    },
    {
      "title": "Do a web search for your rising sign to learn what personality you project.",
      "content": "Do a web search for your rising sign to learn what personality you project. You might have heard your rising sign referred to as the mask that you wear. Eyedealism agrees, saying that your rising sign is your outward or social self and represents “how you're perceived.” [10] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Think of it as a combination of the moon and sun—it's the sign that closely represents how other people see your actions, choices, and character. [11] X Research source Below are the common perceptions of each rising sign: Aries : You come across as direct, sure of yourself, and a bit aggressive. Taurus : You appear determined, reliable, and quite stubborn to others. Gemini : People see you as witty, talkative, curious, and impatient. Cancer : You’re seen as sweet, caring, and a bit shy. Leo : People see you as outgoing, bold, generous, and sometimes self-important. Virgo : You come across as observant, composed, meticulous, and a bit reserved. Libra : You appear easy-going, friendly, fair, and sometimes people-pleasing. Scorpio : People see you as intense, driven, mysterious, and a bit intimidating. Sagittarius : You’re seen as optimistic, enthusiastic, and brave, if not a bit reckless. Capricorn : You come across as competent, responsible, hardworking, and sometimes overly serious. Aquarius : You appear quirky, independent, progressive, and a bit aloof. Pisces : People see you as peaceful, adaptable, idealistic, and sometimes indecisive."
    },
    {
      "title": "Read through your \"big three\" signs to see how they work together.",
      "content": "Read through your \"big three\" signs to see how they work together. Your birth chart gives you information about how your sun, moon, and rising signs affect one another, providing you with a complete look at your personality. Keep in mind that the sun sign represents your core characteristics while the moon sign covers your emotional traits and needs. Then, look at the rising sign to find out what others think when they see you. [12] X Research source Read through the personality profile provided by the calculator you used, or do a web search for your big three combination. For instance, websites like Astrology.com allow you to enter your sun, moon, and rising signs and read about how each sign works together. For example, if you've got a Virgo sun and Gemini moon with a Virgo rising, you're probably pretty practical and logistical most of the time. This is also what people think of you since you've got Virgo as your rising sign. Emotionally, you're curious and have a fun attitude."
    }
  ]
}