{
  "url": "https://www.wikihow.com/Diagnose-and-Treat-Mouth-Ulcers-in-Cats",
  "title": "How to Identify and Treat Your Kitty's Mouth Ulcers: Home Remedies & Vet Tips",
  "steps": [
    {
      "title": "Look for open mouth wounds.",
      "content": "Look for open mouth wounds. Ulcers are typically the most obvious symptoms of a number of oral problems including gingivostomatitis, caudal stomatitis, and chronic ulcerative paradental stomatitis. Check the gums and cheek area for small to medium, round or oblong wounds that may or may not bleed and expose the tissue below. [1] X Research source Ulcers can occur in a number of places within the mouth. Use the length of your finger to gently pull up on your cat’s cheek and check the gums, inner cheeks, tongue, and roof of the mouth. Be sure to check the edges of the tongue, and beneath the tongue as well."
    },
    {
      "title": "Monitor for other oral symptoms.",
      "content": "Monitor for other oral symptoms. If you cannot tell for sure whether your cat has an oral ulcer, look for other symptoms including bad breath, swollen gums, excessive drooling, thick stringy saliva, loss of appetite, and difficulty eating. Look carefully around your cat’s mouth and monitor their eating habits to check for other mouth ulcer symptoms. [2] X Research source Take regular, careful looks at your cat’s teeth and gum lines. Swelling around a tooth, inflammation of the gums, and bleeding at the gum line may all be indicators of an ulcer or a larger oral health problem."
    },
    {
      "title": "Watch for symptoms of feline calicivirus.",
      "content": "Watch for symptoms of feline calicivirus. Ulcers can be symptoms of larger problems, such as feline calicivirus, an upper respiratory infection common in cats. If you notice mouth ulcers in your cat, take note of other calicivirus symptoms such as sneezing, nasal congestion, inflammation around the eyes, and discharge around the eyes and nose. [3] X Research source If you notice symptoms of calicivirus, contact your vet immediately. Let them know what symptoms your cat is experiencing, and when they first started to appear. Your vet may request you bring your cat in for a visit, or may give you instructions for home treatment. Follow your vet’s instructions carefully."
    },
    {
      "title": "Make an appointment for an oral exam.",
      "content": "Make an appointment for an oral exam. If you notice symptoms of ulcers or open wounds in your cat’s mouth, make an appointment for an oral exam with your vet. Your vet can tell you not only whether your cat has ulcers, but also may be able to pinpoint their cause. [4] X Research source If your vet notices ulcers, they may ask for permission to perform x-rays and determine whether there is any additional damage to your cat’s jaw. Let your vet know what symptoms you’ve noticed, including those that aren’t directly related to mouth injuries, swelling, or bleeding. This may help your vet better diagnose underlying medical issues."
    },
    {
      "title": "Run diagnostic tests.",
      "content": "Run diagnostic tests. Depending upon what your vet finds during the oral inspection, they may ask permission to run blood or urine tests to determine the cause of the ulcers. Allow your vet to run the tests, as this can help your vet determine the exact cause of your cat’s ulcers and plan better treatment. [5] X Research source Urine tests are generally not painful for cats, and blood tests cause only momentary discomfort. Ulcers can be symptomatic of other, more significant infections, diseases, and health issues with cats, including chronic kidney disease, feline viral rhinopneumonitis (FVR) and feline immunodeficiency virus (FIV). Proper diagnosis is necessary to lead to proper treatment and better health for your cat."
    },
    {
      "title": "Ask about care options.",
      "content": "Ask about care options. If your vet diagnoses your cat with mouth ulcers or a mouth ulcer-causing condition, ask specific questions about care for your cat. Inquire, “Will my cat need surgery or other immediate treatment?” and, “What sort of long term care should I expect to provide for my cat?” [6] X Research source Treatment of ulcers will depend greatly upon the cause of the ulcers. Follow your vet’s recommendations closely and make appointments with them and with specialists as necessary. The ulcers themselves will probably be treated symptomatically with a mouth rinse and/or pain medication. The underlying cause for the ulcers will need to be treated as well to prevent more ulcers from forming."
    },
    {
      "title": "Treat any infection.",
      "content": "Treat any infection. If you notice discharge, a foul smell, and red and tender areas around the gums, the ulcer may have become infected. Talk to your vet immediately about a prescription for an antimicrobial or antibiotic treatment. [7] X Research source Treatment may be given by topical medication or through ingestion. Be sure to check the packaging and follow instructions for administering the drug carefully."
    },
    {
      "title": "Clean your cat’s teeth.",
      "content": "Clean your cat’s teeth. Regularly brush your cat’s teeth, up to twice a day, to help keep plaque from accumulating and making ulcer-causing conditions worse. Use a soft-bristled or silicone toothbrush and specially formulated toothpaste for cats to gently brush your cat’s teeth on a regular basis. [8] X Research source Wet the toothbrush and apply a small amount of toothpaste. Then, gently massage the brush against your cat’s teeth, focusing on the areas where the teeth meet the gums. Toothbrushes and toothpaste formulated for cats is available at most pet stores, as well as online."
    },
    {
      "title": "Schedule regular vet cleanings.",
      "content": "Schedule regular vet cleanings. On top of cleaning your cat’s teeth, try to schedule oral cleanings regularly with your vet. Talk to your vet about the frequency at which your cat should receive dental cleanings, and try to stick to that schedule. [9] X Research source Regular cleanings also allow your vet the chance to extract diseased teeth, which can help prevent ulcers from spreading or getting worse."
    }
  ]
}