{
  "url": "https://www.wikihow.com/Discord-User-Search",
  "title": "Discord User Search: 4 Ways to Find Discord Users",
  "steps": [
    {
      "title": "Open Discord.",
      "content": "Open Discord. It's the app icon that looks like a controller on a light blue background. You can use this overall search feature on your computer, phone, or tablet. Use this method if you're in the same server with the username you're looking for or have had a conversation with the username. You also have to know the username."
    },
    {
      "title": "Click the \"Find or start a conversation\" text field.",
      "content": "Click the \"Find or start a conversation\" text field. If you're using the mobile app, go to your messages and tap the search icon at the top. You'll see a search field appear."
    },
    {
      "title": "Enter @ and the username you're looking for.",
      "content": "Enter @ and the username you're looking for. As you type, you'll see potential matches of other usernames with similar spelling. This is useful if you don't exactly remember how to spell the username you're searching for. In this search bar, you can search usernames that you've had conversations with or you can search for users that are in the same servers as you. Use @ to find usernames. [1] X Research source You can also enter the names of channels to go there instead of a username, which can be helpful if you only remember that they've texted in a channel, but you don't remember their username. If you're using the mobile app, you can see Recent , People , Media , Pins , Links , and Files . Narrowing the field down can be helpful if you don't remember a username but only remember that they shared a picture with you."
    },
    {
      "title": "Click or tap a search result.",
      "content": "Click or tap a search result. You'll be redirected to the search result that you selected. For example, if you tapped a Media search result on your phone or tablet, you'll go to that media in the conversation. If you tap a username, you'll go to your conversation with them."
    },
    {
      "title": "Open Discord and navigate to the server you want to search.",
      "content": "Open Discord and navigate to the server you want to search. Simply click a server's icon on the left to go to that server. If you're using a phone or tablet, swipe right to open the left panel and tap a server's icon to go to that server. Use this method if you have a server in common and don't remember their server profile name or username. You can search using either name to find their profile."
    },
    {
      "title": "Click or tap the search field.",
      "content": "Click or tap the search field. If you're using a phone or tablet, you'll see the search field at the top of your screen under the server's name. If you're using a computer, you'll see the search field on the right side. If the search button is a magnifying glass only on a phone or tablet, swipe right again to open the server's main window. Pressing this search option filters the search to the channel instead of the server, but you can remove that filter by deleting the text already in the search field."
    },
    {
      "title": "Enter from and click from: user (desktop) or tap from (mobile).",
      "content": "Enter from and click from: user (desktop) or tap from (mobile). On a computer, the \"from\" option will be under the \"Search Options\" header near the bottom of the menu. On mobile, \"from\" will be at the top of the search results and tells you that the search will \"filter messages from a particular user.\" The from: user text will filter users in the server. This is particularly helpful if you know someone's username, but they changed their server profile name to something else. In that case, you'll still be able to find the user you're looking for. You can also use this to search for a user even if you don't remember their server profile name or their username, but only something they said. In that case, use other filters like has: link/embed/file , in: channel name , mentions: user , before/during/after specific date , or pinned true/false . [2] X Research source"
    },
    {
      "title": "Enter the username or server profile name you're looking for.",
      "content": "Enter the username or server profile name you're looking for. If the server is able to locate a user by that server profile name or username, you'll see it appear in the search results. Other similarly-named usernames will appear, which might be helpful if you typo or misspell what's in the search. If you don't remember the username or server profile name, use the other filters to find that user."
    },
    {
      "title": "Click or tap a search result.",
      "content": "Click or tap a search result. You'll be taken to their Discord profile page where you can friend them or send them a message."
    },
    {
      "title": "Open Discord on your phone or tablet.",
      "content": "Open Discord on your phone or tablet. Your computer does not have the functionality needed to add friends from the contact list on your phone. Use this method if the Discord user you're looking for is in your contacts. To appear as a suggested friend, they must have opted to be discoverable this way. Opt in or out of being discoverable by opening the Friend tab in Discord and giving the app permission to access your Contacts. The steps vary depending on the version of the mobile app you're using. For the best results, make sure your app is updated."
    },
    {
      "title": "Tap Add Friends.",
      "content": "Tap Add Friends . This is at the top of the messages screen. If you don't see it, swipe right to open the panel on the left and tap the chat bubble icon to go to \"Messages.\""
    },
    {
      "title": "Tap Find friends.",
      "content": "Tap Find friends . It's a blue button in the middle of your screen. If you don't see it, Discord already has permission to access your contacts and will suggest any friends it finds."
    },
    {
      "title": "Tap Allow.",
      "content": "Tap Allow . Tap Allow in the pop-up menu if prompted. Make sure the toggle is ON next to \"Allow contacts to add me.\" This will let others add you on Discord if you are in their contacts and make you discoverable."
    },
    {
      "title": "Select friends that you want to add and tap Add Friends.",
      "content": "Select friends that you want to add and tap Add Friends . After this initial search, you can always return to \"Add friends\" to see if more of your contacts have opted-in to discoverability and can add them as a friend under \"Suggested Friends.\" Tap Skip if you don't want to add anyone. [3] X Research source"
    },
    {
      "title": "Turn on Developer Mode.",
      "content": "Turn on Developer Mode. Doing this is as easy as switching on a toggle. Go to User Settings > Advanced and click the switch next to \"Developer Mode\" to turn it on. To find \"User Settings\" on desktop, click the gear icon to the right of your profile picture at the bottom of the app. On mobile, get to \"User Settings\" by tapping your name and profile picture at the bottom of your screen, then tap the gear icon in the top right corner."
    },
    {
      "title": "Copy the user ID.",
      "content": "Copy the user ID. Most Discord Search tools that you can find online require the user ID (or UID) to work. If you're using a desktop (desktop app or web browser), right-click on someone's name in a channel or chat with you and click Copy User ID . If you're using the mobile app, press and hold on someone's name in the channel or a conversation with you, then tap the three-dot menu that appears. Tap outside of the main window that pops up and you'll see another window in the background. From there, tap Copy User ID ."
    },
    {
      "title": "Paste the UID into a search tool.",
      "content": "Paste the UID into a search tool. You can use sites like Discord Lookup or Unofficial Discord Lookup to find out more information about a user's account info."
    }
  ]
}