{
  "url": "https://www.wikihow.com/Get-Rid-of-Starlings",
  "title": "How to Get Rid of Starlings",
  "steps": [
    {
      "title": "Put spiky \"porcupine wires\" along ledges where starlings like to roost.",
      "content": "Put spiky \"porcupine wires\" along ledges where starlings like to roost. The prickly wires will prevent the birds from landing and nesting. Since starlings only need 1 inch (2.5 cm) of space to perch, completely cover flat ledges with the wire prongs or you might be surprised to find them cozying up against the spikes! [1] X Research source Want to make your own wire prongs? Cut a wire coat hanger into 6 in (15 cm) lengths and bundle them together. Then, use a staple gun to staple the ends to the ledge and bend the opposite ends of the wires up at different angles so they poke out."
    },
    {
      "title": "Install angled boards or sheet metal to prevent birds from roosting on flat surfaces.",
      "content": "Install angled boards or sheet metal to prevent birds from roosting on flat surfaces. This is a great option if you don't want to install harsh-looking \"porcupine wires.\" Just attach a board or sheet of metal at a 45-degree incline along flat surfaces like ledges and rooftops. [2] X Research source Don't forget to seal the ends of the boards or pieces of metal so the starlings can't get underneath them to nest. If you don't want to keep the boards or metal up forever, you can probably remove them once the starlings have relocated."
    },
    {
      "title": "Remove birdbaths and or keep the water level low in troughs.",
      "content": "Remove birdbaths and or keep the water level low in troughs. If you have puddles, fill them with soil or rocks so water can't collect. If you do have to keep water in a trough for your animals, keep the water level at least 6 inches (15 cm) below the top edge so the starlings can't perch and reach down to drink. [3] X Research source You also don't want water in troughs to be so low that starlings can stand in them and drink. Make sure the water is at least 3 inches (7.6 cm) deep."
    },
    {
      "title": "Stop starlings from getting to birdseed that you set out for other birds.",
      "content": "Stop starlings from getting to birdseed that you set out for other birds. Don't want to remove your bird feeder? If you want birds like finches or chickadees to be able to access the feeders, make the food inaccessible just to the starlings—get 1 inch (2.5 cm) chicken wire and encircle the entire birdfeeder so they starlings can't reach the perches or get at the seed. You could also purchase starling-proof bird feeders that dispense food from the bottom of the feeder. [4] X Research source Starlings have weak legs so it's hard for them to hang upside down to eat from the feeders. Don't worry—birds like woodpeckers, chickadees, and nuthatches won't have a problem hanging upside-down to feed. Avoid setting out cracked corn, sunflower kernels, millet, or suet since these will attract starlings. Instead, put out nyjer seed and safflower seeds for other birds since starlings have a hard time eating them."
    },
    {
      "title": "Frightening devices can scare starlings from your landscape.",
      "content": "Frightening devices can scare starlings from your landscape. Set up a speaker to play recorded distress or alarm calls or set up a gas-operated exploding device that makes a loud, startling sound when it goes off. These startle the starlings so they don't want to nest. Plan on moving the sound devices to a different area every few days. [5] X Research source Frightening sounds work best along with a visual scare so set up things that look frightening to the starlings. Ultra-sonic sound systems don't work against starlings since they can't hear the frequency."
    },
    {
      "title": "Set out shiny objects, things with large eyes, or flashing lights to frighten the birds.",
      "content": "Set out shiny objects, things with large eyes, or flashing lights to frighten the birds. You've probably seen fake predator models like owls, hawks, and foxes. Put these around your yard along with reflective strips, shiny balloons with eyes, or pop-up scarecrows. Having a visual device to frighten the starlings is really effective with a noise-making device. [6] X Research source Mirrors or shiny objects won't frighten other birds away. [7] X Research source Be sure to move the visual scare devices frequently so that the starlings don't get used to them."
    },
    {
      "title": "Spread nylon or plastic netting over trees.",
      "content": "Spread nylon or plastic netting over trees. Starlings like to nest in groups so if you see that they're roosting in a particular tree, cover it with netting. If you've got fruit trees, cover them as well since the starlings are drawn to fruit. It's totally fine to remove the netting once the starlings move on. [8] X Research source You can also attach netting underneath rafters to keep the starlings from nesting in your attic. Check the netting frequently for holes so starlings can't get through or trapped in the material."
    },
    {
      "title": "Check vents, birdhouses, and crevices around your home.",
      "content": "Check vents, birdhouses, and crevices around your home. It's really important to remove nests every time you find them so the starlings won't rebuild their nests. To remove an empty nest, wear gloves and pull out all of the nesting material. If you see young birds or eggs in the nest, wait until they leave before you remove the nest. [9] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Starlings like to nest in vents like dryer, stove, or exhaust fan vents. You're legally allowed to remove starling eggs, but it's against federal law to remove nests or eggs of other bird types."
    },
    {
      "title": "Block off access points that are wider than 1 inch (2.5 cm).",
      "content": "Block off access points that are wider than 1 inch (2.5 cm). Starlings can squeeze through small openings. Attach hardware cloth or metal flashing to small holes that the starlings could use to get into your home. Check any vent on the exterior of your home like your dryer vent, for instance. [10] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source You might see plastic netting or window screening for sale, but these materials aren't strong enough to keep really determined starlings out. Avoid putting metal flaps over vents since starlings will still be able to get through these and into the vents."
    },
    {
      "title": "Remove or cut back trees and vegetation that the starlings roost in.",
      "content": "Remove or cut back trees and vegetation that the starlings roost in. Check your landscape for densely forested areas that the starlings like to nest in. These are usually trees, but starlings also like dense wetland growth. Then, cut back at 30 to 50% of the branches so the starlings are more exposed and less likely to shelter there. [11] X Research source Avoid pruning the tops of the trees or you could encourage the side branches to put on growth which the starlings might prefer."
    },
    {
      "title": "Set out food-baited funnel traps to catch a small starling population.",
      "content": "Set out food-baited funnel traps to catch a small starling population. Although traps aren't effective for a lot of starlings, you can set out a trap if you've got a few year-round starlings. Funnel traps are really easy and effective! Just place the wire funnel trap on the ground and stick some berries or grains in it. The starlings will go in through the wide-end of the funnel to eat, but they won't be able to get back out. [12] X Research source Try to set the traps at least 10 feet (3.0 m) from the nearest building so the starlings aren't startled away from the traps. Traps can be a bit of a hassle since you'll have to drive the captured starlings far from your home in order to release them."
    }
  ]
}