{
  "url": "https://www.wikihow.com/Get-Snapchat-on-Apple-Watch",
  "title": "Easy Ways to Get Snapchat on Apple Watch",
  "steps": [
    {
      "title": "Watch Stories.",
      "content": "Watch Stories. By using your web browser, you can view Stories. If you sign in, you can see your friends Stories, but some other Stories may not be visible."
    },
    {
      "title": "Navigate the Snap Map.",
      "content": "Navigate the Snap Map. If you're using an Apple Watch and your iPhone is near, you can zoom in and out on the Snap Map to see what people around you are sharing."
    },
    {
      "title": "Search profiles.",
      "content": "Search profiles. Once you load Snapchat in your browser, you can tap the search icon in the top left corner to search for specific profiles."
    },
    {
      "title": "Receive notifications from Snapchat.",
      "content": "Receive notifications from Snapchat. If you mirror Snapchat notifications from your iPhone to your Apple Watch, you'll always know when someone reaches out to you or shares new content. While you can receive notifications of new messages, you won't be able to reply from your Apple Watch."
    },
    {
      "title": "Make sure your Apple Watch is connected to the internet.",
      "content": "Make sure your Apple Watch is connected to the internet. If your Apple Watch's paired iPhone is nearby, then you'll automatically be connected to the internet. However, if you're using a 5 or later, you can connect to Wi-Fi networks separately from your iPhone. [1] X Research source"
    },
    {
      "title": "Press and hold the digital crown.",
      "content": "Press and hold the digital crown. If you press and hold it, Siri will open. Wait for Siri to ask what you want."
    },
    {
      "title": "Say \"Google search\" to Siri.",
      "content": "Say \"Google search\" to Siri. The digital assistant will respond with \"What do you want to search for?\""
    },
    {
      "title": "Say \"story.snapchat.com.",
      "content": "Say \"story.snapchat.com. \" You'll see a list of search results on the Watch face. [2] X Research source"
    },
    {
      "title": "Tap a search result for Snapchat and tap Open Page.",
      "content": "Tap a search result for Snapchat and tap Open Page . Once you get to the Snapchat page, you can watch Stories without logging in. You'll instantly see Stories of celebrities, but you can also search for your friends (the most important feature, right?) by tapping the search icon in the top left corner of the screen and typing in their name or username. Alternatively, you can use Siri to navigate to \"Snapchat login\" and log in with your username and password. Typing on the Apple Watch can be very frustrating, so you can skip the login process and continue watching Stories without logging in. Browsing story.snapchat.com, you can use the Map function and you can also tap the search icon to search for specific users."
    },
    {
      "title": "Open Snapchat on your phone.",
      "content": "Open Snapchat on your phone. Tap the app icon that looks like a ghost on a yellow background. Since the Watch does not have a camera, you can only use it as a remote control for your phone. Camera Mode should be active as soon as you launch Snapchat."
    },
    {
      "title": "Position the phone to take the picture.",
      "content": "Position the phone to take the picture. Your Watch should also be on the default watch face screen, which means no other apps are open."
    },
    {
      "title": "Swipe up on your Watch.",
      "content": "Swipe up on your Watch. It'll open the music glance, which shows you the play, fast forward, and rewind buttons for your music."
    },
    {
      "title": "Rotate the digital crown.",
      "content": "Rotate the digital crown. This acts like you're turning the volume up or down on your Apple Watch's music. Since Snapchat allows you to use your iPhone's volume buttons to capture pictures, turning the crown on your Watch will take a picture on your phone. [3] X Research source Repeat to take as many photos as you'd like."
    },
    {
      "title": "Open Settings.",
      "content": "Open Settings. Tap the app that looks like a pair of gears on a grey background."
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . It's in the second group below your name next to a red square icon with a white dot."
    },
    {
      "title": "Tap Snapchat.",
      "content": "Tap Snapchat . Scroll down to find this app in the alphabetical list."
    },
    {
      "title": "Tap the toggle next to \"Allow Notifications\" so it's enabled .",
      "content": "Tap the toggle next to \"Allow Notifications\" so it's enabled . If you want to hear or feel a vibration from your Watch when your Snapchat has a notification, enable the toggle next to \"Sound\"."
    },
    {
      "title": "Open the Snapchat app on your iPhone.",
      "content": "Open the Snapchat app on your iPhone. Tap the app that looks like a ghost on a yellow background."
    },
    {
      "title": "Navigate to Settings.",
      "content": "Navigate to Settings. You can find the gear icon on your profile or you can swipe down. [4] X Research source"
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . It's near the bottom of the menu. [5] X Research source"
    },
    {
      "title": "Tap the box next to \"Enable Notifications\" to check the box .",
      "content": "Tap the box next to \"Enable Notifications\" to check the box . Once notifications are enabled, you'll see more options for which notifications you want to receive."
    },
    {
      "title": "Open the Apple Watch app on your iPhone.",
      "content": "Open the Apple Watch app on your iPhone. Tap the app that looks like a sideways view of an Apple Watch."
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . It's usually in the second grouping of menu options. If you don't see this listing, make sure you're on the \"My Watch\" tab at the bottom of the screen."
    },
    {
      "title": "Tap the toggle next to \"Snapchat\" to enable it .",
      "content": "Tap the toggle next to \"Snapchat\" to enable it . You'll see this under the \"Mirror iPhone Alerts from\" header. With all those settings enabled, you'll be able to get Snapchat notifications on your Apple Watch! [6] X Research source While you'll be able to see messages from Snapchat, you will not be able to reply to them on your Watch. [7] X Research source"
    }
  ]
}