{
  "url": "https://www.wikihow.com/Fill-Fountain-Pens",
  "title": "How to Fill Fountain Pens",
  "steps": [
    {
      "title": "Pull off the cap.",
      "content": "Pull off the cap. The cap is the top of the pen covering the “grip section,” where you hold the pen, and the “nib,” which is the part where the ink comes out."
    },
    {
      "title": "Screw off the barrel.",
      "content": "Screw off the barrel. The barrel is the cover housing the body of the pen, where the ink is held. The most common modern pens will require this step. Older and rarer pens will have self-filling mechanisms that do not require removing the barrel. Instead of a barrel cover, built-in piston or button systems may have a “blind cap” over the screw knob or button."
    },
    {
      "title": "Determine your filling method.",
      "content": "Determine your filling method. If you aren’t sure what kind of method to follow, examine the inside of your pen. Most likely you will have a plastic cartridge, or a piston converter system with a plunger, or a squeeze filler converter system that has a long button on the side of the pen."
    },
    {
      "title": "Find the right cartridge size.",
      "content": "Find the right cartridge size. Some pens use standard sized cartridges (small or large), but other pens use proprietary brands that will not accept the standardized sizes."
    },
    {
      "title": "Remove the cartridge, if one is present.",
      "content": "Remove the cartridge, if one is present. To remove the cartridge, simply pull it straight out from the grip section."
    },
    {
      "title": "Remove a converter, if one is present.",
      "content": "Remove a converter, if one is present. If there is a piston or squeeze converter already in the pen, pull it straight out from the grip section the same way you would a cartridge."
    },
    {
      "title": "Insert a new cartridge.",
      "content": "Insert a new cartridge. Insert the stopper end into the grip section. Push firmly until the stopper is punctured and you hear a click. Ink should begin to flow into the pen."
    },
    {
      "title": "Replace the barrel.",
      "content": "Replace the barrel. Screw the barrel back on over the body of the pen."
    },
    {
      "title": "Keep the pen in a vertical position.",
      "content": "Keep the pen in a vertical position. Hold the pen vertically, nib side down, to let the nib saturate. Place the pen in a small glass or find another means to stand it vertically. It can take up to a couple of hours for the nib to become saturated for the pen to write properly."
    },
    {
      "title": "Remove the cartridge, if one is present.",
      "content": "Remove the cartridge, if one is present. The converter will replace the cartridge. To remove the cartridge, simply pull it straight out from the grip section."
    },
    {
      "title": "Insert the converter, if one is not present.",
      "content": "Insert the converter, if one is not present. Slide the converter straight in toward the grip section. Some will have small “lugs” on the side that you have to line up with open slots. [1] X Research source"
    },
    {
      "title": "Submerge the nib in ink.",
      "content": "Submerge the nib in ink. Submerge the nib fully, up to the grip section, so that the vent hole is beneath the ink."
    },
    {
      "title": "Squeeze and release the converter.",
      "content": "Squeeze and release the converter. If you are using a squeeze converter, squeeze the side of the pen until the ink bubbles. Slowly release your grip, then let go of the converter slowly to allow suction to draw ink into the pen. Squeeze and release the converter again. Repeat this process until bubbles no longer appear in the bottle of ink and your pen is full."
    },
    {
      "title": "Twist the converter to raise and lower the piston.",
      "content": "Twist the converter to raise and lower the piston. If you are using a piston converter, twist the end of the pen counter-clockwise, which will cause an internal plunger to move up or down. Then twist in the other direction to draw the plunger up to draw ink into the tube. You may need to raise and lower the piston a number of times to completely fill the pen with ink. Remove any air pockets. If the ink converter was totally empty when you started, you might notice that you can’t fill the ink all the way to the top due to a pocket of air. To remove the air pocket, twist the plunger counter-clockwise to empty all of the ink along with the air, then refill. [2] X Research source Squeeze out a few drops of ink. Remove the nib from the ink, and twist the piston counter-clockwise until a couple of drops of ink come out. This will prime the pen for writing."
    },
    {
      "title": "Clean excess ink from the nib.",
      "content": "Clean excess ink from the nib. Use a rag or paper towel to remove any ink still on the nib."
    },
    {
      "title": "Replace the barrel.",
      "content": "Replace the barrel. Screw the barrel back on over the body of the pen."
    },
    {
      "title": "Unscrew and remove the barrel.",
      "content": "Unscrew and remove the barrel. Unlike in cartridge or converter pens, the barrel is not a housing for a cartridge or a converter, but is a reservoir for the ink itself."
    },
    {
      "title": "Clean the barrel.",
      "content": "Clean the barrel. If you have a new pen, or if you are changing colors of ink, clean the barrel using a cotton swab."
    },
    {
      "title": "Grease the threads.",
      "content": "Grease the threads. To avoid ink from leaking, you’ll want to create a water-tight seal where the barrel screws into the grip section. Apply silicon grease to the threads. Screw the barrel on, and then screw the barrel off to spread the oil in between the threads."
    },
    {
      "title": "Fill the pen using an eyedropper.",
      "content": "Fill the pen using an eyedropper. Dip the eyedropper into the ink bottle, drawing ink into it. Place the tip of the eyedropper into the upright barrel, and release the ink, filling the barrel. Fill the barrel to the bottom of the threads. You can also use a syringe instead of an eyedropper."
    },
    {
      "title": "Screw the grip section into the barrel half way.",
      "content": "Screw the grip section into the barrel half way. Place the grip-section on the barrel, and begin screwing it in."
    },
    {
      "title": "Turn the pen right-side up (nib down) and finish screwing in.",
      "content": "Turn the pen right-side up (nib down) and finish screwing in. Doing this will cause a couple of drops to come out of the feed, priming the pen for writing."
    },
    {
      "title": "Clean excess ink from the nib.",
      "content": "Clean excess ink from the nib. Use a rag or paper towel to remove any ink still on the nib."
    },
    {
      "title": "Fill a vacuum filler pen.",
      "content": "Fill a vacuum filler pen. In a vacuum filler pen, there is a plunger that remains inside the barrel. Removing the knob will free the plunger to move up and down. Pull up the plunger to create a vacuum inside the pen. Then push the plunger down. As the plunger reaches the wider, flared part of the pen, it will break the vacuum and cause ink to be drawn into the barrel. [3] X Research source"
    },
    {
      "title": "Fill a lever pen.",
      "content": "Fill a lever pen. A lever pen will have a have a lever in the middle of the pen to compress a sac. To fill the pen, first lift the lever, then dip the nib in ink. Push the lever back into place and wait for a few seconds. Then, snap the lever back into place. You might need repeat this step a couple times until the pen fills."
    },
    {
      "title": "Fill a button pen.",
      "content": "Fill a button pen. A button filler pen uses a button to compress a sac, which then creates suction to draw ink into the pen. To fill, take off the blind cap on the end of the pen. Push and hold the button down, compressing the sac. Dip the nib into the ink, then release the button to fill the pen. [4] X Research source"
    }
  ]
}