{
  "url": "https://www.wikihow.com/Get-Over-a-Broken-Engagement",
  "title": "How to Get Over a Broken Engagement",
  "steps": [
    {
      "title": "Clarify the new reality.",
      "content": "Clarify the new reality. Is this the end of the engagement only, or is it the end of the relationship altogether? Some people just get cold feet from the big vow. That does not mean they do not love you, but are afraid of constraints, or have other issues. if this is the case, and the other party does not wish to end the relationship, you should get counselling to discuss 1) how you ended up here 2) who pushed who, with what, that such an abrupt motion had to take place 3) why did the engagement had to be blown up, why could it not be slowly dissolved (eg, in case of breaking it before a wedding)?"
    },
    {
      "title": "Try to accept your new reality.",
      "content": "Try to accept your new reality. If you weren’t the one who instigated the breakup, it might be hard to come to terms with your situation. You might dwell on what you did wrong and wonder what you could have done differently. Beating yourself up for not seeing the red flags preluding your failed relationship won’t help matters. Practice acceptance instead. [1] X Research source You can learn to do this by catching yourself whenever you are playing into the “shoulda, woulda, coulda's of your relationship.” Tell yourself to stop and repeat an affirmation like “That marriage was not meant for me. There’s something better on the horizon.”"
    },
    {
      "title": "Practice self-care.",
      "content": "Practice self-care. The end of any relationship is never easy, especially when marriage is in the equation. You are probably hurting emotionally, even if you were the one who broke off the engagement. Be gentle with yourself. Make self-care a regular part of your routine. [2] X Research source You might visit a spa for a massage, go to a yoga class, or read a good book to do something special for yourself."
    },
    {
      "title": "Pick up a new hobby.",
      "content": "Pick up a new hobby. It's important to stay busy after a breakup. You can do this by participating in a new hobby or taking on a new project, such as redesigning your place. Engaging in hobbies and activities can also help you re-establish your identity and meet new people. [3] X Research source Try joining a workout class at your gym, learning to play a musical instrument, or exercising your creativity by painting and decorating your home. Try coloring apps or use colored pencils to ease some of your tension and hurt."
    },
    {
      "title": "Get away.",
      "content": "Get away. Were you and your ex planning a honeymoon? If so, try to cash in your ticket and choose a new destination. Go on your own and experience a new culture, or ask a friend to join you. When you return, you might feel more relaxed and ready to take on life as a newly single person. [4] X Research source"
    },
    {
      "title": "Celebrate your own resilience.",
      "content": "Celebrate your own resilience. Whether it was your idea or your mate’s, breaking off an engagement probably doesn’t feel so great. At first you may have wondered how you would even survive the fallout—but you did. Acknowledge your strength and spirit for getting through a really tough life ordeal. [5] X Research source As time passes, you may even journal about your experience so that you can reflect on your strength one week, two weeks, and even months afterwards."
    },
    {
      "title": "Take your time before dating again.",
      "content": "Take your time before dating again. Now that you’re newly single, you may want to rush back out there in pursuit of love. Give it some time first, though. You owe yourself and the next person the integrity of fully getting over your broken engagement before entering into a new relationship. Spend some time getting reacquainted with your identity as a single person and with your dreams for the future. Start back dating when you have mostly healed from your failed relationship and are able to approach a new relationship without any old baggage. Many would-be brides and grooms find that a broken engagement helps them clarify what they really want so they can have more successful relationships in the future."
    },
    {
      "title": "Lean on friends and family.",
      "content": "Lean on friends and family. A good support system is vital to moving on from a broken engagement. Reach out to your closest friends and family—not just to help you dissolve the wedding plans, but to receive their love and encouragement. Being around people who love and cherish you will help your self-esteem and allow you to heal faster. [6] X Research source Don’t hesitate to let people know when you need to talk or just hang out so you’re not alone. If you want to talk about the relationship, consider asking your closest confidants their impressions of your ex-fiance."
    },
    {
      "title": "Read wedding-related blogs and forums.",
      "content": "Read wedding-related blogs and forums. A large number of weddings are called off each year. Because of that, there is a range of online media to help would-be brides and grooms navigate this unfamiliar terrain. You might be feeling a bit lonely or misunderstood because your best friends or family can’t relate to your situation. If so, browse different wedding-related blogs and forums to communicate with others who have walked in your shoes. Look up blogs and forums on TheKnot.com, Brides.com and check out the blog A Practical Wedding for support and advice. [7] X Research source"
    },
    {
      "title": "Talk to a counselor.",
      "content": "Talk to a counselor. If you were blindsided by your broken engagement or if you can’t come to terms with your relationship ending, seeing a professional counselor may help. This person can help you find closure about your broken engagement and create a strategy for you to reengage with your life and your dreams. [8] X Research source Ask your family doctor for suggestions of counselors in your area or check the local listings on PsychologyToday.com."
    },
    {
      "title": "Delegate responsibility for handling logistical details.",
      "content": "Delegate responsibility for handling logistical details. You and your ex will need to handle logistical details like canceling the venue rental, the entertainment, the flowers and décor, the cake and the honeymoon plans. Because of the strong emotional fallout after the wedding, you might ask family and close friends to assist you in handling these matters. [9] X Research source Regardless, the burden for cancelling everything and retrieving deposits (if possible) should be shared by the would-be bride and groom."
    },
    {
      "title": "Decide what to do with the ring.",
      "content": "Decide what to do with the ring. Once the wedding has been fully cancelled, you and your ex need to discuss what will happen to the engagement ring. This decision varies among couples. The general rule of thumb is whoever decided to call off the wedding didn’t hold up their end of the bargain, and therefore, doesn’t get the ring. One exception to this rule involves rings of extraordinary value or family heirlooms. In such cases, the ring should be returned to the family it belongs to. [10] X Research source"
    },
    {
      "title": "Temporarily cut contact with your ex as soon as possible.",
      "content": "Temporarily cut contact with your ex as soon as possible. After all the logistical issues have been sorted, the best course of action may be to block contact with your former partner. Either they crushed you with the news or vice versa, but it’s probably for the best if you two don’t communicate right now. Give yourselves space to recover after the breakup. [11] X Research source If you can’t stop yourself from keeping tabs on your ex’s social media profiles, delete or unfriend them. Similarly, if you worry you might send a ranting email, delete their email address and add their number to your phone’s block list. Note that the fact that you two have not worked out for some reason should not affect your opinion of their personality in the sense that you were with them for a reason, and that reason was that you considered them worthy of your attention. Starting to talk bad about them now would only evaluate yourself as well for you were the one with them until now. This is not to say that you cannot be angry - especially with sudden breakups like one before an engagement - is usually unexpected, and shocking. It is OK to be taken aback or feel hurt, or angry over the events, but a way of getting over these is to understand why it happened. Before you cut contact for a while (to calm down, get unattached, etc), try and communicate to understand both your choices, or at least make it apparent that later this would be needed (the other party may be ashamed to discuss, etc, at this point in time, they might need time too, but may be willing to do it at a later point). Should the other party not be a partner in discussing the reasons that lead to the engagement be broken up, you probably should seek counselling - talk it through with them, if not the other affected party."
    },
    {
      "title": "Get rid of reminders.",
      "content": "Get rid of reminders. If your home is surrounded with reminders of your failed engagement and wedding (if not relationship), put them away - at least for the time being. Ask friends to help you toss out any wedding-related items such as invitations. Donate any wedding decor that could be used for other events, or try to resell them to recoup costs. If the failed engagement also brings the end of the relationship (NOT necessarily!), then cutting the entire thing out of your life would be cutting a part of yourself out - rather, put it away so that it is out of sight, out of mind. You can take the fondest memories out when they no longer hurt & remember what good you had, after all, that is why you were together. In addition, go through your home and gather any reminders of your ex and your relationship. Return items belonging to your ex and box up everything else to be stored for a later date, donated or trashed. If you are still too emotional, see if friends and family can help you with this step."
    }
  ]
}