{
  "url": "https://www.wikihow.com/Download-PowerPoint",
  "title": "How to Install and Download PowerPoint on Any Device",
  "steps": [
    {
      "title": "Open the Google Play Store or App Store .",
      "content": "Open the Google Play Store or App Store . If you're using an Android phone or tablet, you'll have access to the Google Play Store; if you're using an iPhone or iPad, you'll need to use the App Store. You must have a Microsoft 365 subscription to use PowerPoint. If you don't have an account, you won't be able to save your project. Keep in mind that the mobile app has some limitations depending on your plan. For example, some plans have a screen size limit of 10.9 inches. If you're using an iPad Pro (12.9 inches), you'll need to have a plan with desktop access. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Search for PowerPoint.",
      "content": "Search for PowerPoint . You'll find the search bar at the top of your screen if you're using the Google Play Store ; the search tab is located at the bottom of your screen in the App Store."
    },
    {
      "title": "Tap the first search result.",
      "content": "Tap the first search result. This is generally the official app developed and offered by the Microsoft Corporation."
    },
    {
      "title": "Tap Install (Android) or Get (iOS).",
      "content": "Tap Install (Android) or Get (iOS). When it's finished, you'll find the app on your home screen or in your app library. You can now use PowerPoint on your mobile device."
    },
    {
      "title": "Go to the Microsoft 365 website in a web browser.",
      "content": "Go to the Microsoft 365 website in a web browser. This page features several Microsoft Office subscriptions for Windows and Mac that include PowerPoint. You can also choose to purchase PowerPoint separately . To avoid downloading malware, only download programs through a trusted website. [2] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 1 April 2020."
    },
    {
      "title": "Select an Office package.",
      "content": "Select an Office package. You can make a one-time purchase of Office for your home computer, or subscribe to Office for one or more computers for a monthly fee. Click on Try for Free to gain free access to PowerPoint for a 30-day trial period. After the trial period ends, your credit card will be charged the monthly subscription fee for Office. If you purchased Microsoft Office elsewhere and have a product key, go to the Office setup page at https://setup.office.com/ and enter your 25-character product key. This key can be found in the confirmation email you received at the time you purchased Microsoft Office, or inside the Office product package."
    },
    {
      "title": "Log into your Microsoft Account.",
      "content": "Log into your Microsoft Account . You must be signed into Microsoft to download and install PowerPoint. This is also how you'll manage your purchases and subscriptions. Select the option to register for a Microsoft account if you don’t already have one, then follow the on-screen instructions to create an account."
    },
    {
      "title": "Click Install.",
      "content": "Click Install . You should be redirected to the download page. If you don't see this button, click your profile icon in the top-right corner and select My Microsoft account . Click Install underneath the Microsoft 365 header. If prompted, select a save destination for the Microsoft Office setup file."
    },
    {
      "title": "Double-click the Office installation file.",
      "content": "Double-click the Office installation file. This opens the setup wizard, which you’ll use to set up Office and PowerPoint on your computer."
    },
    {
      "title": "Follow the on-screen instructions in the Office installer.",
      "content": "Follow the on-screen instructions in the Office installer. This will download all Microsoft 365 Office apps, including PowerPoint. When PowerPoint is fully installed, you'll find it in your app list."
    },
    {
      "title": "Go to https://office.com/ in a web browser.",
      "content": "Go to https://office.com/ in a web browser. You must be logged into your Microsoft account and have an active subscription to Microsoft 365. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can use PowerPoint on the web without downloading any additional software, but it will have limited features compared to the desktop version."
    },
    {
      "title": "Click PowerPoint.",
      "content": "Click PowerPoint . You can find this in the Office 365 tab."
    },
    {
      "title": "Create a new presentation.",
      "content": "Create a new presentation. Click the + tile to start a new project. You can also select a template or use an existing file. When this file is created, it will automatically save to your OneDrive . You can access this at any time."
    },
    {
      "title": "Disable all browser add-ons and plug-ins.",
      "content": "Disable all browser add-ons and plug-ins. If you can't click the Install button on the website, turn off any active add-ons. This can interfere with your installation."
    },
    {
      "title": "Repeat the setup process.",
      "content": "Repeat the setup process. If you have access to all other Office applications except PowerPoint, you can choose to install Office again. By default, all Office programs are set to install together, but this option may have been toggled off. This time, ensure PowerPoint is checked off and included in the download. Navigate to the Microsoft Office folder on your computer, double-click on the Setup file, then follow the on-screen instructions in the setup wizard to install PowerPoint on your computer."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. If the Office downloads get stuck at a certain percentage during installation, you may need to restart your computer to try the download again."
    },
    {
      "title": "Update your computer.",
      "content": "Update your computer. If you're still experiencing issues with installation, make sure your computer is up-to-date. Microsoft Office requires Windows 10 , Windows 11 , or MacOS 10.14 or newer. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}