{
  "url": "https://www.wikihow.com/Date-when-You%27re-in-the-Closet",
  "title": "How to Date when You're in the Closet",
  "steps": [
    {
      "title": "There might be someone in the same situation as you who have similar hobbies.",
      "content": "There might be someone in the same situation as you who have similar hobbies. It is possible that there are other people who would like to have a relationship with someone who understands what they’re going through. [1] X Research source You can ask someone out to coffee or something that doesn’t appear like a romantic date if you’re not comfortable asking them on a formal date, or if you aren’t sure that they’re gay. Avoid asking out someone who knows you and your friends and family on a date or you could risk being outed."
    },
    {
      "title": "You can find a potential date on an app that caters to gay dating like Grindr.",
      "content": "You can find a potential date on an app that caters to gay dating like Grindr . You could also use standard dating apps like Tinder or Match.com and adjust the orientation that you’re seeking to date. Either way, you’ll more than likely have plenty of people you can set up a date with. [2] X Research source Some dating apps like Tinder and Grindr are geared towards hook-ups rather than long-term relationships. You can use a fake name if you don’t want your identity known while you set up a date. Consider telling any potential dates that you haven’t come out of the closet yet, but be careful. Some people may take offense and try to out you, so don’t tell them unless you feel like you can trust them."
    },
    {
      "title": "It can be a safe way to meet someone without having to come out of the closet.",
      "content": "It can be a safe way to meet someone without having to come out of the closet. If you have a close friend who knows that you’re in the closet and aren’t quite ready to come out, they may be able to set you up on a date with someone who understands your situation or is in the same situation themselves. [3] X Research source For example, you could ask your friend something like, “Do you know anybody looking for a relationship that would be cool with me still being in the closet?” It can also help to chat with and get advice from some friends who are also queer. They can give you the confidence and support that you need."
    },
    {
      "title": "Visiting a gay bar is a great way to meet potential dates even if you’re in the closet.",
      "content": "Visiting a gay bar is a great way to meet potential dates even if you’re in the closet. If you frequent a specific gay bar often, you may even get comfortable enough to let people know that you haven’t come out yet so they can respect your boundaries. [4] X Research source You can use a different name when you visit a gay bar if you don’t want your identity to be known. Visiting local gay bars frequently can increase the likelihood that someone will recognize you and could reveal that you’re gay."
    },
    {
      "title": "You should be direct and honest about the fact that you’re still in the closet.",
      "content": "You should be direct and honest about the fact that you’re still in the closet. A potential date may be understanding and sensitive about your concerns. It’s also possible that they may reject you for it. But that’s okay, too. It’s better to know upfront how they feel about it rather than prolong it. [5] X Research source You can start the conversation with, “Listen, I want you to know that I haven’t come out yet. If that’s going to be a problem, please let me know.” So there isn’t any confusion about it. Tell your potential date that you haven’t come out before you even agree to go on a date so they’re aware of your situation and potential boundaries."
    },
    {
      "title": "That way, you can relax and get to know your date without being recognized.",
      "content": "That way, you can relax and get to know your date without being recognized. If you want to continue to stay in the closet, you need to insist on choosing a place for your date where people won’t know you. [6] X Research source Try a new restaurant in a part of town that you never visit. Visit a restaurant or bar in a neighboring town so you’re less likely to run into anyone."
    },
    {
      "title": "Ask your date not to tag you when they post online either.",
      "content": "Ask your date not to tag you when they post online either. If you don't want people to know that you went out on a date, then don’t broadcast where you went on social media. [7] X Research source Some venues may have photographers for promotional purposes. You can ask them not to take your photo so they don’t post it online."
    },
    {
      "title": "Don’t be afraid to tell them if you don’t like something that they do.",
      "content": "Don’t be afraid to tell them if you don’t like something that they do. You may be new to dating, or you may be really worried about being outed on your date. Whatever your reasoning, you need to tell your date if something makes you feel awkward or uncomfortable. If you have no intention of going home with your date, you can tell them something like, “Just so you know, I plan to go home alone tonight.”"
    },
    {
      "title": "Give your date boundaries right away so they respect you.",
      "content": "Give your date boundaries right away so they respect you. It’s a good idea for you to tell your date from the onset of how you feel about public displays of affection. If you don’t want them to attempt to hold your hand, put their arm around you, or kiss you, you can be direct and tell them. [8] X Research source If the mood changes and you’re attracted to them, you can initiate some touching or kissing if they’re comfortable with it. Respect their boundaries, too. If your date expresses that they aren’t comfortable being kissed or touched in public, then listen to them."
    },
    {
      "title": "Don’t feel pressured to conform to what anybody says you should do.",
      "content": "Don’t feel pressured to conform to what anybody says you should do. You don’t owe anyone an explanation for your decision to not come out of the closet. Stand strong in your position and don’t give in to the will of another person who may be out and demand that you come out. [9] X Research source If someone threatens you physically or threatens to expose you, you may want to contact the police and possibly file a restraining order if they continue to harass you."
    },
    {
      "title": "Make an excuse so they don’t suspect anything and they won’t disturb you.",
      "content": "Make an excuse so they don’t suspect anything and they won’t disturb you. Tell them that you have a meeting at work or that you have to work late so they don’t find out that you’re on a date. [10] X Research source You may want to tell a close friend that you’re going out on a date so they know where you are and won’t disturb you."
    },
    {
      "title": "Instead, go for a simple outfit that you could just as well wear to an office meeting.",
      "content": "Instead, go for a simple outfit that you could just as well wear to an office meeting. You don’t want to put on the flashiest or the fanciest clothing that you own or people will suspect that you’re out on a date. If you’re trying to stay in the closet, you don’t want to wear the most flamboyant outfit that you have on your date. [11] X Research source That doesn’t mean you have to look drab! You should still wear a nice outfit, just keep it a little subdued."
    },
    {
      "title": "Get them talking so you can get to know them better.",
      "content": "Get them talking so you can get to know them better. You may be feeling really nervous being a date while you’re still in the closet, so ask some basic questions to break the ice and get a conversation started. Ask what they do for a living or ask them about any hobbies that they have. [12] X Research source Avoid talking about previous relationships until the two of you get to know each other a little bit more. Find out if you share common interests by asking them about their favorite music, food, and movies."
    },
    {
      "title": "Pay attention to what they have to say when you ask them questions.",
      "content": "Pay attention to what they have to say when you ask them questions. Don’t interrupt your date while they’re talking to tell your own story. Show them that you’re interested in them by giving them your full attention. [13] X Research source Make eye contact with your date while they’re talking so they know you’re listening. Try not to talk about yourself the whole time. Your date may see you as selfish and boastful."
    },
    {
      "title": "If you’re attracted to your date, explore those feelings and try a little playful flirting.",
      "content": "If you’re attracted to your date, explore those feelings and try a little playful flirting. Compliment their appearance or their sense of humor. [14] X Research source Let them know that you’re into them. If they reciprocate, then you may have the beginnings of a meaningful and fun relationship. Don’t overdo it with compliments or you could come off as ingenuine. Try not to be overly sexual unless it’s appropriate. Make sure that you're"
    },
    {
      "title": "Family problems, politics, or religion are all controversial conversation topics.",
      "content": "Family problems, politics, or religion are all controversial conversation topics. As you’re getting to know your date, don’t bring up divisive or sensitive topics that could sour the mood. Remember, you’re already asking them to respect the fact that you’re still in the closet, so you shouldn’t bring up something that could make them uncomfortable. [15] X Research source"
    },
    {
      "title": "Grabbing some coffee is a great way to talk without people assuming you’re on a date.",
      "content": "Grabbing some coffee is a great way to talk without people assuming you’re on a date. One great way to go on a date without anybody knowing is to choose a place that isn’t normally associated with dates. [16] X Research source A coffee date during the day will also make it seem less like a formal date so people won’t suspect anything. Coffee will also get the two of you talking and possibly forming a deep connection."
    }
  ]
}