{
  "url": "https://www.wikihow.com/Draw-on-Google-Slides",
  "title": "3 Simple Ways to Draw on Google Slides",
  "steps": [
    {
      "title": "Go to https://docs.google.com/presentation/ and sign in.",
      "content": "Go to https://docs.google.com/presentation/ and sign in. Since the \"Scribble Tool\" is not available on the mobile app, you have to use a web browser on a computer to draw on Google Slides."
    },
    {
      "title": "Open or create a new Google Slides presentation.",
      "content": "Open or create a new Google Slides presentation. Because the Scribble Tool isn't available in the Google Slides mobile app, you'll need to open your presentation on a computer. The Scribble tool allows you to freehand draw simple lines anywhere on your Google Slides presentation."
    },
    {
      "title": "Click down-arrow next to the line tool.",
      "content": "Click down-arrow next to the line tool. It's in the toolbar above your slide. Alternatively, click the Insert menu button and hover your mouse over Line . Either option will expand the Line Tool so you see more options."
    },
    {
      "title": "Click Scribble.",
      "content": "Click Scribble . Your cursor will change into a crosshair so you can draw."
    },
    {
      "title": "Scribble a drawing.",
      "content": "Scribble a drawing. Click and hold the mouse to draw anywhere on your slide. When you lift your finger from the mouse button, Google Slides will automatically select your drawing so you can make quick edits, like changing line thickness or making the line a dash."
    },
    {
      "title": "Customize your scribble.",
      "content": "Customize your scribble. Select a color. To choose a color for your drawing, click the pen tool with a black line beneath it in the toolbar, then click the color you want to draw in. This automatically changes the color of the selected scribble. Select a line weight and style. You'll see two more icons to the right of the pen color tool. The first allows you to choose a line weight (thickness), and the second gives you options for drawing in a solid, dashed, or dotted line."
    },
    {
      "title": "Click the Scribble icon in the toolbar to draw another line.",
      "content": "Click the Scribble icon in the toolbar to draw another line. Each time you lift your finger from the mouse, you'll be back in \"edit\" mode, which lets you choose different colors, weights, and styles and resize and erase the drawing. You'll need to keep clicking the Scribble icon again to continue drawing. If Google can't capture your drawing, it will disappear, which makes using Google Drawings a safer option for more complicated drawings. [1] X Research source"
    },
    {
      "title": "Go to https://drive.google.com/drive and sign in.",
      "content": "Go to https://drive.google.com/drive and sign in. If you want to include a more complex drawing in your Google Slides presentation, you can use Google Drawings, a drawing tool built into Google Drive, to create your drawing. You can then insert the drawing into your Google Slide. This feature is not available on Android, iPhone, or iPad."
    },
    {
      "title": "Click New.",
      "content": "Click New . Click the plus icon in the top left corner of the page. A menu will drop down."
    },
    {
      "title": "Hover your mouse over More and select Google Drawings.",
      "content": "Hover your mouse over More and select Google Drawings . A new page will open that you can draw in. You can use Google Drawings to create drawings for use in any Google app, including Google Docs and Google Sheets ."
    },
    {
      "title": "Draw what you want to add to Google Slides.",
      "content": "Draw what you want to add to Google Slides. You can find the Scribble Tool here, but you don't need to re-select Scribble to create a new line. Use shapes or other tools to create your drawing. Click the down arrow next to the Line tool in the toolbar to select a drawing tool, such as Line (for straight lines) or Scribble (to freehand draw). But unlike when using the Scribble tool directly in Google Slides, you won't have to keep clicking the Scribble tool each time you lift your finger from the mouse in Google Drawings. Draw your first line or scribble. When you lift your finger, editing tools will appear. Click the pen with a black line beneath it to choose a color, and use the other icons in the toolbar to stylize your lines."
    },
    {
      "title": "Name your drawing.",
      "content": "Name your drawing. Type a name for your drawing into the \"Untitled drawing\" field at the top-left corner of Google Drawings so it's easier to share and find."
    },
    {
      "title": "Publish the drawing and copy the URL.",
      "content": "Publish the drawing and copy the URL. Once your drawing is finished, you'll need to publish the drawing to the web to insert it into Google Slides. When you publish the drawing, you'll get a special URL to add the drawing to your Slides. Click the File menu. Click Share . Click Publish to web. Select an image size and click Publish . Click OK to confirm. A URL will appear once published. Click the URL, then press Ctrl + C (PC) or Cmd + C (Mac) to copy it to your clipboard."
    },
    {
      "title": "Open your slide in Google Slides and click Insert.",
      "content": "Open your slide in Google Slides and click Insert . You'll see this menu at the top of Google Slides."
    },
    {
      "title": "Hover your mouse over \"Image\" and select By URL.",
      "content": "Hover your mouse over \"Image\" and select By URL . This will prompt a window to open in the middle of your screen."
    },
    {
      "title": "Paste the copied URL of your drawing.",
      "content": "Paste the copied URL of your drawing. Press Ctrl + V (PC) or Cmd + V (Mac) to paste the link from your clipboard. This displays a preview of the drawing."
    },
    {
      "title": "Click Insert Image.",
      "content": "Click Insert Image . Use the formatting options above the slides to change the border of the drawing. Right-click the drawing and select Format Options to edit the look of the drawing, like its opacity and position on the slide. Now that you've inserted the image, you can unpublish the drawing from the web if you'd like. Open Google Drive, double-click the drawing and go to File > Share > Publish to Web > Stop publishing . [2] X Research source"
    },
    {
      "title": "Go to the Annotate extension's page in the Chrome Web Store.",
      "content": "Go to the Annotate extension's page in the Chrome Web Store. You'll have to use Chrome on your laptop or desktop computer."
    },
    {
      "title": "Get the extension and let it access your Google Drive.",
      "content": "Get the extension and let it access your Google Drive. Click Add to Chrome then Add extension to install the extension in Chrome ."
    },
    {
      "title": "Open your presentation in Google Slides.",
      "content": "Open your presentation in Google Slides. You can double-click the presentation in your Google Drive or go to https://docs.google.com/presentation and select it."
    },
    {
      "title": "Allow the Annotate extension to access your Google Drive.",
      "content": "Allow the Annotate extension to access your Google Drive. Click the puzzle-piece icon at the top-right corner of Chrome. Click the pin next to Annotate so its icon always appears in the upper-right corner of Chrome. Click the Annotate icon (it looks like a curved blue arrow pointing down in a white rectangle), then click Free Registration . Follow the instructions to create a free account. Click the Annotate icon again. You may need to sign in before you can continue."
    },
    {
      "title": "Show the Annotate Toolbar.",
      "content": "Show the Annotate Toolbar. Click the Annotate icon again and enable the toolbar."
    },
    {
      "title": "Draw on your Google Slide.",
      "content": "Draw on your Google Slide. Use the tools available, like the pen, highlighter, and eraser, to draw on your slides. When you're done, save any annotations by clicking the Save icon (it looks like an old floppy disk). If you want to start the slideshow again with the drawings you added, go to your Annotations dashboard, click Web annotations , and select the slideshow."
    }
  ]
}