{
  "url": "https://www.wikihow.com/Create-a-Terrarium-for-an-American-Toad-(Bufor-Americanus)",
  "title": "How to Create a Terrarium for an American Toad (Bufor Americanus)",
  "steps": [
    {
      "title": "Choose a tank that is at least 10 US gal (38 L) for your toad.",
      "content": "Choose a tank that is at least 10 US gal (38 L) for your toad. Toads need plenty of space to hide, burrow, and jump around. Upgrade by an extra 10 gallons (38 L) for each additional toad to ensure that they have enough space to move about in the tank. Always position the tank out of direct sunlight to avoid making the environment too warm. [1] X Research source You can find suitable tanks of various sizes at most pet stores. Most of them are made of glass or plastic."
    },
    {
      "title": "Add a coconut fiber substrate that is at least 4 in (10 cm) deep.",
      "content": "Add a coconut fiber substrate that is at least 4 in (10 cm) deep. Pour the substrate into the tank and level it out so the toad can find places to burrow. As the toad feels more comfortable, it will begin to dig and move the substrate around, which is normal. [2] X Research source If you can’t find coconut fiber substrate at the pet store, opt for peat moss."
    },
    {
      "title": "Fill a sturdy, shallow bowl with water and bury it in the substrate.",
      "content": "Fill a sturdy, shallow bowl with water and bury it in the substrate. Choose a solid ceramic bowl that’s deep enough to fit your toad inside. Then, add enough dechlorinated water for the toad to completely submerge itself and stay hydrated. Dig a hole in the substrate and situate the bowl in the tank, pushing the substrate up to the sides of the bowl. If you don’t have a water filter to remove chlorine, add dechlorinated drops to the water before you put it in the tank. Chlorine is very dangerous for toads, and you can purchase the drops at most pet stores. Be sure to change the water every 2 days so that it’s fresh for your pet."
    },
    {
      "title": "Install a thermometer and a hygrometer on the tank.",
      "content": "Install a thermometer and a hygrometer on the tank. Toads prefer cooler temperatures with high humidity. Place the meters on one side of the tank, and check them daily. The temperature should be around 60–75 °F (16–24 °C), and the humidity should stay around 50%. If the tank is too hot, add cooler water to the bowl and make sure there is plenty of substrate so the toad can burrow to stay cool. Since toads prefer cooler weather, they don’t normally require a UV light to keep them warm. If the humidity drops below 50%, mist the tank with clean water 2-3 times per day until it returns to normal."
    },
    {
      "title": "Secure a tight-fitting, screen lid on the top of the enclosure for safety.",
      "content": "Secure a tight-fitting, screen lid on the top of the enclosure for safety. Toads can jump pretty high, and they can easily knock the lid off of your tank. Make sure the lid has holes for ventilation and doesn’t easily move when pressed. If the screen is loose, the toad could escape from the tank. [3] X Research source Always remember to secure the lid when you’re done working in the tank."
    },
    {
      "title": "Add leaf litter or cork bark on top of the substrate so your toad can hide.",
      "content": "Add leaf litter or cork bark on top of the substrate so your toad can hide. A normal coconut substrate can be comfortable for burrowing, but toads also like to camouflage themselves under larger items. Sprinkle a layer of bark or leaves around the tank to create a variety of places where your toad can conceal itself. [4] X Research source You can find cork bark or leaf litter at most pet stores or outdoor landscape centers."
    },
    {
      "title": "Place a few living or plastic plants throughout the enclosure for more coverage.",
      "content": "Place a few living or plastic plants throughout the enclosure for more coverage. If you want the tank to seem more like the toad’s natural habitat, pick up 3-4 small plants, either real or fake. Position them around the tank to give the toad a few places where it can hide when it’s not burrowing or wading. [5] X Research source If you're going to use real plants, opt for a few Golden Pothos, Epiphyte, or Calathea, since they're easy to maintain and safe for the toad."
    },
    {
      "title": "Position small clay pots and rocks throughout the terrarium to hold humidity.",
      "content": "Position small clay pots and rocks throughout the terrarium to hold humidity. If you want a few more places for your toad to hide that will also keep the terrarium humid, lay a small clay pot on its side in the tank, and add 2-3 rocks on the top of the substrate. When you mist the tank, be sure to spray the pot and rocks, since they hold moisture and release it slowly. [6] X Research source Be sure to keep the clay pots tipped on their sides, since the toads might jump into them and get stuck if they’re placed upright."
    }
  ]
}