{
  "url": "https://www.wikihow.com/Get-Rid-of-Drain-Flies",
  "title": "How to Get Rid of Drain Flies",
  "steps": [
    {
      "title": "Clean your drain",
      "content": "Clean your drain manually with a pipe brush or drain snake. Removing the sludge inside your drain and pipes takes away the drain flies’ food source and prevents them from laying additional eggs. Run some warm water down the drain and then insert a pipe brush or snake as far as you can to dislodge eggs, larvae, and buildup. [1] X Research source The longer and more flexible your pipe brush, the better! If you’re treating the drain of a sink, remove the U-trap underneath and clean out any additional buildup you find."
    },
    {
      "title": "Pour boiling water down your drain.",
      "content": "Pour boiling water down your drain. This is the simplest method for killing drain flies and clearing out your pipes. Boil a medium-sized pot of water 1-2 times per day for a week and carefully pour the water down and around your drain. The repetition will ensure the flies don’t return if your first pour didn’t remove all of the organic buildup inside. [2] X Research source This method is more effective for killing larvae inside the pipes than adults that can fly. PVC pipes can be damaged by repeated or prolonged exposure to boiling water, so it’s recommended to only use this method for metal pipes. If you have PVC pipes, stick to pipe brush cleanings and cleaners meant for kitchen and bathroom drains."
    },
    {
      "title": "Sanitize your drain with baking soda, salt, and vinegar.",
      "content": "Sanitize your drain with baking soda, salt, and vinegar. This natural cleansing mixture will remove organic buildup from your pipes and kill any larvae or flies that get caught in it. Combine 1 part baking soda, 1 part salt, and 2 parts vinegar and pour it down the drain. Allow the mixture to foam up and sit overnight. In the morning, pour boiling water down the drain to clear the foam and any buildup it removed. [3] X Research source Start by using ½ cup (64g) each of salt and baking soda and 1 cup (250 ml) of vinegar. For deep pipes or severe infestations, increase the amounts proportionately. Try sprinkling the baking soda and salt in and around the dain first and then pouring the vinegar so the mixture doesn’t foam before it enters the drain. PVC pipes can be damaged by boiling water. Flush the vinegar mixture away with warm water from the tap if you have PVC pipes."
    },
    {
      "title": "Kill adult flies with a vinegar trap.",
      "content": "Kill adult flies with a vinegar trap. Apple cider vinegar smells alluring to the flies and tricks them into entering a deadly trap. To make a simple trap, pour apple cider vinegar into a small dish or jar and cover it with plastic wrap. Poke several holes in the wrap with a toothpick or pin—the flies will be lured into the trap through the holes but will not be able to escape. [4] X Research source Add a chunk of overripe fruit to the vinegar to make the bait extra appealing. A few drops of dish soap makes it harder for the flies to escape the vinegar. Another trap can be made by mixing water, sugar, apple cider vinegar, and a few drops of dish soap in a bowl. Sit the bowl (uncovered) near the infested drain for a few days to lure the flies into the deadly solution."
    },
    {
      "title": "Seal the drain with duct tape to trap and kill adult flies.",
      "content": "Seal the drain with duct tape to trap and kill adult flies. This is a simple way to catch flies and to test your drain for infestations. Place duct tape over your drain (sticky side down) overnight to catch any flies that try to merge. Do this several nights in a row since drain flies are usually more active after dark. [5] X Research source This method is effective if you only need to kill a few drain flies now and then."
    },
    {
      "title": "Use an enzyme gel to break down organic residue in your pipes.",
      "content": "Use an enzyme gel to break down organic residue in your pipes. Enzyme cleaners are designed to target buildup leftover from a manual cleaning and prevent future blockages. First, clean your drain with a metal pipe brush—run some warm water down your drain and then dislodge any buildup by inserting the brush as deep as it will go. Then, pour the cleaner down the drain and let it sit for several hours (check the instructions on the bottle for details). Then run some water down the drain to flush it out. [6] X Research source Enzyme cleaners are non-toxic and made for kitchen use. Once the drain is cleared of buildup and larvae, the flies will begin to disappear."
    },
    {
      "title": "Cleanse your pipes with a traditional drain cleaner.",
      "content": "Cleanse your pipes with a traditional drain cleaner . Regular commercial cleaners are great for removing buildup that causes clogs and attracts drain flies. First, clean your drain with a metal pipe brush by running warm water down your drain and dislodging any buildup by inserting the brush as deep as it will go. Then, use your cleaner according to the instructions. Read the warnings carefully—some are unsafe to use more than once, and some are specifically designed for bathroom drains. [7] X Research source Some natural and environmentally friendly cleaners can be found online or in most hardware or home goods stores. Read the labels carefully to find a product that targets organic matter."
    },
    {
      "title": "Try chemical sprays and bug repellents for severe infestations.",
      "content": "Try chemical sprays and bug repellents for severe infestations. Some pest control killers can be used to kill flies and larvae in your drain—check the label to make sure drain flies are listed. These repellents have harsh chemicals in them, so read the instructions and warnings carefully to confirm they’re safe for indoor use and won’t damage your pipes. [8] X Research source An insect growth regulator (IGR) spray can prevent drain fly eggs from hatching and keep larvae from maturing into adult flies. Chemical sprays and repellents should be considered when traditional cleaners or enzyme gels are insufficient to kill or prevent drain flies. There are no insecticides approved for drains or sewage systems, and pouring them down the drain can severely damage your pipes or septic system. [9] X Research source"
    },
    {
      "title": "Clean your drains regularly to prevent an infestation.",
      "content": "Clean your drains regularly to prevent an infestation. This is the best way to keep drain flies from moving into your bathroom or kitchen sinks. Drain or wipe up any stagnant water near all of the drains in your home. If you have a drain that’s prone to flies, pour boiling water or a cleaner down there 1-2 times per week for maintenance. [10] X Research source PVC pipes can be damaged by boiling water. If you don’t have metal pipes, stick to a cleaner meant for kitchen or bathroom drains instead. If there’s a drain that doesn’t get used often, make a point to run water through it at least once per week. If you’re going to be gone for days or weeks and are worried about drain flies, close your drains with a stopper so no bugs can move in while you’re away."
    },
    {
      "title": "Clean up standing water in and around your home.",
      "content": "Clean up standing water in and around your home. Drain flies can infiltrate more than just your bathroom or kitchen sinks—all they need is stagnant water and something to eat. Keep an eye on places like sump pumps, potted plants, garbage disposals , dirty mops, buckets of water, condensation pans, or moisture underneath loose tiles. Remove any trash and food sources that can attract drain flies around your home. If you see standing water, clean it up immediately. [11] X Research source"
    },
    {
      "title": "Look for drain flies on your walls as a sign of infestation.",
      "content": "Look for drain flies on your walls as a sign of infestation. Drain flies are (ironically) bad at flying, so you’ll most likely catch them resting on the walls or ceiling very close to their source. The pipe or drain nearest to where you spotted the flies is most likely their breeding ground. Even if you only spot a single fly, it’s best to thoroughly clean the suspected drain with a pipe brush or drain cleaner as soon as you can (they reproduce very quickly). [12] X Research source If there are multiple drains nearby, duct tape the drains shut overnight and inspect the sticky side the following morning to see which one the flies are coming out of. While you treat your drain, adult flies can be killed with vinegar traps, fly swatters, or indoor-safe bug repellents."
    },
    {
      "title": "Drain flies are small, gray, and fuzzy.",
      "content": "Drain flies are small, gray, and fuzzy. They look like gnats, fruit flies, or moths and are also known as moth flies or sink flies because of their appearance and preferred habitat. Unlike these animals though, they have weak wing muscles and hop and jump around more than they fly. They can range from 2.5 millimetres (0.098 in) to 4.5 millimetres (0.18 in) long and have dense, hair-like scales on their wings. [13] X Research source From egg to adult, a drain fly lives 21 to 27 days. You probably won’t see them until they are adults (the last 7 or so days of their life)."
    },
    {
      "title": "Drain flies thrive in stagnant water and organic matter.",
      "content": "Drain flies thrive in stagnant water and organic matter. They can eat almost anything, including food bits, slime buildup, sewage, or even just bacteria. This makes kitchen and bathroom drains, basements, sewers, septic tanks, and even wet soil a paradise for them, especially in humid environments. [14] X Research source Drains that are rarely used or poorly maintained are more prone to drain fly infestations than regularly used drains. Since adult drain flies cannot fly very far, they will usually gather near their home drain. This makes it pretty easy to identify the source of the infestation. Compost, animal waste, and garbage are appealing food sources for drain flies."
    },
    {
      "title": "Drain flies are not harmful.",
      "content": "Drain flies are not harmful. Drain flies don’t bite and don’t carry bacteria that are dangerous to humans. They don’t pose any health risks unless they emerge in massive numbers, which only happens in septic systems or sewers and not inside people’s homes. They don’t cause any physical damage to your pipes or indoor plants either. [15] X Research source The fine, hair-like scales on drain flies can fall off and be inhaled. This might cause irritation for those with sensitive respiratory systems."
    },
    {
      "title": "The biggest indicator of an infestation is adult drain flies in your home.",
      "content": "The biggest indicator of an infestation is adult drain flies in your home. You’ll most likely find them resting or hopping around near their home drain. If you spot drain flies outside your home, there is probably a pool of standing water somewhere helping them breed and eat—try to locate and dry up the water to reduce the chance they’ll migrate inside your home (look in places like puddles, outdoor drains, or buckets of rainwater). [16] X Research source Check a drain for flies by taping the drain shut overnight and examining the sticky side the following morning for trapped bugs. Check for larvae by removing your drain cap and scraping the inside of your pipes. Look for thin, tube-like larvae in the sludge. If you don’t see larvae but are certain you have a drain fly problem, it’s possible that the eggs are being laid deeper in your pipes."
    }
  ]
}