{
  "url": "https://www.wikihow.com/Fix-Windshield-Wipers-Stuck-in-Upright-Position",
  "title": "How to Fix Windshield Wipers Stuck in Upright Position",
  "steps": [
    {
      "title": "Clear any ice or debris from the windshield.",
      "content": "Clear any ice or debris from the windshield. Scrape off any ice and snow with an ice scraper. Pull out any sticks, leaves, or other debris stuck between the top of the hood and the bottom of the windshield. [1] X Research source Sometimes the buildup of ice, snow, and other debris is what causes windshield wipers to slow down or become misaligned over time. Clearing away everything in their path will allow you to realign them."
    },
    {
      "title": "Open the hood of the vehicle.",
      "content": "Open the hood of the vehicle. Open your driver’s side door and look beneath the steering wheel for a latch that has an image of the hood on it. Pull the latch to release the hood, then walk around to the front of the hood and feel underneath the crack for another latch. Squeeze the latch, lift up the hood as far as it will go, and put the rod that holds it up in place. [2] X Research source Depending on the model of vehicle, you might have to put the rod in place by either lifting it up from by the engine or lowering it down from the underside of the hood and sticking it in a hole that holds the tip in place. Some more modern vehicle hoods might stay in place without the use of a rod. Check your vehicle’s manual before you proceed to see if there are any instructions for your specific model of vehicle regarding stuck windshield wipers. The general process for fixing stuck windshield wipers on many vehicles is the same, but it’s always a good idea to see if you can find additional info."
    },
    {
      "title": "Pull off the foam strip from the plastic cover that sits below the windshield.",
      "content": "Pull off the foam strip from the plastic cover that sits below the windshield. Grab the driver’s-side-end of the foam strip that rests at the bottom edge of the plastic cover underneath the windshield. Peel it carefully back along the entire length of the plastic cover. [3] X Research source This will allow you to access the windshield cleaning fluid’s line to disconnect it as well as remove the plastic cover that protects the wiper transmission. Remember that this process may vary depending on the make and model of vehicle. There may be certain steps that don't apply or parts that are located in different areas."
    },
    {
      "title": "Pull the windshield washing fluid’s line out of the clips that hold it in place.",
      "content": "Pull the windshield washing fluid’s line out of the clips that hold it in place. The fluid line is a thin black tube located right under where you just removed the foam strip from. Leave the line sitting loosely on top of the plastic cover. [4] X Research source"
    },
    {
      "title": "Remove the windshield wiper arms.",
      "content": "Remove the windshield wiper arms. Pry up the caps that cover the bolts which hold the wipers in place using a flathead screwdriver. Use a wrench to loosen the bolts, remove them and set them aside somewhere safe, then slide the wiper arms off the bolts that they sit on below the windshield. [5] X Research source You have to remove the wipers to pull off the plastic cover that protects the wiper motor assembly and transmission. In some models of vehicles, you might only have to remove the driver’s side wiper."
    },
    {
      "title": "Pry off the caps protruding along the length of the plastic cover.",
      "content": "Pry off the caps protruding along the length of the plastic cover. Use a flathead screwdriver to pry the rubber or plastic caps up anywhere that you see them to expose the bolts that hold the plastic cover in place. Put these in a safe place so you can put them back on later. [6] X Research source There are usually about 3-4 of these caps. Make sure you remove them along the entire length to expose all the bolts that hold the plastic cover in place."
    },
    {
      "title": "Take off the plastic cover.",
      "content": "Take off the plastic cover. Lift off the plastic cover after you have removed all the bolts that hold it in place. Set it aside so you can access the windshield wiper’s motor assembly. [7] X Research source If you encounter any resistance when trying to pull the cover off, double-check that you removed all the bolts. If you have done so, it won’t be hard to lift out of place."
    },
    {
      "title": "Locate the windshield wiper transmission on the driver’s side.",
      "content": "Locate the windshield wiper transmission on the driver’s side. Look on the driver’s side and identify the mechanical parts that the driver’s side windshield wiper was attached to. It usually looks like an oval-shaped plate attached underneath the arm that moves the windshield wiper. [8] X Research source Some vehicle models might have another set of plastic trays that cover the transmission. If you don’t see the mechanical parts yet, try to pull off any other plastic covers that you see to find them. They might be held in place by another plastic clip of some sort that you need to pry up."
    },
    {
      "title": "Look for a metal tab that is bent away or down from the transmission.",
      "content": "Look for a metal tab that is bent away or down from the transmission. There is a little metal tab on the right-hand side below the moving parts of the transmission. It is supposed to touch the transmission so that the transmission locks on it when you turn off the wipers to keep the wipers in the down position. [9] X Research source Over time, this tab can get bent down or away, which is the main reason wipers get stuck in the upright position. When the transmission catches on this tab properly, it reverses direction and returns the wipers to the down position."
    },
    {
      "title": "Use a flathead screwdriver and hammer to hit the tab back into place.",
      "content": "Use a flathead screwdriver and hammer to hit the tab back into place. Hold a flathead screwdriver in your non-dominant hand and place the tip against the tab. Wield a hammer with your dominant hand and hit the top of the handle of the screwdriver to knock the tab back until it is almost touching the transmission. [10] X Research source The number of times you need to hit the tab depends on how bent it is. Keep tapping it carefully back into place until it looks like the transmission will catch on it."
    },
    {
      "title": "Turn the wipers on and off to check if the transmission catches on the tab.",
      "content": "Turn the wipers on and off to check if the transmission catches on the tab. Turn the key in the vehicle’s ignition to the accessories setting and turn the windshield wipers on to make the transmission move. Let the transmission run through a cycle, then turn off the wipers and look at the transmission to verify that it is now caught on the metal tab. [11] X Research source If the transmission is still not catching, keep using your hammer and screwdriver to tap the tab a bit closer to the transmission and test it again until it catches on the tab when the wipers are off. Note that you are doing this before you reattach the wipers. You are just testing out the mechanical parts of the transmission to verify that you have made sufficient adjustments before putting it all back together."
    },
    {
      "title": "Replace the plastic cover over the wiper transmission.",
      "content": "Replace the plastic cover over the wiper transmission. Slide the plastic cover back into position and bolt it back into place. Put the caps that cover the bolts back on. [12] X Research source The caps protect the bolts from the elements so they don’t rust, so it’s important to put them back on."
    },
    {
      "title": "Reattach the wiper arms.",
      "content": "Reattach the wiper arms. Place the wipers back onto the bolts that attach them to the transmission so that the wiper blades are horizontal on the windshield. Screw the nuts back onto the bolts to secure the wipers back into place, then push the bolt covers back on top of the nut and bolt. [13] X Research source"
    },
    {
      "title": "Clip the washer fluid line back into place and replace the foam covering strip.",
      "content": "Clip the washer fluid line back into place and replace the foam covering strip. Snap the window washer fluid’s tube back into the clips on the plastic cover that hold it in place. Press the foam strip back into place at the bottom edge of the plastic cover to cover the fluid line. [14] X Research source If the windshield wiper blades are old and worn out, this is a good time to replace them with new ones before you start using them again."
    },
    {
      "title": "Run the wipers to test them.",
      "content": "Run the wipers to test them. Turn the windshield wipers on and run them through a cycle. Turn them off to confirm that they rest in the down position when off. [15] X Research source If the wipers are resting in a partially-upright position, you might not have connected them at the right angle. To fix this, remove them again when they are in the resting position and reattach them so they are fully in the down position when the wipers are turned off. If the wipers are still not resting in the down position when they are turned off, there might be an electrical issue or another problem. If this is the case, take your car to have a mechanic check it out and find a solution."
    }
  ]
}