{
  "url": "https://www.wikihow.com/Earn-Money-on-YouTube",
  "title": "Ways to Make Money on YouTube: Ads, Subscriptions, & More",
  "steps": [
    {
      "title": "Set up and build your YouTube channel.",
      "content": "Set up and build your YouTube channel . Your channel is your personal presence on YouTube. [1] X Research source Each YouTube account has one channel attached to it. A YouTube account is the same as a Google account, and creating a YouTube account will grant you access to other Google products, such as Gmail and Drive. Create your account or use your existing one. Add keywords to help people find your channel, which is key to making money on YouTube. You can add keywords by navigating to the Advanced section of your Channel Settings. Make sure that your keywords are relevant to your content. According to Le Gilimore-Jones, you should pick a username that will work for you in the long term. Something that is semi-professional that can be formed into something else if your interests change. You can also try picking a name that’s based on a niche. Use that to build a brand identity."
    },
    {
      "title": "Upload videos and shorts.",
      "content": "Upload videos and shorts. Make sure your content is high quality. It’s a good idea to upload a combination of long-form content and YouTube Shorts . The more engaging your content, the better your chances of earning money on YouTube. [2] X Research source Even if your content isn't great at first, keep at it. Practice makes perfect. Try to make each video better than the last. You will often learn as you go. Improve your content by either using a better camera or trying better editing software, or better techniques. Also, try to improve the way things are filmed. Use a tripod , have a friend help you. Make sure you use good lighting. It all helps for a better end product, which in turn helps you get a better audience. You can use a ring light or natural sunlight. By uploading content regularly, you can help hold an audience, which can help you earn money. People are more likely to subscribe if you add content regularly. Make sure to tag your videos with keywords that describe the content, as well as an eye-catching description. These will help drive people to your video from YouTube searches."
    },
    {
      "title": "Gain a large audience.",
      "content": "Gain a large audience. Building an audience is key to making money on YouTube. You need people to watch your ads in order to make any money off of them. There is no one secret to getting more subscribers, just make the best content that you can and they will come to you. Sometimes there will be haters. You just have to ignore them. If you want to thrive, you have to be confident. Try to get your YouTube channel out there. Use methods such as press releases to help your channel gain notoriety. With press releases, for example, you can get an article about your YouTube channel published on hundreds of news sites with thousands if not millions of readers. This can drive traffic to your channel and possibly help you get verified as well. Keep uploading content and try to get people hooked. Send your video out on social media. Share it with people. Distribute it elsewhere on the internet. Subscribers are essential to becoming a partner. Interact with your viewers by responding to comments and making occasional videos directly related to viewer comments and questions. Connecting with your community will bring more members into that community. One good way to do that is pretty simple, shout outs."
    },
    {
      "title": "Meet the requirements for monetization.",
      "content": "Meet the requirements for monetization. There are a variety of ways to make money on YouTube. Each has their own minimum requirements you need to meet before your channel is eligible. You must be 18 or older and live in a country where the feature is available. You must also have a valid Paypal or Bank Account. The eligibility requirements are as follows: [3] X Research source Channel Memberships, Shopping (your products), Super Chats, Super Stickers, & Super Thanks: 500 subscribers 3 public uploads in the last 90 days. 3000 public long-form watch hours in the last 365 days or 3 million public Shorts views in the last 90 days. Ad Revenue & YouTube Premium Revenue 1000 subscribers. 4000 public long-form watch hours in the last 365 days or 10 million public Shorts views in the last 90 days. Shopping (other brands): 10,000 subscribers. 4000 public long-form watch hours in the last 365 days or 10 million public Shorts views in the last 90 days."
    },
    {
      "title": "Set up Google AdSense.",
      "content": "Set up Google AdSense. You can set up Google AdSense for free at the AdSense website. Click the Sign Up Now button to begin creating your account. You must be 18 years or older to create your own account. If you are younger than that, you will need an adult to help you. [4] X Research source You need either a PayPal or a bank account and a valid mailing address, as well as other information so AdSense can verify who you are and whom to send the money. You only gain money per ad click and a smaller amount per view, but it adds up over time. This is why having an audience is key."
    },
    {
      "title": "Add ad breaks to your videos.",
      "content": "Add ad breaks to your videos. According to Linetsky, you can earn money from ad revenue on YouTube, though it may not be a whole lot. In order to start earning money on your videos, you'll need to enable monetization. This means you are allowing YouTube to place ads in your video. This also means that you acknowledge that there is no copyright material in your video and your content must meet the advertiser-friendly guidelines . Use the following steps to monetize your videos: [5] X Research source Open YouTube Studio in a web browser. Click Content in the sidebar to the left. Click the checkbox next to the videos you want to monetize. Click Edit in the menu bar at the top. Click Ad Settings (if you don’t see this option, you’re probably not eligible for monetization). Click the checkbox next to “Place ads during video (mid-roll).” Decide if you want to place automatic ads in videos without ad breaks or all videos. Click Update videos . Click the checkbox next to “I understand the implications of this action.” Click Update videos."
    },
    {
      "title": "Sign up for the YouTube Partners Program.",
      "content": "Sign up for the YouTube Partners Program. YouTube Partners are YouTube members who have monetized videos with a large number of viewers. Partners gain access to more content creation tools. They can also win prizes for the number of viewers they have. Partners also get access to much more community support and tips. To sign up, you must meet the requirements for ad revenue and have no community guideline strikes against your channel, and your content must meet the advertiser-friendly community guidelines . Use the following steps to sign up for the YouTube Partners Program: [6] X Research source Open YouTube Studio in a web browser. Click Earn in the menu to the left. Click Apply Now . Click Start to get started. Accept the base terms. Link your AdSense account if you haven’t already."
    },
    {
      "title": "Enable channel memberships.",
      "content": "Enable channel memberships. Channel memberships can give your viewers special member-only perks. By joining your channel through recurring monthly payments, viewers can earn exclusive emojis, badges, perks, live chats, live streams, exclusive videos, shorts and more.. This allows your viewers to support you in more ways than ad revenue from your videos. After enabling a membership, you will need to select up to 5 perks that you can offer your members. Make you are able to deliver on these perks. Use the following steps to enable memberships: [7] X Research source Open YouTube Studio in a web browser. Click Earn in the menu to the left. Click the Memberships tab. Click Get Started . Follow the on-screen instructions to sign the Commerce Product Module (CPM). Follow the on-screen instructions to add membership levels and perks. Click Publish."
    },
    {
      "title": "Allow Super Chat and Super Stickers.",
      "content": "Allow Super Chat and Super Stickers. Super Chat and Super Stickers can be used during live chats. When viewers use a Super Chat or Super Sticker, their message will stand out in live chat during live streams and Premieres. These messages will be pinned to the top of the chat for a set period of time. The bigger the purchase the amount, the longer the message will be pinned to the chat. Use the following steps to enable Super Chat and Super Sticker: [8] X Research source Open YouTube Studio in a web browser. Click Earn in the menu to the left. Click Supers Click Get Started . Follow the on-screen instructions. Click the toggle switch next to Super Chat. Click the toggle switch next to Super Sticker."
    },
    {
      "title": "Let your viewers give you Super Thanks.",
      "content": "Let your viewers give you Super Thanks. Super Thanks allows you to earn revenue from viewers who want to show extra thanks. This feature was formerly known as \"Viewer applause\". Viewers can set their own price point for their Super Thanks. After buying a Super Thanks, a colorful animation with play over the video for the viewer. They'll also get to post a distinct, customizable comment in the video's comment section. Use the following steps to enable Super Thanks: [9] X Research source Open YouTube Studio in a web browser. Click Earn in the menu to the left. Click Supers Click Get Started . Follow the on-screen instructions. Click the toggle switch next to Super Thanks."
    },
    {
      "title": "Check your analytics.",
      "content": "Check your analytics. Once you have some videos online, monetized, and being viewed, you can check out the analytics on them to see how they are performing. [10] X Research source Here you can view estimated earnings, ad performance, video views, demographics and more. Use these tools to see how your content is resonating with your audience. You can change your content or your marketing if you're finding that you aren't attracting the users that you want to. [11] X Research source"
    },
    {
      "title": "Market your videos elsewhere.",
      "content": "Market your videos elsewhere. Don't just post on YouTube! Start a blog , make a website , or post them on other video or social media sites. The more views it gets, the better. By sharing the link or embedding the video on the internet, you are increasing the chance of it getting noticed. Curious if you're making the most out of YouTube? Check out what other wikiHow users recommend on the wikiHow forum post, \"How do people actually make money on Youtube?\""
    }
  ]
}