{
  "url": "https://www.wikihow.com/Get-Someone-to-Leave-You-Alone",
  "title": "How to Get Someone to Leave You Alone",
  "steps": [
    {
      "title": "Be honest.",
      "content": "Be honest. Let them know that you are not interested; say this assertively but without being mean. You do not need to list all of his faults and hurt his feelings. Just be clear that you don't think a relationship (of whatever sort is at stake) will work and that you would prefer it if he leave you alone. For example, if he keeps trying to get you to go on a date and you want him to stop, you might say \"look, I'm sorry but I am not interested in dating you, can you please stop asking?\" If the honest reasons may actually hurt the individual (such as if you find him annoying), re-phrase the reason to make it less hurtful. For example, if he asks why you will not date him, instead of saying something along the lines of “I find you annoying” you could say, “our personalities clash and I do not think we get along that well”. This removes the emphasis from his character and places it on the particular dynamic that occurs between the two of you."
    },
    {
      "title": "Encourage his empathy.",
      "content": "Encourage his empathy. Empathy leads people to act more prosocially. Let him know that the way he is behaving towards you is making you uncomfortable or scared, and that the experience is unsettling. He may not realize that his attention toward you is making you feel uncomfortable; he may reach the opposite conclusion, that you like his affection and attention. Engage his emotions by telling him how you really feel about his unwanted behavior. [1] X Research source For example, if he still is still pursuing you even though you have said your personalities do not match, you might say \"I have told you that I am not interested a number of times and I feel like you aren't listening, which is making me feel uncomfortable and nervous.\""
    },
    {
      "title": "Don’t leave any doors open.",
      "content": "Don’t leave any doors open. Do not give him any wiggle room to misinterpret your words. If you do so, he may stick around or give you distance only temporarily. Rather than saying “I’m not interested in dating you right now” close the door entirely by saying “I am not interested in dating you”."
    },
    {
      "title": "Threaten legal action.",
      "content": "Threaten legal action. In severe cases of unwanted attention, after all other options have failed and you truly feel unsafe, threaten legal action. Be ready to turn him over to the police if he continues. Let him know that you are taking detailed notes about his actions toward you. Keep a record of all of the communications attempts he makes. Reader Poll: We asked 429 wikiHow readers who've dealt with stalking and harassment, and 52% of them agreed that the best way to handle the situation is by contacting the police immediately. [Take Poll] If this person’s behavior makes you feel like you’re in danger, don’t hesitate to get legal help."
    },
    {
      "title": "Say no with your body language.",
      "content": "Say no with your body language. This step will only work if he can see you during your communications. Having closed off body language or looking like you are in a rush may allow him to realize that his communication attempt with you is unwanted. When he approaches you again, try looking away, slouching, fidgeting, or yawning, to signal that you are not interested. Be careful not to accidentally signal interest with body language such as leaning in or laughing. [2] X Research source"
    },
    {
      "title": "Shorten your communications.",
      "content": "Shorten your communications. Sometimes telling someone you are not interested is not enough, or there may not have been an opportunity to pull him aside and break the news. Keeping any communications short and to the point will help him get the hint that you are not interested. It will also make it more difficult for him to continue communicating as there will be less to discuss. For example, if he texts you and asks you how you your day is going and whether you want to go for dinner, you might ignore answering the question about your day and just say \"thanks for the offer but no thanks!\""
    },
    {
      "title": "Stop your communications.",
      "content": "Stop your communications. If he has not yet gotten the hint and speaking with him directly has not helped, it is time to stop all communication. Do not give into feelings of guilt about backing off from the situation. If you believe that removing this individual from your life is a good idea, then keep that in mind if you start to feel guilty. Guilt motivates us to repair relationships, but sometimes it tries to motivate us when it is actually not in our best long term interest to do so. [3] X Research source If, after you say no to his date requests, he tries to make you feel guilty by saying things such as \"I'm going through a hard time right now so you saying no really stings\" keep in mind that guilt can misfire and lead you to make poor decisions. Just because you are stopping your communications does not mean you should delete the communications he sends you, particularly if you feel that you are or may be stalked by this individual, in which case it is a good idea to have a record of all communications should you need them for legal purposes."
    },
    {
      "title": "Ditch him.",
      "content": "Ditch him. In severe cases, such as if you feel you are being stalked, changing your email address, phone number, or in the most severe cases, your home address and/or work location will greatly influence your chances of getting any unwanted individual to leave you alone."
    },
    {
      "title": "Get Social Support.",
      "content": "Get Social Support. Tell your family and friends about your situation. They may be able to give you helpful advice on how to deal with your situation. If the person you are telling knows the individual who is giving you unwanted attention, be sure to remind whoever you are confiding in to be discreet and to not share the information beyond who you say is OK to tell."
    },
    {
      "title": "Find a resource appropriate for the situation.",
      "content": "Find a resource appropriate for the situation. Think about the severity of the situation you are in and whether it is time to seek outside help. In the United States there are laws against stalking; police involvement and other legal interventions are options in severe cases."
    },
    {
      "title": "Consult the resource you have decided to use.",
      "content": "Consult the resource you have decided to use. Do not hesitate to make use of the resource you have found, particularly if you feel threatened. If this is a work-related matter, check with your human resources department about what resources are available for situations involving unwanted attention from a co-worker. If this is a school-related matter, check in with your teacher or principal to find out how they can help you navigate the situation you are in. If you feel that you are being stalked, consider getting the police involved."
    },
    {
      "title": "Inform the individual that you have sought outside support.",
      "content": "Inform the individual that you have sought outside support. Only follow this step in certain contexts, however. In some cases it may be better to be discreet, such as if the situation is not too severe, or it is at the workplace. In other cases, such as if you feel like you are in danger, letting him know that you have the police or other social resource involved may lead him to back down."
    }
  ]
}