{
  "url": "https://www.wikihow.com/Dip-Smokeless-Tobacco",
  "title": "How to Dip Smokeless Tobacco",
  "steps": [
    {
      "title": "Be of legal age to purchase tobacco.",
      "content": "Be of legal age to purchase tobacco. Laws governing tobacco products cover smokeless tobacco. In the United States, you must be 21 years old to purchase smokeless tobacco. The minimum age will differ by country; check with your local laws. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Smokeless tobacco is a legal product, but you don't want to enjoy it while breaking the law by pretending to be of age or purchasing it for someone underage."
    },
    {
      "title": "Decide what kind of smokeless tobacco you want.",
      "content": "Decide what kind of smokeless tobacco you want. There are a variety of smokeless products out there. Their use is similar, so your preference comes down to personal taste. Moist snuff. This tobacco has been fermented, aged, and finely chopped up. It is packed into tins. As the name suggests, this is slightly moistened, as opposed to dry snuff, which is powdery and can be taken by sniffing it into your nose. This is the most common form of dipping tobacco sold in the US, and the kind you are most likely to see in stores. Loose-leaf tobacco. Another common form of chewing tobacco, these leaves have been dried and fermented, then sold in foil packets. Plug tobacco. In this form, the tobacco has been packed tightly with molasses or some other adhesive into a block. You'll either cut or bite off a piece of the block to use it. You may also find twist tobacco, a similar form where the tobacco has been braided into long strands. Snus. [3] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source This is a newer form, initially developed in Scandinavia. The tobacco is in individual packets and may be flavored with various sweeteners. There are differences between snus made in the United States and those made in countries like Sweden, such as the amount of tobacco in a packet, which can lead to differences in physical effects on your mouth."
    },
    {
      "title": "Get somewhere you can use the tobacco.",
      "content": "Get somewhere you can use the tobacco. Compared to smoking, there are fewer restrictions on where you can use smokeless tobacco. Because you will be spitting, you will want to be somewhere where you can do that politely, or at least have a bottle or something you can spit into. You don't want to be doing something physically active, as you'll want to avoid accidentally swallowing the tobacco or your spit. A relaxing activity like reading, watching television, or hanging out with friends can complement dipping. Avoid doing other things with your mouth while dipping, like eating or drinking. You don't want to mix your food with the dip."
    },
    {
      "title": "Take a pinch of tobacco.",
      "content": "Take a pinch of tobacco. Reach your thumb and forefinger into the tin or pouch, or break off a piece of your plug. If you are a beginner to dipping, your pinch should be a small amount between your thumb and forefinger, probably about the size of a quarter. As you get more used to the taste and strength, the size of your pinch can grow, depending on how long you want it to sit in your mouth and how strong of a dose of nicotine you are looking for. [4] X Research source"
    },
    {
      "title": "Place between your gum and cheek.",
      "content": "Place between your gum and cheek. Put your tobacco down in your mouth between your gums and the cheek of your lower lip. Pack tightly together so you don't lose or accidentally swallow any leaves. Snus packets can also be held in the upper lip. The effect is roughly the same, though you may create more juice in your lower lip."
    },
    {
      "title": "Let the tobacco sit in your mouth.",
      "content": "Let the tobacco sit in your mouth. Chewing tobacco works because the nicotine seeps into your bloodstream through your gums, rather than by inhaling smoke. Dipping tobacco can sit in your mouth as long as you can feel something coming from it. You can get up to several hours' worth of nicotine from a pinch of chewing tobacco, much longer-lasting than a cigarette. [5] X Research source If the tobacco starts to get loose, and you are worried about swallowing, use your finger or tongue to tamp it back into place."
    },
    {
      "title": "Spit as necessary.",
      "content": "Spit as necessary. Something in your mouth will produce saliva that mixes with the tobacco. You don't want to swallow this juice, because it is meant to be spit out. If you are outside, you can spit onto the ground, but if you are indoors, keep an empty water bottle to spit into. When using a spit bottle, replacing the cap when you set it down is better. You don't want to knock it over and spill tobacco spit accidentally. Because the tobacco from snus packets can't get loose, the juice you make is meant to be swallowed. The flavoring used in snus can make it less irritating than juice from other forms of tobacco."
    },
    {
      "title": "Throw out the tobacco.",
      "content": "Throw out the tobacco. Do not swallow your tobacco. Once you are finished with the tobacco, either because you don't feel any nicotine or you are doing something that requires a clean mouth, take it out of your mouth. Grab the tobacco with your hand, pull it out, and then throw it away. If you are near enough to a garbage can, you can also spit out your tobacco. There's no reason to keep the tobacco anymore. Rinse your mouth. After you spit your dip out, you may want to rinse your mouth to eliminate excess tobacco. Don't use your spit bottle for rinsing; be careful not to swallow the water you rinse with."
    }
  ]
}