{
  "url": "https://www.wikihow.com/Draw-a-Mandala",
  "title": "How to Draw a Mandala",
  "steps": [
    {
      "title": "Pick a center point in the middle of a page.",
      "content": "Pick a center point in the middle of a page. If you’re going to want to watercolor your mandala at the end, use watercolor paper. Otherwise, regular sketching paper or even printer paper is fine. Pick a point that’s roughly in the center of the page. It doesn’t have to be exact, but the closer the better. [1] X Research source Mark the point in the center with pencil so that you can erase it later."
    },
    {
      "title": "Use a compass to draw concentric circles around the point.",
      "content": "Use a compass to draw concentric circles around the point. If you don’t have a compass, you can make one by tying a piece of string to a pencil. Hold the end of the string at your center point, and drag the pencil around to draw a perfect circle. Continue drawing larger and larger circles with bigger bits of string. [2] X Research source The circles don’t have to be evenly spaced. Some can be farther away from others. They are just a template that will help you later."
    },
    {
      "title": "Trace round things to make circles if you prefer.",
      "content": "Trace round things to make circles if you prefer. If you don’t want to use a compass or a string, just trace round things. Start by placing a small round thing, like a jar, centered at your center point. Trace around it with a pencil. Then remove the jar, place a bowl on the paper, and trace around that. Continue until you have made circles that fill up most of the paper, but stop before they are big enough to touch the edges."
    },
    {
      "title": "Draw axes across your circles in pencil.",
      "content": "Draw axes across your circles in pencil. With a ruler, draw lines going through the center point of your paper. Draw two lines pointing in the compass directions, and then two lines cutting diagonally across, evenly spaced. This will form eight symmetrical triangles coming from the center point. You will erase these lines later, but in the meantime they can help you line up your shapes symmetrically around your center point. If you want your mandala to look more organic and less symmetrical, you can skip drawing these guiding lines."
    },
    {
      "title": "Draw one shape in a ring around your center point.",
      "content": "Draw one shape in a ring around your center point. This could mean a ring of flower petals, a ring of triangles, or something else. The shapes should touch the first concentric circle that you penciled in around the center. This will make sure that they are all the same size. You can use a pen if you’re feeling bold, or you can use a pencil and go over your design later in pen."
    },
    {
      "title": "Continue drawing concentric rings of shapes.",
      "content": "Continue drawing concentric rings of shapes. Experiment with different kinds of shapes. If you’ve done a bunch of flower-petal looking things, try some triangles or ovals. You can also put in a ring that is just a circle, to divide the inner and outer parts of your mandala, if you’d like. Your shapes can overlap with each other, if you’d like. Your rings can be different sizes. Some can be very thin and intricate, and some can be big."
    },
    {
      "title": "Let loose and relax.",
      "content": "Let loose and relax. As you build your mandala out from the center, try not to think or worry too hard about what you’re doing, and get into a calm, creative flow. Focus on your breathing, and your in-the-moment feeling of drawing a mandala. Mandala-making can be a very centering exercise, if you approach it in a relaxed way. There is no such thing as a mistake in a mandala, there is just the unexpected."
    },
    {
      "title": "Stop making rings before you hit the edge of your paper.",
      "content": "Stop making rings before you hit the edge of your paper. This will leave some white space around the whole outside of your mandala, which will make it look calmer than if the design extended off the page. Remember, the outside ring of your mandala, like the other rings, does not have to be a perfect circle. For example, if your last ring has been flower petals, then your mandala edges will be scalloped."
    },
    {
      "title": "Trace over your design in pen if you drew it in pencil.",
      "content": "Trace over your design in pen if you drew it in pencil. As you trace, experiment with making thinner and thicker lines. Varying the line weight can add visual interest and a sense of depth to your mandala. You can switch to a different pen with a heavier weight of ink, or just press down harder, depending on your pen. If you’ve already drawn the mandala in ink, you can skip this step."
    },
    {
      "title": "Add fine details within the shapes.",
      "content": "Add fine details within the shapes. At this point, you’ve drawn all the shapes that you need for your mandala, but you can make your design even more intricate by drawing extra details inside your shapes. Try adding small circles, or leaves, or draw patterns like diagonal lines inside some of your shapes. For a cohesive look, add the designs symmetrically. Tear-drops and diamonds are tiny designs that are easy to draw and look intricate."
    },
    {
      "title": "Erase your pencil markings once you’ve inked your mandala.",
      "content": "Erase your pencil markings once you’ve inked your mandala. Now that you’ve finished drawing your mandala design in ink, it’s time to get rid off the template of circles you drew at the beginning in pencil. Make sure that the ink has dried before you start erasing, so that you don’t smudge the ink. Gently wipe away your eraser shavings so that they don’t get stuck to your paper. You may want to photocopy your mandala before you color it in, so that you can color it in many different times, or give copies to your friends to color."
    },
    {
      "title": "Color in your mandala, if you’d like.",
      "content": "Color in your mandala, if you’d like. You can choose to just leave the mandala a simple black and white design, but it can also be quite fun to color it in. You can color in different sections of your mandala with patterns or solid sections of color. Use watercolor for a light, gentle look. Just keep in mind that watercolor can easily bleed over lines if you aren’t used to painting with it. Use colored pencil, crayons, or markers if you prefer."
    }
  ]
}