{
  "url": "https://www.wikihow.com/Curl-Ribbon",
  "title": "How to Curl Ribbon",
  "steps": [
    {
      "title": "Prepare your ribbon.",
      "content": "Prepare your ribbon. Cut your curling ribbon to the desired length. If you're not sure, cut about 12 inches (about 30 centimeters). If this isn't long enough, you can cut off a longer piece. Remember that when you curl a ribbon it will get shorter, so take that into account. [1] X Research source Find the natural curl of the ribbon. Even when the curling ribbon hasn't been curled, it will have a natural curl to it. You will want to follow that natural curl when you're using the scissors to curl it. [2] X Research source Note which side is shiny and which is dull. The dull side will need to face downwards, towards the ground, when you're curling the ribbon with scissors. Typically the curl follows the shinier side of the ribbon. [3] X Research source"
    },
    {
      "title": "Grasp one end of the ribbon between your forefinger and thumb.",
      "content": "Grasp one end of the ribbon between your forefinger and thumb. You want to pull this as taut as possible. It depends on whether you've already tied it to a package, or whether you're going to do that after you've curled the ribbon. [4] X Research source It's easier to tie the ribbon on the package and then curl it because then you only have to grip it on one end. Otherwise, you have to tape down one end to hold it in place. If you're right-handed, place the ribbon in your left hand, and vice versa if you're left-handed."
    },
    {
      "title": "Hold the scissors upward, with the blades facing up and open.",
      "content": "Hold the scissors upward, with the blades facing up and open. Wrap your fingers around the middle of the blades and handles (in the X that's created when the scissors are opened up). Your thumb should be holding the ribbon against the sharpened edge of the scissors"
    },
    {
      "title": "Press the dull underside of the ribbon firmly against the blade of the scissors with your thumb.",
      "content": "Press the dull underside of the ribbon firmly against the blade of the scissors with your thumb. Make sure that the ribbon is still facing dull side down."
    },
    {
      "title": "Pull the ribbon across the scissors blade while continuing to press with your thumb.",
      "content": "Pull the ribbon across the scissors blade while continuing to press with your thumb. You need to make sure that you do this quickly. The pressure will cause the ribbon to curl. [5] X Research source you must do this part quickly because if you do it too slow the ribbon won't curl. In some cases, it will get flatter."
    },
    {
      "title": "Release the ribbon from the scissors blade.",
      "content": "Release the ribbon from the scissors blade. The curling ribbon should spiral up. If it doesn't or isn't as curly as you want it to be, then you can try the procedure again. If it doesn't work a second time, then you'll need to get a new length of ribbon and try again."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Although you need more materials than you would if you used a simple curling ribbon, this procedure doesn't take that long to accomplish. Fabric ribbons that you've taken the time to curl can add something a little extra to a nice package. [6] X Research source Find a dowel stick (pencil or rod works, too) which you'll use to curl the ribbon around. A bigger diameter creates a bigger curl, while a smaller diameter creates a smaller curl. Get a length of fabric ribbon. The width doesn't particularly matter, it just depends on what you want in terms of width. Make it a few inches (or centimeters) longer than the final desired length because curling will make it smaller. Mix cornstarch and water in a spray bottle. Grab a couple of clothespins or clips or use tape."
    },
    {
      "title": "Mix one tablespoon of cornstarch powder with one-pint water.",
      "content": "Mix one tablespoon of cornstarch powder with one-pint water. You'll slosh the mixture around in the spray bottle until you've made sure that the cornstarch has completely dissolved. [7] X Research source"
    },
    {
      "title": "Clip fabric ribbon to one end of your dowel.",
      "content": "Clip fabric ribbon to one end of your dowel. You'll do this with the clothespin or the clip, or you can tape it. Make sure that the ribbon is secured, because if it comes undone during the drying period, it won't curl very well."
    },
    {
      "title": "Wind ribbon around dowel.",
      "content": "Wind ribbon around dowel. When you're doing this you want to make it as tight or as loose as you want your curls to be. Again, depending on the diameter of the dowel stick (or whatever rod you're using) the curls will be bigger or smaller. Don't overlap the ribbon as you're winding it or those parts won't get the starch spray. Tape or clip the end of the ribbon in place, so that it is secured on both sides."
    },
    {
      "title": "Spray ribbon with cornstarch solution.",
      "content": "Spray ribbon with cornstarch solution. Don't drown the ribbon in the solution, but make sure that the entire ribbon is completely coated. Any parts that aren't coated completely won't be stiff enough to maintain their shape."
    },
    {
      "title": "Allow your ribbons to dry.",
      "content": "Allow your ribbons to dry. They have to be completely dry before you remove them from the dowel, because otherwise, they may lose their shape. This can take a while so it's a good idea to curl your ribbons with plenty of time to spare before you need to use them."
    },
    {
      "title": "Remove clothespins and slide the ribbon off the dowel.",
      "content": "Remove clothespins and slide the ribbon off the dowel. Your ribbon should be stiff and curling. You can somewhat manipulate the shape if you need to attach it to a package, but don't let it get wet, because that will make it lose its curls."
    },
    {
      "title": "Gather supplies.",
      "content": "Gather supplies. Unlike curling fabric ribbons with a starch solution, you'll need a few more supplies and a little more time, because it can take a little bit of time to bake the ribbons into curls than to simply allow them to dry. This method, however, tends to leave them less stiff than the cornstarch method. Get your fabric ribbon. When it curls it is smaller than what you started with so always cut off a bit more than you think you need. Grab some wooden dowels or skewers to wind the ribbons around. Get clothespins to hold the ribbons in place. Use a spray bottle with water to spray everything before baking it. Line a cookie sheet with tinfoil on which to bake your ribbons."
    },
    {
      "title": "Wind your ribbons around the skewers and secure them.",
      "content": "Wind your ribbons around the skewers and secure them. You want to make sure that the ribbons are tight enough that they won't slip off or lose their shape when you bake them. Avoid overlapping them so that the water gets every part of the ribbon. Secure ribbons on both ends of skewers with clothespins."
    },
    {
      "title": "Spray the ribbons with water.",
      "content": "Spray the ribbons with water. You don't have the soak the ribbons, but give them a good spray and make sure that you're getting all parts of the ribbon. This will make it so they don't burn while in the oven. Spray the clothespins as well, so they don't burn when they're in the oven either."
    },
    {
      "title": "Bake ribbons for about 10 minutes at 200 degrees Fahrenheit.",
      "content": "Bake ribbons for about 10 minutes at 200 degrees Fahrenheit. Place the ribbons on the tinfoil lined cookie sheet. The timing depends on your oven, so if it needs to go a little longer that's okay. That would be about 93 degrees Celsius."
    },
    {
      "title": "Remove from oven when the ribbon is completely dry.",
      "content": "Remove from oven when the ribbon is completely dry. Keep checking while it's baking so that you don't over or under-bake the ribbon or ribbons. When the ribbons are completely dry, that's when you take it out of the oven. Check underneath to make sure that it is completely dry on all sides."
    },
    {
      "title": "Take ribbon off dowel when it is cool.",
      "content": "Take ribbon off dowel when it is cool. Your ribbon should be well curled It should retain this shape unless it gets wet. You can use it to decorate a hair clip, or add it to a lovely package for that little extra touch!"
    }
  ]
}