{
  "url": "https://www.wikihow.com/Get-Someone-to-Say-Yes",
  "title": "How to Get Someone to Say Yes",
  "steps": [
    {
      "title": "Speak with confidence and polish.",
      "content": "Speak with confidence and polish . When you approach someone with a proposal or a question, you want to put your best foot forward. You greatly increase your chances of getting someone to say yes if you perfect your delivery. Speak confidently and deliberately, without saying “um” or “uh” or tripping over your words. [1] X Research source Remember that practice makes perfect. Before you deliver your question, rehearse what you’re planning to say. You don’t have to rehearse down to memorization because you don’t want to sound robotic. Simply practice asking what you plan to ask for until you feel like you sound confident and prepared. If you’re a more visual learner, it might be beneficial for you to jot down exactly what you want to say and rehearse that way. [2] X Research source Practicing in front of a mirror is especially helpful because it helps you also take note of nonverbal issues you might have, like playing with your hair or avoiding eye contact."
    },
    {
      "title": "Nod your head while you talk.",
      "content": "Nod your head while you talk. Studies have shown that nodding your head while you pitch an idea helps you feel more positive and confident, which translates to you appearing more confident and knowledgeable to your audience, whether it’s a boss, client, or loved one. [3] X Research source While this nonverbal cue is an important one to use, it’s equally important to not overdo it. Only nod as it feels natural to you. Don’t force it or it can end up serving as a distraction from your words rather than a helpful supplement to them."
    },
    {
      "title": "Show how your proposal/idea benefits them.",
      "content": "Show how your proposal/idea benefits them. People are more likely to say yes to you if you can prove how whatever you’re proposing might help or benefit them in some way. Show them what’s in it for them if you agree to your question. [4] X Research source For example, if you want to take some time off from work, then you might speak with your boss about what times of the year are generally slowest at your work and go from there. This way, your boss sees the benefit to granting you your vacation: you’re being thoughtful and taking it during a slow time of year, so it won’t hurt the company’s bottom line. Or, if you want to take your spouse out on a date and need to convince your teenager to babysit their younger siblings, you might ask them to babysit in exchange for a later curfew, money, or use of your car on the weekend, for instance. This demonstrates to your teen that saying yes to you will be mutually beneficial."
    },
    {
      "title": "Ask questions to learn what’s most important to them.",
      "content": "Ask questions to learn what’s most important to them. You cannot sell someone on your idea or proposal if you haven’t done your homework, either beforehand or during your present conversation. If someone isn’t interested in what you’re suggesting or offering, then no amount of persuasion will get them to say yes. If a family of five walks into a car dealership and you start trying to sell them on a two-seater sports car, then you’re wasting your time. Ask questions like “What will you be using the vehicle for primarily?” and “What features are you looking for in a vehicle?” Hone in on what they need, and they will be more likely to say yes and allow you to complete a sale."
    },
    {
      "title": "Make your first request a small one.",
      "content": "Make your first request a small one. This is also known as the “foot-in-the-door” method, and it refers to asking for something small as a lead-in to a larger request, with the reasoning being that people are more likely to say yes to a larger proposal if they’ve already said yes to something smaller. For example, if you talk your child into taking at least one bite of their dinner, then once the one bite is agreed to, then it is more likely that they’ll continue eating if you ask. (Especially if there’s a reward for continuing!)"
    },
    {
      "title": "Try to make your request in a positive environment.",
      "content": "Try to make your request in a positive environment. Nothing ruins negotiations like a sour mood. If at all possible, don’t attempt to negotiate with someone who is angry or standoffish. Wait until the person is in a better mood to mention your request. Over a meal, whether at home or during an evening out, is usually a good time to bring up a request. Of course, this doesn’t apply to work situations where you are required to negotiate, such as selling an unhappy customer on something. Situating your request in a positive environment can’t always happen. However, if it is within your control to choose, then do wait till the person you’re seeking a yes from is in a good mood. This increases your chances of hearing a yes. Tell tale nonverbal signs that you should wait if possible include crossed arms, external distractions (like a phone call or misbehaving kids), or eye rolls or scowls. Even if you’re being engaged by the person out of politeness, you’re not truly going to be heard, so you are better off waiting and approaching them at a better time when they’re less distracted or upset."
    },
    {
      "title": "Use peer pressure.",
      "content": "Use peer pressure. People tend to base their decisions on the opinions of others. We read restaurant reviews before we dine out, and we read movie reviews and ask our friends’ opinions before we see a movie. This same “herd mentality” can be a helpful tool in getting someone to say yes to you. [5] X Research source If you’re attempting to sell a house, for example, using this technique would entail printing out ratings of the neighborhood available online, showing prospective buyers how elite the property is, and showing that the area has some of the city’s best schools, for example. This peer pressure through others’ positive reviews might seal the deal for you on the home sale. Similarly, if you’re trying to convince your parents to let you study abroad, for example, letting them know how exclusive the program is or how favorably other students and parents (and future employers!) have viewed the experience might persuade them to allow you to go."
    },
    {
      "title": "Use the “one reason” approach.",
      "content": "Use the “one reason” approach. If you ask people for a favor without demonstrating a clear benefit to them, they might not be inclined to help you. However, if you give a reason, then they are more likely to say yes to you. It’s important to make sure that your reason is truthful and valid. Otherwise, if they determine that you’re lying, now you appear dishonest and they will be even less likely to agree to your request. For example, if you are waiting in a long line for the restroom and you can’t wait, you can try going to the person at the front and asking to cut in line. If you simply ask “I have to use the restroom. May I cut in line?” they are far less likely to agree than if you instead ask the same question with a reason given. Saying something like “May I cut in line? I have to use the restroom urgently because I have a digestive disorder” is far more likely to get someone to agree to your request."
    },
    {
      "title": "Make use of the “reciprocity norm.”",
      "content": "Make use of the “reciprocity norm.” This psychological concept is based on that notion that once someone does something for us, we then feel obligated to reciprocate by doing something for them. For instance, if we covered a shift for a co-worker when they were sick, then the next time you need a shift covered, you might ask that co-worker to work for you and mention that you covered for them before. To do this you might try saying something like, “I need this Friday off, and since I covered for you last weekend, I was hoping you might be able to work for me this week.” This prior indebtedness makes it more likely that they will say yes to working for you."
    },
    {
      "title": "Make your item or service seem scarce.",
      "content": "Make your item or service seem scarce. Advertisers employ this technique all the time by declaring their deal to be a “limited time offer” or available “only while quantities last.” You can use this trick to get people to say yes to you. If you’re selling someone something and you mention that it’s available only for a limited time or in limited release, then it’s more likely that people will agree to buy the product you’re pitching."
    },
    {
      "title": "Give them a choice of yes or yes.",
      "content": "Give them a choice of yes or yes. Studies have shown that people become overwhelmed and discouraged when they are presented with too many options. If possible, try to limit your proposal to just a couple options to avoid this happening. [6] X Research source Some examples of this might be giving only two choices of restaurants to your significant other or asking which dress of two pre-selected ones your friend likes best on you. This narrows the field from the broad, harder questions of “Where should we eat tonight?” or “What should I wear?” Giving specific, limited options to choose from gives this a choice of two “yes’s” and ensures that they can easily make a decision."
    },
    {
      "title": "Be open to negotiation or a partial yes.",
      "content": "Be open to negotiation or a partial yes. Not all battles can be won without compromise. If you are trying to persuade someone to say yes to you and they are willing to negotiate or say yes conditionally, then that is a step in the right direction. Consider it a win that you convinced them to meet you halfway or more. This is especially applicable in situations where you’re dealing with a superior, like a parent or a boss. For example, if you’re trying to reason with your parents about your curfew, then there might be some room for negotiation. If they want you home by 11pm and you want to stay out till 1am, then it is a victory if they agree to midnight as a compromise. Or, if you approach your boss about receiving a 7% raise, and they agree to 4%, then count that as a win because you still persuaded them that you deserved more money. You’ve gotten what you were looking for (more time out with your friends or a pay increase) in a roundabout way. Don’t look at compromises as negatives. Instead look at them as receiving a yes with conditions. Your power of persuasion put you in a far better situation than you were in before you tried to convince them that you needed what you asked for."
    },
    {
      "title": "Ask questions that you know will elicit a yes.",
      "content": "Ask questions that you know will elicit a yes. Sometimes it’s helpful to ask questions that you know will lead to positive responses. Rather than trying to convince someone of something or sell something, occasionally we want positive responses to create a light mood or relaxed atmosphere. On a first date or at a family gathering, for example, when you have a vested interest in making sure everyone is agreeable, this can be a helpful strategy to employ. [7] X Research source For example, if you’re out on a date you might say something like, “Wasn’t that wine fantastic?” or “Don’t you love this city?” Or, at a family dinner, for instance, you might say something like, “Isn’t grandma’s turkey the best?” These kinds of questions almost insist on a yes and help you find common ground with the people around you. [8] X Research source"
    },
    {
      "title": "End on an active note.",
      "content": "End on an active note. Even if you didn’t fully get the person to say yes, you should attempt to end your meeting or conversation proactively, with a look to the future. This gets you out of limbo and into a forward progression toward your goal. [9] X Research source For example, if you tried to sell some furniture to a man who says he needs to talk it over with his wife, then you might end your conversation by saying something like “Sounds great. Would Thursday be a good day to follow up with the both of you?” Salespeople and others who work on deals for a living adhere to the adage of “always be closing.” Proactively working toward your next meeting is a great way to not take no for an answer without seeming pushy or causing the other person to shut down completely. [10] X Research source"
    }
  ]
}