{
  "url": "https://www.wikihow.com/Cure-Onycholysis",
  "title": "How to Cure Onycholysis",
  "steps": [
    {
      "title": "Visit your doctor if you have symptoms of onycholysis.",
      "content": "Visit your doctor if you have symptoms of onycholysis. Your doctor should be able to determine the cause of your onycholysis by examining your nails. They may also take a tissue sample from underneath one of your nails to test for fungus or other infections. See your doctor if: [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source One or more of your nails have lifted from the nail bed underneath The border between your nail bed and the white outside of your nail on one or more of your nails is unevenly shaped A large portion of your nail(s) are opaque or discolored One or more of your nails plates are deformed with indentations or bent edges"
    },
    {
      "title": "Tell your doctor about any medications you are taking.",
      "content": "Tell your doctor about any medications you are taking. Some medications can make your nails react to sun exposure, resulting in nails that lift away from their nail beds. Medicines in the psoralen, tetracycline or fluoroquinolone categories are the most notable causes of this reaction. Tell your doctor about any prescription or over-the-counter medications you are taking to rule out this possible cause. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Inform your doctor if you have a history of psoriasis or other skin problems.",
      "content": "Inform your doctor if you have a history of psoriasis or other skin problems. Tell your doctor if you have been diagnosed with psoriasis in the past, as the majority of psoriasis patients are likely to develop onycholysis at some point. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have not received this diagnosis, tell your doctor about any skin problems you may have experienced recently. Symptoms of psoriasis can include: [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Dry, cracked, or bleeding skin Red patches of skin Silvery scale marks on the skin Itchy, burning, or sore skin"
    },
    {
      "title": "Disclose any recent injuries that you have suffered to your hands and feet.",
      "content": "Disclose any recent injuries that you have suffered to your hands and feet. Trauma to the nail bed can cause onycholysis gradually and painlessly. [5] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Tell your doctor if you have experienced any injuries that may have affected your nails. This may include impact injuries and piercing injuries where the nail was cut or torn. Injuries may range from small incidents like stubbing your toe to more major accidents, such as slamming your finger in a car door."
    },
    {
      "title": "Consider all possible environmental causes.",
      "content": "Consider all possible environmental causes. Exposure to stressors can damage your nails, eventually leading to onycholysis over time. Consider your regular cleaning, grooming, and physical activities to determine what habits might be to blame. These environmental or occupational stressors could include: [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Prolonged periods in water (e.g. frequent swimming or washing dishes) Regular use of nail polish, artificial nails, or nail polish removers Frequent exposure to chemicals, such as cleaning products Closed toe shoes while walking with uneven pressure from flat feet [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Trim back the nail to prevent further trauma.",
      "content": "Trim back the nail to prevent further trauma. Nails that have separated from their nail beds are vulnerable to injury. Use nail clippers or scissors to remove the affected nail as it grows out, or ask your doctor if they can remove the separated part of the nail for you in-office. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have an infection under your nail, removing it will allow you to apply the medication directly to the site."
    },
    {
      "title": "Use an antifungal medication if the onycholysis is caused by a fungal infection.",
      "content": "Use an antifungal medication if the onycholysis is caused by a fungal infection. Before your nail can grow back, the fungus and bacteria under the nail must be killed. After diagnosing this kind of infection, your doctor will prescribe an oral or topical antifungal medication to treat it. Take or apply the medication exactly as directed until a new, healthy nail begins growing in. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Oral medications should be taken for 6-24 weeks depending on the severity and nature of the infection. Topical creams or ointments should be applied daily around the nail bed and are usually slow to produce results. Oral medications are generally more effective than topical ones, but carry additional risks such as potential liver damage. Follow up with your doctor after 6-12 weeks of treatment."
    },
    {
      "title": "Ask your doctor about treatment options for onycholysis-causing psoriasis.",
      "content": "Ask your doctor about treatment options for onycholysis-causing psoriasis. Psoriasis is a common cause of onycholysis that has a number of possible treatments. Discuss treatment options with your doctor to decide which one may be most effective for you. These options may include: [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Oral medications like methotrexate, cyclosporine, and retinoids Topical treatments like corticosteroids, synthetic vitamin D, anthralin, calcineurin inhibitors, salicylic acid, and topical retinoids Light therapy treatments, such as UVB phototherapy, narrow band UVB phototherapy, and excimer laser therapy Alternative, natural treatments like aloe vera, fish oil, and topical applications of Oregon grape have also been used as effective treatments against psoriasis-linked onycholysis in some studies. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Ask your doctor about supplements if you have a vitamin and mineral deficiency.",
      "content": "Ask your doctor about supplements if you have a vitamin and mineral deficiency. A lack of vitamins and minerals may leave your nails weak and brittle, making it more difficult for them to regrow after onycholysis. Ask your doctor if you should take supplements to help your nails regain strength. Iron in particular may help to strengthen your nails. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Biotin, a B vitamin, can also help to improve the condition of your nails. Taking a daily multivitamin will help to guarantee that you get an assortment of vitamins that your body needs for overall health. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Your doctor may also suggest dietary changes to increase your intake of certain vitamins and minerals."
    },
    {
      "title": "Treat your nails with a prescription drying agent after they get wet.",
      "content": "Treat your nails with a prescription drying agent after they get wet. To protect your nails from excessive moisture while they are healing, apply a drying substance to them after getting your hands or feet wet. Ask your doctor if they can prescribe a drying agent such as 3% Thymol in alcohol. This kind of liquid drying agent should be applied directly to the nails with a dropper or small brush. [14] X Research source These drying agents should be used for 2-3 months while your nails are healing."
    },
    {
      "title": "Keep your fingernails clean and dry.",
      "content": "Keep your fingernails clean and dry. Prevent the growth of bacteria or fungus under your nails by washing them frequently during the day. Lather them with a mild hand soap and rinse them thoroughly. Be sure to dry them thoroughly after they get wet to further prevent fungal infections. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Wear shoes that are properly sized.",
      "content": "Wear shoes that are properly sized. Small shoes will put more pressure on your toenails and make it more likely to cause trauma. Prolonged trauma on your nails is likely to lead to the development of onycholysis."
    },
    {
      "title": "Avoid wearing damp or wet shoes for prolonged periods of time.",
      "content": "Avoid wearing damp or wet shoes for prolonged periods of time. Wet feet can cause toe fungus, which may result in onycholysis. Wear waterproof shoes or boots if you are walking or exercising in wet conditions. Remove sweaty socks and shoes right after exercising to prevent the growth of bacteria or fungus. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Let your shoes air-dry thoroughly if they get wet. If you exercise frequently, consider buying multiple pairs of athletic shoes to avoid wearing wet or damp footwear."
    },
    {
      "title": "Wear gloves when cleaning or washing.",
      "content": "Wear gloves when cleaning or washing. Both prolonged exposure to chemicals and frequent submersion in water can cause onycholysis. Protect your hands by wearing rubber gloves while cleaning the house, washing dishes, or performing similar tasks. Gloves will also protect long nails from injury when performing household chores. [17] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Keep your nails short and clean.",
      "content": "Keep your nails short and clean. It is easier for moisture and bacteria to build up under long nails, creating a greater risk of onycholysis. To prevent this condition, trim your nails regularly to keep them short and neat. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use clean nail clippers to cut your nails and an emery board to smooth the edges. Shorter nails will also be less prone to injury or trauma."
    }
  ]
}