{
  "url": "https://www.wikihow.com/Delete-Subscribers-from-YouTube",
  "title": "2 Simple Ways to Delete Subscribers from YouTube",
  "steps": [
    {
      "title": "Open YouTube Studio.",
      "content": "Open YouTube Studio . If you're using a computer, go to https://studio.youtube.com and sign in if you haven't already. If you're using an iPhone or Android, open the YouTube Studio app. Use this method if the person you want to remove has left a comment on your channel. If they haven't, you can block them from their profile . There is technically no way to remove a subscriber , force them to unsubscribe, or prevent them from seeing your videos. However, you can use this method to hide a user's comments so other people can't see them on your videos."
    },
    {
      "title": "Click Comments in the left menu.",
      "content": "Click Comments in the left menu. If you don't see this option on the left side of the screen, click or tap the menu at the top-left corner first."
    },
    {
      "title": "Click or tap ⁝ on a comment from the user.",
      "content": "Click or tap ⁝ on a comment from the user. You'll see this three-dot menu icon to the right of the comment."
    },
    {
      "title": "Click or tap Hide user from channel.",
      "content": "Click or tap Hide user from channel . Although that user will remain listed in your subscriber list unless they unsubscribe, anyone who views your channel will not see comments that this user leaves. YouTube no longer offers a \"block\" option. This option has been replaced with \"hide,\" which hides the user's comments from your videos and channel so others can't see them. This user will also not be able to create clips from your videos or live streams. [1] X Research source If you want to unhide those users, go to YouTube Studio > Settings > Community and click the x next to their username in the \"Hidden Users\" section."
    },
    {
      "title": "Go to the subscriber's profile.",
      "content": "Go to the subscriber's profile. While it isn't technically possible to delete a subscriber, force them to unsubscribe, or prevent them from seeing your videos, you can use this method to make sure other people can't see any of their comments on your channel. You can get to the subscriber's profile from YouTube Studio if they subscribed in the past 28 days and have not made their subscriptions private. To do this, log in to YouTube Studio (or open the YouTube Studio app), click SEE ALL under \"Recent subscribers,\" and click the person's name to open their profile."
    },
    {
      "title": "Click …more at the top of their profile.",
      "content": "Click …more at the top of their profile. It will seem kind of hidden, but you'll find this below the channel's name. This pulls up the channel's \"About\" section, where the owner can fill out their profile."
    },
    {
      "title": "Scroll down and click Report user.",
      "content": "Scroll down and click Report user . Don't worry, you won't have to report them—this is just where YouTube now hides the \"hide\" (formerly \"block\") option."
    },
    {
      "title": "Click Hide user from my channel.",
      "content": "Click Hide user from my channel . Once you choose this option, any comments the user tries to leave on your channel will be automatically hidden so nobody can see them."
    }
  ]
}