{
  "url": "https://www.wikihow.com/Enunciate",
  "title": "How to Enunciate",
  "steps": [
    {
      "title": "Watch yourself talk in a mirror.",
      "content": "Watch yourself talk in a mirror. [1] X Expert Source Lynn Kirkham Public Speaking Coach Expert Interview. 20 November 2019. Talk at a mirror as you watch the movements of your mouth, jaw, tongue, and lips. Make these movements as big and noticeable as possible. This will improve your enunciation, and help you identify which sounds are difficult for you. Continue to watch yourself in the mirror as you practice the steps below."
    },
    {
      "title": "Show your teeth.",
      "content": "Show your teeth. Surprisingly, this can help a lot. Showing your teeth gives your lips more space, tightens your cheeks, and creates a larger opening for sound. These changes improve your audibility and intelligibility. And if you don't believe it, try saying \"audibility and intelligibility\" with your lips together, and then with your teeth showing. Aim for a pleasant , happy expression, but not a full-blown smile. Your cheeks shouldn't feel sore after holding a short conversation."
    },
    {
      "title": "Lift up your soft palate.",
      "content": "Lift up your soft palate. That's the soft part in the back of the roof of your mouth. Singers are trained to raise the soft palate in order to achieve a fuller, more resonant tone. Try inhaling gently as you make a soft k sound, and your soft palate will rise. [2] X Research source A small, unvoiced yawn complements the inhale, by warming up different muscles around your soft palate. [3] X Research source Avoid exaggerated yawning or gulping to achieve this. Anything more than a gentle effort is counterproductive."
    },
    {
      "title": "Keep the tongue forward and down.",
      "content": "Keep the tongue forward and down. Obviously, your tongue will be moving while you speak, but it's still worth practicing a neutral position that doesn't interfere with the passage of sounds. Try hanging your tongue out of your mouth, then gradually pulling it back until it is just behind the lower teeth, touching their base. Your tongue can produce many vowel sounds with minimal movement from this position, mostly by raising and lowering the middle of the tongue instead of the tip. This is especially important while you are singing, or when trying to address certain types of lisp."
    },
    {
      "title": "Stand up straight",
      "content": "Stand up straight . [4] X Expert Source Lynn Kirkham Public Speaking Coach Expert Interview. 20 November 2019. This allows you to breathe better. Sound is created by the air being forced out of your lungs, so the clearer your breathing, the clearer your speech. Look straight ahead, so your jaw is flat instead of lowered compressing your throat. When talking to someone roughly the same height as you, maintaining eye contact is a good way to ensure your chin stays raised."
    },
    {
      "title": "Speak slowly and steadily.",
      "content": "Speak slowly and steadily. If you speak quickly, you are much more likely to slur your words. Even if you stutter, the best approach is to pause and attempt the word again, not to rush through it."
    },
    {
      "title": "Go through some consonant-vowel combinations.",
      "content": "Go through some consonant-vowel combinations. This gets you practice in most common sounds, and is also helpful for \" warming up \" your voice before a speech. Try these common vowels with a few consonants, or even going through the whole alphabet: \"Bah Beh Bee Bih Bo Boo Buh\" \"Vah Veh Vee Vih Vo Voo Vuh\" (et cetera) For more of a challenge, include the vowel \"aw,\" which is similar but distinct from \"ah\" in most dialects. You can also include combination consonants such as \"SL\" and \"PR\""
    },
    {
      "title": "Practice diphthongs.",
      "content": "Practice diphthongs. Diphthongs are vowels that require you to move your tongue from one position to another as you pronounce them. Practice saying these words slowly, identifying the two mouth positions you use during the vowel. Then try to speed up and say the words more quickly while keeping your mouth movements precise. Spend more time in the first part of the vowel than the second, and your speech will sound clearer and more refined. [5] X Research source [6] X Research source [7] X Research source Ache mate paid saint stray Eye nice rhyme pie height Voice noise coin Load toad flow Crowd sprout found Air square prayer (not always considered a diphthong, but still good practice) Cute few ewes Onion union million Don't worry too much if you can't identify the two vowel sounds in some of these. Different dialects of English often pronounce diphthongs differently, or even as single vowels."
    },
    {
      "title": "Practice tongue twisters.",
      "content": "Practice tongue twisters . Try to articulate each word in a tongue twister, especially one that contains sounds you find difficult to pronounce. Start out slowly, and go faster once you can pronounce it perfectly. Here are a few tongue twisters for common problem sounds, which you can find more of here : James just jostled Jean gently. Round the rugged rocks the ragged rascal ran. Silly Susan sells sea shells by the seashore."
    },
    {
      "title": "Record yourself speaking.",
      "content": "Record yourself speaking. Read a book (or even this article) out loud into a voice recorder. Try to articulate every sound clearly so that you can be heard. It may help to set up the recording device a short distance from yourself, then to increase the distance each time and try to keep your speech just as clear. You can probably find a voice recorder on your computer or online. Your phone may have a voice recorder too, but it may not be high enough quality for enunciation practice."
    },
    {
      "title": "Practice with a pencil in your mouth.",
      "content": "Practice with a pencil in your mouth. Hold a pencil, chopstick, pen, or similar object horizontal been your teeth, and repeat the speaking drills above. By making your tongue and mouth work much harder around a physical speech impediment, enunciating will become easier when you are speaking normally without any obstruction in the way of your speaking."
    },
    {
      "title": "Vary your speaking speed.",
      "content": "Vary your speaking speed. People have trouble understanding speech that is too fast to follow, or slurred because you're speaking too fast for your tongue to follow. Read aloud while concentrating on the flow of the content, slowing down to emphasize important points and speeding up slightly during exciting moments. [8] X Research source Children's books (with full paragraphs) are a good choice, since they tend to focus on emotion and have a simple style to follow. You can also try recording yourself speaking out loud, then counting the number of words per minute you use. Although \"normal\" speed depends on region, culture, and other variables, most people speak at a rate between 120 and 200 words per minute. [9] X Research source"
    },
    {
      "title": "Pause intentionally.",
      "content": "Pause intentionally. [10] X Expert Source Lynn Kirkham Public Speaking Coach Expert Interview. 20 November 2019. Read aloud again at a slow or moderate pace, this time focusing on the punctuation. Pause at commas and periods, and take a moment to clear your throat or inhale deeply at the end of a paragraph. Try to include these intentional pauses in your speech as well, so the listener has time to process what you have said, and help you avoid tripping over your words. If you experience unintentional, gulping pauses, methods of overcoming public speaking could help keep this under control."
    },
    {
      "title": "Speak loudly but clearly.",
      "content": "Speak loudly but clearly . There's an art of projecting your voice, or increasing your volume without sounding hoarse or flat. [11] X Research source Look in the mirror and place your hand on your stomach, then breathe in and out deeply . Inhale from the diaphragm, below the stomach, not from the upper lungs. If your shoulders remain level during this exercise, you're doing it right. [12] X Research source Maintain this type of breathing as you practice greeting yourself in the mirror from farther and farther distances, or just keep adding volume gradually without forcing too much or experiencing a scratchy sensation. Focus on this exercise if people ask you to speak up or repeat yourself frequently, or if you are training to give a spoken presentation."
    }
  ]
}