{
  "url": "https://www.wikihow.com/Get-Apple-to-Replace-Your-iPhone-for-Free",
  "title": "The Best Ways to Get a Replacement iPhone from Apple",
  "steps": [
    {
      "title": "Apple replaces phones with defects for free for one year after buying them.",
      "content": "Apple replaces phones with defects for free for one year after buying them. You’re automatically enrolled in Apple’s 1-year AppleCare warranty when you buy an iPhone. If your iPhone has hardware issues or manufacturing defects, visit an Apple Store with proof of purchase. The employees will repair your phone if possible, or they’ll give you a replacement. [1] X Research source Your replacement iPhone will typically be the same generation and color as your old phone. If you don’t have an Apple Store near you, you may also request a repair service online at https://support.apple.com/iphone/repair , and Apple will send shipping boxes to mail your iPhone. The 1-year warranty does not cover the following: Software issues Battery or protective coatings with normal wear and tear Cosmetic damage like scratches or dents Damage caused by a non-Apple accessory Accidents like drops or liquid damage"
    },
    {
      "title": "Service broken or damaged iPhones to get repaired or replaced.",
      "content": "Service broken or damaged iPhones to get repaired or replaced. AppleCare+ is Apple’s extended warranty that covers battery issues and accidental damage. When you take your iPhone to an Apple Store or mail it in for servicing, they’ll first try to fix your phone with replacement parts. If they’re unable to complete their repairs, they’ll give you a replacement phone instead. [2] X Research source You can claim accidental damage on your iPhone as many times as you want, but most AppleCare+ repair and replacement services cost a small fee: Hardware defects: $0 USD Battery replacement: $0 USD (if the battery holds less than 80% of its original capacity) Screen or back glass damage: $29 USD Any other accidental damage: $99 USD"
    },
    {
      "title": "Use the Express Replacement Service while your iPhone gets repaired.",
      "content": "Use the Express Replacement Service while your iPhone gets repaired. If your iPhone isn’t working properly, request the Express Replacement Service online or at the Apple Store. Apple will send you a replacement iPhone that’s the same model and color as your old one. Return your original iPhone within ten business days to avoid any fees or charges. [3] X Research source Apple puts a temporary charge on your credit card for the full cost of the replacement phone, but they’ll remove it once they receive and inspect your phone. If your phone has damage that isn’t covered by AppleCare+, such as normal wear and tear or intentional damage, then you will be charged the full price of the replacement or an out-of-warranty fee."
    },
    {
      "title": "File a claim if your phone got lost or stolen.",
      "content": "File a claim if your phone got lost or stolen. AppleCare+ covers theft or loss of phones up to 2 times each year and will send a replacement for a deductible fee. Sign in to your Apple ID and start a Theft and Loss claim online. After paying $149 USD and checking that your iPhone is actually lost, Apple will send you a replacement that’s the same as your old device. [4] X Research source You must have Find My installed and active on your iPhone to claim Theft or Loss coverage."
    },
    {
      "title": "Purchase AppleCare+ within 60 days of buying your iPhone.",
      "content": "Purchase AppleCare+ within 60 days of buying your iPhone. When you first buy your iPhone from the Apple Store or your mobile provider, you have the opportunity to add AppleCare+ to your account. Check if you have AppleCare in your account information. Otherwise, go into Settings → General → About → Add AppleCare+ Coverage to opt in. [5] X Research source AppleCare+ prices depend on which model iPhone you have: iPhone 15 Pro, iPhone 15 Pro Max: $9.99 USD monthly or $199 USD for two years iPhone 15 Plus, iPhone 14 Plus: $8.99 USD monthly or $179 USD for two years iPhone 15, iPhone 14, iPhone 13: $7.99 USD monthly or $149 USD for two years iPhone SE (3rd generation): $3.99 USD monthly or $79 USD for two years AppleCare+ with Theft and Loss coverage costs: iPhone 15 Pro, iPhone 15 Pro Max: $13.49 USD monthly or $269 USD for two years iPhone 15 Plus, iPhone 14 Plus: $12.49 USD monthly or $249 USD for two years iPhone 15, iPhone 14, iPhone 13: $11.49 USD monthly or $219 USD for two years iPhone SE (3rd generation): $7.49 USD monthly or $149 USD for two years"
    },
    {
      "title": "Extend your coverage if it expired within the last 45 days.",
      "content": "Extend your coverage if it expired within the last 45 days. If your AppleCare+ coverage recently expired, you may be able to resume monthly or annual payments for your plan. Go to https://support.apple.com/my-support and follow the instructions on the screen to re-enroll in an AppleCare+ plan. [6] X Research source After extending your coverage, your AppleCare+ plan automatically renews until you cancel it."
    },
    {
      "title": "Ask an Apple Store employee to apply AppleCare+ to your account.",
      "content": "Ask an Apple Store employee to apply AppleCare+ to your account. Some people have had luck negotiating with Apple Store employees to add late AppleCare+ coverage to their accounts. Take your phone in, and calmly let them know what happened to your iPhone. Ask them if there’s any way they can work with you to provide AppleCare coverage or waive device fees. If the employee tells you the repair is going to be expensive, say something like, “I appreciate you helping, but is there anything you can do to help me more?” or, “Thanks for helping, but could you ask if there are any other affordable options?” While negotiating with an Apple Store employee may not work 100% of the time, they will often try to get you the best deal so you continue being a customer. Avoid getting defensive or angry with an employee if they cannot reduce the price for you."
    }
  ]
}