{
  "url": "https://www.wikihow.com/Dye-Your-Hair-the-Perfect-Shade-of-Blonde",
  "title": "How to Dye Your Hair the Perfect Shade of Blonde",
  "steps": [
    {
      "title": "Understand what shades of blonde you are considering.",
      "content": "Understand what shades of blonde you are considering. Whether you are dyeing your hair from a box or at a salon, the shades can sound like food options at a bakery. Warm shades contain words like warm, honey, golden, butter, caramel, or copper . Cool shades are called ash, beige, pearl, and ice. [1] X Research source"
    },
    {
      "title": "Determine your skin tone.",
      "content": "Determine your skin tone. Most people are either warm or cool toned. The shade of blonde you choose for your hair depends on the underlying tones in your skin. Warm toned people have golden, olive, or dark skin with brown eyes. Their hair is black, brown, or dark blonde. [2] X Research source People considered warm tan easily. If you are warm toned, your hair reflects gold, and gold jewelry looks good on your skin. Cool toned people have fair skin with blue or green eyes. They have blonde, red, or light brown hair. These people burn instead of tanning. If you are cool toned, your hair might reflect silver in the light. Silver jewelry looks good on your skin. Turn your arm over. Look at the veins in your wrist and forearms. If they appear to be green, you have warm tones. If they are blue, you are cool toned. [3] X Research source Another method is to hold a white piece of paper up to your face. If you are cool toned, your skin will look blue compared to the paper. If you are warm toned, your skin will look yellow or golden next to the paper. [4] X Research source"
    },
    {
      "title": "Go for a natural shade of blonde if you're dyeing at home.",
      "content": "Go for a natural shade of blonde if you're dyeing at home. No matter what skin tone you have, if you want your hair to look natural, only go 2-3 shades lighter than your natural hair color. Also consider the color of your eyebrows when deciding on a natural blonde shade. Going a few shades lighter can easily be done at home. Lifting your hair's natural hair color a few shades can be achieved through a boxed dye. If you are going a few shades lighter on already dyed hair, but your hair naturally is dark, go for ash-toned blonde shades. Consider dyeing your hair with cool or neutral shades of blonde if you are doing it at home. Warm shades, with golden or honey in the title, can end up making your hair look orange. [5] X Research source"
    },
    {
      "title": "Go for cool colors if you have a pinkish hue to your skin.",
      "content": "Go for cool colors if you have a pinkish hue to your skin. Adding warmth to your hair if you have a pinkish hue can result in an over-reddening of your face. Go for cooler blonde shades, like sandy blonde, ashy blonde, or beige blonde. [6] X Research source"
    },
    {
      "title": "Go for a darker, honey blonde if you have darker toned skin.",
      "content": "Go for a darker, honey blonde if you have darker toned skin. Anyone can go blonde, but you have to find a complimentary shade for your skin. Darker and olive toned skin may not be right for a super bright blonde shade. Try a honey blonde instead. Another suggestion is to keep your darker roots and ask for golden beige highlights. The roots help prevent your face from washing out. Caramel is another shade of blonde that will compliment your tones. Alternately, you can try buttery or strawberry blonde shades. [7] X Research source If you have brown hair, be careful going too light because it can wash you out. Avoid platinum, white, or orange. Go for blonde highlights or lowlights instead."
    },
    {
      "title": "Add more color to your hair if you have medium skin.",
      "content": "Add more color to your hair if you have medium skin. You can try golden blonde, beige blonde, or even light blonde. Keep warmth in your hair to match your warm skin tone. To get a subtle ombre, keep your light brown base and add varying tones of honey highlights through the middle of your hair, going a bit lighter at the ends. If you have warm skin tones, avoid brassy blonde colors. Brassy blonde colors can end up giving you an orange hue. Ashy colors can leave you washed out."
    },
    {
      "title": "Go for golden when you have fair skin.",
      "content": "Go for golden when you have fair skin. If you have light skin, you want to choose golden, strawberry, or light blonde while staying away from white, ash, and reddish. [8] X Research source The lighter your skin, the lighter the shade of blonde you can go while still looking natural. Try buttery highlights on a caramel base. For a multi-dimensional, natural lighter blonde, go for a mix of butter, gold, and honey. Dyeing your hair blonde works well if you were blonde as a child, or your hair got blonde as you spent time in the sun. [9] X Research source"
    },
    {
      "title": "Consult a professional for drastic dye jobs.",
      "content": "Consult a professional for drastic dye jobs. [10] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020. For a bold blonde that goes beyond 2-3 shades lighter than your natural hair color, seek the help of a professional hair stylist. Extreme blonde shades or highlights require multiple bleachings, and most of the time, multiple visits to the salon. If you try to bleach your hair at home, you could end up with banana or canary yellow hair or brassy, golden orange. [11] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020. Anyone can be platinum blonde, but it may take months to achieve. Lighter hair will be much easier to dye a white blonde . Hair that has been dyed before or naturally dark hair will take much longer. To safely dye your hair, you need to gradually lighten the hair. If your hair is dark, you won’t going to be able to reach platinum blonde in one visit. It could take months of dyes in lighter shades to work you up to a white blonde. Most hair colors need at least 3 appointments to achieve full blonde status. [12] X Research source For a white blonde, go for ice blonde if you are warm toned. Platinum blonde works better on cool tones. Remember - there is no white . Ask a hair specialist to help you understand the different white shades if you have trouble. Correct a brassy dye job at home by using purple shampoo. [13] X Expert Source Karen Leight Professional Hair Stylist Expert Interview. 13 November 2020."
    },
    {
      "title": "Be careful when bleaching your hair.",
      "content": "Be careful when bleaching your hair. At home bleaching can go very wrong. If this is the first time you are dyeing your hair, go to a professional. When bleaching at home, make sure to follow the directions on the box exactly. Don't leave the bleach on for more than 45 minutes. Your hair should be a pale yellow when you finish bleaching. If it's an orange, which happens sometimes with very dark hair, wait a week to bleach again. Put conditioning treatments on your hair during this week. If you are trying to dye your hair platinum at home, you will need to use a purple toner or shampoo on your hair. This is a must if you want to dye your hair white blonde because it erases the yellow brassiness. Go for a 30 or 40 volume toner. Rinse with white vinegar to help keep the toner color longer. [14] X Research source Don't try to leave the bleach on your hair for a shorter amount of time to reach a darker blonde and a longer amount of time to reach a lighter blonde. Bleach doesn't work this way. It strips the hair if the pigments."
    },
    {
      "title": "Be prepared for the time and money.",
      "content": "Be prepared for the time and money. Blonde hair is a large undertaking. Your hair will need a lot of maintenance to keep it looking healthy, and you will need to spend time and money every few weeks filling in roots or getting touch ups. If you are not prepared for the responsibility of blonde hair, think about going a few shades lighter instead of anything drastic."
    },
    {
      "title": "Prep your hair before you dye.",
      "content": "Prep your hair before you dye. Before you do any kind of dye job, it is important to prep your hair. Avoid washing your hair the day before you dye it, as the natural oils help protect your scalp from irritation from the products. [15] X Research source"
    },
    {
      "title": "Condition your hair after you dye it.",
      "content": "Condition your hair after you dye it. This step is essential. Dyeing your hair strips it of its pigment and lipids, which dries it out. Switch your regular conditioner for a deep conditioner. If your hair is dry, use a moisture product; if it is brittle and damaged, use a damage product. Use dry shampoo so you don't have to wash it every day and dry it out. Use conditioning masks when you wash your hair. If you go platinum or ice blonde, use shampoos that contain blue pigment to maintain the color. Choose a color-care or bleach-safe shampoo and conditioner to preserve color. Try putting coconut oil on your hair once a week. Melt it down and put it on your hair, wrap your hair in plastic wrap, cover it in a towel, and leave on for about an hour."
    },
    {
      "title": "Cut your hair after you dye it.",
      "content": "Cut your hair after you dye it. Bleaching your hair can damage it, so to keep your hair healthy, cut it right after you dye it. This removes the dead ends, which can lead to breaking. [16] X Research source"
    },
    {
      "title": "Use a heat-protectant when styling your hair with heat tools.",
      "content": "Use a heat-protectant when styling your hair with heat tools. Straightening, blow drying and curling your dyed hair can damage it, so make sure to use a heat-protecting product before you grab the curling iron. Stay away from styling products that contain alcohol. Alcohol dries out your hair, which is a problem with bleached and dyed hair. Hairsprays, gels, and mouses all contain alcohol. Check the label before buying and putting it on your hair. [17] X Research source"
    },
    {
      "title": "Get regular touch ups.",
      "content": "Get regular touch ups. Unless you don't mind your roots growing in, you probably want to get them touched up regularly. Plan on touching them up every 4-6 weeks."
    }
  ]
}