{
  "url": "https://www.wikihow.com/Get-Good-at-Picking-Up-Girls",
  "title": "How to Get Good at Picking Up Girls",
  "steps": [
    {
      "title": "Have fun",
      "content": "Have fun . When you go out, having fun should be one of your primary motives. When you are having fun, anxiety and fear lessen. Hence you naturally feel less needy and don't take rejections and life too seriously. This can be quite attractive to most people. So, it's important to amuse yourself, talk and do things that you find interesting and funny, with common sense, regardless of if the other person would like them or not. As you will read later. Also, if you are not having fun, you are, most likely, going to give up because you will take rejections, other people’s opinions and reactions, anxiety, awkwardness and failures seriously. The core of flirting is playfulness! It's having fun, it's building a connection that even if it doesn't lead anywhere, so both people kind of uplifted and smiled and felt a little bit better and like they had a good time."
    },
    {
      "title": "Go out often.",
      "content": "Go out often. Like any other skill, 'pick up' should be practiced on a regular basis, at least in the beginning, to form a habit. So going out consistently helps a lot. Don't use 'going out often' as a crutch though. As a start, it helps to go out consistently until it becomes second nature. So you don't always have to dedicate time to practice. You can practice while you're grocery shopping, walking around town, running errands, commuting via public transportation, etc. It is highly recommended that you read How to Cold Approach a Girl and How to Pull a Girl Home to get yourself started."
    },
    {
      "title": "Know how to stop girls properly.",
      "content": "Know how to stop girls properly. There will be many occasions when you will need to stop a girl/woman to talk to her. The way you stop a girl is quite important, as it can distinguish you from being creepy to a confident person. Although, some women may find your approach creepy even if you were confident and polite. This could be because of their beliefs, interpretations and conditioning. However, that’s not your problem. Here are a few guidelines for different scenarios. When a girl or girls are walking towards you then start talking and/or wave at them while they are about 7 to 15 feet away from you. Use common sense; don't start talking when they are too far away or too close. This would not surprise them much and they would have enough of a time window to let their initial reaction subside. For example: when you and the girl are walking towards each other, wave to her and say something that you find funny or something situational like “Where did you get the coffee?”. As per the social conditioning, she usually would stop. Then you can tell her your intentions like \"I was just kidding; I thought you are absolutely adorable and I had to say hi.\" You can also remain indirect on the basis of the response and vibe exchange with the girl. In fact, remaining indirect can help you stay longer in a conversation, which helps hone your interactions and social skills. At the same time be sure to honestly sub-communicate your intentions (as you will read in the next section). So experiment with your openers. Also, if you want to be more dominant, simply stand in front of the girl/woman, as you give her a hand gesture to stop. Make sure there is enough distance between you and her. See if this works for you or not. If not, no need to keep redoing it. A humble smile helps a lot. If the girl/woman is in front of you and walking in the same direction, then tread or jog or run up to her, give her a light tap on the shoulder, and say \"Hi\". This may surprise her, but it communicates confidence. Alternatively, you can just walk up to her until you are shoulder to shoulder, turn your head towards her, say \"hi\", and do your spiel. Try to make sure that she sees you coming before you start talking. Another way would be to call her from the back. Say something like \"Excuse me\" or \"hi\", as you are walking towards her and when she stops or turns around, do your spiel. When a girl is behind you and is walking in your direction, simply turn around and do your spiel. Make sure there is an appropriate distance between you and the girl, so you don't surprise her too much. Stand your ground. Don't follow the girl or walk backwards if she's walking away, despite your assertive request of asking to stop or after opening to her. Stand your ground and let her walk away . You wouldn't want to talk to someone who can't stop even for a few moments to have a conversation with you. However, it's okay to walk with a girl if she genuinely seems to be in a hurry and/or asks you to walk with her. It's also fine to walk with a girl for some time to tune into her state. When you feel you are in tune, you can ask her to stop or simply keep walking with her, if you just want to get into a social mood, interact with her or build social muscle. Whatever feels natural. Of course, only if girl is fine with you walking with her."
    },
    {
      "title": "Be calmly assertive and lead with common sense.",
      "content": "Be calmly assertive and lead with common sense. Most girls/women like an assertive, commanding, and a leading guy. [1] X Research source It doesn't matter how confident or independent they are. It's because of biological and evolutionary factors. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Many of the attractive girls, most likely, will not stop or have a conversation with you unless you are leading and assertive. Which is one of the reasons why tall men generally get a better response from women, at least initially [3] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source . One way to be assertive is to down-talk and project your voice. Down talking means to speak from your chest/body rather than your head. Also improve your posture. More on this in the last section. Try this next time: when a girl is walking away from you then assertively but calmly say something like, \"Hey, wait! I am talking to you.\", as you wave her to come to you. If you do it right, it may turn on a biological switch in her head and make her compliant. Yes, attraction and connection are mutual but you are initiating and leading it. This doesn't mean to force yourself to be assertive. Use common sense and naturally calibrate as per the response, body language and energy from the girl. You don't have to be assertive all the time. Also, since many people are becoming more conscious and going beyond societal and mental conditioning, so a growing minority of women don't have high, traditional and sometimes irrational expectations like high status, good looks, tall, muscular, have a lot of money, big penis, alpha male etc. You don’t necessarily have to have all these traits to be an attractive person. Since attraction is becoming more and more subjective. Many men don't understand how important it is for a woman to feel physically and emotionally safe. Safety is a Top of Mind concern for women in dating, so make sure to not let her feel threatened or pressured."
    },
    {
      "title": "Become ok with rejections.",
      "content": "Become ok with rejections. Keep in mind that a good number of the women will not be interested in you due to the factors like being taken, personal choices, biases, life situation etc. [6] X Research source Manson, Mark. Models:Attracting women through honesty, Pg 65 Just move on and no need to keep doing the same thing again and again, if it's not working for you. Being aware of your breath and/or inner body helps a lot. Considering the large number of rejections from cold approach pickup, it should not be seen as the only way to meet and date girls. However, it has other deeper benefits that can help you in other aspects of life, such as getting out of comfort zone, public speaking, non-neediness, being resilience, having fun, being social, practicing non-reaction, finding inner-confidence, collecting evidence to counter your self limiting beliefs, becoming more aware of your deep seated mental patterns, caring less what people think, staying calm under pressure etc. Plus it’s a form of meditation because it brings you into the present moment. However, if you are enjoying it then you will likely meet and date more compatible women than dating apps or social circles."
    },
    {
      "title": "Recognize the level of interest from girls.",
      "content": "Recognize the level of interest from girls. Girls/women can be categorized into three categories: \"Yes\" girls. \"Yes\" girls are those who are attracted to you from the beginning itself. These are the girls who are easiest to maintain conversation and go on dates with. [8] X Research source Manson, Mark. Models: Attracting women through honesty. Pg 68 Unless you screwed up something, that attraction remains almost indefinitely. To identify 'yes girls', here are some signs: They keep a longer eye contact with you than usual. They blush. Play with their hair while talking to you. Feet pointing towards you. Laugh at your 'not so funny' jokes. Touch you. Follow your lead and/or imitate you. Invite you for meetups. Don't leave even though the conversation is getting cold. They try to rekindle a cold conversation or initiate a conversation. Don't pull away when you physically escalate or come closer to them. \"Maybe\" girls. These are those girls who are not sure if they are attracted to you or not. To get them to be attracted to you, you need to be polarizing from the beginning itself or they will lose interest. 'Polarizing' means to talk and do things that you genuinely find fun and interesting with common sense and calibration. It also helps to filter out people with whom you would not be compatible with. However, at the same time being polarizing may offend others. Which is ok but it helps to not be highly and explicitly polarizing from the beginning itself, as girls may get 'too repelled'. So it’s a good practice to slowly and subtly polarize to filter out girls/women, or people in general, who would not be compatible with you. So they don't react too much. Especially during current times as many people are becoming more and more sensitive. For example: Be alert and notice the girl/woman's reaction after you make a subtly polarizing joke, which you find funny, like \"Have you realized that life is sexually transmitted?\". Alertly notice the reciprocation from the girl like how she laughs, motivation to continue the conversation, body language, tone of her voice etc. Traditionally speaking, this comes with practice and experience, and is quite yielding in the long run. As you would be able to quickly pickup subtle hints like facial gestures, tone of their voice, eye contact, body language etc. to know if you will get along or not, and exit out of a conversation. Read How to Be Polarizing for more info on this. \"No\" girls. These are girls who are not attracted to you at all. It is better not to waste your time and theirs, as you are most likely not going to get anywhere. [9] X Research source Manson, Mark. Models: Attracting women through honesty. Pg 69 Some 'No' girls may flirt with you, just to seek attention. You may use that to improve your interaction and social skills, but do not take that seriously. Sign from these type of girls/women could be: Not keeping a good eye contact with you. Giving short or one word replies. Ignoring you. For example: checking their phone, looking away, talking to their friends etc. Continue talking to their friend despite your funny or interesting statements. Keep the conversation shallow. Arch their lips downward. Squint their eyes even after few minutes of talking to you. Pointing their feet away from you as if they want to walk away. Giving you shoulder. Keeping a distance from you. Here's something to observe in within: If you feel like you are trying hard to keep the woman engaged or to have a conversation, feel resistance or unease within (like heart, chest and face region), conversation feels forced and unnatural etc., then these could be signs that you are being needy or she's a No girl or you are not polarizing enough and/or having fun. It's better to polarize or move on and learn from it. The majority of girls will be \"maybe\" or \"no\" girls."
    },
    {
      "title": "Record yourself.",
      "content": "Record yourself. It can be quite yielding to record yourself while practicing pickup. Watching/listening to your recordings can improve your social skills by many folds, as it can help identify your mistakes and sticking points of which you are unaware of. Such things can include body language, facial gestures, behavioral patterns, weird noises you make, up-talk (unassertive tone), neediness, poor eye contact, repeating same things, supplicating behavior, etc. In fact, it's so important to record yourself that without it you will most likely end up ruminating for weeks or months or years, trying to figure out what you might be doing wrong. You don't have to record every interaction. Just a few recordings from time to time should be good enough to help you recognize your sticking points and make you more conscious of the mistakes you have been making repeatedly. Before you go out and start recording interactions, ensure that it's legal in your country or jurisdiction. For example: recording someone without their consent is illegal in some states in the US. [7] X Research source If that's the case, do it at your own risk. Audio recording. Most smartphones have a recording feature, so use yours as a recording device. Just wear earphones as if you are listening to music or wrap them around your neck like a stethoscope, and turn on the recorder before approaching. Make sure to test it before going out to check if the voice quality is good enough, when recorded from different positions. You can also use a digital recorder with a good quality mic for better sound quality. Look it up on any e-commerce website. Video recording. If you want to go more advanced, you can have a friend video record you. Before every approach, turn on your audio and signal your friend to start video recording. It's pretty fruitful, as signaling makes it easier to sync audio and video when using a video editing program. If you have no one else to record you then you can also use a spy pen or body cam. Again, do it at your own risk. Yes, it may make you cringe to listen and/or watch yourself, but that's exactly what you need to become more aware of your sticking points and good things you have been doing, as the truth will be right in front of you, if you are open to it."
    },
    {
      "title": "Make a genuine connection.",
      "content": "Make a genuine connection. Most guys \"want\" something from women. It could be sex, social status, physical intimacy, \"cure\" for their loneliness, affection, showing off, etc. Even if they get it, they don't feel satisfied. Why? It's because the human mind is inherently needy or insatiable . It always wants something, not realizing that no possession, relationship, pleasure, experience or achievement can provide it a long lasting fulfillment. [11] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 20. Read last step of How to Stop Being Needy for more insight. Here's the deeper truth: in essence, she's a human being like you. This means they have been through phases of suffering and happiness, have a life story, have passions, interests, likes and dislikes, fears, desires and most importantly, in essence , you both are the same. Isn't that enough to make you curious and try to make a deep connection with them? The deeper you go into it, the more you will realize that sex or physical intimacy is just a by-product of true communication. Dropping the small talk and jumping to deeper conversations is also polarizing. \"Be content with what you have; rejoice in the way things are. When you realize there is nothing lacking, the whole world belongs to you.\" - Tao Te Ching. Here are a few conversation topics that can help in the beginning of engage her in a conversation: passions, childhood, goals, personality, traveling, sense of humor, ups and downs in life, current affairs, interests, ambition, movies and TV shows, favorite things etc. Watch the linked video for more details. 36 questions When you truly realize the essence of who you are, it becomes immensely easier to make a deep connection with people, because in subtle or apparent ways they will be naturally drawn to you, if they already have some depth in them. Also, only in this state can you relate to others on a level deeper than movement of thoughts. \"When you realize where you come from, you naturally become disinterested, kind hearted as a grandmother. Dignified as a King.\" Tao Te Ching. At the same time, be practical. Yes, most of the guys are result-oriented, which means that getting laid is a great motivator and end goal for them. So instead of \"trying\" to make a deep genuine connection, which doesn't work anyway, simply be aware of this to naturally internalize it into your game, as you explore its benefits in the long run. Or try it as an experiment to see if it works for you or not and then adapt it into your game (as you will read in section 3)."
    },
    {
      "title": "Remember that honest communication of intentions is important.",
      "content": "Remember that honest communication of intentions is important. Even if you are making a deep connection with a woman, you may not necessarily want to commit to her, and this should be communicated through your intentions, so she doesn't feel led [12] X Research source Manson, Mark. Subtle art of not giving a F*ck. Pg 32 . In other words, sub-communication (body language, tone, vibe etc.) and non-verbal communication should be in alignment with your intentions. Or else it will come as in-genuine. In the long run, it's about your priorities. What are your intentions and what is more important to you and to what degree? Is it physical looks, sex, showing off, relationship, meaningful connection or all of them? Be very honest, as intentions are communicated far more than your words. Only knowing and accepting this will take you beyond the egoic states of desire and fear. This means that if you are into looks and/or your goal is to have sex, then be honest and act in alignment with your intentions rather than try to hide or suppress them. However, simply be aware that your actions are motivated from your desire to have sex with hot women. As mere awareness will eventually take you beyond this disproportionate attraction towards physical looks and your unrealistic expectations. Either way, no trying. Although, if you are trying then don't force yourself to not try. We will talk about this later."
    },
    {
      "title": "Understand romantic connection.",
      "content": "Understand romantic connection. Romance has a very high value for women because of the fundamental idea it's based upon. In ancient times, men were the ones who used to provide for the family while women used to rear children and take care of the house. Even though people are coming out of it, as many environments support \"self-dependence\", freedom from tradition, and physical security, but the majority of the people have the same conditioning because it still has momentum. [13] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 57. Romantic connection implies to a woman that a man will be there for her when she needs him. That's what makes it so powerful and rare. This is something to become aware of. However, again, make sure you don't lead women, if your intentions are not romantic."
    },
    {
      "title": "Make a habit of talking to “older” and/or \"less attractive\" girls or even guys when you go out.",
      "content": "Make a habit of talking to “older” and/or \"less attractive\" girls or even guys when you go out. As you have better chances to stay longer in a conversation with them. Which makes it easier to practice having a normal fun and genuine conversation with people without wanting anything or any other thing that you need to experiment or practice. Thus helping you to improve your social skills and develop non-neediness. This practice not only help you to perceive people beyond their looks but also has potential to change and dissolve your preconceived concepts, biases and paradigms that cause a lot of suffering and inertia. It also helps you to gain reference experience and lower your unrealistic expectations , if you want to see it that way. Plus, it's a practical way to get yourself in a social mood and sustain it, especially when you are out solo because sometimes, at the venue, you may not find enough women to talk to. So when you approach that hot girl you find attractive, you are already in a more fun and confident state. Polarizing doesn't always mean to move on to other girls because you realize that you are not going to be compatible with them and/or they are hot enough for you. Keep in mind that seeing people through concepts or beliefs on the basis of their looks, age, physical looks, background and other traits is not only limiting yourself and others but also missing \"not so often\" opportunities to meet some genuinely cool people, know their life experiences and learn something from them. By following this practice, you may have experiences and conversations that can change your current paradigms and mindset for good. Which can put you on a fast track and can cut down years of effort and frustration. This is one of the reasons why you should not reject the opportunities to interact or go on meetups or dates with girls/women who are taken and/or are less “attractive” and/or “older” than you. “When people see some things as beautiful, other things become ugly. When people see some things as good, other things become bad.\" Tao Te Ching . Again, at the same time, be practical about it. Yes, attraction towards good-looking girls/women is a great motivator. [11] X Research source . So it's fine to use this motivation to approach and date hot girls, but at the same time, to go beyond it, be aware that the motivation, which is conditioned, is coming from attraction towards their fleeting physical looks. Else you will remain stuck at that level and won't be able to go beyond the disproportionate magnetic pull towards fleeting looks. Read last step of How to Become Mentally Flexible for more."
    },
    {
      "title": "Use non-reaction to deal with tests.",
      "content": "Use non-reaction to deal with tests. Girls are very good at testing your patience and you as a person overall. It's an inherent behavior so at times, they don't even know that they are testing you. They will do all kinds of shenanigans and play games just to get a rise or reaction out of you. It's like they are qualifying you to see if you deserve them or not. Especially women who think they are high value. For example, if a girl says something like \"You are quite older than me; I am just a young sophomore girl\", what would be your normal response? It may be something like \"Yeah I know, but I am not that old,\" or \"I have dated girls your age before.\" These are defensive and supplicating responses. Instead, turn the tables by looking deep into their eyes and say something like \"Yeah, I am old. I don't think you can handle me\", \"I always wanted to be a sugar-daddy,\" or \"Yeah, you better watch out. I am a pedophile.\" This way you can also qualify them. It's like using the opponent's energy against themselves without conflict, reacting or using force. As it's seen in non-reactive martial arts like Aikido or Tai-Chi. So play it cool. A non-reactive and non-needy mindset is extremely attractive to most smart girls. Second example: If they say something like, \"I have a boyfriend,\" or \"I am seeing someone,\" then instead of replying with generic answers like, \"Okay, it was nice meeting you,\" remain non-reactive. You may reply with something like, \"Oh yeah, me too,\" or \"Amazing, let me give you a hug\" (then go in for the hug),\" or \"Oh, that's fine. I don't mind a three-way.\" or \"But I love you though\" etc. It's like subconsciously telling the girl, \"I don't care if you have a boyfriend or not. I'm going to have fun either way.\" Again Having fun and amusing yourself should be one of your primary motives . Else, fear and inertia may take you over and you will take rejections seriously, and most likely give up. Read Get a Girl to Go Home With You for more. Third example: When a girl is rude or meanly rejects you then instead of reacting, channel the reaction into something constructive or fun. Like bow down as you leave, or approach another girl immediately, etc. instead of dwelling on the reaction from rejection. You can also say something like \"I am just going to tuck in my tail and go talk to that girl.\". Or you can simply express what you are feeling in a fun way by saying something like, \"Man, that hurts. You just broke my heart\" or \"You just bruised my Ego.\" or \"I knew it. You are so tall and good looking girl.\" or \"I will just leave. I don't want to handle your Ego\" or \"I can see your future. Old woman pushing a stroller full of cat at a grocery store.\". It's therapeutic and vulnerable when you truthfully express your mental-emotional state and/or channel your reactions in a fun, creative and constructive way. [12] X Research source . Of course, with common sense and in non-reactive way with no strong malicious intention to attack or offend. Reactions are not you but conditioned mental-emotional patterns. Don't take them too seriously. Read Dissolve the Ego (According to Eckhart Tolle's Teachings) for more depth. When you realize that you are not your thoughts, reactions and emotions , you naturally become more non-reactive. More non-reaction practices are mentioned in section 4. So don't react, as in the long run, you may realize that rejections or failures can be equally, if not more, valuable experiences than desired responses or results. Read Become Mentally Flexible for more. No experience goes to waste, as there's always something to learn. \"Behind every seemingly bad situation lies concealed a deeper good and that deeper good reveals itself to you through inner acceptance to what is\". Eckhart Tolle. Also, reactions drain you of energy and as a result you may not be able to practice for long. A practical pointer: if you reacted then, most likely, you will feel uncomfortable when you go about talking to other girls because you just reacted to a girl at the same venue. Also, in western society, women are more likely to be believed than men. \"She is good to people who are good. She is also good to people who aren't good. This is true goodness.\" Tao Te Ching. Again, polarize subtly and slowly to quickly filter out those girls/women with whom you will not be compatible, so they don't get offended too much and you don't have to deal with symptoms like this. Especially, these days, when many people are looking for reasons to feel offended or upset. It is also practical and helpful in the long run, especially when you game regularly at the same set of locations, because it helps you to keep a low profile and game under the radar. Since facts are empowering, here's a factual pointer: Doesn't matter how scarily beautiful they look, their physical body and looks, just like yours, are subjected to the law of impermanence . Which means that within a few years, it will wrinkle, grow frail, die and then turn to dust. Just like your body will turn to dust. With this realization comes a playfulness and devaluation of forms and looks [16] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 210. . This, of course, doesn't mean to not take care, appreciate or honor your body and possessions. In fact, when you truly realize the transient nature of all forms, including your own, you honor, care and enjoy them even more because there’s a sense of detachment."
    },
    {
      "title": "Practice being funny.",
      "content": "Practice being funny. A good sense of humor is on the top of list of qualities of an attractive person. As it not only sub-communicates that you don't take life too seriously but is also intelligent. Plus, its a magnetic quality. Why do good funny shows or stand ups or movies attract such a large audience? If you don't know how to be funny then watch stand-ups, funny videos or shows, go through funny content etc. Use apps like TikTok, iFunny, YouTube, instagram etc. There is funny, interesting and informative content that is posted regularly on these apps that you can use in your own life situation. The content on these apps can also help you fix the problem of running out of interesting, funny and witty things to say and talk about. However, do not use your sense of humor as a mask to avoid rejection. Rejections are unavoidable. If you practice non-reaction, being funny, physical escalation and making deep genuine connection with women (or people in general), then the below conversation practices are no more than supplements to boost your conversation and seduction skills."
    },
    {
      "title": "Use the \"us\" mentality.",
      "content": "Use the \"us\" mentality. It's a quite persuasive conversation tool to keep the girl engaged and can make both of you feel comfortable pretty quickly. It means making the conversation about both of you, rather than you or the girl. For example: if she says she likes the video game series \"Sims\", you can reply with something like \"You know, we should play \"Sims\" game at my place. I'll order pizza and you can bring the soda. We can build a home together with a garden full of lilies and sh*t. Also, what color of paint should we use to paint the room for our future baby?\". It's like bringing her into your world or a mutual bubble. Don't be too serious as you could end up pushing her away. But again, act in alignment with your intentions. Use the \"us\" mentality in accordance with your personality and humor, or else it's not going to come out as genuine and will seem forced. Experiment to get a better understanding of your humor and personality. You could try using sexual, plain, lame or sarcastic humor in your conversations to see if you find it funny. If the girl finds it fun too, that's what helps make a good connection. Remember, it's about you and not the girls. You always have to put yourself first by talking and doing things that you like. It sounds selfish, but it's not. It's because when you are having fun, then in the long run, people in your company will also have fun, if they are compatible with your personality and sense of humor because they will feel your vibes which are communicated far more than your words. [17] X Research source Manson, Mark. Models: Attracting women through honesty. Pg 42"
    },
    {
      "title": "Use roleplay.",
      "content": "Use roleplay. This means you both play roles in an imaginary scenario created by you to help the woman visualize how its going to be like to be with you. Read the conversation in the image to get a better idea."
    },
    {
      "title": "Make it sexual.",
      "content": "Make it sexual. If your motive is to have sex with the girl, then sexual hints are quite essential. Some of these practices may come in handy to create sexual energy: Think about having sex while talking to girls/women. This charges the conversation with sexual energy. Be careful to avoid getting lost in fantasizing and/or getting an erection. Use sexual humor, with common sense, during conversations without forcing it. Let it come naturally as if you are having a normal conversation with a friend. Read Get a Girl to Go Home With You for more. Show intent with body language. While interacting with a girl, try leaning in a little closer, touch her, sub-communicate your intentions with facial gestures, etc. Don't force it though. Let it come naturally. Keep a gentle and focused eye contact. Interaction is quite effective when you keep a focused eye contact. Your eye contact should be piercing her soul, as the expression goes. Also, you can non-verbally convey your intentions through eye contact, which may prevent surprises in the long run. Physical escalation . This is gold if you know how to do it properly. It works best during the night time. Although, it’s fine to do it during daytime, in moderation. Read Make Out with a Random Girl and Pull a Girl Home for more details. Reduce or abstain from masturbation. Abstaining from masturbation, or at least reducing the frequency, helps naturally build sexual energy within you that surfaces during your interactions. Keep in mind that this may or may not work for you. Also, if and when you masturbate, think of your sexual experiences or fantasies, rather than masturbating to porn. This helps improve your imagination and doesn't let you to use porn as a crutch. Relying on pornography can be a destructive habit that can affect your sex and personal life. [15] X Research source . This could also be a symptom of depression. [16] X Research source"
    },
    {
      "title": "Balance interest and disinterest.",
      "content": "Balance interest and disinterest. Be careful about overdoing disinterest (teasing, sarcasm, playfulness, etc.) and interest (compliments, praise, etc.). As keeping a balance helps to keep the girl on her toes and interested. Here are some verbal examples: \"You look cute (pull) but you don't seem to be my type (push)\" \"Here, put your number in my phone (pull), but promise me you won't call me again and again (push)\" \"Let's go to my place (pull), but promise you won't touch me below my waist (push)\" \"You forgot my name? Go away I don't wanna talk to you (push). However, I forgot your name too (pull).\" Here are some physical examples: While making out, \"push\" at the right moment when her craving for you is the highest. This will make her want you even more."
    },
    {
      "title": "Know the difference between persistence and supplication.",
      "content": "Know the difference between persistence and supplication. Persistence is when you continue to persuade or pull the woman into a conversation when the she seems interested but not completely sure or is bound by social conditioning (\"yes\" and \"maybe\" girls). Signs could be laughing at your average jokes, trying to walk away but still not leaving, smiling, keeping a longer eye contact than usual, playing with her hair, giving vague answers when you ask for her number or invite her for a beverage etc. Use common sense while looking for these signs though. If she is serious or uncomfortable, try to tone it down. If she still seems uncomfortable, move on. There are plenty of other women. Read Get a Girl to Go Home With You for more tips on this. One of the ways to persist and fix the problem of running out of things to say is to \"plow\" or have a good verbal game. Which, in this case, means that you talk continuously about what you like to talk about to hook the women. Experiment to see if this works for you or not. Keep it simple. If a girl is not properly replying to you or your texts or calling back, then take the hint that she's not interested or has other priorities. There may be no need to continuously persist. Move on. Yes, some girls do like to play games and misinterpret your intentions to fit their narrative, but in the long run, you may realize how irrational, unintelligent and futile they are. Although keep in mind, some girls may be genuinely busy. So, as a guideline, its ok to contact them, twice or thrice, a few days after your last text/call."
    },
    {
      "title": "Experiment with your approach.",
      "content": "Experiment with your approach. Pickup is very subjective, as you meet many different people who all have vastly different personalities, mental interpretations to things, biases, conditioning, humor and list goes on. For example: suppose telling a joke to a girl, Martha, makes her laugh and telling the same joke to another girl with the same intention, Anna, creeps her out. Does this mean that Martha is cooler and/or more receptive than Anna? Perhaps. There could be many reasons for their different reactions. A few of them could be: Your personality and sense of humor resonates better with Martha, as the joke was polarizing. Martha is more open to meeting new people and cracking jokes with them. Anna could be in a bad mood, didn't like you or the joke, didn't like your physical appearance, likes taller guys, likes guys her own race, thought you smell bad, doesn't like to crack jokes with random people, is insecure, delusional, or has irrational beliefs, is biased, thought you were not confident enough for her, didn't like your grooming, clothes and style, is a \"no\" girl etc. You have no control over other people's conditioned reactions, actions, personality, and mood, and if you worried about it, you will just suffer. Even your own thoughts and emotions are not in your control. That is to say, they are automatic and conditioned. Read How to Become Mentally Flexible and How to Surrender to the Present Moment for more depth. So work only on the key practices or habits, as mentioned in the article and related articles, that are in your \"direct\" control. Read Become Mentally Flexible for more. For example: Dress well, groom and smell good, work out, speak with confidence and assertiveness, learn from your audio recordings, keep focused eye-contact, stop girls properly, keep a pickup journal, be nonreactive, meditate, monitor your mental-emotional patterns, keep some attention with in inner body and/or breath, make a deep connection, be curious, correct your body posture, have fun etc."
    },
    {
      "title": "Try new things.",
      "content": "Try new things. Practicing pickup as an experiment means you can try new things as test cases and just observe their outcome without any emotional or mental interpretation, like a good scientist. Let the true unconditioned interpretation come naturally, and you will see more clearly what works and doesn't work for you. Tao Te Ching says, \"A good scientist has freed himself of concepts and keeps his mind open to what is.\" For example: if you learned that maintaining good eye contact during interactions helps build attraction, then don't just reject or accept it right away. Use it as a test case. Practice maintaining a gentle and focused eye contact in all of your approaches and observe the outcome. Like a good scientist, don't get identified with the outcome. This may go on for several days or will be over after a few approaches depending on your personality, openness to try new things, humility, spiritual depth and learning curve. Like a successful scientific discovery is adopted by people on a larger scale, similarly integrate what you discover into your game."
    },
    {
      "title": "Make the deep seated mental-emotional patterns conscious.",
      "content": "Make the deep seated mental-emotional patterns conscious. Dating and attraction challenges, for most people, are not because they don't know what to say or do but because of their deep seated conditioned thoughts and patterns [20] X Research source Manson, Mark. Models:Attracting women through Honesty. Pg 89 . These conditioned thoughts and patterns could be from bad experiences or rejections in the past, taunts or belittlement from the people close to them, misinterpretation or selective interpretation of the experiences or people, collective cultural interpretations, unrealistic standards set by them, society and media and so on. This usually leads to lack of entitlement, inferiority or superiority, inflated of deflated ego, fear of rejection or failure, unrealistic and high expectations, anxiety, inadequacy, etc. Here are some examples of unconscious or sub-conscious mental-emotional patterns that arise when it comes to attracting women: \"She's too good for me.\", \"What can I ever do to make her like me?\", \"What if she rejected me?\", \"I have been rejected so many times by women like these.\", \"These kind are women think that they are too good and entitled.\", \"She's not good looking or hot enough.\", \"Her butt's too small\", \"Too tall or short\", “she’s so out of my league” and so on. Inquire deeply to recognize that these are conditioned thoughts generated by your conditioned mind to strengthen its illusory self and to get a false sense of 'I know', superiority or inferiority. In other words, the mind thinks through concepts and conditioned interpretations, it can know the reality. This is highly delusional because these concepts and conditioned patterns limit yourself and prevent you from seeing the kaleidoscopic truth. It’s because reality is a unified whole and can only be realized when you step out of your mind . A high degree of alertness is required to catch and accept these conditioned thoughts, emotions and patterns to dissolve them. It’s because they can be extremely subtle and quick but that's how it is. Once these patterns dissolve or weaken, you naturally become non-reactive and attracting women, who have some degree of depth in them, becomes natural and easy, without you having to do the hard work of learning concepts, reading a bunch of books, memorizing jokes or techniques etc. because you naturally connect with people on a deeper level. Right actions or words come naturally from infinitely intelligent unconditioned consciousness of inner space."
    },
    {
      "title": "Be aware of the mental constructs.",
      "content": "Be aware of the mental constructs. A construct like, \"When I keep a strong eye contact, girls seem to be pretty attracted to me. So if I keep doing that, I will get same or similar results all the time,\" would be another mind-made concept made in a futile attempt to understand the world through limited mind . It's fine to use concepts in the beginning or from time to time, but as you go along, you shouldn't cling to concepts as they fragment the reality but use them as guidelines. So a truly intelligent action is not possible. [21] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 9 . Mind is not the most intelligent faculty in human beings but formless 'Awareness' or consciousness is. Read How to Stay Rooted in Being for more depth on this. This is the feeling of 'Awareness' that Einstein pointed to when he said \"The scientist's religious feeling takes the form of a rapturous amazement at the harmony of natural laws, which reveals an intelligence of such superiority that in comparison with it, all systematic thinking of human being is an utterly insignificant reflection. This feeling is the guiding principle of my work.\""
    },
    {
      "title": "See that world is just a reflection of your inner state.",
      "content": "See that world is just a reflection of your inner state. Most people may have different self-limiting core beliefs that have a vast impact on their actions, words and personality. These beliefs are also reflected from the people around you, as the world is just a reflection of your state of consciousness . [22] X Research source Tolle, Eckhart. <i>A New Earth.</i> Vancouver, BC: Penguin, 2005. Page 290, 308. Suppose you have beliefs or conditioned thoughts that say \"If I approach them, they would feel threatened by me.\" or \"What if I do something out of the norm?\", \"What’s the point? She's going to walk away or end the conversation\" etc. Be alert to realize that these beliefs or thoughts and emotions , would, most likely, be reflected in the people around you. As these thoughts and emotions, which are fundamentally energy or vibe, are felt by others unconsciously or subconsciously. As a result, your thoughts may become a self-fulfilling prophecy. Even though, in reality, you may be a nice and attractive person and don't mean any harm. Yes, there is a possibility that they may find you threatening and reject you because of their irrational beliefs or stereotypes or biases. This may make you perceive yourself the same way; like a mirror. Although deeply realize that the primary reality is within. So you need to make these conditioned patterns conscious and realize them as false in you , to go beyond this loop. We spoke about this earlier. Read Become Mentally Flexible for more depth. Again, most of these irrational, self-limiting and negative beliefs exist because of identification with personal and cultural conditioning, misinterpretations of past experiences etc. Which is ultimately identification with mind . [23] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 50 . Again, a high degree of alertness is required to detect, accept and let go of these thoughts to dissolve them. Or else they will continue to hypnotize you and run your life like a puppeteer in the background."
    },
    {
      "title": "Test the validity of your self limiting beliefs.",
      "content": "Test the validity of your self limiting beliefs. A pragmatic practice to change irrational beliefs is to test their validity by collecting evidence or questioning them, to see whether they are accurate or not. Suppose you have a belief or thought that comes before approaching girls that says \"What's the point? she's going to reject me anyway.\" or \"She's going to frown at me\". Then test the validity of these beliefs via experimentation. This means when you approach and talk to women, simply observe to see if it's really the case. When the evidence suggests otherwise, that's what helps change these self-limiting beliefs. Don't just stop after a few approaches. As mentioned above, it depends on your personality, openness, and degree of awareness. To add more evidence, think of any experiences when women have been receptive and interested in you. This practice resembles cognitive behavioral therapy (CBT). [21] X Research source Read How to Eradicate and Stop Negative Thoughts for more. Even if the evidence confirms your thoughts or beliefs then it should be seen as a feedback about you need to change to become more attractive. Be aware of the unconscious expectation before testing the beliefs or you may end up in a state of scotoma. [22] X Research source Scotoma is a psychological state when your mind sees what it wants to see and ignores any evidence that contradicts the belief or statement. For example: if a girl rejects you and you say \"See, I knew she will reject me,\". This implies that your mind is more open to evidence that would support the belief rather than seeing the subtle truth of the situation. Again, like a good scientist, be very honest, open to what-is and just observe without any attachment or expectation. In other words, be there as the background awareness without adding any interpretation to anything. These unconscious beliefs, however slight or subtle or deep seated, can survive in you for decades and continue to reflect in your reality, if not made conscious and recognized as not who you are. Therefore a high degree of alertness and honesty are needed to detect and dissolve them. As a hint, see if you can detect mental patterns (thoughts and reactions), physical reactions and sensations arising in the left side of head, when you face a challenging or undesirable condition, thoughts or situation. Read How to Stay Rooted in Being for more depth. Use affirmations. For some people, it can be pragmatic practice to replace negative beliefs with affirmations. Whenever negative, presumptuous or demoralizing thoughts arise, like \"she's too hot for me\", \"She's so out of my league\", \"She will walk away.\", “They will be mean. What’s the point?” etc. then replace it immediately with something like \"I deserve it,\" or \"You are worthy.\" [26] X Research source Sincero, Jen. <i>You Are a Badass.</i> Philadelphia: Running Press, 2013. Page 56 As a practical measure, it helps to have a balance between relationships, health, and wealth to back these affirmations (as you will read in the second step of section 6). You can also immediately feel your inner-body or become aware of your breath or sense perceptions. That is to say become present. This also implies to disidentify with the negative thoughts that arise. Which is one the most effective practices to dissolve self limiting and negative beliefs , along with [[Watch the Mind (Meditation)|watching your thoughts and emotions. In fact, feeling your inner body is essential to be the watcher of your thoughts and emotions. This also implies to deeply realize that you are not your mind (thoughts, emotions and reactions) but the One who sees them. That's when your true power shines through you."
    },
    {
      "title": "Get another opinion.",
      "content": "Get another opinion. While listening to your recordings, an unbiased third person wouldn't care whether you do good or bad; he/she would just observe. There is a strong identification in the word \"I\" and its forms. In the sentences \"I failed the test,\" or \"She failed the test,\" which would incite a bigger emotional response? And yet they are no more than thoughts or concepts in your head. Alternatively, you can simply ask the girls if they find anything about you that could be improved. You will be surprised how many of them tell you. However, just because they have a vagina doesn't automatically make them DE-facto expert about dating and pickup. Also, girls usually are not a good authority to tell why they like or don't like certain things. [27] X Research source Manson, Mark. Models:Attracting women through Honesty. Pg 89 . Here's an analogy: You don't ask fishes about how to catch a fish. You ask the fisherman."
    },
    {
      "title": "Keep a journal.",
      "content": "Keep a journal. After practicing pickup, jot down the good things and things you need to improve in a journal. You cannot always record yourself, so keeping a journal can be quite yielding to become more aware of the mistakes and good things you have been doing, during your interactions. You can also make voice recordings of your mental notes. Read the notes in the image to get a better idea."
    },
    {
      "title": "Find your demographics.",
      "content": "Find your demographics. As mentioned, everyone is different (psychologically and physically speaking), have different personality, passions, energy level, capacity, interests, interpretations and so on. So it helps immensely to go to places where there is a higher possibility of finding like-minded people. For example: if you are really into video games, then chances of meeting like-minded people will be higher at a video game arcade as compared to an outdoor club. [28] X Research source Manson, Mark. Models:Attracting women through honesty, Pg 98 Similarly, if you are into books, then chances of meeting like-minded people will be higher at a book club or library or book shops rather than a bar. Just meeting women at the places of your demographics will increase your success rate by a good percentage. Also, if you want to increase your chances further then be the leader in your trade. For example: instead of going to meditation events, facilitate the events. Or instead of going to book events, organize them, where you can share your thoughts about books and of course meet girls. This, of course, doesn't mean that you shouldn't go to places like bars, events, or outdoor clubs. You can still meet cool people there and practice pickup. As almost all people have more than one interest, but your chances may not be high. So keep a balance. Again, it's not always about getting girls, as practicing pickup helps you in many other aspects of life such as public speaking, detecting and dissolving deep seated fears and insecurities, dissolving social anxiety, facing fears, seeing other people's perspective, meeting new people and so on. We spoke about this earlier."
    },
    {
      "title": "Ask yourself often \"What is my state of consciousness now?\".",
      "content": "Ask yourself often \"What is my state of consciousness now?\". None of these guidelines will work if your consciousness is not in a state of acceptance, enjoyment, or enthusiasm. There will be no creativity and you will be forced to relive the same mind-made repetitive reality again and again. For example: Your conversations will be mechanical and die out pretty quickly. Read How to Surrender to the Present Moment for more insight. Have fun. When you are having fun, the static of mental resistance and negativity dissolves and your true nature comes out. Ask yourself, \"How can I make this situation fun?\" Again, do not force it. Let it come on its own. We spoke about this earlier. Read How to Stay Rooted in Being for more info on this. Whenever you feel anxious or afraid or any other form of negativity, simply shift your attention from negative emotions to present moment anchors or channel it out by making the situation fun and silly. For example: you can funnily say to yourself or girls something like, \"If I sound nervous, its because I am carrying pain of humanity in me.\" or \"You look so good that my fingernails are sweating\" etc., depending on your sense of humor. It helps to use apps like TikTok, instagram, YouTube etc. as they have funny memes or videos that you can relate to your situation. Plus, memes can be gold while texting girls. If that's not possible, accept what is and/or take action immediately and/or remove yourself from the situation. To learn more about this, read Become Mentally Flexible. It's all energy (low to high frequency) that's arising and subsiding in your space of awareness. Since energy can only be transmuted, so practices like these help to channel or transmute this negative energy in a creative and constructive way into presence ."
    },
    {
      "title": "Practice acceptance.",
      "content": "Practice acceptance. Like anything in life, pickup has ups and downs. There will be times when you will have tons of successful interactions and times when you will fail a lot. Also amid these ups and downs, there may be micro-periods of ups and downs. Realizing deeply that this is a part of life is acceptance. Acceptance comes into action when life is in down cycle. For example: sickness, weakness, loss, injury, failure, bad or low phase in life, etc. In the greater scheme of events, these phases of 'low' are absolutely necessary for spiritual depth and can be great teachers to help you be more compassionate, forgiving and cope when life hits rock bottom. So hang in there and trust the universe. A low cycle may last for a couple of days to couple of years."
    },
    {
      "title": "Practice non-reaction.",
      "content": "Practice non-reaction. Non-reaction is much more effective and attractive than most other pickup techniques or practices. In general terms, people who are non-reactive are the ones who are, traditionally speaking, considered as cool. It's because they don't react to 'what is' and take life too seriously. Below are few pointers that can help you be more non-reactive: Feel your body from within as much as you can. Especially while interacting with someone. Then monitor the quality of the interaction as compared to when you are not aware of it. It is highly recommended that you read How to Stay Rooted in Being for more information on this. Be aware of your breath and sense perceptions. Awareness of breath and/or sense perceptions shifts attention from the reactive mind to the Now. Which lessens suffering because there's no suffering in the Now. Here’s a practice: Keep some attention in your inner body and/or sense perceptions and/or breathing, while doing anything. As you practice this, you may observe how it naturally increases your joy and peace, and quality of your actions and words. Accept what is . It means to offer inner acceptance to whatever arises in the Now. This is the most effective practice to dissolve suffering and self-limiting beliefs."
    },
    {
      "title": "Practice humility.",
      "content": "Practice humility. It means not playing roles while interacting with anyone. Do you talk to your boss the same way you talk to a cashier at the supermarket? If not, you are playing roles, and subsequently, you will play different roles while talking to different people in your life. That's what makes people look gamey and ingenious. People who practice humility are approachable, easier to talk to and are much more friendly and real. It's because they don't suppress or mask their true (negative or positive traits) personality with fleeting confidence or state of inferiority/superiority derived from identification with form, such as looks, wealth, background, skills, title, job, nationality etc. Its because through becoming \"vulnerable\" can you discover your true and essential invulnerability. [29] X Research source Tolle, Eckhart. <i>The Power of Now: A Guide to Spiritual Enlightenment.</i> Vancouver, BC: Namaste Publishing, 1999. Page 220. . \"Humility means trusting the Tao, thus never needing to be defensive.\" Tao Te Ching. Read How to Practice Humility for more insight. This doesn't mean to force yourself to 'not play roles'. As that would be another role. Instead, just be aware of the role-playing patterns, as mere awareness will take you beyond them. Awareness is Intelligence itself. Greatest agent of inner transformation. Tao Te Ching pointed to this truth simply \"If you want to get rid of something, allow it to flourish.\" In this context, it means that even if you notice that you are being gamey or playing roles, allow it to be. The 'flourishing of gaminess' will eventually force you to accept and take you beyond it. When you are aware and allow it to be, a new dimension of consciousness emerges through you, far more intelligent than the human mind. [30] X Research source Tolle, Eckhart. <i>A New Earth.</i> Vancouver, BC: Penguin, 2005. Page 259, 117. However, be aware that ego is very clever. You may be thinking that you are allowing it to be, but in reality that \"allowing\" could be the ego's hidden desire to dissolve it as quickly as possible. Which implies that Ego is treating the now as a means to an end."
    },
    {
      "title": "Live an interesting life.",
      "content": "Live an interesting life. People who live an interesting life, follow their passions, hobbies, and desires are considered very attractive. For example: musicians, tech entrepreneurs, travelers, actors, adventurists etc. Living an interesting life also gives you a lot of interesting stuff to talk about and deepens your confidence. Most people are boring and lead a quite straightforward life. They might go to work or school, then come back and play video games, talk and hang with friends or family, watch TV or movies, etc. Life pretty much revolves around these things and that is what they usually talk about. What is the most interesting, adventurous, spontaneous thing you did in the last 100 days? What are your passions? Make a habit of doing something interesting and new that you find fun from time to time. Like hiking, skydiving, visiting new places or exploring your city, visiting animal shelters, events, volunteering, travelling and pursuing your passions or hobbies etc."
    },
    {
      "title": "Work on the balance between health, wealth, and relationships.",
      "content": "Work on the balance between health, wealth, and relationships. Having a good balance between these three aspects is important to get good at pickup. As all these aspects are interconnected and back each other up. People who keep a balance between these aspects have a better potential to quickly get good at pickup. As they are easily able to connect the dots between these areas and subareas. For example: People who have a good social life are more likely to be confident and successful. While lack in one of the aspects would, most likely, affect the other two in the long run. For instance: if you are investing too much time in making money (wealth) and on your health, there is a good possibility that your social life (relationships) will suffer. Which may affect your wealth and health (emotional and physical) in the long run. Similarly, if you have wealth but don't have good social life and/or health, then it may eventually affect your wealth. However, there's a paradox to it. If you completely accept the 'lack' in one or more of these aspects, then that could work for you too. This can also work like a priming effect. [28] X Research source Which means if you are spending a lot of time just doing pickup, then eventually it may force you to realize the importance and balance between relationships, health, and wealth to get good at it. There's a possibility that you may burn yourself out in this process before realizing it. Since everyone is different, experiment to see which approach/approaches work best for you."
    },
    {
      "title": "Understand that looks, height, status, physique, race and wealth matter.",
      "content": "Understand that looks, height, status, physique, race and wealth matter. Yes, they matter, and if someone says otherwise, they are lying or don't know. In some cases, they matter more, and in others, not as much. For example: In western and eastern countries, girls generally find white and/or tall guys to be more attractive as compared to others. Yes, its harder for non-white(minority) guys in western world, but at the same time if you simply accept it without any reservations then it can also work to your advantage and can potentially help you access inner timeless beauty within. In other words, you become less dependent on external appearances and don't get phased out by them. Also when you approach and talk to girls, you are already coming out as polarizing. If you keep your composure in the midst of difficult situations, and embrace or accept challenges, you naturally go deeper. As challenges drive you deeper. However, overall, the above external factors don't matter as much as men think they do. [32] X Research source Manson, Mark. Models:Attracting women through honesty, Pg101 . In a way, men are lucky that many women are not into physical looks as much as them. [30] X Research source ."
    },
    {
      "title": "Practice essential habits.",
      "content": "Practice essential habits. Apart from the paradigms, habits, and practices mentioned above, below are some common habits that are equally essential: Keep your place ready for company. Go out with wingmen. It helps a lot if you go out with good wingmen. Look on Facebook and online forums to find wingmen. If you can't find a regular wing, you can also talk to other guys at bars or clubs and encourage them to talk to women with you. You will be surprised how many guys agree and how helpful this practice can be to make you feel more comfortable and attract women. As women generally feel comfortable with people who are out with their friends. Work out, groom, maintain personal hygiene, eat healthy, smell good and dress well . Just these habits will increase your attractiveness by 20-30%. Guaranteed. Speak from your chest or your whole body rather than from your head and nose. Be aware where the air is coming from when you speak. If it's mostly coming out from your nose, your voice will not be that deep. Hence, your speech will have less of an impact. [34] X Research source Manson, Mark. Models:Attracting women through honesty, Pg 76 Above all, be in touch with breath and/or inner body as much as you can. This practice alone will be more transforming than all the other mentioned practices, combined. This practice becomes easier when you truly realize that [[[Dissolve the Ego (According to Eckhart Tolle's Teachings)|you are not your mind]]."
    }
  ]
}