{
  "url": "https://www.wikihow.com/Diagnose-and-Treat-Blepharitis-in-Cats",
  "title": "Blepharitis in Cats: Diagnosis and Treatment Options",
  "steps": [
    {
      "title": "Swelling of the eyelids",
      "content": "Swelling of the eyelids When a cat has blepharitis its eyelids will likely swell due to the infection. Look for red and puffy eyelids in one or both of your cat's eyelids. [2] X Research source Because this infection is bacterial, it can move from one eye to both eyes. However, it may just stay in one."
    },
    {
      "title": "Pain",
      "content": "Pain If your cat has blepharitis, it is likely that it is in some discomfort. The cat may scratch or rub its eyes repeatedly. It may also keep the affected eye or eyes closed for long periods of time. [3] X Research source If your cat rubs its eyes too much, this can cause additional trauma to the eye area. This can make identifying the source of the infection difficult and increase the seriousness of the infection."
    },
    {
      "title": "Discharge and crusty eyes",
      "content": "Discharge and crusty eyes If your cat's eyelids are infected, there may be clear or yellow discharge around them. In addition, the eyes may be covered in crust or flakes may develop. [4] X Research source Discharge and crusty eyes can be associated with a variety of eye conditions. If your cat has these symptoms, it needs to be looked at by a veterinarian to identify the specific cause."
    },
    {
      "title": "Predisposing conditions",
      "content": "Predisposing conditions There are some things that can predispose a cat to getting blepharitis. The most common congenital cause of the infection is entropion, which is a condition that causes the edges of the eyelids to rub on the cornea. Additionally, cats with feline herpes virus-1 and cats with food or environmental allergies are more likely to get this infection. [5] X Research source Cats that have flat faces, deep facial folds, or bulging eyes are most likely to have entropion. If your cat has any conditions that could predispose it to blepharitis then you should be vigilant in looking for the symptoms on a regular basis."
    },
    {
      "title": "Make a veterinary appointment.",
      "content": "Make a veterinary appointment. If your cat is having problems with its eyes, it's important to have them looked at by a veterinarian. Call your veterinary office and make an appointment for your cat to be seen. Tell the receptionist what is going on with your cat and ask for an appointment that will get your cat seen sooner rather than later. Eye infections should not be ignored, as severe infections can lead to reduced vision or permanent blindness."
    },
    {
      "title": "Discuss the cat's symptoms with the veterinarian.",
      "content": "Discuss the cat's symptoms with the veterinarian. When taking your cat in to get assessed, you should be ready to tell the veterinarian all about your cat's condition. Tell them when the symptoms started and if they have changed over time, in addition to answering any additional questions the veterinarian may have."
    },
    {
      "title": "Agree to a variety of tests.",
      "content": "Agree to a variety of tests. Your veterinarian may want to run some tests on your cat to assess the underlying cause of the condition. Some of the tests can be completed in the veterinary office and some may need to be sent to a laboratory for analysis, such as the tests for feline herpes virus. These tests can be particularly important to figure out whether the infection requires an antibiotic for treatment. [6] X Research source Your vet may perform a biopsy or take skin scrapings to help diagnose the cause of the blepharitis. These will be sent to a lab for evaluation. [7] X Research source"
    },
    {
      "title": "Consider consulting with a veterinary ophthalmologist.",
      "content": "Consider consulting with a veterinary ophthalmologist. If your veterinarian does not know how to treat your cat's condition satisfactorily, they may suggest having the cat seen by a board certified veterinary ophthalmologist. This is an eye doctor for animals. They should be able to work in collaboration with your usual veterinarian to figure out the best course of treatment. It may be necessary to seek out a veterinary ophthalmologist yourself for a second opinion. If your cat's condition has not improved with initial treatment, you should ask your veterinarian for a referral or find an accredited specialist on your own."
    },
    {
      "title": "Give your cat medication.",
      "content": "Give your cat medication. Give your cat the medication that your veterinarian prescribed. In most cases, this will be a topical antibiotic that will be applied to the eyelid. This will eliminate bacteria on the surface of the eyelid and it will keep the healing area moisturized. [8] X Research source In some cases, your veterinarian will prescribe an oral antibiotic that is taken in pill form."
    },
    {
      "title": "Place a warm compress on the affected area.",
      "content": "Place a warm compress on the affected area. Your veterinarian may also suggest that you apply warm compresses to the area to minimize swelling and discomfort. Simply wet a clean cloth with warm water, wring it out, and then hold it on your cat's eye for several minutes, or as long as it will let you. [9] X Research source Warm compresses that are done regularly with clean cloths can help to clear out any clogged glands. They will also help to keep the infected area clean. Not all cats will cooperate enough to have this done."
    },
    {
      "title": "Keep an eye on the condition.",
      "content": "Keep an eye on the condition. It is important to make sure that your cat's condition is getting better during treatment. If it is not getting better, and in fact getting worse, you should call your veterinarian and have your cat seen again. An eye infection that is not treated effectively can become very serious and threaten your cat's sight. Treating blepharitis can take awhile. As long as the condition is not getting worse, keep doing the treatments as prescribed until your cat gets better. [10] X Research source"
    }
  ]
}