{
  "url": "https://www.wikihow.com/Garden",
  "title": "How to Prepare and Plant a Garden",
  "steps": [
    {
      "title": "Decide what you want to grow or do with your garden.",
      "content": "Decide what you want to grow or do with your garden. There are many different types of gardens and uses for a garden, so think about what your ideal type of garden would provide. Some of the different types of gardens include: Vegetable garden . This may be the most popular and practical type of garden. By growing your own vegetables, you can save money and increase the number of fresh vegetables you eat. Flower garden . A flower garden adds beauty to your yard and it can be a relaxing escape for you. If you are mainly interested in beautifying your property, then a flower garden may be the best choice. You can plant perennials, annuals, or a mixed garden. Butterfly or hummingbird garden . You cannot grow butterflies or hummingbirds, but you can plant flowers that will attract them to your yard, like pollen-rich wildflowers, dill, fennel, and milkweed. [1] X Research source A butterfly or hummingbird garden can be a great type of garden to plan with kids. Wildlife garden . A wildlife garden is one that helps to support the animals in your area by providing them with sources of food and shelter. These are typically plants that are native to your area, so you would need to learn what your native species are to plan your garden. [2] X Research source"
    },
    {
      "title": "Consider how much space you have available.",
      "content": "Consider how much space you have available. If you have lots of space, then you can plant a garden in the ground. If you have limited space or simply do not want to plant in the ground, then you can also plant a garden in containers. You can grow a variety of different plants in pots and keep them on a patio or in a sunny spot of your yard. Some plants even thrive in containers indoors, so using containers may also be ideal if you live in an apartment. If you live in an area with good soil that is not too rocky or sandy, then growing your garden in-ground is a good option. If growing your garden in-ground is not a viable choice, then consider buying containers to grow your plants in or building above ground beds. Above ground beds are great because they are easier on your back and can be moved around your yard if desired. Make sure the containers or beds are large enough for the plants you want to grow and that they have good drainage. If you are limited on space, but still want to have your garden outside, then you can grow a vertical garden. These types of gardens use small planters or stacked crates and upright-growing plants."
    },
    {
      "title": "Determine how much sun your plants will get.",
      "content": "Determine how much sun your plants will get. Many plants require around 6 to 8 hours of full sun to thrive. If you do not have an area that will provide this much sun, then you can still plant a garden. You will just have to choose plants that thrive in the shade or with less sun. [3] X Research source Try checking the area where you plan to grow your garden a few times per day on a sunny day to see how long the sun is shining in that area. For example, you could check at 7am, 11am, 2pm, and 5pm, and make a note if the sun is shining on that area around that time. If the sun is shining on an area during two or three of your checks, then sun-loving plants will probably thrive there."
    },
    {
      "title": "Choose a plot.",
      "content": "Choose a plot. Location is important when you are planning your garden. Most importantly, determine if the area you want to use gets enough sun. Then, consider if the size is appropriate for what you want to do with it and also consider how you will water this garden. You should either be able to pull a hose over to it if it is a large garden, or be able to carry a full watering can to it if it is smaller. If you are going to be growing a container garden, it is still important to identify a suitable area to place the containers. The area should have good sunlight, enough room for the plants to grow upwards, and they should be easy to transport to a source of water or located somewhere that is convenient to bring water to them."
    },
    {
      "title": "Test the soil.",
      "content": "Test the soil. Good soil will have an adequate amount of lime, phosphorus, nitrogen, and potassium. Find out how much of each you have in your soil, and what you need to add more of to get the best growing plants. If you are planting a container garden, then you don’t need to worry about this. You can just use potting soil that is appropriate for the type of plants you will be growing. You can purchase an at-home soil testing kit from many hardware and garden stores. Follow the directions to find out the properties of your garden soil. You can take soil samples from around your garden and have them sent to your local state-certified soil testing lab or university extension service, and for a small fee they will lab-test your soil and send you the results within a week. This is much easier than testing the soil yourself, but it does cost more. Take multiple soil samples from around your garden to make sure that you are getting accurate test results. Test your soil’s pH to see if you need to make changes to balance it. To do this, use a pH testing kit or make your own test at home and check the soil from your garden. Certain plants prefer different pH levels, but it is best to have soil that is as close to neutral - a pH of 7 - as possible."
    },
    {
      "title": "Prepare your soil.",
      "content": "Prepare your soil. Once you have your soil and pH tests completed, ready your soil by adding the necessary nutrients to help your plants grow. Add organic matter to help enrich your soil with nutrients. You can use compost (from your own compost pile, if you have one), decomposing leaves, peat moss, or decomposed animal manure. All of these are available for purchase at local gardening centers if you don’t have easy access to them. Add fertilizer to your soil to help substitute in nitrogen, phosphorous, or potassium that you may be lacking. The label on the fertilizer bag will tell you exactly how much of each of these nutrients is present. The numbers 5-10-5, for example, tells you that the fertilizer contains 5% nitrogen, 10% phosphorous, and 5% potassium. Following the results of your pH test, if your soil is alkaline (above 7), try adding lime or wood ash to neutralize it. If your soil is acidic (below 7), add peat moss or decomposing leaves. Depending on what plants you want to grow you may not need to alter the pH. It is easier to grow plants that will survive in the existing soil."
    },
    {
      "title": "Research your area.",
      "content": "Research your area. It is important to find out information about growing conditions in your area. Look online, speak to a local garden consultant, or call your cooperative extension service. Find out when frosts start and end on average, so you know the right time to plant. Planting too early or too late can kill your seeds or plants, so it is vital to know when the best time to start is. Learn about local weather patterns that might impact your garden. Look-up the best time to harvest your fruits, berries, and vegetables in your area. Some of these may be straightforward, but some plants require a little more know-how about when the best time to harvest them is. Make a schedule of when each of your specific plants needs to be planted based on their habitat requirement and growing needs. Some plants may need to be started very early in the season, while others may not need planting until the summer. [4] X Research source"
    },
    {
      "title": "Gather your tools.",
      "content": "Gather your tools. To make gardening as easy and relaxing as possible, it is important that you have all the right tools. Use a shovel, gloves, gardening trowel, a garden fork, baskets or buckets to hold weeds, and a watering can at least. You can purchase other tools, but it is not necessary for a small to medium sized garden. For a large garden you may also need to purchase a wheelbarrow, rakes and hoes, loppers, and a post-hole digger. Look into installing an automatic sprinkler system if you don’t have time or the ability to hand-water your garden."
    },
    {
      "title": "Determine if you want to start your garden from seeds.",
      "content": "Determine if you want to start your garden from seeds. Many plants do well when you start them from seeds. Check your local garden center for seed packets and look at the label to see how long they take to grow, when is the best time to plant them, and how much water they need. Growing from seed can take anywhere from one to four months depending on what you are growing, so it is important to plan ahead. Growing from seeds is the cheapest option, as a pack of seeds costs only a few dollars or cents. Full grown plants purchased from a gardening store can cost anywhere from $1 to $50 each. Growing from seed has the advantage of allowing you to start the seed in a container and keep it indoors or put it right into the ground. However, planting a seed in a container and starting it indoors may result in a healthier plant than starting outdoors in the ground. [5] X Research source It may also provide your plant with an earlier start since you will not have to wait for the last frost."
    },
    {
      "title": "Consider transplanting mature plants.",
      "content": "Consider transplanting mature plants. The benefit of transplanting a mature plant into your soil or container is that it is already partially grown and will bear fruit sooner. The plant will also be more likely to survive and thrive. Transplanting mature plants takes only a few minutes of work once the rest of your garden has been prepped. Check your local garden store for mature plants and make sure to check the tags on the plants to determine if they will work for the type of garden you are planning."
    },
    {
      "title": "Check out flower bulbs.",
      "content": "Check out flower bulbs. If you choose to grow flowers, you also have the option of planting bulbs. Bulbs are easy to plant, and some of them (the perennials) will come back every year. Some bulbs are annuals and will need to be replanted every year. Keep in mind that bulbs only bloom for a few weeks at a time. Check your local garden store for bulbs that you can plant in your garden and enjoy year after year, such as tulips, daffodils and alliums."
    },
    {
      "title": "Arrange your plants.",
      "content": "Arrange your plants. Choose where you want each plant to go in your garden. Keep in mind the amount of sunlight they need and the overall size they will grow. Starting with small plants can be misleading, as some may get very large and eventually need bigger plots or containers. Typically it is safe to give about 10 inches (25.4 cm) of spacing between each plant, but make sure to read the seed package or tag on the plants to see how much room they will need. You will also want to leave enough space between rows so that you will be able to walk between them. Plan to leave about 18 inches (45.7 cm) between rows. [6] X Research source Try to keep your plants in groups by variety. For example, you can plant all of your vegetables in the same section of your garden, and keep your flowers or berries in another section. Find out which plants will grow the tallest, as they will create shade over time and should only be planted near other plants that will also grow tall, or near plants that require less sunlight and more shade."
    },
    {
      "title": "Plant your seeds or plants.",
      "content": "Plant your seeds or plants. Using the arrangement you have devised, place each plant in the garden. Dig a hole twice the size and the same depth as the root ball, or as indicated on your seed packet. The depth will vary anywhere from 1 ⁄ 4 inch (0.6 cm) to 2 inches (5.1 cm) for seed depth depending on what you are planting. It does not matter if you are planting in a container or in the ground. Use the depth guidelines provided on the seed packet. Don’t dig a hole that is too deep. Only dig far enough to allow room for all of the roots without covering up the stem or leaves. The soil in the ground should be level with the soil of the plant you are planting. Gently set each plant into its hole, so as to not damage any part of it. Use your fingers or a trowel to slowly scoop dirt back into the hole over the roots. If the plant you are planting is root bound, meaning the roots are wrapping around the container, gently massage and loosen them before planting. This will help the plant roots spread out into the surrounding soil instead of continuing to wrap around the root ball, choking itself out."
    },
    {
      "title": "Add mulch.",
      "content": "Add mulch. Getting as many nutrients into the soil as you are able will help your plants to grow full and healthy. Mulch will help with this and it will also help to prevent weeds from growing. [7] X Research source Spread mulch between each of the plants in a layer about one inch thick. For vegetables, add straw or decomposed leaves as mulch around your plants for the best results. Flowers do well with wood chips or bark as mulch. [8] X Research source"
    },
    {
      "title": "Water your plants.",
      "content": "Water your plants. The first few weeks after planting should have a bit more water to help the roots to get settled. Avoid over watering, though, by flooding the top layer of your garden. You only need to provide about one inch of water per week, so you may not need to water your garden at all if it rains. [9] X Research source Use a watering can or a spray attachment to your hose to water the plants. Water them from high up, so that you don’t damage any of their leaves or stalks. After a few days of watering 1-2 times daily, you can water less often. Move to watering once every two days or so."
    },
    {
      "title": "Keep an eye on your garden and weed it regularly.",
      "content": "Keep an eye on your garden and weed it regularly. Once your garden is settled, give it time to grow. A healthy garden will last several seasons if it is properly taken care of. Make sure to check your garden for weeds on a regular basis and pull out any weeds you spot."
    },
    {
      "title": "Consider putting up a fence.",
      "content": "Consider putting up a fence. If you are growing a vegetable garden, then you may want to put up a fence around it to protect it from wildlife. This is not absolutely necessary, but it can help if you find that you have frequent invaders. Keep in mind that deer can jump very high. Your fence will need to be at least 8 feet (2.4 m) high to prevent them from jumping into your garden. [10] X Research source"
    },
    {
      "title": "Harvest your garden.",
      "content": "Harvest your garden. When your garden has grown to maturity, harvest the fruits of your labor. Carefully pick or cut vegetables, berries, herbs, and flowers for use in your own home. Or, simply enjoy walking and relaxing in your garden if you have created it to beautify your property."
    }
  ]
}