{
  "url": "https://www.wikihow.com/Determine-if-Your-Child-Is-Being-Molested",
  "title": "How to Identify Sexual Abuse in Children and Talk to Them About It",
  "steps": [
    {
      "title": "Behavioral changes",
      "content": "Behavioral changes When a child experiences any type of sexual abuse, it can cause them to go through a variety of behavioral shifts in the following days and weeks. Some common warning signs to be on the lookout for include: Observable changes in behavior: A child’s behavior, attitudes, perceptions, and/or temperament may change, and they may become more secretive and withdrawn. Sudden immaturity: A child may revert to habits like sucking their thumb or wetting themselves during the night. They may also return to childish behaviors like using baby talk, having a sudden fear of the dark, or sudden separation anxiety. Nightmares and sleeping problems: A child might have trouble sleeping, or they might experience nightmares/night terrors when they do sleep. Inappropriate play behaviors: A child might demonstrate sexualized behavior, like trying to touch a doll or toy inappropriately. Fearful reactions around certain people: A child may exhibit fear or signs of discomfort when they are around certain people. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Physical changes",
      "content": "Physical changes The physical effects of sexual abuse aren’t necessarily as obvious or common, but they can still be an effective way of determining if your child is experiencing abuse: Discomfort around the genital area: A child may express that their private parts are feeling sore or uncomfortable (as a result of the molestation). Difficulty sitting or walking: A child might not move around or sit easily after being sexually abused. STIs or UTIs: A child may display symptoms of a UTI or an STI after experiencing abuse. Pregnancy: Depending on the age of the child, they may become pregnant after experiencing sexual abuse. [2] X Research source"
    },
    {
      "title": "Emotional changes",
      "content": "Emotional changes A child who is sexually abused may show a wide range of emotional changes in the aftermath of the trauma, including: Mental health struggles: An abused child may show symptoms of depression and/or anxiety. Teens in particular may act aggressive or moody without an apparent cause. Suspicious questions: Young children in particular might ask questions related to a recent abusive encounter, like “Do people always have to keep secrets for others?” [3] X Research source Headaches and stomach aches: A child might complain about mild health concerns, though there aren’t good explanations for the symptoms. [4] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Personality changes: A child who is normally happy and talkative may become shy and withdrawn, or act in a way that is out of character (e.g., tantrums, mood swings, etc.). [5] X Research source"
    },
    {
      "title": "Know that sexual abuse can include physical and non-physical acts.",
      "content": "Know that sexual abuse can include physical and non-physical acts. Child sexual abuse can involve physically intimate acts, but it can also involve non-physical acts. This includes an adult exposing themselves to a child, forcing a child to look at explicit images, taking inappropriate images of a child, or sneaking a look at a child while they’re undressed or in the shower. [6] X Research source"
    },
    {
      "title": "Provide a safe environment for sensitive conversations.",
      "content": "Provide a safe environment for sensitive conversations. The subject of abuse is tough for children and adults to discuss, so it's important to do so in an environment that feels safe. Wait for a time when you and your child don't have anywhere you need to be and pick a place that feels comfortable, like the family kitchen or den. Let your child know that you want to ask them some questions and that no matter what the answer is, they won't be in trouble. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Do not bring up the subject of abuse in front of anyone you don't trust completely, and don't bring it up in front of anyone you might suspect of abuse, including members of the child's immediate family. It's important to be entirely nonjudgmental and reassuring throughout the discussion. Do not be dismissive, lighten things up, or express anger—even if it's anger at the situation and not your child. Talking to your children about sexual abuse can be uncomfortable, but it’s important to have these conversations because having an understanding of what it is will help keep them safe."
    },
    {
      "title": "Ask if anyone has been touching them inappropriately.",
      "content": "Ask if anyone has been touching them inappropriately. When your child is feeling comfortable, bring up the subject in a gentle but direct way. Ask whether anyone has touched your child in a way that's not appropriate. Use the words you and your child usually use to describe parts of the body that aren't supposed to be touched by other people. [8] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source If your child says yes, encourage them to tell you more. Keep asking questions in a nonjudgmental way. Keep in mind that sexual molestation doesn't always leave a negative impression on the child. Using questions like \"Did someone hurt you?\" or \"Did someone touch you in a bad way?\" might not resonate with the child. Don’t be afraid to be a little more specific. [9] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Mention any uncharacteristic behaviors you've noticed.",
      "content": "Mention any uncharacteristic behaviors you've noticed. For example, you could say that you've noticed your child seems afraid when you go to after-school care, or when a certain person comes to visit. If your child has been acting secretive, shy, or aggressive, ask why. Name specific behaviors and ask your child to tell you what’s provoking them. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Discuss the concept of secrets with your child.",
      "content": "Discuss the concept of secrets with your child. Sometimes an abuser will make the child promise to keep what happened a secret, perhaps even threatening the child to keep quiet. If your child tells you they have been told to keep a secret, let them know that it is almost never appropriate to ask a child to keep a secret from their parents. [11] X Research source Reassure them that they won’t get in trouble if they talk to you about something that made them uncomfortable or something they found unusual."
    },
    {
      "title": "Remind your child that they can always come to you.",
      "content": "Remind your child that they can always come to you. Above all, it's important to help your child feel safe and unjudged when they talk to you. Tell your child that no matter what, you want to help and keep them safe from harm. If you have a trusting relationship with your child, they will be more likely to come to you if abuse does occur. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Let your child know that you’re going to help them.",
      "content": "Let your child know that you’re going to help them. Reassure the child that you’re there to support them, and explain that you will be speaking with someone who can stop the assailant from interacting with the child ever again. Keep in mind that your child may be anxious about this, especially if they were sworn to secrecy by their abuser—just continue to remind them that you are doing this to keep them safe. [13] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Call a hotline to report the abuse.",
      "content": "Call a hotline to report the abuse. If you live in the United States, child abuse reporting is state-regulated and reported via state-specific hotlines. Visit the Child Welfare Information Gateway's reporting webpage to find a list of hotlines to call, depending on the state you live. If you’re uncertain about the best number to dial, call 1-800-4ACHILD for extra guidance. [14] X Research source"
    },
    {
      "title": "Get in touch with a local sexual assault service provider.",
      "content": "Get in touch with a local sexual assault service provider. It can be difficult to know if and when to take action, especially when it comes to something as serious as child sexual abuse. If you’re feeling concerned and conflicted (or just want a little extra confirmation), reach out to a local sexual assault service provider for extra assistance. If you live in the United States, visit the Rape, Abuse & Incest National Network's help search page to find a provider near you."
    },
    {
      "title": "Help your child avoid risky situations or suspected abusers.",
      "content": "Help your child avoid risky situations or suspected abusers. Let’s say that there’s a suspicious adult that lurks around your child’s after-school program—aside from reporting that individual to your school, you might take extra precautions by removing your child from that program completely. If there’s a way to change your child’s schedule so they don’t have to interact with any suspicious individuals, definitely do so. [15] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Teach your child that certain body parts are private.",
      "content": "Teach your child that certain body parts are private. From a very early age, teach your child that certain body parts should never be touched by someone other than the child. Many parents define these body parts as everything that would be covered by a bathing suit. Teach your child that if someone attempts to touch them in a private area, they should say \"no\" and tell you as soon as possible. [16] X Research source Some parents use the \"good touch, bad touch, secret touch\" method to teach their children about touching. A good touch is one that is welcome, like a high five. A bad touch is one that hurts, like a kick or punch. A secret touch is one that a child is told to keep a secret. Tell your child to let you know right away if a bad or secret touch happens. Teach your child that there are parts of their body that are private, but their entire body should be respected at all times. Tell them that it is okay to say \"no\" to things they are uncomfortable with and to immediately get away from anyone who won’t respect their boundaries. Certain children’s books can be a really helpful way to teach about “good touch/bad touch” concepts in a sensitive and digestible way that kids will understand. Check out titles like My Body! What I Say Goes! by Jayneen Sanders and Anna Hancock, My Body Belongs to Me from My Head to My Toes and My Underpants Rule! by Kate and Rod Power, and Some Secrets Should Never Be Kept by Jayneen Sanders and Craig Smith."
    },
    {
      "title": "Build a trusting relationship with your child.",
      "content": "Build a trusting relationship with your child. Kids are a lot more likely to confide in their parents if they aren't afraid they'll get in trouble. They must also feel that their parents will believe what they say. Start fostering a trusting and positive relationship with your child so that they know that no matter what, you're there to help. [17] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source If your child brings up a problem - even a problem unrelated to potential abuse - never be dismissive. Always take your child seriously and help your child find a way to solve the problem."
    },
    {
      "title": "Get in the habit of talking with your child every day.",
      "content": "Get in the habit of talking with your child every day. One important way to create open lines of communication with your child is to have regular conversations. Maybe your schedule is packed and you're always on the go, but make time every day to ask your child about their life. Stay on top of your child's activities, who they spend time with, and how they are feeling every single day. That way, if something out of the ordinary occurs, you'll know right away. [18] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source Make sure your child is feeling emotionally supported, too. Children who don't feel they are getting enough attention at home are more vulnerable to predators."
    },
    {
      "title": "Get involved at your child's school and be present at their activities.",
      "content": "Get involved at your child's school and be present at their activities. Sexual predators tend to target kids who don't seem like they have much adult supervision. Be there for your child's games, practices, rehearsals, and field trips. If you plan to leave your child in the care of someone else, make sure you know and trust them, from extended family members and teachers to coaches and family friends. [19] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Act on what your child tells you.",
      "content": "Act on what your child tells you. If your child tells you they are being molested, do not dismiss it, even if the news is completely shocking. Remember that most perpetrators of sexual abuse are people the child knows and trusts. [20] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Just 10% are strangers to the child. If you have reason to believe someone is abusing your child, take these steps: Keep your child away from the abuser. Call emergency services and report the abuser to the local authorities. Call the National Child Abuse Hotline at 1-800-4ACHILD for more information about reporting the abuse. Get medical attention for your child. It's important to take your child to the doctor to find out if they were physically harmed. Take your child to counseling. The psychological trauma of abuse often outlasts the physical trauma. Therapy can help your child find ways to cope. [21] X Research source"
    },
    {
      "title": "Normal sexual behavior for young kids includes basic sexual exploration.",
      "content": "Normal sexual behavior for young kids includes basic sexual exploration. Children between the ages of 2 and 6 may start to occasionally explore their genitals and may even start masturbating (possibly in public). These behaviors in and of themselves aren’t necessarily causes for concern. Here’s a breakdown of what normal sexual behavior looks like for young children versus abnormal behavior: [22] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Normal behavior (for kids ages 2-6): A child touches their private parts (can occur either publicly or privately) A child desires to look at and/or touch their younger sibling’s private parts A child chooses to sit a little bit too close to someone else A child desires to show their private parts to other kids their age Abnormal behavior (for kids ages 2-6): A child is involved in sexual behavior with someone more than 4 years older or younger than them A child frequently displays sexual behavior (e.g., once per day) A child participates in sexual behavior that hurts them physically or emotionally A child acts physically aggressive in addition to their sexual behavior"
    }
  ]
}