{
  "url": "https://www.wikihow.com/Cut-Hydrangea-Blooms",
  "title": "When & How to Cut Hydrangeas from a Bush",
  "steps": [
    {
      "title": "Cut the hydrangeas in the morning when it’s cooler.",
      "content": "Cut the hydrangeas in the morning when it’s cooler. Your flowers will look fresher than if they’ve been under the hot sun all day. Since the flowers are fresher, they will last longer in your arrangement. [1] X Research source It’s best to wear gloves while you cut the flowers."
    },
    {
      "title": "Choose only the most mature blooms.",
      "content": "Choose only the most mature blooms. The larger, riper blooms will look great in your arrangement and will hold up better in the vase. This will keep your arrangement from wilting early. [2] X Research source"
    },
    {
      "title": "Make your cut where two stems meet.",
      "content": "Make your cut where two stems meet. Follow the stems down to where they meet, then place your shears just above the joint between the two stems. Cut the stems at an angle so that they can absorb water better. [3] X Research source"
    },
    {
      "title": "Cut a cross-cut into the bottom of the stem so that it can take up water.",
      "content": "Cut a cross-cut into the bottom of the stem so that it can take up water. Hydrangeas have a hard, woody stem that does not easily absorb water. Making a cross-cut into the bottom of the stem will fix this issue and allow the stem to absorb water. [4] X Expert Source Jeanne Walker Florist Expert Interview. 15 April 2020. Use a pair of sharp scissors to cut the underside of the stem one way, then turn the stem and make a second cut to create the cross. [5] X Research source"
    },
    {
      "title": "Place the cut flowers in cool water immediately.",
      "content": "Place the cut flowers in cool water immediately. Stick the flowers in a temporary vase or jar while you continue cutting. This will help you preserve the cut flowers for longer, keeping your bouquet fresh. [6] X Expert Source Jeanne Walker Florist Expert Interview. 15 April 2020. Fill this vase or jar ahead of time and keep it near you. You can use tap water or filtered water."
    },
    {
      "title": "Cut away the leaves that are under the water in your vase.",
      "content": "Cut away the leaves that are under the water in your vase. If leaves are in the water, it will increase the bacteria growth and reduce the life of your arrangement. Once you’ve gotten all of your cuttings inside your home and are ready to create the arrangement, use your sharp scissors to remove the lower leaves on the stems. [7] X Research source"
    },
    {
      "title": "Prune old wood hydrangeas in the early- to mid-summer.",
      "content": "Prune old wood hydrangeas in the early- to mid-summer. Old wood hydrangeas reach peak blooming in the summer. Pruning too early in the growing season will encourage your hydrangea to keep blooming. This means you would have to prune several times in the same season. [8] X Research source Be sure to prune before late summer. The buds that will bloom next year form in late summer or early fall, so pruning late will result in no blooms the following year. If you miss the window, wait until next year. Otherwise, you risk removing the buds that will bloom next year."
    },
    {
      "title": "Wait until fall to prune new wood hydrangeas.",
      "content": "Wait until fall to prune new wood hydrangeas. New wood hydrangeas bloom later than old wood hydrangeas because the younger stems take longer to reach blossoming. Their new buds will form in the winter, so don't prune later than the fall."
    },
    {
      "title": "Avoid trimming more than one-third of the plant at one time.",
      "content": "Avoid trimming more than one-third of the plant at one time. This will revitalize your plant, though you can trim less depending on your preferences. If you prune too much, it can change the shape of your hydrangeas. Hydrangeas will often grow back to their regular size, and over-trimming can result in uncontrolled growth. [9] X Research source"
    },
    {
      "title": "Prune faded or wilting flowers using pruning shears.",
      "content": "Prune faded or wilting flowers using pruning shears. Dull flowers can make your plant look blah, but pruning them away will allow for new growth. When you cut away old blooms, you encourage your plant to produce more blooms. Faded or wilting flowers can be pruned at any time."
    },
    {
      "title": "Remove the brown, dead spots with pruning shears.",
      "content": "Remove the brown, dead spots with pruning shears. Your plant will look better, and new growth will eventually emerge, either in this season or the next blooming season. [10] X Research source You can prune back brown, dead spots during blooming season if you see them. This will keep your plant blooming."
    },
    {
      "title": "Trim weak branches and crossed branches using pruning shears.",
      "content": "Trim weak branches and crossed branches using pruning shears. This will improve the look of your plant and ensure hardier growth during the next blooming season. Cut the branches where they meet another branch. [11] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Boil a pot of water.",
      "content": "Boil a pot of water. Hydrangeas produce a sap that makes it hard for them to absorb water. This means that cut flowers, if left untreated, will quickly wilt. You can solve this issue by boiling away the sap. [12] X Trustworthy Source University of Kentucky College of Agriculture, Food, and Environment Program in the University of Kentucky devoted to scientific research and public education Go to source You only need enough water to cover the ends of the flowers."
    },
    {
      "title": "Dip the ends of the stems in the hot water for 30 seconds.",
      "content": "Dip the ends of the stems in the hot water for 30 seconds. You can leave the boiling water in the pot while you dip the stems. Use a timer to make sure that you don’t leave them in the water too long, which could damage the ends. [13] X Research source Put just the bottom .5 in (1.27 cm) of the ends into the water. If you think you damaged the ends, you can cut above the damaged part and try again."
    },
    {
      "title": "Plunge them into the cool water in the vase.",
      "content": "Plunge them into the cool water in the vase. The stems should immediately go into the cool water to stop the heat from continuing to affect the ends of the stems. Once they’re in the vase, you can arrange the cut flowers until you like the look. [14] X Research source"
    },
    {
      "title": "Try alum to keep your flowers from wilting.",
      "content": "Try alum to keep your flowers from wilting. As an alternative, you can dip the freshly cut ends of the stems of your flowers into the spice alum, which helps prevent the sap from clogging the stem. Cut off the tips of the stems, then dip the ends into the spice. You can then arrange the flowers as you normally would. [15] X Research source"
    },
    {
      "title": "Replace your water every other day.",
      "content": "Replace your water every other day. Fresh water will keep your flowers looking nice longer. If you leave the old water, bacteria will be able to grow, causing your flowers to wilt sooner. [16] X Research source"
    }
  ]
}