{
  "url": "https://www.wikihow.com/End-Casual-Dating",
  "title": "How to Break Up with Someone You’re Not Officially Dating",
  "steps": [
    {
      "title": "End the relationship when you’re no longer interested in the other person.",
      "content": "End the relationship when you’re no longer interested in the other person. Don’t try to extend the relationship, or wait for the “magic” to come back. It’s perfectly okay if you don’t feel the same way you did before, but it’s best to let your hook-up know as soon as you can. Don’t keep the other person on “standby” until a new person comes along. Instead, break things off as soon as you can. This way, you can start looking for someone who really satisfies your needs—and so can they. Reader Poll: We asked 1932 wikiHow readers why they want to break up with their partner, and only 9% of them said their partner cheated on them. [Take Poll] Remember, you shouldn’t wait for your partner to do something horrible to break up with them. You’re allowed to end the relationship if you no longer want to be in it, no matter your reason."
    },
    {
      "title": "Yes, it's best to talk to them in person.",
      "content": "Yes, it's best to talk to them in person. Even if you haven’t been hooking up for that long, it’s still worth meeting face-to-face whenever you decide to break things off. Shoot them a text or give them a call and see if they’re free to meet up. [1] X Research source If you’re unable to make an in-person meeting work, try talking on the phone or chatting over video."
    },
    {
      "title": "Schedule the meet-up at a convenient time.",
      "content": "Schedule the meet-up at a convenient time. Try not to meet up first thing in the morning, or right when the other person gets off work. Instead, pick a time when you both can focus on the conversation without any distractions. You might meet up on the weekend, or sometime in the early evening."
    },
    {
      "title": "Be honest but considerate about how you’re feeling.",
      "content": "Be honest but considerate about how you’re feeling. Let them know that you aren’t really into the relationship and that you need to break things off. Try to politely explain how you’re feeling, and let them know why things haven’t been working. [2] X Research source You might say something like, “I’ve really enjoyed our time together, but I can’t really see this relationship going anywhere. I think it’s best if we stop seeing each other.”"
    },
    {
      "title": "Express yourself with “I” statements.",
      "content": "Express yourself with “I” statements. Using “I” statements puts the focus entirely on your feelings and experiences, rather than laying any blame on the other person. These statements are a great way to be honest without hurting any feelings in the process. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You could say something like, “I’ve been feeling really overwhelmed lately, and I’m not ready for a relationship” or “My schedule is really exhausting, and I don’t have the energy for late-night booty calls.”"
    },
    {
      "title": "It’s not ideal, but it’s okay to send a text.",
      "content": "It’s not ideal, but it’s okay to send a text. It’s preferable to end things in person, but texting is better than nothing. If the relationship is really casual, a basic text can break things off while still providing the other person with closure. [4] X Research source You could say, “It’s been fun getting to know you, but I don’t really feel a connection here. Best wishes!” You might also text something like, “I don’t feel like we’re a good match. It’s nothing personal, but I think it’s best if we stop meeting up.”"
    },
    {
      "title": "Let them know that they aren’t satisfying your needs.",
      "content": "Let them know that they aren’t satisfying your needs. It can be really tough when you and your hook-up have different long-term goals for the relationship. Instead, let them know that the relationship isn’t meeting your needs, and that you need to break things off. Stress that, while you don’t have any hard feelings, you don’t want to meet up with them anymore. [5] X Research source You might say something like, “I’ve had a fun time over the past few weeks, but I’m really looking for a long-term relationship. I really wish you the best, but I need to put myself first.”"
    },
    {
      "title": "Yes, deleting them on social media is perfectly fine.",
      "content": "Yes, deleting them on social media is perfectly fine. It can be tough to see an ex on TikTok, Twitter, and Instagram every time you log on. There’s absolutely nothing wrong with unfriending, unfollowing, or even blocking them to give yourself a sense of space and privacy. [6] X Research source You could even mute them temporarily while you adjust to no longer being together. This way, if you eventually feel like you’d like to reconnect, you can do so easily."
    },
    {
      "title": "No, ghosting isn’t usually a good idea.",
      "content": "No, ghosting isn’t usually a good idea. Ghosting, or cutting off communication without any explanation, may seem like the easy way out, but it leaves your ex with a lot more questions than answers. Instead, at least shoot them a text to let them know that you don’t want to go out anymore. This way, the other person won’t wonder what went wrong. [7] X Research source Try to put yourself in their shoes . Would you be okay with someone ghosting you, or would you rather get some kind of explanation?"
    },
    {
      "title": "Ghosting is only okay if the relationship is abusive or manipulative.",
      "content": "Ghosting is only okay if the relationship is abusive or manipulative. If your ex is abusive, manipulative, or ignorant of your boundaries, it’s okay to cut things off without any explanation. Your safety and emotional wellbeing are most important! [8] X Research source"
    },
    {
      "title": "Hopefully, they’ll be gracious—but prepare for some hurt.",
      "content": "Hopefully, they’ll be gracious—but prepare for some hurt. Breakups are unpleasant all around. Even if you do everything perfectly and it’s ultimately what’s best for you both, the other person could still wind up with some hurt feelings, especially if they were more invested in the relationship than you. Don’t expect them to retaliate (and you certainly don’t deserve it if they do), but prepare for the possibility that they’ll respond with anger or that they’ll blame you for the breakup. [9] X Research source Even if you want to stay friends after, realize they may not want to—and their friends may not want to, either. They may come around in time, or they might not."
    },
    {
      "title": "No, hooking up after you break up isn’t a good idea.",
      "content": "No, hooking up after you break up isn’t a good idea. Hooking up can lead to a lot of mixed messages, and will only complicate things in the future. Instead, try to break things off as cleanly as possible, so you can both move on."
    }
  ]
}