{
  "url": "https://www.wikihow.com/Get-Along-with-Your-Sibling",
  "title": "How to Get Along with Your Sibling",
  "steps": [
    {
      "title": "Think before you speak.",
      "content": "Think before you speak. [1] X Expert Source Supatra Tovar, PsyD, RD Licensed Clinical Psychologist (PSY #31949), Registered Dietitian, & Fitness Expert Expert Interview. 6 October 2021. Though it isn’t always easy, thinking before you speak is important in improving the communication between you and your siblings. It not only prevents things from escalating into an argument, but can keep you from saying words you’ll later regret. When you feel yourself getting angry take a moment and count to 10. If you still haven’t calmed down, excuse yourself and leave the room. Always remember that your words are a reflection of who you are. Chances are, you're not showing others your best side if words are getting you into trouble. The things you say to your siblings can last well beyond an argument. Harsh words can, unfortunately, shape how your brother or sister views you moving forward. If you’re already in a bad mood avoid talking to your siblings until you’re in a better mindset. Lashing out at others is often the result of anger and frustration felt in another part of life. [2] X Research source"
    },
    {
      "title": "Use “I” phrases.",
      "content": "Use “I” phrases. Instead of always placing the blame on your brother or sister, try using “I” phrases. “I feel hurt when you do that.” “I don’t appreciate when you take my things without asking.” “I” statements encourage assertiveness without making the recipient feel defensive. [3] X Research source Don’t overuse the “I” phrases. If you rapidly fire off “I feel this” or “I feel that” and don’t give the other person a chance to respond, your tone may be viewed as aggressive. An example for the correct way to use an \"I phrase,\" is: \"I feel frustrated when you take my clothes without asking. In the future, I'd appreciate if you could ask me before you take anything.\" It takes time to feel comfortable with and incorporate “I” phrases into your language. Don’t feel bad if you slip and forget to use them. Keep practicing - you’ll get there!"
    },
    {
      "title": "Apologize.",
      "content": "Apologize. Apologizing can be a hard thing to do. Admitting wrongdoing can be difficult, as emotions and pride often get in the way. [4] X Research source Though it may be hard to do so, get into the habit of apologizing to your siblings. Whether you said something you shouldn’t have or did something that was hurtful; be the bigger person and apologize. Be sincere in your apologies. It will only make matters worse if your apology is sarcastic or forced. If you’re on the receiving end of an apology, accept it with a smile. Forgiveness is equally important!"
    },
    {
      "title": "Turn to parents/guardians for mediation.",
      "content": "Turn to parents/guardians for mediation. Hopefully you're able to improve your communication apart from your parents. However, tensions between siblings can often arise and it helps to have the support of your parents if that happens. Your parents should be the last resort. Don't use them as a means for telling on your sibling or getting them into trouble. Ask them to mediate the situation. A mediator simply oversees the conversation to make sure everyone gets a turn and keeps the tone from turning negative."
    },
    {
      "title": "Share your personal belongings.",
      "content": "Share your personal belongings. If you’re like most people the idea of sharing with your siblings doesn’t come naturally, particularly if you already share a room with them. Whether it’s clothes, music or, for younger siblings, toys, sharing seems to breed a lot of arguments and hostility. Set some ground rules about sharing personal belongings. Inform your sibling that they are welcome to borrow your items as long as they ask you first. If there are items that are off limits be sure to let your brother or sister know. Don’t get too angry with them if they forget to ask you the first time they borrow something. Nicely remind them about your rule."
    },
    {
      "title": "Let your sibling hang out with your friends.",
      "content": "Let your sibling hang out with your friends. This is particularly relevant for older siblings, as it’s often younger siblings who want to hang out with the “big kids.” While it can be annoying to have your younger brother or sister around constantly, it’s also nice to include them from time to time. Set boundaries. Let them know when it’s acceptable to spend time with you and your friends. Be sure you’re only including them in age-appropriate activities. For example, if you’re watching a violent movie and have a much younger sibling, it would not be appropriate to include them. Older siblings, this is applicable to you as well. Just because you’re older, doesn’t mean your younger siblings don’t want to be included anymore! If you’re going on a girls trip, invite your younger sister to join."
    },
    {
      "title": "Give them advice when they need it.",
      "content": "Give them advice when they need it. [5] X Expert Source Supatra Tovar, PsyD, RD Licensed Clinical Psychologist (PSY #31949), Registered Dietitian, & Fitness Expert Expert Interview. 6 October 2021. Though it may not seem as obvious as letting your brother borrow your car, sharing your wisdom and expertise is still sharing! In fact, giving your sibling advice, can often be the very best form of sharing. Regardless of your age, siblings are always in need of advice. Brothers and sisters can be our best collaborators, co-conspirators and role models, but can serve as a cautionary tale as well. [6] X Research source The fact that they are older or younger doesn’t matter much either, as everyone has some piece of knowledge worth sharing! Don’t offer advice where it’s not wanted. Let your sibling know that if they ever need your advice, you’d be happy to share it with them. Otherwise, you shouldn’t butt in!"
    },
    {
      "title": "Be generous if living together.",
      "content": "Be generous if living together. Sharing a space with your brother or sister can be difficult. Do your best to be generous when it comes to your living arrangements. It's particularly important to be generous if your sibling is living with you for the first time. Maybe they've just moved into your room or apartment. Make them feel comfortable with a what's mine is yours mentality. If they want a particular side of the closet, let them have it. Learning to share your space and not get into petty fights is a great start to getting along with your sibling."
    },
    {
      "title": "Do their favorite activities.",
      "content": "Do their favorite activities. Even if you don’t like to run or play video games, try to do something your brother or sister enjoys. They’ll appreciate that you showed an interest and, even more importantly, will enjoy spending time with you. Take the opportunity to ask them more about the activity they enjoy. This will allow them to open up and can get the conversation going."
    },
    {
      "title": "Have a game night.",
      "content": "Have a game night. Regardless of how old (or young) you are, games are a great way to bond with your sibling. Try to learn a new game together or pick one from your childhood that brings back memories. Don’t choose a game that has a history of causing arguments. If, for example, you can’t get through a game of Scrabble without name calling and arguments, be sure to pick another game. Playing a basketball game outside or a good, old-fashioned game of miniature golf counts too!"
    },
    {
      "title": "Look at family photo albums together.",
      "content": "Look at family photo albums together. Relive happy moments together by looking at family photo albums. You’ll enjoy looking back at some of life’s best moments and will hopefully remember all of the good times with your sibling."
    },
    {
      "title": "Establish a sibling tradition.",
      "content": "Establish a sibling tradition. Whether it's a weekend trip or a movie marathon, establish a tradition with your brother or sister. You can do it on a monthly or yearly basis. For something like a trip, it may make sense to do it yearly. Movie marathon's though, can be done on a monthly basis. Try alternating who picks the movies and snacks as part of the tradition!"
    }
  ]
}