{
  "url": "https://www.wikihow.com/Distinguish-Nudism-from-Pornography",
  "title": "How to Distinguish Nudism from Pornography",
  "steps": [
    {
      "title": "Recognize and report child pornography.",
      "content": "Recognize and report child pornography. Any images that show a child under the legal age in your country fully unclothed or partially clothed, in a sexual manner or for a sexual purpose, or acting out sexually for any purpose, are called child pornography and are illegal. If you find illegal images of children, whether on the internet or not, you need to contact the police. Child pornography is illegal because it is a crime that harms all children. It also distorts people's views on what is acceptable and what isn't. It is a widespread misconception that ALL images of a minor child naked constitute child pornography. For instance, it is legal for parents to take innocent pictures of their children in the bathtub, or innocently playing around the house or back yard naked; nudist magazines often feature pictures of nudist families with children; and children can even pose nude for bona-fide artistic purposes (e.g. \"Bodies and Souls, The Century Project\" a photography book by Frank Cordelle), provided that there is no lewd or predatory intent, and parental consent and supervision is given. It's also clearly not a crime to paint pictures of little cupids or cherubs naked. However, it is true that all images of a child engaged in sexual activity are child pornography and are illegal without exception."
    },
    {
      "title": "Understand about other types of pornography.",
      "content": "Understand about other types of pornography. The most common type of pornography is images or videos of two or more people engaging in sexual contact. These images and videos are only for people who are over the legal age to watch. People typically view pornography for reasons including sexual arousal."
    },
    {
      "title": "Look at aspects of the picture such as posture, lighting or setting.",
      "content": "Look at aspects of the picture such as posture, lighting or setting. In pornographic pictures, the photographer often uses subtle moves to the viewer such as adjusting the lighting or the scenery in a sexually provocative way. For example, a harsh garish glow will be used, or the subject will be posed on a bed or in a bedroom. Often, the subject will also take a provocative pose, the camera will be focussed on a sensitive body part, or the subject will have a lascivious, luring facial expression, or be wearing lipstick, even if they're not explicitly taking part in sexual activity. Nudist photos will invariably lack all of these aspects, and instead portray people simply interacting and living their lives in a natural way. One fairly reliable test to determine whether a picture is pornography or nudism is to ask yourself, \"Would I want my young child to see that?\" If the answer is, \"Sure, why not,\" then the picture likely falls under the nudism category. If the answer is, \"Certainly not!\" then the picture is almost certainly pornography."
    },
    {
      "title": "Understand what \"sexting\" is.",
      "content": "Understand what \"sexting\" is. Sexting is the sharing of sexually explicit photos, typically done using mobile phones, but it can be done using any type of device that allows you to take and send pictures to another device. There are many reasons why people might send photos like this to each other. They might join in, because they think 'everyone else is doing it', or it might be a way of exploring their sexual identity. It might also be a way that they meet new people online. Sexting is illegal if: A young person takes an explicit photo or video (of themselves or a friend), or; Anyone possessing explicit images of a child, or sharing an explicit image of a child. Sexting isn't a good idea because you can't be sure that the person won't show anyone else your image, even if you think you trust them."
    },
    {
      "title": "Find out more about nudism.",
      "content": "Find out more about nudism. Nudism is when a person chooses to be unclothed for reasons that don't typically include sexual arousal/contact. Nudism is the act of being naked, whereas naturism is lifestyle embraced for reasons such as nature, environment, comfort, and lots of other things. Most nudists (or naturists) don't choose to be unclothed for sexual reasons, and this is the prime difference between nudity and pornography."
    },
    {
      "title": "Know that nudism isn't a reason to send explicit images to others without their consent.",
      "content": "Know that nudism isn't a reason to send explicit images to others without their consent. Even if you don't think the image/video is explicit, you should always check with the person on the receiving end of the media before sending anything that could possibly be classed as inappropriate. Nudism is not an excuse to cross others boundaries. To avoid any misunderstanding, you could first explain to the person that you're a nudist, and explain that nudism is not a sexual lifestyle. Introducing yourself as a nudist should not involve sending a picture."
    },
    {
      "title": "Talk to people about nudism.",
      "content": "Talk to people about nudism. Keep the lines of communication open, even if there isn't a problem, because if one occurs then it's easier to talk about it. Keep the general rules of pornography in mind (i.e. don't send anything illegal; if you receive something of that nature or find it on the internet, always tell someone you trust for safety reasons)."
    }
  ]
}