{
  "url": "https://www.wikihow.com/Find-Out-if-Someone-Is-on-Probation",
  "title": "3 Quick Ways to Check Someone’s Probation Status",
  "steps": [
    {
      "title": "Visit the court's website.",
      "content": "Visit the court's website. Many counties make criminal conviction and inmate databases available online. Visit the county court website for the county where the person lives. You should also consult the website of any county where the person used to live, in case he or she was prosecuted and is reporting to a probation office located in that county. For example, in Orange County, CA, you can search for criminal cases by party name once you create a free account. If you are able to locate a record of a criminal case, look to see if the disposition of the case is listed. The disposition is where you will find the sentence, or an indication that the case was dismissed."
    },
    {
      "title": "Check the sheriff's office website.",
      "content": "Check the sheriff's office website. If the county court does not have publicly available conviction and inmate records, the site for your local sheriff's department may have that information. Visit the sheriff's department website and look for a searchable database."
    },
    {
      "title": "Try a private online service.",
      "content": "Try a private online service. Some privately run websites offer to perform criminal background searches for a small fee. Be aware that since these websites are not operated by the government, there is no guarantee that the information generated will be complete or accurate."
    },
    {
      "title": "Choosing the right office to call.",
      "content": "Choosing the right office to call. You can call a probation office and ask if a person is on probation under their supervision. You will most likely want to telephone the office in the county where the person lives. Also, since some probationers (people on probation) are allowed to check in with their probation office remotely by phone or mail, they may no longer live in the same county where their probation office is located. Locate the probation office in any county where the person used to live, if you have that information."
    },
    {
      "title": "Find the probation office's phone number.",
      "content": "Find the probation office's phone number. You should be able to find an official website of a county's probation office, which will contain contact information. You can also search the database of probation offices at https://www.appa-net.org/eweb/DynamicPage.aspx?Webcode=VB_Directory ."
    },
    {
      "title": "Ask about the person's parole status.",
      "content": "Ask about the person's parole status. When you call, ask if the office can verify whether a person is on parole under their supervision. Be prepared to give the person's name and any other identifying information you can provide. If you have further questions, ask to speak to the person's parole officer."
    },
    {
      "title": "Hire a private investigator.",
      "content": "Hire a private investigator. Private investigators are often hired to perform criminal background checks. Rates vary, but investigators in the Unites States charge an average of $50 per hour. You can find private investigators by searching online or consulting the phone book. Unless they operate in Idaho, Colorado, Mississippi, South Dakota, or Wyoming, private investigators are required to have a license from the state. Before you hire a private investigator, ask for his or her license number."
    },
    {
      "title": "Check the National Sex Offender Public Website.",
      "content": "Check the National Sex Offender Public Website. If a person has been convicted of a sexual offense, his or her name will appear in the National Sex Offender Public Website's searchable database. The database collects information from court records all over the United States and will refer you to the local agency that provides the information. You can access the database at https://www.nsopw.gov/ . Enter the name of the person for whom you want to search. If the database locates the person, you should be able to see the status of the case, including details of the conviction and his or her status as incarcerated or released."
    },
    {
      "title": "Consult a drug offender registry.",
      "content": "Consult a drug offender registry. Some states operate online public registries of narcotics offenders. For example, the Minnesota Methamphetamine Offender Registry was established to help the public identify individuals who have been convicted of manufacturing or attempting to manufacture methamphetamine. Search online to see if your state operates a drug offender registry. If so, you should be able to find out whether the person you are researching has a drug conviction, and if so, whether he or she was released on probation."
    }
  ]
}