{
  "url": "https://www.wikihow.com/Get-Olive-Oil-Out-of-Your-Hair",
  "title": "How to Get Olive Oil Out of Your Hair",
  "steps": [
    {
      "title": "Use regular shampoo.",
      "content": "Use regular shampoo. Wash hair thoroughly with your normal shampoo and conditioner. Apply the shampoo to your scalp and rub it in gently. Rinse it out with warm water. Then apply the conditioner in the same fashion and rinse it out. [1] X Research source Reapply the shampoo and conditioner if necessary. Repeat these steps until your hair feels less oily from the olive oil. If you're using regular shampoo, it can take up to 3 rinses to get rid of olive oil"
    },
    {
      "title": "Cleanse hair with a clarifying shampoo.",
      "content": "Cleanse hair with a clarifying shampoo. Clarifying shampoos are shampoos designed to remove any buildup in your hair. This can include residue from wax, gel, hairspray, chlorine, or an olive oil hair mask. Pour some clarifying shampoo into the palms of your hands and apply it to your hair. Gently massage it into your hair, focusing on the scalp. Then rinse it out with warm water. [2] X Research source If you're using a clarifying shampoo, it should only take one rinse to get the oil out of your hair."
    },
    {
      "title": "Make a baking soda paste.",
      "content": "Make a baking soda paste. Combine baking soda and water to remove any remaining olive oil. Mix the ingredients in your palm until you make a paste. You should simply add a bit of water to the baking soda until it turns into a paste. Coat your hair in the paste. Start at the roots and work all the way to the tips of your hair. [3] X Research source Try covering your hair with a shower cap, towel, plastic bag, or other similar device. Let it sit for approximately fifteen minutes. [4] X Research source Then rinse it out thoroughly in the shower. Repeat these steps as necessary to remove any remaining olive oil residue."
    },
    {
      "title": "Try dry shampoo.",
      "content": "Try dry shampoo. Dry shampoo can do wonders at soaking up any excess olive oil you may have put in your hair. Simply apply the dry shampoo to your dry hair as directed on the package. Most dry shampoos come in spray packages, so spray the product onto your hair and use your brush to comb the product through your hair.. [5] X Research source Make sure you don’t apply dry shampoo to wet hair. You can also rub a towel on your hair after you apply the dry shampoo. The added friction should help remove a bit more of the olive oil. If you don’t have any dry shampoo on hand, you can use a bit of baby powder in a pinch. Just sprinkle a small amount on the crown of your head and use your brush to comb it through your hair."
    },
    {
      "title": "Use dishwasher detergent.",
      "content": "Use dishwasher detergent. Apply a small amount of liquid dishwasher detergent to damp hair if it is still oily. Detergents are designed to strip oils and can get olive oil out of hair after other conditioners and shampoos only remove part of the grease. [6] X Research source To avoid drying out hair unnecessarily, start with a small amount of detergent and use more as needed. Use a deep moisturizing conditioner after applying dishwasher detergent. The detergent can leave hair dry and stripped of all natural oils."
    },
    {
      "title": "Slick your hair back into a ponytail.",
      "content": "Slick your hair back into a ponytail. If you can’t get all of the olive oil out of your hair, try styling your hair into a tight ponytail. This slicked back look will mask some of the greasy residue of the remaining olive oil and buy you a bit more time to try to remove it. [7] X Research source You can make a ponytail on the top of your head or one at the back of your neck. You can even make a nice looking low ponytail at the base of your neck. Additionally, you might consider buns, French braids, or other braids to conceal the greasiness of your hair. These styles are particularly effective for longer hair."
    },
    {
      "title": "Give yourself plenty of time.",
      "content": "Give yourself plenty of time. Don't apply the olive oil mask right before an event such as a wedding or party. If you encounter problems removing all the olive oil, your hair can look limp or unwashed. This can lead to unappealing, greasy looking hair. [8] X Research source Be sure to only apply olive oil treatments to your hair at least several days before any big event so you have plenty of time to deal with any unforeseen circumstances or accidents that may occur."
    },
    {
      "title": "Avoid extended contact with your skin.",
      "content": "Avoid extended contact with your skin. Leaving your hair against your neck or forehead while applying and removing olive oil can cause breakouts on those areas. Place hair in a shower cap or towel to avoid any potential skin problems. [9] X Research source Remember that hot olive oil can burn your skin. Warm it gently and be cautious when applying it to your hair."
    },
    {
      "title": "Dilute the oil before use.",
      "content": "Dilute the oil before use. Before you initially apply the olive oil to your hair, take a bit of a precaution by diluting the olive oil with water. Dilute the olive oil in half by adding one part olive oil to two parts water. Taking this step will make the oil easier to get out of your hair once you are done with the application. This could save you a lot of trouble handling too-greasy hair later."
    },
    {
      "title": "Get it all out.",
      "content": "Get it all out. Leaving olive oil in your hair for too long can be quite problematic and damaging to the skin on your scalp. It can cause the pores on the scalp to get clogged which can lead to blemishes and irritation. Additionally, it can make any flakes of skin (dandruff) stick to your head which can compound the problem. If one of the cleansing methods doesn’t work, don’t be disheartened. Keep washing your hair or trying other methods until your hair is back to normal."
    }
  ]
}