{
  "url": "https://www.wikihow.com/Cure-Knock-Knees-Naturally",
  "title": "How to Cure Knock Knees Naturally",
  "steps": [
    {
      "title": "Allow the issue to correct itself in children under 7.",
      "content": "Allow the issue to correct itself in children under 7. Although seeing your child walk with their knees touching and their ankles apart can be worrisome, it’s no cause for medical concern. The condition corrects itself over time in nearly all cases. As toddlers learn to walk and hold their bodies upright, the knee issue will correct itself. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Knock knees are considered a common condition for children under the age of 3, as more than 20% of toddlers walk with knock knees. However, less than 1% of 7 year olds still have knock knees. [2] X Research source"
    },
    {
      "title": "Use a nighttime shoe brace for an older child, if recommended.",
      "content": "Use a nighttime shoe brace for an older child, if recommended. If your child’s knock knees persist after the child turns 7, the doctor may recommend a shoe brace. This device is only worn at nighttime and will help straighten out the child’s knees. Medical corrective devices like metal braces used to be used to help correct knock knees in children. However, now these devices are seen as largely useless and often emotionally detrimental to children forced to wear them. [3] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source In cases of severe, long-lasting knock knees, your pediatrician may recommend corrective surgery."
    },
    {
      "title": "Get your child orthopedic shoes as another option.",
      "content": "Get your child orthopedic shoes as another option. Talk to your doctor to find out if orthopedic shoes are right for your child. Typically, they’ll only recommend the shoes once your child is over age 7. If worn regularly, the shoes can help straighten your child’s legs. In some cases, your doctor may be able to provide you with orthopedic footwear that look like normal shoes. Don't worry that you've done something incorrectly to cause your child to be knock-kneed—some people are knock-kneed simply because of their genetics. [4] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 31 July 2020."
    },
    {
      "title": "Lose weight to take unnecessary pressure off of your knees.",
      "content": "Lose weight to take unnecessary pressure off of your knees. Knock knees may occur due to pressure on your legs due to extra body weight. [5] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 31 July 2020. The added bodyweight can put a great deal of strain and pressure on the person’s knees, causing the joints to flex inward. Losing weight to avoid obesity can also help lower your risk of developing arthritis, which frequently causes knock knees in aging adults. [6] X Research source There is no single weight range that’s ideal for every person. Talk to your doctor and ask about ways you can reach a healthy, reasonable, sustainable weight."
    },
    {
      "title": "Avoid high-impact physical exercise to avoid straining your knees.",
      "content": "Avoid high-impact physical exercise to avoid straining your knees. If you have begun seeing signs of knock knees, try to cut high-impact physical exercises out of your workout routine. These sports and exercises place a great deal of strain on your knees and can worsen (or accelerate) the progress of the knock knees. Taking a break from these activities will give your knees a chance to heal. High-impact exercises include: [7] X Research source Jogging or running Playing soccer or tennis Playing basketball or football"
    },
    {
      "title": "Include vitamin D and calcium to your diet to strengthen your bones.",
      "content": "Include vitamin D and calcium to your diet to strengthen your bones. Stronger bones may help you heal your knock knees faster. Your body produces vitamin D when exposed to sunlight. Make an effort to spend at least 5-10 minutes outside at least 2-3 times per week. This will decrease your risk of arthritis, which in turn will lower your chances of contracting knock knees. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You can also take an over-the-counter vitamin D supplement if you’re in an environment without much sunlight."
    },
    {
      "title": "Consume calcium to reduce your risk of arthritis and knock knees.",
      "content": "Consume calcium to reduce your risk of arthritis and knock knees. Preserving bone strength and reducing your risk of arthritis is a large part of limiting the onset of knock knees in adults. To this end, adults ages 19-50 should consume at least 1,000 mg of calcium per day. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You can purchase over-the-counter calcium pills at a local drug store, or add calcium-rich foods to your diet. You can find calcium in foods like: [10] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Milk and butter Yogurt and cheese Broccoli, spinach, and beans"
    },
    {
      "title": "Talk to your doctor immediately if you’re in pain or can’t walk.",
      "content": "Talk to your doctor immediately if you’re in pain or can’t walk. Usually, knock knees don’t cause noticeable symptoms. However, you may develop pain if your knock knees are severe or you could have trouble walking. If this happens, you need to see your doctor to get additional treatment. Ask them what you can do to relieve your symptoms. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Your doctor can help you create a treatment plan that works for you."
    },
    {
      "title": "Visit your doctor if you develop knock knees in adulthood.",
      "content": "Visit your doctor if you develop knock knees in adulthood. Normally, knock knees is a childhood condition that goes away as you grow up. Rarely, it can develop in adulthood. When this happens, it’s usually caused by an underlying condition that might require treatment. Talk to your doctor to find out if you need additional treatment. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For instance, arthritis may cause knock knees."
    },
    {
      "title": "See your doctor if your knock knees don’t improve in 2-3 months.",
      "content": "See your doctor if your knock knees don’t improve in 2-3 months. If your knock knees aren't improved through dietary and lifestyle changes, your doctor can help you determine if another condition is causing your symptoms. If the condition lasts for longer than 2-3 months, schedule an appointment with your doctor. When you make your visit, be prepared to answer questions regarding your family medical history. The doctor may also: Inspect your legs to see if their lengths differ Look at your knees to see if they align Ask you to walk around the room to see how your knees move."
    },
    {
      "title": "Take your child to a pediatrician if their knock knees are abnormal or persist.",
      "content": "Take your child to a pediatrician if their knock knees are abnormal or persist. Occasionally, knock knees is a sign of a medical condition and needs to be checked by a doctor. Schedule an appointment and take your child to the pediatrician if your child doesn't outgrow their knock knees. If your local pediatrician isn’t able to diagnose the issue causing your child’s knock knees, they may refer you to a pediatric orthopedist. Take your child to the doctor if you notice any of the following symptoms: [13] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Extreme and abnormal-looking leg curvature Unequal leg curvature between the right and left legs, such as leaning to one side Knock knees persisting after the child turns 7 If the child is abnormally short for their age and can't stand up straight"
    },
    {
      "title": "Talk to your doctor about orthotic shoe inserts to modify knock knees.",
      "content": "Talk to your doctor about orthotic shoe inserts to modify knock knees. If your doctor believes that orthotics will be useful in improving your knock knees, they may suggest that you try to physically re-align the angle of your knees with orthotics. You’ll place the orthotics into the bottoms of your shoes and alter the angle at which you walk or at which your foot touches the ground. You can purchase orthotics at a physical therapy supply store or at a medical supply store."
    },
    {
      "title": "Ask your doctor about exercises to decrease knock knees.",
      "content": "Ask your doctor about exercises to decrease knock knees. If you’re healthy enough to perform exercises, your doctor can recommend an exercise regimen that will strengthen your leg muscles and let the knock knees correct themselves. In some cases, the doctor will also recommend that you work with a physical therapist. Recommended exercises include: Wall squats Side lunges Hamstring curls"
    },
    {
      "title": "Discuss surgery if all other treatments have failed.",
      "content": "Discuss surgery if all other treatments have failed. If you have a severe, painful case of knock knees that doesn’t respond to any other means of treatment, surgery may be the only remaining option. In most instances, the doctor will perform an osteotomy by inserting a small permanent metal plate into your knee. The plate will align your knees properly to fix the leaning joints. You shouldn’t feel any pain during the operation, since you’ll have been given a local anesthetic. After surgery, you will likely experience discomfort during your recovery."
    }
  ]
}