{
  "url": "https://www.wikihow.com/Find-Out-Your-Blood-Type-at-Home",
  "title": "How to Find Out Your Blood Type at Home",
  "steps": [
    {
      "title": "Find a test kit online for the cheapest option.",
      "content": "Find a test kit online for the cheapest option. Most blood type test kits range between $100 to $200 per kit. Look online to see which kits are the most affordable and if they are coming from a reputable source. Try to buy test kits from a medical office so you know they are legitimate. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Take a look at who is sending out the test kit. If it is a hospital or a lab, it is most likely reputable."
    },
    {
      "title": "Lay out the kit on a flat surface.",
      "content": "Lay out the kit on a flat surface. Separate all of the contents of your kit and lay them out on a flat surface, like a table or a countertop. Make sure all of the items are within your reach and that you have all of the pieces that should be included with the kit. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Once you open up your test kit, you must use it within 24 hours or it may not be as accurate. [3] X Research source"
    },
    {
      "title": "Add a drop of water to each circle on the card.",
      "content": "Add a drop of water to each circle on the card. Use 1 of the plastic droppers to collect water from your sink. Add 1 single drop of water to each circle that is provided on the test card. Do not put multiple drops into 1 circle, or you could skew your results. [4] X Research source The water will help to dilute your blood and let the card read the results better."
    },
    {
      "title": "Wipe your finger with an alcohol wipe.",
      "content": "Wipe your finger with an alcohol wipe. Choose a pointer finger on 1 of your hands that you will prick with the lancet. Use the alcohol swab provided in the kit to disinfect the tip of your finger and the surrounding area. [5] X Research source Swabbing your finger with alcohol removes any germs or bacteria that could skew your results."
    },
    {
      "title": "Prick the tip of your finger with the lancet provided in the kit.",
      "content": "Prick the tip of your finger with the lancet provided in the kit. Place the open end of the lancet on the bottom of the tip of your finger. Hold your finger steady and press the lancet forward so that the needle presses into your skin. You may hear a click as the needle locks into place. [6] X Research source The needle is small enough that you will only feel a slight pinch."
    },
    {
      "title": "Squeeze your finger to get a drop of blood on your fingertip.",
      "content": "Squeeze your finger to get a drop of blood on your fingertip. Gently pinch your finger in between your thumb and pointer finger of your other hand just below the area that you pricked. Squeeze your finger until a drop of blood rises to the surface of your finger. [7] X Research source"
    },
    {
      "title": "Use 1 plastic applicator from the kit to transfer the blood to one of the circles.",
      "content": "Use 1 plastic applicator from the kit to transfer the blood to one of the circles. There are 4 plastic applicators provided in your test kit. The applicators look like small plastic sticks with a scoop on the end. Use 1 stick to collect blood from your finger and put it into 1 of the circles. [8] X Research source Keep your finger close to the test card so that you don’t have to move your applicator very far."
    },
    {
      "title": "Add blood to each circle on the card using the other applicator sticks.",
      "content": "Add blood to each circle on the card using the other applicator sticks. Squeeze more blood from your finger and use the other 3 applicator sticks to apply blood to each circle. Only use 1 applicator stick per circle. Do not reuse the applicator sticks for multiple circles, or you could skew your results. [9] X Research source Keep the applicators in each circle that they correspond to so that you don’t mix them up."
    },
    {
      "title": "Swirl the blood and the water together using the plastic applicators.",
      "content": "Swirl the blood and the water together using the plastic applicators. Use each applicator that goes with each circle to mix the blood and water droplets together. Do not use 1 applicator for multiple circles, or you could skew your results. [10] X Research source Keep the blood and water inside of the circles so that they don’t mix together."
    },
    {
      "title": "Tilt the card from side to side for 10 seconds.",
      "content": "Tilt the card from side to side for 10 seconds. Hold the card in the air without touching the blood and water in the circles. Slowly tilt the card away from you until it is vertical and hold it there for 10 seconds. Tilt the card toward you so that it is vertical facing the other way and hold it for another 10 seconds. [11] X Research source Tilt the card very slowly so that the liquids don’t fall off."
    },
    {
      "title": "Compare your results with the key given in the test.",
      "content": "Compare your results with the key given in the test. Set the key card next to your test card. Look at the circles of blood and find the ones with agglutinations, or small specks, instead of smooth, watery blood. The key card shows options for each blood type and its corresponding agglutination pattern. Match up the patterns to your key card to determine what blood type you have. [12] X Research source"
    }
  ]
}