{
  "url": "https://www.wikihow.com/Cut-a-Tire",
  "title": "How to Cut a Tire",
  "steps": [
    {
      "title": "Puncture the sidewall close to the tread with a sharp knife.",
      "content": "Puncture the sidewall close to the tread with a sharp knife. A utility knife or retractable box cutter will do the best job of slicing through the thick tire rubber. Thrust the tip of the blade straight into the smooth surface of the rubber about 1 inch (2.5 cm) from where the tread begins. Be careful not to cut too close to the tread itself, as it may be reinforced with steel belts. If you’re having trouble getting your initial hole started, grab an awl, ice pick, or similar tool with a sharp, pointed tip. [1] X Research source Attempting to cut directly through steel belts by hand could dull or damage your cutting implement, or result in a lot of wasted effort."
    },
    {
      "title": "Brace the tire with your foot or knee.",
      "content": "Brace the tire with your foot or knee. Place the sole of your foot onto the lower section of the tire, or kneel down and pin it to the ground with one knee. This will prevent the tire from rocking or shifting once you begin cutting. To avoid an accident, make sure you only rest your foot or knee on a section of the tire you’re not actively cutting."
    },
    {
      "title": "Cut along the outside the tread with a sawing motion.",
      "content": "Cut along the outside the tread with a sawing motion. Use your free hand to steady the tire as you work the blade smoothly through the rubber of the sidewall. Follow the seam running alongside the thicker tread. [2] X Research source For maximum leverage and control, position the knife with the blade pointing towards you and slowly guiding it down between your legs. If you’re in a hurry, you can also use a jigsaw or dremel tool with a cutting blade attachment to speed up the process. [3] X Research source"
    },
    {
      "title": "Use a wooden dowel to keep the cut sections separated.",
      "content": "Use a wooden dowel to keep the cut sections separated. Insert one end of the dowel into the split tire and pull up on it sharply. Doing so will pry apart the rubber on both sides, making it easier to continue working without your blade becoming stuck or veering towards the tread. [4] X Research source Holding the cut sections open with a dowel as opposed to your own hand will also make you less likely to accidentally cut yourself."
    },
    {
      "title": "Rotate or move around the tire to complete the cut.",
      "content": "Rotate or move around the tire to complete the cut. Once you’ve finished cutting the upper ⅓-½ of the sidewall, pause and either turn the tire one-half rotation or walk around it until you’re in a good position to continue. Bring your blade all the way back around to the original start position, then pull the sidewall material free. Most waste disposal services won’t pick up old tires unless they’ve had the sidewalls removed. [5] X Research source Not only are they more unwieldy when left intact, it’s also possible for water and other substances to collect inside. If you want to repurpose your tire rather than throwing it away, consider turning it into a garden hose caddy, miniature in-ground pond, or quaint planter for your yard or garden. [6] X Research source"
    },
    {
      "title": "Do your cutting in a workshop or open outdoor space.",
      "content": "Do your cutting in a workshop or open outdoor space. Sawing tires can be tricky, and has a tendency to leave behind lots of small rubber and metal fragments. To ensure that you’re working as safely, efficiently, and neatly as possible, situate your tire on a workbench or series of sawhorses, or place it on the ground outside. When you’re done, simply sweep the materials into a dustbin and dispose of them. You may need an extension cord if there are no outlets available near your outdoor work space. [7] X Research source"
    },
    {
      "title": "Fit a power saw or dremel tool with a metal-safe blade.",
      "content": "Fit a power saw or dremel tool with a metal-safe blade. Most large tires are threaded with supportive steel belts, which means it’s important to use a blade that’s capable of cutting through metal. Ferrous-metal blades are recommended for circular and jigsaws, while metal grinding blades will provide the most cutting power for dremel tools. [8] X Research source If you need to cut a lot of tires, invest in a set of carbide-toothed saw blades. Carbide blades make cleaner cuts and hold their edge far longer than ordinary varieties. [9] X Research source You might also be able to get through a tire using a hacksaw, if you don’t mind the exercise."
    },
    {
      "title": "Start your first cut widthwise through one side of the tire.",
      "content": "Start your first cut widthwise through one side of the tire. Lay the tire flat on its side on your work surface and switch on your saw or dremel tool. Press the cutting edge into the upper surface of the tire laterally, or across the sidewall. Slowly move the tool from the inner edge to the outer edge, stopping at or just short of the tread. [10] X Research source You may encounter a little resistance from the steel belts circling the tire’s inner edge. Don’t worry—as long as you selected the right type of blade, you should be able to saw through the tire with relative ease. If you’re going to be cutting the tire in several places, go ahead and make all your cuts on the first side at once to save time."
    },
    {
      "title": "Turn the tire over and complete the cut from the opposite side.",
      "content": "Turn the tire over and complete the cut from the opposite side. Line up your tool with the end of the cut you just made on the first side and complete the cut on the second side. Work slowly and carefully and remember to take your time whenever you come to a steel or nylon vein. [11] X Research source Dividing the tire into halves allows you to cut faster and easier than you could by trying to force your cutting tool through both sides at once. It also helps you avoid causing unnecessary damage to your work surface."
    },
    {
      "title": "Make any other necessary cuts using the same procedure.",
      "content": "Make any other necessary cuts using the same procedure. Once you've cut the tire in half, rotate the resulting pieces 90 degrees and start another pair of cuts through the center on both sides. You can continue in this fashion until you've reduced the tire to quarters or even smaller sections. Steady the tire carefully for follow-up cuts. As the pieces grow smaller, they'll become more prone to sliding or shifting on your work surface. Most municipal disposal guidelines require that tires be cut into a minimum of 2 pieces."
    },
    {
      "title": "Cut through the tread separately if you're having trouble.",
      "content": "Cut through the tread separately if you're having trouble. It may be hard to get through the tread of a particularly big tire if you’re coming at it from the side. What you can do in this case is cut both sides of the tire, then stand it up and make one final cut directly into the tread. When the 3 cuts intersect, the rubber should come apart without difficulty. [12] X Research source If possible, secure the tire with a vice or adjustable clamp. Otherwise, pinching it between your thighs will help to hold it in place. Be extremely cautious while operating your cutting tool, and make sure you keep it a safe distance away from your body at all times."
    }
  ]
}