{
  "url": "https://www.wikihow.com/Deal-with-Having-a-Flat-Chest",
  "title": "How to Deal with Having a Flat Chest",
  "steps": [
    {
      "title": "Embrace your flat chest.",
      "content": "Embrace your flat chest. There are many benefits to having smaller breasts, such as not needing to wear an underwire bra and having an easier time with breast exams. Physical activity is also easier for women with small chests, and you don’t have to deal with back pain caused by large breasts. [1] X Research source Another benefit is that you'll have an easier time finding clothes that fit you. For example, you won't have to worry about being unable to close a button-up blouse."
    },
    {
      "title": "Appreciate other areas of yourself.",
      "content": "Appreciate other areas of yourself. Being flat-chested shouldn’t define you. There are lots of other parts of yourself to appreciate, so spend some time thinking of areas of your body and mind that you do love. For example: You may have beautiful hands, long legs, or a great bum. You might be a great listener, a loyal friend, or have a great sense of humor."
    },
    {
      "title": "Practice skills and do activities that make you feel good.",
      "content": "Practice skills and do activities that make you feel good. Remember that you are beautiful and worthy, no matter the size of your chest. Looks only make up a small part of you who are. Create a list of skills and talents you possess and activities you enjoy to remind yourself of all the reasons you have to be confident. For example: You may be a strong swimmer or be able to make every free-throw you shoot. You might be well-organized, a great friend, or very artistic. You may enjoy singing and dancing, excel in math, or have the ability to cheer up anyone who is sad."
    },
    {
      "title": "Choose fitted items to flatter your body.",
      "content": "Choose fitted items to flatter your body. Fitted items will be much more flattering on your body than baggy clothes. Pick items that are snug, but not too tight or restricting. Avoid items with darts if you are flat-chested as they will likely sit weirdly on your chest and draw the wrong kind of attention. [2] X Research source If you must wear something with darts, the bust area may be baggy on you. Consider taking it to a tailor and getting it custom-fitted to your figure."
    },
    {
      "title": "Wear tops with embellishments to enhance the look of your chest.",
      "content": "Wear tops with embellishments to enhance the look of your chest. A top with ruffles, beading, ruching, pleating, frills, pockets, or zippers will make your chest look larger. Choose something that you love and wear it with a more understated bottom, such as pants or a skirt in a solid print. [3] X Research source Pairing an embellished blouse with an understated bottom will help draw attention to the embellishments."
    },
    {
      "title": "Vary the necklines on your outfits to create interest.",
      "content": "Vary the necklines on your outfits to create interest. Because of your small chest, you can wear something with a high collar or something with a plunging neckline. Change it up frequently, and choose tops with interesting details, like cut-outs. Strapless tops or dresses are also perfect for women with small breasts. [4] X Research source Big-breasted women aren’t so lucky, as certain tops don’t fit well on their frames."
    },
    {
      "title": "Go for horizontal stripes to create the illusion of a bigger bust.",
      "content": "Go for horizontal stripes to create the illusion of a bigger bust. Horizontal stripes can make your body appear curvier, so they’re perfect for those with small breasts. Choose stripes in contrasting colors, like black and white or red and blue. Try a striped dress or a striped top with a pair of solid-colored pants."
    },
    {
      "title": "Show off your arms to draw attention away from your chest.",
      "content": "Show off your arms to draw attention away from your chest. Highlight your arms by choosing sleeveless tanks or dresses. Pair a revealing top with a more modest bottom, like pants, rather than wearing a short skirt and a skimpy top. [5] X Research source Bandeau tops are great for showing off your arms and shoulders."
    },
    {
      "title": "Wear high-waisted pants to show off your figure.",
      "content": "Wear high-waisted pants to show off your figure. This also goes for skirts and shorts as well. The fabric will be more fitted around your hips as it extends up towards your waist. This will help streamline your silhouette and make it stand out. Try a pair of high-waisted jeans with a v-neck shirt. Add a statement necklace to complete the look."
    },
    {
      "title": "Show off your legs to draw attention to your lower half.",
      "content": "Show off your legs to draw attention to your lower half. Wear shorts or a mini skirt that highlights your legs. Pair them with a strappy shoe or heel to really showcase your gams. Choose a more modest top, such as a three-quarter-sleeved blouse, rather than a crop top or bandeau. Remember, balance is key. You also want to look classy, and an outfit that is too revealing is anything but that."
    },
    {
      "title": "Add jewelry to draw attention to your chest.",
      "content": "Add jewelry to draw attention to your chest. If you want to draw a bit more attention to your chest, choose necklaces that stand out. Pick pieces with large charms, lots of color, or a bit of bling. You can even layer a few simple necklaces to create an original look. [6] X Research source When layering necklaces, play around with chunky and delicate pieces. For example, you could try a delicate chain, a beaded strand, and a large statement necklace. Another thing to keep in mind when layering is to vary the lengths of the necklaces. This will help balance the look without keeping all the attention in one area."
    },
    {
      "title": "Don’t overstuff your bra.",
      "content": "Don’t overstuff your bra. It’s fine to choose a push-up bra, or one with a little padding, but don’t overdo it. People may notice if one day you appear flat-chested and the next you’re walking around with a C cup. When buying pushup bras or padded bras, make sure that they all look the same size on you. You don't want your bust size to change day-to-day."
    },
    {
      "title": "Avoid bullies when possible.",
      "content": "Avoid bullies when possible. The best way to deal with a bully is to avoid them as much as possible. If they don’t have an opportunity to tease you, you won’t have to deal with their insults. Develop a route that keeps you away from known bullies, such as sitting at a different lunch table or choosing a different seat in homeroom. [7] X Research source If you have to sit next to a bully in class due to assigned seating, ask the teacher if you can switch seats. Explain that this person is keeping you from paying attention. If the bullies are in your group of friends, then it may be time to find a different group to hang out with, especially if you friends don't stand up for you."
    },
    {
      "title": "Ignore taunts and teasing.",
      "content": "Ignore taunts and teasing. When someone teases you about being flat-chested, do your best to ignore them. Bullies are looking for a reaction, and if you give them one they are likely to continue making fun of you. Stay cool, calm, and collected. Simply ignore the insult or walk away. [8] X Research source This also includes interactions online and social media. If you want to, you can even delete their comments or block their usernames."
    },
    {
      "title": "Stand up for yourself.",
      "content": "Stand up for yourself. If you’ve tried to ignore the teasing and it hasn’t stopped, you should stand up for yourself. Tell the bully, “Stop saying that to me, it’s mean!” or “Don’t talk to me anymore.” Walk away after you’ve said your piece and be proud of yourself for being brave enough to speak your mind. Sometimes, bullies will stop picking on you if you stand up for yourself. [9] X Research source Try to remain calm and collected when confronting the bullies. If you appear too upset, they may continue teasing you just to get another, similar reaction."
    },
    {
      "title": "Be the bigger person.",
      "content": "Be the bigger person. Don’t stoop to a bully’s level and trade insults with them. Instead, show your maturity by refusing to taunt them back. You could even say something like, “I’m sorry you feel that way, but I know that looks aren’t everything. I have lots of other skills and talents that make me happy with who I am.” [10] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If the bullying still continues, tell a teacher, principal, or guidance counselor right away. They may be able to interfere and stop the bullying."
    }
  ]
}