{
  "url": "https://www.wikihow.com/Cover-a-Safe",
  "title": "How to Cover a Safe",
  "steps": [
    {
      "title": "Store your safe in the attic to decrease the odds a burglar finds it.",
      "content": "Store your safe in the attic to decrease the odds a burglar finds it. If a burglar comes into your home, they’re more likely to search the main floors than the attic, since the attic is further from their escape route. If you don’t have a good place to store your safe, keep it in the attic. Tuck it in a corner and set a large object in front of it to keep it out of plain view. This is a great option if you have a hidden staircase to the attic built into the ceiling. [1] X Research source"
    },
    {
      "title": "Hide a short safe under your bed to keep people from finding it.",
      "content": "Hide a short safe under your bed to keep people from finding it. If you have a bed frame that extends all the way down to the floor, lift it up a little and slide the safe underneath it. This won’t work for a medium-sized safe, but if it’s shorter than 16–24 inches (41–61 cm), it may fit perfectly. If a thief breaks in or someone is looking for your safe, they’re extremely unlikely to think to lift the bed frame up. [2] X Research source This is not a great option if the frame of your bed doesn’t extend all the way to the floor. You can still do this, but at least surround the safe with old shoeboxes or other objects. There are bed frames with storage boxes built into the frame of the mattress. If these boxes are hidden under the box spring, they’re a great option for the safe. Visible drawers are not ideal, though. Thieves tend to rummage through drawers if no one is around."
    },
    {
      "title": "Place the safe in a cardboard box for an inconspicuous cover.",
      "content": "Place the safe in a cardboard box for an inconspicuous cover. If you’re storing your safe in the basement or attic where you store other stuff, place the safe inside a cardboard box. Fold the flaps over to close it and set it among other boxes. This will keep dust off of the safe and keep other stuff from scratching it up if something gets knocked over. You can set it inside of a plastic storage bin if you prefer. A thief is more likely to open a storage bin than an old box, though."
    },
    {
      "title": "Wrap a small cash box in a plastic bag for some simple protection.",
      "content": "Wrap a small cash box in a plastic bag for some simple protection. If you have a cash deposit box that is smaller than 10 inches (25 cm) high and 8 inches (20 cm) wide on either side, place it inside a plastic bag and tie the top off. If you’re storing papers inside the safe, poke a few holes in the bag to prevent moisture from building up. [3] X Research source This won’t provide protection against anything other than dust, but it will keep your safe from standing out wherever you’re storing it."
    },
    {
      "title": "Store a smaller safe inside an unused refrigerator or chest.",
      "content": "Store a smaller safe inside an unused refrigerator or chest. If you have a spare refrigerator in your basement, stick the safe inside the freezer or fridge to keep thieves from finding it. If you have a large chest sitting in your basement or attic, stick the safe in there and put an additional lock on it. Thieves will be more likely to look inside the chest so you’re better off adding an extra lock. These are easy ways to keep the safe out of plain view, but they won’t offer a ton of protection if a thief is digging hard for valuables. Most thieves will focus on taking expensive goods in plain sight and won’t bother opening the fridge, though."
    },
    {
      "title": "Set the safe in the base of a closet behind some long coats to obscure it.",
      "content": "Set the safe in the base of a closet behind some long coats to obscure it. This is a fairly common spot for a safe, so it won’t offer a lot of protection from criminals. However, this is a really easy way to store a safe without leaving it out in plain sight. If you don’t have any large coats, you can always set a box on top of the safe and in front of it to hide it from wandering eyes. [4] X Research source If you have a room under a staircase, storing it in the back of this room is a great way to tuck it deep behind other boxes and whatnot. This isn’t a great option if you need to access the safe very often, but a potential thief is unlikely to dig deep into a packed closet."
    },
    {
      "title": "Drape a cloth or blanket over a big safe to keep it from sticking out.",
      "content": "Drape a cloth or blanket over a big safe to keep it from sticking out. The easiest way to cover a big safe is to just throw a textile over it. This won’t protect it from serious damage or hide it entirely, but it will make it blend into the room a little better and you can put a vase or book collection on top of it! Get an opaque cloth or blanket in a style you like and simply hang it over the safe so that each side hangs at equal lengths. The cloth or blanket will be really easy to clean if you put something heavy on top since you can just vacuum the sides of the safe."
    },
    {
      "title": "Get a prefabricated safe cover to protect it from the elements.",
      "content": "Get a prefabricated safe cover to protect it from the elements. There are a few companies that make safe covers that zip up to protect the exterior of the safe and preserve the temperature. Measure the length, width, and height of the safe. Then, go online and look for a safe cover that matches the dimensions of your safe. Place the cover over the top of the safe and line the edges of the cover-up with the edges of your safe before zipping it up. [5] X Research source These covers are typically made out of treated cloth, but there are a few hardcover cases as well. Almost all of these safe covers are in solid colors, so they won’t really hide the safe. It will just look like a bulky colorful box. These covers typically range $40-120."
    },
    {
      "title": "Tuck the safe behind a washer or dryer to keep it from sticking out.",
      "content": "Tuck the safe behind a washer or dryer to keep it from sticking out. For a large safe, you don’t have a ton of options when it comes to concealing it. One option is to set it behind or alongside your washer or dryer to keep it out of immediate view when someone walks in. If the washer and dryer are tucked in a closet, there is typically 2–4 ft (0.61–1.22 m) of space on either side of the washer or dryer which is a great hiding spot, but not as easy to access. [6] X Research source If you do tuck it in a closet behind a washer or dryer, keep in mind that you’ll have to remove the washer or dryer every time you need to access the safe."
    },
    {
      "title": "Install a wall safe to keep your safe hidden and out of the way.",
      "content": "Install a wall safe to keep your safe hidden and out of the way. Get a wall-mountable safe and find two studs to mount the safe between. Follow the manufacturer’s instructions to install the safe yourself, or hire a drywall contractor to install the safe for you. These safes are a great option because they’re hard to find if there’s something covering them and they’re extremely difficult for a thief to remove. [7] X Research source You cannot hang any standard safe in the wall. You have to use a special safe that’s specifically designed to sit level in the wall. Even if a burglar does happen to stumble on a wall-mounted safe, they won’t be able to steal it without doing some heavy-duty drywall work. This is the main benefit of these safes and why they’re popular in businesses. These safes cost roughly $150-5,000 depending on how fancy and big you want the safe to be."
    },
    {
      "title": "Hang a painting or mirror over the wall safe to conceal it.",
      "content": "Hang a painting or mirror over the wall safe to conceal it. Once the safe is in the wall, hang a painting or large mirror over the safe. If a burglar comes into your home or business, they won’t think to inspect behind the mirror or painting. Not only will the safe be nearly impossible to remove, but the odds are that a thief will never even know it’s there. [8] X Research source There’s also just something really cool about sliding a painting or mirror over to reveal your hidden safe!"
    },
    {
      "title": "Choose a wall safe designed as a vent for a more subtle option.",
      "content": "Choose a wall safe designed as a vent for a more subtle option. If you want a wall safe that blends in a little better than the standard options, get a wall safe with an air vent on the cover to blend it in with the room. These are a great choice if you don’t want to hang anything on the wall and keep your valuables in an easily accessed location. This is also a slick solution if you’re limited in space or want to store the valuables in a smaller room since you won’t need to hang anything over it to hide it. [9] X Research source"
    }
  ]
}