{
  "url": "https://www.wikihow.com/Encourage-People",
  "title": "11 Feel-Good Ways to Encourage Others",
  "steps": [
    {
      "title": "Encourage even the smallest effort.",
      "content": "Encourage even the smallest effort. Small efforts may appear little but to the doer, having the effort recognized can mean a great deal. It can be enough to spark the motivation to continue with a challenge. It could even be a way of helping a small effort grow into something large. [1] X Research source"
    },
    {
      "title": "Stop finding fault with the wrong and applaud the right.",
      "content": "Stop finding fault with the wrong and applaud the right. By nitpicking and projecting our own insecurities and irritation onto others, we fail to see what the other person is doing right. By noticing the things done well, and downplaying the things we're not happy about or don't like, there is a greater likelihood of seeing more of the same right behavior and responsiveness. Water the flowers you want to see grow, rather than feeding the weeds. [2] X Research source"
    },
    {
      "title": "Look for outwardly demonstrable ways to encourage a person.",
      "content": "Look for outwardly demonstrable ways to encourage a person. Stars or happy faces work with children. Badges, certificates, gifts and notes are nice ways to encourage employees, coworkers, friends, students, family members, etc. A photo of the two of you doing something good together, by way of both memory and acknowledgment, can be a terrific way to encourage another person and shows your solidarity with their efforts. [3] X Research source"
    },
    {
      "title": "Reject negative responses.",
      "content": "Reject negative responses. These are the reactions such as frowns or pouts. They're also the physical evidence such as bad letter grades or nasty comments left online. There is always room for improvement––most people are constantly aware of this––but there is no room for berating or criticizing with mean intent; you may feel temporarily clever but barbs leave lasting marks, with no benefit. Think with a helping spirit rather than an attacking one––be very wary of your own inner emotions if all you feel like doing is dressing down someone else, as the source of your irritation is inner unhappiness. Deal with that directly rather than discouraging someone else."
    },
    {
      "title": "Make positive comments.",
      "content": "Make positive comments. To a child, say things like “your work was really neat”, \"I can see you did a great deal of research on that topic, that's fantastic.\" Tell people how well they have performed at something, faced their fears, overcome obstacles and succeeded at even the smallest things. [4] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. Even if you feel dislike for a person or feel competitive towards them, there is always at least one thing about them that you can honestly say is positive, so dig for that and tell this person––remember that it may encourage more of the positive, less of the things that bother you! [5] X Research source"
    },
    {
      "title": "Write encouraging comments.",
      "content": "Write encouraging comments. Whether it's for work, for peer review, for a child's homework or for any other written feedback, keep the comments encouraging and constructive. Decimating someone's work may feel satisfying but saying things forcefully tends to deflate and fails to give good direction on what needs to be improved. Instead of being negative, make comments such as (for a child) “I really liked how you did that, I bet you will get it all correct next time” or \"You've done a lot of work here, of good quality. Next time I'd suggest focusing more on X, Y and Z, just to ensure that the paper as a whole reads coherently.\" You can still say what needs to be clarified and improved, it's just the how you approach it that makes all the difference."
    },
    {
      "title": "Tell people positive things about themselves.",
      "content": "Tell people positive things about themselves. People love to hear how you perceive them in a positive light; all too often we are our own worst critics and it is can be surprisingly uplifting to hear someone external tell us quite the opposite of our worries. [6] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. For example, you can point out how kind, caring, helpful, thoughtful, considerate, timely, reflective, innovative, etc. a person is. Try to point out concrete examples that demonstrate to your mind why the person shows these traits, as that will help the other person to see that you're genuine. [7] X Research source"
    },
    {
      "title": "Notice when someone does something good.",
      "content": "Notice when someone does something good. While we tend to admire the way people look or have the courage to look or act differently, often we stay silent. This is a pity, as it tends to allow the spiteful pick-apart culture so adored in celebrity-style media to take central stage. Part of moving away from such personal attacks involves shifting to always using personal compliments instead. By displaying this regularly, you serve as a role model on how to encourage people, rather than putting them down. For example, you might like to notice people's dress and grooming, such as saying: “I love the way you dress\", or \"I love the way you comb your hair”."
    },
    {
      "title": "Keep it honest, keep it real.",
      "content": "Keep it honest, keep it real. People know the truth about themselves. They'll also know when you're flattering rather than complimenting from the heart. Flattery is not a sincere form of encouragement; it usually always comes with an edge of wanting something or of wanting to pump up another person, only to pierce their balloon later. Get into the habit of speaking only honest compliments and you'll leave the gossip and rumor style comments well behind. [8] X Research source"
    },
    {
      "title": "Bite your tongue when you're feeling mean.",
      "content": "Bite your tongue when you're feeling mean. We all feel mean at times, often when we're tired, rundown, hungry or feel humiliated in some way. It happens and it's part of life's journey to learn how to manage our own blues and down times. One important lesson to learn is to bite your tongue and not say negative and discouraging things, just to get people off your back. Instead, you could insert an encouragement or simply say nothing until you feel more like yourself again. If you do overstep the mark (and goodness, who hasn't at some point?), apologize. This ensures that you do the right thing by the other person. You cannot make the other person forgive you or forget what you've done but you can always set things to right from your end and continue in a constructive and fair manner from that point on. Lesson learned. Move on."
    },
    {
      "title": "Have a good upbeat attitude.",
      "content": "Have a good upbeat attitude. The cup is half full rather than empty. Each of us feels other people's negativity. As our mother taught us, “If you don't have something nice to say, say nothing at all”."
    }
  ]
}