{
  "url": "https://www.wikihow.com/Get-Fit-As-a-Teenager",
  "title": "How to Get Fit As a Teenager",
  "steps": [
    {
      "title": "Start an at-home exercise routine.",
      "content": "Start an at-home exercise routine. Consider putting together a basic routine to boost your fitness level. Whether or not you have access to a gym, start with the basics at home: push-ups , pull-ups , sit-ups and, if you have access to weights, basic squats, curls , and bench presses . If you’re not sure of where to begin—what exercises to include in your routine, what weights to lift, etc.—talk to your gym coach or check online for teen weight-training recommendations."
    },
    {
      "title": "Warm up and cool down before and after your workout.",
      "content": "Warm up and cool down before and after your workout. Before each workout, start with about 10 minutes of mild stretches. Warming up helps prevent injury and can help to maximize the calories burnt during your entire workout. [1] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source Similarly, if you take the time to taper off your workout with cooling-down stretches you will feel less taxed when you are done. Over time, if you find that you enjoy running, think about joining a cross country team."
    },
    {
      "title": "Exercise with a friend.",
      "content": "Exercise with a friend. Find a friend who also wants to be active during the week and exercise with them. You can also ask members of your family (siblings, cousins, even parents) if they’d like to exercise with you. It’ll be easier to stay motivated to be fit if you have a friend or family member to exercise with and who can provide moral support. [2] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Having a friend to support you will make you more likely to stick with your exercise regime."
    },
    {
      "title": "Be active for at least one hour every day.",
      "content": "Be active for at least one hour every day. An hour of daily activity will help you become more fit, and cut back on negative effects from a slow-paced lifestyle. You don’t have to visit a gym or take up a sport to be active. Try walking or riding your bike to a friend’s house instead of driving, or visiting a local pool and swimming after school. [3] X Research source Increasing your daily activity has various health benefits. One hour of daily activity on most days of the week will reduce stress, gain energy, and reduce risk for certain diseases."
    },
    {
      "title": "Get involved in a sport or active after-school activity.",
      "content": "Get involved in a sport or active after-school activity. Sports and athletic group activities are great ways to increase your daily activity level and boost fitness as a teen. If you enjoy athletic participation, try out for your middle or high school’s intramural teams. Or, find an active after-school club you could join, like a swim team. The activity you choose doesn’t have to be a conventional team sport like football or basketball. If you have an interest, you could try other activities like gymnastics, horseback riding, skateboarding, or karate."
    },
    {
      "title": "Join a gym or sign up for an exercise class.",
      "content": "Join a gym or sign up for an exercise class. These options will help keep you active and can even help you transform your body by providing regular exercise and periods of activity in a fun, social setting. Look into nearby gyms that hold popular types of exercise classes in the afternoon or evening, so you could attend after school. If you’re not interested in more traditional gym or exercise classes, check out other types of physical group activity, including Zumba or Pilates and martial arts."
    },
    {
      "title": "Walk or bike to school.",
      "content": "Walk or bike to school. If you live close enough to your school that you can safely walk or bike there in a reasonable about of time (say, under 30 minutes), try to build this into your weekly plans. A 30-minute walk to school will take care of half of your daily activity time, and will help your health by raising your heart rate and working out leg muscles. [4] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source If you have a part-time job after school or on the weekends, walk or bike to this too."
    },
    {
      "title": "Take a short walk during school breaks.",
      "content": "Take a short walk during school breaks. If you have a 15-minute passing period or 45-minute lunch break during your school day, take a quick walk during this time. This will help boost your fitness and activity levels. [5] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Or, if your school has stairs, then go up and down the stairs a few times. In the evenings, do the same thing during your time devoted to homework. Take one or two 15-minute breaks and spend this time walking or jump roping or go for a quick jog. Don’t feel like you need to wait until you have hours of free time to start being active."
    },
    {
      "title": "Limit screen time to two hours a day.",
      "content": "Limit screen time to two hours a day. Many teens spend hours a day watching TV or movies and playing video games. These activities will harm your fitness level and can lead to weight gain. Limit your screen time to two hours (or fewer) every day. This will give you more time for physical activities. [6] X Research source You can even build activities into your screen time. If your parents have an elliptical machine, walk on that while watching a movie. Or, try doing lunges during every commercial break of your favorite show."
    },
    {
      "title": "Stick with foods that give you a healthy, balanced diet.",
      "content": "Stick with foods that give you a healthy, balanced diet. The first—and most important—part of staying fit as a teen is a proper diet. Avoid unhealthy meals, including most processed foods and fast food. Instead, focus on eating plenty of dairy and proteins to help you grow. These can include milk, yogurt, chicken, beef, fish, and beans or tofu. If you (like most teens) still live at your parents’ house, ask them to help with your diet. Ask them to buy healthy snacks and to serve non-processed, whole foods for meals. Avoid fad diets and diets that involve a lot of restrictions and rules. Studies show that most people who go on diets end up back where they started in the long run. Come up with a plan for eating healthy that works for you and is sustainable long term. [7] X Expert Source Errol Ismail Certified Personal Trainer Expert Interview. 18 February 2021."
    },
    {
      "title": "Eat plenty of vegetables and fruits.",
      "content": "Eat plenty of vegetables and fruits. Veggies and fruits should form a significant part of your daily diet. Aim to eat four servings of fruits and five servings of vegetables each day. [8] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source For example, have a glass of freshly squeezed orange juice and a handful of berries with breakfast, a side salad and an apple with lunch, and a serving of cooked vegetables with dinner. Fruits and vegetables provide healthy sugars (much better than the sugars added to many processed foods) and fiber that your body needs."
    },
    {
      "title": "Eat foods that give you calcium and iron.",
      "content": "Eat foods that give you calcium and iron. These two minerals are crucial for teens’ growing bodies. Plan to consume at least 1300 milligrams of calcium a day, which means drinking plenty of milk and eating dairy products, including hard cheeses and yogurt. [9] X Research source Iron is especially important for young women. Iron is found in many foods, including beans, nuts, beef, pork, poultry, and eggs. If you are trying to cut back on sugar, then you might consider including whole milk rather than skim or 1% milk because whole milk has less sugar than lighter versions. [10] X Research source"
    },
    {
      "title": "Consume foods with vitamins, minerals, and fiber.",
      "content": "Consume foods with vitamins, minerals, and fiber. It’s important for teens to get vitamins through their diet. Vitamins encourage healthy growth and are valuable parts of overall fitness. Fiber will keep your digestive tract healthy and will also help you feel full, since fibrous food takes up room in your stomach and breaks down slowly. Find fiber in foods like celery and beans. [11] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Find vitamin A in eggs, dairy products, and dark-colored leafy greens. B vitamins are commonly found in meats and fish, and vitamin C can be consumed in citrus fruits, berries, and tomatoes. [12] X Research source Healthy minerals can be found in foods like broccoli, potatoes, and citrus fruits (potassium); red meat, chicken, and seafood (zinc and phosphorous); and whole grains and nuts (magnesium). In addition to finding important vitamins in the foods you eat, you can take a daily multivitamin pill. This will supplement your diet and help you get the nutrients you need."
    },
    {
      "title": "Hydrate by drinking six to eight glasses of fluids each day.",
      "content": "Hydrate by drinking six to eight glasses of fluids each day. Your body needs plenty of water and other fluids to function well. This is especially true if you’re increasing your daily activity levels or if you’re starting an exercise regimen. Keep hydrated with water, fruit juices, tea, and other healthy options. Avoid soft drinks and energy drinks."
    },
    {
      "title": "Eat healthy snacks in between meals.",
      "content": "Eat healthy snacks in between meals. Your teen years are the time in your life when you will grow the most, so when your stomach does grumble, don’t reach for a slice of cake or a packet of chips. Try healthy snacks like yogurt, fruit, or smoothies instead. Don’t worry if you’re often hungry; increasing exercise and activity will increase your appetite."
    }
  ]
}