{
  "url": "https://www.wikihow.com/Cure-Sleep-Apnea",
  "title": "How to Cure Sleep Apnea",
  "steps": [
    {
      "title": "See your doctor.",
      "content": "See your doctor. Sleep apnea can have many different symptoms, so it is difficult to diagnose based on the symptoms alone. If you suspect that you have sleep apnea, then see your doctor as soon as possible. Some serious symptoms to watch for include: [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Snoring or breathing interruptions while asleep, observed by your partner Waking up gasping for air or choking Shortness of breath upon waking Having pauses in your breathing (noticed by your partner) Feeling drowsy during the day, or like your sleep has not been restful or restorative Any of the following health issues: hypertension, mood disorder, cognitive dysfunction, coronary artery disease, stroke, congestive heart failure, atrial fibrillation, or type 2 diabetes mellitus"
    },
    {
      "title": "Undergo a sleep study.",
      "content": "Undergo a sleep study. To diagnose sleep apnea, your doctor will consider your symptoms along with the results of a sleep study. You can undergo a sleep study in a clinical setting or at home. In both situations, your vital signs (breathing, heart rate, blood pressure, etc.) will be monitored. Clinical setting . If you decide to have a sleep study done in a clinical setting, then you will have to stay overnight at a sleep clinic. You will be monitored by medical technicians while you sleep. Home-based portable monitor . If you decide to have a sleep study done at home, then you will need to use a portable monitor to monitor your vital signs."
    },
    {
      "title": "Determine what type of sleep apnea you have.",
      "content": "Determine what type of sleep apnea you have. There are a three different types of sleep apnea: obstructive, central, and complex. Your doctor should be able to tell you which type you have by considering factors such as your medical history, medications, and sleep study results. Obstructive sleep apnea . This is the most common type of sleep apnea. Obstructive sleep apnea is when the tissues in your throat relax while you are asleep and block your airway. Central sleep apnea . Central sleep apnea is less common. This type of sleep apnea is when your brain fails to send a signal to your body to breathe. [3] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Complex sleep apnea . This form of sleep apnea is a combination of obstructive and central sleep apnea. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Ask about your treatment options.",
      "content": "Ask about your treatment options. After you have undergone testing and received a diagnosis from your doctor, you will be able to talk about treatment options. Your doctor will likely recommend some lifestyle changes, such as losing weight, as well as some special exercises and devices, including a CPAP, that may help. These are described later in the article. In some cases, your sleep apnea may be caused by something that can be corrected with surgery, such as very large tonsils or facial malformations. Surgery to remove these obstructions may provide a long-term cure for severe obstructive sleep apnea. [5] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "Sing a song once per day.",
      "content": "Sing a song once per day. Singing can help to improve muscle control in your throat and in the soft tissues in your throat. Toning these muscles can reduce your chance of sleep apnea. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try singing along to a favorite song once per day or more often to give these muscles a workout."
    },
    {
      "title": "Hold a pencil between your teeth.",
      "content": "Hold a pencil between your teeth. Jaw muscles can also contribute to sleep apnea, so it is important to strengthen these as well. To strengthen your jaw muscles, hold a pencil between your teeth for about five to 10 minutes per day. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Purse your lips.",
      "content": "Purse your lips. The muscles in and around your mouth also play an important role in breathing, so strengthening these muscles may also help cure your sleep apnea. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try pursing your lips as if you are going to give someone a kiss. Then, hold your lips like that for about 30 to 60 seconds and release. Repeat this exercise a few times per day."
    },
    {
      "title": "Blow up balloons.",
      "content": "Blow up balloons. Blowing up balloons can improve your lung capacity and give the muscles in your mouth and throat a good workout as well. Try blowing up a few balloons each day to strengthen your breathing muscles. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Run, jog, or swim to lessen sleep apnea.",
      "content": "Run, jog, or swim to lessen sleep apnea. There is some evidence that exercising can reduce the severity of sleep apnea. Even if you don't experience weight loss from your exercise, you may still experience some relief."
    },
    {
      "title": "Gargle some water.",
      "content": "Gargle some water. Gargling water can help to tone the muscles in the back of your throat as well. Try gargling with water a few times per day to build up these muscles. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You can also gargle mouthwash after you brush your teeth in the morning and at night. This is not proven to help with sleep apnea, but it may be worth trying."
    },
    {
      "title": "Start a sleep diary.",
      "content": "Start a sleep diary. Keeping a sleep diary can help you to determine if your sleep apnea is getting better or worse. To start a sleep diary, record as many details as possible about the quantity and quality of your sleep to help you monitor your condition. Some things to record in a sleep diary include: [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source How long you sleep each night How many times you wake up during the night and at what time How you feel in the morning Anything your partner noticed during the night — this is vital, as many people don't wake up enough to realize they have had an apneic (a temporary suspension of breathing) episode, but your partner may notice"
    },
    {
      "title": "Lose weight",
      "content": "Lose weight . Being overweight is one of the main risk factors for sleep apnea. If you are overweight, then do what you can to get to a healthy weight (defined as a BMI between 18.5 – 25). Losing weight involves reducing the number of calories you take in while increasing the number of calories you burn. To achieve this ratio, you will need to eat less and move more. Some other things that may help you to lose weight include: [12] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Drinking more water Keeping a food diary Developing an exercise routine"
    },
    {
      "title": "Exercise every day.",
      "content": "Exercise every day. Exercise will help you to lose weight and it can also improve your lung function and strengthen your breathing muscles. It has also been shown to improve concentration, critical thinking, mood, and a number of other positive benefits. Try to incorporate moderate-intensity exercise five times a week for 30 minutes. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Start with some light cardiovascular exercise such as walking, biking, or swimming. Even if you can only do 10 minutes at first, keep at it and increase the length and intensity of your workouts over time. Include some yoga in your daily routine to tone muscles and improve your breath control as well."
    },
    {
      "title": "Quit smoking",
      "content": "Quit smoking . Smoking is bad for your lungs and it can contribute to all kinds of health problems such as cancer, emphysema, and high blood pressure. Smoking also triples your risk of developing sleep apnea, but you can eliminate this risk factor by not smoking. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There are medications and smoking cessation programs that can help you quit. Talk to your doctor for help."
    },
    {
      "title": "Drink alcohol-free beverages.",
      "content": "Drink alcohol-free beverages. Alcohol depresses your nervous system, which can interfere with normal breathing. To avoid this potential cause of sleep apnea, do not drink any alcoholic beverages. Instead, choose alcohol-free beverages, such as sparkling water, juice, and tea. [15] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source If you are used to having an alcoholic beverage before bed to help you sleep, then try switching to herbal tea, such as chamomile. Chamomile can help to relieve anxiety and improve sleep."
    },
    {
      "title": "Sleep on your side.",
      "content": "Sleep on your side. Sleeping on your side rather than on your back or stomach may help stop snoring and breathing problems associated with sleep apnea. Sleeping on your side or on your back does not cure sleep apnea, but it prevents it from happening as long as your stay on your side while you sleep. [16] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source To make sure that you stay on your side while you sleep, you can use a wedge or place some pillows behind your back to keep you from rolling over during the night. You can also sew a tennis ball into the back of your pajamas to prevent you from rolling onto your back. This, however, may lead to backaches. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Avoid certain medications.",
      "content": "Avoid certain medications. Some medications can make OSA worse. Specifically, benzodiazepines, opiates and other sedatives, and some antidepressants. If you have a new diagnosis of OSA and are already taking one of these medications, talk to your doctor about the risk/benefit of continuing."
    },
    {
      "title": "Maintain a regular sleep schedule",
      "content": "Maintain a regular sleep schedule . Having a regular sleep schedule may also reduce your risk of sleep apnea. Try to go to bed and wake up at the same time every day. [18] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, you might go to bed every night at 11:30pm and wake up every morning at 7:00am. Use an alarm and don't hit snooze!"
    },
    {
      "title": "Stop eating about two hours before you go to bed.",
      "content": "Stop eating about two hours before you go to bed. Heavy or spicy meals before bedtime may increase your risk of sleep disruption. To eliminate this risk, stop eating two to three hours before you go to bed. [19] X Research source [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you are hungry, try a light snack like a piece of fruit or a cup of herbal tea."
    },
    {
      "title": "Use a CPAP machine.",
      "content": "Use a CPAP machine. Constant positive air pressure (CPAP) machines are meant to keep you breathing normally throughout the night. CPAP machines send a puff of positive pressure into your airway at the end of each breath in order to keep the airway open throughout the breathing cycle. as a result, apneas due to the airway collapsing as occurs in OSA are prevented. [21] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source Talk to your doctor if you are having problems using your CPAP machine. Do not stop using your CPAP machine without your doctor’s permission. Using your CPAP machine may improve daytime sleepiness, blood pressure, glucose levels, and quality of life. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you do not use the CPAP machine regularly or use it for a while and then stop, you will lose any positive gains you made (such as improving your blood pressure)."
    },
    {
      "title": "Wear a mouthpiece.",
      "content": "Wear a mouthpiece. A dentist or orthodontist can make you a custom-made mouthpiece to keep your jaw aligned and your airways open as you sleep. While studies are very clear that CPAP is more effective than oral appliances, [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source there is still strong evidence that oral appliances provide a significant treatment effect compared to nothing at all. Many patients find CPAP intolerable to use regularly but are able to wear oral appliances, and for these patients an oral appliance would be appropriate. Keep in mind that mouthpieces require regular adjustments by your dentist or orthodontist or they may stop working. Keep track of adjustments and change every three months or so."
    },
    {
      "title": "Elevate the head of your bed or use a foam wedge.",
      "content": "Elevate the head of your bed or use a foam wedge. If you do not like sleeping on your side, then try sleeping on your back in a slightly upright position. You can use a foam wedge to prop yourself up while you sleep, raise your mattress if you have an adjustable bed, or use bricks to elevate the head of your bed. [25] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Only a slight elevation of 2 – 3 inches is needed. To use bricks to elevate the head of your bed, place them under the feet at the head of your bed. You can also use sturdy pieces of wood."
    },
    {
      "title": "Eliminate sedative medicines.",
      "content": "Eliminate sedative medicines. Sedatives depress your nervous system, which may stop your brain from telling your body to breathe. If you often use sleeping pills or other sedatives to help you sleep, stop using these medicines. Talk to your doctor about alternatives that will not put you at risk of sleep apnea, such as melatonin or valerian. [26] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try taking an allergy medicine before bedtime.",
      "content": "Try taking an allergy medicine before bedtime. If your airways are blocked due to allergies, then taking an antihistamine pill or using a nasal spray prior to bedtime may help to open up your nasal passages and make breathing easier. Make sure that you ask your doctor first before starting this treatment. [27] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "Ask your doctor about modafinil.",
      "content": "Ask your doctor about modafinil. Modafinil is an FDA-approved drug that may help to combat the daytime fatigue associated with sleep apnea. You need a prescription for modafinil and it should not be used as a replacement for other therapies. Modafinil should be used as part of a treatment regimen that includes using a CPAP device and other sleep apnea treatments. It should be used only after the patient has been consistently using CPAP correctly and its still having problems Modafinil may cause weight gain."
    },
    {
      "title": "Talk to your doctor about other conditions.",
      "content": "Talk to your doctor about other conditions. While OSA is a common cause of daytime sleepiness, there are other medical conditions that can cause daytime fatigue and sleepiness that often mimic the symptoms of OSA. This includes hypothyroidism, sleep disorders, depression, and a number of other things. It is important that your doctor rule out these causes through history taking and other tests."
    },
    {
      "title": "Add vitamin C.",
      "content": "Add vitamin C. In a small study, vitamin C injections were shown to be an effective way to reduce the cell damage associated with sleep apnea. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There is not enough evidence for use of vitamin C to be a conclusive treatment for sleep apnea, but you may wish to talk to your doctor about adding a vitamin C supplement to your diet. Consider taking 500mg of vitamin C daily as part of your treatment regimen."
    }
  ]
}