{
  "url": "https://www.wikihow.com/Get-Started-with-IRC-(Internet-Relay-Chat)",
  "title": "How to Use IRC (Internet Relay Chat)",
  "steps": [
    {
      "title": "Download and install an IRC client.",
      "content": "Download and install an IRC client. A client is the software you use to chat on IRC. Some popular options: Cross-platform: Mibbit is a web-based Ajax IRC client. Pidgin is a multi-platform instant messaging client that supports IRC, AIM, Yahoo, Facebook Messenger , and several other protocols. Irssi is an IRC client designed to run in the command-line interface using the Terminal on Linux or macOS . Smuxi is an irssi-inspired, flexible, user-friendly, and cross-platform IRC client for advanced users, targeting the GNOME Linux desktop. WeeChat is another terminal-based IRC client designed for use using the Terminal on Linux or macOS. Windows: mIRC is the most popular IRC client for Windows because it is so easily modifiable. It has a 30-day license for you to try the software, after which you may still use it but are given a message asking that you register it for a fee of $20. ClicksAndWhistles is a free IRC client for Windows. IceChat is another free customizable IRC client for Windows. Linux: XChat is one of the most popular IRC clients for Linux. It is also available for Windows. HexChat is based on the X-Chat client and is free to download. Konversation is a popular KDE IRC client that usually comes pre-installed on the Kubuntu distribution of Linux. Mac: Colloquy is a free IRC client available for Mac and iOS. LimeChat is a free IRC client for Mac available from the Mac App Store. XChat Aqua/Azure is a free IRC Client for macOS based on XChat2. It is available from the App Store on Mac. Android: IRCCloud is a free IRC client for Android available on the Google Play Store. It is also available for iPhone and iPad and has a web-based client. Revolution IRC is a modern IRC client design for Android with functionality in mind. It is currently available as early access in the Google Play Store. iOS: Igloo Classic is a modern IRC client available for free from the App Store on iPhone and iPad. IRCCloud is a free IRC client for Android and iOS devices."
    },
    {
      "title": "Enter a nickname.",
      "content": "Enter a nickname. When you launch your IRC client, it will ask you to enter a nickname (or \"nick\" for short). This can be any name you want. However, it does have to be unique. No other user on the server you join can have your nickname. Because your nick has to be unique, many IRC clients will ask you to enter an alternate nick in case yours is taken. You can set your nickname at any time by typing /nick [your desired nickname] and pressing Enter or Return . If you want to register your nickname with the server so no one else can use it, you can do so after joining the server. Type /msg nickserv register [enter a password] [enter your email address] and press Enter or Return ."
    },
    {
      "title": "Select a server to connect to.",
      "content": "Select a server to connect to. Most IRC clients have a drop-down menu with various servers you can connect to. Each server or network has a variety of channels or chat rooms. Use the drop-down menu to select a network or server to connect to. Once you select a nickname and a server, click the button to connect to the server in your IRC client. If the server or network you're looking for is not listed, most IRC clients have the option to add a server. Click this option and enter the server address (i.e., \"chat.freenode.net\") and click the option to add or connect to the server. You can also join a server by typing /server [server address] and pressing Enter ."
    },
    {
      "title": "Join a channel.",
      "content": "Join a channel. IRC servers have a variety of channels or chat rooms you can join. Channels have a hashtag (#) followed by the chat room name, and usually revolve around specific topics or interests (i.e., gaming, movie downloads, etc.). You can just click the channel or right-click a channel and click the option to join. You can join a chat room at any time by typing /join #[chat room name] and pressing Enter or Return . To view a list of channels, type /list and press Enter or Return ."
    },
    {
      "title": "To chat in a channel, type your message and press ↵ Enter or Return.",
      "content": "To chat in a channel, type your message and press ↵ Enter or Return . Most IRC clients have a text bar at the bottom of the client that you can click and enter text. Anything you type into the channel will be visible to others. Chat messages will usually be displayed in the main window panel with the user's nickname listed to the left of the message. Messages will appear instantly as they are sent."
    },
    {
      "title": "Send a private message.",
      "content": "Send a private message. If you see someone in a chat that you want to talk with in private, you can send them a private message . Most IRC clients will allow you to start a private chat with someone by double-clicking their nickname, or right-clicking their nickname and selecting the option to message them. This will open a new window where you and the user can chat privately without the rest of the room seeing your conversation. You can also open a private message window with another user by typing /query [user's nickname] and pressing Enter . Alternatively, you can private message a user within the chat by typing /msg [user's nickname] [message] and pressing Enter . The message will appear in the chat along with all the other messages, but only the user you mentioned can see it. The message will also be marked as private."
    },
    {
      "title": "IRC has a variety of commands you can use.",
      "content": "IRC has a variety of commands you can use. You can enter a command by typing a forward slash (/) followed by the command and pressing Enter . [1] X Research source /help : Displays a list of help topics. /nick [nickname] . Change your nickname. /msg nickserv register [password] [email address] . Register your nickname with the server. /server [server address] . Join an IRC server. /list . List channels on the IRC server. /join #[channelname] . Join a channel (chat). /names #[channel] . List all nicknames in a specific channel. /whois [nickname] . Display information about a specific nickname. /away [message] . Let users know you are away from your computer and not paying attention to the chat. You can leave an optional message for users who try to message you. /ignore [nickname] . Ignore a specific user. /msg [nickname] [message] . Send a private message to another user within the chat window. /query [nickname] [message] . Send a private message to another user in a separate window."
    },
    {
      "title": "me [action]",
      "content": "me [action] . Describe yourself doing an action (e.g., \"/me is cleaning my room\"). /part #[channelname] . Leave a channel. /quit [message] . Disconnect from IRC. You can also leave an optional goodbye message with this command."
    }
  ]
}