{
  "url": "https://www.wikihow.com/Do-a-Simple-Number-Mind-Trick",
  "title": "20 Number Magic Tricks: Read Minds with Math!",
  "steps": [
    {
      "title": "Trick #1: Think of a number between 1 and 10",
      "content": "Trick #1: Think of a number between 1 and 10 Choose a number between 1 and 10. Add 2 to your number, then multiply that result by 2. Subtract 2 from this product, then divide by 2. Subtract the original number from your most recent answer to get the final result. [1] X Research source The final result will always be 1 . For example, say the original number is 5. 5 + 2 = 7 → 7 x 2 = 14 → 14 - 2 = 12 → 12 ÷ 2 = 6 → 6 - 5 = 1 ."
    },
    {
      "title": "Trick #2: Think of any number and multiply it by 3",
      "content": "Trick #2: Think of any number and multiply it by 3 Choose a number and multiply it by 3. Add 6 to this product, then divide the new result by 3. Subtract the original number from the most recent calculation to get your final result. The final result will always be 2 . For example, say the original number is 8. 8 x 3 = 24 → 24 + 6 = 30 → 30 ÷ 3 = 10 → 10 - 8 = 2"
    },
    {
      "title": "Trick #3: Think of a number between 1 and 20",
      "content": "Trick #3: Think of a number between 1 and 20 Choose a number between 1 and 20. Add 1 to the number, then double the new sum. Add 4 to this number and then divide it by 2. Subtract the original number for the final result. The final result will always be 3 For example, say the original number is 4. 4 + 1 = 5 → 5 x 2 = 10 → 10 + 4 = 14 → 14 ÷ 2 = 7 → 7 - 4 = 3 . Another variation on this trick is to think of any number, then double that number, add 9, subtract 3, and divide by 2. Subtract the original number from your most recent result to get 3."
    },
    {
      "title": "Trick #4: Think of any number and add it to the next-highest integer",
      "content": "Trick #4: Think of any number and add it to the next-highest integer Select any number, then think about the next-highest number. Add those two neighboring integers together. Then, add 9 to this sum, then divide the result by 2. Finally, subtract the original number to get your final result. [2] X Research source The final result will always be 5 . For example, let’s say that the original number was 10. The next highest number is 11, so 10 + 11 = 21 → 21 + 9 = 30 → 30 ​​÷ 2 = 15 → 15 - 10 = 5 ."
    },
    {
      "title": "Trick #5: Think of any number between 20 and 100",
      "content": "Trick #5: Think of any number between 20 and 100 Pick a number between 20 and 100 and add each digit of this number together to get a single sum. Then, subtract that sum from the original number to get the difference. Finally, add each digit of the difference together for your final result. The final result will always be 9 . For example, let’s say that the original number was 64. 6 + 4 = 10 → 64 - 10 = 54 → 5 + 4 = 9 ."
    },
    {
      "title": "Trick #6: Think of any number and add 5 to it",
      "content": "Trick #6: Think of any number and add 5 to it Choose a number and add 5. Multiply this sum by 3. Then, subtract 15, divide by the original number, and add 7 to get the final result. The final result will always be 10 . For example, let’s say that the original number was 20. 20 + 5 = 25 → 25 x 3 = 75 → 75 - 15 = 60 → 60 ÷ 20 = 3 → 3 + 7 = 10 ."
    },
    {
      "title": "Trick #7: Think of a 3-digit number that has 3 different digits",
      "content": "Trick #7: Think of a 3-digit number that has 3 different digits Pick a 3-digit number with three unique digits; for example, you could choose 583 or 204 but not 224, 919, or 555. Reverse the digits to get a new number, then subtract the smaller number from the larger one. Add up the digits of this new result to get the final answer. [3] X Research source The final result will always be 18 . For example, let’s say that the original number was 291. When reversed, 291 becomes 192. 291 - 192 = 99 → 9 + 9 = 18 ."
    },
    {
      "title": "Trick #8: Think of a 3-digit number where every digit is different",
      "content": "Trick #8: Think of a 3-digit number where every digit is different Choose a 3-digit number with three different digits; for example, you could choose 201 or 948 but not 333, 818, or 400. Reverse the digits so that you have a new three-digit number. Subtract the smaller number from the larger number to get another 3-digit number, then reverse the digits of the difference and add this reversed number to the original difference. [4] X Research source The final result will always be 1089 . For example, let’s say the original number was 845. When reversed, 845 becomes 548. 845 - 548 = 297 → 792 + 297 = 1089 ."
    },
    {
      "title": "Trick #9: Think of a number between 1 and 8",
      "content": "Trick #9: Think of a number between 1 and 8 Choose a number between 1 and 8 and multiply that number by 2. Multiply this product again by 5. Subtract 5 from the most recent result, then add 7 to get your final answer. The first digit of the answer will be your original number, and the second digit will be 2. For example, let’s say the original number is 7. 7 x 2 = 14 → 14 x 5 = 70 → 70 - 5 = 65 → 65 + 7 = 72. In the number 72, 7 was your original number, and the second digit is 2 ."
    },
    {
      "title": "Trick #10: Think of a number between 1 and 6",
      "content": "Trick #10: Think of a number between 1 and 6 Select a number between 1 and 6 and multiply that number by 9. Take that result and multiply it by 111, and then multiply that result by 1001. Finally, divide your most recent result by 7 to get the final answer. The final answer will always contain some combination of the numbers 1, 2, 4, 5, 7, and 8. For example, let’s say the original number is 3. 3 x 9 = 27 → 27 x 111 = 2997 → 2997 x 1001 = 2,999,997 → 2,999,997 ÷ 7 = 428,571 . You may need a calculator to do the division and multiplication of these large numbers."
    },
    {
      "title": "Trick #11: Think of any even number and multiply it by 6",
      "content": "Trick #11: Think of any even number and multiply it by 6 Choose any even number and multiply it by 6. The last digit of your result will end with the same digit as your original number. The digit in the ten’s place of the original number will be half of the digit in the one’s place. For example, let’s say that the original number is 12 (but you didn’t know that). The final result will be 72 (12 x 6 = 72). Working backwards, you know that the last digit of the original number is 2. That gives you a final result of _2. You also know that the original number’s ten’s place digit will be half of its one’s place digit. Because you now know that the digit in its one’s place is two, then the digit in the ten’s place must be 1. You now have the original number: 12."
    },
    {
      "title": "Trick #12: Think of a 3-digit number that repeats the same digit",
      "content": "Trick #12: Think of a 3-digit number that repeats the same digit Come up with a 3-digit number that’s made up of the same repeated digits (e.g., 333, 444, 555). Add each digit together and find their sum. Divide the original number by the sum of its digits to get the final result. [5] X Research source The final result will always be 37 . For example, say the original number was 222 . 2 + 2 + 2 = 6 → 222 ÷ 6 = 37 . You may need a calculator or piece of paper and pencil to complete the long division in this trick."
    },
    {
      "title": "Trick #13: Think of a 6-digit number with two repeating 3-digit numbers",
      "content": "Trick #13: Think of a 6-digit number with two repeating 3-digit numbers Choose a six-digit number that’s composed of two repeating three-digit numbers (e.g., 291,291, 483,483, 102,102). Divide the number by 7, then again by 11, and a third time by 13. The final answer will be the three-digit number that’s repeated in the original six-digit number. For example, let’s say the starting number is 146,146. 146,146 ÷ 7 = 20,878 → 20,878 ÷ 11 = 1,898 → 1,898 ÷ 13 = 146 You may need a calculator or piece of paper and pencil to do the long division in this trick."
    },
    {
      "title": "Trick #14: Multiply the first digit in your age by 5",
      "content": "Trick #14: Multiply the first digit in your age by 5 Add 4 to your answer, then double this most recent sum. To this doubled number, add the second digit of your age. Subtract 8 from this number to get your real age. [6] X Research source For example, say that you are 32 years old. 3 x 5 = 15 → 15 + 4 = 19 → 19 x 2 = 38 → 38 + 2 = 40 → 40 - 8 = 32 . Note that this trick only works if you’re between 10 and 99 years of age. A variation on this trick asks you to follow these steps instead: double your age, add 2, multiply by 5, and subtract 10. This calculation will give you your age with a zero added at the end."
    },
    {
      "title": "Multiplying any two-digit number by 11 in your head",
      "content": "Multiplying any two-digit number by 11 in your head Visualize the two-digit number you want to multiply by 11. Separate the two digits in your mind. Add the two digits togethers to get a sum. [7] X Research source If the sum is equal to or lesser than 9, place the sum in between the two digits to get your final result. If the sum is greater than 9, put the sum’s one’s digit in the space and carry the ten’s digit to be added to the first digit in your original number. Now you have your final result. For example, let’s say the original number is 72. 7 + 2 = 9 → 7 9 2 → 792 = 72 x 11 . In another example, let’s say the original number is 57. 5 + 7 = 12 → 5 12 7. Because 12 is greater than 9, you must put the 2 in the space between the digits then add together 1 and 5. Your final result will be 627 = 57 x 11 ."
    },
    {
      "title": "Multiplying by 9 with your fingers",
      "content": "Multiplying by 9 with your fingers Place both hands in front of you with all fingers extended. To multiply 9 by a given number, count from the left and fold down the finger that corresponds with that number (e.g., your left pinky would be 1 and your right ring finger would be 9). Count the fingers on either side of the folded finger to get your result. [8] X Research source For example, say you want to multiply 9 by 5. Fold down the fifth finger from the left—your left thumb. You now have four fingers to the left of your folded thumb, and five fingers to the right. The answer is 45."
    },
    {
      "title": "Dividing large numbers in your head",
      "content": "Dividing large numbers in your head If you want to divide a large number and would normally have to use a calculator, try these handy division tricks instead! These divisibility shortcuts may help you do the math more easily in your head: [9] X Research source A number is divisible by 2 if the last digit is a multiple of 2 (e.g., 210). A number is divisible by 3 if the sum of the digits is divisible by 3 (e.g., 522). A number is divisible by 4 if the last two digits are divisible by 4 (e.g., 2540). A number is divisible by 5 if the last digit is 0 or 5 (e.g., 9905). A number is divisible by 6 if it passes the rules for both 2 and 3 (e.g., 408). A number is divisible by 9 if the sum of the digits is divisible by 9 (e.g., 6390). A number is divisible by 10 if the number ends in a 0 (e.g., 8910). A number is divisible by 12 if it passes the rules for both 3 and 4 (e.g., 180). For example , if you’re trying to divide 210 books into equal groups, the books can be evenly distributed into groups of 2, 3, 6, and 10."
    },
    {
      "title": "Memorizing the first seven digits of pi",
      "content": "Memorizing the first seven digits of pi To memorize the first seven digits of pi, all you need to do is memorize the sentence “How I wish I could calculate pi.” Count the number of letters in each word of the sentence and place them in order to get the first seven digits of pi, which are 3.141592. “How” has 3 letters, “I” has 1, “wish” has 4, “I” has 1, “could” has 5, “calculate” has 9, and “pi” has 2. If you have a really great memory, try adding to this sentence to memorize more digits of pi!"
    },
    {
      "title": "Paper Cards Trick",
      "content": "Paper Cards Trick Ahead of time, write the numbers 1-5 in the center of five blank pieces of paper. On each respective card, write the following digits around the center number: Card #1 (12611 & 1378), Card #2 (11910 & 12714), Card #3 (13910 & 11814), Card #4 (13912 & 1478), Card #5 (12611 & 141013). Lay your cards out on a table or flat surface before beginning your trick. [10] X Research source Ask someone to think of a number between 1 and 14. Instruct them to point to the cards that their secret number appears on. Once they’ve pointed to their cards, look at the cards they’ve chosen and silently add together the center number in each one to get their secret number. For example, let’s say they chose the number 10. They would then point to card 2, 3, and 5—all of which feature the number 10. Adding together 2 + 3 + 5 gives you 10, revealing their secret number."
    },
    {
      "title": "Dice Trick",
      "content": "Dice Trick Close your eyes and ask someone to roll two dice without telling you which numbers they land on. Ask them to multiply the number on the first die by 2, then add 5 and then multiply by 5. Then, tell them to add the number from the second die to this product and tell you their final result. In your head, subtract 25 from the final result. This will give you a two digit number—the first digit is the number of the first die, and the second digit is the number of the second die. For example, let’s say the person rolled a 4 and a 6. 4 x 2 = 8 → 8 + 5 = 13 → 13 x 5 = 65 → 65 + 6 = 71 → 71 - 25 = 46, giving you 4 ( 4 6) and 6 (4 6 ) as the two rolled numbers."
    }
  ]
}