{
  "url": "https://www.wikihow.com/Difficult-Riddles-for-Adults",
  "title": "The Hardest & Most Difficult Riddles for Adults",
  "steps": [
    {
      "title": "",
      "content": "Which weighs more, a pound of feathers or a pound of bricks? Answer: Neither! They both weigh a pound."
    },
    {
      "title": "",
      "content": "The person who makes it sells it. The person who buys it never uses it. The person who uses it never knows they’re using it. What is it? Answer: A coffin."
    },
    {
      "title": "",
      "content": "If you’re running a race and pass the person in second place, what place are you in? Answer: Second place."
    },
    {
      "title": "",
      "content": "What can travel around the world while staying in a corner? Answer: A stamp."
    },
    {
      "title": "",
      "content": "The more you take, the more you leave behind. What are they? Answer: Footsteps."
    },
    {
      "title": "",
      "content": "What’s something that never waits but always keeps moving? Answer: Time."
    },
    {
      "title": "",
      "content": "Yesterday is always before today. But there is a place where yesterday follows today. Where is that? Answer: The dictionary."
    },
    {
      "title": "",
      "content": "What has roots that nobody sees, is taller than trees, up, up it goes, and yet never grows? Answer: A mountain."
    },
    {
      "title": "",
      "content": "I’m not alive, but I can grow. I don’t have lungs, but I need air. What am I? Answer: Fire."
    },
    {
      "title": "",
      "content": "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps? Answer: A river."
    },
    {
      "title": "",
      "content": "My mother is water. My father’s the sky. I’m gray when wet and white when dry. What am I? Answer: A cloud."
    },
    {
      "title": "",
      "content": "You throw away the outside and cook the inside. Then you eat the outside and throw away the inside. What did you eat? Answer: Corn."
    },
    {
      "title": "",
      "content": "You see a boat full of people. It hasn’t sunk, but when you look again, you don’t see a single person on the boat. Why? Answer: All the passengers were married."
    },
    {
      "title": "",
      "content": "What asks no questions but must be answered? [1] X Research source Answer: A phone."
    },
    {
      "title": "",
      "content": "What has one head, one foot, and four legs? Answer: A bed."
    },
    {
      "title": "",
      "content": "If two’s company and three’s a crowd, what are four and five? Answer: Nine."
    },
    {
      "title": "",
      "content": "I am a three-digit number. My tens digit is five more than my ones digit. My hundreds digit is eight less than my tens digit. What number am I? Answer: 194."
    },
    {
      "title": "",
      "content": "When you multiply me by any other number, the answer will always be the same. What number am I? [2] X Research source Answer: Zero."
    },
    {
      "title": "",
      "content": "I am an odd number. Take away one letter, and I become even. What number am I? Answer: Seven."
    },
    {
      "title": "",
      "content": "If there are four apples and you take away three, how many do you have? Answer: Three."
    },
    {
      "title": "",
      "content": "I am one with a couple of friends. Quarter a dozen, and you’ll find me again. What number am I? Answer: Three."
    },
    {
      "title": "",
      "content": "In two years, Tom will be twice as old as he was 5 years ago. How old is Tom? Answer: Twelve."
    },
    {
      "title": "",
      "content": "How many times can you subtract 10 from 100? Answer: Once. After the first subtraction, you have 90."
    },
    {
      "title": "",
      "content": "A farmer has 10 sheep, and all but 9 die. How many sheep are left? [3] X Research source Answer: Nine."
    },
    {
      "title": "",
      "content": "How many sides does a circle have? Answer: Two. The inside and the outside."
    },
    {
      "title": "",
      "content": "I say that 6 + 7 = 1. How can that be? [4] X Research source Answer: 6 AM + 7 hours is 1 PM."
    },
    {
      "title": "",
      "content": "When David was eight, his little brother was half his age. David is 30 now. How old is his brother? Answer: 26."
    },
    {
      "title": "",
      "content": "Two fathers and two sons make wooden chairs. If each makes a wooden chair, why are there only three produced? Answer: There are only three people—a father, his son, and his son’s son."
    },
    {
      "title": "",
      "content": "Bees love geometry. What’s their favorite figure? Answer: A hexagon."
    },
    {
      "title": "",
      "content": "I’m a place in a city, but I am also a math problem solution. The math problem is: What should you multiply by six to get a cube? Answer: Times Square."
    },
    {
      "title": "",
      "content": "What word has three consecutive double letters? Answer: Bookkeeper."
    },
    {
      "title": "",
      "content": "Which word, when written in all capital letters, looks the same when looked at upside down? Answer: SWIMS."
    },
    {
      "title": "",
      "content": "What has only two words but thousands of letters? Answer: The post office."
    },
    {
      "title": "",
      "content": "What word is spelled the same forwards, backward, and upside down? Answer: NOON."
    },
    {
      "title": "",
      "content": "What five-letter word becomes shorter when you add more letters to it? Answer: Short."
    },
    {
      "title": "",
      "content": "What word has 10 letters and starts with gas? Answer: Automobile."
    },
    {
      "title": "",
      "content": "What building has the most stories? Answer: The library."
    },
    {
      "title": "",
      "content": "What room do ghosts avoid? Answer: The living room."
    },
    {
      "title": "",
      "content": "What has keys but can’t open locks? Answer: A piano."
    },
    {
      "title": "",
      "content": "What has hands but can’t clap? Answer: A clock."
    },
    {
      "title": "",
      "content": "I can be cracked, made, told, and played. What am I? Answer: A joke."
    },
    {
      "title": "",
      "content": "I’m tall when I’m young and short when I’m old. What am I? Answer: A candle."
    },
    {
      "title": "",
      "content": "What has to be broken before you can use it? Answer: An egg."
    },
    {
      "title": "",
      "content": "What gets sharper the more you use it? Answer: Your brain."
    },
    {
      "title": "",
      "content": "What can you catch but not throw? [5] X Research source Answer: A cold."
    },
    {
      "title": "",
      "content": "What can’t be seen, felt, heard, or smelt? It lies behind stars and under hills, and empty holes fill it. Answer: The dark."
    },
    {
      "title": "",
      "content": "What can be broken but is never held? Answer: A promise."
    },
    {
      "title": "",
      "content": "I have no mouth, no ears, and I speak without hearing. Thought makes me come alive even when I have no body. Who am I? [6] X Research source Answer: A mind."
    },
    {
      "title": "",
      "content": "You will die if you eat me. I am more powerful than God and more evil than Satan. The poor have me, and the rich need me. Who am I? Answer: Nothing."
    },
    {
      "title": "",
      "content": "The more you look at me, the less you see. What am I? Answer: Darkness."
    },
    {
      "title": "",
      "content": "Consistently developing, yet never lives; looks for reality, yet isn’t alive? Answer: Information."
    },
    {
      "title": "",
      "content": "What is known by all but seen by none, consistently present, yet never here? Answer: The current second."
    },
    {
      "title": "",
      "content": "What exists without presence, and can be found but never looked for? Answer: Bliss."
    },
    {
      "title": "",
      "content": "What is continuously moving but never leaves? Answer: Breath."
    },
    {
      "title": "",
      "content": "I am always hungry but must always be eaten. The more I am fed, the more I grow. What am I? Answer: Knowledge."
    },
    {
      "title": "",
      "content": "Grandpa went for a walk, and it started raining. He forgot to bring an umbrella and didn’t have a hat. When he got home, his clothes were soaking wet, but not a hair on his head was wet. How was this possible? Answer: Grandpa is bald."
    },
    {
      "title": "",
      "content": "You walk into a room and see a bed. On the bed are two dogs, five cats, a giraffe, six cows, and a goose. There are also three doves flying above the bed. How many legs are on the floor? Answer: Six—the bed’s four legs and your two legs."
    },
    {
      "title": "",
      "content": "In a one-story house, the bedrooms were yellow, the kitchen was orange, the living room was red, the garage was blue, the entry hall was green, and the sitting room was purple. What color were the stairs? Answer: There are no stairs. It was a one-story house."
    },
    {
      "title": "",
      "content": "I am beautiful, up in the sky. I am magical, yet I cannot fly. To some, I bring luck, and to others, riches. The boy at my end does whatever he wishes. What am I? Answer: A rainbow."
    },
    {
      "title": "",
      "content": "I look flat, but I am deep. Hidden realms I shelter. Lives I take, but food I offer. At times, I am beautiful. I can be calm, angry, and turbulent. I have no heart but offer pleasure. No man can own me, yet I encompass what all men must have. What am I? Answer: The ocean."
    },
    {
      "title": "",
      "content": "What has 18 legs and catches flies? Answer: A baseball team."
    },
    {
      "title": "",
      "content": "What word is always spelled incorrectly? Answer: Incorrectly."
    },
    {
      "title": "",
      "content": "What has many words but never speaks? Answer: A book."
    },
    {
      "title": "",
      "content": "What has a heart that doesn’t beat? Answer: An artichoke."
    },
    {
      "title": "",
      "content": "What has ears but can’t hear? Answer: Corn."
    },
    {
      "title": "",
      "content": "I’m the only bug you can play as a sport. What am I? Answer: Cricket."
    },
    {
      "title": "",
      "content": "What gets smaller every time it takes a bath? [7] X Research source Answer: Soap."
    },
    {
      "title": "",
      "content": "What runs around the yard without moving? Answer: A fence."
    },
    {
      "title": "",
      "content": "What is at the end of a rainbow? Answer: The letter W."
    },
    {
      "title": "",
      "content": "What has 13 hearts but no other organs? Answer: A deck of cards."
    },
    {
      "title": "",
      "content": "What has four eyes but cannot see? Answer: Mississippi."
    }
  ]
}