{
  "url": "https://www.wikihow.com/Get-Rid-of-External-Hemorrhoids-Fast",
  "title": "How to Get Rid of External Hemorrhoids Fast",
  "steps": [
    {
      "title": "Take a warm bath.",
      "content": "Take a warm bath. Soaking in warm water can relieve hemorrhoid pain. Run a full bath or sitz bath (a small basin that fits over your toilet, allowing you to soak your anal area). Keep the water warm and add 1 cup of epsom salts to a full bathtub or 2 to 3 tablespoons of salts to the sitz bath. You can soak two to three times a day. [1] X Research source If you have hemorrhoids, you need to keep the area clean. Be gentle when showering, bathing, or using the toilet. You don't need to use soap, since it may irritate the area. You can apply Cetaphil lotion to calm the area without causing more irritation. Pat yourself dry with a clean towel. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use a compress.",
      "content": "Use a compress. To numb the pain, apply a cold ice pack or cold compress. Take a clean cotton washcloth and soak it in cold water. Apply the compress to your hemorrhoid for about 10 to 15 minutes. You can do this frequently throughout the day. [3] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source If you're using an ice pack, place a cloth between the ice pack and your exposed skin. Applying ice directly to the skin can damage your tissue. [4] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Use pain and itch-relieving gels or lotions.",
      "content": "Use pain and itch-relieving gels or lotions. After soaking and drying the hemorrhoid, apply a small amount of aloe vera gel, or anti-itch lotion. Look for something containing petroleum jelly, mineral oil, shark liver oil and phenylephrine. The phenylephrine acts as a decongestant and helps shrink the hemorrhoid. You can also use Aloe Vera gel to soothe hemorrhoids. [5] X Research source If the hemorrhoids are very painful or uncomfortable, apply a bit of baby teething gel to the area. Teething gels contain a local anesthetic that can reduce pain and discomfort. Avoid using steroid creams because they can damage the delicate tissue around a hemorrhoid."
    },
    {
      "title": "Relieve hemorrhoid symptoms with an astringent.",
      "content": "Relieve hemorrhoid symptoms with an astringent. Take a cotton pad and soak it in witch hazel. Place it on the hemorrhoid after you have a bowel movement. Repeat this as often as you need to, at least four or five times a day. Alternatively, place it on a pad in your underwear for longer lasting relief. [6] X Research source Witch hazel can relieve itching, discomfort, irritation, and burning caused by hemorrhoids. It may also reduce swelling. [7] X Research source"
    },
    {
      "title": "Eat more fiber.",
      "content": "Eat more fiber. Slowly add fiber to your diet, increasing in small increments since it may cause gas or bloating. While everyone needs a different amount of fiber based on calories consumed, try to get 25 grams (0.88 oz) of fiber a day if you're a female or 30 grams (1.1 oz) of fiber a day if you're a male. Fiber will soften your stools, making them easier to pass. Different fibers have different effects on your body, so aim to include more wheat bran fibers and other cereals, which are the fibers that affect stool softness. [8] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Fiber supplements can reduce hemorrhoid bleeding, irritation, and inflammation. If you feel bloated or gassy, you may be eating too much fiber. You can increase your fiber by choosing whole grains, fruits with the peel or rind, leafy greens, beans, and legumes"
    },
    {
      "title": "Eat smaller meals and drink water.",
      "content": "Eat smaller meals and drink water. Choose more nutritious, smaller meals and eat throughout the day. This will give your digestive system a chance to process the food and give your body the nutrition it needs to heal the hemorrhoid. Drink plenty of water throughout the day. [9] X Research source Fluid keeps your stools softer making them easier to pass."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Choose low-impact exercises like swimming, dancing, yoga, and walking, but avoid activities that can cause straining, such as weight-lifting. Low-impact activities have an anti-inflammatory effect on your body, which can help relieve hemorrhoid symptoms. It also keeps your body systems healthy and your bowels moving. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try pelvic floor exercises. Exercise also reduces pressure on your veins which may be contributing to hemorrhoid pain."
    },
    {
      "title": "Reduce the pressure when you sit.",
      "content": "Reduce the pressure when you sit. It may be helpful to purchase a foam cushion or a doughnut cushion to sit on. This can help relieve some of the pressure. Avoid sitting directly on hard surfaces. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Direct pressure on the hemorrhoid can increase swelling and even cause new hemorrhoids."
    },
    {
      "title": "Use the restroom on a regular basis.",
      "content": "Use the restroom on a regular basis. If it's possible, try to use the bathroom without interruptions at the same time every day. If you pass bowel movements regularly, it will reduce your need to strain. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Regular bowel movements are a great indicator of overall good health. Don't strain or push too hard. Let gravity help, but allow your bowels to do most of the work. If nothing happens, wait an hour or so and try again. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It may also help to place your feet on a small stool so that your knees are higher than your hips. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Choose the correct laxative.",
      "content": "Choose the correct laxative. Passing stools regularly is important when you have hemorrhoids. Avoid straining since this commonly causes hemorrhoids. Instead, choose a bulk laxative or stool softener to temporarily use. Bulk laxatives can soften your stools and reduce the pressure needed to pass the stool which will help the hemorrhoid start to shrink. While your stools should be regular because of the fiber in your diet, you can choose one of the following laxatives: [15] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Bulk laxatives: These contain fiber (usually psyllium) to increase the mass or weight of the stool, helping it move through the bowels. Stool softeners: These soften the stools by adding moisture which should make them easier to pass. Most stool softeners contain docusate, which is what adds the moisture to soften the stool. Lubricant laxatives: These lubricate the walls of the intestines and rectum, making the stool pass easier. Most lubricant laxatives contain mineral oil. They are usually safe when taken for short periods of time, but are not recommended for long-term use. Avoid stimulant laxatives that include senna, cascara, aloe, or bisacodyl. They work by irritating the interior of the bowel, which is not helpful when you have hemorrhoids."
    },
    {
      "title": "Look for signs of external hemorrhoids.",
      "content": "Look for signs of external hemorrhoids. The most common symptom of external hemorrhoids is bleeding and discomfort during a bowel movement. You may first notice external hemorrhoids when you clean yourself after using the restroom. A hemorrhoid will be a tender swelling around your anus often about the size and shape of a grape when it first appears. It can also be itchy and painful. Commonly, people notice blood on the toilet paper or in the toilet bowl. [16] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you're unsure if you have internal or external hemorrhoids, consider what you can feel. You won’t usually feel internal hemorrhoids, but they can bulge through the anal opening. Typically internal hemorrhoids have few symptoms other than bleeding with bowel movements."
    },
    {
      "title": "Know when to see a doctor.",
      "content": "Know when to see a doctor. Most external hemorrhoids go away or at least shrink within two to three days. If you still have hemorrhoids after three to five days, call your physician. You should also contact your doctor if the area is painful or bleeds. Your doctor can diagnose internal or external hemorrhoids by doing a rectal exam. [17] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source If rectal bleeding is not caused by a hemorrhoid, your doctor will probably recommend a more extensive test called a sigmoidoscopy or a colonoscopy because one of the symptoms of colon cancer is rectal bleeding."
    },
    {
      "title": "Get medical treatment.",
      "content": "Get medical treatment. If your hemorrhoids don't respond to basic home care or resolve on their own, your doctor may recommend a minimally invasive surgery. The most common approaches include: [18] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source Ligation: A rubber band is tied around the base of the hemorrhoid to cut off blood flow. Injection (sclerotherapy): A chemical solution designed to shrink the hemorrhoid is injected. Cauterization: The hemorrhoid is burned away. Hemorrhoidectomy: The hemorrhoid is surgically removed in this outpatient procedure (although it sometimes requires an overnight hospital stay)."
    }
  ]
}