{
  "url": "https://www.wikihow.com/Cook-in-a-Microwave-Oven",
  "title": "Microwave Cooking 101: Everything You Need to Know",
  "steps": [
    {
      "title": "Separate foods by cooking time.",
      "content": "Separate foods by cooking time. Some foods take much longer than others to cook. Specifically, larger and thicker foods will need longer than thinner and smaller foods. To prevent large food from undercooking and small food from overcooking, separate the food and cook it separately in the microwave oven. [1] X Research source Starchy vegetables like potatoes and sweet potatoes tend to need the longest cooking time, followed by meat, and then smaller vegetables need the shortest time."
    },
    {
      "title": "Cut up large food to speed up cooking time.",
      "content": "Cut up large food to speed up cooking time. You can decrease the time a food needs to cook in the microwave by cutting it into smaller portions. Large chunks of meat, for instance, will cook faster if you cut them into strips or smaller portions first. Foods you may want to chop before cooking include potatoes (unless you're baking them), other large vegetables, and large cuts of meat."
    },
    {
      "title": "Pierce foods that have a skin.",
      "content": "Pierce foods that have a skin. Foods that have skins can hold in steam, and if there's nowhere for the steam to vent, the food may pop open or splatter. To prevent this, use a fork or sharp knife to poke a few holes in foods with skins, including: [2] X Research source Sausages Potatoes Sweet potatoes Hot dogs"
    },
    {
      "title": "Arrange the food properly on a microwave-safe dish.",
      "content": "Arrange the food properly on a microwave-safe dish. Find a microwave-safe dish or plate for cooking. Spread the food out in a single layer with the thickest part of the food facing away from the center of the dish. This will ensure even cooking time, because food around the outer edges will cook faster than food closer to the center. [3] X Research source Microwave-safe dishes will be labeled as such, but glass and ceramic are usually safe to microwave, even if they aren't labelled. [4] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Don’t microwave metal containers or utensils."
    },
    {
      "title": "Cover your food before cooking it.",
      "content": "Cover your food before cooking it. For microwave dishes that have lids, put the lid on the dish and leave a crack open for steam to escape. Otherwise, cover the dish with a damp towel or paper towel. Covering food in a microwave is important for a number of reasons, including that it: Helps to ensure even cooking Keeps the food moist and prevents it from drying out [5] X Research source Prevents the food from splattering"
    },
    {
      "title": "Cook food in short intervals and stir regularly.",
      "content": "Cook food in short intervals and stir regularly. Close the door of the microwave. To set the microwave, you may have to select Cook Time, then set the timer, and then press Start. Cook small vegetables in one-minute intervals, larger veggies in two-minute intervals, and meat in three-minute intervals. Stir between each cooking session to distribute the heat. [6] X Research source"
    },
    {
      "title": "Let food stand before serving.",
      "content": "Let food stand before serving. Once your food is cooked, close the microwave door and leave the food in there to rest. This will give the food time to complete the cooking process. Vegetables and casseroles should stand for five to 10 minutes, and meat will need 10 to 15."
    },
    {
      "title": "Decrease liquids by half.",
      "content": "Decrease liquids by half. Less evaporation occurs in the microwave than with other cooking methods, so you need less water. When you cook a recipe in the microwave that wasn’t designed for the microwave, reduce the liquid in the recipe by about one-half. [7] X Research source This includes soups, stews, and other recipes that have water as an ingredient."
    },
    {
      "title": "Cut seasonings in half.",
      "content": "Cut seasonings in half. Cooking food in the microwave brings out the flavor of any spices you use, so you don’t need as much salt, herbs, and seasonings. To adjust recipes, cut the salt and seasoning quantities in half. Before serving your dish, test it for flavor and add more spices if necessary. [8] X Research source"
    },
    {
      "title": "Cut your cooking time by a quarter.",
      "content": "Cut your cooking time by a quarter. Microwaves also cook food faster than other methods do, so you'll need to adjust the cooking time for non-microwave recipes. A good rule of thumb is to cut the cooking time by a quarter. After that time, test the food for doneness, and add more time if necessary."
    },
    {
      "title": "Don’t use oil to brown foods.",
      "content": "Don’t use oil to brown foods. When you cook recipes that were designed for other cooking methods, you may have to make some adjustments to cook them in the microwave. That includes omitting the oil from recipes that call for meat or vegetables to be seared or browned in a pan with oil. Foods don’t brown in the microwave the way they do in a pan, so the oil is unnecessary, and may change the flavor of the dish. [9] X Research source"
    },
    {
      "title": "Cook meat on medium power.",
      "content": "Cook meat on medium power. It is possible to cook meat in the microwave, but you have to adjust the approach. Start with meat that’s room temperature. Pat it dry to remove excess moisture. Season with a bit of salt and pepper, if desired. Place the meat on a microwave-safe plate and cook it on medium for five to seven minutes. Flip the meat once during the cooking time. Don’t use any oil to brown the meat, as microwaves cannot brown food. [10] X Research source"
    },
    {
      "title": "Toast nuts for up to eight minutes.",
      "content": "Toast nuts for up to eight minutes. Toasting nuts is better in the oven or in a pan, but you can use the microwave to do this as well. Spread the nuts out in a single layer on a microwave-safe plate. Toast the nuts on high for six to eight minutes, but stop the microwave every minute to stir them. [11] X Research source Smaller nuts like pine nuts may be done after six minutes, but larger nuts, such as walnuts, will need more time. Cut the baking time by a quarter, and add extra time if necessary."
    },
    {
      "title": "Cook rice for nine minutes.",
      "content": "Cook rice for nine minutes. Rinse a cup (195 g) of rice under running water. Transfer the drained rice to a microwave dish. Add enough water to cover the rice with an inch (2.5 cm) of liquid. Cover the dish with a lid or damp towel and microwave the rice for nine minutes. After nine minutes, let the rice stand for three minutes before serving. [12] X Research source"
    },
    {
      "title": "Defrost foods at a reduced power level.",
      "content": "Defrost foods at a reduced power level. Microwaves are ideal for safely defrosting frozen foods. Place your frozen food on a microwave-safe plate and heat it using the defrost setting. This will heat the food using only 30 to 40 percent of the power, and will thaw the food rather than cooking it. Defrosting will require seven to eight minutes per pound of frozen food. [13] X Trustworthy Source Michigan State University Extension Extension program of Michigan State University focused on community outreach, education, and engagement Go to source"
    },
    {
      "title": "Steam foods in short intervals.",
      "content": "Steam foods in short intervals. The microwave is ideal for steaming vegetables and other foods. Cut your veggies into equal chunks. Place the chunks into a microwave dish, along with a tablespoon (15 ml) of water. Cover the dish with a slightly open lid or damp towel. Microwave the veggies in two-minute intervals until cooked. [14] X Research source Stir the veggies between intervals to ensure even cooking."
    }
  ]
}