{
  "url": "https://www.wikihow.com/Discord-Won%27t-Open",
  "title": "How to Fix Discord if It Won't Open or Launch",
  "steps": [
    {
      "title": "There may be a temporary outage preventing Discord from starting normally.",
      "content": "There may be a temporary outage preventing Discord from starting normally. You can check if Discord is down at https://discordstatus.com . Occasionally, the Discord servers need to be temporarily taken offline for maintenance or to fix technical issues. If Discord is down, you will need to wait until it is back up."
    },
    {
      "title": "Discord may be running in the background.",
      "content": "Discord may be running in the background. Discord opens automatically upon startup by default. Sometimes, you may try to close it, but it leaves an inactive process in the background that prevents it from opening a new session. You can force-quit any inactive processes that are still running on your PC or Mac: Windows: Press Ctrl + Alt + Del . Click Task Manager . Click the Processes tab. Click any process having to do with Discord. Click End Task Mac: Press Option + Command + Esc . Select Discord . Click Force Quit ."
    },
    {
      "title": "A minor glitch could prevent Discord from opening.",
      "content": "A minor glitch could prevent Discord from opening. You can fix minor glitches by restarting your computer. Try to launch Discord again after restarting your computer."
    },
    {
      "title": "Your system date and time might not be syncing up with the servers.",
      "content": "Your system date and time might not be syncing up with the servers. If your computer's date and time aren't synced with Discord's servers, you may not be able to open the app normally. To ensure your date and time are set correctly: Windows: Press Windows key + I to open the Settings menu. Click Time & Language . Ensure \"Set time zone automatically\" and \"Set time automatically\" are turned on. Then click Sync Now . Mac: Click the Apple icon followed by System Settings (or System Preferences ). Click Date & Time . Ensure \"Set Date & Time automatically\" and \"Set time zone automatically using your current location\" are turned on."
    },
    {
      "title": "Your cache may be corrupt.",
      "content": "Your cache may be corrupt. The cache contains temporary files that are meant to help programs run more smoothly. However, over time, you may start to run out of storage space, or you may have some corrupt cache files. You will need to clear the cache to fix this problem. Use one of the following steps to do so: Windows: Press Windows key + R to open Run. Type \"%appdata%\" into Run and click Ok . Select the \"Discord\" folder and press the Delete key. Then enter \"%localappdata%\" into Run and press Enter . Select \"Discord\" and click Ok . Select the \"Discord\" folder and press the Delete key. Mac: Open the Finder and click Go in the menu bar at the top. Click Go to Folder . Enter \"~/Library/Application Support/discord/\" and press Return . Drag the \"Cache,\" \"Code Cache,\" and \"GPUCache\" folders to the Trash bin."
    },
    {
      "title": "Your session may need to be reset.",
      "content": "Your session may need to be reset. Logging in to Discord using a web browser resets your Discord session. Then, you can try logging in with the app again. If the app doesn't work but the web version does, you can log in to Discord through a web browser. You can log in to the Discord web app at https://discord.com/app ."
    },
    {
      "title": "Your computer may have malware.",
      "content": "Your computer may have malware. Viruses and malware can prevent applications like Discord from opening or running properly. You can run a virus scan using a third-party antivirus program , or you can use Windows Security to scan for viruses. Use one of the following steps to do so: [1] X Research source Windows: Click the Windows Start menu and type \"Windows Security\". Click Windows Security and go to Virus & threat protection > Quick Scan or Scan Now . Mac: Viruses and malware aren't as huge of problems on Mac because of its Unix-based operating system and the way it only allows you to install apps from the App Store or identified developers by default. Therefore, Macs don't have built-in antivirus protection. However, they are not immune to viruses and malware. If you suspect your Mac is infected with malware, you can scan for viruses using third-party antivirus software , such as Malwarebytes."
    },
    {
      "title": "There may be a problem with the Discord installation.",
      "content": "There may be a problem with the Discord installation. You can generally fix problems with the app by reinstalling it. If you download the latest version from the website, you will also be downloading the latest version of the app, which will have any known bugs and glitches fixed. You can download Discord at https://discord.com/download ."
    },
    {
      "title": "Windows or macOS may be out of date.",
      "content": "Windows or macOS may be out of date. Updating your system will fix any known bugs and security flaws in your operating system. It can also help apps like Discord run more smoothly. Use one of the following steps to update your system: Windows: Click the Windows Start button, type \"Windows Update,\" and click Check for Updates . Click Check for Updates in the Update menu and click Install all for any updates that are available. Mac: Click the Spotlight search icon and type \"Software Update\" into the search bar. Click Software Update . Then click Update Now or Upgrade Now . [2] X Research source"
    },
    {
      "title": "Damaged or corrupt files could prevent Discord from opening.",
      "content": "Damaged or corrupt files could prevent Discord from opening. You can scan for broken files using the Command Prompt on Windows. On Mac, you can use Disk Utility to scan for disk errors. Windows: Click the Windows Start menu and type \"CMD.\" Right-click the Command Prompt and click Run as Administrator . Type \"sfc /scannow\" and press Enter . Mac: Click the Spotlight search icon and type \"Disk Utility\" into the search bar. Select your disk partition in the menu to the left (usually called \"Macintosh HD\"), click First Aid , then click Run ."
    },
    {
      "title": "Your proxy settings may be blocking Discord.",
      "content": "Your proxy settings may be blocking Discord. Sometimes, Discord doesn't work well with VPN and proxy settings. You can change your proxy settings in the Windows Control Panel or the Mac System Settings menu. Use the following steps to do so: Windows: Click the Windows Start menu and type \"Control Panel.\" Click Control Panel and go to Hardware and Sound > Internet Options > Connections tab. Click LAN Settings , click the checkbox next to \"Automatically detect settings,\" and uncheck the box next to \"Use Proxy Server for your LAN.\" Mac: Click the Apple icon followed by System Settings (or System Preferences ). Click Network and select your active network. Click Details followed by Proxies and uncheck or turn off \"Auto proxy discovery,\" \"Auto proxy configuration,\" and \"Web proxy.\" Click Ok ."
    },
    {
      "title": "Your DNS cache could be preventing Discord from connecting.",
      "content": "Your DNS cache could be preventing Discord from connecting. Luckily, this is a pretty easy answer to fix. Use one of the following steps to reset your DNS settings: Windows: Click the Windows Start menu type \"CMD.\" Right-click the Command Prompt and click Run as Administrator . Type \"ipconfig /flushdns\" and press Enter . Mac: Click the Spotlight search icon and enter \"Terminal\" into the search bar. Click Terminal and type \"sudo dscacheutil -flushcache; sudo killall -HUP mDNSResponder\" and press Return . Enter your login password and press Enter . If you are using an older version of macOS, you will need to use a different command to reset your DNS settings ."
    }
  ]
}