{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Musty-Smell-in-Your-House",
  "title": "How to Remove & Prevent Musty Smells in a House",
  "steps": [
    {
      "title": "Locate the source of the smell.",
      "content": "Locate the source of the smell. The first step to getting rid of a musty smell is to find its source. Begin by looking for signs of mildew or mold in areas like your bathroom, kitchen, basement, and attic, as these areas are usually where you’ll find the most moisture. Check other rooms like your living room and bedrooms, as well. Look for any leaks or standing water. Here are some tips for checking specific areas of your house: [1] X Research source Bathrooms: Check the tiles in your shower, under the sink, around the toilet, on the walls, and behind small items like soap and shampoo. Kitchen: Check inside, around, and underneath your refrigerator, underneath your sink, inside your microwave and oven, and in and around your trash can. Bedrooms: Check for mold on your mattress, along your windows and windowsills, and in any potted plants you have. Living room: Check your windows, your furniture, and your fireplace if you have one. Attic, basement, and garage: Check in your insulation, around your water heater and furnace, near vents, around windows, and behind storage areas. Other areas in your home: Check for mold in your air conditioning and heating ducts, inside and around your washer and dryer, and in the walls and ceilings around your home."
    },
    {
      "title": "Repair any leaks or broken pipes.",
      "content": "Repair any leaks or broken pipes. Cracked or broken pipes can cause water leakage, which will eventually lead to mold and mildew growth. Check all the faucets and pipes in your home for potential leaks, then fix them yourself or call a plumber for some help. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Clean mold and mildew with bleach.",
      "content": "Clean mold and mildew with bleach. If there’s mold or mildew in your house, this is likely where the musty smell is coming from. To remove small areas of mold, mix 1 cup (240 mL) of bleach with 1 gallon (3.8 L) of water. Apply the solution to the moldy or mildewy surface and scrub it with a brush. Rinse the surface with clean water to remove the solution, then let it air dry. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Bleach can produce strong fumes, so work in a well-ventilated area and wear an N-95 mask , if possible. Wear gloves and goggles to protect your skin and eyes, and never mix bleach with other cleaning products. If you want a more natural solution, spray the moldy area with white vinegar instead. Let it sit for about an hour, then scrub the mold or mildew away with a sponge or cloth dipped in baking soda."
    },
    {
      "title": "Increase air circulation.",
      "content": "Increase air circulation. Sometimes, musty smells occur because the air in your home is too humid and still. Increase air circulation by turning on your ceiling fan to dry out the air and eliminate the smell. Open your doors and windows to completely air out the space and let some fresh air into your home. Keeping your home properly ventilated should remove the smell over time. If you don't have a ceiling fan, keep a box fan running where the smell is particularly strong, or turn on a few throughout your home. Starting your HVAC system can also draw out odors and capture mold spores in its filters. Just make sure the filters are clean first. Before attempting to eliminate the musty smell, Olin stresses, “Make sure that mold is not what is causing your issue, because that’s a health hazard that needs to be addressed immediately.” If you’ve already eliminated the source of the smell, proceed with removing the odor from your home. [4] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021."
    },
    {
      "title": "Use a dehumidifier.",
      "content": "Use a dehumidifier. High humidity levels can make a house smell musty. Install a dehumidifier and aim to keep the humidity level at 50%. This helps keep the air nice and dry and eliminate musty odors. Just make sure the humidity level is never over 60%, as this is when mold and mildew begin to thrive. [5] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source"
    },
    {
      "title": "Buy an air purifier.",
      "content": "Buy an air purifier. Air purifiers remove smelly air pollutants like mold, pollen, dander, and dust. For best results, use a true HEPA filter . Replace the filter regularly to keep the machine working as efficiently as possible. Keep the air purifier in your living room or anywhere in your home that smells particularly musty. [6] X Research source Air purifiers cost about $50-100 a year to run and maintain. You can also use a HEPA filter when changing the filtration system of your AC and other HVAC equipment in your home. This can keep the air in your house cleaner than a standard filter and can improve the smell as well."
    },
    {
      "title": "Deep clean carpets and upholstery.",
      "content": "Deep clean carpets and upholstery. Sometimes, mold spores can linger in carpets and on upholstered furniture, causing a musty smell. Rent a steam cleaner to clean your carpets and steam your upholstery , or hire a professional to do the work for you. [7] X Research source"
    },
    {
      "title": "Use baking soda or activated charcoal to absorb odor.",
      "content": "Use baking soda or activated charcoal to absorb odor. There are plenty of natural odor absorbers that can help eliminate musty smells around your home. Pour some baking soda or activated charcoal into bowls and place them throughout your home, especially where the odor is most noticeable. Replace them every two weeks or so as they absorb the odor to get your home smelling fresh. [8] X Research source Another alternative is to use kitty litter. Additionally, add pleasing scents to your home by lighting candles or using essential oil diffusers or commercial air fresheners. This will only mask the odor, however, so make sure to eliminate it first."
    },
    {
      "title": "Wash your pet’s bedding.",
      "content": "Wash your pet’s bedding. Pet bedding can get pretty smelly and musty after a while, especially if your pet goes outside and tracks mud and water into their bed. That moisture seeps into the bedding and contributes to mold growth. To avoid this, wash your pet beds and blankets regularly, and clean up after your pets as soon as possible. Follow the instructions on the bedding’s care label to wash it properly. Most of the time, you can simply wash and dry it like standard bedding."
    },
    {
      "title": "Call a professional if there’s a lot of mold or mildew.",
      "content": "Call a professional if there’s a lot of mold or mildew. According to the EPA (Environmental Protection Agency), you should hire a professional for mold remediation if the moldy area is larger than 10 square feet or if there is significant water damage. It’s also generally best to hire a professional if the mold is in a hidden or hard-to-reach area, like in your heating or air conditioning system. If you or someone in your household is allergic to mold, it’s also better to have someone else clean it for you. [9] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Musty smells are usually caused by mold or mildew.",
      "content": "Musty smells are usually caused by mold or mildew. Mold and mildew grow and spread when there is an excessive amount of moisture in a given area. This can be caused by a leaky pipe or roof, inadequate airflow in a humid space, or dirt and debris getting stuck in an HVAC system. When mold spores begin to multiply, they emit a musty smell. Olin says, “You should always be wary of mold when trying to identify a musty smell. Often, that’s the source of the kinds of smells that people refer to as musty. Have a mold expert come out and actually do an inspection, as some kinds of mold can be hazardous to your health in the long term. [10] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021."
    },
    {
      "title": "Clean and declutter your home weekly.",
      "content": "Clean and declutter your home weekly. To prevent mold growth and musty smells, clean your house regularly to take care of any problem areas before they become an issue. Sweep, mop, and vacuum your floors, dust walls and surfaces, and organize any belongings that may trap moisture, like books or piles of paper. [11] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source Be very thorough with humid areas like your bathroom and kitchen. Remember to clean your garbage disposal and your dishwasher filter , if you have them. Spot clean dirty areas on rugs or carpets by sprinkling baking soda on the area. Let it sit for about an hour, then vacuum it up. Clean your washing machine once in a while, too, by tossing in a couple teaspoons of baking soda and running a hot wash cycle. This is especially important if your clothes also have a musty smell . Olin says, “Hire a maid service to regularly clean your home if you’re not the type of person who consistently [vacuums or cleans] the bathrooms and kitchens on a regular basis.” [12] X Expert Source Daniel Olin Home Cleaning Specialist Expert Interview. 12 October 2021."
    },
    {
      "title": "Clean up spills and standing water immediately.",
      "content": "Clean up spills and standing water immediately. When water leaks or spills occur, clean them up as soon as possible. In general, mold and mildew won’t grow if the spill is cleaned and dried within 24-48 hours, so it’s less likely the area will develop a musty smell. Remember to clean up after your pets, as well. [13] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Keep humidity levels low.",
      "content": "Keep humidity levels low. If possible, keep your indoor humidity levels below 60%. Running an air conditioner or dehumidifier can help, as can opening windows and using fans. Turn on exhaust fans in moist areas, like bathrooms and kitchens, and if possible, dry your clothes outside to avoid adding moisture to your home. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Ensure your home has proper air circulation.",
      "content": "Ensure your home has proper air circulation. Make sure air flows freely through your home by regularly opening doors and windows to let in fresh air. Turn on ceilings or box fans, especially in rooms that don’t get a lot of foot traffic, as well as exhaust fans in your kitchen and bathroom. Using an air purifier can also help by removing pollutants and contaminants and replacing them with clean air. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Change your air filters regularly.",
      "content": "Change your air filters regularly. Over time, dirt, debris, and moisture can get stuck in your HVAC system’s filter, which can lead to mold growth and a musty smell. To prevent this, have your furnace, air conditioning, or heat pump professionally cleaned, and replace the system’s air filter regularly. How often the filter needs to be changed will depend on the system and filter you have, so refer to your user’s manual for specific instructions. [16] X Research source Have your air ducts professionally cleaned every 2-3 years."
    },
    {
      "title": "Inspect for mold and leaks several times a year.",
      "content": "Inspect for mold and leaks several times a year. How often you need to do this depends on the condition of your home, but aim to inspect all areas of your home for leaks or mold at least 4 times a year, once every quarter. Pay special attention to rooms that are humid, like your kitchen and bathroom, or that don’t receive a lot of foot traffic, like your attic or basement. Fix any leaks and clean up mold as soon as possible so the issue doesn’t worsen. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source While you’re at it, make sure all your windows are well-sealed to prevent condensation build-up."
    },
    {
      "title": "Use mold-inhibiting paints.",
      "content": "Use mold-inhibiting paints. If you plan on painting a room, first add a mold inhibitor to the paint. These can be purchased at paint and home improvement stores and help prevent the development of mold spores, making it more difficult for mold to grow on the painted surface. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Don’t simply paint over existing mold, however. Remove it first."
    },
    {
      "title": "Exposure to mold and mildew can sometimes be hazardous to your health.",
      "content": "Exposure to mold and mildew can sometimes be hazardous to your health. While some people may experience no symptoms when exposed to mold, others are more sensitive, especially if they have pre-existing conditions like asthma. Because mold and mildew can cause respiratory issues, it’s important to remove them as soon as possible. Here are some common issues caused by mold exposure: [19] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Stuffy nose Wheezing Coughing Red or itchy eyes Itchy skin Shortness of breath Fever"
    }
  ]
}