{
  "url": "https://www.wikihow.com/Cure-Stomach-Ache-with-Ginger",
  "title": "How to Cure Stomach Ache with Ginger",
  "steps": [
    {
      "title": "Wash the ginger and peel it.",
      "content": "Wash the ginger and peel it. Run the ginger root under cool water and use your fingers to gently scrub away any dirt or other materials. Then, use a potato peeler or a sharp knife to take the skin off the outside of the root. [1] X Research source The skin can affect the flavor of the tea and it won’t dissolve as well in water."
    },
    {
      "title": "Grate the ginger into small pieces.",
      "content": "Grate the ginger into small pieces. Use a cheese grater to gently grate the ginger root. Catch the pieces on a small dish or plate to use later. If you don’t have a cheese grater, you can use a sharp knife to cut the ginger into thin slices. [2] X Research source Grating the ginger will make it dissolve more easily in hot water."
    },
    {
      "title": "Add the grated ginger to 1.5 c (350 mL) of boiling water.",
      "content": "Add the grated ginger to 1.5 c (350 mL) of boiling water. Put water into your tea kettle and heat it up on the stove until it’s boiling. Pour it into a mug and place 1.5 tsp (3 g) of grated ginger into the bottom of the cup, then stir it around. [3] X Research source You can put more or less ginger into the water if you want a stronger or weaker flavor."
    },
    {
      "title": "Let the tea steep for about 3 minutes, then strain it.",
      "content": "Let the tea steep for about 3 minutes, then strain it. It won’t take long for the ginger to flavor your tea. Use a strainer to get all of the large pieces of ginger out of your cup, since they are probably too spicy to eat. [4] X Research source"
    },
    {
      "title": "Drink ginger tea when you feel nauseated.",
      "content": "Drink ginger tea when you feel nauseated. The ginger will help to settle any stomach pain you are having, while the hot water is soothing on your throat. Drink little sips at a time so you don’t overwhelm your stomach, especially if you’ve already vomited. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can safely drink 1 to 2 cups of ginger tea per day."
    },
    {
      "title": "Wash the ginger root with cool water.",
      "content": "Wash the ginger root with cool water. Use your fingers to gently scrub away any dirt or debris from your ginger root. It’s really important to remove any debris from the root before you blend it, because you won’t be peeling your ginger root. [6] X Research source"
    },
    {
      "title": "Cut the ginger into small pieces and add it to a blender.",
      "content": "Cut the ginger into small pieces and add it to a blender. Use a sharp knife and a cutting board to slice 1 ginger root into 1 ⁄ 4 inch (0.64 cm) thin pieces. You don’t need to peel the ginger root before you slice, since you’ll be blending it all up together. [7] X Research source Slicing the root makes it easier on your blender so your juice will be smoother."
    },
    {
      "title": "Cut up apples and carrots if you want extra flavor.",
      "content": "Cut up apples and carrots if you want extra flavor. Take the tops off of your carrots and slice them into 1 ⁄ 4 inch (0.64 cm) slices. Then, cut open 1 apple and remove the seeds and the core. Cut up the apple into 1 ⁄ 4 inch (0.64 cm) slices and put all of your ingredients into the blender. [8] X Research source Carrots and apples are mild enough to cut the intense flavor of ginger without upsetting your stomach."
    },
    {
      "title": "Add 1⁄2 c (120 mL) of water, then blend your ingredients.",
      "content": "Add 1 ⁄ 2 c (120 mL) of water, then blend your ingredients. Start out by pulsing your blender 2 to 3 times to break up any large chunks. Then, turn it on the lowest setting until your juice is smooth. [9] X Research source Make sure the ginger is especially well ground-up to spread out its flavor."
    },
    {
      "title": "Strain and press the mixture through a sieve.",
      "content": "Strain and press the mixture through a sieve. Catch the strained juice in a cup or a glass, and make sure that all the solid chunks of ginger are out. Use a spoon to press your mixture through the sieve to make it easier on yourself. [10] X Research source Straining your juice makes it more like a liquid and less like a smoothie."
    },
    {
      "title": "Drink your ginger juice to help with your upset stomach.",
      "content": "Drink your ginger juice to help with your upset stomach. The natural soothing remedies in ginger can help to settle your stomach and relieve nausea. Try drinking ginger juice whenever you feel like your stomach is unsettled to help with some of your symptoms. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can drink 1 to 2 cups of ginger juice per day to help with nausea."
    },
    {
      "title": "Eat some fresh ginger for an easy option.",
      "content": "Eat some fresh ginger for an easy option. Wash your ginger root with cool water and peel the skin with a potato peeler. Cut the ginger root into 1 ⁄ 4 inch (0.64 cm) thin slices, then add some salt on top. Eat the ginger plain or add it to a salad for an extra kick. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Eating plain ginger is the fastest way to get it into your stomach if you aren’t feeling well. Although ginger ale is sometimes marketed to help with stomach aches, the added sugar can be too harsh on your body and make you feel worse. Plus, ginger ale doesn’t usually have a lot of fresh ginger in it. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take ginger capsules when you feel nauseated.",
      "content": "Take ginger capsules when you feel nauseated. Try taking a 250 mg dose when your stomach first starts feeling upset. Wait about 30 minutes for the capsule to dissolve in your stomach before you start feeling the effects. You can take up to 4 capsules per day at a 250 mg dose. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Ginger capsules contain powdered ginger. They may make you feel bloated, give you heartburn, or make you feel more nauseous."
    },
    {
      "title": "Suck on ginger candy for an incremental dose.",
      "content": "Suck on ginger candy for an incremental dose. Look for crystalized ginger candies or hard candies flavored with real ginger at a grocery store. Hold one of these candies in your mouth and let it dissolve when you first start feeling nauseated. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Talk to your doctor before you use ginger to treat a stomach ache.",
      "content": "Talk to your doctor before you use ginger to treat a stomach ache. While ginger is usually safe to consume, it may not be right for everyone. It can trigger heartburn in some people and may cause diarrhea in some cases. Similarly, you shouldn’t use ginger if you’re taking blood thinners, because ginger can reduce clotting. Talk to your doctor to make sure ginger is safe for you to use. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Let your doctor know that you want to consume ginger often as a stomach ache treatment."
    },
    {
      "title": "Get immediate care for severe pain, persistent diarrhea, or bleeding.",
      "content": "Get immediate care for severe pain, persistent diarrhea, or bleeding. While you’ll likely be okay, severe symptoms may be a sign of a more serious condition. Go to your doctor to find out what’s causing your symptoms. Then, ask your doctor for the best treatment. [18] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You may feel worsening pain or bloating. Contact your doctor if you have blood or a substance that looks like coffee grounds in your stool or vomit."
    },
    {
      "title": "Talk to your doctor if you’re losing weight without trying.",
      "content": "Talk to your doctor if you’re losing weight without trying. While you shouldn’t worry, it’s best to see your doctor if you’re losing weight because of a stomach ache. You might have a more serious condition. Tell your doctor about your symptoms and recent weight loss. They can help you choose the right treatments to feel better. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "See your doctor if your stomach ache lasts longer than 3 days or recurs.",
      "content": "See your doctor if your stomach ache lasts longer than 3 days or recurs. If your stomach ache persists or comes back, you need to see your doctor. Talk to them about your symptoms and get a proper diagnosis. Then, they'll help you get the right treatment so you find relief. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have recurring stomach aches, you may have a more serious health condition. Try not to worry because your doctor can help."
    }
  ]
}