{
  "url": "https://www.wikihow.com/Flirt-With-Boys-Without-Being-Obvious",
  "title": "How to Flirt With Boys Without Being Obvious",
  "steps": [
    {
      "title": "Talk to him regularly.",
      "content": "Talk to him regularly. Looking pretty from afar can get his attention for a bit, but you need to start conversing with him if you want to hold his attention. Don't bombard him with meaningless chatter every time you see him in the hallway, but try to start up casual conversation when you see he's alone and isn't busy. At the very least, try to say “Hi” and ask him how his day is going every day. As he becomes familiar with you, he's more likely to start liking you. [1] X Research source Not only will he remember you and get to know you, he will certainly think you're a kind, social person to say hello every day."
    },
    {
      "title": "Ask him questions.",
      "content": "Ask him questions. This is a simple flirting technique that is definitely underutilized. Think about how special you feel when someone asks you specific questions about your life. It shows they pay attention, and they care about what is going on with you. Make your crush feel special too! Ask him questions about his classes, his extracurricular activities, or anything else you know he's interested in. This is an extremely subtle technique. Nonetheless, it will definitely make him feel good to know that you're fascinated in what he has to say."
    },
    {
      "title": "Touch him.",
      "content": "Touch him. This doesn't mean all the obvious touchy-feely flirting moves, like hugs and kisses. Instead, casually brush his arm while talking to him. Playfully graze his back or bicep when you're deep in conversation. Act nonchalant, as if you've touched him without even realizing it. No one else will probably notice these subtle moves, but he certainly won't miss them. [2] X Research source [3] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 29 July 2021."
    },
    {
      "title": "Smile at him.",
      "content": "Smile at him. Think about the people you want to spend time with– are they people with a constant frown on their face? [4] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 29 July 2021. Probably not! People are attracted to others who seem positive, happy, fun, and upbeat. Even if you aren't feeling great, try to wear a smile when you're around your crush, and flash one his way whenever you get the chance."
    },
    {
      "title": "Give him compliments.",
      "content": "Give him compliments. You don't have to tell him that his lips are luscious and his eyes make you melt– you can keep it subtle. Throw him casual compliments every once in awhile. Tell him that you like his new shoes, his new haircut looks great, or that he did a nice job on a class project. None of these compliments are romantic, but they'll let him know you notice and admire things about him. [5] X Research source"
    },
    {
      "title": "Be kind to all of his friends.",
      "content": "Be kind to all of his friends. If you offer him compliments and sweet smiles but act rude or disinterested in his friends, he may view you as insincere and fake. Instead, be kind to everyone, especially the people he cares about. Keep in mind that you will never be criticized for being caring, but you can look like a brat if you're only nice to your crush. This is as subtle as you can get when it comes to flirting. By being kind to his friends, you're showing him that you care about the people he cares about. This is also important because if his friends dislike you, he'll be less likely to pursue a relationship with you."
    },
    {
      "title": "Find common interests.",
      "content": "Find common interests. Try to take notice about what he seems interested in by observing things like his t-shirts, pictures he hangs up in his locker, and what he talks about with his buddies. Even if your only shared interest is a television show, ask him if he caught the latest episode or mention if you recently had a nice binge-watching marathon. Anytime you can connect with him through a similar hobby or a shared interest, you're doing well. [6] X Research source If he's passionate about something that you know nothing about, you can use this to your advantage as well. For example, if he loves baseball, ask him if he'd like to watch a game with you so he can show you what it's all about."
    },
    {
      "title": "Make eye contact with him.",
      "content": "Make eye contact with him. Even if you're shy, try extra hard to look into his eyes while you're speaking with him. This will show that you're engaged and really listening to what he has to say. Listening to him, and showing that you're interested, is an easy way to flirt without making it extremely obvious. [7] X Research source [8] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 29 July 2021. Be prepared to make a lot of eye contact, especially if you haven't talked to the guy yet. [9] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 29 July 2021."
    },
    {
      "title": "Remember what he tells you.",
      "content": "Remember what he tells you. If he tells you that he's going to his sister's soccer game after school, ask him if she won the next day. If he mentions a test he's nervous for, ask him how it went. These are little ways to show him that you not only listen, but you care enough to follow up with him about it. This is a sweet, easy way to flirt with your crush. [10] X Research source"
    },
    {
      "title": "Mirror his body language.",
      "content": "Mirror his body language. In other words, observe his body language and facial expressions and imitate them. This has been proven to make people feel comfortable and even feel friendlier toward you. It may seem a bit unnatural at first, it will make him warm up to you quickly, and a flirtatious conversation will flow more easily. [11] X Research source If he's leaning against his locker, lean against one next to it while you talk. If he's smiling, smile back."
    }
  ]
}