{
  "url": "https://www.wikihow.com/Find-Your-Phone-Number-on-Android",
  "title": "How to Find Your Phone Number on Android",
  "steps": [
    {
      "title": "Open the Phone app.",
      "content": "Open the Phone app. It generally has an icon that resembles an old phone receiver. Tap the app icon"
    },
    {
      "title": "Tap the Contacts tab.",
      "content": "Tap the Contacts tab. It's the third tab at the bottom of the screen."
    },
    {
      "title": "Tap Me, My info, or your name.",
      "content": "Tap Me , My info , or your name. It is generally at the top of the page. Depending on what phone model you have, it will either say Me or My Info . [1] X Research source"
    },
    {
      "title": "Check your phone number.",
      "content": "Check your phone number. It will be listed below \"Phone number\" or \"Mobile\". [2] X Research source"
    },
    {
      "title": "Open your Android’s Settings .",
      "content": "Open your Android’s Settings . It’s the gear icon most commonly found in the app drawer. If you don’t see a gear, look for a wrench. [3] X Research source"
    },
    {
      "title": "Scroll down and tap About phone or About Device.",
      "content": "Scroll down and tap About phone or About Device . It's near the bottom of the Settings menu. If you are using a Samsung Galaxy, it will be listed near the top of this page. For all other Android phone models, continue to the next step. [4] X Research source If you don't see this option on the root Settings menu, tap System . You should find it there."
    },
    {
      "title": "Tap Status or Phone identity.",
      "content": "Tap Status or Phone identity . On some phone models, you phone number may be listed at the top of this page. If it is not, continue to the next step."
    },
    {
      "title": "Tap SIM Status .",
      "content": "Tap SIM Status . Your phone number should appear on this screen under “My phone number.” [5] X Research source If the phone number says \"Unknown,\" you can find your phone number in the Contacts app."
    }
  ]
}