{
  "url": "https://www.wikihow.com/Countersteer-(Motorcycle)",
  "title": "How to Countersteer (Motorcycle)",
  "steps": [
    {
      "title": "Keep your arms relaxed and parallel to the ground.",
      "content": "Keep your arms relaxed and parallel to the ground. You don’t want to be pulling down on the handlebars. If you do that, you’ll essentially be fighting against the bike. If the road is bumpy or has potholes then your handlebars are bound to jerk around a little bit. Allow for these small movements. [1] X Research source"
    },
    {
      "title": "Anchor yourself to the bike using your knees.",
      "content": "Anchor yourself to the bike using your knees. Since you won’t be gripping onto the handlebars with your arms really tightly, it’s important to anchor yourself by hugging the motorcycle with your knees. It doesn’t need to be a death grip, just enough to keep you sturdy. You can also hold down on the pegs with the heels of your boot."
    },
    {
      "title": "Plan your turn.",
      "content": "Plan your turn. If you have to decelerate, downshift, or, worst of all, brake, in the turn then you have entered the turn too quickly. Brake before the turn, consider your entering strategy, and then enter it smoothly. You may want to enter the turn differently depending on the camber of the road and the type of turn, but generally use the delayed apex strategy. This means entering the turn on the outside and then scooting back to the inside as you clear the apex of the turn. [2] X Research source"
    },
    {
      "title": "Push the handlebars on the direction you want to turn.",
      "content": "Push the handlebars on the direction you want to turn. If you want to turn right, push the handlebars on the right side. If you want to turn left, push the handlebars on the left side. While this may seem incorrect, turning the bars in the opposite direction from the turn forces the bike to tilt slightly, while maintaining the proper speed allows it to stay upright. [3] X Research source Memorize this countersteering mantra: Turn right, push right. Turn left, push left."
    },
    {
      "title": "Use the delayed apex strategy.",
      "content": "Use the delayed apex strategy. As you approach your turn, signal at least 100 feet (37 meters) before the turn, and check your mirrors for signs of traffic. Move to the outside third of your lane–the corner opposite the direction of your turn. Don’t go so far that you’re putting yourself in danger of oncoming traffic. Just chose the outer third so that you can enter the turn with enough room to swing back to the inside."
    },
    {
      "title": "Slow your bike before turns.",
      "content": "Slow your bike before turns. Turning on a motorcycle is dependent on the speed you are traveling, so it's important to brake on your approach to the turn, then hold steady on the throttle during the turn. Downshift before the turn if necessary, but never in it. You can shift into a higher gear during the turn if you want to, but don't do this until you get more comfortable. The balance of the motorcycle is gyroscopic, which means that speed keeps it up. Depending on the grade of the turn you're making and the speed at which you're traveling, you'll probably need to slow down some. Never, under any circumstances, should you slow in the middle of a turn, or brake in the middle of a turn, unless there's some emergency. Even then, it's safer to evade than to attempt to stop. If you absolutely must stop then level your handlebars out before you start to brake. Square your handlebars and then apply progressive pressure to both brakes at the same time. 70 % of your stopping power comes from your front brake, but don’t grab it – especially in a turn. Apply progressive pressure. [4] X Research source"
    },
    {
      "title": "Push the handlebar to the direction of the turn.",
      "content": "Push the handlebar to the direction of the turn. This means that if you are turning right, you'll want to push the handlebar to the right. This is different than turning in close quarters. You are essentially keeping your handlebars square but initiating a lean. Gently, increase pressure from your palm on the handlebar, pushing it gently. Logically it may seem as if you were trying to turn the bike in the opposite direction you want to turn. However, as you do this, lean gently into the turn while shifting your weight slightly in the direction you want the bike to tilt. [5] X Research source Again, while that may seem counterintuitive at first, this is the principle of counter-steering, turning the front wheel slightly to drop the bike into a gentle lean, which allows for greater stability during a turn. The sharper you want to make the turn, the greater your lean angle should be."
    },
    {
      "title": "Keep your head up.",
      "content": "Keep your head up. Maintain pressure on the handlebars and look through the turn to the road ahead of you. Avoid looking at the side of the road or other distractions as target fixation can cause you to go directly toward it. Look at the path in the road you want to be on."
    },
    {
      "title": "Maintain a steady throttle.",
      "content": "Maintain a steady throttle. Don’t decelerate during the turn or let off the throttle. You don’t have to speed up in the turn, just keep the throttle steady. If you need to let off it at all that means you entered the turn too fast. Try to have confidence in your bike. Just because it is leaning doesn’t mean it’s about to fall over – as long as you keep pressure on the throttle you should keep friction with the road. By holding down the throttle you’re pushing that back wheel into the road and keeping the bike steady."
    },
    {
      "title": "Look through the turn.",
      "content": "Look through the turn. Don’t look at the ground. If your vision is wrong you’ll end up crashing. If you look at the ground, you’ll go to the ground. Keep your eyes where you want to be going – that’s not directly ahead of you, that’s at the exit point of the turn. Vision is incredibly important while countersteering. [6] X Research source"
    },
    {
      "title": "Accelerate out of the turn.",
      "content": "Accelerate out of the turn. When you are exiting the turn, release some pressure on the inner handlebar and add some more pressure on your throttle. Now push slightly on your outer handlebar and your bike will come back upright. This doesn't need to be a dramatic pushback to the outside, just a slight nudge as you release pressure on the inside handlebar."
    },
    {
      "title": "Apply your front brake before the grade.",
      "content": "Apply your front brake before the grade. To stay stable in turns at high speed, it's common to apply only your front brake during the downshift. This should occur on the outside of the lane, opposite the direction you want to turn, and in the straight, just before the grade begins. You should immediately transition from slowing into accelerating into the turn. Higher torque engines have a tendency to spin out in the back tires, so depending on what kind of motor you've got, you may want to downshift more, accordingly. Listen to your bike and get a feel for its capabilities at speed before you try to push it. This section assumes racing road conditions and dry asphalt."
    },
    {
      "title": "Lean and countersteer away from the turn.",
      "content": "Lean and countersteer away from the turn. As you approach the grade, countersteer away from the turn and lean toward it, at no more than 45 degrees on the angle. You shouldn't have to throw much weight, but you might need to adjust your body position slightly to maintain stability at higher speeds."
    },
    {
      "title": "Adjust your body position.",
      "content": "Adjust your body position. More aggressive turns such as those done by competitors on sports bikes may require riders to adjust their body positions, such that the torso is parallel to the bike on the right side, and dropped low beside the fuel tank. Position your head correctly. The helmet should be in a position near the right handlebar and the right leg cocked outward on the peg at about 45 degrees, with the ball of the foot on the peg and the heel up against the bike."
    },
    {
      "title": "Accelerate into the turn.",
      "content": "Accelerate into the turn. As soon as you secure yourself in your lean, accelerate the motorcycle through the apex of the turn. Keep your lean angle as stable as possible and accelerate the bike up slowly throughout the turn. The gear you use will depend on many things, the style of the bike, the road conditions, the grade, and the speed that you're traveling. There's no one gear for turning fast. Maintain a stable lean throughout the apex of the turn, dragging your knee if necessary. The right knee may drag on the ground if properly equipped and the lean angle is aggressive enough, in competitive racing."
    },
    {
      "title": "Right yourself by countersteering toward the turn.",
      "content": "Right yourself by countersteering toward the turn. As they exit the grade, racers will right themselves by countersteering back the other direction, into the direction of the turn which was just completed. This should allow you to pop up into a stable, upright position and throttle up. Shift your body back to a centered and low position on the bike for stability."
    },
    {
      "title": "Throttle up.",
      "content": "Throttle up. Most of the time, you'll need to shift up immediately after a turn to continue accelerating at high speed, having drifted toward the outside edge of the track again."
    }
  ]
}