{
  "url": "https://www.wikihow.com/Draw-With-Charcoal",
  "title": "How to Draw With Charcoal",
  "steps": [
    {
      "title": "Select a variety of hard and soft charcoal.",
      "content": "Select a variety of hard and soft charcoal. Just like any other art mediums, charcoal comes in many varieties. However, each type of charcoal is categorized by whether it is hard or soft. Harder charcoals produce lighter cleaner edges, while softer charcoals are better for blending and making deeper lines. [1] X Research source The compressed charcoal stick is a hard charcoal that is great for making darker lines. Compressed charcoal also comes in white to help with highlighting. [2] X Research source Soft charcoals are great for blending and creating smudges throughout your piece. However, these are some of the messiest charcoals to work with. [3] X Research source Use powdered charcoal for a lighter look and if you are toning larger areas. However, it is generally very messy. [4] X Research source"
    },
    {
      "title": "Choose plain white paper, charcoal paper, or toned paper.",
      "content": "Choose plain white paper, charcoal paper, or toned paper. When it comes to paper, there is a wide variety to choose from. Choosing the right paper for your piece may take some trial and error. Experiment with a few different paper styles and charcoal hardness to pick what works well for you. [5] X Research source Plain white paper, newsprint, bristol board, and illustration board are good choices for a drawing with smooth lines. Plain white paper also creates natural highlights easily because the gray or white of the paper combines with the color of the charcoal. [6] X Research source Charcoal paper, pastel papers, and watercolor papers have a fine-ribbed texture that helps create more brittle lines. [7] X Research source Toned papers that require you to use both white and black charcoal. [8] X Research source"
    },
    {
      "title": "Purchase a kneaded eraser, blending stump, and/or white chalk.",
      "content": "Purchase a kneaded eraser, blending stump, and/or white chalk. Kneaded erasers can completely erase chalk. These, along with blending stumps and white chalk, can also be used to help create shadows and highlights in your drawing. [9] X Research source"
    },
    {
      "title": "Work at an easel if you are just starting out.",
      "content": "Work at an easel if you are just starting out. It can be tricky to master drawing with charcoal because any accidental contact you have with your charcoal drawing will cause it to smudge. Start by working at an area where you can keep your drawing vertical and an area that is well-lit. [10] X Research source You should always choose a well-lit area since charcoal drawings are on the darker side, it is difficult to see highlighting, shadows, and details of your drawing."
    },
    {
      "title": "Pick up a fixative to hold the charcoal in place.",
      "content": "Pick up a fixative to hold the charcoal in place. “Fixing” your drawing once you’re done will keep any dust from the charcoal in place. Fixatives come as a spray that is applied by spraying it onto your work. [11] X Research source Fixatives come in 2 types, final and workable. Many artists use the workable spray because you can make small changes to your work after it has been fixed. You cannot alter your work after using the final fixative. You can use hairspray as an alternative, but be careful because it can cause the surface of your drawing to become slightly darker."
    },
    {
      "title": "Hold the charcoal like a pencil to get sharp edges.",
      "content": "Hold the charcoal like a pencil to get sharp edges. If you want to create well-defined lines and edges, holding it like you would normally hold a pencil is your best bet. This stroke allows you to make sure that only the point of the charcoal is coming in contact with the paper. [12] X Research source Apply more pressure to your stoke to get a solid, darker line."
    },
    {
      "title": "Place the charcoal on its side to create broader strokes.",
      "content": "Place the charcoal on its side to create broader strokes. The easiest way to do this is to hold the charcoal with your thumb and forefinger, with your palm facing down. This lets you create broader strokes without smearing your work. [13] X Research source Use a broad, sweeping motion to fill in larger areas on your paper."
    },
    {
      "title": "Let your shoulder and elbow lead your strokes.",
      "content": "Let your shoulder and elbow lead your strokes. One of the hardest parts about learning to draw with charcoal is to keep your wrist away from the page. Try to make your strokes using your shoulder and elbow instead of your wrist to give yourself a wider range of motion and to keep from accidentally smudging your work. [14] X Research source"
    },
    {
      "title": "Sketch any geometric shapes with a charcoal pencil.",
      "content": "Sketch any geometric shapes with a charcoal pencil. Anything and everything contains geometric shapes. The easiest way to begin drawing with charcoal is to identify the basic shapes and outline them lightly in your drawing. [15] X Research source If you are drawing a subject, make sure to sketch the entire figure or scene before moving on to individual details. For example, if you are drawing a face, start with a circular or square shaped outline. Or use a use an oval to begin the drawing of a vase. Charcoal pencils work great for creating a basic sketch. [16] X Research source Mark any high areas of contrast with a line. If you are drawing a face, draw the outlines of the eyes, mouth, and nose to give yourself a better outline of your subject."
    },
    {
      "title": "Use compressed charcoal to add defined edges to your drawing.",
      "content": "Use compressed charcoal to add defined edges to your drawing. After you have outlined the main shapes in your drawing, go back and add the more realistic traits. Make sure to revisit your work and sharpen the edges to help define each area of your drawing. [17] X Research source Use a kneaded eraser to sharpen the outlines of your objects."
    },
    {
      "title": "Smudge the charcoal with a blending stump to add shadows.",
      "content": "Smudge the charcoal with a blending stump to add shadows. Charcoal is great for creating three-dimensional shapes that allow you to make your artwork more realistic. To add these shadows, use a rolled piece of paper or your finger to smudge and blend the charcoal. [18] X Research source Smudge the areas around the contours of the face to add dimension such as the creases in a nose. You can also use smudging to create the texture of a flower."
    },
    {
      "title": "Create a range of dark and light using a kneaded eraser.",
      "content": "Create a range of dark and light using a kneaded eraser. Kneaded erasers are great because they can act as a smudging or blending tool. If you have a lighter area in your subject, you should surround it by a dark background and vice versa. [19] X Research source You can use your eraser to pull whites out to create contrast and highlight the darker areas. If you don’t want to erase the charcoal to create highlights, you can use chalk or Conte crayon. Conte crayons come in black and white and will enhance your drawings. [20] X Research source"
    },
    {
      "title": "Shade your drawing with a soft pencil to make it more realistic.",
      "content": "Shade your drawing with a soft pencil to make it more realistic. Hatching is a great technique to shade wider areas. You can use circulism, contour shading, or cross-hatching to create realistic-looking skin. [21] X Research source"
    },
    {
      "title": "Spray a fixative on your drawing to hold the charcoal in place.",
      "content": "Spray a fixative on your drawing to hold the charcoal in place. You always want to be in an area that is well-ventilated before using a fixative. Hold the can no more than 1 ft (12 in) from your drawing. Spray the fixative over your entire drawing and let it dry completely. [22] X Research source If you are still noticing dust coming from your charcoal drawing, re-apply the fixative."
    }
  ]
}