{
  "url": "https://www.wikihow.com/Diagnose-Shoulder-Pain",
  "title": "How to Diagnose Shoulder Pain",
  "steps": [
    {
      "title": "Determine how and when you developed the shoulder pain.",
      "content": "Determine how and when you developed the shoulder pain. Start by considering how you may have injured your shoulder. Perhaps it was while you were playing sports or working out. Or maybe you injured it while you were lifting a heavy object. Try to find the trigger for the shoulder pain, as this can help you determine the cause and diagnosis the issue. [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For example, you may notice that you felt shoulder pain right after lifting a heavy object or sustaining a fall, which could indicate an acute strain or sprain. Or maybe you felt the shoulder pain when you woke up in the morning after a strenuous workout. However, if you have noticed developing pain over time, you could be experiencing arthritic changes in your shoulder joint, which a doctor could diagnose."
    },
    {
      "title": "Notice if your shoulder pain feels dull and achy.",
      "content": "Notice if your shoulder pain feels dull and achy. You may experience shoulder pain deep in your shoulder socket or at the back of your shoulder. It may also feel achy over time, or be intense initially and then decrease over time. This type of pain is often due to the wearing down of your shoulder tendons and cartilage. [2] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source This type of pain may be due to a superior labral tear from anterior to posterior (SLAP) tear or a rotator cuff tear. In some cases, a deep, achy pain in your shoulder could be due to glenohumeral osteoarthritis or bicep tendonitis , a common condition in adults over 50 years old. If the pain is achy and then decreases over time, you may have frozen shoulder."
    },
    {
      "title": "Look for swelling and redness around the shoulder area.",
      "content": "Look for swelling and redness around the shoulder area. This could indicate an injury or bursitis. Bursitis occurs when the fluid sacs that cushion your bones, tendons, and muscles around your joint become inflamed. Flare-ups, which can be chronic, cause your shoulder to hurt, swell, and become red. Usually these flareups will subside with rest. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Bursitis may be a chronic issue that comes and goes for some people."
    },
    {
      "title": "Notice if the pain feels severe and burning in your shoulder.",
      "content": "Notice if the pain feels severe and burning in your shoulder. You may feel a burning sensation or a sharp, sudden pain in your shoulder that does not improve or fade away after several days. [4] X Research source This type of pain may be a symptom of subacromial bursitis, which occurs when the fluid-filled sac in your shoulder becomes irritated or inflamed. If you have these symptoms, as well as radiating pain in your neck, you may have rheumatoid arthritis in your shoulder joint or an impingement. Sharp, radiating pain is usually a sign of a serious issue in your shoulder joint. You should see your doctor right away for an assessment."
    },
    {
      "title": "Determine if you feel pain when you lift or move your shoulder.",
      "content": "Determine if you feel pain when you lift or move your shoulder. You may notice a sharp, intense pain when you move your shoulder. You may also find it difficult to lift or move your shoulder at all. [5] X Research source These symptoms, accompanied by swelling, bruising, and a grinding sensation in your shoulder, may be a sign you have a shoulder fracture or it is dislocated. If you suspect you have this issue, go see your doctor right away."
    },
    {
      "title": "Notice if you feel stiffness or pain in your neck as well as your shoulder.",
      "content": "Notice if you feel stiffness or pain in your neck as well as your shoulder. You may also find turning or moving your neck difficult and feel stiffness or pain in your back as well as your neck and shoulders. In some cases, you may also develop a headache. [6] X Research source These are all symptoms of whiplash or a neck sprain, which usually occurs after you are in a car accident. Another possibility is a scary-sounding condition that is actually a common part of aging. It's called degenerative disc disease, but it's really just your spine naturally starting to age. Some people will experience it at a younger age than most. [7] X Research source"
    },
    {
      "title": "Ask a friend or family member to assist you.",
      "content": "Ask a friend or family member to assist you. Range of motion tests are a good way to determine where you are feeling pain in your shoulder as well as how much it can move. Doing these tests requires the help of a friend, family member, or partner, as they will need to move or put pressure on your shoulder and arm. [8] X Research source You can also ask a trained physical therapist to do these range of motion tests, as they will know how much pressure and movement to apply onto your shoulder."
    },
    {
      "title": "Have the assistant perform a SLAP or rotator cuff tear test.",
      "content": "Have the assistant perform a SLAP or rotator cuff tear test. Sit in a chair and allow the assistant to raise the affected arm to the side, keeping it parallel to the floor. Relax your arm as the assistant drops it towards the floor. If your arm drops involuntarily, you cannot maintain a parallel position with your arm, or you cannot slowly lower your arm, you likely have a rotator cuff tear. [9] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source You may also notice you raise your scapula, a muscle above your shoulder, towards your ear to try to compensate for having a torn rotator cuff."
    },
    {
      "title": "Get the assistant to do an impingement test.",
      "content": "Get the assistant to do an impingement test. While seated, have your partner to place 1 hand on your arm and 1 hand on your shoulder blade. Then, allow them to raise your affected shoulder and arm to the front and then above you as high as possible. If you feel pain in your shoulder when your arm is raised in front of you and overhead, you likely have an impingement in the tendons or bursa in your shoulder. [10] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Your partner may also notice the area around your shoulder blade feels tight or inflamed due to the impingement."
    },
    {
      "title": "Ask the assistant to perform an AC joint separation test.",
      "content": "Ask the assistant to perform an AC joint separation test. For this test, sit down and have your assistant place 1 hand on the front of your shoulder joint and 1 hand on the back of it. They should then press both sides of your shoulder slowly but firmly to compress the AC joint. If you feel pain when the area is pressed, you liked have a separated AC joint. [11] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source You may also experience pain in the area when you sleep or when you try to lift the affected arm overhead."
    },
    {
      "title": "Get the assistant to perform a bicep tendonitis test.",
      "content": "Get the assistant to perform a bicep tendonitis test. Sit down in a chair and lift your affected arm forward in front of you. Turn your palm upward. The assistant should then push your arm down as you try to resist, pushing upward on their arm. If you feel pain when resisting the assistant’s push, you likely have tendonitis in your bicep that is causing your shoulder pain. [12] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Do a frozen shoulder test.",
      "content": "Do a frozen shoulder test. This test can be done on your own, with the assistant observing or helping as needed. Position yourself in front of a mirror with your arms at your sides and your palms facing your thighs. Lift your unaffected arm all the way up. Then lift the arm with the shoulder pain as high as you can without feeling any pain. With both arms overhead, compare them to see if your affected arm can reach as high, or if it can go no higher than parallel to the floor. You may also elevate the scapula on your affected shoulder towards your ear due to the pain. These are symptoms of frozen shoulder. [13] X Research source You can also try extending both arms to the sides and bending your elbows to 90 degrees. Then, externally rotate your arms outward. If you have frozen shoulder, the affected arm will not be able to rotate outward like your healthy shoulder. Rest, icing, and NSAIDs are often the first course of treatment. If the pain does not subside in a few days, visit your doctor for a more thorough diagnosis."
    },
    {
      "title": "See your doctor if your shoulder pain gets worse or cannot be easily diagnosed.",
      "content": "See your doctor if your shoulder pain gets worse or cannot be easily diagnosed. If the pain in your shoulder is severe and constant, you should seek immediate medical care. You should also see your doctor if the range of motion tests you perform are not conclusive or if your symptoms do not go away within a few days. [14] X Research source"
    },
    {
      "title": "Discuss how you developed the injury and where it feels painful.",
      "content": "Discuss how you developed the injury and where it feels painful. Your doctor will ask you questions about how and when you developed the injury. They will also ask you to describe the pain and how it feels as well as point to where you feel the pain in your shoulder. For example, they may ask questions like: [15] X Research source “Is the pain coming from your shoulder, your neck, and/or other areas?” “Do you feel pain when you move or lift your arm?\" “Does the pain feel dull and achy or burning and radiating?” “Are you experiencing any other symptoms?”"
    },
    {
      "title": "Allow your doctor to perform physical tests on your shoulder.",
      "content": "Allow your doctor to perform physical tests on your shoulder. Your doctor will likely test your range of motion by having you lift, move, and twist in your arm or shoulder. They may also put pressure on your arm to see how it responds and if you feel any pain when this is done. [16] X Research source Your doctor will also do a physical exam of your shoulder for any signs of bruising or swelling."
    },
    {
      "title": "Get a diagnosis from your doctor and discuss your treatment options.",
      "content": "Get a diagnosis from your doctor and discuss your treatment options. Your doctor will consider your medical history, the cause of the shoulder pain, and the results of the range of movement tests in their diagnosis. Most shoulder issues can be treated by avoiding repetitive movements or overhead movements until the shoulder recovers. Your doctor can also prescribe pain medication and give you a corticosteroid shot for temporary pain relief. [17] X Research source You may also need to go see a physiotherapist to help your shoulder recover properly."
    }
  ]
}