{
  "url": "https://www.wikihow.com/Cut-Tennis-Balls",
  "title": "How to Cut Tennis Balls",
  "steps": [
    {
      "title": "Hold the tennis ball firmly against a solid surface.",
      "content": "Hold the tennis ball firmly against a solid surface. Set the tennis ball on a surface that’s knife-safe, such as a cutting board. Grip the tennis ball in your non-dominant hand so the rounded edge of the seam faces up. Use your ring finger and pinky to support the back of the ball so it doesn’t roll away. [2] X Research source If you don’t feel comfortable holding the ball while you cut it, secure the ball in a vise grip."
    },
    {
      "title": "Poke the blade of a utility knife through the middle of the ball.",
      "content": "Poke the blade of a utility knife through the middle of the ball. Hold the knife with your dominant hand so your index finger is along the top edge and pointing toward the blade. Carefully poke the end of your knife in between the seams until it breaks into the center of the ball. [3] X Research source Make sure the blade isn’t pointed toward your fingers or you could accidentally cut yourself if the knife slips. You may also use a craft knife, but it may not be as strong as a utility knife."
    },
    {
      "title": "Cut a 1 1⁄2 in (3.8 cm) slit in the ball.",
      "content": "Cut a 1 1 ⁄ 2 in (3.8 cm) slit in the ball. Move your blade up and down to saw through the ball’s rubber. Make a straight horizontal cut parallel to the seams that’s about 1 1 ⁄ 2 in (3.8 cm) long. When you’re finished with the cut, pull your knife out of the ball. [4] X Research source Don't make your slit any longer or else it could easily fall off of furniture legs."
    },
    {
      "title": "Rotate the ball by 90 degrees and make another slit.",
      "content": "Rotate the ball by 90 degrees and make another slit. Turn the ball so the slit you cut is vertical when you look at it. Press the tip of the knife 3 ⁄ 4 in (1.9 cm) to the left of the first slit near its midpoint. Make a horizontal cut that crosses the first slit so it forms an X-shape. Once your second slit is 1 1 ⁄ 2 in (3.8 cm) long, take your knife out. [5] X Research source"
    },
    {
      "title": "Leave the ball near a window or well-ventilated area for 1 day to dry any moisture.",
      "content": "Leave the ball near a window or well-ventilated area for 1 day to dry any moisture. Sometimes, tennis balls have a small amount of moisture inside them that could damage furniture legs. Set the ball on a windowsill so the cut faces down. Let the ball dry out for about 1 day before putting it on anything. [6] X Research source Once the ball doesn't have an odor, it's ready to use."
    },
    {
      "title": "Trace a line around the circumference of the ball.",
      "content": "Trace a line around the circumference of the ball. Hold the ball steady on your work surface with your non-dominant hand. Draw a straight line in the direction you want to cut on top of the ball with a pen. Rotate the ball when you need to continue your line around its surface. Make sure the ends of your line meet so you know it’s straight. If a pen doesn’t work on your tennis ball, use a marker. The marker line will be noticeable when you finish your cut."
    },
    {
      "title": "Hold the ball from above against a hard surface.",
      "content": "Hold the ball from above against a hard surface. Set the ball on a cutting board or another surface where you can easily use a knife. Hold the ball with your non-dominant hand so all of your fingers are gripping it. Keep 3 fingers on the front of the ball, and support the back side with your pinky and thumb. Make sure your cut line is between your front and back fingers. [7] X Research source Imagine your hand is a claw so you’re only grabbing the ball with the ends of your fingers."
    },
    {
      "title": "Start your cut with a serrated knife.",
      "content": "Start your cut with a serrated knife. Feed the blade of your knife underneath your hand so it’s between your front and back fingers. Use firm pressure as you saw back and forth along the cut line. Continue cutting until you’re halfway through the ball before removing your knife. [8] X Research source Stay attentive while you make your cut so you don’t accidentally hurt yourself."
    },
    {
      "title": "Rotate the ball to finish making your cut.",
      "content": "Rotate the ball to finish making your cut. Turn the ball by 90 degrees along the line you drew and hold it firmly again. Stick the blade of your knife into the cut you started and continue working along the line you drew. Keep rotating the ball by 90 degrees and cutting until it’s halved. [9] X Research source Turning the ball makes it easier to cut and helps ensure you’re halves are the same size."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}