{
  "url": "https://www.wikihow.com/Free-Textbook-Websites",
  "title": "22 Websites For Finding Free College Textbooks",
  "steps": [
    {
      "title": "Internet Archive Open Library (Archive.org)",
      "content": "Internet Archive Open Library (Archive.org) The Internet Archive hosts over 40 million books and texts . Browse their Open Library to find the textbooks you need. Some books are available to read on-demand, while others require you to make a free Internet Archive account and borrow them—just like you would at an in-person library. [1] X Research source Some Internet Archive titles can only be borrowed and read by one user at a time. If a book is marked “on loan,” try to borrow it later."
    },
    {
      "title": "Project Gutenberg",
      "content": "Project Gutenberg The online Project Gutenberg library offers over 75,000 free eBooks. Most of the books are available to download or read online, whichever format you prefer. Use this site when you’re looking for classic books or textbooks that are over 95 years old. The site doesn’t host books that have active copyright protections. [2] X Research source"
    },
    {
      "title": "Google Books",
      "content": "Google Books While Google Books is a helpful resource for searching for a book, few people realize it hosts full versions of some copyright-free books. Search for textbooks by name, then open the “Advanced Book Search” feature. Next to the “Search:” heading, toggle “Full view only.” Then, click “Google Search” to see if your textbook is available. Google Books primarily has full versions of older books, which are in the public domain or otherwise not copyrighted. You won’t find full versions of copyrighted textbooks."
    },
    {
      "title": "MIT OpenCourseWare",
      "content": "MIT OpenCourseWare MIT OpenCourseWare (OCW) offers free open educational resources (OER) from MIT. The website features textbooks and other course resources that cover MIT’s entire curriculum. [3] X Research source If your course has assigned an MIT OER textbook, or you’re looking for a textbook for self-guided learning, browse the digital library to find and download it for free."
    },
    {
      "title": "Open Textbook Library",
      "content": "Open Textbook Library Scroll through Open Textbook Library’s 1,590 textbooks to find the one you need for your high school or college class. The textbooks are free to download, and some were copyrighted as recently as 2025. Users, primarily educators, leave reviews of textbooks, so you get a sense of their quality. [4] X Research source"
    },
    {
      "title": "Digital Public Library of America",
      "content": "Digital Public Library of America The Digital Public Library of America is a 501(c)(3) nonprofit that hosts a variety of educational content, including textbooks, primary source documents, and banned books. Like most legal free textbook websites, the DPLA mostly features older works that are no longer copyrighted. [5] X Research source"
    },
    {
      "title": "HathiTrust Digital Library",
      "content": "HathiTrust Digital Library Search HathiTrust’s digital library of over 18 million items to find textbooks and educational materials. Note that the HathiTrust Digital Library Collection requires a membership to view and download its entire library. Memberships aren’t for individuals, but for institutions like research libraries and community colleges who pay annual dues. [6] X Research source"
    },
    {
      "title": "Freeditorial",
      "content": "Freeditorial Freeditorial is a better source for assigned course readings than for academic textbooks. The site offers free books that are in the public domain or that are, for other reasons, uncopyrighted. It also hosts self-published books by independent authors—though not all of these are free. [7] X Research source"
    },
    {
      "title": "E-Books Directory",
      "content": "E-Books Directory Check E-Books Directory to find over 10,000 textbook eBooks, technical papers, and other educational resources. The site features textbooks on a range of topics, such as engineering, mathematics, physics, and computer programming. A benefit of this free textbook website is that it’s accessible on mobile devices with small screens, like your phone."
    },
    {
      "title": "Open Culture",
      "content": "Open Culture Open Culture is a resource for copyright-free courses, movies, eBooks, textbooks, and more. They host free textbooks that are openly licensed, meaning the author(s) and publisher(s) allow anyone to use them at no cost. Search through Open Culture’s 200 free textbooks covering subjects like business, mathematics, and philosophy to see if they have what you need for your course."
    },
    {
      "title": "OER Commons",
      "content": "OER Commons Browse over 7,000 free textbooks on the Open Educational Resources (OER) Commons website . These textbooks are openly licensed, meaning anyone is free to access and download them. [8] X Research source Search by keyword to find the right books for your course."
    },
    {
      "title": "Open Research Library",
      "content": "Open Research Library Use the Open Research Library (ORL) to search for Open Access books that are peer-reviewed and available for free. Their offerings include books from major textbook publishers like Taylor & Francis. Besides free textbooks, the site also hosts free chapters from textbooks. [9] X Research source"
    },
    {
      "title": "PDF Books World",
      "content": "PDF Books World Search PDF Books World for classic books and older academic texts in the public domain that are commonly assigned in various college courses. Examples from their digital library include Plato’s The Republic and de Tocqueville’s Democracy in America . [10] X Research source"
    },
    {
      "title": "B.C. Open Collection",
      "content": "B.C. Open Collection B.C. Open Collection is a resource for educators and students looking for openly licensed textbooks. The website has a modern, easy-to-use design and hosts recently published textbooks in a variety of subjects. While oriented toward Canadian educators and classrooms, the resources are available globally. [11] X Research source"
    },
    {
      "title": "OpenStax.org",
      "content": "OpenStax.org Run by Rice University, OpenStax is the largest publisher of open education resources (OER). Their textbooks are featured on many free textbook websites. If your professor or teacher has assigned an OER textbook, search for it on OpenStax to download as a PDF or view online. [12] X Research source"
    },
    {
      "title": "Libre Texts",
      "content": "Libre Texts LibreTexts hosts open educational resources (OER) that can be customized and distributed for free. The website was founded by the University of California, Davis. [13] X Research source Sort by specific subjects to find the right free textbook for your course of the over 3,000 available."
    },
    {
      "title": "MERLOT",
      "content": "MERLOT Multimedia Educational Resource for Learning and Online Teaching (MERLOT) hosts over 10,000 open-access textbooks on subjects ranging from statistics to nursing and more. The website is one of the oldest resources for open-access educational materials, run by the California State University. [14] X Research source"
    },
    {
      "title": "Directory of Open Access Books",
      "content": "Directory of Open Access Books The Directory of Open Access Books (DOAB) hosts over 80,000 open-access books, including textbooks from a variety of university presses and other academic publishers. What sets them apart from other sites is that some of their materials are available in languages other than English, such as French. [15] X Research source"
    },
    {
      "title": "The Assayer",
      "content": "The Assayer The Assayer is a straightforward online catalog that links to eBooks and digital textbooks that have been made free to read via an open license. Search by subject, author, or keyword to find the textbook you need for your course."
    },
    {
      "title": "MIT Press Direct",
      "content": "MIT Press Direct If your professor assigned a textbook from MIT Press, check if it’s available on the MIT Press Direct website . The site features over 4,000 books published by MIT Press. Create a free account connected to your academic institution’s library to gain access to the site’s eBooks. [16] X Research source"
    },
    {
      "title": "Bookboon",
      "content": "Bookboon Bookboon is a website that offers textbooks written by professors and other authors specifically for the platform. If your course uses Bookboon, you can create an account to download eBook editions of Bookboon textbooks during a 30-day free trial. However, Bookboon requires a monthly subscription for continued use. [17] X Research source If you’re a self-guided learner, consider if Bookboon textbooks’ content and quality are worth the subscription price compared to other online resources that are free."
    },
    {
      "title": "Bookshare",
      "content": "Bookshare Bookshare is a unique eBook library that includes over 1 million books for people with print disabilities, 10,000 of which are free. Qualifying conditions include learning disabilities like dyslexia, visual impairments like blindness, or physical disabilities that make print reading difficult. [18] X Research source The library has a mix of books, textbooks, and other educational materials. [19] X Research source To create a Bookshare account, you’ll need a professional to confirm you have a qualifying condition. Not all Bookshare titles are free to read, but those in the public domain are. If you don’t have a print disability, you can access public domain books for free on most other websites on this list."
    },
    {
      "title": "Check your school or university’s library.",
      "content": "Check your school or university’s library. Search your library’s catalogue online or in-person to see if they have the textbook you need. Sometimes, professors or teachers put course-specific textbooks on reserve. Their students have priority in borrowing these reserved textbooks. If your institution’s library doesn’t have a book, but another branch does, try to request it through your library’s interlibrary loan service."
    },
    {
      "title": "Check your local library.",
      "content": "Check your local library. Visit a branch of your local library in-person or visit their website to see if they have the textbook you need. Apply for a library card if you don’t already have one so you’re able to check out books. They may have the textbook you need—or be able to request it from another branch."
    },
    {
      "title": "Ask friends or graduating seniors to borrow old books.",
      "content": "Ask friends or graduating seniors to borrow old books. If you know a friend who has taken your class before, ask them if you can borrow their old textbook. Additionally, some universities host book drives at the end of the year where graduating students can donate their old books to be re-used by the lower grades."
    },
    {
      "title": "Talk to your professor or school dean if you can’t afford textbooks.",
      "content": "Talk to your professor or school dean if you can’t afford textbooks. They can direct you to resources or grants you can apply for to cover the cost of books. Some professors will let you borrow a copy of the textbook to scan assigned readings at the library. They can also connect you with a peer who can share their textbook with you. If possible, ask your professor for permission to use an older edition of the textbook that’s cheaper than the one they assigned."
    },
    {
      "title": "It is illegal to download copyrighted textbooks for free.",
      "content": "It is illegal to download copyrighted textbooks for free. While some websites offer free textbooks for download and distribution, unless the books are in the public domain or openly licensed, they are breaking the law. If you download a copyrighted textbook, this is a form of piracy, which is a crime. You could be subject to legal action for downloading and sharing the file. [20] X Research source Downloading textbooks illegally through piracy websites puts you at risk of downloading viruses and exposing personal data such as usernames and passwords. [21] X Research source"
    }
  ]
}