{
  "url": "https://www.wikihow.com/Eat-Soup",
  "title": "How to Eat Soup",
  "steps": [
    {
      "title": "Choose the right spoon.",
      "content": "Choose the right spoon. The soup spoon is the largest one at your place setting. [1] X Research source In some restaurants, a soup spoon will be brought out to you along with your soup. Use the soup spoon and not a smaller one. Using a smaller spoon increases the chance that you will spill soup on yourself. In British and American dinner culture, soup spoons are placed at the far right of your dinner setup. [2] X Research source There are occasionally exceptions to this depending on the culture. Italy's dinner etiquette dictates whatever utensil you are supposed to use first should be set the furthest away from your plate. [3] X Research source"
    },
    {
      "title": "Wait for the soup to cool down if it is too hot.",
      "content": "Wait for the soup to cool down if it is too hot. Do not blow on your soup to cool it down. [4] X Research source Blowing on your soup can make you seem impatient and it can also cause you to splatter soup on the person sitting across from you. If your soup is too hot to eat, then put down your soup spoon and wait until it is cool enough to eat. Enjoy the conversation of your dining companions and then check the soup again after a few minutes."
    },
    {
      "title": "Spoon the soup away from you.",
      "content": "Spoon the soup away from you. While you may naturally want to spoon your soup towards you, this may increase the chances that you will drip soup on yourself. Instead, spoon the soup towards the back of your bowl and then lift the spoon up towards your mouth. This will give any excess soup on the spoon a chance to drip back into the bowl. [5] X Research source When the soup is getting low in your bowl, then you can tip your bowl away from you slightly to get the last bit of soup at the bottom of the dish."
    },
    {
      "title": "Sip your soup from the side of the spoon.",
      "content": "Sip your soup from the side of the spoon. Your spoon has a tapered end, but sipping from this part of the spoon increases your chance of spilling soup on yourself. Sip your soup from the wide edge on the side of the spoon instead. [6] X Research source Never slurp your soup if you are in a restaurant in the west, such as somewhere in Europe or the United States. This is considered rude by many people in western cultures. Try to eat your soup as silently as possible."
    },
    {
      "title": "Put down your spoon when you are done.",
      "content": "Put down your spoon when you are done. After you have finished eating your soup, put your spoon on the plate underneath your soup bowl. If there is not a plate under your soup bowl, then place your spoon in the soup bowl. [7] X Research source Do not place the used soup spoon on your napkin or on the table."
    },
    {
      "title": "Tip the bowl towards you or pick it up.",
      "content": "Tip the bowl towards you or pick it up. If you are eating ramen or a large bowl that is difficult to pick up, then you can just use your non-dominant hand to support the bowl and tip it towards you slightly as needed. However, if the bowl is small enough to pick up, then you can pick up your bowl with your non-dominant hand and eat it with the spoon in your other hand. [8] X Research source Make sure that you eat the soup while it is still hot. It is important to eat your soup while it is too hot. Do not wait to let it cool down or blow on your soup. You can slurp it to help cool it off as you eat. [9] X Research source"
    },
    {
      "title": "Use chopsticks to pick up noodles, dumplings, meat, and veggies.",
      "content": "Use chopsticks to pick up noodles, dumplings, meat, and veggies. It is okay to use chopsticks while eating soup, but make sure that you use them for larger pieces of food in your dish, such as noodles, dumplings, meat, and veggies. Don’t mix the soup around with your chopsticks. This is considered rude. Don’t stick your chopsticks into the bowl from the top. This can remind Chinese people of funerals. Don’t play with your chopsticks or wave them around while you are talking. Don’t lay your chopsticks across the top of your bowl when you are done. Put them in the bowl at an angle."
    },
    {
      "title": "Use the spoon to drink the broth.",
      "content": "Use the spoon to drink the broth. A flat bottomed spoon will be provided along with your soup. Use this to drink the broth and smaller pieces of food in your soup. When you are finished eating, place the spoon in the bowl."
    },
    {
      "title": "Slurp your soup.",
      "content": "Slurp your soup. If your soup contains long noodles, such as a ramen, then you can slurp it. Sucking in air by slurping up the noodles will help to cool down the soup and it is also considered polite to eat your soup this way. Keep in mind that if you eat your soup in silence, then the chef may be offended. It is okay to slurp your food and even burp at the dinner table in most Asian cultures. [10] X Research source How quickly you should eat depends on the setting. For example, if you are eating a meal in someone’s home, then wolfing down your food is not necessary and may even be considered rude. However, if you are eating in a ramen shop or other street food vendor, then eating quickly and loudly is appropriate."
    },
    {
      "title": "Consuming French onion.",
      "content": "Consuming French onion. Eating French onion soup can be challenging. This soup comes with a crouton and a layer of melted cheese on top of a brothy onion soup. To eat it, you will have to break through the crouton with your spoon (or a fork and knife if it is too hard to break through with your spoon) and use it to scoop up a bit of crouton, cheese, and broth at the same time. [11] X Research source Use the edge of your spoon to cut the cheese by pressing it against the edge of your bowl. You may need to support the bowl with your other hand as you do so."
    },
    {
      "title": "Sipping consommé.",
      "content": "Sipping consommé. Consommé is a clear broth soup that may be served in an upscale restaurant or at a fancy dinner party. You can sip consommé like a cup of tea if the bowl it is served in has handles. [12] X Research source However, if the bowl does not have handles, then eat it as you would eat any other soup, such as by spooning it away from you in the bowl and sipping the soup from the side of your spoon."
    },
    {
      "title": "Eating bouillabaisse.",
      "content": "Eating bouillabaisse. This French dish contains a variety of different seafood, such as clams, mussels, crab legs, and scallops. Some pieces you will be able to pick up with a regular spoon, while you will need to crack open some of the other pieces with a shellfish cracker. You may also need to use a knife and fork to extract some of the seafood from the shells. [13] X Research source This dish is often served in two courses. The first course is the broth along with croutons, garlic, and a spiced mayonnaise and the second course is all the different kinds of fish on a platter. Spread some garlic and mayonnaise on a crouton and eat it with the broth, then work on the fish."
    },
    {
      "title": "Go easy on the crackers.",
      "content": "Go easy on the crackers. Sometimes crackers will be served along with soup, and you can add these to your soup to help make it a little thicker. However, do not add so many crackers that your soup takes on an oatmeal-like consistency. Just add a couple of crackers for flavor if desired. [14] X Research source You can also dip a piece of bread into your soup if it has been offered along with the soup. Just be careful to wipe away any excess broth before you bring the bread to your mouth or you may drip on yourself."
    },
    {
      "title": "Add garnishes before you start eating.",
      "content": "Add garnishes before you start eating. If your soup has been served with optional garnishes, then make sure that you add these before you start eating. Use a clean spoon or fork to add the garnishes to your soup. [15] X Research source Some common garnishes may include: croutons sour cream cheese green onions bacon pieces bean sprouts lime crushed peanuts"
    }
  ]
}