{
  "url": "https://www.wikihow.com/Cure-a-Cold-Fast",
  "title": "How to Cure a Cold Fast",
  "steps": [
    {
      "title": "Take a cough suppressant.",
      "content": "Take a cough suppressant. Use a cough suppressant only if you have a dry cough. Cough suppressants include dextromethorphan and codeine. However, you may need a prescription for codeine. Side-effects can include drowsiness and constipation. Dextromethorphan is available as a tablet or syrup and can come in combination with an expectorant. If you have a 'chesty' cough and are coughing up any mucus, do not take a cough suppressant, as this could increase the chances of developing a chest infection. Instead, ask the pharmacist for an 'expectorant' cough syrup. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take a decongestant.",
      "content": "Take a decongestant. [2] X Expert Source David Nazarian, MD Diplomate, American Board of Internal Medicine Expert Interview. 26 March 2020. Nasal decongestants — either liquid or pill form — help shrink blood vessels in the nasal membranes and allow the nasal passages to open up, giving you fast relief. However, you should avoid oral decongestants if you have heart issues or hypertension, and only use decongestants with a doctor’s direction if you have diabetes, thyroid problems, glaucoma, or prostate issues. Side effects of decongestants include insomnia (sleeping problems), dizziness, and increased blood pressure. [3] X Research source"
    },
    {
      "title": "Take an expectorant.",
      "content": "Take an expectorant. An expectorant is a form of over-the-counter medication which clears the sinuses by thinning mucus and loosening phlegm that may have settled in your lungs. This will allow you to breathe easier and leave you more comfortable. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Expectorants are available over-the-counter at your local pharmacy. They are usually taken in liquid form, but they can also be found as tablets and powders. Currently, the only over-the-counter expectorant available is guaifenesin. Look for this active ingredient when searching for medications. Mucinex is the most common brand name guaifenesin-containing medicine sold in pharmacies. [6] X Research source Be aware that expectorants, like all medications, may have side-effects. Those most commonly associated with this form of medication include nausea, vomiting and drowsiness. If you experience any of these symptoms, you should stop taking the expectorant immediately. [7] X Research source"
    },
    {
      "title": "Increase your vitamin C intake.",
      "content": "Increase your vitamin C intake. Vitamin C has long been touted for its cold-preventing properties, but did you know it can also help to shorten the duration of a cold? [8] X Research source Up your intake by drinking orange juice and eating foods like strawberries, kiwis and leafy green vegetables, which have a high vitamin C content. You can also take a vitamin C supplement, available in tablet form in drug and health food stores. The recommended dosage is 90 mg a day for men and 75 mg a day for women, according to the National Institutes of Health. [9] X Research source"
    },
    {
      "title": "Go see a doctor.",
      "content": "Go see a doctor. Your body has the capabilities to fight off most colds, but a doctor can provide prescription assistance to relieve symptoms. However, do not ask your doctor for antibiotics for a cold, they will not improve your symptoms or the duration of your cold. If you are experiencing any of the following symptoms, then you should contact your doctor immediately: [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Earache/loss of hearing Fever above 103 degrees Fever above 101 that lasts for more than 3 days Shortness of breath/wheezing Bloody mucus General symptoms that last more than 7 to 10 days Sore throat with a fever, but no cough and no runny nose. This may indicate strep throat, which should immediately be treated with antibiotics to prevent heart complications. Cough with a fever, but no runny nose and no sore throat. These symptoms may indicate pneumonia and should also be treated with antibiotics."
    },
    {
      "title": "Blow your nose correctly.",
      "content": "Blow your nose correctly. It's natural to want to blow your nose when you're feeling stuffed up, but just be careful not to overdo it. While blowing your nose can indeed help to clear the nasal passages of excess mucus, blowing too hard or too frequently can actually have adverse effects. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Try using a sinus or saline irrigation container to clear your nasal passages.",
      "content": "Try using a sinus or saline irrigation container to clear your nasal passages. Any kind of bottle or container with a thin spout can be used with a saline solution to thin and flush mucus from the nasal passages. However, they won’t relieve your cold symptoms. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Make your own saline solution by mixing half a teaspoon of kosher salt into a cup of water. Fill the container with the saline solution, tilt your head to one side (over a sink), and insert the spout into one nostril and pour. The solution should flow in one nostril before coming out the other. When the water stops dripping, blow your nose gently, then repeat the process on the opposite side [16] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Use steam treatments.",
      "content": "Use steam treatments. Steam can be really useful when it comes to clearing your head. The heat of the steam loosens mucus while the moisture from the water helps to relieve dry nasal passages. Use steam in one of the following ways: [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Give yourself a steam facial by boiling a pot of water. Pour that water into a separate bowl and then place your face over the steaming water. Hold a towel over your head to keep the steam in. Add a couple of drops of a sinus-clearing essential oil (such as tea tree or peppermint) to maximize the sinus-clearing benefits."
    },
    {
      "title": "Take a hot shower.",
      "content": "Take a hot shower. Yes, even if you're feeling under the weather, you shouldn't skip your daily shower as it can actually help to clear a cold faster. Heat the water to a high, yet comfortable temperature and let the bathroom steam up as much as possible to help loosen mucus. The steam won’t heal your cold, but it can help you feel better. If the heat leaves you feeling a little weak or dizzy, consider bringing a plastic chair or stool into the shower with you. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source A hot, steamy bath can work wonders for you when you have a cold - not just in terms of decongestion, but also in terms of relaxation and heat. Again, try to make the water as hot as possible. If you decide to wash your hair (either in the bath or shower) remember to dry your hair thoroughly afterward, as damp hair can cause you to lose body heat, which is not good for a cold."
    },
    {
      "title": "Drink hot fluids.",
      "content": "Drink hot fluids. There's nothing more comforting than a hot drink when you're suffering from a nasty cold. But beyond the comfort factor, a hot drink can actually help to clear your nasal passages and soothe a sore throat, making it the perfect cold-busting remedy. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take a pain reliever/fever reducer.",
      "content": "Take a pain reliever/fever reducer. If you have aches or a high temperature, your main two choices are acetaminophen (Tylenol) and NSAIDs (non-steroidal, anti-inflammatory drugs such as aspirin, ibuprofen, or naproxen). Avoid taking NSAIDs, if you have acid reflux or peptic ulcer disease. If you are already taking a NSAID for other issues, talk to your doctor before taking more. Do not take more than the prescribed amount, as indicated on the bottle. Too much of either medicine can lead to liver toxicity. You don't want to develop a worse condition while trying to fight off another. [21] X Research source"
    },
    {
      "title": "Gargle salt water to ease your sore throat.",
      "content": "Gargle salt water to ease your sore throat. Congestion isn't the only nasty symptom you have to contend with during a cold - dry, itchy, or sore throats can be equally bothersome. An easy, natural way to deal with this is to gargle a salt solution. The water hydrates the throat, while the antiseptic properties in the salt help to fight infection. Make the solution by dissolving a teaspoon of salt in a glass of warm water. If the taste is too unpleasant for your liking, add a little baking soda to take the edge off the saltiness. Gargle this solution up to four times a day. Do not swallow. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take elderberry syrup.",
      "content": "Take elderberry syrup. Elderberries are said to be a great natural immune booster, and are therefore very popular as a natural cold remedy. Elderberry contains flavonoids, which have antioxidant properties and may help prevent damage to the body’s cells. However, very few studies have been done in humans, so researchers don't know how effective elder may be. You can use elderberries in a number of ways: [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Taking a spoonful of elderberry syrup every morning. This syrup can be found in most health food stores, or you can make your own. By adding a couple of drops of elderberry extract (also found in health food stores) to a glass of water or juice. Or by drinking elderberry tea - a hot beverage with elderflowers and peppermint leaves."
    },
    {
      "title": "Eat a spoon of raw honey.",
      "content": "Eat a spoon of raw honey. Raw honey is an effective natural immune booster, which also contains anti-viral properties and soothes sore throats making it a primary ingredient in many natural cold remedies. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can eat a spoonful of the raw honey by itself or stir it into warm water or tea. Another great cure for a cold is to have a glass of milk mixed with a spoonful of turmeric powder, then chase it down quickly with a spoonful of honey. Try to source raw honey from your local area, as it will help your body to develop a tolerance for allergens native to your region."
    },
    {
      "title": "Eat garlic.",
      "content": "Eat garlic. Garlic boasts an impressive array of health benefits, thanks to its antimicrobial, antiviral and antibiotic properties. There is some evidence to suggest that raw garlic can help to relieve cold symptoms, shorten a colds duration and boost the immune system, thus preventing future cold. [25] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take natural supplements.",
      "content": "Take natural supplements. There are certain natural supplements which are believed to help with cold symptoms. While they won't necessarily cure the cold or stop it in its tracks, they can help it to go away faster. For example: [27] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take some time off.",
      "content": "Take some time off. One surefire way to make your cold drag on and on - for days or even weeks - is to continue with your normal routine and not give your body time to recuperate. Additionally, a cold is highly contagious, so taking time off can help prevent the spread to others. [31] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The best way to get over a cold quickly is just to take a few days off, hold up somewhere warm and cozy, and give your body a break. Aside from that, the common cold is a virus which attacks and weakens the immune system, making you more susceptible to contracting other illnesses or your cold becoming worse. Therefore, staying in your home environment is the safest option, at least until you start to feel well again."
    },
    {
      "title": "Get plenty of rest.",
      "content": "Get plenty of rest. Try to remember that your body is doing its best to fight off the cold virus and it needs all the energy it can get in order to win. Over-exerting yourself with housework, exercise, traveling, or other physical activities will just prolong the cold and make you feel worse. Ensuring that you get at least eight hours of sleep a night also makes you less susceptible to catching a cold in the future. [32] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even if you can't sleep, try curling up on the couch with a warm blanket and a hot drink, Use this time as an excuse to binge on multiple re-runs of Friends or read the entire Harry Potter series. When sleeping, try to prop your head up on an extra pillow. It may feel a little strange if you're not used to it, but the raised angle will aid in the draining of your nasal passages. If it really feels uncomfortable, try placing the extra pillow beneath the bottom sheet or under the mattress on your bed, for a less severe angle. [33] X Research source"
    },
    {
      "title": "Stay warm.",
      "content": "Stay warm. What's the opposite of cold? Warmth! (Well, sort of). Even though cold weather or \"catching a chill\" doesn't actually cause a cold (the cold virus does), staying warm during the recovery process will help. So turn up the thermostat, light a roaring fire and pile on the blankets -- you'll feel much better soon. [34] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Despite the benefits of heat, dry heat can actually irritate inflamed nasal passages and sore throats. You can combat this by using a humidifier to add moisture back into the air. This can help to make breathing more comfortable. Just be aware that humidifiers can spread pathogens and molds."
    },
    {
      "title": "Drink lots of fluids.",
      "content": "Drink lots of fluids. [35] X Expert Source David Nazarian, MD Diplomate, American Board of Internal Medicine Expert Interview. 26 March 2020. All that nose-blowing and sweating it out under heavy blankets can leave you feeling dehydrated, which can worsen cold symptoms, leading to headaches and dry, irritated throats. [36] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try to drink slightly more than average when you're sick - whether the fluids come in the form of hots teas, soups, water-heavy fruit and veg (watermelon, tomato, cucumber, pineapple), or just plain water. A handy way to check for dehydration is to examine your urine. If it's very pale yellow or almost clear, you're doing okay. But if it's dark yellow, this means that there are higher concentrations of waste in your body that are not being diluted, which is a sign that you should drink more water."
    }
  ]
}