{
  "url": "https://www.wikihow.com/Delete-a-Group-on-Facebook-Messenger",
  "title": "How to Delete a Group on Facebook Messenger",
  "steps": [
    {
      "title": "Open the Messenger app on your phone or tablet.",
      "content": "Open the Messenger app on your phone or tablet. It's the blue, pink, and purple chat bubble icon with a lightning bolt inside. You'll find it on your home screen or in your app list."
    },
    {
      "title": "Tap the Home or Chats tab.",
      "content": "Tap the Home or Chats tab. If you're using an Android, tap the icon of a house at the bottom of the screen. [1] X Research source If you're using an iPhone or iPad, tap the speech bubble icon labeled Chats at the bottom of the screen. If Messenger opens up to a conversation, tap the back button to go back to your Home screen first."
    },
    {
      "title": "Tap the group chat you want to delete.",
      "content": "Tap the group chat you want to delete. This displays the contents of the chat."
    },
    {
      "title": "Tap the name of the group chat.",
      "content": "Tap the name of the group chat. If the chat has a name, you'll see it at the top of the screen. If not, you'll see the names of a few people in the chat. Tapping this displays information about the chat."
    },
    {
      "title": "Tap Members or See Group Members.",
      "content": "Tap Members or See Group Members . This displays all members of the group."
    },
    {
      "title": "Make sure you are a group admin.",
      "content": "Make sure you are a group admin. Only group admins can delete the group. To check if you are an admin, tap ADMINS at the top. If your name is there, you're an admin and can remove other members and delete the group. After checking, tap the ALL tab at the top to return to the full list of group members."
    },
    {
      "title": "Remove all group members except for yourself.",
      "content": "Remove all group members except for yourself. To delete the group, you'll need to remove all of the other members first and remain a member. To delete a member, tap their name and select Remove from Group . Repeat this until the only remaining member is yourself. If you leave a group without removing all the other members, the group chat will continue without you."
    },
    {
      "title": "Tap the back button to return to the group details.",
      "content": "Tap the back button to return to the group details. Now that you've removed all the members, there are only a few remaining steps. At this point, if you don't mind keeping the message in your inbox, you can tap Leave group toward the bottom to leave the group yourself. If you actually want to delete the message from your inbox permanently, continue with this method."
    },
    {
      "title": "Ignore future messages from this conversation.",
      "content": "Ignore future messages from this conversation. To be able to delete the chat permanently, you'll need to ignore it first. Tap Ignore Messages on the chat, and then tap Ignore to confirm. This moves the group chat to your Spam messages."
    },
    {
      "title": "Open your Spam messages.",
      "content": "Open your Spam messages. Here's how: Tap the back button until you've returned to the Chats or Home tab. This is the tab that contains a list of all of your conversations. Tap your profile icon at the top-left corner. Tap Message Requests on the menu. Tap the SPAM tab at the top. This is where you'll find the group chat you ignored, as well as any messages that you've filtered as spam."
    },
    {
      "title": "Swipe left on the message and tap Delete.",
      "content": "Swipe left on the message and tap Delete . A confirmation message will appear, asking if you want to permanently delete the conversation."
    },
    {
      "title": "Tap Delete to confirm.",
      "content": "Tap Delete to confirm. This permanently deletes the group message from your inbox."
    },
    {
      "title": "Go to https://www.facebook.com/messages in a web browser.",
      "content": "Go to https://www.facebook.com/messages in a web browser. If you're not signed in, you'll be prompted to do so now."
    },
    {
      "title": "Click a group chat on the left panel.",
      "content": "Click a group chat on the left panel. This displays your chat in the center panel, and a list of chat members and other features in the right panel. You can also use the Search Messenger bar in the upper-left corner if you remember the group name, members, or the content of the chat conversation."
    },
    {
      "title": "Make sure you're a group admin.",
      "content": "Make sure you're a group admin. Take a look at the far-right panel—you'll see a section called \"Chat Members.\" As long as you see \"Admin\" listed below your name in the Chat Members list, you'll be able to remove group members and delete the chat. If you don't see the Chat Members list in the right panel, click the small \"i\" in a circle at the upper-right corner of the chat to expand it."
    },
    {
      "title": "Remove all group members except yourself.",
      "content": "Remove all group members except yourself. To remove a group member, click the three horizontal dots on any name in the Chat Members list, select Remove Member , and then click Remove from Chat to confirm. [2] X Research source Repeat this until you've removed everyone from the group except yourself. If you leave a group without removing all the other members, the group chat will continue without you."
    },
    {
      "title": "Click the Privacy & Support menu.",
      "content": "Click the Privacy & Support menu. It's in the right panel below the Chat Members list. This expands more options."
    },
    {
      "title": "Click Ignore Messages.",
      "content": "Click Ignore Messages . Before you can delete a group, you'll need to ignore it, which will automatically move it into your Spam messages. It can be deleted from there. A pop-up warning will appear."
    },
    {
      "title": "Click Ignore Messages to confirm.",
      "content": "Click Ignore Messages to confirm. The message will now move away from your inbox and into your spam box."
    },
    {
      "title": "Click the three horizontal dots next to \"Chats\" ••• .",
      "content": "Click the three horizontal dots next to \"Chats\" ••• . This is at the top of the left panel, above your list of conversations. A menu will expand."
    },
    {
      "title": "Click Message Requests on the menu.",
      "content": "Click Message Requests on the menu. Now you'll see a list of messages people have attempted to send you, as well as a section titled \"See Spam.\""
    },
    {
      "title": "Click See Spam.",
      "content": "Click See Spam . It's below any messages that appear in your Message Requests box. This is where you'll find the group chat you ignored."
    },
    {
      "title": "Click the three horizontal dots on the chat ••• .",
      "content": "Click the three horizontal dots on the chat ••• . A menu will expand."
    },
    {
      "title": "Click Delete Chat and then Delete Chat again to confirm.",
      "content": "Click Delete Chat and then Delete Chat again to confirm. The chat is now deleted."
    }
  ]
}