{
  "url": "https://www.wikihow.com/Fix-a-Leaky-Outdoor-Faucet",
  "title": "How to Fix a Leaking Outdoor Faucet",
  "steps": [
    {
      "title": "Check if the bonnet nut is loose and tighten it if needed.",
      "content": "Check if the bonnet nut is loose and tighten it if needed. The simplest way to fix an outdoor spigot when it's leaking from the top is to tighten the bonnet nut that secures the handle to the stem (also known as a packing nut). Before starting the repair, close the water supply valve that lets water flow from the main water line into the spigot. Next, twist the nut gently with your fingers to check if it's loose. If it is, use an adjustable wrench to turn it the right (or clockwise), following the righty tighty, left loosey rule until it's snug. [1] X Research source After tightening the bonnet nut, turn the water supply valve back on, twist the faucet handle to the On position, and watch the top of the spigot for leaks. If it's still leaking, move on to the next repair on our list. Jones says the shutoff valve for your outdoor faucet is likely located in the basement, a closet, or an access panel on the opposite side of the wall, inside the house. If the valve is a ball valve, close it by turning it perpendicular to the pipe. For every other type of valve, \"Rotate [it] to the left to turn on the water flow and to the right to turn it off.\""
    },
    {
      "title": "Remove the stem from the top of the faucet.",
      "content": "Remove the stem from the top of the faucet. The stem is the part that controls water flow into the faucet. When the handle is tightened, it pushes the stem down into the valve seat and prevents water from flowing into the spout. When the handle is loose, the stem retracts and releases the water. There are two important components inside the stem — the O-ring and the bonnet packet — causing your leak, but you have to take out the stem to check them. Follow our instructions below for removing the stem: Turn off the water supply valve to the outdoor faucet, turn the faucet on, and let the remaining water in the valve drain out onto the ground or into a bucket. Use an adjustable wrench to turn the bonnet nut to the left to loosen it and pull the stem out of the faucet. [2] X Research source"
    },
    {
      "title": "Replace the O-ring on the stem if it's damaged.",
      "content": "Replace the O-ring on the stem if it's damaged. An O-ring located further up the stem prevents water from leaking out around the top of the bonnet nut when the handle is loose. If the O-ring wears out with age or becomes damaged, you might see a leak in that part of the bonnet. Here's how to replace the O-ring: [3] X Research source Grip the bonnet nut in one hand and twist the handle with the other hand to lower the stem until you find the O-ring. [4] X Research source Pry the O-ring off the stem and pull it off with a pointed scriber . Then, slide on the new O-ring and reassemble the stem inside the faucet. [5] X Research source"
    },
    {
      "title": "Check the bonnet packing on the stem and replace it if it's worn.",
      "content": "Check the bonnet packing on the stem and replace it if it's worn. Bonnet packing is a ring (typically made out of Teflon) that prevents water from leaking out between the bonnet nut and the faucet housing. [6] X Research source Much like the O-ring in the previous repair, if the packing is worn out or broken, it's the likeliest cause of the leaks you're noticing. We guide you through the packing replacement process below : Look at the ring just underneath the bonnet nut. This is the bonnet packing. If it appears thin or cracked, unscrew it with your fingers to remove it. [7] X Research source Replace the packing with a new Teflon ring (or use Teflon tape if you don't have a replacement handy). [8] X Research source Reassemble the stem, reattach it to the faucet, and turn the water supply and the handle back on to test for leaks."
    },
    {
      "title": "Remove the stem and replace the stem washer if it's damaged.",
      "content": "Remove the stem and replace the stem washer if it's damaged. A washer located at the bottom of the stem prevents the water from flowing through the valve and out of the spout when the handle is tightened and releases it when the handle is loose. If the stem washer is damaged, it can allow water to leak up into the spout, even when the handle at the top of the spigot is tightened. Here's how to replace the stem washer : [9] X Research source Find the water supply valve on the interior side of the wall where the outdoor faucet is located. If it's a ball valve, shut it off by turning the handle perpendicular to the pipe. If it's a regular valve, turn it to the right to close it. Turn the handle counterclockwise on the outdoor faucet to drain the remaining water onto the ground. Then turn it clockwise to close the valve. Remove the stem from the faucet with an adjustable wrench and locate the screw at the bottom. Use a Phillips head screwdriver in the right size to loosen the screw and set it aside. Remove the old stem washer and replace it with a new, matching one. Reinstall the screw, then put the stem back together and attach it to the faucet. Make sure to test for leaks by reopening the water supply valve."
    },
    {
      "title": "Repair the valve seat if it's worn down.",
      "content": "Repair the valve seat if it's worn down. When the handle on the spigot is tightened, the stem washer presses up against the valve seat to seal the hole where the water is supposed to flow out into the spout. If the washer is worn out and thin in some areas, the stem may grind against the valve seat whenever you turn the handle, creating an uneven surface with gaps where water can sneak through. [10] X Research source We explain below how to grind the valve seat and create a more even surface for the stem washer to bond with : Shut off the water supply line to the outdoor faucet and ensure all the water is drained out of the valve. Remove the handle and stem from the faucet by twisting the bonnet nut counterclockwise with an adjustable wrench. Insert a faucet reseating tool , grinder-end first, into the faucet where you removed the stem and handle (make sure to select the grinder size that fits inside the pipe). Push it in until the narrow end of the plastic cone is fully inserted into the faucet and won't go in any further. [11] X Research source Press gently on the faucet reseating tool to hold it squarely in place, then twist the handle 4-5 times. Avoid grinding too much, or the valve seat might become too thin. [12] X Research source Take the faucet reseating tool out and brush or wipe out any metal shavings or debris out of the faucet. Next, put the stem and handle back in, and try the faucet out to see if it still leaks. If it does, you may need to repeat this process. [13] X Research source"
    },
    {
      "title": "Replace the faucet if it's corroded, rusted, or cracked.",
      "content": "Replace the faucet if it's corroded, rusted, or cracked. Over time, outdoor faucets can corrode, rust, or crack from frozen pipes, too much or too little water pressure, constant leaks, or the natural deterioration of old materials. Unless you're already an experienced plumber, the best solution may be to call a professional and have them assess the situation. They may need to replace the entire faucet. [14] X Research source"
    },
    {
      "title": "Avoid overtightening or yanking on the faucet handle.",
      "content": "Avoid overtightening or yanking on the faucet handle. Overtightening the handle or yanking on it can cause the faucet's internal components to wear down or even break. Loosen and tighten the handle with gentle, firm pressure, and avoid being too rough with it. [15] X Research source"
    },
    {
      "title": "Ensure the water pressure doesn't exceed the faucet's rating.",
      "content": "Ensure the water pressure doesn't exceed the faucet's rating. Outdoor faucets come rated from the manufacturer for a certain amount of water pressure. If the pressure is too high or too low, it can cause the parts to wear out faster and lead to leaks. To check the pressure of the water pouring out of the outdoor faucet, turn the water off and attach a water pressure gauge to the spout. Turn the water back on and watch the gauge to see which pressure rating it stops on. [16] X Research source Look for a water pressure rating of 45-60 PSI (or whatever the faucet manufacturer calls for). If the PSI falls below or above that range, adjust the water pressure by twisting the screw on the water pressure regulator for your home (typically found near the water meter). Turn the screw clockwise to increase the PSI and counterclockwise to lower it. Then test the pressure coming out of the spigot again. https://www.angi.com/articles/increase-water-pressure-outdoor-spigot.htm If you have trouble finding the regulator or don't feel comfortable making this type of repair, call a professional plumber."
    },
    {
      "title": "Drain and cover your outdoor faucets during freezing weather.",
      "content": "Drain and cover your outdoor faucets during freezing weather. To protect your outdoor faucets from freezing before the temperature in your area drops below 32 °F (0 °C)), Jones recommends shutting off the water supply valve leading to your outdoor spigot. Twist off the hose connected to the spigot, then turn the handle to let any remaining water in the valve drain. Turn the handle back off, then buy and install a hose bib insulation kit . The hose bib insulation kit comes with \"Styrofoam covers that you cinch up tight against the brick or siding on your house,\" Jones says, adding that \"they do a good job of protecting your outdoor faucets from cold and wind chill.\" Jones also suggests fixing any leaks in your outdoor faucet before the freezing weather hits. So, keep an eye on the weather forecast and make your repairs as soon as possible!"
    },
    {
      "title": "Check your outdoor faucets twice a year for leaks.",
      "content": "Check your outdoor faucets twice a year for leaks. Keeping an eye on your faucets throughout the year will help you identify and fix minor issues before they become expensive plumbing projects. [17] X Research source It's also a good idea to check on them before the first freeze of the year, especially since you'll have to winterize them (and wrap your outdoor pipes ) anyway."
    }
  ]
}