{
  "url": "https://www.wikihow.com/Cure-Dehydration-at-Home",
  "title": "How to Cure Dehydration at Home",
  "steps": [
    {
      "title": "Assess the severity to make sure it's safe to treat it.",
      "content": "Assess the severity to make sure it's safe to treat it. Mild to moderate dehydration can usually be treated at home, but children need emergency medical care for severe dehydration. Signs of mild to moderate dehydration include thirst, dry or sticky mouth, crying unaccompanied by tears, infrequent urination, dark yellow urine, skin that feels dry and cool, headache, and muscle cramps. Signs of severe dehydration include sunken eyes, lethargy, irritability, fatigue, dizziness, rapid pulse, and unconsciousness. A sunken soft spot on top of an infant's head is another sign of severe dehydration."
    },
    {
      "title": "Prepare an oral rehydration solution.",
      "content": "Prepare an oral rehydration solution. The age of the child will determine how much to provide, but as a general guideline, prepare the solution as directed on the product label. Use a spoon or syringe to give your child 1 to 2 tsp (5 to 10 ml) of prepared oral rehydration solution every few minutes. Continue for at least 3 to 4 hours, or until the child's urine becomes clear in color. Increase the amount gradually as vomiting subsides. [1] X Research source Oral rehydration solutions provide balanced doses of water and salts, so they rehydrate while simultaneously replenishing lost electrolytes. Note that room temperature fluids might be easiest to swallow, especially if your child is vomiting or nauseous."
    },
    {
      "title": "Continue usual feedings for infants.",
      "content": "Continue usual feedings for infants. If your baby is still on breastmilk or formula, continue feeding it to him or her. You may need to give smaller amounts at more frequent intervals if your baby has a hard time keeping fluids down. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For formula-fed babies suffering with diarrhea, switch to a lactose-free formula until symptoms improve. Lactose can be difficult to digest and may worsen the diarrhea, thereby worsening the dehydration, too. Do not dilute formula any further than the instructions or your doctor advise. You may need to alternate both oral rehydration solution and breastmilk/formula. Consider giving your baby a sip of oral rehydration solution each time you offer them a bottle of breastmilk or formula."
    },
    {
      "title": "Avoid potentially harmful foods and drinks.",
      "content": "Avoid potentially harmful foods and drinks. Certain foods and drinks can make dehydration worse, so it's important to avoid giving them to your child until he or she improves. Avoid milk, caffeine, undiluted fruit juice, and gelatin. Caffeine worsens dehydration. Milk, fruit juice, and gelatin can worsen the vomiting or diarrhea causing your child's dehydration, thereby making the condition more severe. [3] X Research source Plain water can actually be dangerous when a child is dehydrated. The body loses salts and minerals during dehydration, and plain water can dilute this already low concentration of essential minerals even further. Similarly, sports drinks replenish lost electrolytes, but only those lost through sweating. If your child is dehydrated due to diarrhea or vomiting, sports drinks will not be able to replenish the minerals they have lost."
    },
    {
      "title": "Prevent recurring episodes by monitoring them closely.",
      "content": "Prevent recurring episodes by monitoring them closely. Once you succeed in rehydrating the child, you should continue monitoring his or her condition closely. Careful treatment may prevent another episode of dehydration. Increase the amount of fluids your child drinks while they're ill, especially if they suffer with diarrhea or vomiting. Breastmilk and formula are best for infants. Cold water, popsicles, diluted juice, and ice chips are best for older children. Avoid foods that may make vomiting and dehydration worse. These include fatty foods, foods high in sugar, lean meats, complex carbohydrates, yogurt, fruits, and vegetables. Fevers and sore throats can make it more difficult for children to intake fluids, so children suffering with these symptoms may also be given acetaminophen or ibuprofen."
    },
    {
      "title": "Assess the severity to make sure you can treat it.",
      "content": "Assess the severity to make sure you can treat it. Mild to moderate dehydration in adults can usually be cured at home without much risk of complication, but severe dehydration will require emergency medical care. [4] X Research source Adults with mild to moderate dehydration may experience increased thirst, a dry or sticky mouth, difficulty urinating, dark yellow urine, skin that feels dry or cool to the touch, headaches, and muscle cramps. Adults experiencing severe dehydration will likely have a lack of urination, amber-colored urine, shriveled skin, irritability, confusion, dizziness, rapid pulse, rapid breathing, sunken eyes, listlessness, shock, delirium, or unconsciousness."
    },
    {
      "title": "Take in clear fluids to rehydrate your body.",
      "content": "Take in clear fluids to rehydrate your body. Plain water and drinks containing electrolytes are your best options. As a general rule, you should drink as much as you can without making any nausea or vomiting worse. Most adults need between 2 and 3 quarts (2 and 3 liters) of fluids per day. If you're dehydrated due to nausea or a sore throat, try sucking on ice chips or popsicles made from juices and sports drinks. Electrolyte imbalance is not as grave a danger in adults as it is in children, but it's still something worth noting. Consider drinking oral rehydration solutions or sports drinks to help replenish some of the electrolytes your body loses when it becomes dehydrated. Oral rehydration solutions are best if you're dehydrated due to illness, but sports drinks work well if you're dehydrated due to overexertion."
    },
    {
      "title": "Cool down so your body doesn't lose more fluids.",
      "content": "Cool down so your body doesn't lose more fluids. Acute dehydration is often caused by exposure to excessive heat or accompanied by an elevated body temperature. In either circumstance, you should try to cool down to prevent the body from losing additional water content. [5] X Research source Remove excess clothing and loosen necessary clothing so that it doesn't smother the skin. Sit in a cool area. Move into an air-conditioned building if possible. If this isn't possible, sit in the shade outdoors or sit near an electric fan indoors. Cool your skin with water. Place a wet towel around your neck or on your forehead. Mist your exposed skin with lukewarm water using a spray bottle. Note that the cooling process must happen gradually. Exposure to excessive cold can cause the blood vessels to body to shiver, thereby raising its internal temperature. For this reason, do not attempt to use ice packs or ice water to cool your skin."
    },
    {
      "title": "Control any associated gastrointestinal symptoms.",
      "content": "Control any associated gastrointestinal symptoms. When dehydration is caused by vomiting or diarrhea, you should try to control these symptoms through diet and medication to prevent any additional loss of water. [6] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source In many cases, over-the-counter loperamide can control diarrhea. Do not use this medication if you have a fever or if there is blood mixed in with the diarrhea, however. Use acetaminophen instead of ibuprofen for help controlling any fever you might have. Ibuprofen can irritate the stomach lining and may make vomiting worse. Stick with clear fluids, including broths and gelatins, for the first 24 hours. As the vomiting and diarrhea subside, gradually reintroduce bland foods back into your diet."
    },
    {
      "title": "Drink more fluids throughout the day to avoid dehydration.",
      "content": "Drink more fluids throughout the day to avoid dehydration. The average adult male needs approximately 13 cups (3 L) of fluid daily, while the average adult woman needs about 9 cups (2.2 L). [7] X Research source Increase your fluid intake to match or slightly exceed these ideal amounts. Water is important, but these recommendations refer to the overall amount of necessary fluid and not the necessary amount of plain water. That being said, certain beverages are better than others. Water, herbal tea, juice, sports drinks, and other electrolyte beverages will help hydrate you, but drinks with caffeine (coffee, soda, black tea) or alcohol can actually make dehydration worse."
    },
    {
      "title": "Consume fruits and vegetables that have a high water content.",
      "content": "Consume fruits and vegetables that have a high water content. Fruits and vegetables with high water content can help replenish lost fluids. Since these foods also contain nutrients, salts, and sugars, they can help restore the proper balance of electrolytes, too. Bananas are a notably excellent choice. The water content of a banana can be as high as 75 percent, and they're also rich in potassium, a mineral that tends to decrease as dehydration worsens. Additional fruits and vegetables worth consuming for the sake of hydration include watermelon, tomatoes, grapes, peaches, cantaloupe, strawberries, cranberries, apples, blackberries, apricots, cucumbers, broccoli, and zucchini."
    },
    {
      "title": "Drink decaffeinated tea so it won't further dehydrate you.",
      "content": "Drink decaffeinated tea so it won't further dehydrate you. Chamomile tea, in particular, can be especially helpful when treating chronic dehydration. Nearly any herbal tea or other naturally decaffeinated tea can help replenish lost water content, however. Chamomile tea is considered to be a natural pain reliever, which is one main it is recognized as a powerful treatment for dehydration. As the body becomes dehydrated, stomach muscles may begin cramping. Chamomile tea is an effective way to rehydrate the body while treating those cramps."
    },
    {
      "title": "Try coconut water to rehydrate you and replace lost electrolytes.",
      "content": "Try coconut water to rehydrate you and replace lost electrolytes. Coconut water is rich in electrolytes, so it can actually be better for chronic dehydration than standard water. Among other nutrients, it contains notable amounts of iron and potassium. Both of these nutrients tend to be depleted as the body grows more dehydrated. Note that coconut water is different from coconut milk. For the sake of curing dehydration, coconut water is the better option of the two."
    },
    {
      "title": "Take an Epsom salt bath so your body will absorb the minerals.",
      "content": "Take an Epsom salt bath so your body will absorb the minerals. Fill the bathtub with hot water and dissolve 1 to 2 cups (250 to 500 ml) of Epsom salts. Once the salt dissolves, soak in the bath for roughly 15 minutes. Your body can absorb magnesium from the bathwater through the skin, which may reduce any inflammation, fatigue, or soreness caused by chronic dehydration. [8] X Research source The sulfates in the salt water can also aid in your body's ability to absorb nutrients, which may make it easier for your body to correct its electrolyte levels."
    },
    {
      "title": "Visit your doctor if you or your child doesn't improve with fluids.",
      "content": "Visit your doctor if you or your child doesn't improve with fluids. Mild to moderate dehydration should improve after you start administering fluids or an ORS. However, this isn't always the case. If you or your child's dehydration symptoms persist or worsen, see your doctor to find out if you need additional treatment. [9] X Research source Dehydration that doesn't improve can quickly become severe. You or your child needs immediate treatment."
    },
    {
      "title": "Get emergency treatment for signs of severe dehydration.",
      "content": "Get emergency treatment for signs of severe dehydration. Extreme dehydration may cause you or your child to get confused, dizzy, or lightheaded. Additionally, dehydration may cause extreme fatigue even after resting. If this happens, you or your child needs prompt medical treatment. Go to your doctor or the emergency room to get help. [10] X Research source You can recover if you get immediate treatment, so try not to worry. However, it's essential that you see a doctor right away."
    },
    {
      "title": "See your doctor immediately if you can't keep down fluids.",
      "content": "See your doctor immediately if you can't keep down fluids. It'll be difficult to replace your lost fluids if you can't keep fluids down. This means your condition could get serious very quickly. Visit your doctor to get treatment for your dehydration so you can recover quickly. [11] X Research source This means you may be vomiting up what you drink or may be struggling to drink anything at all."
    },
    {
      "title": "Go to the doctor if you've had diarrhea longer than 24 hours.",
      "content": "Go to the doctor if you've had diarrhea longer than 24 hours. Diarrhea is one of the most common causes of dehydration, and it can lead to severe symptoms. After 24 hours of diarrhea, you'll have lost a lot of fluids. Fortunately, your doctor can help you recover. [12] X Research source Every time you have diarrhea, your body releases fluids along with your bowel movement. That means you need to be taking in extra fluids while you're recovering."
    },
    {
      "title": "Visit your doctor if you have black or bloody stool.",
      "content": "Visit your doctor if you have black or bloody stool. While you likely don't need to worry, this can be a sign that you're very dehydrated or that something is wrong. Go to your doctor to get checked out to make sure you're okay. They can figure out what's going on so you can get the right treatment. [13] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get your fluids replaced by an IV if you have severe dehydration.",
      "content": "Get your fluids replaced by an IV if you have severe dehydration. Intravenous fluids that contain salt are the quickest way to replace lost fluids. Your doctor can administer fluids at a hospital. This will help you recover quicker. Consult your doctor about IV fluids if you or your child are severely dehydrated. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Sometimes IV fluids can be lifesaving when it comes to dehydration. Additionally, an IV can relieve your symptoms quickly."
    }
  ]
}