{
  "url": "https://www.wikihow.com/Find-an-Old-Friend",
  "title": "How to Find an Old Friend",
  "steps": [
    {
      "title": "Write down as many details as you can remember.",
      "content": "Write down as many details as you can remember. If your search ends up dragging on or producing unclear results, you'll be thankful for as much detail as possible. Try to remember your friend's hair color, height, maiden name, family members' names, and the names of all towns they lived in and places they worked for. [1] X Research source"
    },
    {
      "title": "Get in contact with other people that knew the specific person you're searching for.",
      "content": "Get in contact with other people that knew the specific person you're searching for. Ask them questions about when they've last seen them, talked to them, or any personal information like last known email addresses or phone numbers. If you and your friend had a major falling-out, some of your contacts may not cooperate. It's worth combing your address book to see if you have written down any connections to them that you have forgotten about."
    },
    {
      "title": "Know how to search online.",
      "content": "Know how to search online. A simple search engine attempt often doesn't lead anywhere, but it's worth a try. Whether you're using Google or one of the more specialized services described later, it pays to know how to make your search more effective: [2] X Research source Search for nicknames as well, even if your friend didn't have one when you knew them. For instance, an \"Elizabeth\" might now go by \"Beth,\" \"Betty,\" or \"Liza.\" Search for just the first name, in case your friend's last name changed with marriage or divorce. On search engines, enclose your friend's name in quotation marks, then add more information such as the school they went to, the city they lived in, or the business they worked for."
    },
    {
      "title": "Search for your friend's name on Google Image search.",
      "content": "Search for your friend's name on Google Image search. If you see a face that may be your friend, follow the link to the website the image showed up on. Even if this doesn't lead to contact, you might find a more up-to-date photograph of your friend, which can help you identify them in later search results. [3] X Research source"
    },
    {
      "title": "Use social media sites.",
      "content": "Use social media sites. Search for your friend's full name on Facebook, Twitter, LinkedIn, and other social websites, as well as Google or other search engines. [4] X Research source On Facebook, type in a name in the top search bar and hit enter. On the left-hand pane, select People . A list of filters should appear at the top of your search, where you can enter possible locations, workplaces, or schools."
    },
    {
      "title": "Use dedicated people-search websites.",
      "content": "Use dedicated people-search websites. Pipl is one of the more impressive free search services out there. You can also try ZabaSearch , or purchase a search for a few dollars on Intelius , radaris , peekyou , Veromi.com, or Spokeo.com. You can often take the free partial results from several commercial search sites and patch together phone numbers and addresses, without actually paying for the data. Every site has different information, though most of it tends to be pretty stale. Spokeo tends to have the freshest data. Make sure to scroll all the way through the Pipl results. An email address may be buried in an old blog post, online survey, or forum comment."
    },
    {
      "title": "Sign up for friend-finding websites.",
      "content": "Sign up for friend-finding websites. This works best if you suspect your friend may be looking for you as well, since these websites leave public messages for people to find. Try Lost Friends Be very cautious with sites that require a credit-card sign up, as they may be scams, or end up being more expensive than you anticipated. All the options above are free. Check your Spam or Junk Mail folder for the confirmation email while signing up."
    },
    {
      "title": "Search by alma mater, military service, or business.",
      "content": "Search by alma mater, military service, or business. Many alumni sites require paid memberships to use, or will ask your friend to pay in order to view your message. Still, some of these sites can be useful resources, if you know where your friend went to school. ZoomInfo's search is a great resource for people in the corporate world. BatchMates is a free alumni reunion site. It is focused on India but includes members worldwide. If your friend served in the US military, check its online Buddy Finder ."
    },
    {
      "title": "Search marriage records.",
      "content": "Search marriage records. Search online for \"marriage records\" and the name of the country your friend last lived in, or their state if they lived in the US. These records are often only available in person, but your state or county website should direct you to the office where you can check these in person. [5] X Research source If you do find a marriage record, but no accompanying contact information, you still have the name of a new person to search for (the spouse), as well as a potential change of name to take into account."
    },
    {
      "title": "Check US political contributions.",
      "content": "Check US political contributions. In the United States, if your friend donated more than $200 to a political campaign within 10 days of an election, their name is recorded on the Federal Election Committee website, often with an address as well."
    },
    {
      "title": "Search court records.",
      "content": "Search court records. Again, you'll need to search for \"court records\" along with the name of the country or state your friend lived in, as there is no single database where you can look these up. In many cases, you'll need to file a request with a specific court to get more information, so this method can take a fair amount of time. [6] X Research source Do not be fooled by scam sites that charge you money to search government databases."
    },
    {
      "title": "Use the UK electoral register.",
      "content": "Use the UK electoral register. To search this database for free, inquire of your local Electoral Registration Office, or ask your local library staff whether the service is available. [7] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source You can also pay a few pounds to a private company to perform this search for you."
    }
  ]
}