{
  "url": "https://www.wikihow.com/Draw-in-3D",
  "title": "How to Draw in 3D",
  "steps": [
    {
      "title": "Draw a square.",
      "content": "Draw a square. Creating a 3D box begins by simply drawing a square with your pencil, since some lines may need to be erased. The square can be a variety of sizes, but it should only take up a quarter of the page at most. Center it on the page, so there is room to draw the rest of the box.< In the final drawing, this first square will serve as the front of your box."
    },
    {
      "title": "Draw a second square that intersects with the first square.",
      "content": "Draw a second square that intersects with the first square. Place the second square positioned slightly to one side and above the first square. Begin by drawing the bottom line of the second square so its center intersects with the center of the left side of the first square. Then draw the right side of the second square so that its center intersects with the center of the top of the first square. Then finish drawing the top and left side of the second square. The second square should be exactly the same size as the first square. This second square will be the back of the cube in the final drawing."
    },
    {
      "title": "Add lines to connect the 2 squares.",
      "content": "Add lines to connect the 2 squares. Connect each corner of the first square to its corresponding corner on the second square. For example, draw a line from the upper left-hand corner of the first square to the upper left-hand corner of the second square. These lines will create the illusion of the top, bottom, and sides of the cube."
    },
    {
      "title": "Erase the lines to make the cube look solid, if necessary.",
      "content": "Erase the lines to make the cube look solid, if necessary. If you are trying to draw a solid cube, as opposed to a transparent one, you need to erase some of the lines you have drawn. Erase any line that you wouldn't be able to see from the angle you have drawn. Lines to erase include the bottom right-hand side connecting line, the right-hand side of the second square, and the bottom line of the second square. It may seem strange that you needed to draw these lines in the first place, but they helped you draw the cube in the right shape."
    },
    {
      "title": "Color the sides of the cube if you like.",
      "content": "Color the sides of the cube if you like. To highlight the 3D perspective of your drawing, you can color each side of the box a different color. This makes it clear that the drawing has depth and that each side of the box is distinctive."
    },
    {
      "title": "Draw variations of the 3D box.",
      "content": "Draw variations of the 3D box. Once you get the hang of drawing the 3D box, you can start drawing other shapes, such as a rectangular box. For a rectangular box, start by drawing a rectangle. Then draw a second rectangle slightly to one side and above the first. Finally connect the corresponding corners of both rectangles together. You can do other shapes , such as triangles, stars, or abstract shapes."
    },
    {
      "title": "Choose the object you would like to draw.",
      "content": "Choose the object you would like to draw. The object you pick needs to have a clear and simple outline, as this will make it easier to create your 3D drawing. For example, you could draw a hand, a banana, or a doughnut. Each has a simple outline and overall shape. [1] X Research source Trace the item you want to draw if it is a size that fits on your piece of paper. For instance, you can use your hand, as it will fit on a standard piece of paper and can easily be traced."
    },
    {
      "title": "Make a light preliminary outline of the object with pencil.",
      "content": "Make a light preliminary outline of the object with pencil. Either draw or trace the outline of the object you want to draw on your piece of paper. Center the object on the page, although it can touch the top or bottom of the paper if necessary. [2] X Research source Draw this outline lightly so you can erase any unnecessary pencil marks later in the process."
    },
    {
      "title": "Draw horizontal, parallel lines across the page.",
      "content": "Draw horizontal, parallel lines across the page. Cover the whole the whole paper with these lines except for inside the shape you have outlined. Make the lines close together, at most 0.25 inches (0.64 cm) apart all the way down the page. [3] X Research source It's easiest to draw these lines by using a ruler, so that they are completely straight and evenly spaced. If you are using lined notebook paper, you could trace over the existing lines"
    },
    {
      "title": "Draw curved lines inside the shape outline.",
      "content": "Draw curved lines inside the shape outline. Start each of these curved lines where one of the straight parallel lines touches the outline. Draw the curve across the entire outline and then come back down, connecting at the end to the corresponding straight line on the opposite side of your outline. [4] X Research source Each curved line will complete a horizontal line that goes all the way across the page. The curved lines should mimic the general shape of the item you are drawing. If the shape varies, the lines should gradually transition to follow the object's shape."
    },
    {
      "title": "Trace over the completed horizontal lines.",
      "content": "Trace over the completed horizontal lines. To make the 3D effect really pop, define the lines you have drawn. Trace the entire length of all of these lines, including the straight sections and the curved sections. You can use a pen, colored pencils, or marker to trace the lines. [5] X Research source The ink can be done in any one color or in a variety of colors."
    },
    {
      "title": "Erase the pencil outline.",
      "content": "Erase the pencil outline. After the ink has dried, erase the initial outline that you made. This will add to the 3D effect of your drawing and make the object pop off the page. [6] X Research source"
    },
    {
      "title": "Study your subject.",
      "content": "Study your subject. If you want to draw something in 3D that you have in real life, it can be help to look at its details. By looking at it, you can begin to understand how you will translate real world depth on to a flat surface . For example, if you want to draw a bowl of fruit sitting on a table, you should study how all the elements of your composition relate to each other. How much of the fruit, bowl, and table can you see? Where does each part intersect with the others? Where are shadows located and where does the light hit your objects?"
    },
    {
      "title": "Start a drawing with a horizon line.",
      "content": "Start a drawing with a horizon line. For drawings that aim to show a great distance, it's important to create a horizon line where the sky meets the land. This line creates a point that is the furthest away from the viewer. It should usually be located between a third and half of the way up your page and span the entire page. [7] X Research source This is a great way to start a landscape drawing. Once you draw the horizon line, you can begin drawing the foreground below it and the sky or large objects in the landscape above it."
    },
    {
      "title": "Incorporate a vanishing point in to a drawing.",
      "content": "Incorporate a vanishing point in to a drawing. A vanishing point is the spot where items in the distance disappear. In practical terms, it is the spot where parallel lines that go from the front of the image to the back of the image come together on the page. Marking this spot at the center of your horizon line allows you to have a spot to end items that are moving into the distance. [8] X Research source For instance, if you are looking straight down a road, there is a point in the distance where you can no longer see the road. While the road will be wide at the bottom of your drawing, which is the spot closest to the viewer, the sides of the road will come together and end at the vanishing point."
    }
  ]
}