{
  "url": "https://www.wikihow.com/Drift-on-a-Go-Kart",
  "title": "How to Drift on a Go Kart",
  "steps": [
    {
      "title": "Observe other drivers drift for valuable info.",
      "content": "Observe other drivers drift for valuable info. Each track is a little different, so if possible, try and observe other drivers on the track and how they approach a corner they are about to drift on. You can then use these tactics in your own drifting. [1] X Research source Watch for their speed, their lane, their direction, and at what point they begin the drift before the corner."
    },
    {
      "title": "Know the track before drifting.",
      "content": "Know the track before drifting. It's important that you've raced around the track several times first so that you know the severity and length of upcoming corners before arriving at them. There may be some hidden characteristics of a track that only a driver will be able to feel as they drive along, for example, the roughness of the road, if there are any blind corners, or how different weather conditions like rain can make the track slippery."
    },
    {
      "title": "Wear and use all the necessary safety equipment.",
      "content": "Wear and use all the necessary safety equipment. Before you start moving in a go-kart, make sure that you're wearing a suitable helmet that will protect your head in case of a crash. Additionally, strap yourself into the seat tight so that you're snug within the chassis of the kart. Although a failed drift usually results in your go-kart stopping in the middle of a corner, there's also a possibility that you'll hit the sides of the track if it goes wrong."
    },
    {
      "title": "Correct your posture to a straight back.",
      "content": "Correct your posture to a straight back. Even if you're an expert in a go-kart, always make sure that your back is straight and that you are leaning back in your seat. This will give you maximum control of the wheel, gas, and brakes for when you need to drift."
    },
    {
      "title": "Keep your speed up.",
      "content": "Keep your speed up. When approaching a corner your natural reaction may be to hit the brakes so that you can corner it. However, speed is necessary to drift. If you're going too slow you may end up cornering the turn normally. Practice performing higher speed turns around the track so you'll get a feel for how fast you need to go. Generally, most drifts are completed at speeds exceeding 40 miles per hour (64 km/h)."
    },
    {
      "title": "Remain calm at all times.",
      "content": "Remain calm at all times. When you're approaching a drift it may feel like you're out of control. Drifting is a strange sensation and it may feel too chaotic, but pro-drifters will say that drifting itself is a form of controlled chaos. If it's your first time attempting a drift, breathe in through the nose and out through the mouth to slow your heart rate. [2] X Research source If you don't feel confident that you'll be able to begin a drift on the oncoming corner, don't be afraid to take it normally and try again next time."
    },
    {
      "title": "Approach the corner in the outside lane.",
      "content": "Approach the corner in the outside lane. To complete a drift you need to approach a corner from the outer lane at all times. This will give you the maximum amount of space to complete a drift and minimise your risk of crashing into any other drivers while you're doing it. Usually the outside lane of a turn is a little darker on the track due to most racers following that line. If you can't intuitively see the outer lane, look at the track beneath you for a darker strip when approaching the corner."
    },
    {
      "title": "Accelerate as you approach the turn.",
      "content": "Accelerate as you approach the turn. Most corners are preceded by a straight section of the track. When you hit this area, start to accelerate your kart so that you have enough speed to drift. You will usually need to exceed 40 miles per hour (64 km/h) to complete a conventional drift. If you don't have enough speed coming into a drift, there's a strong chance you'll just end up taking the corner normally. A drift requires speed."
    },
    {
      "title": "Lean your kart and body away from the turn.",
      "content": "Lean your kart and body away from the turn. If the turn is curving right, lean your kart and your body left as you approach the turn (and vice versa). This will give you enough space to drift around the corner."
    },
    {
      "title": "Point your kart back in towards the turn.",
      "content": "Point your kart back in towards the turn. As quickly as you can, turn your kart towards the turn so that you're now facing the inside lane of the corner. If you are unsure of the drift, it's quite possible to over-correct at this moment which may kill the drift. If it helps, picture how you'd normally orientate your kart going around a turn, and try to emulate that position."
    },
    {
      "title": "Apply the brakes and pulse the gas to maintain the drift.",
      "content": "Apply the brakes and pulse the gas to maintain the drift. Gently apply the brakes then immediately release them. This will cause your kart to being drifting. Then, pulse the gas as you take the corner to maintain the drift. How much gas you need varies depending on the severity of the turn. A sharp turn will require a sharp and intense burst of acceleration whereas a gentle turn will require a long but low pulsing of the gas. Don't slam the brakes too hard, or you risk spinning out or stopping completely."
    },
    {
      "title": "Realign your kart.",
      "content": "Realign your kart. If it's your first time drifting there's a strong chance your kart won't be perfectly aligned with the track as you come out the other end of the corner. If this is the case, make sure to reorientate your wheels so that you're ready to tackle the next piece of the track."
    }
  ]
}