{
  "url": "https://www.wikihow.com/Decide-when-a-Friendship-Is-Over",
  "title": "How to Decide when a Friendship Is Over",
  "steps": [
    {
      "title": "Ask yourself if you like your friend.",
      "content": "Ask yourself if you like your friend. Sometimes people who have been in our lives a long time seem to acquire a kind of permanence, such that even after your lives have taken vastly different directions and have little in common, you still find yourself considering the person a friend. If you feel your friendship has become stale or if you don't feel any particular affection for the individual who you call friend, it is probably time to accept that the friendship's dead. [1] X Research source Evaluate the condition of the friendship. Do you care about your friend? If so, do they care about you to an equal or lesser degree? How important is your friendship? Look for signs of a weak or waning friendship."
    },
    {
      "title": "Think about how often you have conflicts with your friend.",
      "content": "Think about how often you have conflicts with your friend. Do you and your friend often have massive, unresolved arguments and misunderstandings? Do you constantly feel disappointed in your friend? Do they express similar frustration with or disappointment in you? If so, you should decide to end the friendship. Friends don't get along all the time, but you should be able to feel that basically, you and your friend see eye-to-eye most of the time."
    },
    {
      "title": "Do not tolerate hurtful friends.",
      "content": "Do not tolerate hurtful friends. If your friend is constantly criticizing you behind your back (or worse, to your face), it is time to end the friendship. While we do not always get along with our friends, they should, on balance, be kind, thoughtful, and considerate of our feelings. [2] X Expert Source Julia Lyubchenko, MS, MA Licensed Therapist Expert Interview. 29 April 2020. Deciding to end a friendship with individuals who are not is easy. For instance, if you see a social media message that reads, “[Your name] is such a dummy. They don't know anything!” you should not be friends with that person. Hurtful friends might also share secrets with others who were not meant to know them. For instance, suppose your parents are getting divorced and you told your friend about it and requested that they not share the info with anyone else. The next week, several other people who are not your friends ask you about the situation. In this case, your friend has clearly betrayed your trust and you should rightfully decide to end the friendship."
    },
    {
      "title": "Recognize when you are not important to each other.",
      "content": "Recognize when you are not important to each other. If you and your friend do not make time for each other, or only communicate when you see each other at school, at work, or in other convenient social situations, you can safely decide to end the friendship. Friends will make each other a priority, and will be there when the other is in need. Conversely, friends who are not eager to spend time with one another, or who are only around when things are easy, are poor friends. Exchange them for individuals who are more willing to put themselves on the line for you. You can still be friendly to the other person, but think of them as an acquaintance, rather than a friend."
    },
    {
      "title": "Avoid egotistical friends.",
      "content": "Avoid egotistical friends. These type of friends think they're the center of the world. If your friend always talks about themselves and never asks you about your day or what's going on in your life when you spend time together, this is a problem. [3] X Research source At the very least, they clearly don't value your company. Make the right choice and end the friendship. If your friend doesn't apologize after you two have a quarrel, this is also a sign of being egotistical."
    },
    {
      "title": "Accept that friendships change.",
      "content": "Accept that friendships change. [4] X Research source People change. Sometime this is good, and sometimes it is not so good. If you and your friend can change and grow together, and your ideas and attitudes remain in sync, great! However, if you and your friend grow apart, don't pretend that things are just as they always were. Allowing this “zombie friendship” to continue is futile for both you and your friend. Your friends do not have to be clones of you, but if you do not share the core values and interests as your friend, then the friendship has little common ground on which to build."
    },
    {
      "title": "Confront your friend about the problem.",
      "content": "Confront your friend about the problem. If you are considering ending a friendship because of a particular problem or issue you have with your friend, let them know. Real friends will always be honest with each other and address any problems they have with one another directly. [5] X Expert Source Julia Lyubchenko, MS, MA Licensed Therapist Expert Interview. 29 April 2020. Do not make casual remarks about a problem you want to address with your friend. For instance, if your friend does not listen to you and instead always insists on doing things their way, be assertive and draw attention to situations in which your friend exhibits the negative behavior. For example, do not say in an ambiguous way, “I'm not sure that I want to go to the farmer's market.” Instead say, “I already said I didn't want to go to the farmer's market. I feel like my opinion is not valued when I am left out of the decision-making process. Let's try to make a decision about our plans today together.” Use “I” statements as in the above example, and avoid accusatory “you” statements in the form of “You never listen to me” or “You always ignore my feelings.” [6] X Research source"
    },
    {
      "title": "Always be direct when dealing with your friend.",
      "content": "Always be direct when dealing with your friend. [7] X Research source Tell your friend what's on your mind if there is a problem that's bothering you. Be honest about how you feel and let your friend know in unambiguous terms what you want. [8] X Expert Source Julia Lyubchenko, MS, MA Licensed Therapist Expert Interview. 29 April 2020. Do not just ignore your friend and hope that they will figure out that you've decided to end the friendship. If you do that, your friend might be confused or worried about you. They might involve third parties like a mutual friend or your parents. They might also try to confront you directly at your home or place of work to figure out what you're feeling or thinking."
    },
    {
      "title": "Ask your friend what they want from you.",
      "content": "Ask your friend what they want from you. [9] X Research source Provide an open forum for your friend to air their grievances. They may or may not pertain to you. For instance, perhaps your friend's marriage is not going well and they feel that they cannot share it with anyone. Letting your friend know that you are able and willing to listen and empathize can improve the friendship and put your friendship back on the right track. Sometimes our friends have a hard time just coming out and telling us what they want. Therefore, asking your friend directly if they need anything is an important step in showing you're committed as a friend and want to build a strong friendship. For instance, if you think something is amiss with your friend, ask them general questions like, “Is everything alright?” If you suspect a specific problem, you might ask, for instance, “How are things with your spouse these days?” A close friend will open up to you and confess they have a problem or are feeling badly. Some friends have a difficult time talking about their feelings or personal problems, though, and in these cases all you can do is respect their privacy. Being there for your friends in times of need is what friendship is all about. Remind your friend, “If you ever want to talk about anything, I'm here for you.”"
    },
    {
      "title": "Be more thoughtful with your friend.",
      "content": "Be more thoughtful with your friend. If you value your friendship and do not want it to be over, look for simple ways to improve it. [10] X Research source Perhaps, for instance, your friend has ditched you and the rest of her friends in order to be with her boyfriend. Even though this is her fault, make an effort to understand her and let her know that you're still her friend. Invite her to lunch or a shopping trip, and let her know that you miss her company. Of course, improving the relationship should not be a one-sided affair. Look for signs that your friend, too, is putting an effort into maintaining a strong friendship with you. For instance, if your friend agrees to make time to meet up, this indicates that they are still interested in a friendship but has, perhaps, been too busy with work and other duties."
    },
    {
      "title": "Forgive your friend.",
      "content": "Forgive your friend. Friendship often means letting bygones be bygones. Is the offense your friend committed totally unforgivable? Or is it something which, in a week or two, will start to lose importance? While a given act or comment might seem truly heinous at the time, take a step back from the situation and try to put your friend's behavior into a reasonable context. Do not make excuses for your friend. If they did something wrong, they should admit it and apologize. Friends who do not take responsibility for their actions are not good friends. Forgiving your friend does not mean forgetting what they did. While it would be wrong to constantly bring up a past sin, you should keep you friend's bad behavior in the back of your mind at all times and be on the lookout for similar behavior in the future. Their disappointing behavior might be part of a larger pattern. [11] X Research source For example, if your friend said they were going to pick you up from school and then never did, you might rightly be upset with them. If they said they were asleep and didn't hear the alarm clock go off, their behavior might be forgiven as a fluke. However, if they consistently don't follow through on promises they make, and consistently have a lame excuse, you should be confident in your decision to end the friendship."
    },
    {
      "title": "Take a break from your friend.",
      "content": "Take a break from your friend. Even if you enjoy hanging out with a certain friend, sometimes their expectations and yours are different. If your friend tries to pressure you into spending all your time with them, and does not respect your boundaries, they might be clingy. Clingy friends form unhealthy attachments with others and can be very annoying and difficult to deal with. You don't have to end your friendship with a friend who is clingy or overbearing, though. Explain to your friend next time they offer to come over, or invites you to hang out, that you are a bit burned out and just want to stay in. Do not reply promptly to texts or messages you receive from a clingy friend, and be firm when announcing your decision to stay in (or go out) alone. [12] X Research source Even if your friend is not particularly clingy, you might feel fed up with them for some other reason. If you and your friend are constantly hanging out and doing everything together, or if your friend is just always asking you to hang out, you might start yearning for some privacy and alone time. Your break from your friend can last as long as you want it to, from one day up through one month or more. Give yourself the space you need. If your friend does not respect your need for a break, or becomes hostile when you suggest a break, think about ending the friendship altogether. A friend who does not respect your wishes is no friend at all."
    },
    {
      "title": "Confront your friend in person.",
      "content": "Confront your friend in person. After deciding the friendship is over, do not let your friend know with an email or text message. The best way to end the friendship is by talking about how you feel and what you want for the future of your friendship in person. Find a time when you can both meet and ensure that your friend does not have anything planned after your meeting (like going to work or a family gathering), since ending friendships can take an emotional toll. If you believe your friend might grow hostile or violent, do not meet them in person. Instead, write them a letter or an email explaining that you wish to end the friendship and provide your reasons for doing so. If your friend refuses to meet you at all, write a letter to your friend expressing how you feel. Write the things you wish you could say to them. You do not have to send the letter, though you certainly can if you think your friend would read it. [13] X Research source"
    },
    {
      "title": "Find the right words to end your friendship.",
      "content": "Find the right words to end your friendship. Explaining to someone that you've decided to no longer be their friend can be hard. The circumstances behind the dissolution of each friendship are unique. However, being honest and structuring the inevitable conversation in a logical way can help the process proceed more smoothly. Open the conversation with an acknowledgment that you have -- at some point -- enjoyed being friends with the individual. For instance, say, “We've had some great memories together. Remember when we went camping at Big Bear Lake?” Use happy memories and reminisce together for a few moments. [14] X Research source Move slowly into talking about the period in which the friendship started to decline. Frame it as a transition. You might say, “Ever since I started university, I feel that we have been moving apart.” Use passive terminology to avoid placing blame on your friend or yourself. Don't beat them up verbally."
    },
    {
      "title": "Part on a good note.",
      "content": "Part on a good note. Close your conversation with some resolutions. You could say simply, “I no longer feel that our friendship is in either of our best interests. Let's avoid unnecessary pain and difficulty by ending our friendship amicably.” Shake hands with your friend and wish them well when your meeting has concluded. Sometimes you can't end a friendship on a good note. If the other person remains angry, hostile, and bitter about what you think or feel, or does not forgive you, tell them, “I'm sorry you feel that way,” or “I'm sorry I offended you.” [15] X Research source Do not, however, compromise on your resolution to end the friendship just because they are angry or hurt. Remember, you are in charge of your own feelings, not your friend's. Even if your friend reacts in an immature or childish way, you should not. Stick to the high road."
    },
    {
      "title": "Do not feel as if you owe your friend anything.",
      "content": "Do not feel as if you owe your friend anything. If, for whatever reason, you've decided to end your friendship, you should not feel guilty. When people grow apart, it is nobody's fault. If one of your friendships ends, it does not make you a bad friend. Don't feel guilty for deciding that a friendship is over just because the friend has few other friends. You have to do what is right for you; sometimes that means deciding a friendship is over. [16] X Expert Source Julia Lyubchenko, MS, MA Licensed Therapist Expert Interview. 29 April 2020. Try to think about it as an opportunity for you and your friend to make new friends."
    },
    {
      "title": "Accept that the friendship is over.",
      "content": "Accept that the friendship is over. Now that you've decided the friendship is over, you have to live with that decision. Think about the good times you've had with your friend and understand that friendships -- or relationships of any kind -- can be temporary. [17] X Research source People change! Don't keep yearning for the friendship to fix itself, or wish that you could go back to do things differently. Don't try to “fix” or change your friend. Only they can change themselves. [18] X Research source While it is normal to feel sad after deciding to end a friendship, you should not obsess over it or let the memory of it cloud your judgment. Remember, the friendship is over for a reason. If you're having trouble accepting that your friendship is over, talk to another friend or trusted family member about the situation. If you and your friend part on a bad note, recognize that you cannot control what happened. Focus instead on your future. You don't have to forget your friend, but you can't live in the past. [19] X Research source Look at each day as a chance to meet new friends."
    },
    {
      "title": "Join a club.",
      "content": "Join a club. There are tons of clubs out there catering to interests and hobbies of all sorts. Book clubs, astronomy clubs, movie-going clubs... the list goes on. Check social media and sites like Meetup.com for clubs and hobby groups in your area. If book clubs are your thing, contact your local library. Larger libraries in big cities probably feature multiple book clubs, perhaps catering to particular types of literature. For instance, you might be able to find a history book club, an African-American literature book club, and so on."
    },
    {
      "title": "Attend a religious service.",
      "content": "Attend a religious service. If you believe in a higher power, attend the religious service of your choice. In addition to fulfilling your spiritual needs, attending a religious service can be a great opportunity to meet new people who share your beliefs. Look for local services in your area and find one that's right for you. [20] X Research source Don't be afraid to try several different churches, mosques, etc. before settling on one. Remember, it's free to attend, so you should go to as many as you can until you find one you like."
    },
    {
      "title": "Get to know your coworkers better.",
      "content": "Get to know your coworkers better. Becoming friends with your coworkers can make your work life more lively and enjoyable. [21] X Research source Invite some coworkers out for drinks or dinner after work one night. Suggest to them, for instance, “Would you guys/gals like to grab a bite after work? I know a great place not far from here.” Do not tell your coworkers you know a great place that is quite close to your place of employment if you in fact do not."
    },
    {
      "title": "Join a sports team.",
      "content": "Join a sports team. There are many opportunities to join sports teams. Whether it's an informal neighborhood basketball team or a well-organized community soccer team, sports can be a great way to make friends. The bonds built while training, playing, winning, and even losing together can last a lifetime."
    }
  ]
}