{
  "url": "https://www.wikihow.com/File-a-Lawsuit-for-Money-Owed",
  "title": "How to File a Lawsuit for Money Owed",
  "steps": [
    {
      "title": "Choose the right court.",
      "content": "Choose the right court. You must file your lawsuit in a court that has jurisdiction over the incident that gave rise to your claim. [1] X Research source In many cases you have the option of using small claims court. However, each state has a maximum dollar amount for which you're allowed to sue in small claims court – typically somewhere between $5,000 and $10,000, although it may be as little as $2,000. [2] X Research source [3] X Research source If the amount the person owes you exceeds that amount, you usually can't simply sue them for a lesser amount just so you can get around the maximum limit. Generally, the court location that has jurisdiction over your claim will be the court in the county where the dispute occurred. If the person owes you money under a written contract, you want to sue either in the county where the contract was signed, or where most of the work under the contract was performed. [4] X Research source You also have the option of suing in the county where the person you want to sue lives. This means that in some situations you'll be able to choose between several different courts that all have jurisdiction. When that happens, you can pick the court that's most convenient for you. [5] X Research source"
    },
    {
      "title": "Gather your evidence.",
      "content": "Gather your evidence. To recover the money you're owed through a lawsuit, you must have proof of the debt. If you have a written contract, that part of your proof is relatively straightforward. However, in many cases money is loaned through a handshake deal in which no formal contract is signed. In those situations, proving the person owes you money can be tricky. If you loaned someone money, be prepared that he or she may try to claim that the money was a gift rather than a loan. Any proof you may have that it was in fact a loan will go a long way. For example, suppose you loaned a friend $1,000 to get repairs done on his car. He was supposed to pay you back by giving you $100 each week, and initially he made these payments on time. However, after five weeks he stopped paying you. Cancelled checks or receipts for those first five payments can help you establish that the money was a loan, not a gift, and that he knew he had to repay you."
    },
    {
      "title": "Compile information about the person who owes you money.",
      "content": "Compile information about the person who owes you money. You want to make sure you're suing the right person using his or her correct legal name, and including all required parties. [6] X Research source [7] X Research source For example, if you live in a community property state and the person who owes you money is married, you must sue both the person and his or her spouse. You also must make sure that you have the correct legal name for the person you're suing, as well as an address where he or she can be served with notice of the lawsuit. Without this information, you won't be able to complete your lawsuit. [8] X Research source If you're suing a business, you can check with your state's secretary of state to get the business's official legal name. Keep in mind that he legal name may differ from the name with which you're familiar. [9] X Research source"
    },
    {
      "title": "Check the statute of limitations.",
      "content": "Check the statute of limitations. Each state has a deadline after which you can't sue a person to recover money he or she owes you. The length of the statute of limitations depends on whether the person owes you money under a written contract or an oral contract. Typically you have much longer, as much as 10 years, to file suit regarding a written contract. However, you must sue to enforce an oral contract within one or two years. [10] X Research source This time period begins from the date the contract – whether written or oral – was broken. This can be tricky if you didn't have a repayment schedule with the person, because you have no specific date you can use. [11] X Research source Make sure you check the statute of limitations that applies to your case before you file your lawsuit, because if you miss the deadline your case will be dismissed."
    },
    {
      "title": "Consider consulting an attorney.",
      "content": "Consider consulting an attorney. If someone owes you a significant amount of money, or if you believe they will contest your claim, you may want to get an attorney's advice on how to proceed. Keep in mind that if you're planning on suing in small claims court, you must have an attorney in many states if you're suing a person who owes money to your company rather than to you as an individual. Many attorneys offer free consultations, and it may be worth your time to at least talk to someone and get an official legal opinion on your case. If the attorney thinks it's unlikely that you'll win, or that you'll be able to collect the money even if you do win, you may want to reassess your options. If you're concerned about the cost of an attorney, you might seek out attorneys who provide unbundled services, in which they help you with certain aspects of your case – such as preparing your paperwork for the court or drafting discovery documents – but don't fully represent you. [12] X Research source You might also want to check with your local legal aid services or law school clinics and see if you can find low-cost legal assistance there."
    },
    {
      "title": "Send a demand letter.",
      "content": "Send a demand letter. Many states require proof that you made a written demand for the money before you file suit. [13] X Research source In your demand letter, state the amount of money you're owed and why. Give the person a brief period of time after he or she receives your letter to respond or pay the money. Tell him or her that if you don't have a response by that date you will file suit to recover your money. Make a copy of the letter before you send it so you have it for your records, and can present the copy to the court later if you end up filing suit. Send your letter certified mail, returned receipt requested, so you know when the person receives the letter. Save your return receipt when you receive it so you have it to prove to the court that the letter was received."
    },
    {
      "title": "Search for forms.",
      "content": "Search for forms. Many states have fill-in-the-blank forms approved by the courts for use in filing your claim. You typically can find forms by looking on the court's website or calling the clerk's office. Some legal aid and self-help clinics also have forms you can use. [14] X Research source"
    },
    {
      "title": "Draft your complaint.",
      "content": "Draft your complaint. If you can't find a form, you'll have to format your complaint by hand. You can use copies of complaints filed for other cases in the same court as a guide so you know you're formatting everything properly. The complaint tells the court what happened and why the defendant owes you money. This information typically is set forth in numbered paragraphs, with one allegation per paragraph. [15] X Research source"
    },
    {
      "title": "Complete any other required documents.",
      "content": "Complete any other required documents. You may want to contact the clerk of the court where you intend to file to determine what other documents must be filed with the complaint to initiate a lawsuit. You typically will have to fill out a summons and a certificate of service. The summons tells the defendant that he or she must appear in court, and provides details on how to respond to the lawsuit. [16] X Research source The certificate of service tells the court how you intend to notify the defendant of the lawsuit. Once you've finished everything, make copies of each document you're filing with the court. The clerk will keep the originals for the court's records, so you'll need at least one copy for your own records and one for the person you're suing. [17] X Research source"
    },
    {
      "title": "Take your paperwork to the clerk's office.",
      "content": "Take your paperwork to the clerk's office. Once you've completed all required documents, you must file them with the clerk to begin the litigation process. Some courts allow you to file by mailing your paperwork and fees using certified mail. You can find out from the clerk if this option is available for you. When you take your documents to the clerk, you must pay a filing fee. This fee will vary depending on the court in which you file. If you file in small claims, the fee may be under $100, but you can expect to pay several hundred dollars to file a regular civil court lawsuit. [18] X Research source If you can't afford to pay the filing fees, you may be able to fill out an application to have the fees waived. On the application, you must disclose details about your income and assets. If the court determines that your income is below the court's low-income threshold, you won't have to pay any court costs. [19] X Research source Typically if you receive public benefits you will be deemed eligible for a waiver of your court costs. If you're filing in small claims court, the clerk may schedule a date for your hearing at the same time you file. [20] X Research source For full civil court cases, you typically must wait to receive an answer from the defendant before you can find out what the next step in litigation will be."
    },
    {
      "title": "Have the defendant served.",
      "content": "Have the defendant served. After you've filed your complaint, you need to follow the court's procedures to provide the defendant with proper legal notice of the lawsuit against him or her. In most cases, the defendant will be served by having the paperwork sent to him or her using certified mail with returned receipt requested. The return receipt serves as proof that the defendant received the complaint and has notice of the lawsuit. [21] X Research source You also may have the option of using the sheriff's department or a private process serving company to deliver the paperwork to the defendant personally. There typically will be a fee for this service."
    },
    {
      "title": "Wait for an answer from the defendant.",
      "content": "Wait for an answer from the defendant. In most cases the defendant must file a written answer to your complaint within a set period of time after he or she is served. Typically the defendant has between 20 and 30 days to file his or her written answer. If no answer is filed, you can seek a default judgment against him or her. [22] X Research source [23] X Research source When you seek a default judgment, you typically still must prove the exact amount of money to which you're entitled. [24] X Research source If the defendant does file an answer, it will be served on you – either by using personal service or by mailing it to you using certified mail. If the defendant raises any counterclaims, you have a similar period of time to respond to those counterclaims or the defendant can seek a default judgment against you. [25] X Research source For example, suppose you loaned your roommate $300 and are suing her for it. Your roommate counterclaims that you owe her $200 for food of hers that you consumed without replacing it, and that she therefore only owes you $100. If you don't respond and deny her counterclaim, the judge could enter a default judgment on her counterclaim, thus entitling you to recover only $100 of the money she owes you. The defendant also may file motions, such as a motion to dismiss. You must respond to these motions, and the court may schedule a hearing before the judge."
    },
    {
      "title": "Participate in discovery.",
      "content": "Participate in discovery. Before trial, both you and the person you're suing have the opportunity to ask each other questions and share documents and evidence you plan to introduce at trial. Through the discovery process, you can use various tools to gain information about the defendant's case. Written discovery includes written questions and requests for production of documents related to the case. Your written questions, or interrogatories, must be responded to in writing and under oath. [26] X Research source [27] X Research source You also have the opportunity to call a deposition, in which you interview either the defendant or any witnesses under oath and on the record. The transcript of depositions can later be used at trial if the person says something on the stand that contradicts something he or she said in the deposition. [28] X Research source [29] X Research source If you filed in small claims court, you typically won't have any discovery period – or if you do, it will be a simplified process of written discovery only. [30] X Research source"
    },
    {
      "title": "Attend mediation.",
      "content": "Attend mediation. Some courts require parties to participate in mediation or other alternate dispute resolution before a trial will be scheduled. Mediation involves having a conversation with the defendant in a neutral setting with a third-party mediator on hand to facilitate that discussion and help you reach a compromise. [31] X Research source Mediation is a non-confrontational setting, so it can be particularly helpful if the person you're suing also is a friend or family member, and you want to preserve your relationship with them."
    },
    {
      "title": "Prepare for your hearing.",
      "content": "Prepare for your hearing. Make sure your documents and evidence are organized and that you've prepared your opening and closing statements for the court. Write an outline of your case and the events that transpired so you can present them to the court in an orderly fashion. Practice what you're going to say in front of a mirror or in front of friends or family members. [32] X Research source If you have any documents such as a written contract that you want to show to the judge, you should make enough copies that you can keep one, give one to the judge, and give one to the defendant. [33] X Research source If you have any witnesses you want to call to testify on your behalf, you should call them and find out if they're willing to testify. If they don't want to appear in court, you typically have the option of having the court issue a subpoena that will force your witnesses to appear. [34] X Research source Get together with any witnesses you plan to call and practice with them before the trial. Not only should they have a good idea of the questions you might ask, but you should have a good understanding of their answers so you can plan and make sure you don't inadvertently call a witness to the stand who ends up damaging your case. [35] X Research source"
    },
    {
      "title": "Appear in court on your court date.",
      "content": "Appear in court on your court date. You must appear when the hearing of your case is scheduled, or your case will be dismissed. You may want to arrive at least a half hour early so you have time to get through courthouse security and find the courtroom where your trial will be held. [36] X Research source It may be that there is more than one trial being held in your courtroom on that day. If so, find a seat in the court's gallery and wait until your case is called. Once your case is called, you may stand and move to the front of the courtroom. [37] X Research source"
    },
    {
      "title": "Present your case.",
      "content": "Present your case. Since you filed the lawsuit, you have the opportunity to tell the court your side of the story first. [38] X Research source When you present your case, speak only to the judge – don't talk to the defendant or lash out at him or her. [39] X Research source You can show exhibits, which include any contracts, cancelled checks, receipts, or other documents that show that the defendant owes you money and has failed to pay it. You can bring copies of the documents you plan to enter as exhibits, but make sure you have the original to be entered as evidence. A copy generally won't be accepted for that purpose. [40] X Research source If you have any witnesses, you will call them to the stand while you're presenting your case. When you finish your questions, the defendant will have the opportunity to ask questions as well. [41] X Research source"
    },
    {
      "title": "Listen to the other side.",
      "content": "Listen to the other side. After you've presented all of your evidence, the person you've sued will have the opportunity to present his or her defense. [42] X Research source Don't interrupt the defendant or yell out, even if he or she says something that's incorrect. You had your chance to tell your side of the story, and now the defendant has the same opportunity. The judge will make a decision based on the facts and evidence in the case. If the defendant has witnesses, you will have the opportunity to cross-examine them just as he or she cross-examined your witnesses. Pay close attention during the witness's testimony and take note of anything you want to ask the witness about when it's your turn."
    },
    {
      "title": "Receive the judge's decision.",
      "content": "Receive the judge's decision. At the conclusion of the presentation of evidence, the judge will make a ruling in your case. The order will spell out whose story the judge found more convincing and why, and list the amount of money (if any) that you're entitled to receive from the defendant. [43] X Research source Both parties have the right to appeal the decision. Generally you wouldn't have any interest in appealing if you got everything you asked for. However, there may be some situations in which you want to appeal even if you won – for example, if the judge ruled in your favor, but found that the defendant only had to pay you $200 when you had argued he owed you $2000. [44] X Research source"
    },
    {
      "title": "Ask the clerk about enforcement rules in your state.",
      "content": "Ask the clerk about enforcement rules in your state. Since each state has different rules regarding how to enforce court judgments, it's best to talk to the clerk about it when you pick up your copy of the final order. If rules in your jurisdiction are complex, you may want to consider hiring a collections attorney to handle the process for you. You typically can pay them a percentage of the recovery amount, and you may even have the ability to add those costs to the total amount of your judgment. [45] X Research source"
    },
    {
      "title": "Contact the defendant.",
      "content": "Contact the defendant. Before you make efforts to enforce your judgment, you should talk to the defendant and find out if he or she is willing to work out payment arrangements with you directly. Typically if someone is able to do so, they'll go ahead and pay the amount of the judgment to avoid collection activities such as garnishment, which can be embarrassing and costly. [46] X Research source"
    },
    {
      "title": "Get an application and affidavit for a writ of garnishment.",
      "content": "Get an application and affidavit for a writ of garnishment. The most common method of enforcing a court judgment is to garnish a portion of the defendant's wages until the judgment is paid. If you hold a judgment in your favor and the defendant refuses to pay, you can use garnishment to get your money. Typically you can garnish up to 25 percent of the defendant's wages, unless he or she already has an existing garnishment. [47] X Research source If you sued a business, you also may be able to get the sheriff to seize property, assets, or even cash from the register to cover the judgment amount. [48] X Research source"
    },
    {
      "title": "Conduct post-judgment discovery.",
      "content": "Conduct post-judgment discovery. Before you apply for a writ of garnishment, you must get certain details about the defendant's income and assets. [49] X Research source Post-judgment discovery is available in some, but not all states. Essentially you send the defendant another set of interrogatories to determine what money they have and where it's coming from. [50] X Research source You also should use post-judgment discovery to find out if the defendant has any other garnishments, or if he or she has filed for Chapter 7 bankruptcy. [51] X Research source Additionally, the defendant may have certain types of income, such as public benefits, that are exempt from being seized or garnished to satisfy a judgment. The court provides a deadline by which the defendant must respond to your interrogatories. Once you have this information, you'll know what to include in your garnishment application."
    },
    {
      "title": "Complete your application and affidavit.",
      "content": "Complete your application and affidavit. Once you have the answers from the defendant regarding his or her employment, income, and assets, you can complete your application for a writ of garnishment. Some jurisdictions also may call this document a writ of execution, which means you are executing your judgment. Writs of execution and writs of garnishment have the same effect. The writ of garnishment tell the defendant's employer that he or she must withhold a certain amount of money from the defendant's paycheck. [52] X Trustworthy Source Civil Law Help Center Nonprofit law firm dedicated to civil legal services to all people Go to source"
    },
    {
      "title": "File your application and affidavit with the clerk.",
      "content": "File your application and affidavit with the clerk. You must file your application and affidavit with the clerk to begin the garnishment process. Some jurisdictions allow you to file your application and affidavit electronically, which could save you a trip to the courthouse. Provided your application and affidavit are complete, the clerk will issue the writ. You may have to pay an additional fee for this. Once you have your writ, you can contact the sheriff's department to have the writ served on the defendant's employer. This will begin the garnishment process. [53] X Research source"
    }
  ]
}