{
  "url": "https://www.wikihow.com/Fake-Sick-at-School",
  "title": "How to Get Sent Home from School With a Fake Illness",
  "steps": [
    {
      "title": "Start performing your symptoms early in the day.",
      "content": "Start performing your symptoms early in the day. The sooner you start faking your symptoms, the more convincing it is. [1] X Research source Avoid appearing completely fine for most of the day, but then “suddenly” start showing symptoms at 2 p.m. Instead, start the day a little woozy—even before you’re at school, if you can. You might be able to pull off a sudden migraine in the afternoon, but in most cases, you’ll need to start working on your ruse as soon as you get to school. When faking a cold/flu, make sure to start coughing , sneezing and blowing your nose as soon as class starts. If you cough really hard, it will make your throat a little scratchy and raspy and make you sound even sicker. Look rumpled, tired, and disheveled. Ask your teacher for cough drops or lozenges if you are faking a cold/flu. Reader Poll: We asked 978 wikiHow readers if they’d ever taken a fake sick day, and 76% of them said yes. [Take Poll] So, you're definitely not alone."
    },
    {
      "title": "Apply some light, pale makeup before class begins.",
      "content": "Apply some light, pale makeup before class begins. Regardless of what sickness you choose to fake, looking pasty and exhausted will help you be more convincing. If possible, apply the makeup at home before you leave for school. That way, your parents will notice that you aren’t feeling well, too. If that’s not possible, hit the bathroom as soon as you get to school. Use a little bit of pale foundation and/or powder to make yourself look sick and tired. Also add some red around your nose and cheeks, and apply a dark eyeshadow under your eyes. [2] X Research source Red makeup is especially useful for a cold or flu, since it makes you look flushed and congested. Don’t overdo the makeup. You want it to look realistic. It shouldn’t be obvious that you have any on. If you need to, practice getting the right look at home the day before. Also, gently rub your eyes a little to make them irritated and red."
    },
    {
      "title": "Skip lunch and drink very little.",
      "content": "Skip lunch and drink very little. Most illnesses, migraines included, will make you feel nauseous and unwilling to eat. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For this reason, wolfing down a large lunch will look suspicious. Instead, pick at your lunch and sit with your shoulders slumped, your face flushed, and your eyes unfocused. Look as miserable as you can. If anyone asks, say you feel sick to your stomach. Drink a small amount of water, slightly reluctantly, or a Sprite, 7-Up, or ginger ale. These beverages are well-known for relieving nausea, so people might think you’re trying to treat something."
    },
    {
      "title": "Move slowly and appear dazed.",
      "content": "Move slowly and appear dazed. Almost all sicknesses are going to slow you down and affect how quickly you are able to think. Try to look as out of it as you can. Move around very little. When you do move, move slowly. Keep your pace sluggish when you walk anywhere. When a teacher asks you a question, look confused. Reply slowly and in a spaced-out way Think back to a time you were actually sick, and channel that energy. [4] X Research source . Avoid sitting up straight at your desk—slump down and keep your eyes fixed on the surface of your desk. Lay your head down, like you just can’t stay awake. When you stand up from your desk, sway side to side a little so that you seem dizzy and lightheaded. Grab your desk so that it looks like you’re trying to support yourself."
    },
    {
      "title": "Cause some light disturbances in class.",
      "content": "Cause some light disturbances in class. Usually, if you’re getting in the way of learning, a teacher won’t want you in class. During class, be sure to cough and sniffle now and then, if you’re faking a cold. Or, wear a pained, uncomfortable expression and make sure the teacher notices, so they’ll stop class to ask if you’re okay. If you don’t want to be a distraction, just keep your head on your desk and wait for the teacher to notice."
    },
    {
      "title": "Mention your sickness to your friends so they can back you up.",
      "content": "Mention your sickness to your friends so they can back you up. If you trust your friends, you can let them know it’s fake. Otherwise, it’s safer to try to fool them, too (though your friends might be able to see through it more easily). If your friends know you’re “sick,” they might be able to support your case if a teacher asks what’s wrong. Or, if they’re really good friends, they might bring it up for you. Ask them to say, “I think Jack isn’t feeling great. Can I take them to the nurse?”"
    },
    {
      "title": "Jump up suddenly and race out of the classroom.",
      "content": "Jump up suddenly and race out of the classroom. If you are pretending to have a cold/flu, go just outside the classroom door and have a big coughing fit. Make it sound really brutal. Rub your palm in a circular motion on the tip of your nose hard enough so that it will look red and irritated when you go back inside. If you’re faking a migraine or stomach flu, you’ll need to run all the way to the bathroom. This is because a migraine causes vomiting and stomach flu causes either or both vomiting and diarrhea. [5] X Research source Both vomiting and diarrhea usually strike suddenly, which is why you need to hurry like it’s an emergency. Look panicked or troubled when you jump up, like something is wrong. Don’t be too dramatic. Act like you’re trying to hold something back, and like you don’t want anyone to notice. But of course they’ll notice."
    },
    {
      "title": "Stay in the bathroom for 10 or 15 minutes, if you're faking an upset stomach.",
      "content": "Stay in the bathroom for 10 or 15 minutes, if you're faking an upset stomach. While you’re in there, cough loudly and make retching noises. Flush the toilet multiple times. Make a production of loudly washing your hands. Reapply a little pale makeup before you leave the bathroom. Then splash a small amount of water on your forehead so that you look clammy. Dampen the hair at your temples slightly. This will make it look like you’ve been sweating."
    },
    {
      "title": "Ask to talk to the teacher in private.",
      "content": "Ask to talk to the teacher in private. Making too big of a show is too obvious. [6] X Research source Instead, pretend like you’re keeping it on the down-low. It's convincing to a teacher if you ask them for advice or input about the situation, like, \"What should I do?\" That way, they’re forced into a position of giving you helpful advice, which will almost always be for you to go see the nurse. Let your eyes glaze over a bit or look like you’re on the verge of crying. Then: If you are faking a stomach flu, clutch your stomach and say, \"This is so embarrassing, but I have diarrhea. I just got very sick in the bathroom. What should I do?\" Look extremely humiliated and avoid eye contact. If you are faking a migraine, look nauseous and squint at any bright lights, then say, \"My head is pounding and I feel really dizzy. I just threw up in the bathroom and I'm kind of freaked out by how much it hurts. Is something wrong with me?\" If you’re faking a cold/flu, speak with a scratchy voice and say, \"I feel really awful. My body aches all over and my head feels weird. I feel really cold, but I keep sweating. What does that mean?\""
    },
    {
      "title": "Look visibly uncomfortable and upset, but don’t overdo it.",
      "content": "Look visibly uncomfortable and upset, but don’t overdo it. It’s much harder to ignore you if you seem to be in pain. If your teacher doesn't seem to be buying your act, it's important to look like you're on the verge of tears, or even crying a little, if you can manage it. But don’t lean too hard into the drama! That’s a dead giveaway. Keep it lowkey, subtle. [7] X Research source That way, it looks like you’re trying to power through it, rather than angling to go home. Apologize to your teacher and avoid asking to go to the nurse. Let the teacher be the one to dismiss you. Instead, say something like, \"I don't know what to do. I feel so awful. What do you think I should do?\""
    },
    {
      "title": "Hit the bathroom again on your way to the nurse’s office.",
      "content": "Hit the bathroom again on your way to the nurse’s office. This is the final stretch—all you need to do now is convince the nurse that you need to go home. Check in the bathroom mirror to make sure your pale makeup looks believable. Add a bit more if necessary. Splash a little more cool water on your forehead and around your temples so that it looks like you’re clammy and sweating. In almost all cases, the deciding factor for you going home is whether or not you have a fever. All of these illnesses, except migraines, cause fever. This step won't work if using an ear or forehead thermometer. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Create a fake fever, if that’s your story.",
      "content": "Create a fake fever, if that’s your story. When the nurse takes your temperature, it needs to be 100°F (37°C) or higher. Turn on the tap in the bathroom until it gets very hot. Then fill up your mouth with the hot water. Make sure your cheeks aren't puffing out so you don’t look too obvious. Immediately head to the nurse’s office. Right before you walk in, swallow the hot water. When the nurse takes your temperature, it will read that you have a fever. [9] X Research source Make sure you look awful when you walk into the nurse’s office, and repeat whatever you told your teacher to be as convincing as possible. Another hack is to eat something spicy, like spicy chips or candy, to jumpstart some sweat, snot, and clamminess. Again, don’t overdo it! School nurses have heard every excuse in the book. It will be obvious to the nurse that you’re faking if you over-act."
    },
    {
      "title": "Let the nurse suggest going home before you ask to.",
      "content": "Let the nurse suggest going home before you ask to. If you’re too eager to go home, it could blow your cover. Instead, let the nurse be the one to suggest it. The best way to get the nurse to suggest this is to focus on how you “feel” instead of what you want to happen. If the nurse is skeptical, say things like, \"I knew I was feeling off this morning\" or \"I started feeling weird last night.\" If you're trying to fake a cold/flu say, \"My body aches all over and my head is pounding.\" Have tissues with you and use them in front of the nurse. Avoid breathing through your nose so that you sound stuffy. If you're trying to fake a migraine or vomiting, say, \"I've never had a headache this bad before. It hurts so much that I feel nauseous. I just threw up in the bathroom.\" Squint and mention that lights and loud sounds make the headache worse. If you're trying to fake a stomach flu or diarrhea, say, \"I'm very nauseous and my stomach is cramping up. I have bad diarrhea and I'm afraid something embarrassing might happen.\" Be sure to clutch your lower abdomen and look a bit dizzy and sweaty."
    },
    {
      "title": "Be consistent with your symptoms and pretend to “recover.”",
      "content": "Be consistent with your symptoms and pretend to “recover.” Make sure to show a few subtle symptoms when you come back to school after being “sick.” Otherwise, your teacher will probably get suspicious. Use a small amount of the pale makeup again so that you look pasty. Appear exhausted. You can return to normal after two days or so. If you were faking a cold or flu, cough occasionally when you return to class for at least a day or two."
    },
    {
      "title": "Pretend to have a migraine for a simple solution.",
      "content": "Pretend to have a migraine for a simple solution. Migraines are easy to fake since they don’t have many visible symptoms. Migraines are also recurring. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source That means that if you convince the school nurse you have one the first time you try it, you can use it as an excuse to get out of school in the future, too. You’ll need to moan lightly, hold your head, look nauseous, squint, and pretend that lights and sounds are making you feel worse. Vision migraines usually start with a blind spot, which can be a convincing symptom to tell a teacher—you can’t do your work if you have a blind spot! Choose an area of your head that hurts in particular. Migraines often affect the base of your skull or near your forehead."
    },
    {
      "title": "Try faking a cold or fever for a more common illness.",
      "content": "Try faking a cold or fever for a more common illness. Colds and fevers are common, and everyone recognizes the symptoms of these two common illnesses: sniffling, coughing, headaches, and drowsiness. [11] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source This makes them easy to pull off. And since they’re so contagious, you’ll likely be sent home. Also pretend to retch, and speak as though you had a scratchy throat. Faking a fever will probably seal the deal for you, but getting the body temperature right can be tricky. You won’t need a lot of props for this. Get a box of tissues and carry them around with you. Then, sneeze and wipe your nose frequently. While your nose is in the tissue, rub it a lot to make it look red. Make sure to use plenty of them. Also, act drowsy, sluggish, and distracted, like the cold is taking a toll on your energy. Applying a small amount of pale makeup will help you be slightly more convincing. A bit of white powder or pale foundation is all you’ll need to give yourself a pasty look."
    },
    {
      "title": "Fake diarrhea or the stomach flu for a dramatic option.",
      "content": "Fake diarrhea or the stomach flu for a dramatic option. Diarrhea can strike suddenly, and for many reasons—bad food, the flu , or even nerves or stress. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source So while it might be a little embarrassing, it’s very effective if you want to go home from school. If you can deal with the awkwardness, faking diarrhea is a good choice since it’s not usually questioned—if you have diarrhea, no one is going to want you around. You’ll need to polish off those acting skills for this one, though. Jump up in the middle of class with a stricken look on your face and run to the bathroom, even if you haven’t asked first. Stay at least ten minutes out of class, or at least until you’re alone in the bathroom, so your story is plausible. When you come back, ask to talk to the teacher privately when you tell them, to really seal the deal. Applying a subtle amount of pale makeup will help you pull this off. You can easily put the makeup on when you sprint to the bathroom."
    },
    {
      "title": "Take advantage of an illness or condition you already have.",
      "content": "Take advantage of an illness or condition you already have. If you have asthma, for example, you might say you’re short of breath to avoid gym class. Or, if you have allergies, you might fake a pollen reaction to avoid a school field trip. Conditions you already have and can prove are much more convincing than any condition you might fake. Keep in mind, though, that if you’re caught faking symptoms of a condition you do have, it might make people suspicious of your actual health problems, which can be dangerous. If a bug is going around school, that’s a perfect opportunity to hop on the wagon and use it to your advantage."
    },
    {
      "title": "Stick to your story, but don’t push it.",
      "content": "Stick to your story, but don’t push it. If the teacher or nurse doubts that you’re actually sick, don’t just stop faking. Then, they’ll know for sure that you’re lying, and that can hurt your reputation, or even get you in trouble. Keep up the act, but don’t escalate it—that’s also a dead giveaway. If you keep showing your symptoms from class to class, they might eventually give in, or another teacher or nurse might eventually send you home. If you keep subtly disrupting class, the teacher will probably have to at least send you to someone else. Be respectful of your classmates who are trying to learn, though!"
    },
    {
      "title": "Ask to call a parent, if you think they’ll be on your side.",
      "content": "Ask to call a parent, if you think they’ll be on your side. One way you can get past a doubting teacher or nurse is to bring your parents into it. If you think they’ll believe you, even when the faculty doesn’t, then ask to call home. If you have your parent’s permission to leave, they’re more likely to let you go. If they don’t let you call home, say you want to talk to a guidance counselor, who might be able to help."
    },
    {
      "title": "Avoid faking too often.",
      "content": "Avoid faking too often. If you’re sick too often, things start to get suspicious. [13] X Research source It’s best to save a fake sick day for when you really need it, like when you’re overstressed or couldn’t study for that test because important life stuff got in the way. That way, your teachers (and parents) are more likely to believe you. Also, it’s easier to fake sick if you’re a good student. If your grades are low or you’re constantly goofing off in class, teachers are automatically more suspicious."
    },
    {
      "title": "Keep your grades in mind.",
      "content": "Keep your grades in mind. Sometimes, faking sick just means digging yourself deeper into an academic hole. When you take a day off, you almost always fall behind, which can be disastrous if you’re already behind. Before you brush off your acting skills, ask yourself if you can really afford to miss more school. If you’re faking sick because school is getting overwhelming, it’s better to have an honest conversation with your teachers, parents, or academic advisors. They can help you find other ways to succeed, like lowering your workload."
    },
    {
      "title": "Ask yourself if it’ll be any better at home.",
      "content": "Ask yourself if it’ll be any better at home. Sure, you might get out of a test or running that mile in P.E., but if you have strict parents, things might not be much more fun at home. Your parents might put you on lockdown, or say something like, “If you’re too sick for school, you’re too sick for video games.” Also, you’ll probably have to keep up the act at home, or else your parents will get suspicious, making it harder to fake in the future. You might also make your parents frustrated, or make them miss important work by having to come get you."
    }
  ]
}