{
  "url": "https://www.wikihow.com/Create-an-Advertisement",
  "title": "How to Create an Advertisement",
  "steps": [
    {
      "title": "Identify a target customer.",
      "content": "Identify a target customer. Your business or product may appeal to a broad range of consumers, but for the purposes of advertising, it is usually helpful to think only about a specific subset of this potential audience. A single ad cannot appeal to or target every single person - accept this and then consider which consumers are most important for this project. [1] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source For example: If you are creating an advertisement for a baby stroller, the audience is more likely going to be new moms than people who don't even have a baby. If you are creating an advertisement for a graphics card, your audience probably knows enough about computers to realize that they can upgrade their old graphics card."
    },
    {
      "title": "Describe your target customer.",
      "content": "Describe your target customer. The more descriptive your team can be here, the more targeted and effective your ad will be. Imagine your target customer in your mind's eye, and ask yourself the following questions: [2] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source What approximate age or gender are they? Do they live in a major city or a more rural setting? What is their income range? Are they wealthy CEOs or college students on a budget? What other products do they use or enjoy? Do they use other products made by your company?"
    },
    {
      "title": "Describe the target customer's relationship to your product.",
      "content": "Describe the target customer's relationship to your product. Once you've described your target consumer's basic lifestyle and demographic information, now consider how that person interacts with your specific product. [3] X Research source Consider the following: When will they use it? Will they use it immediately, or when they need it? How often will they use your product? Once? Daily? Weekly? Will they immediately recognize its benefits/functions or will you have to teach them?"
    },
    {
      "title": "Identify the competition.",
      "content": "Identify the competition. You have hopefully already designed your product with the competition in mind. [4] X Research source You should now consider how your ad might specifically challenge (or complement) your competition's advertising efforts and how they might react to your advertising actions. Ask yourself: do other products exist besides yours that perform similar functions? If so, focus on the differences, especially how your product exceeds the competitor's."
    },
    {
      "title": "Describe the current market.",
      "content": "Describe the current market. Consider how your product is currently positioned. It is a hot and popular item right now? If so, ask yourself if and how you can distinguish your product from what is already available on the market. You should also consider the competitive landscape and the customers who are currently in play. [5] X Research source Ask yourself the following: Do customers recognize/trust your brand already? Are you hoping to convert people currently using the competition's product? Will you target those without a current solution? If your product the only one like this?"
    },
    {
      "title": "Develop a strategy.",
      "content": "Develop a strategy. Based on the information you've now compiled about the audience you're trying to reach and how they might view your product, you're now ready to think about an ad strategy. Your strategy should take into account what are commonly known as the 3 C's: Company (you), Customer (them, your target), and Competition. [6] X Research source Strategy is a complex topic, but by focusing on the desires, strengths, and possible future actions of the 3 players on the field (yourself, your customer, and your competition), anyone can build a complex strategy over time."
    },
    {
      "title": "Come up with a catchy, snappy tagline.",
      "content": "Come up with a catchy, snappy tagline. Keep it short and sweet; the average product needs no more than six or seven words. If you say it out loud and it sounds like a mouthful, edit it down. Whatever it is, it should grab the consumer's attention and convince him or her that your product is different from everyone else’s. Consider using: Rhyme – “Do you Yahoo?” Humor – “Dirty mouth? Clean it with Orbit chewing gum!” A play on words – “Every kiss begins with ‘Kay’” Creative imagery – Yellow Pages: “Let your fingers do the walking” Metaphor – “Red Bull gives you wings” Alliteration – “Intel Inside” A personal pledge – Motel 6: “We leave the light on for you” Dry understatement – Carlsberg beer has a big sign in downtown Copenhagen that reads, “Probably the best beer in town”."
    },
    {
      "title": "Make it memorable.",
      "content": "Make it memorable. Your message needs to be top of mind at the consumer's point of purchase. The second your ad borrows a familiar advertising phrase (for example, “new and improved,” “guaranteed,” or “free gift” — is there any other kind?), it becomes interchangeable with thousands of others. What’s more, listeners are so used to ad clichés that they don’t even hear them anymore. (Just listen to Tom Waits’s Step Right Up to hear how meaningless clichés sound when strung together.) [7] X Research source What matters most is how the consumer feels, not what they think. If they feel good about your brand, you've done your job. Startling the reader into paying attention is especially useful if you have a lot to say. For example, this long, environmentally-oriented announcement wouldn’t turn many heads if it weren’t for the unusual, confrontational tagline; if the reader wants to get the joke, she or he has to read more. Know how to walk the line between controversial and entertaining. Pushing the limits of good taste to help your ad grab attention is common practice, but don't go too far — you want your product to be recognized on its own merits, not because it was tied to a tasteless advertisement."
    },
    {
      "title": "Use a persuasive technique.",
      "content": "Use a persuasive technique. Note that persuasion doesn't really mean \"convincing.\" The point is to make the consumers feel better about your product than anyone else's. For most people, how they feel determines what they buy. Here are some tried and true methods that advertisers rely on to make their ads stick. [8] X Research source These include: Repetition : Getting your product to stick by repeating key elements. People often have to hear your name many times before they even know that they heard it (Jingles are one way to do this, but can also be annoying). If you go this route, brainstorm a more creative, less obvious repetition technique such as the one that was used in the Budweiser frog commercials (“bud-weis-er-bud-weis-er-bud-weis-er”). people think they hate repetition, but they remember and that's half the battle. Common sense : Challenging the consumer to think of a good reason why not to purchase a product or service. Humor : Making the consumer laugh, thereby making yourself more likeable and memorable. This pairs especially well with refreshing honesty. Not the most successful business in your class? Advertise that your lines are shorter. Exigency : Convincing the customer that time is of the essence. Limited-time only offers, fire sales, and the like are the commonest ways to do this, but again, avoid meaningless phrases that will slip under your customers’ radar."
    },
    {
      "title": "Appeal to the target audience.",
      "content": "Appeal to the target audience. Take note of your target audience's age group, income level, and special interests. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source You should also consider the tone and look of the ad. Check in with your audience often to see how they are responding. Even if you have created the best ad ever, it won't be effective if it won't appeal to the people buying your product. For example: Kids tend to be over-stimulated, so you will need to grab their attention on multiple levels, with color, sound, and imagery. Young adults appreciate humor and tend to respond to trendiness and peer influence. Adults will be more discerning and respond to quality, sophisticated humor, and value."
    },
    {
      "title": "Find a way to connect the desires of consumers to what you're advertising.",
      "content": "Find a way to connect the desires of consumers to what you're advertising. Check back in with your strategy here. Make sure you are focusing on the most appealing aspect of your product. Why should it entice people? What sets it apart from other similar products? What do you like best about it? These can all be good starting points for an advertisement. Ask yourself if your product or event is aspirational. Are you selling something that people would buy in order to feel better about their social or economic status? For instance, you might be selling tickets to a benefit gala that is designed to feel elegant and luxurious, even if the ticket price is well below what most wealthy people would be able to pay. If you are selling an inspirational product, try to make your advertisement exude an air of indulgence. Determine whether or not your product is for practical means. If you're selling something like a vacuum cleaner, designed to perform common tasks or make life easier for the consumer, spin it in a different direction. Instead of emphasizing luxury, focus on how the product or event will provide relaxation and peace of mind to your consumer. Is there an unmet desire or need, any frustration in the mind of your consumer, that will create a market for your particular product? Assess the need gap that exists for the product or service."
    },
    {
      "title": "Make sure all the relevant information is included.",
      "content": "Make sure all the relevant information is included. If your consumer needs to know your location, phone number, or website (or all three) in order to have access to your product, provide this information somewhere in the ad. If you're advertising an event, include the location, date, time and ticket price. [10] X Trustworthy Source Federal Trade Commission Independent U.S. government agency focused on consumer protection Go to source The most important element is what's called a \"call to action\". What should the consumer do immediately after viewing the ad? Be sure to let them know!"
    },
    {
      "title": "Decide where and when to advertise.",
      "content": "Decide where and when to advertise. If you're advertising for an event, start promoting it at least 6 to 8 weeks beforehand if it's going to accommodate more than 100 people; if it's less than that, start advertising 3 to 4 weeks ahead. If you're advertising a product, think about the time of year when people are more apt to buy what you're selling. [11] X Research source For instance, if you're promoting a vacuum cleaner, it might sell better in the spring, when people are undertaking spring cleaning."
    },
    {
      "title": "Choose a memorable image.",
      "content": "Choose a memorable image. Simple but unexpected is often the best route to take. For example, these stark, colorful silhouette ads that barely even show the iPods they’re peddling couldn’t get much more straightforward, but because they don’t look like any other ads, they are instantly recognizable."
    },
    {
      "title": "Distinguish yourself from your top competitor(s).",
      "content": "Distinguish yourself from your top competitor(s). A burger is a burger is a burger, but if you let yourself think like that, you’ll never make your sale. Use your ad to highlight your product’s advantages over that of your competitors. [12] X Research source To avoid lawsuits, keep to statements about your product, not theirs. For example, this Burger King ad mocks the size of the Big Mac while speaking the literal truth: that is a Big Mac box, after all, leaving McDonald's no legal ground from which to retaliate."
    },
    {
      "title": "Design a business logo (optional).",
      "content": "Design a business logo (optional). A picture says a thousand words, and if a logo is effective enough, it can render text unnecessary (the backwards Nike checkmark, the Apple bitten apple, the McDonald's arches, the Chevron shell). If you're running a print or television advertisement, try to develop a simple, appealing image that will stick in the minds of viewers. [13] X Research source Consider these points: Do you already have a logo? If you can, think of fresh and creative ways of re-imagining it. Do you have a commonly-used color scheme to work with? If your brand is instantly recognizable by the colors in the ad or the logo, use this to your advantage. McDonald's, Google, and Coca-Cola are good examples."
    },
    {
      "title": "Find software or a technique to create your advertisement.",
      "content": "Find software or a technique to create your advertisement. How you create your ad will depend on which medium you're using to advertise. Note that if starting from zero, it takes a long time to acquire skill with a design app, or with design itself. In these cases it may be more helpful (and less frustrating) to browse freelance sites like craigslist and 99designs for design help. If you're looking to try it on your own, here are tech suggestions to get you started: If you're making a small-scale print ad (such as a flyer or magazine advertisement), try using a program such as Adobe InDesign or Photoshop. Or, if you're looking for a free option, you can use GIMP or Pixlr. If you're making a video ad, try working with iMovie, Picasa, or Windows Media Player. For an audio ad, you can work with Audacity or iTunes. For a large-scale print ad (such as a banner or billboard), you'll probably have to contact a print shop to get the work done. Ask which software they recommend using."
    },
    {
      "title": "Tell customers to ask for someone by name.",
      "content": "Tell customers to ask for someone by name. If customers have the option of calling your establishment in response to an ad, for example, direct them to “ask for Mike.” On another ad, direct them to “ask for Laura.” It doesn’t matter if Mike or Laura even exist; what does matter is that the person taking these calls records how many people ask for whom. This is a free way to track which ads are bringing people in and which aren’t."
    },
    {
      "title": "Develop your online data-tracking.",
      "content": "Develop your online data-tracking. If your ad is clickable online, or directs customer to an web address, you'll have immediate insight into how the ad is performing. [14] X Research source Many data-tracking tools exist to help you get started. Make your ads noticeable, but don't make them annoying. People tend to dislike giant ads, pop-ups, and anything that tends to play loud music randomly. If you make your ad annoying, people are more likely to turn it off. This won't get you many views."
    },
    {
      "title": "Direct customers to different URLs on your page.",
      "content": "Direct customers to different URLs on your page. This is a great way to directly compare the performance of two separate ads that may be running simultaneously. Set up your website to have a different landing page for each ad that you are testing, then track how many people go to each. Now you have a simple, unobtrusive way to see which strategies draw the most people. Keep track of the number of views each page receives. This will make it even easier to see what works and what doesn't. A simple counter would work. Even if you really like a certain design, your audience may not like it. If it doesn't get enough views, try a different approach."
    },
    {
      "title": "Offer coupons in different colors.",
      "content": "Offer coupons in different colors. If coupon-ing is part of your ad strategy, make sure each ad has a different color coupon so that you can tally them separately. The coupons will also make them more distinguishable to your customers. [15] X Research source Not a fan of color? Play around with different shapes, sizes, and fonts."
    },
    {
      "title": "Gauge the overall response to your ad.",
      "content": "Gauge the overall response to your ad. This will allow you to evaluate how well your first effort went and take a lesson for next time. Ask yourself the following questions, then adjust your next ad based on what you have learned. Did sales spike, drop, or stay the same after your ad? Did your ad contribute to the new numbers? Ask yourself why the sales changed. Were they due to the ad or forces beyond your control (i.e.: a recession)."
    }
  ]
}