{
  "url": "https://www.wikihow.com/Feel-Calm-and-Relaxed",
  "title": "How to Feel Calm and Relaxed",
  "steps": [
    {
      "title": "Take deep breaths to help you relax.",
      "content": "Take deep breaths to help you relax. If you feel overwhelmed, take a few seconds to get in a comfortable position and take a deep breath through your nose for 4 counts. Hold your breath in for 7 counts before exhaling through your mouth slowly for a full 8 counts. Keep breathing like this 3–5 times and notice how your body feels more at ease when you’re finished. [1] X Research source You can also try belly breathing as well. Put your left hand on your belly and slowly inhale through your nose. As you breathe, keep your chest still and let your stomach push out. Exhale through your mouth and push your belly to force the air out."
    },
    {
      "title": "Try vocal toning if you’re about to talk or meet with people.",
      "content": "Try vocal toning if you’re about to talk or meet with people. Keep your mouth closed so your teeth are slightly apart. Sit up straight and hum to make an “mmm” sound in the back of your throat. Breathe through your nose and continue to hum until you start feeling the vibrations throughout your face and in your chest so you feel relaxed. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Vocal toning exercises the muscles in your ear so you can detect higher frequencies of human speech and determine what they truly mean to say."
    },
    {
      "title": "Watch or imagine something funny to lighten your mood.",
      "content": "Watch or imagine something funny to lighten your mood. Laughter can be the best medicine when you’re feeling stressed since it immediately relieves the tension you’re feeling. If you have time, turn on a short and funny video on YouTube, listen to your favorite comedian, or picture a funny image in your head. [3] X Research source You can also try to make light of the situation by making up ridiculous what-if scenarios that aren’t likely to happen. For example, if you’re stressed about a job interview, you may make yourself laugh by asking, “What if the interviewer and I are wearing the exact same thing?” or, “What would I do if the interviewer was a mime?”"
    },
    {
      "title": "Visualize being in a place that relaxes you for 1–2 minutes.",
      "content": "Visualize being in a place that relaxes you for 1–2 minutes. Close your eyes and imagine resting far away on a desert island, walking in a field of flowers, or going somewhere else that makes you feel calm. Think about what you see, smell, hear, feel, and taste there so you can picture yourself there better and distract yourself from how you’re feeling right now. When you feel more relaxed, open your eyes and notice how your body feels. [4] X Research source Even picturing something like eating a comforting meal can help you feel at ease. Try to remember a memory where you felt relaxed or excited to boost your mood even more."
    },
    {
      "title": "Stay focused on the task you need to complete.",
      "content": "Stay focused on the task you need to complete. Keeping your mind on what you need to do rather than your stress will help pass time more quickly so you’re not stressing about it as long. Start with the most complicated tasks first so you get them out of the way before working on the easier things. Do the best that you can so you know that you put your best foot forward. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if you are taking an exam, take your time. Carefully comprehend each question and focus on what you already have studied and memorized. If in a play, focus on the lines you have memorized. Watch and listen carefully for your cue. Get into your role and pretend you really are that character. Everyone responds to stress differently. If you get agitated or angry when you’re stressed, take some time to relax first. If you normally get spaced out or withdrawn, try to fight stress with a stimulating and energizing activity instead."
    },
    {
      "title": "Plan ahead if you can to prepare for stressful events in the future.",
      "content": "Plan ahead if you can to prepare for stressful events in the future. As soon as you know about something that would normally stress you out, make a list of the things you need to get done. Schedule yourself plenty of time to finish the task so you don’t feel rushed to complete them later on. Focus on the most important thing you need to finish and work toward things that are easier. [6] X Trustworthy Source Health.gov Online collection of health and fitness standards set by the U.S. Office of Disease Prevention and Health Promotion Go to source For example, if you need to study for a big test, start with the concepts that you aren’t as familiar with since they’ll take the most time for you to learn. There are always going to be situations where you can’t plan ahead. Rather than letting them stress you out, think of them as a good opportunity to learn so you can handle something similar later on."
    },
    {
      "title": "Make note of the things you’re grateful for.",
      "content": "Make note of the things you’re grateful for. Think about all of the people and things that you appreciate in your life. You can either just keep a mental list or it may help to write them down so you’re able to remember them easier. If you’re feeling stressed, go through your list so you can recognize the things you enjoy in life and what you’re proud of. [7] X Research source Try keeping a gratitude journal where you jot down things you are thankful for. You can refer back to it during times you’re feeling down."
    },
    {
      "title": "Think positively about yourself.",
      "content": "Think positively about yourself. It’s normal to have negative thoughts from time to time, but take some time to think about your day to notice the positive things that have happened to you. If you have trouble thinking of something from today, try to remember anything positive in your life. Point out the things about yourself that you’re happy with, such as achievements you’ve earned or talents you have so you can find some positivity. [8] X Research source Tell yourself that you are competent and can handle things, and watch your stress level go down."
    },
    {
      "title": "Take some time to unplug from technology.",
      "content": "Take some time to unplug from technology. Constantly checking social media, text messages, and emails can cause a lot of stress, so take a break from screens for 5–10 minutes at a time throughout the day. Stand up and stretch, take a walk, look out your window, or socialize with someone in person so you can get away from your devices. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you’re hanging out with your friends, put your phone away or put it on silent so you can enjoy quality time without distractions. Take active steps toward making time where you are unreachable. Some jobs can make this difficult to do, but your lower stress level will make it worth it."
    },
    {
      "title": "Take a hot bath with lavender oil to unwind after a long day.",
      "content": "Take a hot bath with lavender oil to unwind after a long day. Fill your tub with the hottest water you can handle and add 10–30 drops of lavender essential oil for a relaxing aroma. Soak in the tub as long as you want so your whole body relaxes. Take deep breaths through your nose so you can smell the oils and destress even more. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also try using eucalyptus, peppermint, or chamomile oil for similar effects. Play relaxing music or light candles while you’re in the bath to make your bathroom feel the most relaxing like a spa."
    },
    {
      "title": "Listen to your favorite music.",
      "content": "Listen to your favorite music. Choose music that makes you happy and boosts your mood to play throughout the day. It doesn’t matter what genre you choose as long as it’s something you enjoy. Make a stress-relief playlist so you can put it on whenever you need to relax. Try listening to music while you work, exercise, drive, or just do chores around the house. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Have fun and dance along to your music to help stay active and reduce stress even more!"
    },
    {
      "title": "Try giving yourself a massage to help you calm down.",
      "content": "Try giving yourself a massage to help you calm down. Rub the muscles on the back of your neck and shoulders with a closed fist. Use your thumbs to massage your head and face in small circles, focusing on your temples, jaw, and forehead. You should start feeling relief immediately, but you can continue massaging the rest of your body to help you relax. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you can afford it, you can also pay for a professional massage at a spa or massage therapist."
    },
    {
      "title": "Get 7–8 hours of sleep every night.",
      "content": "Get 7–8 hours of sleep every night. Stress affects your sleep cycle and can make you feel even more anxious the next day. Try to go to sleep at a reasonable time and keep your room as dark as possible so you sleep through the night. Set an alarm for the morning so you don’t oversleep or stress yourself out by running late. [13] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Try drinking chamomile tea if you have trouble falling asleep since it helps you relax naturally. Avoid bright lights or any noise at least an hour before bed. Spend your last hour before going to sleep doing something quiet, like reading or meditating in dim lights."
    },
    {
      "title": "Exercise 4–5 times each week.",
      "content": "Exercise 4–5 times each week. Schedule at least 30 minutes of moderate exercise during the days when you want to work out. Try playing an intramural sport, jogging, going on hikes, or lifting weights so you can exercise every part of your body. As you work out, be sure to stay hydrated so you don’t feel fatigued. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Also be sure to stretch after your workout. Stretching not only prevents your body from getting damaged, but it is also a great stress release. Reader Poll: We asked 605 wikiHow readers to tell us what activity they would suggest to someone who was struggling to relax, and 59% agreed on going for a walk to help reduce stress. [Take Poll]"
    },
    {
      "title": "Eat a healthy, balanced diet.",
      "content": "Eat a healthy, balanced diet. Throughout the day, incorporate plenty of whole grains, vegetables, fruits, and lean proteins into your diet to help your body function properly. Enjoy foods like whole-wheat pasta, dark leafy greens, beans, nuts, carrots, apples, and eggs. Try to have 3–5 small meals every day so you don’t overeat. [15] X Research source Limit the number of sugary, processed, and fried foods in your diet since they aren’t as healthy. Avoid mindlessly eating when you’re anxious since it could lead to even more stress."
    },
    {
      "title": "Drink 8 glasses of water every day.",
      "content": "Drink 8 glasses of water every day. Pour each glass so it’s about 8 fluid ounces (240 ml) so you can get a healthy amount of water. Avoid drinking your water all at once, or else you may feel dehydrated or parched later on. Instead, have a glass every few hours so you can space it throughout the day. [16] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Plain water is best, but you can also drink unsweetened herbals teas and 100% fruit or vegetable juices."
    },
    {
      "title": "Limit your caffeine and alcohol intake.",
      "content": "Limit your caffeine and alcohol intake. Try to cut out caffeinated coffee, sodas, and teas from your diet since they can increase your heart rate and make you feel stressed out. Switch to decaf options if you can so you can still enjoy the same drinks. If you drink alcohol, only have 1–2 drinks each day and have a glass of water with each one so you don’t get intoxicated. [17] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Sometimes people drink alcohol as a way to deal with stress, and this habit is not only unhealthy but it is dangerous and can lead to much higher stress in the long run."
    },
    {
      "title": "Practice yoga and meditation.",
      "content": "Practice yoga and meditation. Yoga and meditation are all about mindfulness, so they can help you recognize your stressful feelings. Look for a yoga routine online or visit a studio near you so you can try it out. Focus on how your mind and body feel while you’re breathing and stretching so you can recognize how relaxed you are. [18] X Research source Many studios have free beginner classes so you can try it out before you sign up."
    }
  ]
}