{
  "url": "https://www.wikihow.com/Develop-Film-in-a-Darkroom",
  "title": "How to Develop Film in a Darkroom",
  "steps": [
    {
      "title": "Take the roll of film you want to develop out of your camera.",
      "content": "Take the roll of film you want to develop out of your camera. Depending on the kind of camera you’re using, you may need to rewind the film into the cassette using the handle on the side of the camera. Don’t open the film once you take it out or the light will ruin all of your pictures. [1] X Research source"
    },
    {
      "title": "Bring your film into the darkroom and set up your work area.",
      "content": "Bring your film into the darkroom and set up your work area. Don’t worry about turning the lights off yet. Since you’ll be working in complete darkness, you want to set up beforehand so everything you need is right in front of you. To load and develop your film negatives, you will need: [2] X Research source A film reel. The reel is what you’ll load the film onto once you take it out of the cassette. A film tank. A film tank is a sealable plastic container that you’ll develop the film negatives in. A cassette opener. You’ll use the cassette opener to open the film so you can load it on the reel. Scissors. You’ll need scissors to cut the film off the cassette."
    },
    {
      "title": "Turn off the lights and open the film cassette with the opener.",
      "content": "Turn off the lights and open the film cassette with the opener. At this point, there should be no light in the darkroom. If you can see in front of you, there’s too much light. To open the cassette, hook the edge of the lid under the cassette opener. Then, bend the cassette to the side until the lid pops off. [3] X Research source Make sure your phone is turned off and put away so it doesn't light up and ruin the film."
    },
    {
      "title": "Take the film out of the cassette and cut it off with scissors.",
      "content": "Take the film out of the cassette and cut it off with scissors. Unroll the film until you reach the small plastic cassette in the center. Then, cut through the film where it meets the piece of tape that attaches the film to the plastic. Since it’s dark, you’ll need to feel where the tape is with your fingers. [4] X Research source"
    },
    {
      "title": "Load the film onto the reel.",
      "content": "Load the film onto the reel. To load the film, start by holding the reel in one hand and the end of the film in the other. Then, find the slit on the edge of the reel with your fingers and slide the film into it. Once the end of the film is secure on the reel, twist the side of the reel back and forth to wind the rest of the film onto it. [5] X Research source When you’re finished, all of the film should be securely wrapped around the reel. There shouldn’t be any film sticking out."
    },
    {
      "title": "Place the reel in the film tank.",
      "content": "Place the reel in the film tank. First, slide the tank’s detached core through the hole in the center of the reel. Then, place the reel flat in the bottom of the tank so the core is sticking up in the center. Cover the tank with the lid and tighten it into place by rotating it. [6] X Research source"
    },
    {
      "title": "Turn the lights on and mix 1 part film developer with 1 part water.",
      "content": "Turn the lights on and mix 1 part film developer with 1 part water. The film developer and water mixture is what you’ll use to develop your film negatives in the tank. You need enough of the mixture to completely fill the tank. The exact amount you should mix depends on the size of your film tank, but it’s usually around 16 fluid ounces (470 mL) of film developer and 16 fluid ounces (470 mL) of water. [7] X Research source Mix the developer and water in a metal or plastic container, not in the film tank. You don't need to stir the developer and water together. You can find film developer online or at your local photography store."
    },
    {
      "title": "Use a thermometer to measure the temperature of the mixture.",
      "content": "Use a thermometer to measure the temperature of the mixture. The temperature of the film developer and water mixture determines how long your film will need to develop for. Once you know the mixture's temperature, refer to the manufacturer’s instructions for your film to see how long it will need to develop. Every kind of film is different, so it’s important that you read the directions that came with yours. [8] X Research source If you can’t find the developing times for your brand of film, try looking them up online. Film typically needs 8.5 to 11 minutes to develop."
    },
    {
      "title": "Pour the mixture into the film tank and set a timer.",
      "content": "Pour the mixture into the film tank and set a timer. Pull the uppermost plastic lid on the tank off to reveal the funnel-shaped hole underneath. Do not unscrew the larger lid that’s sealing the tank shut. Pour the developer and water mixture directly into the hole in the lid. Once all of the mixture is in the tank, cover the hole with the plastic lid and immediately set a timer for however long the film needs to develop."
    },
    {
      "title": "Agitate the film periodically as it develops.",
      "content": "Agitate the film periodically as it develops. Agitating the film means turning the tank over continuously with your hands to help spread the developer around. To agitate your film correctly, you’ll need to use the following schedule: [9] X Research source First minute of developing: Agitate the film for 30 seconds. Then, place the tank on a flat surface for 20 seconds. After 20 seconds, agitate the film for the remaining 10 seconds of the first minute. Second minute of developing: Let the film tank rest on a flat surface for 50 seconds. Then, agitate the film for the last 10 seconds of the second minute. Subsequent minutes of developing: Repeat the same agitation and rest times you used in the second minute of developing for every minute until the film is finished developing."
    },
    {
      "title": "Pour the developer mixture out of the film tank.",
      "content": "Pour the developer mixture out of the film tank. Take the uppermost plastic lid off the tank so you can empty out the mixture. You can pour the mixture down a sink drain."
    },
    {
      "title": "Fill the tank with stop bath and agitate it for 30 seconds.",
      "content": "Fill the tank with stop bath and agitate it for 30 seconds. Stop bath is a liquid chemical mixture that stops film from developing any further. Once your tank is filled with stop bath, agitate it for 30 seconds to help the mixture spread throughout the tank. You can find stop bath online or at your local photography store."
    },
    {
      "title": "Pour out the stop bath and fill the tank with fixer.",
      "content": "Pour out the stop bath and fill the tank with fixer. Fixer is the last chemical used in the development process. It helps stabilize your film so it can be exposed to light without getting ruined. Once your film tank is filled with fixer, seal it and follow the same agitation schedule you used for the developer mixture. The exact number of minutes you should leave the fixer in the tank depends on the kind of film you’re using, but it’s typically between 3-5 minutes. [10] X Research source You can find film fixer online or at your local photography store."
    },
    {
      "title": "Empty out the fixer and rinse your film with cold water.",
      "content": "Empty out the fixer and rinse your film with cold water. Now that your film has been soaked in fixer, it’s safe to take the lid off the tank and pull the film reel out. Thoroughly rinse your film with water for several minutes to remove any leftover chemicals."
    },
    {
      "title": "Soak the film reel in a container filled with wetting agent for 30 seconds.",
      "content": "Soak the film reel in a container filled with wetting agent for 30 seconds. Wetting agents help water roll off the film more easily when it’s drying. If you don’t use a wetting agent, your film could develop streak or bubble marks on it. [11] X Research source You can find a wetting agent online or at your local photography store."
    },
    {
      "title": "Take the film off the reel and unroll it.",
      "content": "Take the film off the reel and unroll it. To take the film off the reel, twist the sides of the reel in opposite directions and then pull them apart so the reel separates into 2 pieces. Then, slide the film off the reel and unroll it with your fingers. [12] X Research source"
    },
    {
      "title": "Hang the film up to dry.",
      "content": "Hang the film up to dry. Use a clip to hang the film somewhere high up where it can dry, like on a clothesline or wire rack. Clip one end of the film to the surface you’re hanging it from, and attach another clip to the other end to weigh the film down so it’s taut. Let the film dry for several hours before you unclip it. If the darkroom you're in has a film dryer, hang the film up inside of it to speed up the drying time. With a dryer, it may only take the film 20 minutes to dry."
    },
    {
      "title": "Clean the film with a film cleaner to remove any streaks.",
      "content": "Clean the film with a film cleaner to remove any streaks. Once the film is completely dry, lay it on a flat surface and examine it for streak marks. If you see any, soak a paper towel in film cleaner and gently wipe it across the surface of the film to remove the streaks. [13] X Research source You can find film cleaner online or at your local photography store."
    },
    {
      "title": "Cut your film into strips of 5 negatives.",
      "content": "Cut your film into strips of 5 negatives. Cutting your film into smaller strips will allow you to store your film in plastic sleeves until you’re ready to print them. Use scissors to cut the film into strips of 5 along the lines dividing the negatives. [14] X Research source"
    },
    {
      "title": "Slide the film strips into plastic sleeves for protection.",
      "content": "Slide the film strips into plastic sleeves for protection. It’s important that you keep your developed film safe until you’re ready to turn it into prints. Plastic sleeves will keep moisture, smudges, and debris from getting on your film. Leave the film in the plastic sleeves until you’re ready to make some prints out of your negatives. Store the plastic sleeves in a binder or folder when you're finished. You can find plastic film sleeves online or at your local photography store."
    }
  ]
}