{
  "url": "https://www.wikihow.com/Get-60-Fps-on-Switch",
  "title": "How to Get Max FPS on Your Nintendo Switch",
  "steps": [
    {
      "title": "Not usually—on most games, the Switch can only manage 30 FPS.",
      "content": "Not usually—on most games, the Switch can only manage 30 FPS. Compared to sleek, high-performance consoles like the PS4 and PS5, the Nintendo Switch’s hardware and display tends to fall short. [1] X Research source A few Nintendo Switch games (like Mario Kart 8 Deluxe , Splatoon 3 , Super Smash Bros. Ultimate , and Donkey Kong Country: Tropical Freeze ) can run in 60 FPS, but other games, like Fortnite, are stuck at 30 FPS. It’s not possible to increase your console’s FPS unless you hack your device , which gives you more freedom to mess with your games’ settings. However, this isn’t necessarily a good idea if you have a warranty, as hacking your Switch will void any warranty you have for your device. [2] X Research source Check out Open Surprise’s playlist of FPS Test videos , where he reviews popular Switch games and tests their framerates."
    },
    {
      "title": "Move your system data to the microSD card.",
      "content": "Move your system data to the microSD card. Head to the “Data Management” section of your System Settings and select the “Move Data Between System/microSD Card” option. [3] X Research source Offloading some content to your SD card may help your games run more smoothly."
    },
    {
      "title": "Turn off your controller vibration.",
      "content": "Turn off your controller vibration. In your System Settings, scroll to the “Controllers and Sensors” menu and toggle “Controller Vibration” to “Off.” Some players find that controller vibrations can make certain games (like Fortnite) lag, so turning this setting off might improve your framerate."
    },
    {
      "title": "Set your resolution to the highest possible setting.",
      "content": "Set your resolution to the highest possible setting. Head to the “TV Output” section of your System settings, followed by “TV Resolution.” Choose the best resolution setting available for your TV, whether that’s 720p or 1080p. While adjusting your resolution won’t impact your frame rate directly, it will improve the way your gameplay looks overall."
    },
    {
      "title": "Switch your RGB settings to “Full Range.”",
      "content": "Switch your RGB settings to “Full Range.” Enter your System Settings and head to the “TV Output” menu, followed by the “RGB Range” section. If your system is on “Automatic,” switch it to “Full Range” instead. This setting won’t change your FPS, but it’ll improve the color quality in your games."
    },
    {
      "title": "Set your Switch to never fall asleep.",
      "content": "Set your Switch to never fall asleep. In System Settings, visit the “Sleep Mode” menu and toggle both “Auto-Sleep” settings (“Playing on Console Screen” and “Playing on TV Screen”) to “Never.” Your sleep settings have no impact on your Switch’s FPS, but they can save you the time of having to wake up your device frequently."
    },
    {
      "title": "Leave your “Color Blind” settings as-is.",
      "content": "Leave your “Color Blind” settings as-is. While some players suggest tweaking these settings, other players advise leaving them be to put less pressure on your game system."
    },
    {
      "title": "Toggle on “Auto Download High Resolution Textures.”",
      "content": "Toggle on “Auto Download High Resolution Textures.” This setting allows your game to pre-download game textures, which can prevent a laggy in-game experience. You can keep the “High Resolution Texture Reminders” setting beneath it turned off."
    },
    {
      "title": "Toggle off “Show FPS” and “Power Saving Mode.”",
      "content": "Toggle off “Show FPS” and “Power Saving Mode.” Some Fortnite players find that turning off these settings can help prevent your game from running into delays. Some players also find that switching off the “Show FPS” option can help prevent you from getting distracted by your framerate."
    },
    {
      "title": "Set your “Matchmaking Region” to your location.",
      "content": "Set your “Matchmaking Region” to your location. Your device might have your Matching Region set to Auto, potentially slowing down your game. Instead, choose the region from the provided list that’s closest to your location (e.g., NA West, NA East, Europe, etc.)."
    },
    {
      "title": "Adjust your HUD Scale so it’s between 60 and 80%.",
      "content": "Adjust your HUD Scale so it’s between 60 and 80%. Some Fortnite players find this range to be the sweet spot for your display settings—it still makes it easy to see your weapons without slowing down your game."
    },
    {
      "title": "Toggle on “Build Immediately (Builder Pro).”",
      "content": "Toggle on “Build Immediately (Builder Pro).” This can prevent delays in your gameplay experience."
    },
    {
      "title": "Scale down your subtitle settings as much as possible.",
      "content": "Scale down your subtitle settings as much as possible. If it’s convenient for you, toggle Subtitles to “Off,” and switch the other settings to: Text Size: Extra Small Text Color: White Text Border: None Background Opacity: Clear"
    },
    {
      "title": "Switch off any settings that are unnecessary to your gameplay.",
      "content": "Switch off any settings that are unnecessary to your gameplay. Building settings like “Disable Pre-Edit Option” are unnecessary, as well as Tutorial settings like “Contextual Tips.” Go through the different Fortnite settings pages and review what each feature does. If you don’t use or need certain features in your gameplay, feel free to turn them off. For instance, you might toggle off some of the visual settings in the “HUD Options” menu, like “Show Spectator Count,” “Player Health,” “Resources,” “Minimap,” and so on."
    }
  ]
}