{
  "url": "https://www.wikihow.com/Cook-Pork-Shoulder",
  "title": "How to Cook Pork Shoulder",
  "steps": [
    {
      "title": "Let the pork shoulder sit.",
      "content": "Let the pork shoulder sit. A piece of pork shoulder should be at roughly room temperature before cooking. If refrigerated, let the pork sit for roughly half an hour prior to cooking. If frozen, you may need to let the pork defrost overnight."
    },
    {
      "title": "Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
      "content": "Preheat the oven to 350 degrees Fahrenheit (177 degrees Celsius). While waiting for your pork shoulder to warm, it's a good idea to let the oven warm up (especially if yours is slow to heat). If your pork is frozen and defrosting, you may need to wait until the end of the defrosting process to turn on your oven."
    },
    {
      "title": "Set the pork on a rack in a roasting pan.",
      "content": "Set the pork on a rack in a roasting pan. Use a cooking rack to ensure the pork does not sit in its own juices as it cooks. An oven-safe pan can collect the pork's juices as they drain during cooking - you can dispose of these after cooking or use them for gravy, etc. Place the pork on the rack fat side up. As the pork cooks, the fat will render and liquefy, running down the pork. Essentially, this allows the pork to baste itself."
    },
    {
      "title": "Score the pork.",
      "content": "Score the pork. Use a sharp knife to cut a criss-cross pattern of slices into the top of your pork shoulder. This serves multiple purposes, allowing the pork's juices to spill out and baste the meat during cooking and allowing your seasonings to penetrate deeper into the meat."
    },
    {
      "title": "Coat the pork with your favorite seasonings, marinade or rub.",
      "content": "Coat the pork with your favorite seasonings, marinade or rub. Be very generous with your seasonings - much of the roast pork shoulder's flavor comes from its delicious outer crust, the flavor of which is determined by the seasonings you choose. There are a very wide variety of rubs and seasonings suitable for pork shoulders. Some can be store-bought, while others can be recreated at home. When in doubt, a simple rub of salt, pepper, garlic, and a few basic spices of your choosing (especially thyme and coriander) works great. If you can't get the seasoning to \"stick\", try rubbing the pork shoulder with a light coating of olive oil first. To marinate your pork, you'll want to submerge the pork in a solution that usually contains oil, one or more acidic ingredients, and the seasonings of your choice. The acidic ingredients \"cut\" the oil in the marinade, providing flavor and keeping the finished product from becoming too greasy. Let the pork sit in the marinade for at least 4 hours and as long as a day or more. Additionally, you may want to consider using the sample dry rub and marinade recipes above."
    },
    {
      "title": "Roast the pork shoulder for approximately 1 hour per pound.",
      "content": "Roast the pork shoulder for approximately 1 hour per pound. Pork shoulder is best when it's cooked long and slow. Roast uncovered in the oven for about 1 hour per pound of meat. You may reduce the heat as needed if the pork appears to be cooking too quickly - many recipes call for 325 degrees Fahrenheit (163 degrees Celsius) rather than 350 (177 C). As a general rule, when pork shoulder is done, the skin should be crispy, the meat should reach an internal temperature of 160-185 degrees (70-85 degrees Celsius), and any bone in the meat should \"wiggle\" easily when grabbed and shaken."
    },
    {
      "title": "Let the pork rest for 10 to 15 minutes before carving.",
      "content": "Let the pork rest for 10 to 15 minutes before carving. Like many cuts of meat, pork is best if it's given a \"rest\" after being taken out of the oven. Letting the meat rests allows it to continue to cook off of its internal heat and also allows it to re-absorb moisture that might otherwise be lost if the meat is cut immediately after removing from the oven. After the brief rest, you're done. Enjoy your delicious roast pork shoulder!"
    },
    {
      "title": "Allow pork to come to room temperature.",
      "content": "Allow pork to come to room temperature. As directed above, remove the pork from the refrigerator or freezer and allow it to warm naturally. If the meat is frozen, allow it to defrost overnight."
    },
    {
      "title": "Heat skillet over medium-high heat.",
      "content": "Heat skillet over medium-high heat. As you wait for your pork shoulder to warm, set a frying pan or skillet on the stove top. When it's hot enough that beads of water flicked into the pan boil up instantly, add a few tablespoons of oil."
    },
    {
      "title": "Brown pork shoulder in the skillet.",
      "content": "Brown pork shoulder in the skillet. Add your cut of pork shoulder to the skillet. Cook in oil over high heat until brown on all sides (this can require several minutes for each side). Slow cookers like crock pots use moist heat and therefore can't give the pork a delicious \"crust\" on their own, which makes it necessary to crisp the exterior of the pork in a pan before slow cooking."
    },
    {
      "title": "Add seasonings and/or vegetables to the crock pot.",
      "content": "Add seasonings and/or vegetables to the crock pot. Delicious as a cut of pork shoulder can be on its own, if you're using a slow cooker to braise your pork to moist, delicious perfection, you'll want to make sure it's not alone in the pot. Vegetables and seasonings add their flavor to the pork (and vice versa), increasing the complexity of the flavor in the dish. In addition, slow cooked \"stew\"-style vegetables make a great side dish for pork. Feel free to add any vegetables you like. Chopped onions, garlic, carrots, and potatoes all work well. Additionally, any seasonings are fair game. For Latin-flavored carnitas, you might try cumin, garlic powder, and pepper, while for a more European flavor, you might try sage, rosemary, and thyme."
    },
    {
      "title": "Cover the pork (and other ingredients) with the liquids of your choice.",
      "content": "Cover the pork (and other ingredients) with the liquids of your choice. Place the pork shoulder into the crock pot on top of the other desired ingredients. Sprinkle any seasonings you're using over the pile of ingredients. Then, cover 1/2 to 3/4 of the pork shoulder with liquid. This can be a variety of things - water, unsweetened apple juice, beer, or, commonly, stock are all frequent choices. Make your choice based on what pairs well with the ingredients and seasonings in your pork dish - there's no one \"right\" answer. Feel free to mix and match! As an example, if you're making the carnitas described above, you might try slow cooking your pork in Mexican beer for a delicious, complex taste. Also, when you're picking liquids for slow cooking, it's important to remember that the leftover liquid can be used as a sauce or gravy for the finished pork."
    },
    {
      "title": "Cook at a low heat for 8 to 10 hours.",
      "content": "Cook at a low heat for 8 to 10 hours. Place the cover on the crock pot and begin the lengthy slow cooking process. Slow cooking allows plenty of leeway in terms of cooking time, but, generally, you'll want to cook for roughly 2 hours per pound of meat. Check several times during cooking, adding more liquid if needed. The pork shoulder is done when it is very tender and pulls apart with little effort."
    },
    {
      "title": "For pulled pork dishes, use forks to pull pork apart before serving.",
      "content": "For pulled pork dishes, use forks to pull pork apart before serving. Many slow cooked pork shoulder dishes (like carnitas, etc.) are eaten as \"pulled\" pork - meat torn into shredded bits. To make pulled pork, open the slow cooker when the meat is done and use two forks or kitchen tongs to pull the pork apart. Continue \"pulling\" as needed to achieve a satisfactory shredded texture."
    },
    {
      "title": "Warm pork to room temperature and season as desired.",
      "content": "Warm pork to room temperature and season as desired. As directed above, allow the pork to warm gradually. When the pork reaches room temperature, season generously with a \"rub\" of your choice. This dry, flavorful exterior translates into a crisp, delicious crust after grilling. You have many options when it comes to dry rubs. For instance, for a BBQ-inspired rub, try rubbing the pork down with a mix of white and brown sugar, salt, pepper, and other spices of your choice (like cinnamon and cumin)."
    },
    {
      "title": "Score the pork shoulder.",
      "content": "Score the pork shoulder. Use a sharp knife to make fairly shallow cuts in a criss-cross pattern across the surface of the pork. As noted above, this allows the juices to escape, basting the pork, and allows both the heat of the grill and the flavor of the seasonings to penetrate deeper."
    },
    {
      "title": "Preheat the grill to medium high heat.",
      "content": "Preheat the grill to medium high heat. Regardless of the type of grill you have, your goal is to cook the pork at a steady temperature of roughly 205 degrees Fahrenheit (96 degrees Celsius). A grill thermometer can help you keep track of the temperature in the grill as it warms up. Keep the grill lid closed to speed the heating process. Paint olive oil or nonstick cooking spray on the grill grates to prevent the meat from sticking during cooking. If you have a gas grill, it's relatively simple to set the grill to a medium-high heat. If you have a charcoal grill, however, it's a little more difficult. Light your charcoal and allow the flames to die down before cooking your pork. The charcoal is ready when it is mostly or entirely grey and glows with a red-orange heat."
    },
    {
      "title": "Place a tray of water in the grill.",
      "content": "Place a tray of water in the grill. To help regulate the temperature inside the grill and prevent the pork from drying out, place an oven-safe pan or metal pie tin full of water in the grill if you have room to do so. If you have a two-level grill, a good place for this tray is on the upper cooking rack."
    },
    {
      "title": "Grill the pork shoulder for approximately 90 minutes per pound.",
      "content": "Grill the pork shoulder for approximately 90 minutes per pound. Add your pork to the grill and close the lid. Allow the pork to cook, checking occasionally to test for done-ness. When done, the pork should have a crisp brown and black exterior, a tender texture, and the internal temperature should reach 160 degrees Fahrenheit (70 degrees Celsius). Because pork cooked in this way can take a very long time to cook, you may want to begin the grilling process in the morning to have the roast ready in time for dinner."
    },
    {
      "title": "Let the pork shoulder rest for 10 to 15 minutes before carving.",
      "content": "Let the pork shoulder rest for 10 to 15 minutes before carving. As with the methods of cooking described above, grilled pork is best if it's allowed to \"rest\" away from its heat source before eating. Be sure to cover the pork as it rests to protect it from insects, etc."
    },
    {
      "title": "For an optional smokey flavor, smoke the meat with wood chips.",
      "content": "For an optional smokey flavor, smoke the meat with wood chips. The coveted rich, smokey flavor sought by so many home grillers can be made with special electrical smoking equipment, but can also be recreated in a home grill with little effort. To smoke your pork shoulder on the grill, soak a handful of wood chips (hickory, oak, and apple work well) in water the night before cooking. Place these wet wood chips in an aluminum foil \"boat\" (a folded pouch open on the top) and place these directly on the burner of a gas grill or on the coals of a charcoal grill. As the wood smokes and burns during the grilling process, it will impart its smokey flavor into the meat (with delicious results). Alternatively, to learn how to smoke your pork shoulder with an actual smoker machine, see wikiHow's guide on How to Use an Electric Smoker"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}