{
  "url": "https://www.wikihow.com/Get-Skunk-Smell-Out-of-the-House",
  "title": "How to Get Skunk Smell Out of the House",
  "steps": [
    {
      "title": "Open the windows in your home to ventilate it.",
      "content": "Open the windows in your home to ventilate it. Let natural sunlight and fresh air into your home to help neutralize the skunk odor. Closing your house up will only keep the stench inside. By opening your windows, you let out some of the smell and allow fresh air into your home to help replace some of the contaminated air. [1] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020. However, if a skunk has sprayed right outside your home, don't open windows near the spray until the smell out there has dissipated. Sunlight also has a positive effect on smells on fabric. The ultraviolet rays can help neutralize the odor and lift it out of your fabrics."
    },
    {
      "title": "Run fans to get air moving.",
      "content": "Run fans to get air moving. Turn on electric ceiling fans, floor fans, and desk fans to keep the air circulating in your home. You can also turn on the fan function of your heating and cooling system, if your system has this function. If you allow the air to remain still and stagnant, the skunk smell will only sink deeper into your fabrics. [2] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020. Turning on all the fans in your home as soon as possible helps to keep the air in your house moving, thereby preventing the odor from settling into anything too deeply. This works especially well when used in conjunction with opened windows."
    },
    {
      "title": "Change out your furnace filters.",
      "content": "Change out your furnace filters. Change out your air conditioner and heater filters before and after you treat the rest of your home for skunk odor. The skunk smell can cling to these filters, and as a result, you may end up smelling skunk through your air vents for months. The only way to remedy this is by changing out your air filters. [3] X Expert Source Victor Belavus Air Conditioning Specialist Expert Interview. 6 May 2020. Changing the air filters before treating the rest of your home minimizes the amount of stink coming through your vents and re-contaminating the rest of your home. Do a sniff test after you clean the rest of your home. Smell the air filters. If they do not smell like skunk, you may not need to change them again. If they do smell like skunk, however, you should replace them once more to prevent the filters from re-contaminating the rest of your home with smelly air."
    },
    {
      "title": "Spray air deodorizers.",
      "content": "Spray air deodorizers. Deodorizing air fresheners can mask and remove part of the skunk smell. Look for a spray that specifically indicates its ability to deodorize. Most air fresheners only emit a strong perfume that covers other odors in the home. This will not be enough to deal with skunk smell, however. Only a deodorizing freshener can neutralize and eliminate some of the smell. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There are also special \"de-skunking\" sprays that are formulated specifically with the purpose of removing skunk odor. People who use these sprays tend to report mixed results, but you can read reviews about various types online and determine which may be the most effective for your needs. You might also have luck with a urine odor spray. [5] X Expert Source Eduardo Peralta House Cleaning Specialist Expert Interview. 29 October 2021."
    },
    {
      "title": "Place bowls of vinegar around the house.",
      "content": "Place bowls of vinegar around the house. If you cannot pinpoint the exact source of the smell, fill small bowls with 1 cup (240 mL) of white vinegar each and place them around the house. Focus on the worst smelling rooms of your home since the source of the stench most likely originates there. [6] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source If you have pets or small children, you may want to consider putting the vinegar high up on shelves to prevent them from spilling or ingesting it. The vinegar should absorb much of the smell within 24 hours and the smell of vinegar should not be too overpowering."
    },
    {
      "title": "Spread a thin layer of a vacuum-safe odor remover on your carpet.",
      "content": "Spread a thin layer of a vacuum-safe odor remover on your carpet. These products typically come in a powder or pellet form that is applied directly to the carpet. Let the cleaner stay on the carpet for at least a half hour, but several hours will work better. This will help remove the smell because the product will absorb it. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source There products are available at most big box, grocery, and home improvement stores. Sprinkle the product thinly across the whole surface of the carpet. You don't need a ton to absorb the smell."
    },
    {
      "title": "Vacuum the carpet to remove the cleaner.",
      "content": "Vacuum the carpet to remove the cleaner. Once the cleaner has been on the carpet for at least a half hour, you can simply vacuum it up with your normal vacuum cleaner. Vacuum the surface several times to ensure the you remove all of the odor remover. Once you have vacuumed up the odor remover, clean out your vacuum filter and bag or container."
    },
    {
      "title": "Shampoo your carpets with a steam cleaner if the smell remains.",
      "content": "Shampoo your carpets with a steam cleaner if the smell remains. Carpets and other hard-to-wash fabrics, like cloth furniture and curtains, should be washed using a wet vacuum. Steam cleaners work better than ordinary wet vacuums because the heat helps to open and expand the stitching of the fabric. This allows the detergent to sink in further and eliminate more of the skunk smell. An ordinary wet vacuum is still better than nothing, however. As a general rule, the carpet should be washed within 1 or 2 hours of initial contamination in order to prevent the smell from sinking in too deep. Try using an enzymatic carpet odor cleaner. [8] X Expert Source Eduardo Peralta House Cleaning Specialist Expert Interview. 29 October 2021. You may also need a professional carpet cleaning to remove the odor completely. [9] X Expert Source Eduardo Peralta House Cleaning Specialist Expert Interview. 29 October 2021."
    },
    {
      "title": "Create a vinegar solution to wash fabrics in.",
      "content": "Create a vinegar solution to wash fabrics in. Mix 1 part vinegar with 5 parts warm water in a large bucket. The precise amounts you need will largely depend on how much you need to clean. This solution is meant for clothes, blankets, towels, and other removable fabrics that can be washed in a washing machine. Note that some synthetic fabrics and delicate fabrics may not hold up well when exposed to acidic vinegar."
    },
    {
      "title": "Make a weak solution of hydrogen peroxide as an alternative.",
      "content": "Make a weak solution of hydrogen peroxide as an alternative. Combine 1 part hydrogen peroxide with 6 parts warm water. This solution is safe to use on clothing and other fabrics. The amount you make will depend on how much you need to deodorize. As far as fabrics are concerned, this solution is recommended over the stronger hydrogen peroxide solution used to clean pets and people. Strong concentrations of hydrogen peroxide can damage clothes, but when diluted with water, it should be safe to use on normal fabrics. Avoid using this solution on delicate fabrics or \"dry clean only\" clothes."
    },
    {
      "title": "Soak contaminated fabrics in the solution.",
      "content": "Soak contaminated fabrics in the solution. Dip your contaminated clothes and other fabrics into the diluted vinegar or hydrogen peroxide. Let them soak for 2 to 3 hours. For best results, use your hands to gently scrub the fabric for several minutes after dipping it into the solution. Doing so works the liquid in between the fibers of the fabric, allowing it to penetrate further and deodorize more of the smell. [10] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Items you might want to soak include pillow covers, slipcovers, curtains, and blankets, as well as any other fabrics that have the skunk smell on them."
    },
    {
      "title": "Wash the fabrics in a washing machine after they have soaked.",
      "content": "Wash the fabrics in a washing machine after they have soaked. After removing your fabrics from the cleaning solution, wash them in a standard warm wash cycle. For extra deodorizing power, add 1/2 cup (90 grams) of baking soda to the washing machine at the beginning of the wash cycle. [11] X Research source If possible, air dry the fabrics in the sun. The fresh air is better at getting rid of the smell than drying in the dryer."
    },
    {
      "title": "Dilute bleach with water.",
      "content": "Dilute bleach with water. Combine 1 cup (250 ml) of bleach with 1 gallon (4 liters) of warm water. Put it in an open container, such as a utility bucket. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source When working with bleach, it is best to avoid using other chemicals or cleaners, since many will have a chemical reaction with the bleach that may produce a toxic gas. It is also wise to keep the room well-ventilated by opening windows and doors. Do not work with bleach in a closed room."
    },
    {
      "title": "Scrub hard surfaces with this solution.",
      "content": "Scrub hard surfaces with this solution. Dip a scrubbing brush into the bleach and use it to wash kitchen floors, counters, car tires, decks, or other contaminated hard surfaces. However, do not use this solution on carpets, upholstery, or other fabrics since bleach is likely to discolor fabrics. Avoid using this solution on clothes. You can add bleach to whites, according to label directions, but darker colors should not be bleached. [13] X Research source To protect your hands, you may want to wear rubber cleaning gloves as you work with the bleach solution."
    },
    {
      "title": "Rinse and repeat as needed.",
      "content": "Rinse and repeat as needed. Wash off the bleach with a clean rag soaked in warm water. Repeat the process as necessary in order to remove the smell from your surfaces. [14] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Dry the surfaces with a clean, dry cloth after finishing."
    },
    {
      "title": "Make a mixture of hydrogen peroxide, baking soda, and soap.",
      "content": "Make a mixture of hydrogen peroxide, baking soda, and soap. Mix together 1 quart (1 liter) hydrogen peroxide, 1/4 cup (45 grams) of baking soda, and 1 tsp (5 ml) liquid laundry detergent or dish detergent. Combine the ingredients in an open container, such as a bucket. [15] X Research source Use 3 percent hydrogen peroxide, if possible. Do not close the container after mixing the ingredients together. The gas that will be produced could build up and create enough pressure to pop off a lid. Note that you may need to make more of the solution for a bigger dog or adult human. Do not store this mixture. Use it as soon as you mix it together."
    },
    {
      "title": "Saturate the skunked area.",
      "content": "Saturate the skunked area. Dip a clean washcloth in the solution that you made. Use the washcloth to cover all of the contaminated fur and skin with the solution until it is dripping wet. [16] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source This solution is safe for both pets and humans, but you should avoid getting it into eyes, ears, or mouths. While it is safe for skin, it can sting and damage eyes or other sensitive areas."
    },
    {
      "title": "Scrub the area with the solution.",
      "content": "Scrub the area with the solution. Use the washcloth to scrub the skunked pet or human with this solution. Make sure you get down to the skin on your pets, even if they have thick fur. Let it sit for 5 minutes to really eliminate the smell. [17] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source This works best if done within an hour or 2 after contamination."
    },
    {
      "title": "Rinse the area with clean water.",
      "content": "Rinse the area with clean water. After you have thoroughly cleaned the area, use fresh water to remove the solution from the skin or fur. Rinse the area several times to ensure that all of the solution is gone. [18] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Repeat the soaking, scrubbing, and rinsing as necessary until you can no longer smell the skunk."
    }
  ]
}