{
  "url": "https://www.wikihow.com/Get-Motivated-to-Study",
  "title": "How to Motivate Yourself and Get in the Mood for Studying",
  "steps": [
    {
      "title": "Silence or shut off your cell phone.",
      "content": "Silence or shut off your cell phone. Remove digital distractions so you can focus on your work. “Put your phone on silent or Do Not Disturb, and turn off notifications on your computer,” suggests Flicker. [1] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. You don’t want to be fielding text messages from friends or scrolling through TikTok when you're trying to study. Let people know that you’ll be going off the grid for a while to focus, then put your phone somewhere out of reach, so you won’t be tempted to start scrolling when you get bored. Reader Poll: We asked 180 wikiHow readers if social media distracts them from things they’d rather be doing with their time, and 85% of them said yes. [Take Poll]"
    },
    {
      "title": "Tidy up your workspace.",
      "content": "Tidy up your workspace. Set yourself up for success by decluttering your desk. Research shows that a cluttered work environment causes increased stress and has a negative effect on your productivity. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source A tidier workspace, on the other hand, helps you stay focused and motivated while you tackle your study goals. Whether you’re working at your dorm room desk or at a table in a coffee shop, clean up the area and get rid of any trash or clutter before hitting the books. [3] X Research source Consider making your home study space warm and inviting, so you look forward to spending time there. Decorate the walls with photos of you and your friends, place a cheerful house plant on your desk, and choose a comfy chair to sit in."
    },
    {
      "title": "Stay hydrated and keep a snack on hand.",
      "content": "Stay hydrated and keep a snack on hand. The right fuel helps your brain function properly. Drink plenty of water and bring along a water bottle so you don’t get thirsty while you’re working. Keep a small stash of nuts, granola bars, or fresh fruit around, so you can fend off a grumbling stomach and stay energized while you study. [4] X Research source Although it’s important to eat energizing snacks, avoid studying right after a big meal; you’ll just feel drowsy and will want to relax. Try to avoid overly sugary snacks—these foods will give you a short energy rush that quickly turns into sleepiness."
    },
    {
      "title": "Study during the times when you’re most productive.",
      "content": "Study during the times when you’re most productive. Personalizing your approach makes it work for you. “Some people really love getting up early, so they’re going to do better with an early start. Others really need some extra sleep, so they’re going to do better with a late start,” explains expert academic tutor Jai Flicker. “So I think the most important thing is finding the schedule that fits the individual, as opposed to thinking there’s one ideal schedule.” [5] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Think back to past study sessions to assess which factors help and hinder your progress. For example, you might realize that your morning study sessions are always the most productive, while your evening study sessions are less fruitful because you’re groggier. The more specific and intentional you can be about scheduling out your study tasks, the more success you’ll have with your studies and improve your time management ."
    },
    {
      "title": "Start with the easiest task.",
      "content": "Start with the easiest task. Make things less stressful by starting with a small task. When you really don’t feel like getting started, it’s better to set yourself up for a quick win. [6] X Research source Start with your easiest and least time-consuming tasks, then work your way up to your hardest, most intense projects. Once you finish a small step or two, you’ll get an awesome sense of accomplishment that’ll make it easier to keep going! Once you’ve decided what order to complete your tasks in, try writing them down somewhere. You can use an academic planner , or just jot them down on a spare piece of paper or sticky note. Having this to-do list will lower the effort of making decisions, and you’ll find it easier to shift from one task to the next."
    },
    {
      "title": "Break tasks into smaller, more manageable chunks.",
      "content": "Break tasks into smaller, more manageable chunks. Divide your tasks into small, concrete steps and complete them one at a time. [7] X Research source This helps you make steady, measurable progress toward your goal. And, as you check each small task off of your to-do list, you’ll feel a sense of accomplishment that will propel you forward. Here are some examples of what this might look like: Instead of trying to read a whole book for English class at once, set small daily goals. For instance, you could plan to read 1-2 chapters per day until you finish the book. [8] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source When prepping for a test or final exam , start by reviewing your lecture notes from just the first week of the semester. Then, for your next study session, focus on your notes from the second week, and so on. This will help you dive into each specific topic without getting too overwhelmed."
    },
    {
      "title": "Try the Pomodoro Technique.",
      "content": "Try the Pomodoro Technique. Alternate focusing and taking short breaks to increase productivity. Pick a single task to focus on, then set a timer for 25 minutes. Work on the task continuously until the timer goes off, then take a short 5-minute break. Repeat this process for four rounds, or until you finish your task. If you still aren’t done with your task after the fourth round, take a longer 20-30 minute break, then start the whole process over again. [9] X Research source Each 25-minute block is called a Pomodoro. These study sessions go by quickly, and as you complete each one, you’ll feel a sense of accomplishment, which can motivate you to keep going. You’ll also feel like you’re getting a fresh start with each new session, and research suggests that this can help you overcome a lack of motivation. [10] X Research source For maximum effectiveness, do something productive during the 5-minute breaks between each Pomodoro, rather than scrolling on your phone or zoning out. Instead, try taking a walk, stretching, or making a nutritious snack. [11] X Research source"
    },
    {
      "title": "Reward yourself when you complete a task.",
      "content": "Reward yourself when you complete a task. A small reward can help motivate you and make studying more fun. First, pick one task to focus on, and tell yourself that you will get a reward once you’ve completed it. Your reward could be a break to watch an episode of your favorite TV show or do a hobby you love. Or, it could be a yummy treat (like ice cream!). [12] X Research source When you have these fun rewards to look forward to, you’ll be more committed to completing your tasks in a timely manner. If you decide to reward yourself with a quick break from studying, remember that you will eventually have to get back to work. Set a reasonable time limit for your break, and don't listen to the voice in your head pleading for \"just a few more minutes.\""
    },
    {
      "title": "Motivate yourself by making a personal connection to your work.",
      "content": "Motivate yourself by making a personal connection to your work. Remember that studying will help you achieve your long-term goals. Doing that algebra worksheet or making those flashcards might not feel important now, but think about what you’ll achieve by studying. Imagine yourself getting a good score on a test, receiving praise from your teacher, or feeling proud of your end-of-term grades. Let these good feelings wash over you as you reframe your perspective on studying and find a deeper meaning in your tasks. [13] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source If you’re hoping to attend college or earn a scholarship, think about how each small study session will get you one step closer to your dreams."
    },
    {
      "title": "Work with your friends or a tutor.",
      "content": "Work with your friends or a tutor. Positive peer pressure can be a great motivator! Find a study buddy or form a study group , so you can collaborate with your peers. Set goals together and check in along the way–either in-person or with text updates. If group studying doesn’t work for you, try finding a tutor to help you work through your assignments. In a study group, each person can volunteer to tackle a different sub-topic, and then you can all share your study materials with each other. This saves everyone time and promotes teamwork! You can also reserve a study room, bring snacks, or gamify your studying to make the work more enjoyable. If you’re hoping to find a tutor, try asking around at school or consulting a private tutoring agency."
    },
    {
      "title": "Look up podcasts or videos on the topics you're studying.",
      "content": "Look up podcasts or videos on the topics you're studying. Visual aids can be helpful additions to your study materials. They provide you with a fresh perspective and additional information about whatever you’re studying, which can help you understand your coursework better. Take 20 minutes to watch an informative YouTube video that breaks the topic into simpler terms, or check out an educational podcast related to your studies. Each source will likely explain the topic in a different way, so don’t be afraid to explore until you find one that clicks. For example, if you’re having a hard time with your math homework, try searching for an explanatory video on YouTube. You’ll likely be able to find several videos that break down example problems step-by-step. Or, say that you’re writing an essay about a historical period, and you want to take a deep dive into the era. There are likely a ton of podcasts on the topics you’re interested in—check them out for some fascinating info!"
    },
    {
      "title": "Create visual aids for a fun, efficient study tool.",
      "content": "Create visual aids for a fun, efficient study tool. Make diagrams and pictures to help you connect and remember ideas. Try creating a mind map or making a Venn diagram to organize the topics you need to study. You can also try color-coordinating your notes to help you associate topics and ideas. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This is an especially good idea if you’re a visual learner! For example, rather than re-reading vocab words from your textbook, try making a handwritten, color-coded study sheet with the words and their definitions. Writing the information down in your own handwriting will help you retain the information better, and you’ll also have a great, visually appealing study sheet to review in the future."
    },
    {
      "title": "Use classic study tricks to memorize facts.",
      "content": "Use classic study tricks to memorize facts. Try making up mnemonic devices to remember key info. Mnemonic devices are simple word-based hacks that can help jog your memory. For example, if you’re studying a list of words or facts, you could create an acronym to help you remember the information. [15] X Research source You can even write a jingle or rap to help you lock significant names, dates, or ideas into your memory. [16] X Research source For example, you may be familiar with the acronym PEMDAS, or the expression “Please excuse my dear Aunt Sally.” These mnemonic devices represent the order of operations in math (parentheses, exponents, multiply, divide, add, and subtract). [17] X Research source If you’re having trouble coming up with your own mnemonic devices, try searching “how to remember [subject]” online for some inspiration."
    },
    {
      "title": "Try freewriting or journaling to identify why you procrastinate.",
      "content": "Try freewriting or journaling to identify why you procrastinate. Ask yourself, “What’s stopping me from getting started?” Usually, procrastination is an emotional issue, rather than a time management issue. [18] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source Are you worried you’re not going to do well on an assignment? Are you feeling stressed about an upcoming test? Writing down what you’re feeling will help you process it and let it go. Once you’ve gotten these stressors out of your system, take a deep breath and tell yourself it’s time to shift your frame of mind and get to work. You got this!"
    },
    {
      "title": "Crank up your favorite study tunes.",
      "content": "Crank up your favorite study tunes. Listening to good music may improve your productivity. In fact, research shows that enjoyable background music has a positive effect on focus and concentration. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can make your own personalized study playlist, or search for pre-made ones on Spotify or Apple Music if you prefer. It’s completely up to you! If you find songs with lyrics to be a bit too distracting, try listening to classical music, instrumental movie scores, piano covers of your favorite songs, or music ina. foreign language. You can also try playing nature sounds or ambient noise if music is too distracting in general. [20] X Research source You may also want to try \"body-doubling\" (working alongside someone else who is also working & letting their presence calm you) with the Lo-Fi Girl YouTube stream. This livestream shows an animated girl working on something at her desk, and it plays ambient music in the background."
    },
    {
      "title": "Be kind to yourself about your procrastination habits.",
      "content": "Be kind to yourself about your procrastination habits. Beating yourself up won’t do any good! Don’t try to give yourself punishments as a form of motivation—this just messes with your confidence and hinders your study session even more. Instead, be gentle with yourself when you’re having a hard time, and focus on positive reinforcements (rewarding yourself when you complete a task on time, for example). [21] X Research source Avoid comparing yourself to other classmates who seem to be doing well. Everyone learns and works differently, so focus on your own needs and capabilities! Use positive self-talk to help you develop a growth mindset when it comes to studying. Instead of thinking, “I can’t believe I procrastinated so much. I’m the worst student ever,” try reframing this in a more positive way. For example, you could think: “I have a lot to do, but I’ll persevere until I finish it all. I’m doing the best I can, and I should be proud of that.”"
    },
    {
      "title": "Take a break to move around.",
      "content": "Take a break to move around. Go for a walk or stretch to boost your brainpower and energy levels. You deserve to take a break every once in a while, and a bit of movement can help you jolt yourself out of a procrastination slump. Get outside and go for a 10-minute stroll to get some fresh air and give your brain a much-needed break. [22] X Research source If you can’t go outside, try loosening up by doing jumping jacks or taking a dance break around your room to your favorite song. These activities will give you a burst of energy and boost your mood. Plus, they’ll help get your brain into a receptive state, which will make your studying more effective."
    }
  ]
}