{
  "url": "https://www.wikihow.com/Crochet-a-Circle",
  "title": "How to Crochet a Circle",
  "steps": [
    {
      "title": "Make a slipknot.",
      "content": "Make a slipknot. With your left palm facing you and your fingers to the right, lay the yarn in your hand, with the end above your index finger. Then, lift your index finger and place the yarn behind the finger. Wrap it around your finger twice, going forward from this back position. Holding the string in place with your thumb and other fingers, grab the string on the left and pull it up and over the other strand, grab that second strand (with the other still pulled to the right), and then pull that strand up and over the end of your index finger. You should then have a loop that you can adjust. Slide your hook in and adjust it until it's taut. [1] X Research source"
    },
    {
      "title": "Create the starting loop.",
      "content": "Create the starting loop. Chain stitch until you have four stitches. Then, place your hook through the first chain stitch (next to the slip knot), catch the working yarn on the other side, and then pull that yarn through the chain stitch and the loop on the hook. If your pattern calls for a different number of starting stitches or different number of stitches around the circle, follow your pattern. All of the following stitch counts can and should be adjusted for your individual project. You can make the next several steps easier by identifying the center hole. Slightly pull apart the two sides of the bunch until a hole appears in the center. Make sure it is the center hole and not the stitches from joining the two ends. Stick and keep a finger in this hole through the process to make your life much easier."
    },
    {
      "title": "Chain stitch for your row height.",
      "content": "Chain stitch for your row height. Depending on if you are single or double crocheting, you will need to make different numbers of chain stitches here. This wikiHow will use double crochet for the rest of the example, so chain three (which is the equivalent of a double crochet). Remember any time that you make one of these chains stitch sets, it counts as one double crochet (or whichever stitch you're using) in the pattern. Do not forget to count it!"
    },
    {
      "title": "Continue to double crochet, using the center as an anchor.",
      "content": "Continue to double crochet, using the center as an anchor. Wrap the yarn over your hook (called a yarn over) and then insert your hook into the center hole. Grab the yarn on the other side and pull it through the hole. You should now see three loops on your hook. Catch the yarn again and pull it through the first two loops, and then catch the yarn again and pull it through the last two. Do this eight more times, until you have ten stitches in total around the center hole (counting the initial chain three as one stitch). Remember this and all double crochet stitches as \"3, 2, 1\" in order to get the loops right."
    },
    {
      "title": "Join the ends.",
      "content": "Join the ends. Find your chain three that you made in the beginning. Find the third chain, insert your hook into the stitch, yarn over, and pull the yarn through the stitch and then also through the loop on your hook."
    },
    {
      "title": "Continue on.",
      "content": "Continue on. You are likely following a pattern and at this point you should follow the specifications of the pattern. In general (if you are not following a pattern), you will chain three again and stitch double crochets into the outside of the circle, usually adding a single chain every three stitches or so. The second and following rows will be different depending on what final shape you're going for and what your pattern is."
    },
    {
      "title": "Set up your yarn.",
      "content": "Set up your yarn. Point your left pointer and middle fingers together toward your right hand. Catch the working side of the yarn in your left ring and pinky fingers. Wrap the yarn end under and behind the top two fingers, and then around to the front, until it is looped twice around the pointer and middle fingers. Hold the yarn tight enough to keep tension on the yarn but loose enough that it can still slide through your fingers while you crochet. [2] X Research source"
    },
    {
      "title": "Create the loop.",
      "content": "Create the loop. Place your left hand face up and insert the hook into the hollow between the two fingers. Go under the first loop, grab the second loop, then flip the hook over until it is lying flat against the top of your hand. Twist the hook around until the hook returns to the original position. The yarn around your fingers will now act as the center loop."
    },
    {
      "title": "Make your stitches.",
      "content": "Make your stitches. Stretch out your pinkie and ring fingers to expose the working yarn. Yarn over and pull through the loop on your hook. Chain three (for double crochet) and then switch your hold: use your thumb and middle finger on your right hand to pinch the joint between the chains and the loop, and slide your fingers out of the loop (you can reinsert your ring finger to keep the loop taut if it helps you). Double crochet into the large loop as normal and make eight more double crochets in a line along the big loop (creating a total of ten again). Do not let go of the tail on the loop. This is very important. You should keep holding the tail in place with your finger, or secure it with tape."
    },
    {
      "title": "Pull the tail.",
      "content": "Pull the tail. Holding the end of your stitch line in your right hand, pull the tail with your left hand to form the circle. You can pull it to whatever tightness suits you."
    },
    {
      "title": "Join the ends.",
      "content": "Join the ends. Find your chain three that you made in the beginning. Find the third chain, insert your hook into the stitch, yarn over, and pull the yarn through the stitch and then also through the loop on your hook."
    },
    {
      "title": "Continue on.",
      "content": "Continue on. You are likely following a pattern and at this point you should follow the specifications of the pattern. In general (if you are not following a pattern), you will chain three again and stitch double crochets into the outside of the circle, usually adding a single chain every three stitches or so. The second and following rows will be different depending on what final shape you're going for and what your pattern is."
    },
    {
      "title": "Make a long chain.",
      "content": "Make a long chain. Chain stitch until you have a long single chain. Chain stitches are done by placing the yarn over the hook from the back, grabbing the yarn with the hook, and pulling the yarn through a loop in the yarn."
    },
    {
      "title": "Roll your spiral.",
      "content": "Roll your spiral. Wrap the chain into a spiral until you have a circle shape. Make your chain longer if the circle it makes is not the size you want. Then, measure the distance from the center of the circle to the outside."
    },
    {
      "title": "Tie on the extra strings.",
      "content": "Tie on the extra strings. Unroll your spiral and tie four-eight extra strings onto the starting point of the chain. These strings should be about 50% longer than the distance you measured from the center to the edge of the spiral."
    },
    {
      "title": "Weave the strings.",
      "content": "Weave the strings. Re-roll the spiral and then weave the extra strings through the centers of the stitch in each row, bringing the string from the center to the edge. Do this for all of the strings and space them evenly."
    },
    {
      "title": "Tie off the ends.",
      "content": "Tie off the ends. Tie the ends off at the edge of the circle."
    },
    {
      "title": "Finish your project.",
      "content": "Finish your project. Tie off the end of the chain or continue your project as you want."
    },
    {
      "title": "Done!",
      "content": "Done! The more extra strings you have, the more secure the circle will be. This is not the most attractive of crocheted circles, but it is the easiest if you have trouble counting stitches and getting your circle to sit flat. If you are a beginner, start with small projects that are worked in flat rows, like potholders or scarves. [3] X Research source Then learn to crochet in the round, try crocheting granny squares and hats. [4] X Research source"
    }
  ]
}