{
  "url": "https://www.wikihow.com/Dig-a-Hole",
  "title": "How to Dig a Hole",
  "steps": [
    {
      "title": "Call the municipal government to verify digging the area is safe.",
      "content": "Call the municipal government to verify digging the area is safe. Whenever you are digging, you must always first consult your local utility authority about the underground utility layout, especially if you live in a suburban or even semi-rural area. Digging into the layout isn't just disruptive but potentially lethal if you hit electrical wires, gas lines, or water pipes. Even in the mildest cases, a lot of hassle can be bypassed if you contact the proper authorities first. Remember the words: \"Call before you dig.\" Note that this is a free service. If you are in the US, call 811. [1] X Research source This will connect you with the Nationwide Dig line, which can connect you with a local team. They will give you a work ticket reference number and let you know when you can expect the inspection to take place. You'll need to mark the area where you plan to dig with white paint. If you're looking for the right number to call, you can search online: \"dig a hole\" and your city or municipality. The proper authority should come up in the first or second listing."
    },
    {
      "title": "Spray a hole outline.",
      "content": "Spray a hole outline. If your hole is going to be any bigger than a post, it is good to first have an outline of how big you'd like the hole to be. Without a line, diggers tend to miscalculate how big their finished hole should be. With a can of white marking spray paint, spray the area you would like to have dug up. Be generous with the size; it's usually better to have a hole that's slightly too big than one too small for your needs. [2] X Research source If you're digging post holes, you should run a straight string along the area you'd like to see fenced and spray markers or drive marker stakes into the ground at consistent intervals across the line. [3] X Research source"
    },
    {
      "title": "Gather the right supplies for the job.",
      "content": "Gather the right supplies for the job. Due to how many different types and sizes of holes can be dug, there's no all-encompassing list to turn to if you want to know what equipment you'll need. However, for virtually all kinds of holes, a shovel is necessary. While most of the work may be done with a shovel, other instruments may speed up the process. Though you may want to get the biggest tools available for efficiency's sake, you should choose tools that make sense for your body size. An appropriately-sized tool will keep you from tiring out quickly, thus improving efficiency in the long run. [4] X Research source A shovel and mattock are good for regular holes. Get your hands on a posthole digger if you need to make holes for a new fence. You should also consider how you're going to deal with the displaced soil. If you're putting the soil back in the hole once you've dug it up, you can shovel it back. Putting a tarp next to the hole will give you a clean place to place soil. Use a wheelbarrow to dispose of larger amounts of soil. If you plan on setting a post in concrete, have the mix, water, and mixer nearby. You'll also want two stakes of wood and two lengths of wood (1\"x4\"x5' or so) for cross-bracing and screws or Duplex nails for fastening."
    },
    {
      "title": "Use powered equipment if possible.",
      "content": "Use powered equipment if possible. Only dig by hand if you need to. Digging can be a very physically strenuous activity, and you will be better off if you can do it with the help of a machine. For the sake of making postholes for example, you can rent and use a power auger. [5] X Research source Power augers are used much like a lawnmower. It is a better idea to rent one than buy one yourself. Depending on the inventory of your local hardware store, you should probably have a choice between a one or two-man power auger. Base your decisions around the size and amount of holes you need to make. Talk to someone at the hardware store if you're unsure about the details. If you have to dig many holes (like for a fence), a two-person auger is your best pet. Augers can be extremely difficult for one person to handle and can even be dangerous if you are not familiar with the equipment. Rocky and heavy clay ground can be difficult to dig, even with a gas-powered auger. Get a good digging rock bar and post-hole diggers to help with this type of soil. Follow all safety guidelines when operating any machine. Avoid loose-fitting clothing and wear leather boots and eye and ear protection when operating."
    },
    {
      "title": "Wait for a dry day, if possible.",
      "content": "Wait for a dry day, if possible. Digging can be made very difficult if you're having to dig in rainy weather. If your hole is large enough, the rain will eventually pool up at the bottom of your hole, which can pose challenges depending on the type and depth of hole you're going for. Moreover, yard work is more enjoyable when it's done in reasonably good weather. Waiting for a good day is ultimately optional but it will have a major effect on the way you experience the work. Frozen soil is very difficult to work with, so it's best to dig in months without extreme weather."
    },
    {
      "title": "Loosen the dirt with a mattock.",
      "content": "Loosen the dirt with a mattock. Instead of going straight in with a shovel, you will save time and effort if you prep the area first with a mattock. A mattock is specifically designed to pierce topsoil and rip out roots. For the most part, you'll find the most resistance to your digging at the top. Once you break through the surface level, you can switch to a shovel and let the grunt work commence. [6] X Research source A good steel digging bar with a point in one end and a flat or pry point on the other end works well also. Especially if you must dig deeper than 6\" to 8\", which a Mattock cannot do. If you don't have a mattock, using a spade to tear up the sod will suffice as well."
    },
    {
      "title": "Shovel out the soil from the outside, moving inwards.",
      "content": "Shovel out the soil from the outside, moving inwards. Once you've broken the topsoil, it comes to the grunting phase of getting the soil out of the hole. [7] X Research source This may be a short step, or quite intensive, all depending on how big you want the hole to be. While you are shoveling, it's a good idea to shovel the perimeter first and shovel inwards from there. That way, you'll have a set perimeter, and won't be making the hole any bigger than you need to. Wear heavy boots when shoveling dirt. Step firmly and straight down on the shovel. Rock and wiggle the shovel side to side and forward to back to loosen the dirt and help the shovel go in. As with depth, it is better to err on the side of a hole being too big than too small."
    },
    {
      "title": "Keep your disposed of soil in one place.",
      "content": "Keep your disposed of soil in one place. It's important to keep a tidy workspace in most situations, and digging a hole is no different. Having your disposal pile next to the hole is preferable, as it minimizes the turnover time between shoveling loads of soil. Just make sure it's not so close that it will fall back into the hole. If the project is big enough, it's a good idea to offload the shovel loads directly into a wheelbarrow. Once the wheelbarrow is full, you can offload it somewhere further away and bring it back for more."
    },
    {
      "title": "Measure the depth of the hole.",
      "content": "Measure the depth of the hole. Keep a 25-foot tape measure handy while digging, or mark your desired depth on a stake you can use to measure the depth of the hole. Only measure the hole once you have cleaned out all the dirt."
    },
    {
      "title": "Lay down a tarp next to your hole.",
      "content": "Lay down a tarp next to your hole. A tarp is not necessary, but it helps a great deal with the cleanup. Placing the dug-up dirt on a tarp will reduce the mess caused by a lot of errant soil. Depending on the amount of soil you have to dig up, you can wrap up the tarp into a sack and carry it to the organic garbage as such, or shovel it back."
    },
    {
      "title": "Place ads for your free soil.",
      "content": "Place ads for your free soil. If you have a lot of soil and have nowhere for it to go (for instance, you already used some to amend your plant beds but you have quite a bit of soil left), there are probably others in your neighborhood who could use it for their landscaping projects. Putting an ad up somewhere like Craigslist is your best bet. There are no guarantees that someone will respond to your ad, but it is a way to get rid of your soil for free, all the while helping out a stranger while you're at it. [8] X Research source"
    },
    {
      "title": "Send your soil to a landfill.",
      "content": "Send your soil to a landfill. If you have enough excess soil from your digging operation and have nowhere to put it, you can send it to a landfill as a 'clean fill'. [9] X Research source You can send this excess to a landfill provided the soil has not been contaminated and meets your municipality's minimum sanitary requirements. The particulars will depend on where you're living, but you can usually find specific details on your home city's webpage. Keep in mind that you may be charged a fee for disposing of your soil in a landfill."
    }
  ]
}