{
  "url": "https://www.wikihow.com/Get-Revenge-on-Your-Siblings",
  "title": "How to Get Revenge on Your Siblings",
  "steps": [
    {
      "title": "Decide your revenge depending on the sibling's age.",
      "content": "Decide your revenge depending on the sibling's age. You probably wouldn't want to use the same prank on an 18-year-old as you would on a 7-year-old. Try to find a prank that will be appropriate for their age."
    },
    {
      "title": "Choose how you want to get revenge.",
      "content": "Choose how you want to get revenge. You can get them into trouble with your parents, or simply prank them. It’s generally best to leave your parents out of it unless it’s a really serious situation. You might as well get your revenge in a fun way through a prank."
    },
    {
      "title": "Choose your prank.",
      "content": "Choose your prank. Make sure it isn't a predictable prank. There are so many great pranks out there, there’s no reason to fall back on one that's boring. Pranks have all sorts of levels of intensity so choose one based on how much revenge you're looking for. If you know good pranks, write them in a notebook and keep it in a place no one would look such as in your desk, under a pillow, or in a box. Keep your ideas secret until you decide to act."
    },
    {
      "title": "Set their clock four or five hours ahead.",
      "content": "Set their clock four or five hours ahead. Then when you wake them up, tell them that they have slept through whatever they needed to do that day. And make sure you are dressed for the day when they wake up. Be careful though; if they accuse you, act innocent as if it were their fault. [1] X Research source"
    },
    {
      "title": "Torment them with their least favorite food.",
      "content": "Torment them with their least favorite food. Make sure to hand out the biggest portion of that dish onto their plate when it's being served. Alternatively, you can use a food they like. If they really like ice cream, eat all their ice-cream, and leave the empty container in the freezer."
    },
    {
      "title": "Try taking their things and hiding them.",
      "content": "Try taking their things and hiding them. Put their pencil case under the couch or their homework in the microwave. Try taking only one thing every day (something that they won't notice right away, like a pen). Hide it in your room and make sure it blends in with your stuff or simply hide it in your closet. Keep making the things you take more and more important to them every day, but don't take things that are very important to them. You can also do this to take revenge for them having a messy room if you share a room. If they accuse you of hiding their stuff, deny it! If you act like you have no idea what’s going on either they might become even more confused."
    },
    {
      "title": "Glue their deodorant closed.",
      "content": "Glue their deodorant closed. Buy some superglue that is invisible once it dries and glues all their deodorants closed. If you want to be really mean, you can glue all their soaps in the shower closed too. This will confuse them and then really frustrate them. [2] X Research source"
    },
    {
      "title": "Put some tape on the nozzle of their sink.",
      "content": "Put some tape on the nozzle of their sink. Leave a small gap towards the front. When they go to wash their hands, the water will spray them right in their face! This is a simple and effective prank. [3] X Research source"
    },
    {
      "title": "Spray whipped cream in their hands while they are sleeping.",
      "content": "Spray whipped cream in their hands while they are sleeping. When they scratch their nose or roll over to sleep on their side, they’ll end up covering themselves with whipped cream. Be careful however, as this might get you in trouble with your parents. [4] X Research source"
    },
    {
      "title": "Change their autocorrect in Microsoft Word.",
      "content": "Change their autocorrect in Microsoft Word. If your sibling is at the point in school where they are writing a lot of papers on their computer, you can prank them using their word processing system. Go to “Autocorrect” under the “Tools” tab and change the settings to automatically replace normal words like “that” or ‘the” with ridiculous ones like “blarganauv” and “snoodle-shanks”. Change as many words as you want! If you want to really get them in trouble you can change the words to something like “my teacher stinks” and hope that they don’t notice it."
    },
    {
      "title": "Change the wallpaper on their computer.",
      "content": "Change the wallpaper on their computer. Do this after they go to bed or before they head to school in the morning. You don't want to give them a chance to notice it and change it back. Change their wallpaper to something embarrassing, like a picture of them sleeping in a funny way. You know your sibling, choose something that you think would embarrass them. [5] X Research source When they open up their laptop at school people will see their new background."
    },
    {
      "title": "Fill their backpack with underwear.",
      "content": "Fill their backpack with underwear. Right before they go to school, find their backpack, empty it, and fill it with their underwear. They will be so confused, and it will also inconvenience them throughout the day."
    },
    {
      "title": "Talk to your sibling’s girlfriend or boyfriend at school.",
      "content": "Talk to your sibling’s girlfriend or boyfriend at school. Introduce yourself and say, “Oh, you must be [insert name that isn’t theirs]”. When they say no, act confused and tell them that your sibling is always talking about this other person. This will get your sibling in some hot water! [6] X Research source"
    }
  ]
}