{
  "url": "https://www.wikihow.com/Deep-Fry-at-Home",
  "title": "How to Deep Fry at Home",
  "steps": [
    {
      "title": "Do your frying in a piece of heat-resistant cookware with steep sides.",
      "content": "Do your frying in a piece of heat-resistant cookware with steep sides. When deep frying foods at home, you’ll get the best results using an electric deep fryer, stockpot, deep saucepan, wok, or Dutch oven. However, any type of cookware will work as long as it’s big enough to hold several cups of oil (along with your food) and resilient enough to withstand extremely high temperatures. [1] X Research source A standalone deep fryer, of course, will offer the greatest convenience and ease of use for most fry jobs. In terms of standard cookware, the high, angled walls of stockpots and woks are especially useful for catching oil splashes."
    },
    {
      "title": "Select an oil with a high smoke point.",
      "content": "Select an oil with a high smoke point. The term “smoke point” refers to the temperature at which a certain type of oil burns. The best oils to use for frying are therefore ones with high smoke points. Canola, vegetable, peanut, and corn are among the most commonly used varieties. [2] X Research source If you prefer, you can also use a blend of several different oils to achieve just the right flavor. For a slightly healthier alternative, try substituting some of your main frying oil with coconut, avocado, or palm oil, or even ghee (clarified butter) or rendered animal fat. [3] X Research source Extra-virgin olive, sesame, and other unrefined oils, along with butter and shortening, all have low smoke points, and should never be used for deep frying."
    },
    {
      "title": "Grab a deep-frying thermometer and a pair of tongs or wooden spoon.",
      "content": "Grab a deep-frying thermometer and a pair of tongs or wooden spoon. The thermometer will allow you to check the temperature of your food throughout the frying process. This will ensure that it comes out with the perfect savory flavor and crisp, golden-brown texture. You’ll use the tongs or spoon to stir your food as it cooks and remove it from the fryer once it’s done. [4] X Research source If you don’t have a thermometer, a wooden spoon can also double as a temperature-checking device. Dip the tip into the oil. If bubbles appear around it, it means your oil is hot enough. Never use a plastic spoon for deep frying. The hot oil will cause it to melt in a hurry!"
    },
    {
      "title": "Prepare a cooling rack or layer of paper towels to remove excess oil.",
      "content": "Prepare a cooling rack or layer of paper towels to remove excess oil. Racks made specifically for cooling fried foods will work best, but you could also use one or two removable racks from a toaster oven. If neither of those are an option, line a large serving dish with a thick layer of folded paper towels. [5] X Research source When it comes time to take your food out of the fryer, you’ll place it on your cooling surface to give any standing oil a chance to drain off. It’s a good idea to put down some paper towels even if you’re using a separate drying rack. The absorbent layer will help soak up even more oil. [6] X Research source"
    },
    {
      "title": "Fill your fryer with enough oil to submerge your food at least halfway.",
      "content": "Fill your fryer with enough oil to submerge your food at least halfway. The exact amount will depend on what you’re cooking and the size of your fryer. Generally, however, you’ll probably use around 1-2 quarts (0.95-1.9 L) of oil to cover as much of the item you’re frying as possible. [7] X Research source Ideally, you should fully submerge your food, if you have enough room. Make sure the oil sits 2–3 inches (5.1–7.6 cm) below the top of your fryer to allow it to bubble without spilling over."
    },
    {
      "title": "Heat up the oil to 300–375 °F (149–191 °C).",
      "content": "Heat up the oil to 300–375 °F (149–191 °C). If you’re using an electric deep fryer, switch it on and program it to the desired temperature. If you’re using another type of cookware, place it on the stove over high heat. Most fry recipes call for a temperature in the 300–375 °F (149–191 °C) range. If the recipe you’re following doesn’t provide a specific temperature, your best bet is somewhere between 325 °F (163 °C) and 350 °F (177 °C). [8] X Research source If the temperature of your fryer is below 300 °F (149 °C), your food may come out soggy and undercooked. If it climbs over 375 °F (191 °C), the oil (and your food) may burn. Cooking temperatures can vary depending on the item being fried. Be sure to consult your recipe or the owner's manual that came with your fryer to get an idea of what temperature works best for a certain type of food. Keep flammable objects and substances a safe distance away from the fryer while it's in use."
    },
    {
      "title": "Bread or batter your food for a delicious, crispy exterior.",
      "content": "Bread or batter your food for a delicious, crispy exterior. Coating your items in a rich breading or batter before frying them is an easy way to improve both their flavor and texture. Make sure the entire outer surface of the item is completely covered before adding it to your hot oil. [9] X Research source Prepare breaded items by dipping them in a wash made from 3-4 beaten eggs, then rolling them in flour, breadcrumbs, or a combination of both. To mix up a simple all-purpose batter , whisk together 1 ⁄ 2 cup (120 mL) of milk or buttermilk, 1 ⁄ 3 cup (79 mL) of water, ½ cup (60 g) of flour, ½ cup (60 g) of cornstarch, 1½ teaspoons (10.5 g) baking powder, and salt and pepper to taste. If you like, you can turn up the taste of your breading or batter by adding a dash of seasoned salt, garlic or onion powder, black or cayenne pepper, paprika, or oregano."
    },
    {
      "title": "Place your food in the fryer slowly and carefully.",
      "content": "Place your food in the fryer slowly and carefully. Use your tongs or a wire straining spoon to lower the food into the oil and minimize splashing. It’s important to add your food gradually or in small amounts. Throwing too much in at once will lower the temperature of the oil, which in turn will cause your food to come out underdone and oversaturated. [10] X Research source Dunk especially large or long items in 1–2 inches (2.5–5.1 cm) at a time with the rest of the item pointed away from you to ensure that any pops or splatters go in the other direction. If you’re planning on frying a large quantity of something, it may help to split the food up into multiple smaller batches to keep your oil hotter longer."
    },
    {
      "title": "Keep your food moving as it fries to prevent it from sticking.",
      "content": "Keep your food moving as it fries to prevent it from sticking. Use your tongs or wooden spoon to stir or reposition your items every few minutes. If the pieces are crowded together, they’ll be more likely to stick and less likely to brown evenly. [11] X Research source If you’re frying a large item that isn't completely submerged, flip it over halfway through the cooking process so that each side spends an equal amount of time in the oil. To prevent accidental burns, be careful not to leave your hand over the opening of the fryer for too long."
    },
    {
      "title": "Take your food out of the fryer once it turns golden brown.",
      "content": "Take your food out of the fryer once it turns golden brown. Different foods have different recommended cook times—some may only take 30 seconds to fry to completion, while others might need several minutes. For this reason, it’s usually best to go by the color of the exterior when determining whether an item is done. [12] X Research source Meat is the only exception to the rule. Anytime you’re frying chicken, pork, or another type of meat that’s unsafe to eat undercooked, use a thermometer to find it’s internal temperature before declaring it done. Chicken and other varieties of poultry should always be cooked to an internal temperature of at least 165 °F (74 °C), while pork should be allowed to reach 145 °F (63 °C). Beef can be safely eaten at or slightly below 145 °F (63 °C). [13] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Remove the food from the oil using tongs or a slotted spoon.",
      "content": "Remove the food from the oil using tongs or a slotted spoon. Once you’ve fried your items to the perfect golden brown finish, pick them out of the oil with your tongs. Use your slotted spoon (or better yet, a metal straining spoon) to fish out smaller pieces. Gently shake the excess oil from the food before transferring it to its cooling surface. [14] X Research source Try not to pick up any stray burnt bits that happen to be floating on the top of the oil along with the food."
    },
    {
      "title": "Place your food on its cooling surface to cool and dry.",
      "content": "Place your food on its cooling surface to cool and dry. Set your still-hot items directly on the cooling rack or pad of paper towels you have prepared. There, they’ll be able to finish drying and reach a safe temperature for eating. Make sure you allow the food to sit for 2-3 minutes before digging in. [15] X Research source Your food will be extremely hot when it first comes out of the oil, so avoid handling it until it’s had time to cool to the touch. Keep in mind that even then, it may still be hot enough inside to burn your mouth! If you wish to sprinkle on some additional seasoning, do it while your food is cooling down. Adding seasoning while food is still warm helps ensure that it will stick, and that its flavor will be infused into each bite."
    },
    {
      "title": "Save and reuse your fry oil or dispose of it in a separate container.",
      "content": "Save and reuse your fry oil or dispose of it in a separate container. Once you're done frying, strain the used oil through a coffee filter into a spacious, heat-resistant container and store it at room temperature. You can then break it out the next time you're in the mood for fried fare. If you'd prefer to use fresh oil, simply throw the sealed container in the garbage. [16] X Research source Glass jars, metal canisters, and durable plastic food-savers all make great containers for storing used fry oil. If you plan on getting rid of the oil, put it in something disposable instead, such as a plastic yogurt container. Reusing oil allows you to get more use out of a single batch and save some money in the process."
    },
    {
      "title": "Throw some French fries into your fryer for a simple, tasty snack.",
      "content": "Throw some French fries into your fryer for a simple, tasty snack. French fries practically cook themselves, which makes them great to test out your home frying setup. Just crack open a bag frozen store bought fries and fry them for 5-10 minutes. You can also peel and slice a few fresh potatoes yourself, if you’d prefer to make them from scratch. [17] X Research source You can use the same basic procedure to whip up a batch of homemade potato chips or hash browns, or prepare sweet potato fries for a more nutritious twist. Par-boiling your fresh or frozen French fries for 3-4 minutes before putting them in the fryer will help ensure that they come out fully cooked and perfectly crispy. [18] X Research source"
    },
    {
      "title": "Deep fry chicken to enjoy classic comfort food.",
      "content": "Deep fry chicken to enjoy classic comfort food. Chicken is the heavyweight champion of fried foods. Coat your favorite bits with a simple homemade breading or batter , then dunk them into your preheated oil until they’re golden brown. You can fry up an entire chicken in 30-45 minutes, and it can all be done in a simple pot, if you go one piece at a time. [19] X Research source You could even deep fry an entire chicken (or, say, a Thanksgiving turkey ) if you have a big enough pot! If possible, always fry large food items like whole turkeys outdoors to reduce the risk of fire. When cooking frozen poultry, make sure you give it time to thaw completely before dropping it in the fryer to prevent oil splatters."
    },
    {
      "title": "Batter and fry fish for a quick and delicious meal.",
      "content": "Batter and fry fish for a quick and delicious meal. Coat a few fillets of your favorite fish in a classic batter made from flour, milk, and eggs and fry them until the batter turns golden-brown. Move the fish around a little as it cooks to prevent it from sticking, but avoid handling it too much, or it could fall apart in the fryer. [20] X Research source Adding a little beer to your batter will lend it a richer flavor and a lighter, crispier texture. [21] X Research source For the full pub experience, serve your homemade fish and chips with French fries, green peas, and malt vinegar."
    },
    {
      "title": "Fix some crunchy tempura vegetables.",
      "content": "Fix some crunchy tempura vegetables. Pick up some traditional Japanese tempura batter mix at your local Asian supermarket, along with some bell peppers, shiitake mushrooms, Kabocha squash, eggplant, and an assortment of other fresh veggies of choice. After dipping the veggies in the delicate batter, fry them for 3-4 minutes. Watch for the outside to puff up and turn a pale golden color. [22] X Research source Other popular vegetables for tempura include sweet potatoes, onion, carrots, lotus root, and jalapeños. Tempura is wonderful if you’re looking for a lighter, more nutritious way to enjoy fried food, and makes a perfect companion for homemade hibachi or chicken teriyaki."
    },
    {
      "title": "Make your own version of fried cheese or gooey mozzarella sticks.",
      "content": "Make your own version of fried cheese or gooey mozzarella sticks . Cut fresh mozzarella cheese into 3–4 in (7.6–10.2 cm) segments, then roll them into a loose tube shape between your palms. Dredge the cheese in egg wash and seasoned Italian-style breadcrumbs, then fry for 30 seconds to a minute and serve with warm marinara sauce. [23] X Research source String cheese happens to be just the right size and shape for mozzarella sticks if you’re in a pinch. [24] X Research source"
    },
    {
      "title": "Thaw and dry your food completely before frying it.",
      "content": "Thaw and dry your food completely before frying it. No matter what you decide to fry, make sure you do away with any excess moisture prior to adding it to your oil. The best way to do this is to gently pat the outside of the item dry with a folded paper towel. There should be no visible water or ice on the item by the time it goes into the fryer. [25] X Research source Oil and water don’t mix. If you add your food while it’s still cold or wet, it could send hot oil splattering all over the place. Frying moist or partially-frozen items can also cause them to cook inconsistently. One way to speed up thawing and prevent uneven cooking is to prep your food for the fryer by cutting it into uniformly-sized pieces. [26] X Research source"
    }
  ]
}