{
  "url": "https://www.wikihow.com/Get-Over-a-Player",
  "title": "How to Get Over a Player",
  "steps": [
    {
      "title": "It's tough to get over someone if you keep communicating.",
      "content": "It's tough to get over someone if you keep communicating. It’s not easy, but a complete and total break is the way to go. A player doesn’t deserve your friendship or attention after the way they treated you. Stop following them on social media, ignore their DMs, and block their calls/texts. If you run into them, keep your interaction short and sweet. [1] X Research source Remember that you’re dealing with a player! If they’re keeping the lines of communication open with you, they might try to manipulate you again. [2] X Research source"
    },
    {
      "title": "It’s normal to feel sadness, anger, and self-doubt after a breakup.",
      "content": "It’s normal to feel sadness, anger, and self-doubt after a breakup. Repressing those feelings isn’t healthy, so give yourself time and space to process them. Choose a set period of time (a week, a month, or whatever feels right) to just experience your feelings. Once the set time period ends, make an effort to focus solely on the future. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Give yourself permission to cry, yell, or spend all day listening to sad music. Get those emotions out so you can let them go. [4] X Research source Writing in a journal can help you work through emotions and reduce anxiety. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Getting played is not your fault and there’s nothing to be ashamed of.",
      "content": "Getting played is not your fault and there’s nothing to be ashamed of. Players are very good at taking advantage of people. If you’re angry at yourself for being fooled, don’t be! Habitually manipulating people means there’s something wrong with the player, not with you. [6] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. You're not the problem. [7] X Research source Don't let this toxic person prevent you from approaching future relationships with an open heart and mind. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Keeping their gifts or mementos prevents you from moving on.",
      "content": "Keeping their gifts or mementos prevents you from moving on. Make your living space a player-free zone! Box up anything this person left behind or gave to you – borrowed books, clothing, ticket stubs, etc. These items might seem harmless, but they’re visual reminders of bad memories. [9] X Research source How you handle these items is totally up to you. You can trash them, leave them in a box on your ex's doorstep, or just pack them away so they're out of sight."
    },
    {
      "title": "Go ahead and treat yourself—you deserve it.",
      "content": "Go ahead and treat yourself—you deserve it. Self-care is different for everyone, so focus on doing things that really make you happy. Splurging on a new outfit, taking a bubble bath, getting a new haircut, enjoying your favorite dessert—it’s your call. [10] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. Try to do something nice for yourself every day. [11] X Research source Spending time in nature, getting a massage, taking a yoga class, or even savoring a warm cup of tea can be healing self-care rituals. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Hit the gym or take a boxing class to blow off steam.",
      "content": "Hit the gym or take a boxing class to blow off steam. It's normal to feel angry if you’ve been played, but stewing in those bad vibes won't help. Physical activity is a great way to funnel anger into something positive. [13] X Research source Consider options like: Kickboxing, MMA, or boxing classes [14] X Research source Running or swimming Spinning or cross-fit Aerobics, yoga, or dance classes"
    },
    {
      "title": "Get outside your comfort zone and try some new things.",
      "content": "Get outside your comfort zone and try some new things. Dabble in a few new hobbies, dive into your bucket list, take an online class, or join a sports team. Pursue something that you’ve always to try. New activities and interests engage your mind and keep you focused on the present. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, learn to play an instrument, sign up for a marathon, take a painting class, or learn to sky dive."
    },
    {
      "title": "It’s easy to get off track when you’re heartbroken.",
      "content": "It’s easy to get off track when you’re heartbroken. If you start missing sleep or skipping meals, though, your immune system will take the hit. You might start feeling drained, anxious, or come down with a cold. [16] X Research source It’s tough to power through when you’re down, but forcing yourself to go through the motions can help you heal faster. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try to go to sleep and wake up at the same time every day. A consistent sleep pattern can do wonders for your physical and mental health. [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Remember to eat several small, healthy meals throughout the day so you don’t run out of energy."
    },
    {
      "title": "Being around trustworthy and supportive people is very healing.",
      "content": "Being around trustworthy and supportive people is very healing. Connect face-to-face with friends and family members when you can, but phone calls, texting, and video chats are great, too. [19] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. Choose good listeners since you’ll probably need to vent or talk about your feelings at first. [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source People often isolate themselves when they're sad; being aware of that can help you prevent falling into that trap. [21] X Research source"
    },
    {
      "title": "Breakups are hard and there’s nothing wrong with getting help.",
      "content": "Breakups are hard and there’s nothing wrong with getting help. If you’re feeling stuck in the sadness, a therapist can help you get back on your feet by listening, providing guidance, and teaching you healthy coping strategies so you can heal and get back to living your best life. [22] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Reader Poll: We asked 678 wikiHow readers which coping strategy they find most helpful after experiencing rejection, and only 9% of them agreed on seeking professional help or therapy. [Take Poll] Therapy can be extremely helpful and you should always seek help if you need it, but in many cases, it may be enough to rely on the support of friends and family."
    }
  ]
}