{
  "url": "https://www.wikihow.com/Disinfect-Earplugs",
  "title": "How to Disinfect Earplugs",
  "steps": [
    {
      "title": "Inspect your reusable earplugs, first.",
      "content": "Inspect your reusable earplugs, first. You are checking to see if your earplugs are torn, bent, or excessively dirty. Your earplugs can harden and become rigid if they are covered in a lot of earwax and skin oils from your ear canal. This loss of flexibility will prevent you from getting a good seal when you use your earplugs. [1] X Research source [2] X Research source Your ear canal connects your outer ear with your eardrum. It makes earwax, which is a mixture of shed skin cells, a little bit of dust, and a fat-like secretions from the glands in the canal. The secretions from the glands lubricate the ear canal and fight off infections from bacteria and fungi. When you insert earplugs covered with stains and other materials, you run the risk of overwhelming your ear canal’s natural defenses with too much dirt and germs. [3] X Research source"
    },
    {
      "title": "Throw away your damaged or dirty earplugs.",
      "content": "Throw away your damaged or dirty earplugs. Do not continue with trying to disinfect them. Buy yourself a new pair of reusable earplugs. [4] X Research source Reusable earplugs can be made from a variety of materials. The more common reusable earplugs are made from pre-molded silicone rubber, vinyl, other hypoallergenic synthetic rubbers, and foam covered in a special material or “skin”. These types of earplugs can be used more than once because they are very durable and long-lasting when washed properly. But, they are not indestructible and must be replaced. [5] X Research source [6] X Research source"
    },
    {
      "title": "Have a hands-off approach.",
      "content": "Have a hands-off approach. You want to keep your earplugs clean, but sometimes your schedule will not allow for the time it takes to wash them by hand. Clean your earplugs in the washing machine, the dishwasher, or boiling water. You still have to air dry them and store them in their case. Keep track of your small earplugs. Put your earplugs in a fine mesh bags used for produce, close the bag with a rubber band, and wash them in the dishwasher. [7] X Research source You can put your earplugs in a delicates washing bag when you clean them in the washing machine. Be careful not to damage your earplugs."
    },
    {
      "title": "Treat your earplugs gently with a hand washing.",
      "content": "Treat your earplugs gently with a hand washing. Fill a bowl with a cleaning solution. The solution can be soapy water or hydrogen peroxide. Add a mild soap, like dish detergent, to warm water and mix until you see suds. Or, use undiluted hydrogen peroxide."
    },
    {
      "title": "Soak your earplugs in the cleaning solution.",
      "content": "Soak your earplugs in the cleaning solution. Let them sit undisturbed in the soapy water or hydrogen peroxide for several minutes. You will know exactly how long your earplugs need to soak after a couple of cleanings."
    },
    {
      "title": "Scrub your earplugs, gently, in new soapy water.",
      "content": "Scrub your earplugs, gently, in new soapy water. Discard the old cleaning solution. It contains the dirt and grime you are trying to get off your earplugs. Remove any visible materials with your fingers, a soft cloth, or a soft brush, like a toothbrush. [8] X Research source Buy a new toothbrush just for this purpose. A used toothbrush, even if it has been cleaned, will still have bacteria from your mouth on it."
    },
    {
      "title": "Rinse your earplugs with cold water.",
      "content": "Rinse your earplugs with cold water. Move on to this step only after you have removed all of the dirt and stains with a thorough scrub. Do not leave behind any matter which may harden your earplugs; this may force you to discard them sooner than you want."
    },
    {
      "title": "Wipe your earplugs with alcohol.",
      "content": "Wipe your earplugs with alcohol. Your earplugs have been disinfected. They should be soft and clean without any deformities or tears."
    },
    {
      "title": "Air dry your earplugs in a clean place.",
      "content": "Air dry your earplugs in a clean place. Let your ear plugs dry completely before you use them. You can squeeze the ear plugs or pat them gently with a towel to get out some of the excess moisture. [9] X Research source Using moist earplugs can lead to irritation, pain, or infection. The skin in your ear canal does not respond well to extra moisture. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Store your dry ear plugs in their case.",
      "content": "Store your dry ear plugs in their case. It is a good habit to immediately return your earplugs to their case whenever you are not using them. This keeps your clean earplug protected from damage as well as any dust and dirt. [11] X Research source Your reusable earplugs will last from a couple of weeks to several months. It depends on how often you use your earplugs, how often you clean them, what type of earplugs you buy as well as where and how you store them. [12] X Research source"
    },
    {
      "title": "Wash your earplugs after every use.",
      "content": "Wash your earplugs after every use. This can be time consuming, but it is worth the effort. You decrease your chances of developing ear irritation or an infection from earplugs covered in earwax, skin oils, and dust."
    },
    {
      "title": "Do not share your earplugs with anyone.",
      "content": "Do not share your earplugs with anyone. You are sharing whatever germs, earwax, and skin oils the other person has in her ear canal. This is another way you could develop ear irritation or an infection."
    },
    {
      "title": "Think about using only disposable earplugs.",
      "content": "Think about using only disposable earplugs. You can throw away your earplugs after every use. This is a reliable way to make sure your earplugs are always in good working condition. But, you may end up spending more money this way, and it creates more waste."
    },
    {
      "title": "Do not use your earplugs all the time.",
      "content": "Do not use your earplugs all the time. When you keep them in for long periods of time, your earplugs stop the normal process of earwax being moved through your ear canal towards your outer ear. Take out your earplugs sometimes and let your ear canals “breathe.” Your earplugs can push earwax deeper into your canal where it builds up and hardens. You may develop ear pain, ringing in your ears, irritation, infection, discharge and even hearing loss."
    },
    {
      "title": "Do not clean and re-use disposable earplugs.",
      "content": "Do not clean and re-use disposable earplugs. A washing may cause your earplugs to degrade. They can no longer protect your hearing from loud noises or keep water out of your ears when you swim. Having earplugs that properly guard your ears is an important part of good ear hygiene. Materials, like uncovered foam and soft wax, used in single-use or disposable ear plugs are not designed to be cleaned with soapy water or alcohol. If your disposable ear plugs are no longer soft and pliable, they cannot form a good fit in your ears."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}