{
  "url": "https://www.wikihow.com/Fight-Procrastination",
  "title": "How to Fight Procrastination",
  "steps": [
    {
      "title": "Force yourself to begin the task.",
      "content": "Force yourself to begin the task. This might seem overly simplistic, but even sitting down at your desk to start a project or buying the materials needed for a home repair, for example, can help change your mindset and fight procrastination. The old saying that getting started is half the battle is true, especially if you struggle with procrastination. [1] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. To help yourself get started, try to make your task as enjoyable as possible. For example, if you need to sit down to file your taxes, turn on some music that you like or envision how happy you’ll be once the task is complete and you don’t have to worry about it anymore. (Especially if you get a refund!)"
    },
    {
      "title": "Eliminate your known distractions.",
      "content": "Eliminate your known distractions. Are you addicted to Tumblr or Pinterest? Is Netflix calling your name and taking you away from work that you need to be doing? If possible, disconnect from the internet while you work. Working with spreadsheets or other Office applications usually allows for this. If you need the internet for your project, try telling yourself that you can spend as much time watching your favorite shows as you like once the project is finished. [2] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. If noise is a major distraction for you, then you might want to try foam earplugs or noise canceling headphones. You can find foam earplugs in any drugstore or convenience store."
    },
    {
      "title": "Set concrete goals for yourself.",
      "content": "Set concrete goals for yourself. Sometimes procrastination is the result of feeling overwhelmed with too many projects or having tasks with non-specific requirements or due dates. Self-starting can be hard. It’s important to set specific, doable goals for yourself. [3] X Research source For example, if you know that you have a major research paper due at the end of the semester, then it can be hard to start on it for a variety of reasons: a distant due date, no specific topic for the paper, or simply that there are more enjoyable ways to spend your time. However, if you set concrete goals like choosing a topic early on or writing a page or two a week, then the large, intimidating project that you might normally procrastinate on won’t simply exist in the abstract a few months down the road. It will exist “now” and you will be less likely to procrastinate and be pulling all-nighters at the end of the semester."
    },
    {
      "title": "Minimize interruptions as much as possible.",
      "content": "Minimize interruptions as much as possible. When you finally do sit down to complete a task you’ve been procrastinating on, it can be frustrating to get interrupted repeatedly. Whether it’s an inconsiderate roommate or colleague or electronic interruptions, minimizing these will help you actually be able to get to work and not procrastinate. [4] X Research source Set your email client to not automatically alert you when emails arrive, and silence your phone completely. Be sure the phone is set to mute, not vibrate, as you can still hear/feel the vibrate setting and it will still distract you. Politely let your chatty roommate or colleague know that you are up against a deadline and have to get some work done. If you feel rude saying this, you can try softening the blow by mentioning that you can chat with then over lunch or dinner later on if they’re free, but right now you have to get your work done."
    },
    {
      "title": "Prioritize your work.",
      "content": "Prioritize your work. Often, we procrastinate because we simply feel overwhelmed and don’t know where to begin. To help fight procrastination, it is important to prioritize your work in order of importance and/or by deadline. [5] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. Using a planner is helpful for this. Get one large enough to have both a weekly and monthly view so you can look ahead to future projects and visualize the deadlines for current projects. [6] X Research source If you prefer, you can use the planner on your phone, tablet, or computer. If you choose to use an electronic planner, be sure to set audible alerts because these planners and calendars tend to have a smaller screen view that might not be able to show all tasks on a single screen. Play around with planner/calendar apps to find the one that works best for you and has the best interface."
    },
    {
      "title": "Change your work environment.",
      "content": "Change your work environment. Sometimes our work environment is the reason we tend to procrastinate. If you find yourself working in the middle of a huge mess or with noisy neighbors that drive you crazy, you need to change your environment to be productive and stop procrastinating. [7] X Research source Try devoting 10 minutes to do a quick “tidy” of your immediate work space. Organize papers, put away clutter, and throw out any trash. This will give you some breathing room and a small sense of accomplishment which will help you begin your work. If environmental factors beyond your control are the problem, then you might need to relocate your work space for the day. Good choices might be your local library or a cafe."
    },
    {
      "title": "Break tasks down into manageable sizes.",
      "content": "Break tasks down into manageable sizes. Feeling overwhelmed by huge projects can cause us to simply delay starting them. Breaking down projects into smaller goals can help you stop procrastinating and get started on your work. [8] X Research source For example, if you need to repaint your bedroom, all the sanding, taping, trim work, priming and painting can be very overwhelming. However, if you make a goal to sand and clean the walls one day, tape everything off and prime the walls the next day, and finally paint on the third day, your major project will become more manageable, and you’ll be more likely to get started on it."
    },
    {
      "title": "Try using productivity apps.",
      "content": "Try using productivity apps. There are apps and browser extensions that will block your social media or any other sites that you deem “time wasters.” Check out one of these to maximize your productivity and cut down on distractions that help you procrastinate. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Some good examples of apps and browser extensions designed to help you stay on track are StayFocusd for Google Chrome or Timeful and Pocket for Apple and Android products."
    },
    {
      "title": "Take mental health breaks.",
      "content": "Take mental health breaks. Although this may seem counterproductive, breaks can help you reset and refocus. Get a snack or a cup of coffee and reflect on what you still need to do. Avoid beating yourself up for not having done more up to this point, and use your break as a refresher. Stand up, stretch, and use positive thinking to tell yourself that even though you haven't accomplished as much as you wanted up to this point, you will once you go back to work. Sometimes a short break and a personal pep talk can help you refocus and stave off procrastination. [10] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Reward yourself for completing tasks.",
      "content": "Reward yourself for completing tasks. Even if your project is something you really dislike, you can help yourself get to work on it if you promise yourself something enjoyable upon its completion. You might tell yourself that you can binge watch your favorite show on Netflix or go out for a drink or some ice cream once you’ve completed your goal or task. Having something to look forward to can help jumpstart you and help you fight procrastination. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Have an accountability partner.",
      "content": "Have an accountability partner. If you have a friend or colleague who struggles with procrastination, too, then you might benefit from using each other as accountability partners. You can set up a friendly competition to see who can get further on their work, or you can simply use each other as support. Being accountable to someone will help you stop procrastinating. [12] X Research source For example, if you catch your accountability partner checking Facebook during your designated work time, then you can gently remind them that they need to be working, and they can do the same for you. Be sure to be polite when you catch the other not working."
    },
    {
      "title": "Set a timer to keep you on track.",
      "content": "Set a timer to keep you on track. Try setting a timer for 10 minutes and telling yourself that for that time, you have to work as hard as you can on a project. Regardless of how large the project is, you must work on it nonstop and give it your best for 10 minutes. [13] X Research source This is an effective jumpstart strategy that fights procrastination because the short time allotment is manageable and you can immediately see the results of your burst of hard work."
    },
    {
      "title": "Step outside for some light exercise.",
      "content": "Step outside for some light exercise. It can be depressing to be indoors all day worrying about all the work you need to do. Even though it might seem counterproductive, step outside and take a short 5 to 10 minute walk in the fresh air. This can help you refocus and combat procrastination. Once you come back inside, however, ensure that you go back to work. [14] X Research source"
    },
    {
      "title": "Don’t be hard on yourself if you procrastinate.",
      "content": "Don’t be hard on yourself if you procrastinate. Be kind to yourself when you’re struggling with procrastination. Think about how you would treat someone else who was struggling with getting their work done. You would probably be kind and try to gently talk with them about how to go about completing their tasks. Do the same for yourself. Don’t beat yourself up about procrastinating. Simply accept that you’ve put off your work up to this point and make a fresh start. [15] X Research source"
    },
    {
      "title": "Don’t drag out work till it’s perfect.",
      "content": "Don’t drag out work till it’s perfect. Our obsession with perfection can cause us to procrastinate in a roundabout way. Sometimes we’ll sit down and work hard on a project only to keep revising or fixing it until it’s past its deadline. Embrace that you only need to do your best and then submit your work. Don’t procrastinate submitting your work because you think it might not be perfect. It probably isn’t perfect, but it can be great and ready to turn in without being perfect. [16] X Research source"
    },
    {
      "title": "Be introspective.",
      "content": "Be introspective. Try to identify the importance of the task at hand and determine what the consequences will be if you don’t complete it. Will you receive a negative review at work for failing to complete a report or a bad grade for not writing your research paper? Objectively consider what will realistically happen if you keep procrastinating. Sometimes this bit of reflection can help you get going on a project. [17] X Research source It’s important to remember when doing this to be objective about the possible outcomes. If the outcome isn’t especially negative, then this project or task might be one that you can delay in favor of more pressing work."
    },
    {
      "title": "Consider that there might be a medical reason for your procrastination.",
      "content": "Consider that there might be a medical reason for your procrastination. Finally, if your procrastinating is particularly bad and accompanied by other symptoms like sadness or hyperactivity, you might benefit from talking to your doctor. ADHD, depression, and thyroid disorders are just a few of the many medical issues that can affect your ability to concentrate, focus, and be productive. [18] X Research source"
    }
  ]
}