{
  "url": "https://www.wikihow.com/Get-Airline-Compensation-for-Lost-or-Damaged-Baggage",
  "title": "How to Get Airline Compensation for Lost or Damaged Baggage",
  "steps": [
    {
      "title": "Report loss or damage immediately.",
      "content": "Report loss or damage immediately. Because most airlines have strict deadlines for claims, you should let the airline know the moment you realize your bags are not where they're supposed to be. [2] X Research source [3] X Research source [4] X Research source For example, British Airways gives you 21 days to file a claim from the date of your flight to claim damages for baggage reported missing for more than three days, or expenses incurred as a result of missing baggage. However, you only have seven days from the date you receive your bag to file a claim for missing items, or for damage to the bag or its contents. The time is longer for international flights, but for domestic flights you may have only 24 hours to report the loss or damage of your bag or your claim will be denied. [5] X Research source"
    },
    {
      "title": "Get a file reference number and claim form.",
      "content": "Get a file reference number and claim form. If you notify the airline that your bags are missing while you are at the airport, you should receive a reference number you can use to check the status of your claim. [6] X Research source [7] X Research source Make sure you provide the airline with a phone number where you can be reached, as well as the address where you will be staying. Don't put your home address or phone number if you're not at home. Typically you also will have the ability to check the status of your bag claim by checking online after you provide the airline with notification that it is missing. The airline representative who takes your report will give you more information."
    },
    {
      "title": "Provide details about your bag.",
      "content": "Provide details about your bag. You typically must provide a description of your bag, including its approximate size, color, and composition. [8] X Research source Keep in mind that the details you provide also are intended to assist baggage handlers and other airline personnel in locating your bag. Be sure to include any particular details that set your bag apart from everyone else's and might make it easier to recognize."
    },
    {
      "title": "List essential items you had to purchase.",
      "content": "List essential items you had to purchase. If you had to purchase any items to replace those you'd packed in your lost baggage, the airline may reimburse you for those purchases. [9] X Research source Some airlines provide a daily stipend to cover reasonable expenses you incur as a result of being without your bag. For example, Delta will give you a stipend of up to $50 a day for the first five days your bag is missing. Additional expenses may be covered depending on your situation. [10] X Research source Airlines and travel guides typically recommend that you include toiletries and a change of clothes in your carry-on so you're prepared in the event your flight is delayed or your baggage is lost. #Calculate the value of your claim. The total value of your claim includes the value of the contents of your bag as well as the luggage itself. [11] X Research source [12] X Research source Keep in mind that you will have to provide proof that your bag and its contents are actually worth the amount you've entered. Without receipts, this can be exceedingly difficult – and you are unlikely to have receipts for items such as personal clothing you purchased months or even years before your trip. Typically your bag will be found after a few days. For this reason, many airlines such as Delta and American Airlines don't accept the claim form until your bag has been missing for five days. [13] X Research source"
    },
    {
      "title": "Inventory the items you pack.",
      "content": "Inventory the items you pack. Creating a list of the items in your bag can assist you in calculating the value of your bag in the event the airline loses it. You also should consider taking an inventory of the items in the bags you plan to carry on with you, in case something is stolen. It can be difficult to remember exactly everything you had in your bag when you no longer have it. Keep in mind the relative value of the items you pack, and avoid taking something expensive when you have something less valuable that would fulfill the same need."
    },
    {
      "title": "Take photos of your packed bags.",
      "content": "Take photos of your packed bags. Photos can be used to back up your inventory and support your calculation of the value of your belongings. Snapping a photo often is easier than making an itemized list of everything in your suitcase – just be careful if you've got some items covered by others or zipped away in pockets. Keep in mind that proving the value of your possessions can be very difficult without receipts. However, photos of the items in good condition can help prove a reasonable value."
    },
    {
      "title": "Keep receipts for any items you purchase on your trip.",
      "content": "Keep receipts for any items you purchase on your trip. Receipts are the easiest way to prove the value of something. [14] X Research source If you've purchased something that has sentimental value as a souvenir of your adventure, consider carrying it on the plane with you if at all possible rather than including it in your checked bag. Particularly if you're going on a long trip, consider packing a soft-sided carry-on in your checked suitcase. The bag will lay flat and take up little room, but can be opened and used to pack the souvenirs and mementos you acquire over the course of your trip."
    },
    {
      "title": "Understand the airline's liability limits.",
      "content": "Understand the airline's liability limits. The airline will only pay up to a maximum dollar amount for your lost or damaged baggage, regardless of the total value of your claim. For domestic flights, airlines are required to compensate you for the value of your bag and its contents, up to $3,300. [15] X Research source If you're traveling internationally, your baggage is probably covered by the Montreal Convention, which requires airlines to compensate you up to around $1,750 for lost or damaged baggage. that total amount may vary depending on the exchange rate at the time of your travel. Other countries may have their own regulations that provide you with more or less compensation, depending on where you were flying and where the flight originated. In addition to the maximum dollar amounts, airlines may exempt certain items such as cameras or computer equipment in checked bags that can easily be damaged. [16] X Research source"
    },
    {
      "title": "Check your homeowner's or renter's insurance policy.",
      "content": "Check your homeowner's or renter's insurance policy. The insurance you already have may provide additional coverage for the property you take with you when you travel. [17] X Research source Your homeowner's or renter's insurance covers your property if it is lost or stolen, and may include luggage while you are on a trip. You should call your insurance carrier to make sure before you rely on this coverage. In some cases, your insurance company will pay you and then seek reimbursement from the airline. This generally is to your advantage, since you probably will get money to replace the lost items more quickly. Keep in mind that your homeowner's or renter's insurance policy likely only covers loss or damage of your property against \"named perils\" such as fire, vandalism, or theft. Read your policy carefully to determine exactly what is covered."
    },
    {
      "title": "Purchase travel insurance.",
      "content": "Purchase travel insurance. Travel insurance policies likely compensate you for lost or damaged baggage beyond the airline's maximum limits. [18] X Research source [19] X Research source If you travel often, you might consider getting a separate baggage policy that will cover all of your checked bags for a year. Some travel-oriented credit cards offer travel insurance as one of their perks. Check your credit card agreement to see if you have it and what the restrictions are. Keep in mind you typically must purchase your plane tickets on that card to use the coverage on your trip. Read your policy carefully and make sure you understand what it covers before you begin your trip. Report to your travel insurance carrier if the dates or cost of your trip changes to avoid having your claim denied. [20] X Research source"
    },
    {
      "title": "Don't check items that are fragile, expensive, or important.",
      "content": "Don't check items that are fragile, expensive, or important. If you're traveling with something you can't live without or can't afford to replace, carry it on or arrange to ship it separately. Keep in mind that valuable items such as computers, cameras, and jewelry typically don't fall under an airline's liability for loss or damage. [21] X Research source Keep airline liability limits in mind as you pack your bags. If you start to go over the threshold, consider moving some items to a carry-on, checking two bags, or leaving some of the more expensive items at home. [22] X Research source If you have little choice but to check a high-priced item, ask your airline if it provides additional baggage insurance. Some carriers allow you to purchase coverage for property that exceeds an airline's limits. For example, you can buy insurance from United for $1 per $100 insured, up to $5,000 in value. [23] X Research source [24] X Research source"
    }
  ]
}