{
  "url": "https://www.wikihow.com/Craft-a-Wooden-Axe-in-Minecraft",
  "title": "How to Craft a Wooden Axe in Minecraft",
  "steps": [
    {
      "title": "Find some oak trees.",
      "content": "Find some oak trees. You can find oak trees by looking for a forest. Lots of oak trees tend to grow and prosper there. If you are in a forest and you find a tree, you will know if it is an oak tree by looking at the tree's trunk. If the tree's trunk is light brown, then you found an oak tree!"
    },
    {
      "title": "Punch and collect the oak wood.",
      "content": "Punch and collect the oak wood. Once you find an oak tree, you need to collect the wood. To collect the wood, you will need to punch and break the wood. If you're playing on a computer, point your cursor at the wood you want to knock out, then hold down the left-click button on your mouse. If you're playing on an Xbox, point your cursor at the wood you want to knock out, and hold down the right trigger button. You should punch at least 30 to 40 blocks of wood. You'll need 15-20 trees to have enough material to craft an axe. Once you're finished punching the wood, it should fall to the ground. Collect it by walking over to it. It should go right into your inventory."
    },
    {
      "title": "Open your crafting space.",
      "content": "Open your crafting space. On your computer, press E to open your inventory. On the Xbox, press the X button. On the top right, you should see a grid with four squares that has the word \"crafting\" on top. This is your crafting area, where you will craft a crafting table. Without a crafting table, you will not have enough crafting space to craft your wooden axe."
    },
    {
      "title": "Place your wood in the crafting area.",
      "content": "Place your wood in the crafting area. Below your crafting area, you should see a variety of boxes, which holds all the items you collected while in Minecraft, including your oak wood. This is your inventory. Drag your wood blocks from your inventory to your crafting area, then place them down in the crafting boxes. On your computer, you can do this by hovering your wood over the box you want to put your wood in, then left click. On the Xbox, press the A button to place it down. You now have wooden planks"
    },
    {
      "title": "Make your crafting table.",
      "content": "Make your crafting table. Take your wooden planks and put one down in each of your crafting boxes. You now have your crafting table. Take your crafting table out of your crafting area, and put it in the inventory below."
    },
    {
      "title": "Put your crafting table in your slot bar.",
      "content": "Put your crafting table in your slot bar. Take your crafting table you just crafted and put it in your slot bar (the line of boxes down below your inventory), and close your inventory. You can do this by pressing E on the computer. On the Xbox, press the B button."
    },
    {
      "title": "Set down your crafting table.",
      "content": "Set down your crafting table. Take your cursor and hover it over your crafting table in your slot bar. It should show up in your Minecraft character's hand. Then, find a place to set your crafting table down. You can set your crafting table down by right-clicking the mouse on your computer. On the Xbox, press the left trigger."
    },
    {
      "title": "Craft your sticks.",
      "content": "Craft your sticks. Open up your crafting table. To do this, point your cursor at the crafting table. On your computer, right-click your mouse. On the Xbox, push the left trigger. Once you opened up your crafting table, you will notice that there are now six boxes instead of four. Put one of your wooden planks on the lower layer of boxes. Put another in the box on top of the other one. You now have a lot of sticks."
    },
    {
      "title": "Make your wooden axe!",
      "content": "Make your wooden axe! Put one stick in the center square at the button layer. Next, put another stick on the box on top of that one, then, put one wooden plank on the left top side of your crafting surface. Put another wooden plank at the box underneath. Put one more wooden plank at the box next to the one at the top left. You now have a wooden axe, which will come in handy when it comes to chopping up wood faster, which will help you in building a shelter for the night."
    }
  ]
}