{
  "url": "https://www.wikihow.com/Earn-a-Girl%27s-Trust-Back-After-Lying",
  "title": "How to Earn a Girl's Trust Back After Lying",
  "steps": [
    {
      "title": "Apologize.",
      "content": "Apologize. If you want to earn a girl's trust back, the very first thing you should do is to apologize sincerely about lying and hurting her. Whether you cheated on her, lied about spending a weekend with your friends in Vegas instead of at your grandmother's, or lied about a significant personal detail, it's inevitable that she's feeling hurt, confused, and like she doesn't know you anymore. Let her know that you understand how difficult you have made things for her, and that you deeply regret what you've done. Take FULL responsibility, show her you know you were wrong. [1] X Research source She's not going to go for a half-hearted apology. It needs to be sincere and real. Don't just say \"I'm sorry\" because you think it's the right thing to do -- say it because you mean it. If you're not sincere, she'll be able to tell. When you tell her you're sorry, look into her eyes, speak slowly, and face your body toward her so she knows she has all of your attention. You don't have to say that you're sorry a hundred times -- it's about quality, not quantity. Let her know that you understand all of the pain and suffering that you've caused her. If she doesn't think you understand her pain, she won't want to listen to you. Though you shouldn't make this all about you, let her know that you're feeling real pain because of your mistake."
    },
    {
      "title": "Be honest about why you lied.",
      "content": "Be honest about why you lied. You don't have to go in too much graphic detail if you think it'll only hurt her more, but you should be honest about why you told the lie. Maybe you wanted to protect her, maybe you knew that the truth would hurt her, or maybe you were even embarrassed about the truth and wanted to cover it up. Whatever your reason, let her know why you did it -- this will show that you're already maturing and trying to reflect, and that you're not just going to move on without gaining some perspective. [2] X Research source Being honest about why you lied will make her feel like you're more likely to be honest in the future. Letting her know your motives will help her understand your perspective. Know when it's better not to be honest. If you just wanted to get with another girl because you were feeling bored or restless, then it's better to keep that to yourself. Reader Poll: We asked 148 wikiHow readers who've dealt with dishonesty in a relationship, and 55% of them agreed that the most crucial step in rebuilding trust is open and honest communication . [Take Poll]"
    },
    {
      "title": "Promise it will never happen again -- and mean it.",
      "content": "Promise it will never happen again -- and mean it. First, you have to make sure that it really won't happen again. If you doubt yourself or your future self and think you may make the same mistake, then spare the girl and work on fixing yourself before you get entangled with anyone else. If you don't think that you should be trusted, then why should anyone else disagree? Once you're certain that it won't happen again, then you should promise her that you're determined not to repeat your mistakes. [3] X Research source Be sincere when you tell her this. Don't make an empty promise. Let her know that you understand that actions speak louder than words, but make it clear that from now on, your actions will match your promises."
    },
    {
      "title": "Promise you'll change.",
      "content": "Promise you'll change. Tell her that you're going to work on becoming a better, more complete person who wouldn't lie to her. Be open about the fact that you know that this is a process and that you won't change overnight, but let her know that you're willing to try to change for her. If you have a concrete plan for how you'll change, whether it's by keeping a journal, going to therapy, or just trying to be a more honest, more reflective person, then let her know what you'll do so you'll sound more sincere. Again, make it clear that you know this won't happen overnight, but that you want to put in the work because earning her trust back is the most important thing to you."
    },
    {
      "title": "Give her space.",
      "content": "Give her space. Once you've told her everything you want to say, it's time to give her some space. The worst thing you can do to earn a girl's trust back is to call her or show up at her place constantly until she feels completely suffocated by you. Instead, let her know that you'll be stepping back and waiting for her to reach out when she's ready. This doesn't mean that you should completely cease communication, but it does mean that you should back off for a while until she's ready to talk to you. You can check in with a text or a phone call every few days, but only if she does sound like she wants to talk to you -- however reluctantly. If you want to be sweet, you can send her flowers, but don't overdo it. If she's really angry, then she won't be ready for your gifts. You can do something small, like write her a letter, to let her know that she's on your mind without overwhelming her. If you do run in to her, be kind and friendly, but don't talk to her for too long or make her feel like she's getting ambushed."
    },
    {
      "title": "Give it time.",
      "content": "Give it time. Giving it time is just as important as giving the girl space. You have to be patient and wait for her to come around instead of forcing it and pretending like everything is exactly like it was before. To do this, you'll have to be patient, even if you are hanging out a lot, and know that the girl won't rush back into your arms after you've lied. Don't ask her if she forgives you every two seconds, and don't try to book elaborate vacations or to go on romantic dates; instead, take it slow, and wait for her to make the move. Even if you are hanging out again, don't expect things to be the same. Be more cautious about touching, complementing, or generally spending time with her. Don't get frustrated. It's natural that you wish that everything was completely forgotten instantly, but that's not the way the world works. Act natural. You don't have to bring up your lie all the time. Just be more cautious without being too obvious about it, and wait for her to trust you again."
    },
    {
      "title": "Be dependable.",
      "content": "Be dependable. If you want your girl to trust you again, then you have to be absolutely dependable, even if you weren't in the past. [4] X Expert Source Moshe Ratson, MFT, PCC Professional Therapist Expert Interview. 7 August 2019. This means that you have to be there for her if she needs help, to follow through on your plans, and to show up to your dates on time -- or even a little early. If you're not dependable after lying to her, she'll be even less inclined to trust you. Go out of your way to be helpful and supportive. Let her see that you'll be there for her. Even if you didn't go watch her basketball games before, show up to watch a few games after school to show that you care. Let her open up and talk to you about her problems. This will show that she's starting to trust you again. You should be dependable, but that doesn't mean you should become her lap dog or servant -- maintain your own identity while being as helpful as possible. You don't want her to think that you're downright groveling, or that won't be very attractive."
    },
    {
      "title": "Be accessible.",
      "content": "Be accessible. If you want to earn your girl's trust back, then you have to be easily accessible. Though you don't need to give her a copy of your schedule, she should have a sense of where you are most of the time, or she'll start to worry again. If she calls or texts you, you should try to get back to her as soon as you can. If you leave her waiting more than a few hours, or even a day, then she'll start doubting your ability to change. You can casually let her know what you'll be up to when she's not around. If you're going to a baseball game with your friends, let her know, and get her a teddy bear with your favorite team's logo on it. If you're going to your uncle's beach house, send her a picture of the ocean and say you wish she was there. Don't be mysterious. If you're hanging out but you have to get going, tell her why. This doesn't mean that she has to keep tabs on you or stick a GPS locator to your car -- it does mean that she has a general sense of what you're doing so she can trust you. Even if you're away for a few days, don't forget to check in. Try to call at least once a day and send her a few texts a day to let her know you're thinking of her."
    },
    {
      "title": "Continue being honest.",
      "content": "Continue being honest. As you and the girl start to spend more time together, keep up your honesty. Level with her if you're feeling upset, confused, or hurt, and let her know if you feel smothered or like you're not being yourself. [5] X Expert Source Moshe Ratson, MFT, PCC Professional Therapist Expert Interview. 7 August 2019. She'll want to know how you're feeling so that she has an insight into what's really going on in your mind. If you're not honest with her again, and she finds out, then it's over. Just stay patient and continue to let her know what's on your mind. This will slowly make her trust you again. You don't have to tell her everything that you're thinking, but you should make a conscious effort to be open with her."
    },
    {
      "title": "Make her feel special.",
      "content": "Make her feel special. You may have started to earn the girl's trust back, but how do you keep it? You have to make her feel special so that she knows that she means a lot to you, and that you won't go and lie whenever you feel like it. To make her feel special, you should act like a gentleman, take her out on romantic dates, compliment her looks and personality, and show an interest in her hobbies, thoughts, and goals. [6] X Research source If she looks beautiful, don't be afraid to tell her. Send her flowers or a love poem, if it feels natural for you. Ask her opinion on anything that matters to you, whether it's your new haircut or current events. Take an interest in her life. Ask her about her family, her latest chem exam, or even show an interest in her childhood."
    },
    {
      "title": "Open up to her.",
      "content": "Open up to her. If you want to keep the girl's trust, then you have to learn to really open up to her. Tell her things about yourself that you haven't told many people -- or that you haven't told anyone, even -- and make her see that you really trust and care about her. If you tell her personal or private information, then she'll see that you really value her judgment and reaction, and that you want to be really honest with her. You don't have to tell her anything that makes you uncomfortable. Just make her see that you trust her with your personal moments, and hopefully she'll reciprocate. If you take the time to let her really know you, she'll appreciate it and will see how sincere you are."
    },
    {
      "title": "Be true to yourself.",
      "content": "Be true to yourself. If you really want to keep the girl's trust, then you have to be true to who you really are. Though it's likely that you've had to make some major changes in your life to ensure that you won't lie again, you shouldn't change who you are completely just to earn the girl's trust. If you feel like you're groveling, sucking up, or just spending all of your energy on winning her over, then you're not really being who you are, and neither she nor you will be happy with that. Ask yourself if you feel comfortable in your own skin, and if you feel like the girl is trusting the real you -- not some new guy you've created just to win her over."
    },
    {
      "title": "Know when it's too late.",
      "content": "Know when it's too late. Unfortunately, you may not ever be able to win a girl's trust back after lying. If it's been weeks, or even months, and you still feel unsteady, like she doesn't fully trust you, like she always has to check in on you, and that you're constantly apologizing for what happened in the past, then it may be too late to make it work. You're better off ending the relationship before both of you get even more hurt, and cause more pain by trying to fix something that's too broken to be repaired. If you feel like you've been patient and have given the relationship your all and that your girl still won't trust you, then it may be best to part ways. If it's really not working, then you're better off starting over with someone new -- as long as you've learned from your mistakes. Once you recognize that it's really too late, you should move on as soon as you can. This is better than prolonging the pain -- for both of you."
    }
  ]
}