{
  "url": "https://www.wikihow.com/Delete-Duplicates-on-Google-Photos",
  "title": "How to Delete Duplicate Photos from your Google Storage",
  "steps": [
    {
      "title": "Open the Files by Google app.",
      "content": "Open the Files by Google app. This app is available on all Android devices as Files . Tap to open the app."
    },
    {
      "title": "Tap Clean at the bottom of the screen.",
      "content": "Tap Clean at the bottom of the screen. It is the leftmost option, represented by two small star icons. The app likely opens to this tab by default."
    },
    {
      "title": "Find the \"Duplicate files\" tile and tap Select files.",
      "content": "Find the \"Duplicate files\" tile and tap Select files . The Files app will show you a variety of options for cleaning up your device's storage. Find the one for Duplicate files and tap the Select files button in the bottom-right corner of the box. If you do not see a tile related to duplicate files, the Files by Google app does not detect any duplicate photos/files at this time."
    },
    {
      "title": "Select the files you want to delete.",
      "content": "Select the files you want to delete. The Files by Google app will mark all original files as Original . While you are free to delete either copy, we recommend keeping the original whenever possible."
    },
    {
      "title": "Tap Move x file(s) to Trash.",
      "content": "Tap Move x file(s) to Trash . The number of files listed will change as you select additional duplicates for deletion. Google will not ask you to confirm your decision, so make sure you definitely want to delete these duplicates. Deleted photos/files will remain in your Trash for 30 days, at which point they are permanently deleted. Feel free to recover the duplicate photo at any time."
    },
    {
      "title": "Go to http://photos.google.com in a web browser.",
      "content": "Go to http://photos.google.com in a web browser. If you're not signed in, sign in now. Google Photos will not sync identical photos, even from multiple devices. But if you've edited a synced photo (such as cropping, adding a location, or changing the date), the edited version will sync because it's no longer identical. [1] X Research source You can prevent this in the future by saving edited photos to a folder that you don't sync to Google Photos."
    },
    {
      "title": "Click the Photos tab.",
      "content": "Click the Photos tab. It's on the left side of the page. Doing so opens a list of all of your photos."
    },
    {
      "title": "Scroll down until you find a duplicate photo that you want to delete.",
      "content": "Scroll down until you find a duplicate photo that you want to delete."
    },
    {
      "title": "Check the photo's box.",
      "content": "Check the photo's box. Hover your mouse over the photo's thumbnail, then click the checkmark in its upper-left corner. Be careful not to select both photos in a pair of duplicates."
    },
    {
      "title": "Click the \"Trash\" icon.",
      "content": "Click the \"Trash\" icon. It's at the top right corner of the page. A confirmation message will appear."
    },
    {
      "title": "Click MOVE TO TRASH on the confirmation message.",
      "content": "Click MOVE TO TRASH on the confirmation message. This moves the photos to the trash. Photos in the trash will remain there for 60 days in case you realize you've made a mistake. You can find and click the \"Trash\" section by scrolling to the bottom of the left-hand column."
    },
    {
      "title": "Open the Google Photos app.",
      "content": "Open the Google Photos app. It's the green, yellow, red, and blue flower icon, which you'll usually find on the home screen or in the app drawer. Google Photos will not sync identical photos, even from multiple devices. But if you've edited a synced photo (such as cropping, adding a location, or changing the date), the edited version will sync because it's no longer identical. [2] X Research source You can prevent this in the future by saving edited photos to a folder that you don't sync to Google Photos."
    },
    {
      "title": "Tap Photos.",
      "content": "Tap Photos . It's at the bottom-left corner."
    },
    {
      "title": "Press and hold on a photo you want to delete.",
      "content": "Press and hold on a photo you want to delete. A checkmark will appear in the top-left corner of the photo, and a menu will expand at the bottom of your screen."
    },
    {
      "title": "Tap on additional photos you want to delete.",
      "content": "Tap on additional photos you want to delete. Scroll through your photos and tap on any other duplicates you want to delete. Be careful not to delete both photos in a pair of duplicates."
    },
    {
      "title": "Tap the Trash icon.",
      "content": "Tap the Trash icon. It's near the top-right corner of the screen. A confirmation will appear. [3] X Research source"
    },
    {
      "title": "Tap REMOVE on the confirmation message.",
      "content": "Tap REMOVE on the confirmation message. This moves the photos to the trash. Photos in the trash will remain there for 60 days in case you realize you've made a mistake."
    },
    {
      "title": "Open Google Photos on your computer, phone, or tablet.",
      "content": "Open Google Photos on your computer, phone, or tablet. If photos stored on your Google Drive are set to sync to Google Photos, you'll see duplicates of photos that were already in your library. Disabling this feature prevents the Google Drive photos from appearing in Google Photos. You can access Google Photos on your computer by signing in to https://photos.google.com . If you're using a phone or tablet, tap the multicolored flower icon labeled \"Google Photos\" (iPhone/iPad) or \"Photos\" (Android) on the home screen or app drawer."
    },
    {
      "title": "Click or tap your profile icon.",
      "content": "Click or tap your profile icon. It's in the top-right corner. A menu will expand."
    },
    {
      "title": "Select Photo settings.",
      "content": "Select Photo settings . It is towards the bottom of the menu."
    },
    {
      "title": "Slide the \"Backup\" switch to the Off position.",
      "content": "Slide the \"Backup\" switch to the Off position. This will stop your device from syncing any photos or videos to your Google account, so make sure you certainly are comfortable without backing up your material. You will avoid duplicates in the future, but you may lose photos and videos when switching devices. This will not delete existing duplicates from your Google Drive."
    }
  ]
}