{
  "url": "https://www.wikihow.com/Deodorize-Clothing",
  "title": "10 Ways to Deodorize Clothing",
  "steps": [
    {
      "title": "White vinegar",
      "content": "White vinegar clears away bad smells like mildew, sweat, and body odor. Are your workout clothes smelling a little ripe? Vinegar is here to help. Does your favorite shirt have a musty odor you just can’t get rid of? Vinegar can assist with that, too. Here are a few ways to tackle different stains with this versatile deodorizer: Sweat: Turn your clothes inside-out and toss them back in the washer, adding 50% less detergent and 1 ⁄ 2 to 1 c (120 to 240 mL) of white vinegar. Then, set the washer to a rinse cycle. [1] X Expert Source Ayad Mirjan Dry Cleaner & Laundry Specialist Expert Interview. 7 September 2022. [2] X Research source Mildew: Clear away the bad smell by pouring 1 c (240 mL) of white vinegar into your musty laundry load. Once the wash cycle is finished, air your clothes out in the sun. Stinky feet: Add 1 ⁄ 2 c (120 mL) of white vinegar to your wash load to help deodorize your stinky socks. [3] X Research source [4] X Expert Source Ayad Mirjan Dry Cleaner & Laundry Specialist Expert Interview. 7 September 2022. Vaginal odor: Spritz the crotch of your pants with vinegar a few times before throwing them in the washer with your other clothes. [5] X Research source General deodorizing: Add 1 ⁄ 4 c (59 mL) of distilled white vinegar to your wash load around the final rinse cycle to help clear away any bad smells. [6] X Research source"
    },
    {
      "title": "Baking soda",
      "content": "Baking soda is an all-purpose deodorizer that can eliminate plenty of bad smells. Sprinkle ½ cup (115.2 g) into your washer during the rinse cycle of your next laundry—this will clear away all kinds of general odors. [7] X Expert Source Ayad Mirjan Dry Cleaner & Laundry Specialist Expert Interview. 7 September 2022. [8] X Research source Here are other odors baking soda can help with: Sweat: Use just a little bit of detergent along with ¼ to ½ cup (57.6 - 115.2 g) of baking soda. [9] X Research source Perfume: Soak the clothing in a mixture of warm water and 1 cup (130.4 g) of baking soda. Then, toss your garment in the washer and launder it as usual. [10] X Research source Gasoline: Work baking soda paste into the smelly parts of the garment. Hang up the clothing to dry, and then scrape off any of the dried paste. [11] X Research source"
    },
    {
      "title": "Sports detergent",
      "content": "Sports detergent eliminates the “stink” from your stinky socks. Toss your socks in the washer with a little bit of sports detergent. After a basic rinse cycle, your socks will smell fresh and odor-free. [12] X Research source About 1 US tbsp (15 mL) of detergent will get the job done. If you’re washing a lot of clothes at once, use 2 US tbsp (30 mL) instead. [13] X Research source"
    },
    {
      "title": "Clear away perfumey odors with Castile soap.",
      "content": "Clear away perfumey odors with Castile soap . Soak the smelly clothing item for 1 hour in a mixture of warm water and a few drops of Castile soap. Then, air-dry the garment completely. [14] X Research source"
    },
    {
      "title": "Pure vodka",
      "content": "Pure vodka can be a great general deodorizer. All you have to do is spritz a little bit on your smelly garment and let it completely evaporate. Just like that, the odor will be gone! [15] X Research source Be sure to store your vodka in a glass spray bottle . The vodka may break down a plastic bottle."
    },
    {
      "title": "Clear away stinky shoe odors with wads of newspaper.",
      "content": "Clear away stinky shoe odors with wads of newspaper. Crumple up any old newspaper and stuff it into your stinkiest pair of shoes. Then, let the newspaper sit overnight so it can work its magic. When morning rolls around, the stinky scent in your shoes will be completely gone. [16] X Research source For an extra fragrant touch, drip a few drops of vanilla extract into the newspaper before stuffing them into your shoes. Disinfectant spray can also help your shoes smell fresh! Pull out the shoe’s insole, spritz it with spray, and air it out for a day. Just slip the deodorized insole back into your shoe, and you’re good to go! [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "A fresh blast of steam clears away any fried-food odors from your clothes.",
      "content": "A fresh blast of steam clears away any fried-food odors from your clothes. The next time you’re about to take a hot shower, hang up the smelly clothes in your bathroom. The steam from your hot shower will help air out your clothes and leave them smelling fresh. [18] X Research source Turn on your stovetop exhaust whenever you cook fried food—this can help prevent your clothes from smelling oily."
    },
    {
      "title": "Fresh air helps clear away strong odors from your clothes.",
      "content": "Fresh air helps clear away strong odors from your clothes. When the weather is breezy and sunny, hang your garments outside for a few hours—the fresh air may help clear away the fragrant scent . [19] X Research source If outdoor air-drying isn’t an option for you, try air-drying your garments in an open, well-ventilated space instead."
    },
    {
      "title": "A bleach and hot water combo works wonders on vomit-covered clothes.",
      "content": "A bleach and hot water combo works wonders on vomit-covered clothes. Clear away any leftover throw-up from the clothing and stick it in the washer with your regular detergent and a 1 ⁄ 2 c (120 mL) of bleach to get rid of the vomit smell . If possible, run the soiled, smelly clothes through both a pre-wash and regular wash cycle with the water set to high heat. Then, tumble-dry the sanitized and deodorized clothes on high heat. [20] X Research source Be careful using bleach with any colored garments, and always read the clothing care label before adding it to your wash load."
    },
    {
      "title": "A commercial stain remover helps clear away gasoline odors.",
      "content": "A commercial stain remover helps clear away gasoline odors . Pour a little bit of baking soda over any fresh gasoline stains to blot them up. Then, apply a commercial stain remover directly to the gasoline with a bristled scrub brush . Wait 15-20 minutes so the stain remover can work its magic, and then let the garment soak in hot water for 30 minutes. Air-dry the garment instead of tumble-drying it to prevent any fire hazards. [21] X Research source"
    }
  ]
}