{
  "url": "https://www.wikihow.com/Dua-for-Success",
  "title": "Powerful Du’as for Success in Studying, Work, Life & More",
  "steps": [
    {
      "title": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الآخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ",
      "content": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الآخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ Rabbana atina fiddunia hasanatan wa fil aakhirati hasanatan wa qina ‘azabannar. [1] X Research source Translation: “Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.” Benefits: Ask Allah for success in this world and the next. You can recite this du’a with a specific purpose or ask Allah for success in “all that which is good.” Comes from: Qur’an, Surah Al-Baquarah 2:201"
    },
    {
      "title": "وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
      "content": "وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ Wama tawfeeqee illa billahi alayhi tawakkaltu wa-ilayhi oneeb. [2] X Research source Translation: “My success is not but through Allah. Upon Him I have relief, and to Him I return.” Benefits: Strengthen your relationship to Allah by placing trust and faith in Him to lead you to success. Comes from: Qur’an, Surah Al-Hud 11:88"
    },
    {
      "title": "ربِّ زِدْنِي عِلْماً",
      "content": "ربِّ زِدْنِي عِلْماً Rabbi zidni ilma. [3] X Research source Translation: “My Lord, increase me in knowledge.” Benefits: Directly call to Allah to give you the knowledge you need (if you seek success through knowledge). Comes from: Qur’an, Surah At-Taha 20:114"
    },
    {
      "title": "رَبَّنَا أَفْرِغْ عَلَيْناَ صَبْراً وَتَوَفَّنَا مُسْلِمِينَ",
      "content": "رَبَّنَا أَفْرِغْ عَلَيْناَ صَبْراً وَتَوَفَّنَا مُسْلِمِينَ Rabbana afrigh 'alaina sabran wa tawaffana Muslimin. [4] X Research source Translation: “Our Lord! Pour out on us patience, and allow us to die as Muslims.” Benefits: Ask Allah for patience, perseverance, consistency, and a good ending in life. Comes from: Qur’an, Surah Al-A’raf 7:126"
    },
    {
      "title": "‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَق، وَالأَعْمَال، وَالأَهْوَاء‏",
      "content": "‏اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَق، وَالأَعْمَال، وَالأَهْوَاء‏ Allahumma inni a’uzu-bika min munkaratil-akhlaq, wal-a’mal, wal-ahwa’. [5] X Research source Translation: “O Allah! I seek refuge in You from undesirable manners, deeds, and aspirations.” Benefits: Ask Allah to help you maintain good character on your path to success, as the Qur’an emphasizes the importance of good character and says: قَدْ أَفْلَحَ مَنْ زَكَّاهَا وَ قَدْ خَابَ مَنْ دَسَّٮهَا (“Success is indeed the one who purifies their soul, and the one who corrupts it fails.”) -Surah Ash-Shams, 91:9-10 Comes from: Sunan At-Tirmizi"
    },
    {
      "title": "رَبِّي هَبْ لِي حُكْماً و أَلحِقْني بِالصَّالِحِينَ، وَاجْعَل لِِّي لِسَانَ صِدْقٍ فِي الآخِرِينَ، وَ اجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيم",
      "content": "رَبِّي هَبْ لِي حُكْماً و أَلحِقْني بِالصَّالِحِينَ، وَاجْعَل لِِّي لِسَانَ صِدْقٍ فِي الآخِرِينَ، وَ اجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيم Rabbi habli hukman wa al-hiqni bis salihin, waj-’al li lisana sidqin fil-aakhirin, waj-’alni min waratha-ti jannatin-naa’im. [6] X Research source Translation: “My Lord! bestow wisdom on me and make me among the righteous. Bless me with honorable mention among later generations and make me one of the inheritors of the Garden of Bliss. Benefits: Recite this du’a to ask Allah for the gift of wisdom. The du’a was made by the Prophet Ibrahim to show that wisdom and knowledge are gifts from Allah, and through knowledge, you can find success both within and out in the world. Comes from: Qur’an, Surah Ash-Shu’ara 26:83-85"
    },
    {
      "title": "رَبَّنَا هَبْ لَنَا مِنْ أَزْواجِنَا وَذُرِّيَّاتِنَا قُرَّةً أَعْيُنِنَا وَجَعَلْنَا للْمُتَّقِينَ إمَامَا",
      "content": "رَبَّنَا هَبْ لَنَا مِنْ أَزْواجِنَا وَذُرِّيَّاتِنَا قُرَّةً أَعْيُنِنَا وَجَعَلْنَا للْمُتَّقِينَ إمَامَا Rabbana hablana min azwajina wa zurriyatina qurrota ‘ayunina waj'alna lil muttaqina imama. [7] X Research source Translation: “Our Lord! Bless us with spouses and offspring who will be the joy of our hearts, and make us models for the righteous.” Benefits: Recite this du’a to ask Allah for a good family, a successful marriage, and equally successful and devoted children. Comes from: Qur’an, Surah Al Furqan 25:74"
    },
    {
      "title": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَتِنَا أُمَّةً مُّسْلِمَةَ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيْم",
      "content": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَتِنَا أُمَّةً مُّسْلِمَةَ لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيْم Rabbana waj'alna muslimaini laka wa min dzurriyyatinaa ummatan-muslimatal-laka, wa arina manasikana wa tub ‘alaina, innaka anta-tawwabu-rrahim. Translation: “Our Lord, make us devoted to You; make our descendants into a community devoted to You. Show us how to worship and accept our repentance, for You are the Ever Relenting, the Most Merciful.” Benefits : Use this du’a to offer Allah your devotion and pray for the devotion of your descendants as well. Because the Qur’an teaches that success comes from Allah, offering devotion to Allah can be another way to pray for success. Comes from: Qur'an, Surah Al-Baqarah 2:128"
    },
    {
      "title": "رَبِّي هَبْ لِي مِنَ الصَّالِحِنَ",
      "content": "رَبِّي هَبْ لِي مِنَ الصَّالِحِنَ Rabbi habli minas-solihin. Translation : “My Lord, grant me a child from among the righteous.” Benefits: Recite this du’a to ask Allah for a child’s success, as well as their good moral standing in life. Comes from: Qur'an, Surah As-Saffat 37:100"
    },
    {
      "title": "رَبّي هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَة إِنَّكَ سَمِيعُ الدُّعَاء",
      "content": "رَبّي هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَة إِنَّكَ سَمِيعُ الدُّعَاء Rabbi habli milladunka zurriyatan toyyibatan innaka sami ud-dua’. Translation: “My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.” Benefits: Recite this du’a to ask Allah for the success of your children. This du’a was originally created by the Prophet Ibrahim and Prophet Zakariyya to ask for pious children, as the Qur’an states that pious, successful children are among the greatest gifts one can receive from Allah. Comes from: Qur'an, Surah Ali-Imran 3:38"
    },
    {
      "title": "اللهُمَّ لا سَهْلَ إلا مَا جَعَلتَهُ سَهْلا وَ أنتَ تَجْعَلُ الحزْنَ إذا شِئْتَ سَهْلا",
      "content": "اللهُمَّ لا سَهْلَ إلا مَا جَعَلتَهُ سَهْلا وَ أنتَ تَجْعَلُ الحزْنَ إذا شِئْتَ سَهْلا Allahumma la sahla illa ma ja’altahu sahla, wa ‘anta taj’alul hazna idha shi’ta sahla. Translation: “O Allah, there is no ease except in what You make easy. If You wish, You can make the difficulty easy.” [8] X Research source Benefits: Recite before or during an exam to ask Allah for success and guidance. Comes from: Hadith, Sahih Ibn Hibban"
    },
    {
      "title": "اللّهُمَّ إِنِّي أَسْتَودِعُكَ مَا قَرَأتُ وَمَا حَفِظْتُ وَمَا تَعَلَّمْتُ فَرْدُدْه لِي إِلَيَّ عِنْدَ حَاجَتِي إِلَيْهِ ،[ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِير وَحَسْبُنَا اللهُ وَنِعْم الوَكِيل]",
      "content": "اللّهُمَّ إِنِّي أَسْتَودِعُكَ مَا قَرَأتُ وَمَا حَفِظْتُ وَمَا تَعَلَّمْتُ فَرْدُدْه لِي إِلَيَّ عِنْدَ حَاجَتِي إِلَيْهِ ،[ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِير وَحَسْبُنَا اللهُ وَنِعْم الوَكِيل] Allahumma inni astaudi’uka ma qara’tu wa ma hafiztu wa ma ta’allamtu, fardudhu li ilayya ‘inda haajati, innaka ‘ala kulli shai-in qadir, wa hasbunallahu wa ni’mal wakil. (Additionally, only the last two sections of wording come from the Qur’an; the first words in this du’a come from practices based on experience.) [9] X Research source Translation: “O Allah! I entrust You with what I have read and what I have memorized and I have studied. Bring it back to me when I am in need of it. Truly, you have power over all things. Sufficient for us is Allah, and [He is] the best Disposer of affairs.” Benefits: Recite before or during an exam to ask Allah for a strong and successful memory as you take the test. Comes from: Qur’an, Surah Ale-Imran 3:26"
    },
    {
      "title": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
      "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً Allahumma inni as-aluka ‘ilman naafi’an, wa rizqan tayyiban, wa ‘amalan mutaqabbalan. Translation: “O Allah, I ask You for beneficial knowledge, good provision and acceptable deeds.” [10] X Research source Benefits: Recite this du’a if you own or work for a business and want to ask Allah to guide its success. The Qur’an teaches that successful business relies on sincerity and having fair dealings with customers—and that profits are a result of running a good, honest business. Comes from: Sunan Ibn Majah"
    },
    {
      "title": "رَبِّي اِشْرَحْلِي صَدْرِي وَ يَسِّرْلِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي",
      "content": "رَبِّي اِشْرَحْلِي صَدْرِي وَ يَسِّرْلِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي Rabbi-isyrahli sadri, wa yassir li amri, wahlul ‘uqdatam-min lisaani yafqahu qawli. Translation: “My Lord! Uplift my heart for me, and ease for me my task. And remove the impediment from my tongue so that they may understand my speech.” Benefits: Recite this du’a before a job interview, speech, or presentation at work to ask for help in articulating and successfully conveying your message. Comes from: Qur'an, Surah Ta Ha 20:25-28"
    },
    {
      "title": "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ",
      "content": "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ Rabbi a’inni wa-la tu’in ‘alayya, wa-nsurni wa-la tansur ‘alayya, wa-mkur-li wa-la tamkur alayya, wa-hdini wa-yassir-il-huda ilayya, wa-nsurni ‘ala man bagha ‘alayya. [11] X Research source Translation: “My Lord, aid me and do not aid against me, and grant me victory and do not grant victory over me, plan for me and do not plan against me, guide me and facilitate guidance for me, grant me victory over those who transgress against me.” Benefits: Recite this du’a to ask Allah for guidance toward victory as you strive for success. Comes from: Sunan At-Timizi"
    },
    {
      "title": "يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحلِي شَأْنِ كُلَّهُ، وَ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن",
      "content": "يَا حَيُّ يَا قَيُّومُ، بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحلِي شَأْنِ كُلَّهُ، وَ لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْن “Ya Hayyu Ya Qayyum, birahmatika astaghitsu, aslih li sha'ni kullahu, wa la takilni ila nafsi tarfata ‘aini.” Translation: “O The Ever-Living, O The Self-Subsisting, I seek help through Your Mercy. Set right all my affairs and do not leave me to myself even for the blinking of an eye.” Benefits: Recite this du’a in times of hardship or adversity to ask for Allah’s blessing and mercy. It may be especially beneficial for pregnant individuals to recite during challenging moments in their pregnancy. Comes from: Sunan An-Nasai"
    }
  ]
}