{
  "url": "https://www.wikihow.com/Find-a-Baptismal-Record",
  "title": "How to Find a Baptismal Record",
  "steps": [
    {
      "title": "Ensure you are eligible to receive a copy of the baptismal record.",
      "content": "Ensure you are eligible to receive a copy of the baptismal record. Churches will only provide copies of baptismal records to the person baptized or their parents or guardians of that person. If you are not one of these parties, you will likely not be able to receive a copy of a baptismal record. Be sure you or your child actually was baptized. Some people simply assume that they were because they were too young to remember the event. You will need to provide proof of your identity and your relationship to the baptized person in order to receive a copy of the baptismal record."
    },
    {
      "title": "Note the specific religion that conducted the baptism.",
      "content": "Note the specific religion that conducted the baptism. While baptism is a common practice among most sects of Christianity, each branch of the larger religion has specific baptism practices. The common branches of Christianity that practice baptism are: Anabaptist Baptist Church of Christ Reformed Protestantism Roman Catholic Jehovah's Witness Latter-Day Saints"
    },
    {
      "title": "Gather all pertinent information about your or your child.",
      "content": "Gather all pertinent information about your or your child. The identification the church or higher office may require can vary significantly depending on the policies they follow. Obtain any forms of identification you may need to verify you or your child’s identify as well to justify any name changes. You will need to provide evidence of a name change such as a marriage certificate or a name change certificate from the social security office if you or your child’s name do not match the name listed on the baptismal record. If your child is adopted you will need to provide proof of the adoption in the form of adoption papers."
    },
    {
      "title": "Try a genealogy website.",
      "content": "Try a genealogy website. If you are trying to find a baptismal record for a family member that passed away some time ago, you may be able to find it on a website that specializes in genealogy and documentation. [1] X Research source Websites like Ancestry.com or Genealogy.com may contain copies of the baptismal record if they have been uploaded by other members of your extended family or someone that knew that family member personally. If the baptism took place in a country outside the United States, they may have uploaded their baptismal records to an online database."
    },
    {
      "title": "Locate the church the baptism was conducted at.",
      "content": "Locate the church the baptism was conducted at. Many churches retain records of the baptisms that were conducted within their walls. You may be able to have them provide you a copy of your or your child’s baptismal record directly. [2] X Research source Some churches may no longer retain copies of baptismal records from many years ago due to space restrictions. Some churches submit their records to a centralized record keeping location. Church officials may be able to direct you to the correct place to request a copy of your or your child’s certificate."
    },
    {
      "title": "Identify the parent parish to the church.",
      "content": "Identify the parent parish to the church. In many cases, churches submit their documents to a parent parish to be printed in large volumes called Baptism Registers. If your church was a small “branch” church, the parent parish probably retains records on their behalf. [3] X Research source Some churches retain their own records as well as submitting them to a parent parish for inclusion in the Baptismal Register. Churches do not usually maintain baptism databases so you will need to know the exact date of the baptism in order to make finding it possible."
    },
    {
      "title": "Contact the Diocese the church was located in if it has since closed.",
      "content": "Contact the Diocese the church was located in if it has since closed. You may find that the church the baptism was conducted at has since closed. In these cases, records are transferred from the church to the next highest authority for that religion in the area. [4] X Research source Use the internet to find out what Diocese or alternate authority the church fell under before it closed. Contact that authority to request a copy of the baptismal record."
    },
    {
      "title": "Gather witnesses.",
      "content": "Gather witnesses. If there is no record of the baptism being performed but you are certain that it was, some churches may provide you with a replacement document if you can successful prove that the baptism took place. [5] X Research source Many churches will accept witness testimonies in the form of legal affidavits testifying that the witnesses were physically present at the baptism. You usually need to provide affidavits from at least two witnesses in order to be considered valid."
    },
    {
      "title": "Submit a formal request.",
      "content": "Submit a formal request. Variances in how you can request a replacement copy of a baptismal record are as numerous as the governing bodies that may issue one. Policies vary based on religion, region, and even from church to church. [6] X Research source You may be required to fill out documentation justifying the need for a replacement document to be produced. You may need to provide evidence that you are a member of the church you are requesting the document from."
    },
    {
      "title": "Make changes to the baptismal record.",
      "content": "Make changes to the baptismal record. Many churches will not permit you to make any changes to the information recorded on the baptismal record, but some permit alterations based on the situation and necessity. [7] X Research source Godparents cannot usually be changed after the baptism. Name changes may be permitted on the form if the name was changed for a reason the church deems legitimate for the purposes of recreating a baptismal record."
    }
  ]
}