{
  "url": "https://www.wikihow.com/Cut-U-Shaped-Hair",
  "title": "How to Cut U Shaped Hair",
  "steps": [
    {
      "title": "Dampen the lengths of your hair to help it lay as flat as possible.",
      "content": "Dampen the lengths of your hair to help it lay as flat as possible. Wash your hair and towel-dry it as you normally would. If you recently washed your hair, you can spritz the lengths with water from a spray bottle to dampen it. You may want to go ahead and cover your shoulders with a hairdresser’s cape, garbage bag, or towel to catch falling hair."
    },
    {
      "title": "Brush out your hair to make it as straight as possible.",
      "content": "Brush out your hair to make it as straight as possible. Brush the hair out thoroughly from the tips to the roots to minimize breakage. Brushing will ensure that the hair cuticle lays as flat as possible. Because you want to create a very specific shape, brushing it out and smoothing it are really important. [1] X Research source"
    },
    {
      "title": "Use a comb to center part your hair.",
      "content": "Use a comb to center part your hair. Drag the end of the comb from the front of your head to the nape of your neck right down the center. Part and separate the hair so that you have 2 sections – 1 on each side of your head. Try to make both sections as equal as possible."
    },
    {
      "title": "Push the hair in front of your shoulders on both sides.",
      "content": "Push the hair in front of your shoulders on both sides. Once it’s parted evenly, push the lengths of your hair forward on each side so all of it is resting in front of your shoulders. At this point, you may want to brush both sides out once more to make sure they’re tangle-free before proceeding. [3] X Research source You may also want to clip 1 section of your hair out of the way so that you can focus on 1 section at a time."
    },
    {
      "title": "Slide your fingers down to the length you want to cut on the right side.",
      "content": "Slide your fingers down to the length you want to cut on the right side. Gather all of the hair on your right side. Create a V-shape with the index and middle fingers of your dominant hand, place the hair in between them, and slide your fingers down until you hit the length that you want. [4] X Research source If you have layered hair, you’ll only be working with your longest layer to create the U-shape. Keep your fingers straight and parallel with the ground. Don’t angle your fingers at all."
    },
    {
      "title": "Pull the hair in your fingers in front of your face and snip it straight across.",
      "content": "Pull the hair in your fingers in front of your face and snip it straight across. Use sharp hair shears to cut the ends of the hair that are flipped up. Remember to keep your fingers perfectly straight and parallel with the floor. If you angle your fingers, you won’t get the right shape. [5] X Research source If your hair isn’t quite long enough to pull it up in front of your face, you can stand in front of a mirror. You may also want to ask a friend or family member for help to ensure that your cut is even."
    },
    {
      "title": "Run a comb through the hair and snip to make it perfectly straight.",
      "content": "Run a comb through the hair and snip to make it perfectly straight. Use the comb the same way you just used your fingers to slide to the ends and flip the ends up. Move the comb to the very tips of your hair, since you’re not trying to cut off more length, but simply using it for the perfectly straight edge. Then, snip straight across, using the comb as a guide, to even out any bits that weren’t perfectly straight. [6] X Research source You don’t have to do this, but it can help you achieve perfect symmetry. You could also use clippers to get a super straight edge. [7] X Research source"
    },
    {
      "title": "Repeat the process on the left side of your hair.",
      "content": "Repeat the process on the left side of your hair. Use your fingers as a guide first and make sure the hair is even with the first side. Then, cut straight across, just like you did with the right side. Use the comb to perfect the straight cut you just made. [8] X Research source"
    },
    {
      "title": "Compare the tips of your hair on both sides to make sure they're the same length.",
      "content": "Compare the tips of your hair on both sides to make sure they're the same length. Since you cut one side and then the other, they may be slightly different lengths. Pull the edges to the center of your face, and make any snips necessary to even out the sides. Then, if you had to trim them, go back to the rest of that side and trim it to the correct length, using the snip you made as a guide."
    },
    {
      "title": "Gather your hair in a front ponytail and secure it with a hair elastic.",
      "content": "Gather your hair in a front ponytail and secure it with a hair elastic. Pull all of your hair up and to the front of your head, then hold it together right at the top of your forehead. Secure the hair with a hair elastic like you would for a regular ponytail. [9] X Research source If it helps, you can bend over and flip your upside down. Then, just gather the hair together at your forehead—this creates the soft blending of the shorter pieces. Another approach is to gather the hair under your chin rather than at the forehead to blend and create long, soft pieces. It’s up to you! [10] X Research source"
    },
    {
      "title": "Run your hand to the end of your hair and snip straight across.",
      "content": "Run your hand to the end of your hair and snip straight across. Brush through the lengths quickly once more. Then, keeping all of your hair gathered in one hand, slide that hand down the lengths of your hair so that you’re holding the ends in front of your face. Then, make another cut straight across the hair. [11] X Research source If your hair isn't long enough to pull in front of your face, just use a mirror to help you."
    },
    {
      "title": "Turn the scissors vertically and snip into the ends to soften the edges.",
      "content": "Turn the scissors vertically and snip into the ends to soften the edges. Since you don’t want your hair to have a hard, unnatural edge, it helps to snip up into the hair vertically from one side to the other to soften the edge. You should only snip up into the hair a couple of inches. Don’t snip all the way up your lengths! [12] X Research source Don’t worry about being super precise here; the idea is to make the straight edge look natural, so be a little sporadic."
    },
    {
      "title": "Twist the lengths of your hair and cut on a diagonal to soften the edges.",
      "content": "Twist the lengths of your hair and cut on a diagonal to soften the edges. After you cut straight across, twist the hair several times and hold the ends in front of you. Then, use your scissors to cut from one side to the other, holding the scissors at a slight angle. [13] X Research source This just helps to soften up any remaining hard lines and is especially effective if you have layers."
    },
    {
      "title": "Part your hair down the center.",
      "content": "Part your hair down the center. Remove the elastic and flip your hair back into its normal position. Then, use the comb once again to create a center part, gathering one half of the hair over your left shoulder and the other half over your right shoulder. Try to make the sections as equal as possible."
    },
    {
      "title": "Repeat the sporadic vertical snips into the ends on the right side.",
      "content": "Repeat the sporadic vertical snips into the ends on the right side. Using your index and middle fingers, slide down to the ends of your hair and flip them up so you can see them, just like you did at the beginning. Then, repeat the same sporadic vertical snipping to soften the ends and make them look more natural. This time, turn the scissors at a slight angle. Remember—you only want to snip vertically into the hair a couple of inches."
    },
    {
      "title": "Repeat the process on the left side of your hair.",
      "content": "Repeat the process on the left side of your hair. Slide your fingers down to the ends, flip the ends up, and snip into the hair sporadically at a slight angle. This helps to shear out any remaining bulkiness at the ends of your hair. [14] X Research source Removing bulkiness at the ends helps the hair lay flat and keeps the volume concentrated at the top of your head."
    }
  ]
}