{
  "url": "https://www.wikihow.com/Determine-Direction-Using-the-Sun",
  "title": "How to Determine Direction Using the Sun",
  "steps": [
    {
      "title": "Understand the motion of the sun in the sky.",
      "content": "Understand the motion of the sun in the sky. Due to the position of the earth and its motion through space, the sun generally moves through the sky from the east to the west. This is not a precise way of figuring out direction; depending on the time of year, the exact path of the sun changes between the northeast-northwest, east-west, and southeast-southwest horizons of the sky. [1] X Research source A significant exception to this general rule can be found at the north and south poles. The extreme position of each pole on planet earth creates long seasons of darkness and light, with the sun being absent in some places for up to six months!"
    },
    {
      "title": "Know the season.",
      "content": "Know the season. Our planet not only travels through space, spinning on its axis from west to east, but it also tilts toward and away from the sun. This tilt creates a difference in temperature that results in seasonal changes. The tilt of the earth will also influence the general position of the sun, so by knowing the season, you'll have a more accurate idea of the direction indicated by the movement of the sun in the sky. In summer the sun rises over the northeast horizon. As the day passes, the sun will move through the northeastern sky into the northwestern half, finally setting behind the northwestern horizon. In spring and fall the sun will travel a more direct route through the sky. This means that it will rise in the east and pass through the sky to set in the west. In winter the sun will rise in the southeast part of the sky. Throughout the day, it will travel through the southeastern sky until it sets behind the southwestern horizon. [2] X Research source NOTE: In the southern hemisphere (the southern parts of Africa, much of South America, Australia), the motion of shadows is reversed. This means that in summer the sun will rise in the southeast and in winter in the northeast, while spring and fall will be the same as the northern hemisphere with the sun rising in the east."
    },
    {
      "title": "Find east using the sun.",
      "content": "Find east using the sun. Now that you're equipped with knowledge about the sun's path through the sky, you should be able to determine the approximate direction of east. For example, in spring east will be roughly where the sun has risen. Face this direction. To find true-east more accurately in summer and winter, you'll have to adjust your direction slightly. In the summer you should adjust a little to the right, and in winter a little to the left. The closer you are to the middle of the season, the more the sun will be oriented to the north in the summer or south in the winter. This means in the middle of summer and winter you'll have to adjust more to the right and left, respectively."
    },
    {
      "title": "Find west.",
      "content": "Find west. The cardinal directions, north, south, east, and west, are equally distributed into quadrants on a compass. This means that east and west are directly opposite of each other, as are north and south. Since you're facing east, you now know the direction straight behind you is west. [3] X Research source You may find it easy to hold these direction in your mind using landmarks or a mental picture. However, if you struggle visualizing these directions, you may want to draw a line on the ground straight in front of you. The far end will point east and the near end will point west."
    },
    {
      "title": "Locate north and south.",
      "content": "Locate north and south. You should still be facing east at this time. When facing east, north will be 90 degrees to your left. Turn 90 degrees left to reorient yourself to face north. To do this, you should form a perfect L-shape with the direction of east. In your new position: east should be to your right; west to your left; north straight ahead; south directly behind. [4] X Research source Again, you may find it easy to keep track of these directions using landmarks or a mental picture, but if you have difficulty visualizing these directions, draw a line on the ground straight in front of you. The far end will point north, the near end south. If you have drawn lines to represent the directions of east-west and north-south, these should have created a plus sign (+). Each of the four points of the plus sign represent one of the cardinal directions - north, south, east, and west."
    },
    {
      "title": "Navigate to your destination.",
      "content": "Navigate to your destination. Now that you know the approximate directions around you, you should be able to use major landmarks in the distance to get where you're going. Some major landmarks you might use include skyscrapers, mountains, rivers, large bodies of water, and so on."
    },
    {
      "title": "Make a sun rod.",
      "content": "Make a sun rod. A stick, pole, or branch can be used as your sun rod. Find one that is as straight as possible and 1 meter (3¼ feet) long. Then take it to a level place that receives good sunlight. Drive your rod into the earth so that it forms a 90 degree angle (L-shape) with the ground. If you lack measuring tools, you may have difficulty getting your rod the right length. Generally you can assume that, if you are an adult of normal height, the distance between your fingertips when your arms are outstretched is about 1.5 meters (5 feet). [5] X Research source Use this approximation to trim your sun rod as close to 1 meter (3¼ feet) as you can."
    },
    {
      "title": "Mark the shadow cast at first light.",
      "content": "Mark the shadow cast at first light. To get an accurate read on your direction using shadows, you'll need to first wait for sun to set. When the sun rises in the morning, mark the spot your sun rod casts its first shadow. This shadow will point in the west direction, no matter where you are on earth. [6] X Research source Note that the shadow will only point due west two days in the year, on the Spring and Autumn equinox. After an equinox, the sun starts moving slightly further north or south, so although it will point in a westerly direction, it will not point due West."
    },
    {
      "title": "Draw your east-west line.",
      "content": "Draw your east-west line. Wait 15 minutes and mark the new position of the shadow of your sun rod. It should have moved a few centimeters at this point. Mark this new shadow on the ground and then draw a straight line between your two marks. This line will point approximately west in the direction of your first mark, and approximately east in the direction of your second mark."
    },
    {
      "title": "Orient yourself to the north.",
      "content": "Orient yourself to the north. Stand on the line you have drawn, with your first mark on your left and the second mark on your right. You should form a 90 degree angle (an L-shape) with the line connecting these two points. In this position, you will be facing approximately north. Following the line you have drawn to your left will be west. Following the line you have drawn to the right is the east. Directly behind you, opposite north, will be the south. [7] X Research source"
    }
  ]
}