{
  "url": "https://www.wikihow.com/Fart-Quietly",
  "title": "How to Fart Quietly",
  "steps": [
    {
      "title": "Release the fart slowly.",
      "content": "Release the fart slowly. Rather than release the fart quickly, which will likely cause a loud fart noise, take your time and release the fart slowly. Do this by squeezing your abdominal muscles and taking long inhales and exhales as you release the fart. Releasing the fart slowly should cut down on the noise it makes as it comes out of your butt. Or spread your buttcheeks as far as you can from each other to make a smooth, wavy fart that can sometimes have no scent at all. Using a pillow : Hold a pillow over your lap to help muffle the sound. This will help reduce noise of your quiet fart. Changing positions : You can also time your fart to be at the same time as a shift in your seat, which will help with the noise."
    },
    {
      "title": "Cough loudly or make a loud noise.",
      "content": "Cough loudly or make a loud noise. You can distract from your fart by coughing loudly or sneezing as you fart. This can help to cover up the noise as you fart. You could also make a loud noise by pretending to talk on your cell phone or turning up the music in the room before you release the gas. This could muffle the noise that inevitably comes with farting."
    },
    {
      "title": "Walk as you fart.",
      "content": "Walk as you fart. Another option is to fart while you are on the move so that the sound and smell do not linger in your general vicinity. Doing this will allow you to be absent when someone smells the fart or hears it and not have to assume any guilt when the smell of your fart is discovered. Try to walk towards an empty room or area so that you can finish farting when no one else is around you. That way, you will not need to feel embarrassed about releasing uncomfortable gas."
    },
    {
      "title": "Leave the room or area.",
      "content": "Leave the room or area. Before you fart, get up and try to vacate the area so you are not in a crowd or around a lot of people. That way, you can go into another room or area and fart to your heart's content. Leaving the area is also a method to shift the blame for the fart to fall on someone else, in case these strategies don't work. If you are on a crowded train, for example, try to get over to an empty car before you release gas. If you are in a busy office, head to an empty meeting room or common area and fart there so no one can be offended by the sound or smell."
    },
    {
      "title": "Spray air freshener.",
      "content": "Spray air freshener. You can mask the smell of your farts by spraying air freshener in the area or by using the scent of hand cream to ward off the smell. Rub scented hand cream on your hands after you have farted so the scent overpowers any stinky smells that may be lingering in the air."
    },
    {
      "title": "Soak beans before you eat them to prevent flatulence.",
      "content": "Soak beans before you eat them to prevent flatulence. Everyone is well aware that eating beans can cause gas. You can reduce the gas-producing quality of beans by soaking dry beans before you cook them. Eating dry beans instead of canned beans can also reduce the bloating and gas associated with beans. Use fresh water when you boil the dry beans, as using the soaking water may give you more gas."
    },
    {
      "title": "Eat less gas-causing vegetables and fruits.",
      "content": "Eat less gas-causing vegetables and fruits. While fruits and vegetables are essential to maintaining a healthy diet and lifestyle, some fruits and vegetables can make you more prone to gas. You can reduce your need to fart by cutting down on certain gas-causing fruits and vegetables. Eat fewer apples, peaches, bananas, pears, apricots, and raisins. You should also avoid prune juice as it can trigger your digestive tract to release gas. Eat fewer artichokes, asparagus, broccoli, cabbage, Brussels sprouts, cauliflower, green peppers, onions, radishes, celery, carrots, and cucumbers."
    },
    {
      "title": "Cut down on dairy products like milk and cheese.",
      "content": "Cut down on dairy products like milk and cheese. Many milk based products can cause gas and bloating. Reduce your consumption of dairy products like cheese, milk, and ice cream. You should also avoid packaged foods that contain lactose, like bread, cereal, and salad dressing."
    },
    {
      "title": "Reduce your consumption of carbonated drinks.",
      "content": "Reduce your consumption of carbonated drinks. Carbonated drinks contain a high amount of gas in them and this can translate to high levels of gas in your body. Have less soda, sparkling water, or carbonated fruit drinks and consume water instead so you stay hydrated. You can reduce the amount of gas in carbonated drinks by leaving them out, opened, for a few hours, until the carbonation is reduced."
    },
    {
      "title": "Cut down on your alcohol consumption.",
      "content": "Cut down on your alcohol consumption. Alcohol like beer and wine can cause bloating, indigestion, and gas. Beer in particular releases carbon dioxide as you consume it, leading to a build up of this gas and potential farting later. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you do enjoy drinking alcohol like beer and wine, sip it slowly and pace yourself. Taking your time when you drink can cause you to swallow less air, leading to a lower build up of gas in your body."
    },
    {
      "title": "Chew your food slowly when you eat.",
      "content": "Chew your food slowly when you eat. When you eat too fast, you increase the amount of air you swallow with every bite, leading to a buildup of air in your body and the need to release that air later. Slow down and chew eat bite of food at least two to four times before you swallow it. This will help your body to properly digest your food and cut down on the buildup of gas in your body. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Avoid chewing gum and sucking on candy.",
      "content": "Avoid chewing gum and sucking on candy. While you may reach for a stick of gum after you eat or suck on hard candy after a meal to help freshen your breath, doing this may cause you to feel gassy later. Chewing gum and sucking on candy will increase the amount of air you swallow, leading to more air in your body and the need to fart later. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Cut down on smoking.",
      "content": "Cut down on smoking. Smoking cigarettes, cigars, and pipes can increase the amount of air you swallow and lead to a buildup of air in your body. Cut down on how many cigarettes or cigars you smoke every day to reduce your need to fart. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}