{
  "url": "https://www.wikihow.com/Download-YouTube-Videos-in-High-Definition",
  "title": "How to Download YouTube Videos in High Definition",
  "steps": [
    {
      "title": "Find the video you want to download.",
      "content": "Find the video you want to download. In order to download a video in high definition, the video must be available as a high definition stream. Click on the gear icon at the bottom of the video. If 720p or 1080p are available options, then you can download the video in high definition."
    },
    {
      "title": "Go to the download website.",
      "content": "Go to the download website. These websites will take the URL for the video that you want to download, and present you with download links. Many of them work for YouTube and other video sites. Into an open browser, simply type in \"download youtube videos free\" and click on a link in the search results. There should be several to choose from."
    },
    {
      "title": "",
      "content": "Enter the YouTube link. Copy the full URL from your browser’s address bar and paste it into the field. Make sure to include the “http://”. Click the download button."
    },
    {
      "title": "Run the Java applet if asked.",
      "content": "Run the Java applet if asked. In order to convert the file, the site you're using may need to run a Java applet on your computer. This is a web based program, and you will need to confirm before it can continue. Confirm only if you are sure you trust the website. Do research on user reviews before allowing any programs to run on your computer."
    },
    {
      "title": "Download the file.",
      "content": "Download the file. You will presented with a list of video files to download. The high definition files are at the bottom of the list, and will be the largest size. They come in MP4 format, and will need special software to view in Windows. Mac OS X comes with native MP4 support."
    },
    {
      "title": "Download a universal media player.",
      "content": "Download a universal media player. There are several free and open-source media players available on the internet. VLC Player and Media Player Classic are two of the most popular options."
    },
    {
      "title": "Select video you want to view.",
      "content": "Select video you want to view. Right-click on it and select Open With… From the list of programs, select your newly installed media player. Check the box labeled “Always use the selected program to open this kind of file”. This make so you just have to double-click the MP4 file in the future and it will play automatically."
    },
    {
      "title": "Download the right quality.",
      "content": "Download the right quality. Some older computers may have difficulty running high definition video smoothly. If VLC or Media Player Classic keep giving you choppy playback, you may need to download a lower-quality version of the video in order to watch it successfully."
    }
  ]
}