{
  "url": "https://www.wikihow.com/Deal-with-a-Controlling-Spouse",
  "title": "What to Do if Your Partner is Controlling",
  "steps": [
    {
      "title": "Pick your battles and avoid picking fights about the little things.",
      "content": "Pick your battles and avoid picking fights about the little things. If it's something minor and you genuinely don't care, let them have their way. If they feel as though they have control over smaller issues, the behavior might not escalate into anything more serious. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, if your spouse prefers to choose which restaurant you'll eat at and you don't care, go ahead and let them choose. When you do let them make a decision, emphasize that they took charge and had control over that situation. For example, you might say, \"Thanks for taking charge of dinner. I really appreciate it.\""
    },
    {
      "title": "Try to understand things from your spouse's perspective.",
      "content": "Try to understand things from your spouse's perspective. If you empathize with your spouse's anxiety, that will help you start from a place of understanding. According to Dr. Georgoulis, \"There are also some control behaviors associated with anxiety.\" [2] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Have a serious discussion about it so you can better understand how things look and feel from their point of view. [3] X Research source Even if you think they sound ridiculous or unlikely, make a point to validate your spouse's thoughts and feelings. Dr. Georgoulis notes that \"a little validation in these moments goes a long way.\" [4] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. Dr. Georgoulis recommends acknowledging your spouse's experience in the moment, such as by saying, \"I see that you seem like you're nervous right now,\" and then giving them a chance to take a break and talk through it. [5] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Dr. Pazak agrees that you should \"ask the person who is exhibiting controlling behaviors to help you to understand why they are trying to control you or the situation.\" [6] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022."
    },
    {
      "title": "Remain calm and rational while talking to your spouse.",
      "content": "Remain calm and rational while talking to your spouse. Dr. Georgoulis notes that you shouldn't \"communicate if you're overwhelmed and flooded with too much emotion, specifically, anger or anxiety.\" Wait until both of you are in a place where you can speak and listen to one another calmly. [7] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Paraphrase back what your spouse says to you so they know that you understand their perspective and can correct you if you don't. If your spouse starts to get angry or defensive, Dr. Georgoulis recommends \"confidently and calmly... letting them know they need to be calmer in order for you to continue a discussion with them.\" [8] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. Dr. Pazak agrees that you should \"learn to speak boldly and confidently in relationships in order to communicate what is bothering you as if your partner doesn't know what the bothersome behavior is, it will continue.\" [9] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. If you feel yourself becoming overwhelmed, or sense that your spouse is becoming overwhelmed, suggest that the two of you take a break for a few minutes."
    },
    {
      "title": "Make a list of examples of your spouse's controlling behavior.",
      "content": "Make a list of examples of your spouse's controlling behavior. Concrete examples work well to highlight the behavior or attitude that is bothering you. Dr. Georgoulis recommends that you use \"I statements\" and \"avoid blaming your partner for making you feel that way.\" [10] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 14 April 2021. Dr. Pazak notes that \"when someone acts controlling,\" you should \"speak with them to address the specific controlling behaviors that you would like to change. Address the controlling behaviors every time you observe them.\" [11] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Sometimes it will make more sense in the moment than it would if you simply presented your spouse with a list. Ruiz recommends \"emphasizing [that] you want to feel more connected, you want to be able to feel that your partner can trust you, because a lot of that control might be connected to a sense of them not trusting in your actions or your behaviors.\" [12] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022."
    },
    {
      "title": "Set reasonable boundaries with your spouse.",
      "content": "Set reasonable boundaries with your spouse. Let your spouse know what you feel is acceptable in each of the situations you've mentioned as problematic. Setting boundaries is about what you need, not about how they feel or what they're comfortable with. [13] X Research source Dr. Pazak notes that \"someone can attempt to control your behaviors, however you can disagree and choose the behaviors that are comfortable for you.\" [14] X Expert Source Susan Pazak, PhD Licensed Clinical Psychologist & Professional Life Coach Expert Interview. 22 February 2022. Provide reasonable consequences for violating any of your boundaries that are proportionate to the violation. Make sure your consequences aren't idle threats that you don't intend to actually follow up on."
    },
    {
      "title": "Enforce the boundaries you set consistently.",
      "content": "Enforce the boundaries you set consistently. A boundary isn't a boundary if you let your spouse slide or make excuses when they violate it. Let them know, calmly, that you see that they've violated your boundary. To enforce your boundary , implement whatever consequence you put in place when you first set the boundary. [15] X Research source For example, you might have told your spouse that you won't do the laundry if they criticize how you fold their clothes. When they criticize your folding, you stop doing the laundry. Ruiz cautions that \"you yourself need to recognize is this the relationship you want to be in because having someone who is so controlling of your every move is not healthy.\" [16] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022. \"And it's not to say that you need to consider getting out of it,\" Ruiz continues. \"It's more so of considering what is your own boundaries, what is for you.\" [17] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022."
    },
    {
      "title": "Ask your spouse to attend couples counseling with you.",
      "content": "Ask your spouse to attend couples counseling with you. A couples counselor can help your spouse to see that they are controlling and figure out how to behave differently. They can also give you tools to communicate better. [18] X Research source Ruiz recommends counseling because \"sometimes people don't feel comfortable enough to bring something up because their partner might shut them down. And a way to bring it up is to say, 'Hey, I'm having concerns about us being able to connect... in the best way possible. I really would like for us to go to counseling and address it.'\" [19] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022. \"When you bring it up to them that way, it doesn't guarantee that [they] would chime in to say that they're willing to go to counseling,\" Ruiz explains. \"It just makes it a bit easier to have the conversation because it comes from a place of focusing on the relationship rather than focusing on your partner having a problem.\" [20] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022. Your spouse might also benefit from individual therapy to help identify the triggers for their controlling behavior and find more healthy ways to cope with those issues."
    },
    {
      "title": "Pursue your own interests and hobbies.",
      "content": "Pursue your own interests and hobbies. You're entitled to spend time alone and have your own interests apart from your spouse. Spending time apart can also help you both develop your lives as whole people and become less dependent on one another. [21] X Research source Always let your spouse know where you're going to be and who you're going to be with to help ease their anxiety. Ruiz emphasizes that \"it's not asking for permission. It's more so just doing it out of safety.\" [22] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022. Sharing stories about your interests and hobbies with your spouse can help them feel included, even if they're not with you."
    },
    {
      "title": "Maintain relationships with your friends and family.",
      "content": "Maintain relationships with your friends and family. A controlling spouse might try to dominate your time or keep you from talking to or hanging out with certain friends. Draw a line here and insist on staying close to your friends and family. [23] X Research source Make sure you're spending plenty of time with your spouse, but make it clear that your friends and family are important to you. If your spouse feels threatened by your relationship with some of your friends, you might try bringing them along with you so they can get to know each other."
    },
    {
      "title": "Use self-affirmations to avoid internalizing your spouse's criticisms.",
      "content": "Use self-affirmations to avoid internalizing your spouse's criticisms. Studies show that self-affirmations can help you maintain a more positive view of yourself. Here are some examples of self-affirmations that you can use: [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source I grow and improve every day. I am enough. I am free to create the life I want. I'm allowed to have needs and take up space."
    },
    {
      "title": "Stay true to your values and beliefs.",
      "content": "Stay true to your values and beliefs. A controlling spouse often wants to tell you what you should believe or what sort of values you should have—don't fall for it! Let your spouse know that it's okay for you to disagree on some things, and that just because you don't share the same beliefs doesn't mean you love them any less. [25] X Research source For example, if the two of you practice different religions, you might go to services on your own or with your family while your spouse does the same. If the two of you have strongly held political beliefs that clash, you might agree not to discuss politics."
    },
    {
      "title": "Think seriously about whether you should leave.",
      "content": "Think seriously about whether you should leave. No matter how frustrating your spouse might be, it can be difficult to decide that you truly want to call it quits . But if they're making you fear for your safety or limiting your life to such an extent that it's no longer enjoyable, it might be time to take that step. Talk to your close friends and family about your decision to leave and get their help and support. Ask them for whatever it is you think they can offer you that would help you move forward. [26] X Research source If you need support beyond your friends and family, call a domestic violence hotline . They can help you find shelter and other resources to leave safely."
    },
    {
      "title": "They tell you where you can go and what you can do.",
      "content": "They tell you where you can go and what you can do. This might look like them telling you that they don't like it when you go to a certain bar with your friends or that it isn't fair for you to go to a concert without them. They might try to dictate when you run errands or get upset when you don't do things in the most efficient way. [27] X Research source They might also tell you to stop hanging out with friends they don't like or insist on having access to all of your social media accounts so they can always see what you're doing online. This might be indirect as well. For example, a controlling husband might criticize or make fun of you for going to your book club because he doesn't like when you go. He'd make it just enough of a bother to you that you'd stop going altogether. A controlling spouse might also act suspicious if you want to go somewhere by yourself or spend time by yourself. Typically, they won't understand why you need time alone or why you need to do anything without them."
    },
    {
      "title": "They make their love or affection conditional.",
      "content": "They make their love or affection conditional. They might say something like, \"I love you, but,\" followed by some complaint about something they want you to change or stop doing. Even if they're not quite that direct about it, they might still let you know that they believe the two of you would have a stronger connection if only you would do things the way they want you to. [28] X Research source For example, a controlling wife might repeatedly reject your sexual advances, then tell you that she'd be more affectionate if only you lost a little weight. They might also use this tactic to get you to stop hanging around with people they don't like. For example, a controlling husband might say, \"I love you, but you've got to stop talking to Sarah, she always puts such terrible ideas in your head.\""
    },
    {
      "title": "They need to know where you are every second of the day.",
      "content": "They need to know where you are every second of the day. They might text you constantly throughout the day with questions that could've waited, then ask where you are or what you're doing. They might even ask you to send them a selfie to help satisfy their anxiety about the situation. [29] X Research source A controlling spouse who believes that they can't trust you might track your location through an app on your phone or even install a tracking device on your car so they can monitor your movement."
    },
    {
      "title": "They tell you what to wear or question what you're wearing.",
      "content": "They tell you what to wear or question what you're wearing. This doesn't come from a place where your spouse actually knows better than you what to wear to a particular place or for a particular occasion. Rather, a controlling spouse is typically concerned that people will judge them (negatively) based on how you're dressed or that you'll attract the \"wrong\" type of attention (from their perspective). [30] X Research source Ruiz agrees that \"there's a difference between sharing our concerns about maybe whatever your partner is wearing to a certain event or gathering but you share those concerns with them and as an adult, they would make that choice whether or not they're going to do it or not in hopes that they would take into consideration what you're saying and show mutual respect towards that.\" [31] X Expert Source Omar Ruiz, LMFT Licensed Marriage & Family Therapist Expert Interview. 22 April 2022. For example, a controlling wife might accuse you of grooming and dressing nicely because you want to attract other women or flirt with other women. A controlling husband might question why you're \"so dressed up\" or wearing makeup if you're just going to run errands, insinuating that you're cheating on him because you want to look nice when you go out in public."
    },
    {
      "title": "They criticize or belittle you in front of others.",
      "content": "They criticize or belittle you in front of others. When other people are praising you or celebrating your accomplishments, a controlling spouse might feel as though you think you're better than them. They might say something critical or demeaning to cut you down to size because they feel more secure if they feel as though they're better than you. [32] X Research source For example, if someone invites you over for dinner to celebrate your work promotion, a controlling spouse might say something like, \"That sounds great, just don't expect them to return the favor—if it was up to them to cook for us, we'd starve!\""
    },
    {
      "title": "They withhold basic needs from you or make them conditional.",
      "content": "They withhold basic needs from you or make them conditional. This could include anything from food and water to sleep. It might also be less vital things that are nonetheless important to you, such as changing the wi-fi password so that you can't access the internet until you do something your spouse wants you to do. [33] X Research source For example, a controlling spouse might keep you up late arguing because they're upset that you went out with your friends earlier in the evening. This also might not be direct or outright. Instead, a controlling spouse might criticize or insult your choices until you choose the way they want. For example, a controlling spouse who wanted you to lose weight might make fun of you for getting cookies at the grocery store until you put them back."
    },
    {
      "title": "They throw a fit when you don't do things their way.",
      "content": "They throw a fit when you don't do things their way. A controlling spouse tends to have very particular ways that they expect things to be done—a lot of this is rooted in anxiety. If you don't do things the way they want, they're likely to freak out. Just keep in mind that even if it's something relatively minor that you feel like most people wouldn't even notice, it's very important to them. [34] X Research source For example, they might get mad at you because you bought laundry detergent in a different scent, so they refuse to speak to you until you go back to the store and get the scent they like. They might also get upset when you don't meet expectations they've never made clear to you. For example, a controlling spouse might go off the handle at you for wearing jeans to a pool party even though they never told you people were going to be swimming."
    },
    {
      "title": "Fear",
      "content": "Fear Controlling behavior is often rooted in extreme internalized anxiety and fear that everything will go wrong. The person seeks to control as much as they can because, for them, that lessens the risk of a bad thing happening. If they can't directly control things, they'll still try to get as much information about those things as possible. [35] X Research source For example, if you go out with your friends, a controlling spouse might text or call you every few minutes to check in on you and make sure everything is alright. They could be afraid that you're going to cheat on them or that something bad is going to happen to you."
    },
    {
      "title": "Lack of trust",
      "content": "Lack of trust This doesn't mean that you've given your partner any reason not to trust you. Rather, your partner has trust issues for some reason, likely because of something that happened to them earlier in their life. They might have trusted someone else who betrayed them or let them down. [36] X Research source Because of their lack of trust, they likely believe that if they can simply control, or know, every detail of where you are and when, they'll never have to worry about you betraying them or cheating on them."
    },
    {
      "title": "Insecurity",
      "content": "Insecurity When your partner is insecure, they might try to belittle you or shame you so that you'll feel beneath them. If they feel like they're better than you, they'll feel more secure. [37] X Research source Insecurity also comes out as jealousy. For example, your controlling spouse might always accuse you of cheating on them or demand to know where you are and who you're with at all times to make sure you aren't cheating on them."
    },
    {
      "title": "Past trauma",
      "content": "Past trauma When people have lived through trauma, they often develop some unhealthy or even downright toxic coping mechanisms. A controlling spouse might be acting that way as a reaction to a past trauma where they had no control over what was happening to them. Trauma can also \"teach\" people things that aren't really true, and they might act controlling as a result. [38] X Research source For example, as a result of an abusive childhood, someone might believe that they can't trust anyone. That lack of trust leads them to try to control the people they feel close to. If your spouse had an abusive or traumatic childhood, they might be subconsciously trying to reenact the dynamic they observed between their parents. For example, if one of their parents controlled the other, they might be trying to control you just because they think that's what they're supposed to do because that's how their parents modeled marriage."
    }
  ]
}