{
  "url": "https://www.wikihow.com/Cook-a-Basic-Omelette",
  "title": "How to Cook a Basic Omelette",
  "steps": [
    {
      "title": "Whisk 2 or 3 eggs with salt and pepper.",
      "content": "Whisk 2 or 3 eggs with salt and pepper. Crack as many eggs as you'd like into a small bowl or dish. Then, sprinkle in salt and pepper according to your taste. Take a whisk or a fork and beat the eggs until the mixture is a uniform yellow color. Whisk for at least 10 seconds so the omelette is consistent in texture. [1] X Research source You could also flavor the omelet with dry seasonings of your choice. Sprinkle a little curry powder or cajun seasoning, for instance."
    },
    {
      "title": "Melt 1 teaspoon (4.9 ml) of oil and 1 teaspoon (4 g) of butter in a skillet.",
      "content": "Melt 1 teaspoon (4.9 ml) of oil and 1 teaspoon (4 g) of butter in a skillet. Set an 8 or 9 in (20 or 23 cm) nonstick skillet on the stove and turn the burner to medium-low. Put 1 teaspoon (4.9 ml) of oil and 1 teaspoon (4 g) of butter into the pan so they melt and coat the bottom of the skillet. [2] X Research source Use your favorite oil, such as vegetable, sunflower, canola, or olive oil. The oil prevents the butter from burning in the skillet. If you prefer, you could use all butter or all oil instead."
    },
    {
      "title": "Pour the beaten eggs into the pan.",
      "content": "Pour the beaten eggs into the pan. Once the skillet is hot and the butter is foaming, slowly pour the beaten eggs into it. Hold the handle and slowly tilt the pan until the egg mixture coats the entire surface of the skillet. [3] X Research source Keep the burner at medium-low heat so the omelette cooks evenly. If the burner is up too high, the omelette will become rubbery."
    },
    {
      "title": "Cook the omelette and tilt the pan mixture until the omelette's almost set.",
      "content": "Cook the omelette and tilt the pan mixture until the omelette's almost set. Leave the eggs to cook for about 20 seconds before stirring the edges of the skillet with a rubber spatula. Scoot the curds along the edges towards the center of the skillet. Then, tilt the skillet so the egg mixture runs to the empty edges of the skillet. [4] X Research source Cook the omelette until it's set, but still slightly glossy on top. This should take about 1 minute."
    },
    {
      "title": "Add your choice of fillings if you want to make a heartier omelette.",
      "content": "Add your choice of fillings if you want to make a heartier omelette. Although you don't need to add any fillings to a basic omelette, it's easy to customize one. Sprinkle about 1/3 cup (78 g) of fillings over 1/2 of the omelette. You could use: [5] X Research source Shredded cheese, such as cheddar, monterey jack, or colby jack Sautéed vegetables, such as mushrooms, bell peppers, or onions Diced cooked meat, such as ham, sausage, chorizo, or bacon"
    },
    {
      "title": "Turn off the burner and fold the omelette in half.",
      "content": "Turn off the burner and fold the omelette in half. Take a rubber spatula and gently lift up the edges of the omelette on 1 side. Then, slide the spatula under the omelette and lift 1/2 of the omelette over to the other side. Slide the omelette onto a serving plate and enjoy it while it's hot. [6] X Research source Although the omelette has the best texture immediately after cooking, you can refrigerate leftovers in an airtight container for up to 3 days."
    },
    {
      "title": "Beat 3 eggs in a bowl with salt and pepper.",
      "content": "Beat 3 eggs in a bowl with salt and pepper. Crack 3 large eggs into a bowl and use a whisk or fork to beat the eggs. Keep beating until the yolks are incorporated into the whites and the eggs are a uniform yellow color. Whisk for at least 10 seconds to ensure that the omelette has a consistent texture and color. [7] X Research source Avoid beating the eggs until they become foamy or they won't cook evenly."
    },
    {
      "title": "Melt 1 tablespoon (14 g) of butter in a nonstick skillet over medium-high heat.",
      "content": "Melt 1 tablespoon (14 g) of butter in a nonstick skillet over medium-high heat. Set an 8 in (20 cm) nonstick skillet on the stove and put 1 tablespoon (14.8 ml) (14 g) of unsalted butter into it. Turn the burner to medium-high and tilt the pan a little so the butter coats the skillet as it melts. [8] X Research source You could also use a seasoned carbon steel pan."
    },
    {
      "title": "Pour the eggs into the skillet and stir them until they're softly set.",
      "content": "Pour the eggs into the skillet and stir them until they're softly set. Slowly pour the eggs into the hot skillet and begin shaking the pan gently to keep the eggs moving. Use a spatula or chopsticks to stir the eggs in the skillet for about 1 minute. This breaks up the curds so you get a smoother, softer omelette. [9] X Research source Ensure that you stir the edges of the omelette since these usually cook faster than the eggs in the center of the skillet. Although you can add fillings, keep them to a minimum so the omelette is easy to roll."
    },
    {
      "title": "Roll the omelette over itself by 1 inch (2.5 cm) intervals.",
      "content": "Roll the omelette over itself by 1 inch (2.5 cm) intervals. The omelette will probably crack if you try to roll it tightly. Instead, take a spatula and loosen the edges of the omelette. Tilt the handle of the skillet up while you lift the closest edge of the omelette up. Roll it towards the center of the omelette away from the handle. Keep lifting and rolling about 1 inch (2.5 cm) of the omelette until you've rolled it to the side of the skillet that's opposite from the handle. [10] X Research source If you're struggling to roll the omelette with the spatula, try using chopsticks for greater control."
    },
    {
      "title": "Slide the rolled omelette onto a plate so the seam is facing down.",
      "content": "Slide the rolled omelette onto a plate so the seam is facing down. Bring your serving plate over to the skillet. Slowly tilt the skillet up and over the plate so the rolled omelette lands on the plate seam-side down. [11] X Research source Serve the omelette while it's hot. You could garnish it with more fresh herbs if you like."
    }
  ]
}