{
  "url": "https://www.wikihow.com/Do-the-Seven-Games-of-Parelli",
  "title": "How to Do the Seven Games of Parelli",
  "steps": [
    {
      "title": "The Friendly Game.",
      "content": "The Friendly Game. This game is all about getting your horse to be confident in himself, in his environment, in you, and in what you're teaching him. In practical terms, this means getting your horse to the point where he's totally comfortable with you being near him, touching him, and to refer to a Parelli-ism, \"taking the time it takes.\" [1] X Research source Begin by making sure your horse is comfortable with you being in his space. The concept of thresholds is very important here. If he is resistant to the idea of being touched, don't rush it. Use a rope (or a Carrot Stick & Savvy String, if you've got one) and lightly toss it over his neck, his back, his hindquarters, around his legs, etc. Use a light and steady rhythm. This exercise is a way of testing what areas your horse is okay with you touching and which ones he's resistant to. A Carrot Stick is an important tool in the Parelli method, particularly within the Seven Games. The Carrot Stick is not a whip; it acts as an extension of your arm. For the Friendly Game, use the following guidelines: Rhythm, Relaxation, Retreat & Repeat. If your horse is uncomfortable with something, back off (retreat). Once your horse is comfortable with you touching him all over (with the rope/Savvy String, Carrot Stick, and eventually your hand), you're ready to move on to the next game."
    },
    {
      "title": "The Porcupine Game.",
      "content": "The Porcupine Game. This game is named as such because it teaches the horse to move away from a point of pressure, or a \"feel.\" It's essential to be progressive with this game, which means getting your horse to give you more while requiring less stimulation from you. [2] X Research source A good place to start is by placing your hand on Zone 1 (the nose) and attempt to back your horse up based on this touch. Slowly increase pressure until he responds and backs up. The idea of \"phases\" is essential to this game. In the above example, Phase 1 is the least amount of pressure possible. Essentially, it's the act of placing your hand on the horse. If the horse doesn't respond, move to Phase 2 - a little more pressure. If that doesn't work, move to Phase 3 - a little more forceful. If he doesn't respond to Phase 3, move onto Phase 4 - whatever amount of pressure it takes to get a response. This does not mean hitting, beating, etc. Getting to Phase 4 means you have steadily increased pressure. As soon as the horse responds, release the pressure all together. With time, practice & repetition, your horse will take fewer and fewer phases to achieve the desired response. The moment you release pressure is a variety of the Friendly Game - \"You did what I wanted you to do, so I'm going to remove the pressure.\" This game does not just apply to the nose. Use similar methods, referring to the four Phases, along his side, to lift his leg, turn his head, etc."
    },
    {
      "title": "The Driving Game.",
      "content": "The Driving Game. While the Porcupine Game is about steady pressure, the Driving Game is about rhythmic pressure, or eventually the \"suggestion\" of pressure. The Driving Game is a logical progression of the Porcupine Game. [3] X Research source Apply the same four Phases, except this time, rather than using your hand and steadily increasing the pressure or weight behind it, use a Carrot Stick and \"tap\" the horse. Phase 1 is light, rhythmic tapping, Phase 2 slightly stronger, and so on. It's imperative that you maintain a steady rhythm throughout the phases. The speed and rhythm of the pressure shouldn't change, only the amount of force behind the pressure. This process can be applied to backing up, hindquarter yields, etc. As noted above, for more detailed descriptions and actual demonstrations of the Seven Games from Pat Parelli himself, go to ParelliConnect.com."
    },
    {
      "title": "The Yo-Yo Game.",
      "content": "The Yo-Yo Game. It's pretty easy to see why this game was named as it was. Using the four Phases, back your horse up a desired amount and then use a retreating motion to bring him back. As Pat says, \"The better your horse backs up, the better he'll do everything else.\" [4] X Research source To send your horse out, use the four Phases. Phase 1 is very little movement (in fact, wiggling a finger counts as Phase 1), Phase 2 is more pronounced, and so on. At the same time as you change phases, adopt a more forceful, stern look on your face and a dominant body posture. When you want to bring him back in to you, reel in the rope using a steady hand-over-hand motion with a soft, inviting look on your face. Body language is very important in the Seven Games, but it is of particular importance in this portion of the Yo-Yo Game."
    },
    {
      "title": "The Circling Game.",
      "content": "The Circling Game. It's important to note the difference between The Circling Game and lunging. In the Circling Game, it's the horse's responsibility to maintain gait, speed, direction and focus. It's not a mindless circle; he must stay attuned to what you're asking. At the same time, you must develop the three parts of the Circle Game: the send, the allow, and the bring-back. [5] X Research source The send is exactly what it sounds like: sending the horse out on a circle of designated circumference. To send, stand in one spot and send the horse out to the end of the rope. Then, lead the horse forward until he begins circling with the rope remaining relatively taught. Once the horse is moving on a circle, you stay in \"neutral\" (face the same direction, don't follow the horse with your eyes or micromanage). As long as he stays on that path, you don't interfere. This is the allow. When you want to bring the horse back, adopt the same body language as you did when you brought him back in the Yo-Yo Game. Practice the Circling Game in both directions, at varying lengths and speeds (walk & trot)."
    },
    {
      "title": "The Sideways Game.",
      "content": "The Sideways Game. To begin, it's most effective to bring the horse so his head is facing a wall or barrier of some sort. Using rhythmic pressure with a Carrot Stick (not actually touching him, but wiggling the stick and string near the horse's hindquarters), walk toward the horse, who has remained perpendicular to the barrier. This will likely not result in a perfect Sideways motion right away, but alternating repetition and retreat will help you avoid frustration while achieving the desired result. [6] X Research source If you're concerned that your horse may not respond well to this, get a few pieces of fencing or paneling and walk on the other side of it while using your Carrot Stick as an extension of your arm to apply the suggestion of pressure to the hindquarters."
    },
    {
      "title": "The Squeeze Game.",
      "content": "The Squeeze Game. This game involves getting your horse comfortable with \"squeezing\" between objects. To begin, these objects should be relatively far apart, so your horse is willing to attempt it. For example, play the Circling Game a bit closer to a wall or barrier than normal, with a bit shorter line than normal. If you allow for a 10- to 15-foot space between you and the barrier and you encourage your horse to go through that space, you're playing the Squeeze Game. [7] X Research source Similar to using Phases, your horse will be more comfortable with increasingly smaller spaces the longer (and more effectively) you play this game. It's all about thresholds. If your horse will go through a 15-foot gap but not a 10-foot gap, don't keep pushing him to make it through the 10-foot gap. Retreat, move back to a 15-foot (or even 20-foot) gap, and slowly work back toward that threshold."
    },
    {
      "title": "After you've made your way through these games, that doesn't mean that you're done with them.",
      "content": "After you've made your way through these games, that doesn't mean that you're done with them. You should be playing, or at least referencing, these games every time you're with your horse, no matter what level horsemanship you achieve. Your relationship with your horse will grow stronger, and your horsemanship will improve as a result. Once again, further information on the Parelli Seven Games can be found on ParelliConnect.com"
    }
  ]
}