{
  "url": "https://www.wikihow.com/Extend-Your-Eyebrows",
  "title": "How to Extend Your Eyebrows",
  "steps": [
    {
      "title": "Sweep translucent powder over your brow bone with a clean brush.",
      "content": "Sweep translucent powder over your brow bone with a clean brush. A dusting of translucent setting powder with a fluffy brush will help the makeup stick to your skin. It will also absorb any excess oil that could cause your makeup to run. Dip your fluffy brush into the powder, tap the brush against the sink or counter to get rid of the excess, and then quickly dust a layer over both brows. Alternatively, use a primer designed for use on your eyes to help your makeup stick."
    },
    {
      "title": "Line up a pen with outside corner of your eye and mark the spot.",
      "content": "Line up a pen with outside corner of your eye and mark the spot. Look straight ahead into a mirror. Hold a pen or makeup brush handle vertically against the outer edge of your nostril. Then, angle the pen out slightly so it passes right next to the outside corner of your eye. Make a mark that sits at the intersection of this line and a horizontal line straight across from the lowest spot on the inner corner of the brow. Mark this spot on your brow bone with an eyebrow pencil. [1] X Research source Make the mark very light. Use an eyebrow pencil that is the same color as your eyebrow hair. [2] X Expert Source Melissa Jannes Beauty Stylist Expert Interview. 30 August 2019. You could make the mark slightly higher than the inner corner of your eye, but avoiding making it any lower as this may make your eyes appear to droop. Do this for both of your eyebrows."
    },
    {
      "title": "Outline the remainder of each new tail with an eyebrow pencil.",
      "content": "Outline the remainder of each new tail with an eyebrow pencil. Use an eyebrow pencil to lightly sketch lines that connect the hairs of your natural arch to the dot you just drew. Use a very light touch and sketch with short, feathery strokes so that the marks look natural. [3] X Expert Source Melissa Jannes Beauty Stylist Expert Interview. 30 August 2019. Create a soft taper with a clean, pointed tail for each brow. [4] X Research source"
    },
    {
      "title": "Fill in the outline with an eyebrow pencil that matches your brows.",
      "content": "Fill in the outline with an eyebrow pencil that matches your brows. [5] X Expert Source Melissa Jannes Beauty Stylist Expert Interview. 30 August 2019. Make sure your pencil is sharp before you begin. Use light, feathered strokes to fill in the outline for the tail that you just drew. Continue to fill it in with pencil until the color and saturation matches the rest of your eyebrow. Do this for both eyebrows. You can beef up the look by applying brow powder over the pencil with an angled eye makeup brush. [6] X Expert Source Melissa Jannes Beauty Stylist Expert Interview. 30 August 2019. If you have dark hair, alternate black and dark brown pencils. Black alone can look harsh, while brown alone can be too auburn. If you have blonde hair, use a combination of gray and light brown pencils instead of dark brown and black. Use your root color as a guide. [7] X Research source"
    },
    {
      "title": "Use a spoolie brush to soften and blend the color.",
      "content": "Use a spoolie brush to soften and blend the color. Run an eyebrow spoolie brush over the length of your eyebrows, starting at the inner corners and moving out toward the tails. Use gentle, upward strokes to softly blend the pencil into your brows. Brush gently so you don't remove the pencil. You just want to blend it. Go over each brow 5 or 6 times, or until you're happy with the blending. [8] X Research source"
    },
    {
      "title": "Use a makeup swab to fix any mistakes.",
      "content": "Use a makeup swab to fix any mistakes. Dampen a swab and run it around the outline to remove any stray marks. If you want, you can use a clean cotton swab to apply a little more concealer or foundation around the new section of your brows. This will help to define the shape and length. Be sure to blend the makeup well."
    },
    {
      "title": "Set the look with translucent powder or setting spray.",
      "content": "Set the look with translucent powder or setting spray. Mist your eyebrows lightly with a makeup setting spray. If you don’t have a setting spray, use another light dusting of translucent powder to set the look. Carry an eyebrow pencil with you, just in case you need to do any touch ups throughout the day. [9] X Research source"
    },
    {
      "title": "Don't tweeze your eyebrows for at least 6 to 8 weeks.",
      "content": "Don't tweeze your eyebrows for at least 6 to 8 weeks. This may seem like a long time to go without tweezing, but it's important to let your eyebrows grow in significantly before attempting to reshape them. It's much easier to determine the natural shape of full brows, and then you can reshape them to flatter their natural angle and length. [10] X Research source It's fine to tweeze the hair above your nose, between your eyebrows, during this time. Resist the urge to tweeze other areas! If a stray hair grows in strangely and you just can't stand it, trim it instead of tweezing it. [11] X Research source"
    },
    {
      "title": "Hold a pen vertically by your nose to mark the brow's inner corner.",
      "content": "Hold a pen vertically by your nose to mark the brow's inner corner. Place the pen at the outside corner of your nostril, and angle it in slightly so that it lines up with the inside corner of your eye. The pen will bisect where the brow's inner corner should begin for the most flattering look. Use a brow pencil to mark this spot for both brows. [12] X Research source Make the mark faint and use an eyebrow pencil that matches the color of your eyebrows."
    },
    {
      "title": "Tweeze the hairs between the 2 marks and trim the longest hairs.",
      "content": "Tweeze the hairs between the 2 marks and trim the longest hairs. Use a spoolie eyebrow brush to comb your brow hairs straight up. Tweeze all of the hairs that fall between the 2 marks you made for the inner corners of your brows. Use eyebrow scissors to trim the longest hairs at the top of each inner corner. [13] X Research source To keep it looking natural, stagger the length as you trim. Cut one hair slightly longer, the next one a bit shorter, and so on. Don't trim beyond the tops of your inner corners."
    },
    {
      "title": "Line up the pen with your iris to find your natural arch.",
      "content": "Line up the pen with your iris to find your natural arch. Look straight ahead into a mirror. Hold the pen right next to your nose, then angle it out slightly so that it passes through the exact center of your eye. Use an eyebrow pencil to mark the spot on your brow that lines up with the outside of your iris. This is your natural arch. [14] X Research source Mark your natural arch for both eyebrows."
    },
    {
      "title": "Define your natural arch by plucking the hairs right beneath it.",
      "content": "Define your natural arch by plucking the hairs right beneath it. Your natural arch guides the reshaping process, and defining it will help you get face-flattering results. Pluck a few hairs right beneath the marks you made for both brows. Err on the side of caution and only tweeze the hairs that need to go to create a slight arch. [15] X Research source Step back after each tweeze to inspect your work and ensure you're tweezing both brows evenly. If your arches look too pointy, tweeze 1 or 2 hairs right above the arch to soften the line."
    },
    {
      "title": "Line the pen up with outside corner of your eye to find the tail.",
      "content": "Line the pen up with outside corner of your eye to find the tail. Look straight into a mirror. Hold a pen or brush handle vertically, right next to your nose. Then, angle it so that one end of the pen is next to your nostril and the other end passes right next to the outside corner of your eye. Mark the spot on your brow bone with an eyebrow pencil. Do this for both brows. If your face is square, place the mark near the center of your ear to help add more shape and length to your brow. If your face is round, place the mark closer to the top of your ear to add shape and length."
    },
    {
      "title": "Pluck the tails to create soft, tapered ends.",
      "content": "Pluck the tails to create soft, tapered ends. Avoid tapering to a thin point on each brow. To make your eyebrows look longer and fuller, create a soft taper for the tails. Don't tweeze away too much thickness! Just pluck the hairs that need to go so that your tails aren't blunt and end in a clean point. [16] X Research source The tails should end at about the same level on your face as the inside tips of your inner corners. You could make them a little higher, but tweeze the inside and outside corners to the same height if the tails are lower."
    },
    {
      "title": "Massage your brows once a day for a couple of minutes.",
      "content": "Massage your brows once a day for a couple of minutes. Improved blood flow and circulation can help your hair follicles get the oxygen and nutrients they need to grow longer and fuller. Make sure your hands are clean, and use small, circular motions with your fingertip. Include the area you’re trying to regrow and a little bit of the surrounding area on your forehead and above your eyes. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Apply a small amount of castor oil to your brow area at night.",
      "content": "Apply a small amount of castor oil to your brow area at night. Wash it off in the morning when you wake up. This is a classic natural hair growth aid that is available in many stores, but it has yet to be proven scientifically, so it may not work for everyone. You should see more hair growth in 3 to 4 weeks of nightly use if it’s working. [18] X Research source If you can’t find castor oil, extra virgin olive oil or peppermint oil may have a similar effect. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Buy a hair regrowth serum with peptides.",
      "content": "Buy a hair regrowth serum with peptides. You can find eyebrow serums at most beauty stores or online. Be sure to choose a serum that is formulated for increasing hair growth and length. Use the serum diligently every day for at least 6 weeks before evaluating whether or not it's working for you. [20] X Research source You may want to snap a \"before\" picture of your brows before you start using the serum so you'll have something to compare with. [21] X Research source Always follow the manufacturer’s instructions for application, and talk to a dermatologist if you’re not sure about a serum before using it."
    },
    {
      "title": "Use brow products that include the ingredient prostaglandin.",
      "content": "Use brow products that include the ingredient prostaglandin. Prostaglandin is a hormone-like substance that may stimulate eyebrow hair growth. This substance is safe to use on your eyebrows and there are a number of products on the market you can try out. Over time, you may see an increase in the number and length of your eyebrow hairs. Give the product at least 6 weeks before evaluating whether or not it's working for you. [22] X Research source"
    }
  ]
}