{
  "url": "https://www.wikihow.com/Deal-With-a-Best-Friend-Thief",
  "title": "How to Deal With a Best Friend Thief",
  "steps": [
    {
      "title": "Confront the new friend about what is going on.",
      "content": "Confront the new friend about what is going on. The best way to deal with this new friend is by talking to them about how they’re making you feel. Approach them with confidence and ask if you can talk to them privately about something if other people are around. [1] X Research source If you’ve told a teacher or parent about the situation, they might be able to help you set up a time and place to have a discussion. If not, you can ask to talk to them one-on-one whenever they’re free. Start this conversation by telling them how you feel, and avoid accusing them of purposefully stealing your best friend. You can say “I feel left out when you and Emma hang out without me because I want to be friends with both of you. Can you invite me next time you do something?”"
    },
    {
      "title": "Build a friendship with your best friend’s new friend.",
      "content": "Build a friendship with your best friend’s new friend. Kindness goes a long way, especially when dealing with someone who frustrates you. Be nice, talk to their new friend in a friendly tone, and show them that you want to be their friend, too. Sometimes, people want to get a reaction from you, and if they don’t get that reaction, they’ll give up. [2] X Research source You can ask them questions and try to get to know them, or just invite them to hang out with you to show that they aren’t making you feel threatened. Try to frame the situation as an opportunity to add another friend into your network."
    },
    {
      "title": "Make plans to hang out as a group.",
      "content": "Make plans to hang out as a group. If you talked to your best friend and their new friend and the conversation went well, make plans with both of them to hang out together. This can help you from feeling left out and show you what your best friend likes about their new friend. Plan to do something that you all enjoy to make sure that everyone is having fun. [3] X Research source You can either ask them to hang out in person, or start a group text message to make plans. Asking in person ensures that you get honest answers from both of them, but if you don’t see each other regularly, texting might be the best option for planning."
    },
    {
      "title": "Act civil and mature if the new friend doesn’t want to be your friend.",
      "content": "Act civil and mature if the new friend doesn’t want to be your friend. As a last resort, if the new friend says that they don’t want to be your friend or is outright mean to you, try to go about your life as normal and be civil to them. You don’t have to befriend them to keep being friends with your BFF. Keep making plans with your best friend as usual, and respect their new friendship by not making mean comments or talking behind their new friend’s back. Show your maturity by not pressuring your best friend to choose between you and their new friend, and let them know that you don't mind that they have other friends."
    },
    {
      "title": "Talk to your best friend about the situation.",
      "content": "Talk to your best friend about the situation. They might not have noticed what’s happening with their new friend, and if they’re your best friend they’ll care about your emotions. Be clear about what’s bothering you, whether it’s the fact that you feel like you’re not as close or that they cancelled plans with you to hang out with someone else. [4] X Research source You should try to start the conversation by telling your friend how you’re feeling. For example, you can say “I felt upset that you cancelled our plans to hang out with Jesse. I was really looking forward to going to the movies together, and I thought you were excited to go, too.”"
    },
    {
      "title": "Listen to what your friend has to say and try to understand their position.",
      "content": "Listen to what your friend has to say and try to understand their position. After you’ve told your friend what’s on your mind, give them some time to tell you how they’re feeling. During this time, make eye contact, be quiet, and listen to their explanation. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source When they’ve finished telling you how they feel, you can respond, but try not to get upset or angry with them, as this can lead to unnecessary conflict. If you don’t understand what they said, let them know. You could say “I’m not sure I understand what you mean when you say that you felt overwhelmed, can you explain it to me?”"
    },
    {
      "title": "Give your friend space if they need it.",
      "content": "Give your friend space if they need it. Your best friend might feel like they need to make new friends, and that’s okay. Give them space and time to hang out with other people while you focus on doing the same. You might want to try a new activity such as yoga, pottery, or dance class, where you can meet new people and gain a new skill. [6] X Research source Don’t purposefully ignore your friend, but if they ask for space you should give it to them. Otherwise, you might make them feel smothered or overwhelmed. Continue to talk to them regularly, and ask them how they’re doing, but don’t push further if they aren’t feeling talkative. Make sure your friend still knows that you care about them and want to be their friend. After a week or so of giving them space, you can invite them to spend some time with you by doing an activity that you both enjoy. Reader Poll: We asked 516 wikiHow readers, and 50% of them agreed that the best way to cope with changes in your friendship is to focus on your own interests and hobbies . [Take Poll] This can help you process your feelings and feel better."
    },
    {
      "title": "Talk to a parent or teacher about how you’re feeling.",
      "content": "Talk to a parent or teacher about how you’re feeling. Sometimes, it’s easy to overreact when you feel threatened or insecure in your friendship. Talking to someone you trust who isn’t involved in your friendship can help you get your feelings and frustration out before you start an argument. Your parents and teachers were young once, too, and they have probably been through something similar and can give you advice on how to handle the problem."
    },
    {
      "title": "Reach out to your friend to let them know you’re thinking about them.",
      "content": "Reach out to your friend to let them know you’re thinking about them. If your friend is stolen from you, that doesn’t mean that they don’t like you anymore. Say “Hi” when you see them, and ask them how things are. You might even want to text them to tell them that you miss them, and if they respond positively, invite them to hang out. [7] X Research source Sometimes, a new friend can feel exciting, but that excitement can wear off in a few weeks. Try not to hold a grudge against your best friend for making a new friend, and forgive them by welcoming them back as your friend."
    },
    {
      "title": "Work on making friends",
      "content": "Work on making friends with new people. If your conversations didn’t go so well, you might want to start making new friends to take your mind off of the old problems. New friends can help remind you that there are plenty of fish in the sea, and you can learn new things from them. You might just find that your new friends are much better for you. [8] X Research source Take plenty of time to focus on yourself and think about what you want for your future friendships."
    }
  ]
}