{
  "url": "https://www.wikihow.com/Get-Over-a-Girl-You-Love",
  "title": "How to Get Over a Girl You Love",
  "steps": [
    {
      "title": "Acknowledge your feelings.",
      "content": "Acknowledge your feelings. It is natural and normal to feel grief before you feel acceptance. Don't shy away from admitting, at least to yourself, that you are going through a difficult time. Understand yourself as best you can and don't reject your emotions out of hand. Instead, just focus on keeping them under control. [1] X Research source"
    },
    {
      "title": "Increase your distance.",
      "content": "Increase your distance. Nothing helps soothe the pain of seeing the girl you can't be with better than simply not being around her as much. This doesn't necessarily have to mean ceasing all contact, but it will mean seeing her less, which may sound awful but is actually the best way to start getting on with the rest of your life. [2] X Research source If you're currently friends, stop making the first move. Only spend time with her when she calls you; don't call her yourself and ask to spend time together. You'll still see each other occasionally, but in most cases you'll see a sharp decline in the amount of time you spend together – and an increase in your personal free time."
    },
    {
      "title": "Stop doing favors for her.",
      "content": "Stop doing favors for her. Nothing says “just friends” as clearly as a refusal to go out of your way for one person in particular. Doing favors for someone because you are attracted to them will only lead to your feeling used and misunderstood further down the line. Just as importantly, doing favors for a girl will only have one of two possible effects on her: One, she will assume you are naturally that giving, and begin taking your favors for granted, or two, she will assume you are trying to ingratiate yourself to her in exchange for the possibility of a date, which will make her uncomfortable around you. If you buy her gifts without asking (or just because she said she wanted something), cover her tab in cafes and restaurants, offer your services as a driver, or otherwise treat her differently than you would treat any of your other friends, that is a favor and it is important that you stop. Put potential favors through a simple test. When you find yourself about to do something for the girl you are trying to get over, ask yourself if you would be so willing to do the same thing for a good male friend. If not, you are probably trying to do her an extra favor rather than just be a good friend."
    },
    {
      "title": "Decline requests for favors.",
      "content": "Decline requests for favors. If the girl in question is used to you doing favors for her, and asks a favor of you, politely decline and suggest alternatives, such as other people who might be able to help her out instead. Make up a gentle excuse if you must, such as “I'm trying to spend less money” or “I really need to take some time to finish my homework/clean the apartment/call my relatives tonight.” If she truly values your friendship, she won't mind."
    },
    {
      "title": "Alter your schedule.",
      "content": "Alter your schedule. Leaving for school a few minutes earlier than usual can help you avoid bumping into the object of your affection on the sidewalk or in the hallway. Taking unusual routes between classes can also help ensure you will see her less often. If you're seeing her in a workplace environment, consider trading some shifts so that you work fewer shifts alongside her."
    },
    {
      "title": "Change your scene.",
      "content": "Change your scene. Very often, an unattainable girl is an integral part of your group of friends. Try spending time with a few friends at a time, rather than the whole group, so you can avoid having to be around her so much. If you have friends outside of your primary circle who you see less often, consider spending more time with them, as well. They'll feel appreciated, and you will be safely occupied away from the girl you've fallen for."
    },
    {
      "title": "Try quitting cold turkey.",
      "content": "Try quitting cold turkey. If the thought of seeing her even occasionally upsets you, you may have to plan to stop spending time with her altogether. Prepare some polite excuses (for example, “I'm studying pretty hard right now” or “I'm exhausted from work today”) so that you can gracefully decline when she asks to see you. Eventually she will contact you less and move on to people who have more time to spend around her."
    },
    {
      "title": "Avoid alone time.",
      "content": "Avoid alone time. If you can't help being around the girl you love (because of a job, for instance), use structure to your advantage. Formal group settings such as the workplace and the classroom are the ideal environment for establishing emotional boundaries with yourself. Simply interact the same way with the girl in question as you do with everyone else. Make it clear to yourself and her that there is no special relationship; that you are simply colleagues doing work side by side. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Don't go out of your way to choose her for a partner when partners are required. When you do work together, keep the conversation focused on the task at-hand."
    },
    {
      "title": "Find safety in numbers.",
      "content": "Find safety in numbers. Outside of structured environments, there will still be times when you'll have to be near your love. You can keep yourself from getting shaken or upset by choosing to interact with groups of people rather than individuals, thus minimizing the chances that you'll end up alone together at any point. For example, when the two of you are sitting together on a couch at a friend's house, it will be hard not to focus on her. Change that to four people stuffed onto a couch playing a game together, and it becomes much easier to spread your attention around. Treat her the same way you treat your other friends, and the pressure will be off before you know it. The key is to try to see her as just another girl."
    },
    {
      "title": "Have topics ready to discuss.",
      "content": "Have topics ready to discuss. Consider your thoughts on every political, cultural, religious, and scientific topic that you find interesting. Even if your only interest is something simple like video games or movies, explore that interest in your mind. By talking about information and opinions rather than emotions and relationships, you will be able to keep your cool and avoid painful topics, without alienating the girl as a friend. Because you are already enthusiastic about these topics, you will find it easy to talk about them when you have a captive audience – in fact, you may find it difficult to stop talking once you start."
    },
    {
      "title": "Always have an activity on-hand.",
      "content": "Always have an activity on-hand. Obviously, a shared activity can be interpreted as a date by either party, so it is important to avoid planning things like going out for dinner together. Instead, have pastimes in mind for those times when you find yourself alone with the girl you like in your house, or hers, or in a car with nothing to do. Carry a deck of cards, or even suggest taking some time to help each other study. Just keep it pedestrian. The important thing is to avoid situations where mixed signals can enter the equation, such as cuddling together on a couch or stargazing on a country road. Remember, you want to get over her, not make things worse. Always have a backup plan to avoid this kind of “romantic” downtime."
    },
    {
      "title": "Meditate beforehand.",
      "content": "Meditate beforehand. Meditation has several benefits, not the least of which is improved clarity of mind. Even a person who is experiencing a tumult of emotion on the inside can stay calm for long enough to have an evening out with a friend if they learn to focus ahead of time. At its most basic, meditation is as simple as breathing deeply and being still in a quiet place while focusing on yourself. Tell yourself that you will stay in control and remain focused on getting over your attraction, and carry that focus with you when you go to see her. [4] X Research source"
    },
    {
      "title": "Make a list.",
      "content": "Make a list. Expressing your feelings on paper can make them seem more manageable, as well as providing an emotional outlet. Start with obvious reasons that the relationship won't work, and put “she doesn't feel the same way about me” at the very top of the list. Follow up with any other reason you can think of, even if it seems flimsy: overlapping schedules, different religious backgrounds, people she likes who you dislike. The goal is to build a strong argument against a relationship by sheer weight of numbers. A dozen so-so reasons can do as much to ameliorate your suffering as one ironclad reason. [5] X Research source Add to your list whenever you think of something else that fits on it. If you think of something while you are away from home, simply try to remember it. If it is important enough, you will still have it in mind by the time you get home. Don't write it down anywhere temporary."
    },
    {
      "title": "Keep your list to yourself.",
      "content": "Keep your list to yourself. Don't show your words to anyone or leave them out where they can be found. Keep them at home in a safe place. If you are lucky enough to have your own bedroom, do your writing there, and hide it in your best hiding spot. Otherwise, find a place in your home where you can be alone for a while and write there instead. Hide your writing wherever you're confident it won't be found. Write by hand rather than on a computer. Computer files get discovered too easily. Never take your writing to school or work with you. If someone finds it, you'll have your privacy violated and only end up feeling worse."
    },
    {
      "title": "Rely on your list.",
      "content": "Rely on your list. Read over your list whenever you are feeling upset or sad about the girl you have feelings for, as well as any time you find yourself daydreaming about her. Seeing every reason you have ever thought of to move on from your feelings for her will give you the boost of strength you need to keep going."
    },
    {
      "title": "Talk to a safe confidant.",
      "content": "Talk to a safe confidant. Most often, this will be a parent or other close adult relative. One of the most effective ways to cope with grief is to share your feelings with another real person. If you have a figure in your life who you can trust implicitly, ask them to listen and help support you. Having a sympathetic ear will take a lot of weight off of your shoulders. Reader Poll: We asked 523 wikiHow readers who they’d reach out to if they needed to vent about someone they love, and 53% said they’d connect with their closest friends to find the support they need. [Take Poll]"
    },
    {
      "title": "Consider counseling.",
      "content": "Consider counseling. Not everyone can afford the time and money that counseling costs, but if you are one of the lucky ones, it can be a great help to speak to a counselor for a few sessions. Your counselor will provide a safe and confidential way for you to share your thoughts and feelings with another human being, face to face, and provide gentle suggestions to help you manage them outside the counseling room. [6] X Research source"
    },
    {
      "title": "Get artistic.",
      "content": "Get artistic. Art is possibly the most powerful tool mankind has ever devised for expressing thoughts and emotions. It could be prose writing, poetry, essays, sculpture, painting, collage, singing, playing an instrument, composing music, or anything else that combines an act of creation with a need for understanding, whether or not you have any talent for it. Whatever you choose to do, let it be an avenue for you to safely express your feelings and thoughts in a way that creates, rather than destroys. [7] X Research source Write out the story of your feelings, from the first time you met the object of your affection to the steps you are taking to try to move on. Write poems, substituting metaphorical stand-ins for real people and emotions. Slash a canvas with a paintbrush and let your frustration guide your hand. Get together with a friend and have a long jam session. If you are not at all creatively inclined, simply write a letter to yourself stating everything you want to say as plainly as possible, and tuck it away with your list when you are finished."
    },
    {
      "title": "Think objectively about the girl.",
      "content": "Think objectively about the girl. It is easy to be full of bitterness and even hatred towards the girl you loved as you begin to get over her, but such feelings won't do you or anybody else any good. If you find yourself filled with resentment and bile, remind yourself that she still has value as a human being, and that there were good reasons you fell for her. Don't deny her good qualities; just focus on accepting that you won't get to date her."
    },
    {
      "title": "Shift your focus.",
      "content": "Shift your focus. Now that you have faced your grief head-on and taken steps to give yourself space and time to heal, it is important to fill that space and time with other things. Think back to the amount of time you used to spend agonizing over your former crush. Make a rough guess of how many hours it cost you each week, and resolve to spend those hours doing something else. There will never be a better time to dream big and jump into a new project. Read a book you've been meaning to read, or even plan to write one of your own. Visit a new club or volunteer somewhere every Saturday. By broadening your horizons, you can remind yourself that the world is vast, strange, and beautiful, and it's never worth ignoring it all over one person."
    },
    {
      "title": "Open your eyes.",
      "content": "Open your eyes. There are pretty, friendly, funny, and smart girls everywhere. Make an effort to notice them all around you. Never forget that, as the saying goes, there are plenty of fish in the sea. Don't look for a new crush yet; just enjoy the diversity of attractive people you hadn't noticed before. Take some time to sit on a park bench with a friend and (quietly!) compare ratings of women who walk by on the street; check out the outfits women wear and be impressed by how many of them carefully coordinate their clothes and accessories. Just keep your mind on the multitude, rather than one girl."
    },
    {
      "title": "Leave the past behind.",
      "content": "Leave the past behind. As time passes and your grief segues to acceptance, you will find yourself reviewing your notes less and less. This is a sure sign that the time has come to finalize the process and move on for good. Store any art you created as a direct result of processing your earlier emotions. Put it away somewhere you won't see it unless you go looking for it. Years from now, you will be glad you kept it; for now, get it out of your sight. Consider taking your list or any other hastily-scrawled missives that you wouldn't count as artistic endeavors and getting rid of them. Burning papers is one option; striking all names with a pen and stuffing them into bottles to be released into the ocean is another. The act of physically sending your thoughts and feelings away from you can be very therapeutic. Look for a date. When you attend social events, try meeting new girls, or girls you haven't gotten to know very well. Go out with friends and meet their friends. If you meet a cute girl, consider asking her out to coffee right on the spot. Even if nine girls say no, the tenth could say yes, and it's a great way to prove to yourself that there is still a lot to look forward to in your romantic life."
    }
  ]
}