{
  "url": "https://www.wikihow.com/Drink-Vodka",
  "title": "How to Drink Vodka Straight or in a Cocktail",
  "steps": [
    {
      "title": "Pour chilled vodka into a shot glass to enjoy it straight.",
      "content": "Pour chilled vodka into a shot glass to enjoy it straight. When taking vodka as a shot, pour the drink right before you plan on shooting it. Ideally, take a shot with a pal at your side—that’s an essential part of vodka culture. [1] X Research source Ideally, chill the vodka so it’s around 48 to 50 °F (9 to 10 °C) come serving time."
    },
    {
      "title": "Sip vodka poured over ice.",
      "content": "Sip vodka poured over ice. Fill a rocks glass with a few ice cubes and pour in 2 fl oz (59 mL) of vodka overtop, along with a garnish like lemon zest. [2] X Research source Just keep in mind that a single serving of vodka is considered 1.5 fluid ounces (44 mL), so this goes slightly over that. [3] X Research source Feel free to experiment with other garnishes like mint sprigs or citrus slices."
    },
    {
      "title": "Try infused vodka for a more vibrant flavor palette.",
      "content": "Try infused vodka for a more vibrant flavor palette. If you’re not a fan of vodka’s minimal flavor, pick up an infused vodka the next time you’re at the liquor store. Vodka brands boast a variety of different infusions, including herbs, citrus fruits, and berries. [4] X Research source"
    },
    {
      "title": "Bloody Mary",
      "content": "Bloody Mary Blend a mixture of 3 c (710 mL) tomato juice, 3 US tbsp (44 mL) of lemon juice, 3 US tbsp (44 mL) of lime juice, 1 US tbsp (15 mL) of horseradish , 1 1 ⁄ 2 US tbsp (22 mL) of Worcestershire sauce , ¼ tsp (0.75 g) of garlic powder, 3 ⁄ 4 tsp (3.7 mL) of hot sauce, and 1 ⁄ 3 c (79 mL) of pickle juice. Add in ½ tsp (2 g) of black pepper and ¾ tsp (4.5 g) of celery salt before letting the mixture chill for a minimum of 2 hours. Divide the mixture into 6 glasses, with 1 fl oz (30 mL) of vodka in each glass. Add your desired veggie as a garnish (like a celery stick), and enjoy! [5] X Research source Serves: 6 Garnish: Veggie of your choice (e.g., celery, pickle, pickled okra, etc.)"
    },
    {
      "title": "Cosmopolitan",
      "content": "Cosmopolitan Pour 1 1 ⁄ 4 fl oz (37 mL) of vodka, 1 ⁄ 4 fl oz (7.4 mL) of Rose’s lime juice, 3 ⁄ 4 fl oz (22 mL) of Cointreau or triple sec, 2 fl oz (59 mL) of cranberry juice, and 1 cup of ice cubes into a cocktail mixer. Give everything a good shake before filtering it into a martini glass . [6] X Research source Serves: 1 Garnish: Lime twist"
    },
    {
      "title": "White Russian",
      "content": "White Russian Pour 1 1 ⁄ 2 fl oz (44 mL) of vodka, 3 ⁄ 4 fl oz (22 mL) of heavy cream, and 3 ⁄ 4 fl oz (22 mL) of Kahlua into an ice-filled cocktail shaker . After giving the mixture a good shake, filter it into an Old-Fashioned glass (chilled, if possible). [7] X Research source Serves: 1 Garnish: N/A"
    },
    {
      "title": "Long Island Iced Tea",
      "content": "Long Island Iced Tea Add 1 fl oz (30 mL) of vodka, 1 fl oz (30 mL) of white rum, 1 fl oz (30 mL) of white tequila, 1 fl oz (30 mL) of gin, and 2 fl oz (59 mL) of lemon juice to an ice-filled cocktail shaker. Mix everything together before pouring the entire drink (ice included) into 2 tall glasses. Fill the glasses the rest of the way with cola, and add a lemon slice for garnish. [8] X Research source Serves: 2 Garnish: Lemon slices"
    },
    {
      "title": "Screwdriver",
      "content": "Screwdriver Fill a high ball glass with 1 1 ⁄ 2 fl oz (44 mL) of vodka and 6 fl oz (180 mL) of orange juice, followed by 1½ cups of ice cubes. Give the drink a quick stir to make sure it’s all mixed together, and then garnish the rim with an orange slice. Serves: 1 Garnish: Orange slice"
    },
    {
      "title": "Moscow Mule",
      "content": "Moscow Mule Squeeze one lime half’s worth of juice into a copper mug , followed by the lime itself. Then, add in a handful of crushed ice, along with 2 fl oz (59 mL) of vodka and 4 fl oz (120 mL) of chilled ginger beer . Be sure to add a stirring stick before serving the drink. [9] X Research source Serves: 1 Garnish: Stirring stick"
    },
    {
      "title": "Kamikaze",
      "content": "Kamikaze Add 1 ⁄ 2 fl oz (15 mL) of lime juice, 1 ⁄ 2 fl oz (15 mL) of triple sec, and 1 ⁄ 2 fl oz (15 mL) of vodka to an ice-filled cocktail shaker. Give everything a good mix, and then filter it into a pre-chilled cocktail glass (or a short glass, alternatively). [10] X Research source Serves: 1 Garnish: N/A"
    },
    {
      "title": "Vodka Soda",
      "content": "Vodka Soda Pour 1 ⁄ 2 c (120 mL) of soda water and 1 ⁄ 4 c (59 mL) of vodka into an ice-filled glass. For a little extra zest, stir in a squeeze of lime juice, and garnish your glass with a lime slice. [11] X Research source Serves: 1 Garnish: Lime slice"
    },
    {
      "title": "Vodka Tonic",
      "content": "Vodka Tonic Pour 2 fl oz (59 mL) of vodka and 4 fl oz (120 mL) of tonic water into an ice-filled high ball glass. Mix in a squeeze of lime juice and a lime slice into the drink to finish things off. [12] X Research source Serves: 1 Garnish: Lime slice"
    },
    {
      "title": "Vodka Martini",
      "content": "Vodka Martini Mix 3 fl oz (89 mL) of vodka and 1 fl oz (30 mL) of dry vermouth together in glass with ice. Stir the ingredients together, and then filter them into a pre-chilled martini glass. For extra flair, add a spear of green olives for a garnish. Serves: 1 Garnish: Green olives"
    },
    {
      "title": "Vodka Gimlet",
      "content": "Vodka Gimlet In an ice-filled cocktail shaker, mix 1 fl oz (30 mL) of Rose’s lime juice and 2 fl oz (59 mL) of vodka together. Filter the drink into a martini glass and top it off with a lime slice. [13] X Research source Serves: 1 Garnish: Lime"
    },
    {
      "title": "Seabreeze",
      "content": "Seabreeze Add 1 1 ⁄ 2 fl oz (44 mL) of vodka, 1 fl oz (30 mL) of grapefruit juice, and 4 fl oz (120 mL) of cranberry juice together in a high ball glass. Add ice and a lime slice to finish off the drink. [14] X Research source Serves: 1 Garnish: Lime slice"
    },
    {
      "title": "Pink Greyhound",
      "content": "Pink Greyhound Mix 1 ⁄ 3 c (79 mL) of grapefruit juice, 1 ⁄ 3 c (79 mL) of vodka, and 1 tsp (4.9 mL) of grenadine together in a glass. Give the drink a good stir before enjoying. [15] X Research source Serves: 1 Garnish: N/A"
    },
    {
      "title": "Vodka Stinger",
      "content": "Vodka Stinger Add 4 1 ⁄ 2 fl oz (130 mL) of vodka and 3 fl oz (89 mL) of crème de menthe into an ice-filled cocktail shaker. Give the drink a good mix before filtering it into 2 martini glasses. [16] X Research source Serves: 2 Garnish: N/A"
    },
    {
      "title": "Godmother",
      "content": "Godmother Pour 2 fl oz (59 mL) of vodka and 1 fl oz (30 mL) of Amaretto into an ice-filled tumbler and mix them together. [17] X Research source Serves: 1 Garnish: N/A"
    },
    {
      "title": "Caipiroska",
      "content": "Caipiroska Muddle 2 tsp (8 g) of granulated sugar with 1 chopped-up lime in a tumbler glass. Then, add in a handful of crushed ice, along with 1.7 oz (50 mL) of vodka. Mix everything together, and then the drink is ready to go. [18] X Research source Serves: 1 Garnish: N/A"
    },
    {
      "title": "Cape Codder",
      "content": "Cape Codder Pour 2 fl oz (59 mL) of vodka into an ice-filled high ball glass, along with 4 fl oz (120 mL) of cranberry juice and half a lime’s worth of lime juice. Mix everything together, and then garnish the side of the glass with a lime slice. [19] X Research source Serves: 1 Garnish: Lime slice"
    },
    {
      "title": "Cherry Vodka Sour",
      "content": "Cherry Vodka Sour Pour 3 fl oz (89 mL) of vodka, 3 fl oz (89 mL) of sweet and sour mix , and 1 US tbsp (15 mL) of grenadine into an 8-oz glass. Stir everything together before adding in a few ice cubes and a cherry for garnish. [20] X Research source Serves: 1 Garnish: Cherry"
    },
    {
      "title": "Lemon Drop Martini",
      "content": "Lemon Drop Martini Combine 1 1 ⁄ 2 fl oz (44 mL) of vodka, 1 ⁄ 2 fl oz (15 mL) of triple sec, 3 ⁄ 4 fl oz (22 mL) of lemon juice, and 1 tsp (4 g) of fine sugar in an ice-filled cocktail shaker. Shake up the mixture and filter it into a chilled martini glass with a sugar rim and lemon twist garnish. [21] X Research source Serves: 1 Garnish: Lemon twist"
    },
    {
      "title": "Mudslide",
      "content": "Mudslide Blend 8 cups of ice, 3 ⁄ 4 c (180 mL) of vodka, 3 ⁄ 4 c (180 mL) of coffee liqueur, and 3 ⁄ 4 c (180 mL) of Irish cream liqueur together. For extra flavor and style, garnish the inside of 6 tumblers with chocolate syrup before serving the drinks. Then, finish off each drink with a sprinkle of cinnamon and a cherry [22] X Research source Serves: 6 Garnish: Ground cinnamon and cherries"
    },
    {
      "title": "Sausage",
      "content": "Sausage If you’re looking to follow Polish tradition, reach for a plate of sausage as you're sipping (or shooting) some vodka. Veal sausage is a great option, but feel free to experiment with other types of Polish treats like blood sausage or Krakowska (if they’re available in your area). [23] X Research source Slavic nations like Poland feature hearty “zakąski” (small plates/appetizers) as part of their food culture, which are often enjoyed with vodka. [24] X Research source"
    },
    {
      "title": "Shellfish",
      "content": "Shellfish Some vodka connoisseurs enjoy a shellfish-based appetizer (like oysters) with a serving of vodka, finding that the flavors complement one another well. [25] X Research source If you’re in the mood to splurge, consider ordering some caviar to go with your vodka. While not technically shellfish, it and vodka are a match made in heaven (especially if you’re in Russia)."
    },
    {
      "title": "Fermented or pickled food items",
      "content": "Fermented or pickled food items Some people find that the sour flavors of pickled/fermented snacks (e.g., sauerkraut, pickles, etc.) go super well with the sharp, clear tones of vodka. [26] X Research source"
    },
    {
      "title": "Vodka can be made with a variety of different raw ingredients.",
      "content": "Vodka can be made with a variety of different raw ingredients. At its core, vodka is watered-down ethanol. [27] X Research source Said ethanol is made courtesy of cereal grains, potatoes, and even ingredients like grapes or beets. [28] X Research source During the distillation process, the ethanol produced sits at a decently high ABV, like 40% (or somewhere in the high 30s). [29] X Research source With that being said, vodka can have a variety of different additives during the production process, including sugar and citric acid. [30] X Research source Did you know? When you make vodka at home , you’ll likely produce methanol in the process, a substance that’s extremely dangerous to consume. [31] X Research source"
    },
    {
      "title": "Vodka has historical ties to Russia and Poland.",
      "content": "Vodka has historical ties to Russia and Poland. While vodka may be stereotypically associated with Russia, Poland plays an equally important hand in its conception and creation—after all, historians aren’t entirely sure which country was the first to whip up the very first batch of it. [32] X Research source Historically, Russia can be credited with developing the charcoal-based filtration system used to further process and purify vodka (with their first “official” batch being produced in the mid-18th century), while Poland is well-regarded for processing potatoes into batches of the good stuff (though Poland’s vodka-filled legacy can be traced back to at least the 15th century). [33] X Research source In as early as the 9th century, Russian monks brewed a spirit that could be categorized in the vodka family. [34] X Research source"
    },
    {
      "title": "Vodka made a splash in the United States in the early 20th century.",
      "content": "Vodka made a splash in the United States in the early 20th century. Before World War II (which occurred in the late 1930s to mid-1940s), vodka had established itself as a popular drink, mostly in Eastern Europe. Beyond World War II, however, vodka gained popularity in the United States (along with other parts of Europe). [35] X Research source Vodka has become an appealing ingredient option for cocktails, since it doesn’t boast an especially robust taste. [36] X Research source"
    }
  ]
}