{
  "url": "https://www.wikihow.com/Crochet-Ruffles",
  "title": "How to Crochet Ruffles",
  "steps": [
    {
      "title": "Make a single crochet border around the edge of your piece.",
      "content": "Make a single crochet border around the edge of your piece. Get out the blanket, skirt, or item that you want to add the ruffle to and look at the edging. If it doesn't have a single crochet border, work a quick one so you have something to attach the ruffles to. [1] X Research source If your item already has a single crochet border, skip this step. You can crochet ruffles onto a rounded edge or straight edges that have corners."
    },
    {
      "title": "Join yarn to your item.",
      "content": "Join yarn to your item. Decide if you want to use the same color yarn as your piece or if you'd like a contrasting color that stands out. Make a slip knot in either color and slide it onto your crochet hook. Push the hook into the single crochet stitch where you want to start working the ruffles and pull the yarn through the loop to secure it. [2] X Research source If you're working on a square item, start at a corner. To begin on a round item, you can pick any spot to begin."
    },
    {
      "title": "Make 2 double crochets (DC) into every stitch around your piece.",
      "content": "Make 2 double crochets (DC) into every stitch around your piece. Work a double crochet stitch into the stitch that you just inserted your hook into. Then, put your hook back into the same stitch and make another double crochet stitch. Repeat this for every stitch of your item. [3] X Research source"
    },
    {
      "title": "Chain 3 stitches if you reach a corner.",
      "content": "Chain 3 stitches if you reach a corner. If you're crocheting something with corners, keep the corners defined. Double crochet into every stitch until you reach the corner. Then, double crochet into the corner stitch and make 3 chain stitches before you double crochet into the same stitch. [4] X Research source This makes a small gap in the corner that helps it keep its shape. If you're crocheting ruffles onto something that's curved, keep crocheting until you come back around to the starting point."
    },
    {
      "title": "Slip stitch to join when you reach your starting point.",
      "content": "Slip stitch to join when you reach your starting point. Once you finish your first ruffled row, insert your hook into the first stitch and wrap your yarn around the hook. Pull the hook through both of the loops to join the row. [5] X Research source If you want a very slight ruffle, you could cut the yarn and tie off the edge or keep crocheting rows for a larger ruffle."
    },
    {
      "title": "Chain 1 stitch and single crochet into every stitch for row 2.",
      "content": "Chain 1 stitch and single crochet into every stitch for row 2. Work a single crochet stitch into each of the ruffled stitches that you just made. This makes a frilled, gathered effect as you crochet around the piece. [6] X Research source"
    },
    {
      "title": "Make another double crochet row for an exaggerated ruffle.",
      "content": "Make another double crochet row for an exaggerated ruffle. It's up to you how frilly you'd like the ruffle to be. For a more noticeable ruffle, slip stitch to join the row and make 2 double crochet stitches into every stitch of your piece. [7] X Research source Remember to chain 3 stitches if you're adding a ruffle to corners."
    },
    {
      "title": "Make up to 6 double crochet stitches into each stitch for a fuller ruffle.",
      "content": "Make up to 6 double crochet stitches into each stitch for a fuller ruffle. Although most patterns call for working a single or double crochet stitch into each stitch of your edge, you can work as many stitches as you like. Keep in mind that the more stitches you work, the tighter the ruffle will be. [8] X Research source For example, make 3 double crochet stitches into each stitch for a packed ruffle."
    },
    {
      "title": "Add an extra layer of ruffles for a frillier look.",
      "content": "Add an extra layer of ruffles for a frillier look. Instead of double crocheting into the gap of each stitch, insert your hook into the back loop only. Then, work the simple ruffle around your piece. This makes a bottom layer of ruffles. To make a top layer of ruffles, go back around the edge of your piece, but crochet into the front loops. [9] X Research source This works well for larger projects, such as afghans, where you have more space to work."
    },
    {
      "title": "Use different colors for your rows of ruffles for a bright effect.",
      "content": "Use different colors for your rows of ruffles for a bright effect. Use a bold, contrasting color of yarn if you'd like the ruffles to really stand out from the main piece. For an even brighter piece, switch the yarn color for each row you work. Tie off the yarn and switch to a new color when you reach a corner or the end of a row. [10] X Research source"
    }
  ]
}