{
  "url": "https://www.wikihow.com/Find-Hidden-Rooms-in-the-Binding-of-Isaac:-Rebirth",
  "title": "How to Find Hidden Rooms in the Binding of Isaac: Rebirth",
  "steps": [
    {
      "title": "Start a game.",
      "content": "Start a game."
    },
    {
      "title": "Clear every room on the levelDo this by defeating all the hostiles in every room",
      "content": "Clear every room on the levelDo this by defeating all the hostiles in every room You do not have to enter the store to clear the whole level. The store is the room with a lock You do not have to defeat the boss (room with a skull)"
    },
    {
      "title": "Look for a \"hole\" on the level that is surrounded by 3-4 other roomsThis \"hole\" looks like a room, and it is.",
      "content": "Look for a \"hole\" on the level that is surrounded by 3-4 other roomsThis \"hole\" looks like a room, and it is. It may not always be surrounded by 3-4 rooms. It could be adjacent to 1-2 rooms, which is not as common, but is possible The secret room must be accessible by all of the rooms connected to it. The spot where the door should be will not be blocked by a rock, or a hole on the ground"
    },
    {
      "title": "Place a bomb where the door should bePlace a bomb with “E”.",
      "content": "Place a bomb where the door should bePlace a bomb with “E”. The door is always in the middle of the room. unless the room is a large room. In that case, divide the room in half, and place the bomb in the middle of that half"
    },
    {
      "title": "Step away from the bomb.",
      "content": "Step away from the bomb. This is to ensure you do not take any damage from it."
    },
    {
      "title": "Enter the hole that you blew in the wall.",
      "content": "Enter the hole that you blew in the wall. This should be the entrance into the secret room. If there is no hole, then there isn't a secret room there. Try again at another spot. Note that not every level will have a secret room"
    },
    {
      "title": "Clear all levels of the game.",
      "content": "Clear all levels of the game. You need to do this before looking for secret rooms."
    },
    {
      "title": "Go to the room next the boss room.",
      "content": "Go to the room next the boss room. The super secret rooms are most likely to be located in these areas."
    },
    {
      "title": "Place a bomb by one of the walls where a door should be.",
      "content": "Place a bomb by one of the walls where a door should be. Click “E”. There isn't a specific way to know where to bomb. The super secret room could be found on any side of the room before the boss room. It will not, however, be directly next to the boss room"
    },
    {
      "title": "Step away from the bomb before it goes off.",
      "content": "Step away from the bomb before it goes off. This is to ensure that no damage is taken."
    },
    {
      "title": "Enter the hole you blew in the wall.",
      "content": "Enter the hole you blew in the wall. This should be the entrance to the super secret room. If there is no hole, then there isn't a super secret room there. Try one of the other walls."
    }
  ]
}