{
  "url": "https://www.wikihow.com/Cure-Scabies",
  "title": "How to Cure Scabies",
  "steps": [
    {
      "title": "Recognize the signs of scabies.",
      "content": "Recognize the signs of scabies. Any case of severe itching that lasts weeks or months could result from scabies. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Signs of scabies include: Intense itching, especially at night. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Small red bumps (they may be pimple-like) appear on the skin like a rash. The rash can be on the whole body or limited to certain areas. Common places include the wrist, armpit, elbow between fingers, genital area, waist, and beltline. The rash can also have small blisters. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Small burrow lines between the bumps. They are typically light gray and slightly raised. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Norwegian scabies, or \"crusted scabies,\" is a particularly severe form. Signs of crusted scabies include thick crusts on the skin that crumble easily and may appear greyish. They contain hundreds of thousands of mites and eggs. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Crusted scabies is rare and typically seen in patients with suppressed immune systems Be particularly vigilant of these symptoms if you have been in contact with anyone infected with scabies."
    },
    {
      "title": "Visit the doctor.",
      "content": "Visit the doctor. It is important that you visit your doctor. Over-the-counter and home remedies will not treat the infestation completely. [7] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The doctor will usually only need to see the rash to diagnose the condition. He might also take a sample by scraping under the bumps and looking for the presence of mites, eggs, and feces under the microscope. Be sure to tell your doctor if you are pregnant or have any problems such as serious illness, or other severe skin diseases. Everyone that has come into contact with a patient diagnosed with scabies should also be evaluated by a doctor. [9] X Expert Source Lydia Shedlofsky, DO Dermatologist Expert Interview. 30 September 2020."
    },
    {
      "title": "Treat the itch yourself while you wait.",
      "content": "Treat the itch yourself while you wait. If your itching is severe, you may want to treat it on your own while waiting for your doctor's appointment or prescription. Soaking in cold water or applying calamine lotion may provide relief from itching. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also use over-the-counter oral antihistamines, such as cetirizine (Zyrtec), diphenhydramine hydrochloride (Benadryl)."
    },
    {
      "title": "Get a prescription.",
      "content": "Get a prescription. Once diagnosed, your doctor will usually prescribe a mite-killing cream or lotion containing five percent Permethrin. Always follow your doctor's and pharmacist's instructions exactly when using the cream. Permethrin is topically applied and has a few side effects such as burning/stinging and itching. [11] X Research source Permethrin only kills mites and not ova (eggs), so a second application is necessary for treatment. Two applications at least one week apart (this is how long it takes an egg to hatch) is the minimum treatment required to make sure it is eradicated. For people with a severe infestation and weakened immune system, doctors may prescribe Ivermectin as an oral treatment. Ivermectin is an oral medication. It is generally used for crusted scabies and taken as a single one-time dose. Some doctors may prescribe a second dose after one week. Side effects of Ivermectin include fever/chills, headache, loss of appetite, joint pain and rash. [12] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Your doctor may prescribe other creams instead of the Permethrin. These include Crotamiton 10%, Lindane 1%, or sulfur 6%. These are less common, and are used if a patient has failed treatment with Permethrin or Ivermectin. Treatment failure is frequent with Crotamiton. Side effects of Crotamiton include rash and itching. Lindane is toxic if overused or misused. Side effects of Lindane include seizures, and rash. [13] X Research source"
    },
    {
      "title": "Ask about herbal remedies.",
      "content": "Ask about herbal remedies. Several herbs are traditionally used for treating scabies. There is little proof that these remedies are effective — most evidence is anecdotal, or people saying they were helpful, but there is no scientifically backed evidence to support their use. Currently the only proven remedy is prescription medication. Do not rely on these treatments alone. Talk to your doctor before trying any herbal remedies, including the following: Devil's horsewhip or prickly chaff flower ( Achyranthes aspera ) [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Neem ( Azadirachta indica ) [15] X Research source Karanja ( Pongamia pinnata ) [16] X Research source Turmeric ( Curcuma longa ) Blue gum or camphor oil (Eucalyptus globulus) [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Fig bark powder ('Ficus carica, Ficus racemosa, Ficus benghalensis ) [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Shower and towel-dry your body using a fresh, clean towel.",
      "content": "Shower and towel-dry your body using a fresh, clean towel. Wait a while for your body to cool down some from the shower before applying your medication. [19] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Apply the prescription cream or lotion.",
      "content": "Apply the prescription cream or lotion. Unless a medical professional advised you otherwise, start behind the ears and from the jawline and work your way down. Apply using cotton wool swabs, a paintbrush, a sponge, or any item supplied with the treatment for the purpose. Continue rubbing the cream downward, over your entire body. [20] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Avoid the eyes, nose, and mouth area, but apply everywhere else. You must cover your genitals, soles of your feet, between your toes, back, and buttocks. Get help for areas you're not able to reach yourself. After covering your body, take care of your hands. Apply between the fingers and under your nails. You will need to reapply the cream to your hands every time you wash them."
    },
    {
      "title": "Wait.",
      "content": "Wait. Leave the lotion or oil on your body for the amount of time directed. This is usually between eight to 24 hours. The length of time you'll need to leave the medication on your skin will depend on the product and your doctor's instructions."
    },
    {
      "title": "Shower",
      "content": "Shower off the cream or lotion. Once the allotted time is up, wash off the medication under a warm shower. [21] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Be aware that you may remain itchy for a few weeks after the treatment. This is because your allergic reaction to the mites continues while the dead mites bodies remain in the skin. If it's concerning you, speak with your doctor again."
    },
    {
      "title": "Treat everyone in the house.",
      "content": "Treat everyone in the house. All household members need treatment on the same day, even if they aren't showing signs of scabies. This will prevent reinfestation. [22] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Don't forget visitors to your house. This includes family members staying for any length of time, babysitters, and other visitors."
    },
    {
      "title": "Repeat as directed.",
      "content": "Repeat as directed. The cream is usually one application with a repeat application after seven days. But, this will depend on your doctor or pharmacist's instructions. Be sure to follow the prescription. You'll probably have a check-up visit in a few weeks to address your progress. [23] X Research source You're not done yet. Cleaning your house the same day you use the treatment is vital for preventing a new infestation. [24] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Keep reading for instructions."
    },
    {
      "title": "Clean the house",
      "content": "Clean the house . To prevent reinfestation after treatment, it's vital to thoroughly clean your home the same day you applied the treatment. A scabies mite can live for one to three days off the body. [25] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Cleaning will ensure that remaining mites are killed. Disinfect the floor and bathroom surfaces by mopping (you only need to do this after the first treatment). Vacuum floors, carpets, and rugs. Dispose of the bag or contents in an outside trash can immediately and dispose of as quickly as possible. [26] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Bleach the mop after each clean. If you can steam clean the carpet."
    },
    {
      "title": "Wash all towels and bedding in hot water.",
      "content": "Wash all towels and bedding in hot water. Wash bedding daily until you’ve not seen new bumps for at least a week. [27] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wear disposable gloves when stripping beds. If you have a heavy comforter, you can place it in an airtight bag for 72 hours. [28] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Dry clothing and bedding in a hot dryer or on the clothesline in hot weather under direct sunlight. Dry cleaning is also appropriate. Put blankets in the dryer before bed every night until you're certain the infestation has ceased."
    },
    {
      "title": "Wash your clothes daily.",
      "content": "Wash your clothes daily. Store clothes that you cannot wash in the airtight bag for 72 hours to one week. [29] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source The same approach will work for stuffed animals, brushes, combs, shoes, coats, gloves, hats, robes, wetsuits, etc. Vacuum bags are widely available that are airtight and take up little space. Bag all clothing the moment you remove it."
    },
    {
      "title": "Reassess after six weeks.",
      "content": "Reassess after six weeks. If you're still itching after six weeks, this can indicate that the treatment has not worked. See your doctor for more advice and new treatment options."
    }
  ]
}