{
  "url": "https://www.wikihow.com/Deal-With-Competitive-People",
  "title": "How to Deal With Competitive People",
  "steps": [
    {
      "title": "Acknowledge their accomplishments.",
      "content": "Acknowledge their accomplishments. Often competitiveness stems from a place of insecurity. If a person is bragging about their work, family, or some other part of their life, give them the praise they are seeking. If you give in, you may find that some of the competitiveness stops. [1] X Research source In addition, you may find that the praising the person helps them see you as a friend rather than as a competitor. [2] X Research source"
    },
    {
      "title": "Ignore them.",
      "content": "Ignore them. One strategy you can employ, especially at work, is to ignore the person. Pay attention to what you need to do, and continue working hard. If you enter the person's game of one-upping each other, you're only egging the person on. [3] X Research source"
    },
    {
      "title": "Equalize the playing field.",
      "content": "Equalize the playing field. If someone is always taking over meetings to show how much better he or she is, suggest a way to even the playing field. For instance, maybe you could set a time limit for how long each person talks. In turn, maybe you could encourage a way for every person to share ideas, such as going down the table at meetings to see who has ideas, rather than just letting it be a free-for-all. [4] X Research source"
    },
    {
      "title": "Try to calm down.",
      "content": "Try to calm down. Getting angry at the situation will not help. When you find yourself getting mad, take a few deep breaths to calm yourself. Once you're calm, try to figure out how you can make the situation better. Giving in to anger may only egg the competitive person on. [5] X Research source"
    },
    {
      "title": "Defend yourself.",
      "content": "Defend yourself. If a competitive person is trying to attack you, you are well within the realm of decorum to defend yourself. If possible, have a way to back up what you are saying. [6] X Research source For instance, if a coworker tries to steal an idea, bring up emails that show you had the idea first. [7] X Research source"
    },
    {
      "title": "Find common goals.",
      "content": "Find common goals. Another way to convert competitive people to allies and build a cooperative environment is to look for ways to work together. [8] X Expert Source Jessica George, MA, CHt Certified Professional Master Life Coach Expert Interview. 11 February 2022. If you happen to find another parent at your kid's school too competitive, you could try finding a project you can work on together, such as building a better library. [9] X Research source For instance, you could say, \"I see we both care deeply about our kids' education. What would you think about working on a library book drive together to improve their educational environment?\""
    },
    {
      "title": "Build networks.",
      "content": "Build networks. When you're dealing with a competitive person at work, it can make you feel isolated and frustrated. Be sure to work towards building friendships with other people in your office, the ones who aren't trying to compete with you. By being yourself and working hard, you will find that people will realize your value, despite the fact that someone is always trying to look better than you. Additionally, building networks helps the whole environment, making it more cooperative and team-focused. [10] X Research source Besides helping people value you, building friendships can help give you the support you need when you have a competitive person in your life."
    },
    {
      "title": "Introduce new people.",
      "content": "Introduce new people. When new people arrive on the job, make sure you go over and introduce yourself. You can take it even further by introducing that person around to other people in your department. That way, the person already starts to get to know people and doing so promotes good working relationships. [11] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you can, try to go beyond just \"Hello!\" and \"Welcome to the company!\" [12] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Value diverse opinions.",
      "content": "Value diverse opinions. In a workplace environment, it can be easy to shut out opinions that don't conform to the majority. However, often dissenting opinions can help make a project better. Try to encourage others to speak up, and if someone gets shut down, take it upon yourself to defend the person. [13] X Research source"
    },
    {
      "title": "Work on trust.",
      "content": "Work on trust. Like most relationships, work relationships are built on trust. Just like those other relationships, building trust takes work and time. However, doing so can help make your workplace more cooperative. Tell the truth. [14] X Expert Source Jessica George, MA, CHt Certified Professional Master Life Coach Expert Interview. 11 February 2022. Being honest about your work helps to build trust with others. Do what you say you're going to do. Another way to build trust is to first say what you will do, and then follow through with it. Work towards the benefit of the group. Not only will this step help thwart the competitive people, it will also help create an environment of cooperation. That is, instead of always looking for personal acclaim through the work you do, make sure you are trying to make your team or the company as a whole shine."
    },
    {
      "title": "Work against negativity.",
      "content": "Work against negativity. Your brain is wired to think negative thoughts at times, even when the situation doesn't warrant it. Meaning, your brain may be thinking that everyone in the office is against you because someone made a small comment. However, it's more likely that most people find you a likable person, even if one person made a negative comment about you. Think about all the things people have said in the past that have been positive to help balance it out. [15] X Research source Confidence can drive a competitive person crazy. If the person is insecure, your confidence will throw the person off his or her game. If the person is simply narcissistic, the person will likely respect you more for your confidence. [16] X Research source"
    },
    {
      "title": "Tell yourself you can do it.",
      "content": "Tell yourself you can do it. Self-affirmation is a technique that many people use to build confidence. One way you can employ this technique is to pick an affirmation statement and repeat it as you look yourself in the mirror every morning, such as \"I'm a good person who is capable and strong.\" You can also use similar mantras to psych yourself up before big events, such as meetings."
    },
    {
      "title": "Show yourself your good qualities.",
      "content": "Show yourself your good qualities. Set aside some time to make lists about yourself. Focus on your achievements and strengths. You can also make a list of what you like about yourself. Use these list to boost your confidence when you're feeling down. [17] X Research source For instance, under achievements, you could write things like, \"Got a degree,\" \"Have an awesome job,\" and \"Have an amazing family.\" Under strengths, you could write \"pays attention to detail,\" \"is good at communicating with others,\" and \"does well on a team.\" Under things you like about yourself, you could write things such as \"I am always willing to help out\" or \"I make time for my family.\""
    },
    {
      "title": "Put on a brave face.",
      "content": "Put on a brave face. Half of being confident is acting confident. As you smile and hold your head up, you'll start to actually feel the confidence you're trying to fake. In other words, even if it feels weird, faking confidence builds confidence. [18] X Research source That also means projecting your voice. Speaking soft or mumbling doesn't exude confidence."
    },
    {
      "title": "Push yourself.",
      "content": "Push yourself. When you always do the same things every day, you may find that you start feeling just a bit too comfortable. Pushing yourself to do new things, even small ones, can boost your confidence. Talk to someone you've been meaning to introduce yourself to. Go to that new Ethiopian restaurant across town. Sing at a karaoke night. All these little instances add up to make you more confident. [19] X Research source"
    },
    {
      "title": "Dress the part.",
      "content": "Dress the part. Dressing the part doesn't mean you need to dress like everyone else. Rather, it means that you need to find clothes that make you feel good about yourself. While you need to think about the clothing being appropriate for the situation, finding clothes that make you happy can boost your confidence. [20] X Research source"
    },
    {
      "title": "Be prepared.",
      "content": "Be prepared. Whatever the situation, try to prepare ahead of time. Giving a presentation in a meeting? Do the research you need to do, and practice your speech. Going to a new building for work? Find it ahead of time so you know where you're going. Being prepared gives you confidence, since you know you've done what you can to face any bumps in the road. [21] X Research source"
    }
  ]
}