{
  "url": "https://www.wikihow.com/Cool-Beers-Without-a-Fridge",
  "title": "How to Cool Beers Without a Fridge",
  "steps": [
    {
      "title": "Cool beers with cold water.",
      "content": "Cool beers with cold water. This is one of the fastest ways to lower the temperature of a beverage, and you can do it indoors or outdoors. Completely submerge the surface of your beer container in cold water; the colder, the better. If the water is icy, you should be able to sufficiently cool a beer from room temperature to \"party cold\" within five minutes. The process might take somewhat longer if you're outdoors, or if the water is warmer. If you're indoors: Dunk the beers in a bucket of ice water, or run them under a cold tap for a few minutes. If you're outdoors: Submerge the beers in a natural water source – a river, a spring, a lake, or an ocean. Make sure to secure the beers so that they don't sink or drift away."
    },
    {
      "title": "Give the beer a cold \"bath\".",
      "content": "Give the beer a cold \"bath\". Fill a bucket, a bathtub, a cooler, or any large, watertight container with the coldest water that you can find. Supplement with ice, if possible. After you're done, try re-purposing the water: water your lawn, or your garden, or fill a pet's water bowl. Place your drinks in the ice water solution and rapidly stir them all around for 2-5 minutes. By stirring, you're using forced convection to speed the transfer of heat out of your drink and into the ice water solution. Add as much ice to the water as you can, but not so much that it prevents the entire beverage container from being submerged into the water. A 50/50 mix of ice and water is a good rule of thumb. The thicker and better-insulated the container, the better. Seal the container off from the air to retain even more of the chill. This way, the ice will melt more slowly."
    },
    {
      "title": "Add table salt to the ice.",
      "content": "Add table salt to the ice. A small handful should do the trick. Salt lowers the freezing temperature of the water – which means that the water can get colder than the normal freezing temperature (32 degrees Fahrenheit or 0 degrees Celsius) without turning into ice."
    },
    {
      "title": "Run the faucet.",
      "content": "Run the faucet. If you have access to a sink, you can cool beers quickly. Hold the beer under the faucet and run a steady stream of cold water over the container. You should be able to cool a beer within five minutes. Save the runoff water in a bucket so that you can re-purpose it. If you don't have a sink, you can use a shower, a bath spigot, or any other water source. Don't waste water. Save the runoff water in a bucket, then using it to wash dishes or water plants. Running the tap for five minutes just to cool beer is incredibly wasteful."
    },
    {
      "title": "Submerge the beers in a body of water.",
      "content": "Submerge the beers in a body of water. Find a cold and accessible body of water: a river, a lake, a spring, a sea. Rig up a system to keep the beers from sinking or drifting. Tie the beers into a net or bag; string them together with rope; push them into the sand at the bottom; wedge them between roots, rocks, or kelp. If you cool your beers in running water, make sure to tie them to the bank, a boat, or yourself so that they aren't swept downstream. Don't use hot water sources, such as hot springs or geysers. This is intuitive, but perhaps bears mention. If there's a cold rain outside, try leaving the beers out where they'll catch the brunt of the elements. This may not cool them as effectively as a full submersion, but it should do the trick in time."
    },
    {
      "title": "Stick your beers in the snow.",
      "content": "Stick your beers in the snow. If there's snow on the ground, simply wedge your beers into the snow and wait half an hour. If it's cold out—say, below 40 degrees—but there is no snow, you can still put the beers outside to cool. Try to leave them in the shade, not the direct sunlight. If the snow is deep enough, wedge the beers beneath the surface so that they cool more quickly. If you leave beers beneath the surface of the snow, make sure that you mark the spot so that you don't forget where you've left them. Otherwise, you may be doomed to drink warm beers in the springtime."
    },
    {
      "title": "Try chilling your beers with evaporative cooling.",
      "content": "Try chilling your beers with evaporative cooling. The concept: you will put the beers inside a clay pot, insulated by a layer of sand and a larger clay pot. Cover the top of the pot with a cold, wet towel. As the water evaporates, it cools the inside of the container. After an hour or two, you can put the beers inside and let them cool! You can use this method even on very hot days – you may be able to cool the inside of the pot to more than 40 degrees below the outside temperature. [1] X Research source In a pinch, you can use smaller-scale evaporative cooling. Soak a towel, newspaper, or toilet paper with cold water, then wrap the beer inside. As the water evaporates, the beer should slowly cool. [2] X Research source"
    },
    {
      "title": "Find two clay pots.",
      "content": "Find two clay pots. One should be large enough to hold 2-5 beers at once; the other should be large enough to hold the first pot with at least a half-inch of clearance on each side.Plug the bottom of each pot with clay, putty, cork – anything that will help retain the sand. If you must use plastic pots (or another material), then you may. Bear in mind that clay is a better insulator, so a \"clay pot fridge\" will be more effective. [3] X Research source"
    },
    {
      "title": "Insulate with sand.",
      "content": "Insulate with sand. You can use any sort of sand, although fine-grit river sand (as opposed to less dense sand with bigger grains) will insulate best. Fill the bottom inch of the largest pot with sand, then place the smaller pot inside. Carefully fill the space between the two pots until it is completely packed with sand. It's okay if you spill a bit of sand in the bottom of the smaller pot."
    },
    {
      "title": "Wet the sand.",
      "content": "Wet the sand. Carefully pour icy-cold water into the gap between the two pots, all the way around. Let the water soak into the sand, but do not use so much water that it pools on top. You want the sand to be damp, but not muddy."
    },
    {
      "title": "Place the beers inside.",
      "content": "Place the beers inside. Once the inside of the pot-fridge has sunk below about 50 degrees, you're ready to start cooling your beers. You might need to wait a few hours on a hot day, or a matter of minutes on a cold day. Check the beers every hour or so, but no more frequently."
    },
    {
      "title": "Place a wet towel over the top.",
      "content": "Place a wet towel over the top. Thoroughly soak a towel with cold water, then wring it out so that it isn't sopping. Drape the towel taut across the rims of the two pots, and make sure that it covers the entire opening. Now, your \"clay pot fridge\" is complete. As the water evaporates from the sand and the towel, it will cool the interior of the pot. Leave the contraption to sit for a few hours before you place the beers inside. Once they're cold, they're ready to drink! If you need to cool your beers quickly, then it's okay to put the beverages inside immediately. Bear in mind, however, that the interior may cool more quickly without the beverages taking up space – and that the process will still not be immediate. Re-soak the towel with icy water as needed. As long as it's damp, you should be okay. If you move the towel, don't leave the \"fridge\" open for long, or else you'll lose all of the cool air. Consider leaving a thermostat inside the pot. This will help you gauge how well your \"fridge\" is working, and it will give you a clue about when to insert the beers."
    },
    {
      "title": "Consider burying your beers in cool, moist soil.",
      "content": "Consider burying your beers in cool, moist soil. This method isn't as fast as the others, but it can keep bottles cool for long periods of time. This may be especially effective if it's a warm and sunny day. It's less messy if your containers are large, and it helps keep your beers chill if you're moving them from other cold storage."
    },
    {
      "title": "Find a spot of cool, moist earth.",
      "content": "Find a spot of cool, moist earth. Look in the shade, not the beating sun. Try to bury your beers along the shore of a river, a lake, or a sea – but be careful if the tide is coming in. The wetter the soil, the better. You can also pour water onto the ground to keep it moist. This may be the best choice if there is no body of water around, and you have water to spare,"
    },
    {
      "title": "Bury the beers.",
      "content": "Bury the beers. Dig a hole that's large enough for the beer container. Bury it up to the cap or lid; in general, deeper is cooler. Consider leaving the cap or lid exposed to keep it from getting dirty. If you bury the beers completely, make sure that you don't forget where you left them!"
    }
  ]
}