{
  "url": "https://www.wikihow.com/Find-Divorce-Records",
  "title": "How to Look Up Divorce Records: Your Questions Answered",
  "steps": [
    {
      "title": "Go to your state’s vital records site and conduct a search.",
      "content": "Go to your state’s vital records site and conduct a search. Unfortunately, there is no single site you can search to find divorce records. Go to the public or vital records website for the state where the divorce took place. If you can’t find the page to search for divorce records, check the county records website as well. [1] X Research source You can visit the CDC’s vital records directory to find your state’s record office’s address. You can normally do this online, over the phone, or in person at the local public records office. [2] X Research source Some states, like Washington, call their divorce records “divorce certificates” or “certificates of dissolution.” These are almost always the same thing, though. [3] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source"
    },
    {
      "title": "You’ll need both spouses’ full names and the state of the divorce.",
      "content": "You’ll need both spouses’ full names and the state of the divorce. You may need to research a bit if you don’t have both names and the location where the divorce took place. Can you ask someone who knew the couple? If not, search online to find as much as you can. You cannot typically pull the divorce records if you don’t know who you’re looking for. [4] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source If you do not know which state to contact, you can always try pulling records from multiple states to see if you get any hits. Keep in mind, you may need to use someone’s maiden name if the name was changed before the divorce was finalized. It differs from state to state, but you normally don’t need to know the specific date of the divorce. However, you do typically need to choose a year for your search to help the state narrow the search down."
    },
    {
      "title": "No, there is almost always a small fee to pull the records.",
      "content": "No, there is almost always a small fee to pull the records. Sorry to say that there’s no free way to do this. While it isn’t expensive, you will need to pay a little bit. Typically, states and counties will charge something like $15-25 flat per record. However, many states and counties will charge $1-3 per page (expect the divorce record to be 5-15 pages). [5] X Research source Do not trust any third-party website that claim they’ll pull records for free. These sites almost always waste your time and lock “results” behind a paywall. Only use official government pages to conduct your search."
    },
    {
      "title": "It will typically cost more to obtain certified divorced records.",
      "content": "It will typically cost more to obtain certified divorced records. Certified divorce records are stamped by the government that produced the records to confirm that the information is accurate. You may need to use certified copies for loan applications, official documents, or if you need to prove you’re divorced to a court. Expect to spend $25-50 flat, or $5-10 per page on certified copies. [6] X Research source"
    },
    {
      "title": "Yes, divorce records are normally public if they aren’t sealed.",
      "content": "Yes, divorce records are normally public if they aren’t sealed. Judges can seal divorce records if they so choose, which makes the records inaccessible. [7] X Research source This happens when a judge believes there’s a convincing reason for the records to be private, either on their own or because someone has petitioned the court and made a convincing argument. [8] X Research source A judge might seal dissolution status records if there is domestic abuse, to protect the identity of a public figure, or if record of the divorce would cause significant financial damage."
    },
    {
      "title": "It depends on the state and county laws, but usually, yes.",
      "content": "It depends on the state and county laws, but usually, yes. Typically, anybody can request a copy of divorce records for any reason they’d like. [9] X Research source However, in some areas, the only people allowed to pull divorce records are the spouses involved in the dissolved marriage, or people with a court order to acquire those records. [10] X Research source “Public” does not always mean “anyone can view it,” just that there is a government record of something happening (sort of like arrest records, or birth certificates)."
    },
    {
      "title": "No, only the divorce decree includes the terms of a divorce.",
      "content": "No, only the divorce decree includes the terms of a divorce. A divorce record is normally just a few sheets of paper that basically explain, “Yes, these two people are divorced. Here’s where and when it happened.” A divorce decree contains the details surrounding spousal support, child support, custody, visitation, and other components of the divorce. [11] X Research source You obtain divorce decrees the exact same way you obtain divorce records. It may cost a little more if your state/county charges by the page, though (a divorce decree can be 25-30 pages). [12] X Research source"
    }
  ]
}