{
  "url": "https://www.wikihow.com/Ge-Microwave-Not-Heating",
  "title": "Why Your GE Microwave Will Not Heat (and How to Fix It)",
  "steps": [
    {
      "title": "Ensure the \"Timer\" option isn't selected.",
      "content": "Ensure the \"Timer\" option isn't selected. The buttons on your GE microwave can be a little confusing. On most models, you'll press the Time Cook , Cook , or Cook Time button to heat your food. The problem is that there's also a kitchen timer button that doesn’t heat your food, typically called Timer , Kitchen Timer , or Timer On/Off . If you use one of those buttons, the timer will count down, but the microwave will not heat up."
    },
    {
      "title": "Try turning off Demo Mode.",
      "content": "Try turning off Demo Mode. Some GE microwaves have a special \"Demo Mode\" that causes the microwave to turn on and spin but not produce heat. If your microwave is brand new and not heating, Demo Mode may be turned on. Countertop microwaves [1] X Research source Unplug the microwave for a full minute. Plug the microwave back in. When the clock or other info appears on the display, hold down POWER LEVEL and 0 at the same time for at least 3 seconds. This must be done very soon after plugging the microwave back in—if you think you missed it, unplug the microwave for another full minute and try again. Over-the-range microwaves [2] X Research source Unplug the microwave for at least 3 minutes. If you can't unplug it, turn off the circuit breaker for that outlet for 3 minutes. Power the microwave back on. When the clock setting appears on the display, press and hold POWER/TEMP and START for 3 seconds or more."
    },
    {
      "title": "Increase the power level.",
      "content": "Increase the power level. If the power level is too low, your GE microwave might heat up a little, but not enough to make your food hot. On most GE microwaves, you can change the power level by entering the cook time, pressing Power Level , and entering a number between 1 and 10—10 is the hottest/highest. [3] X Research source"
    },
    {
      "title": "Make sure the door is securely closed.",
      "content": "Make sure the door is securely closed. If the microwave doesn't start but the light turns on, the door may not be latching properly. Open the door and check for old food and grime near the door latch. Close the door and make sure it latches completely. Close the door securely and try heating your food again. [4] X Research source If the door isn't latching properly, you can clean it. Unplug the microwave from power, and use a mild, non-abrasive cleanser with a soft sponge or cloth. GE recommends Cerama Bryte appliance cleaner . [5] X Research source"
    },
    {
      "title": "Check the power.",
      "content": "Check the power. If the microwave won't turn on at all, there could be a problem with the power cord, the outlet, or even a blown fuse or breaker in your home. If it does turn on but won't heat your food, the microwave may not be getting enough power from the outlet. Make sure the power cable is securely inserted into a 120-volt outlet. If you have an over-the-range GE microwave, the power cord comes out of the top-right side of the unit, and you can usually access the outlet in the cabinet above it. [6] X Research source If you have an over-the-range GE microwave, the outlet should be on a dedicated circuit. [7] X Research source If the microwave still won't turn on or heat, try plugging something else into the outlet and see if it works. Check your breaker box for a tripped breaker."
    },
    {
      "title": "If you couldn't find a fix, your microwave needs repair.",
      "content": "If you couldn't find a fix, your microwave needs repair. If the microwave is running but still won't heat, the magnetron has likely gone bad. GE does not recommend doing further troubleshooting or trying to replace these parts yourself, as it can be very dangerous. [8] X Research source In fact, it could kill you—we're not joking. [9] X Research source If you have a cheaper countertop model, it will be cheaper to buy a new microwave than have the magnetron replaced—the cost for a new magnetron is usually in the $100-$250 range, and most appliance repair shops charge $50-$150 an hour. [10] X Research source If you have a more expensive microwave, such as the GE Profile 30\" built-in over-the-range model that retails for almost $2000, we recommend calling for repair. If you're skilled with electronics repair or are a technician yourself, you can test the magnetron and replace it if needed."
    },
    {
      "title": "Get some insulated screwdrivers and a multimeter.",
      "content": "Get some insulated screwdrivers and a multimeter. GE does not recommend doing this unless you are a professional. If you're a technician, or you have a solid understanding of working with high-voltage electronics, you can use this guide to test the magnetron and determine whether it needs to be replaced. Before testing the magnetron , you must discharge the high-voltage capacitor, as it can still hold a lethal amount of electricity when the unit is unplugged. [11] X Research source The safest way to do this, and the way we recommend, is to use a capacitor discharge tool . They look like tweezers and allow you to easily short out the capacitor without causing a spark. You can also use two small insulated awls or two small insulated screwdrivers, though this will typically create a spark or pop. [12] X Research source We don't recommend using a single screwdriver, as it'll be too hard to make it touch both contacts at the same time—it's pretty tight in there. As for the magnetron, you can use any multimeter for the testing, whether digital or analog. To remove the chassis, you'll also need some screwdrivers. The screws vary by model and location—some are usually Phillips, and others are Torx. We recommend having a full set of screwdrivers, just in case."
    },
    {
      "title": "Unplug your microwave from power.",
      "content": "Unplug your microwave from power. You should also move the microwave to a flat, clean table if you haven't already done so. If you have an over-the-range model, unscrew the appliance from the mounting brackets, and carefully slide the microwave out and place it onto a flat surface. Grigorian recommends having somebody help you remove your over-the-range microwave, as it's pretty heavy. He also advises protecting your countertops and stove during the process. \"Put a moving blanket on top of the stove to make sure it's covered,\" he explains, \"and remove any glassware from the counters in case [the microwave] falls down.\""
    },
    {
      "title": "Remove the outer case from the microwave.",
      "content": "Remove the outer case from the microwave. You will typically need to remove screws from the rear, sides, front, top, and bottom to completely remove the case. You do not need to take off the door or front panel. Be careful not to touch anything inside the microwave when removing the case or after doing so—there are many components that can hold a lethal charge, even though your microwave is unplugged. Open the door and remove the glass plate and spinner before removing the outer case. The steps to remove the case vary by model. On some models, you will need to unscrew the top two screws above the door, open the door, and slide out the grill before you can remove the rest of the case. [13] X Research source"
    },
    {
      "title": "Discharge the high-voltage capacitor.",
      "content": "Discharge the high-voltage capacitor. To do this, you'll first need to locate the high-voltage capacitor, which you can usually access from the top or side of the microwave. The capacitor looks like a small metal box with a black cylinder sticking out. Connected to the black cylinder are red and white wires (sometimes both wires are white). A mistake can be lethal—when in doubt, call a professional . To discharge the capacitor with a discharge tool, hold the insulated end (don't touch any metal!), and touch each metal end to both terminals. Your discharge tool will alert you when the capacitor is discharged. If you're using two small screwdrivers or awls, hold the plastic insulated ends (don't touch metal), and touch the ends of the tools to each set of terminals. Once the metal ends are touching the terminals, cross the tools over one another so they touch—they should still also be touching the terminals. [14] X Research source This will short the capacitor, and you may hear a pop or see a spark. [15] X Research source This is normal."
    },
    {
      "title": "Disconnect the wires from the magnetron.",
      "content": "Disconnect the wires from the magnetron. There may be a single connector to unplug from the magnetron, or you may need to unplug two separate wires. You can find the magnetron, a small metal box, by following the wires that are connected to the high-voltage capacitor. As long as you have properly discharged the capacitor, you can safely remove the wires from the magnetron now that they are not carrying any charge. [16] X Research source"
    },
    {
      "title": "Unscrew and remove the magnetron.",
      "content": "Unscrew and remove the magnetron. We recommend taking a photo so you know which cables to reconnect after. The screws securing the magnetron in place may be a little difficult to remove, and you may need to remove other panels to access them—it all depends on which model microwave you have. Unscrew all necessary screws, pull the magnetron gently out of the case, and disconnect the wires from the thermal protector. [17] X Research source"
    },
    {
      "title": "Test your magnetron with the multimeter.",
      "content": "Test your magnetron with the multimeter. Set your multimeter to the lowest resistance setting (ohms). Touch the black meter lead to one of the magnetron's terminals, and the red to the other terminal. If the meter display does not change, there is no continuity, and the magnetron is faulty. [18] X Research source If the meter display shows a reading of between 0-5 ohms, the magnetron works, and does not need to be replaced. At this point, we recommend contacting a professional."
    },
    {
      "title": "Replace the magnetron if faulty.",
      "content": "Replace the magnetron if faulty. A replacement GE microwave magnetron typically ranges from $100 to $200 dollars. If you have a more expensive GE microwave, this may be worth it—just contact a local appliance shop to request a magnetron for your model, or try searching for an OEM part online. Once the part arrives, you can easily install it."
    }
  ]
}