{
  "url": "https://www.wikihow.com/Crochet-a-Shell-Stitch",
  "title": "How to Crochet a Shell Stitch",
  "steps": [
    {
      "title": "Chain a multiple of 6 plus 5.",
      "content": "Chain a multiple of 6 plus 5. To begin your foundation for the shell stitch, you will need to make a chain. Your chain will need to be a multiple of 6 plus 5 additional stitches. For example, you could make a chain of 18 plus 5, which would be 23. This would be a great length for practicing the stitch. Or, for a wider piece, you could make a chain of 60 plus 5, which would be 65. To chain , loop the yarn over your hook 2 times, then pull the first loop through the second one. Then, loop your yarn over the hook again and pull it through the loop. Keep doing this until your chain is the required length. [1] X Research source"
    },
    {
      "title": "Work a single crochet stitch into the second chain from the hook.",
      "content": "Work a single crochet stitch into the second chain from the hook. Begin your first row by working a single crochet stitch into the second chain from your hook. To single crochet , insert the crochet hook into the chain and then loop your yarn over the hook. Pull your yarn through the stitch to create a new loop. Then, yarn over again and pull the loop through both of the loops on the hook to complete a single crochet stitch. [2] X Research source"
    },
    {
      "title": "Skip 2 and double crochet 5 times into same stitch.",
      "content": "Skip 2 and double crochet 5 times into same stitch. Skip the next 2 stitches and then double crochet 5 times into the third stitch. This will cause the stitches to fan out and create your first shell stitch. To a double crochet stitch , loop your yarn over the hook, and then insert the hook into the chain. Loop the yarn over again. Then, pull through the first stitch, and loop the yarn over the hook again. Next, pull the yarn through the next 2 stitches on your hook, and then loop the yarn over again. Pull this yarn through the last 2 stitches on your hook. [3] X Research source"
    },
    {
      "title": "Skip 2 and single crochet.",
      "content": "Skip 2 and single crochet. After you finish your fifth double crochet stitch, skip 2 chains and then single crochet into the third stitch 1 time. You will need to do this after you finish each shell."
    },
    {
      "title": "Repeat the sequence.",
      "content": "Repeat the sequence. Continue to skip 2, double crochet 5 times into the same stitch, skip 2 again, and then single crochet. Do this all the way across the row until you reach the last 3 chains."
    },
    {
      "title": "Continue until you only have 3 chains left.",
      "content": "Continue until you only have 3 chains left. Skip to the last chain in the row and then double crochet 3 times. This will finish your first row."
    },
    {
      "title": "Chain 1 and turn your work.",
      "content": "Chain 1 and turn your work. Your first row always needs to begin with a turning chain. This is a small chain that will provide some slack for your new row to begin. Always start your rows with a chain of 1."
    },
    {
      "title": "Work a single crochet stitch into the first double crochet stitch.",
      "content": "Work a single crochet stitch into the first double crochet stitch. Your first stitch will need to be worked into the top of the first double crochet stitch from the first row. Locate this stitch and then single crochet into it 1 time."
    },
    {
      "title": "Double crochet 5 times into the next single crochet stitch.",
      "content": "Double crochet 5 times into the next single crochet stitch. To make your first shell, you will need to locate the next single crochet stitch and then double crochet 5 times into it. This will create a shell in the curved space between your first 2 shells."
    },
    {
      "title": "Skip 2 and single crochet into next double crochet stitch.",
      "content": "Skip 2 and single crochet into next double crochet stitch. After you finish your first shell for the row, skip 2 stitches and then single crochet into the next double crochet stitch."
    },
    {
      "title": "Repeat the sequence to the end of the row.",
      "content": "Repeat the sequence to the end of the row. Continue to repeat the sequence of skipping over to the next single crochet stitch, double crocheting into it 5 times, skipping 2, and then single crocheting. Keep doing this until you only have 3 stitches left."
    },
    {
      "title": "Double crochet 3 times into last single crochet stitch.",
      "content": "Double crochet 3 times into last single crochet stitch. In your last stitch for the second row, double crochet into the stitch 3 times to make a half-shell. This will complete your second row."
    },
    {
      "title": "Keep repeating the second row to expand your work.",
      "content": "Keep repeating the second row to expand your work. To continue working in the shell stitch, you will just have to repeat the second row. Keep repeating the row until your project is the size that you want it to be."
    },
    {
      "title": "Switch colors if desired.",
      "content": "Switch colors if desired. Whenever you start a new row, you may also wish to switch colors. This will help to ensure that your shells stand out. However, you can also stick with 1 color if you like and your shell pattern will be a bit more subtle."
    },
    {
      "title": "Make sure that your yarn and hook match up.",
      "content": "Make sure that your yarn and hook match up. It is important to use a hook that is appropriate for the type of yarn you are using. If you do not, then your project may not turn out right. Always check the yarn label to see what hook size is recommended for the yarn. If you are using a pattern, then it is always a good idea to follow the recommendations for yarn type and hook size. Otherwise, your finished product might not look how it is supposed to look."
    },
    {
      "title": "Use a smooth yarn type and avoid fluffy yarns.",
      "content": "Use a smooth yarn type and avoid fluffy yarns. You can use any type of yarn you'd like, but the shell stitch works best when you use a straight, smooth yarn. Fluffy or textured \"novelty\" yarns may not result in a distinct shell pattern. Steer clear of these types of yarns and opt for a straight, smooth yarn instead. [4] X Expert Source Lois Wade wikiHow Crafts Expert Expert Interview. 30 July 2020. A thick, chunky yarn will work well for this stitch, as long as it has a consistent diameter. [5] X Expert Source Lois Wade wikiHow Crafts Expert Expert Interview. 30 July 2020."
    }
  ]
}