{
  "url": "https://www.wikihow.com/Download-Videos-on-Instagram-on-Android",
  "title": "How to Download Videos on Instagram on Android",
  "steps": [
    {
      "title": "Install the Video Downloader for Instagram app.",
      "content": "Install the Video Downloader for Instagram app. This app will allow you to download unprotected Instagram videos from posts. To install it, do the following: Open the Play Store app. Tap the search bar. Type in video downloader for instagram . Tap Video Downloader - for Instagram Repost App in the resulting drop-down menu. Tap INSTALL , then tap ACCEPT if prompted."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. Tap the Instagram app icon, which resembles a multicolored camera. This will open your Instagram feed if you're logged in. If you aren't logged in, enter your email address (or username/phone number) and password when prompted."
    },
    {
      "title": "Go to the video you want to download.",
      "content": "Go to the video you want to download. Scroll down to (or search for) the video that you want to download onto your Android. The video must be public (e.g., not from a private account) and it must be a post, not a story."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . This icon is in the upper-right corner of the video's post. A drop-down menu will appear."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's in the drop-down menu. The link will be copied to your Android's clipboard. If the drop-down menu doesn't have a \"Copy Link\" option, you may be able to select Share Link and then tap Copy to Clipboard . If the menu has neither of these options, you cannot download the video."
    },
    {
      "title": "Open Video Downloader for Instagram.",
      "content": "Open Video Downloader for Instagram. Tap the Video Downloader for Instagram app icon, which resembles a white downward-facing arrow on a multicolored background."
    },
    {
      "title": "Tap ALLOW when prompted.",
      "content": "Tap ALLOW when prompted. This will allow Video Downloader to save videos on your Android."
    },
    {
      "title": "Paste in the link if necessary.",
      "content": "Paste in the link if necessary. In most cases, the Video Downloader for Instagram app will detect the copied link and immediately bring up a preview of the video at the top of the screen; if not, tap PASTE near the top of the screen."
    },
    {
      "title": "Tap the \"Share\" icon.",
      "content": "Tap the \"Share\" icon. This pink-and-white, triangular, three-dot icon is on the right side of the screen."
    },
    {
      "title": "Tap Download Image.",
      "content": "Tap Download Image . It's in the \"Share\" menu. Doing so will prompt the video to download onto your Android. An ad may open at this point. If so, tap the X in one of the corners of the screen before proceeding."
    },
    {
      "title": "Find the video on your Android.",
      "content": "Find the video on your Android. Once you've downloaded the video onto your Android, you can find it in a couple of different ways: Photos app — Tap the Photos app icon, tap the Albums tab, and tap the Downloads album. You'll find your video there. If you're using a separate Photos app (e.g., the Samsung Gallery app), you may find the video in the Videos app. File manager — Open your preferred file manager (e.g., ES File Explorer), select your Android's default storage (e.g., SD card ), tap the Download folder, and find the icon for your downloaded video."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. Tap the Instagram app icon, which resembles a multicolored camera. This will open your Instagram feed if you're logged in. If you aren't logged in, enter your email address (or username/phone number) and password when prompted."
    },
    {
      "title": "Go to the video you want to download.",
      "content": "Go to the video you want to download. Scroll down to (or search for) the video that you want to download onto your Android. The video must be public (e.g., not from a private account) and it must be a post, not a story."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . This icon is in the upper-right corner of the video's post. A drop-down menu will appear."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's in the drop-down menu. The link will be copied to your Android's clipboard. If the drop-down menu doesn't have a Copy Link entry, you cannot download the video."
    },
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. Press your Android's Home button to minimize Instagram, then tap the Chrome app icon, which resembles a red, yellow, green, and blue ball."
    },
    {
      "title": "Tap the address bar.",
      "content": "Tap the address bar. It's at the top of the Chrome page. Doing so will select the text there."
    },
    {
      "title": "Go to the SaveFromWeb site.",
      "content": "Go to the SaveFromWeb site. Type in savefromweb.com and tap the \"Enter\" or \"Search\" button."
    },
    {
      "title": "Tap the \"Paste Instagram Video\" text box.",
      "content": "Tap the \"Paste Instagram Video\" text box. It's in the middle of the page. Your Android's keyboard should pop up."
    },
    {
      "title": "Tap and hold the text box.",
      "content": "Tap and hold the text box. You should see a menu bar pop up after a moment."
    },
    {
      "title": "Tap PASTE.",
      "content": "Tap PASTE . It's in the menu bar. The copied Instagram link will appear in the text box."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . This is to the right of the text box. Doing so opens the video in a preview window."
    },
    {
      "title": "Download the video.",
      "content": "Download the video. Tap ⋮ in the bottom-right corner of the video preview that SaveFromWeb displays, then tap Download in the resulting drop-down menu. This will cause your Android's Chrome browser to download a copy of the video into your Android's \"Download\" folder."
    },
    {
      "title": "Find the video on your Android.",
      "content": "Find the video on your Android. Once you've downloaded the video onto your Android, you can find it in a couple of different ways: Photos app — Tap the Photos app icon, tap the Albums tab, and tap the Downloads album. You'll find your video there. If you're using a separate Photos app (e.g., the Samsung Gallery app), you may find the video in the Videos app. File manager — Open your preferred file manager (e.g., ES File Explorer), select your Android's default storage (e.g., SD card ), tap the Download folder, and find the icon for your downloaded video. Notification shade — Swipe down from the top of the screen, then tap the \"Download complete\" notification."
    }
  ]
}