{
  "url": "https://www.wikihow.com/Create-a-Revocable-Trust",
  "title": "How to Create a Revocable Trust",
  "steps": [
    {
      "title": "Consider adding real estate.",
      "content": "Consider adding real estate. You can put a house or other piece of property into your revocable trust. You can include property even if it has a mortgage on it. [1] X Research source Consider whether you want to leave property to your heirs through a trust. Because the trust is revocable, you can change your mind at any time (unless you become incapacitated). The only cost you will incur is the cost of retitling property back to your own name. Realize that the mortgage follows the property into the trust."
    },
    {
      "title": "Identify business interests.",
      "content": "Identify business interests. Your ownership interest in any business is probably quite valuable. You should consider leaving those interests to people in your revocable trust. For example, you might leave the following: [2] X Research source You can transfer the assets and business name of a sole proprietorship to the revocable trust. You might be able transfer your ownership interest in a partnership to the trust, although you should check the partnership document first. Some partnership documents limit your ability to make this transfer. You might also be able to transfer shares in a closely held company to your revocable trust. You may also be able to transfer your ownership interest in a limited liability company, though you will need other owners to agree. A trust can own business property but cannot operate a business. If the business interests to be transferred are S corporation shares, care must be taken not to violate the ownership rules for S status."
    },
    {
      "title": "Add financial accounts.",
      "content": "Add financial accounts. You can also add different financial accounts to your revocable trust. Once you include the account in the trust, the trust owns the assets in the account. Consider adding the following to your revocable trust: [3] X Research source stocks bonds"
    },
    {
      "title": "Include intellectual property assets.",
      "content": "Include intellectual property assets. Many people own valuable property that is intangible. This kind of property is often called intellectual property. You might have some of the following, which you can put into your trust: patents copyrighted creative works"
    },
    {
      "title": "Find other valuables to add.",
      "content": "Find other valuables to add. Go through your possessions and identify what else you would like to leave. You don’t have to add every single possession you own to your trust. However, you should add things that have substantial value, such as the following: [4] X Research source antiques artwork furniture coins other collector’s items"
    },
    {
      "title": "Identify what not to add to a revocable trust.",
      "content": "Identify what not to add to a revocable trust. You can’t add some property to a trust, either because doing so is too cumbersome or because it is illegal. In particular, you shouldn’t add the following: [5] X Research source Retirement accounts and 401(k)s. However, you can name your trust as a beneficiary. Life insurance. Your beneficiaries are named on your policy. However, you can name your trust as a beneficiary. Cash. You can’t transfer cash, though you can name someone as the beneficiary of a cash account. They then get whatever is in the account at your death. Securities. It’s better to use transfer-on-death registration instead. Vehicles. Although you can legally transfer a vehicle to a living trust, some insurers are confused when a trust is the owner. It’s probably easier not to own vehicles in a trust."
    },
    {
      "title": "Determine who will receive your property.",
      "content": "Determine who will receive your property. At death, your property will be transferred to beneficiaries. You should identify who you want to receive your property. Also choose someone to inherit in case the original beneficiary dies before you. You can also give the trustee instructions for how to distribute property. For example, if you are leaving assets to minors, you might not want the trustee to transfer the property until they reach a certain age, such as 21."
    },
    {
      "title": "Include a durable power of attorney.",
      "content": "Include a durable power of attorney. You can appoint someone to manage your affairs should you become incapacitated. Include a power of attorney in your trust. The agent you appoint can make medical decisions for you and handle your finances. The agent you appoint should be someone you trust, such as a child or spouse. Talk to your agent ahead of time to decide what kinds of treatment you want to receive once you are incapacitated. A trusted agent should honor your wishes. Also remember to name one or more successor agents in case your first pick cannot serve in the role."
    },
    {
      "title": "Appoint a trustee.",
      "content": "Appoint a trustee. The trustee will manage the property owned by the trust. As long as you are living, you will be the trustee. However, you’ll need to appoint someone to succeed you as trustee after you die. This person will be responsible for transferring assets to your beneficiaries. The trustee might also manage assets on behalf of minor children or disabled adults. In that situation, you might want to name someone with experience managing trust assets, such as a lawyer or asset management company. You might decide to make the successor trustee the primary beneficiary. For example, if you leave everything to your only child, then you could name them as the successor trustee."
    },
    {
      "title": "Find sample trusts.",
      "content": "Find sample trusts. You can draft a revocable trust by finding samples online and using them as models for your own. For example, Nolo has a revocable living trust document. [6] X Research source You can also find sample trust documents in books at your local library. In addition, you might want to use software or online programs that can help you. These programs ask you sample questions and create a trust document based on your answers."
    },
    {
      "title": "Consult with a trusts and estates attorney.",
      "content": "Consult with a trusts and estates attorney. You can certainly draft a simple revocable trust on your own. However, you should definitely consult with an experienced trusts and estates attorney. They can review your document and identify anything that is missing. Find a trusts and estates attorney by contacting your local or state bar association. Ask for a referral. Call up the attorney and schedule a meeting. Tell them you have a draft trust document you want them to review. Ask how much they will charge to review the document."
    },
    {
      "title": "Execute the trust.",
      "content": "Execute the trust. You’ll need to sign your trust in front of a notary public. Accordingly, you should include a notary block at the bottom of your document. [7] X Research source Search online for an appropriate block. You can find a notary at your county courthouse, town office, or at most large banks. Make sure to take sufficient personal identification with you, such as a valid driver’s license or passport. You should also sign the trust in front of a witness, who cannot be a beneficiary. Check with a lawyer about your state’s precise legal requirements."
    },
    {
      "title": "Re-title assets.",
      "content": "Re-title assets. The trust must hold assets included in the trust. This means you will hold the assets in your position as trustee. For example, you might transfer real estate to “Michael Jones, trustee of the Michael Jones Revocable Living Trust dated April 11, 2017.” [8] X Research source Record the new deed with your county Recorder of Deeds office. Some assets don’t have a title. However, you can transfer financial instruments into a new account owned by the trust. For other assets, you can draft an “Assignment of Untitled Tangible Personal Property” and include it with your trust. [9] X Research source You should also create a schedule and list all assets on it. Attach the schedule to your trust document."
    },
    {
      "title": "Remove property from the trust.",
      "content": "Remove property from the trust. With a revocable trust, you can easily remove property if you no longer want to include it. You should re-title the property back into your own name. Any property not in the trust at your time of death can’t be transferred to anyone via trust. However, it will now be transferred by your will or by the intestacy laws if you have no will. You should also remove the asset from the schedule attached to the trust. [10] X Research source Your trust should be set up so that you don’t need to draft an amendment."
    },
    {
      "title": "Amend the trust.",
      "content": "Amend the trust. You’ll need to amend your trust if you want to change a beneficiary, name a different successor trustee, or appoint a different agent to make decisions when you are incapacitated. If you’re adding property, you may also need to add an amendment (unless the property is going to the same person you have left all property to). Trust amendments are easy to draft, but remember the following: Identify the trust you are amending. Identify by name and date. Also state the provision of the trust that gives you the power to amend. [11] X Research source Always include a statement that you intend the rest of the trust to remain in effect. For example, you can write, “In all other respects, the trust remains unchanged.” Execute the trust amendment using the same formalities that you did for the original trust."
    },
    {
      "title": "Revoke the trust.",
      "content": "Revoke the trust. You might want to get rid of the entire trust. Think carefully before doing this. Don’t revoke if all you want to do is amend. Common reasons to revoke a trust include getting divorced or making extensive changes. [12] X Research source You need to revoke your trust in a writing which you sign and date. Find templates online or consult with an estate attorney. Remember to transfer all property from yourself as trustee to yourself. This means you’ll need to retitle property. For example, you should execute a quitclaim deed to transfer real estate from the trust back to you. [13] X Research source"
    },
    {
      "title": "Decide what you want to do with your property.",
      "content": "Decide what you want to do with your property. If you remove property from a trust or revoke your trust entirely, you need to decide what you want to do with your property. A revocable trust is not a good substitute for a will and you should probably draft a will if this was your intention. If you don’t, then you can’t control who will receive your property when you die."
    }
  ]
}