{
  "url": "https://www.wikihow.com/Design-Your-Own-Tattoo",
  "title": "How to Design a Tattoo Yourself",
  "steps": [
    {
      "title": "Look online for tattoo ideas and themes.",
      "content": "Look online for tattoo ideas and themes. Do a quick Google search of tattoos in a similar vein to the tattoo that you might like to get. For example, if you think you want to get a travel-themed or geometric tattoo, search specifically for images of these types of tattoos. Similarly, if you want to design a sleeve tattoo , then look for sleeve designs online. Seeing images of tattoos other people have can serve as inspiration, even if you decide to go a different route with your own design. Check social media as well. You can find tons of great ideas on Pinterest, Tumblr, and Instagram. You can also look through tattoo artists' portfolios online."
    },
    {
      "title": "Look through tattoo magazines.",
      "content": "Look through tattoo magazines. These are a fantastic way to learn about innovations in the tattoo world as well as to get inspiration for your own tattoo. You can find popular tattoo magazines like INKED , TATTOO , and Skin Deep online or at your local bookstore or newsstand."
    },
    {
      "title": "Shuffle through the pages of art books.",
      "content": "Shuffle through the pages of art books. Spend a couple of hours doing this at a local bookstore or library. Art books, specifically books that focus on tattoo art, are a great way to get exposure to different types of designs as well as to learn about the history of many artistic developments, which can in turn add meaning and depth to your own art. Look at books from different art periods that you're interested in to find inspiration and themes. Buy or check-out the book if you can. If not and you get permission, take a picture of the images that grab your attention or make a photocopy of the pages they’re on so that you can refer to the images at home."
    },
    {
      "title": "Brainstorm what is meaningful to you.",
      "content": "Brainstorm what is meaningful to you. While you may just want to get a tattoo because you like the design, creating a tattoo that has personal significance to you can be an extremely rewarding experience. Consider tattooing significant dates, like birthdates or wedding dates, your zodiac sign, a portrait of somebody important to you, or a favorite quotation. Other ideas include your favorite flower, animal, or character, something significant to your family of the place you live, or something you don't want to forget."
    },
    {
      "title": "Jot your ideas down in a journal.",
      "content": "Jot your ideas down in a journal. Now is the time to get creative! Cut up magazines to make a collage that represents the color scheme or mood you would like to recreate with your tattoo. Make an inspiration board that evokes the feeling you want to convey with your design. You might also jot down words in a diary that come to mind when thinking of the design you want. This can be super helpful if you want the tattoo artist to design or draw the tattoo for you."
    },
    {
      "title": "Sketch the design.",
      "content": "Sketch the design. If you can draw, sketching the tattoo is a fantastic way to give your tattoo artist a more accurate picture of just what exactly you want to get inked when you go into the parlor. Get out a piece of paper and draw the tattoo to scale. Don’t be afraid to go through multiple drafts - you are drawing something that will go on your body permanently, so take your time and work on the sketch until it’s just right. [1] X Research source You can draft a rough sketch and bring it to the tattoo artist. The artist can, in turn, refine your vision and bring the design closer to what you had envisioned, as well as advise you on feasibility and cost. If you don’t know how to draw, get a friend or hire a freelancer to draw your vision for you. Or, use a site like Fiverr for help. You can even collaborate with a tattoo artist by explaining to them the design you want and having them advise you on location, coloring, and type of ink. You will have to explain very carefully what you envision and likely go through multiple drafts until the drawing is just right."
    },
    {
      "title": "Opt for timelessness.",
      "content": "Opt for timelessness. Trends come and go, but a tattoo is forever. Determine whether the tattoo you have will age well by asking yourself questions such as: What is the likelihood that I’ll have the same interests and beliefs in 10 or 20 years? Am I making this decision based on impulse, or have I given it time and careful thought? It's best to think about the tattoo for several months before deciding to get it. Examples of timeless tattoos include tattoos of animals, flowers, skulls, maps, or nautical symbols. [2] X Research source Another way to test timelessness is to tape up the design you have created to a wall and look at it every day for a few months. While that may seem like a long time, if you get tired of looking at the design you will be able to reconsider whether this is really something you want inked on your body permanently."
    },
    {
      "title": "Order a temporary custom tattoo.",
      "content": "Order a temporary custom tattoo. If you would like to try out your idea before committing to the design, you can order a temporary custom tattoo online on a site like Etsy or Momentary Ink. Submit your design online and the seller will make you a temporary tattoo. You can also ask your tattoo artist if they can do a transfer of the design on your skin first. Ask for this during your initial design consultation."
    },
    {
      "title": "Narrow down potential artists.",
      "content": "Narrow down potential artists. Visit the websites of local tattoo parlors and look at the portfolio of work of various artists in your area. Every tattoo artist will have their own individual style, and you want to make sure that your needs align with the expertise of the artist. [3] X Research source Ensure the artists are licensed. Licensing and certifications vary by state, and you should only choose a tattoo artist who has a practitioner permit. Ask to see the license when you visit the tattoo parlor. [4] X Research source Whittle down the artists by area of expertise. For example, if you know you want to get a portrait tattooed, include in your list only artists who have experience in portraiture."
    },
    {
      "title": "Schedule a design consultation.",
      "content": "Schedule a design consultation. Most tattoo parlors offer free consultations by appointment, so use this as an opportunity to get to the know the artist and gauge whether you feel comfortable getting tattooed by them. Trust in the artist is of utmost importance when getting a tattoo since you want the artist to focus their full attention on you and not get easily distracted. [5] X Research source Some artists may require a deposit for the consultation. The money goes toward the time it takes the artist to create the design as well as the time they spend tattooing you. Ask the tattoo artist any questions you may have, from pain factor to how many sessions your tattoo will require. You want to choose an artist who is willing to patiently answer all of your questions. After the visit, reflect on how comfortable you felt at the parlor as well as on the artist’s attitude. Think about whether the artist was enthusiastic and agreed with your vision for the tattoo, and also consider the cleanliness of the parlor."
    },
    {
      "title": "Explain your vision.",
      "content": "Explain your vision. It’s important to go into a design consultation with a clear idea of the tattoo you would like to get or at least with a concept that you would like to bring to life. Otherwise, it can be easy to be persuaded by what an artist might want to design and end up with a tattoo that wasn’t really what you intended to get. During the consultation, show the artist your inspiration board, sketches, and your word diary. Find somebody who understands your vision and is willing to bring it to life. The last thing you want is to be butting heads with an artist who doesn’t share the same vision as you. Ideally, you and the artist should collaborate to come up with a design that you love and they will enjoy creating. If you can't come to an agreement, find a different artist. You don't want the artist to be unenthusiastic or hesitant about completing your tattoo."
    },
    {
      "title": "Decide where on the body you want the tattoo.",
      "content": "Decide where on the body you want the tattoo. When choosing where to get inked, you will want to consider visibility, sensitivity, and discretion. This will set limitations, such as size, on your tattoo design. Think hard about whether you want the tattoo to be visible to everyone, in which case you can consider tattooing your arms or legs, or whether you want it to be more private, in which case you would want to consider tattooing your lower back, shoulders, or stomach."
    },
    {
      "title": "Consider the pain factor.",
      "content": "Consider the pain factor. A larger or more intricate tattoo made with different sizes of needles will also likely hurt more, especially given that thicker needles tend to hurt more than thinner ones since they pierce more skin. Also keep in mind that different spots on the body have varying sensitivities. Bonier parts of the body and parts with little fat tend to be more painful. The wrists, for example, are highly sensitive, so it could hurt more to get inked there. Pain is subjective. Some claim that the initial outline of the tattoo is more painful, especially if this is your first experience getting inked, and others claim that the shading is more uncomfortable since the artist is going over the same areas over and over, packing color or ink. If you want to avoid shading, however, you should pick a simple, minimalistic tattoo design. [6] X Research source Pain is part of the process, so prepare yourself. Remember that it's worth it-- you'll end up with a one-of-a-kind tattoo!"
    },
    {
      "title": "Decide what type of coloring you want.",
      "content": "Decide what type of coloring you want. Tattoo color can affect the design you create - color tattoos, for example, may be better suited for smaller designs so that you have fewer touch-ups to do. Black and gray tattoos age better than color tattoos over time, are typically less expensive, and take less time to complete. Color tattoos allow for more creativity, are great for covering existing tattoos, and contrast strongly with light to medium skin tones. Ask your tattoo artist for their recommendation on the type of coloring you should get. You might also want to consider getting a tattoo made out of white ink, depending on the type of design that you want to create and on the visibility you want the tattoo to have. White ink tattoos will often be less visible than monochrome or color ones."
    }
  ]
}