{
  "url": "https://www.wikihow.com/Develop-Productive-Habits",
  "title": "How to Develop Productive Habits",
  "steps": [
    {
      "title": "Mapping your day out will keep you focused on what’s important.",
      "content": "Mapping your day out will keep you focused on what’s important. Being productive has more to do with organization than effort, so put 5-10 minutes aside every night (or morning) to map out how you’re going to spend the day ahead of you. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Fill in the morning with your most time-sensitive or important tasks and set aside time for emails, organization, and breaks. [2] X Expert Source Arda Ozdemir, MA Career & Life Coach Expert Interview. 14 March 2019. Set concrete goals for each day. Choose 3 important tasks that you want to accomplish and reserve at least 90 minutes to tackle these goals. [3] X Research source If you want to build your daily schedule in the morning, get up 5-10 minutes earlier than you normally would to make time for it. Productive days don’t start with a rushed morning schedule! Break the day down into sections so that you don’t spend hours in the same place or doing the same thing. Moving around regularly and mixing things up will make it easier to sustain focus throughout the day. [4] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Reader Poll: We asked 1393 wikiHow readers what they found most helpful for establishing a morning routine, and 55% of them said Setting an alarm. [Take Poll]"
    },
    {
      "title": "Unless you’re waiting on an important call, keep your phone on silent.",
      "content": "Unless you’re waiting on an important call, keep your phone on silent. It’s super easy to get distracted by random texts, notifications, and social media. If you catch yourself procrastinating on the phone, stop. [5] X Research source You’re most productive when you’re focused and engaged in what you’re trying to accomplish, so minimizing the most obvious distractions is essential. [6] X Expert Source Arda Ozdemir, MA Career & Life Coach Expert Interview. 14 March 2019. If you’re compulsively checking social media, there are apps you can download to lock you out of your account part of the day or after you’ve been scrolling for a while. You can always leave your phone in another room or in a desk drawer if you really want to zero in on something."
    },
    {
      "title": "A clean desk and an organized home will help you stay focused.",
      "content": "A clean desk and an organized home will help you stay focused. Chaos has a way of drawing your attention away from whatever task you’re trying to complete. [7] X Research source At the end of each day, spend a few minutes throwing out the trash, putting things away, and organizing your workspace or home to get rid of clutter. If you wake up to a clean home or show up at work to a minimalist desk, it’ll be easier to build healthy habits. [8] X Research source The phrase “out of sight, out of mind” works the other way as well. People tend to be attracted to whatever is in front of them. If there’s a stack of important files you need to address sitting on your desk, keep them out and take everything else off of your desk."
    },
    {
      "title": "Most people are more productive in the morning, so do key tasks early.",
      "content": "Most people are more productive in the morning, so do key tasks early. If your goal for the day is to go grocery shopping, don’t put it off until 8 pm when you’re likely to be tired. If you want to pitch a new service to a few important clients, make those calls or schedule those meetings before noon. This way, you won’t have to fight off any afternoon sluggishness when you’re trying to get stuff done. [9] X Research source Not only will you get the most important stuff done by scheduling your day this way, but that early feeling of accomplishment will help you maintain momentum throughout the day. If you’re struggling to maintain your energy later in the day and you aren’t at work, take a short rest. A 20-minute nap is a great way to put yourself back into a productive headspace. [10] X Research source"
    },
    {
      "title": "Multi-tasking is rarely a productive way to go about things.",
      "content": "Multi-tasking is rarely a productive way to go about things. You’re more likely to get things done if you dedicate all of your energy to a single task at a time. Turn the radio off at work, shut the TV off while you study, and don’t split your time between answering emails and other work-related tasks. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When you switch back and forth between different activities, you lose a lot of energy as your brain recalibrates for the new task. This kind of juggling is not a healthy habit for productivity. [12] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source You’re most productive when you’re in that flow where time is flying and you’re just totally consumed with what you’re doing. It’s a lot harder to get into that state if you’re constantly jumping between 2-3 different things. [13] X Expert Source Arda Ozdemir, MA Career & Life Coach Expert Interview. 14 March 2019."
    },
    {
      "title": "It’s hard to be productive if you think you’re doing something pointless.",
      "content": "It’s hard to be productive if you think you’re doing something pointless. Start pushing yourself to find the significance in every single thing you do before you start. For example, if you’re just filling out a timesheet for work, remind yourself that you’re helping your company keep you accountable. In turn, this helps you stay productive at work, and you want to be productive! You can even tie all of that back to your company’s mission and remind yourself why that’s important as well. [14] X Expert Source Arda Ozdemir, MA Career & Life Coach Expert Interview. 14 March 2019. Finding value in the little stuff also improves your overall attitude. If you walk around all day feeling like you’re wasting your time, you’re never going to get anything done!"
    },
    {
      "title": "Set aside 5-10 minutes to recharge your batteries every hour.",
      "content": "Set aside 5-10 minutes to recharge your batteries every hour. Stand up and stretch, step outside for a breath of fresh air, or walk around the hallway for a few minutes. Aside from the fact that this will help you come back to the task at hand feeling recharged, it will also give your body a break from sitting or staring at a screen for too long depending on what you’ve been doing. [15] X Research source Many productive folks are big fans of the Pomodoro technique. This is where you work in a series of intense bursts by spending 25 minutes focusing on a task and then taking 5 minutes off. This can be a great option if you find yourself losing momentum after every 35-45 minutes or so."
    },
    {
      "title": "Start small and let tiny behaviors snowball into regular habits.",
      "content": "Start small and let tiny behaviors snowball into regular habits. Force yourself to spend just 5 minutes a day on a new behavior. Next week, double it. For the next week or two, stick to that 10-minute-a-day rule. After a few weeks, your brain will be so used to spending 10 minutes on this task that it’ll become a habit. This is a phenomenal way to get yourself to build small procedural habits, like working out in the morning or meditating every afternoon. [16] X Research source It may be hard to push through that first week if you aren’t used to doing something, but stick with it! It will only get easier over time. Completing your tiny habit at the same time every day will also help turn your behavior into a habit."
    },
    {
      "title": "If you never take some time off, you’re going to burn yourself out.",
      "content": "If you never take some time off, you’re going to burn yourself out. Make sure that you set aside time to hang out with your friends and family, catch up on that book you’ve been meaning to read and do things that you actively enjoy. If you’re constantly pushing yourself to accomplish task after task, you’re going to run yourself into the ground. Chilling out on your days off is important if you’re going to be productive! [17] X Research source If you’re going to try and implement a new system or habit, take a vacation or long weekend off to get some relaxation in. There’s some evidence that it’s easier to build a new habit after a prolonged period of relaxation. [18] X Research source"
    },
    {
      "title": "Eat a healthy diet, keep a regular sleep schedule, and exercise regularly.",
      "content": "Eat a healthy diet, keep a regular sleep schedule, and exercise regularly. Do your best to stick to a balanced diet full of lean protein, vegetables, and whole grains. Aim to get 8 hours of sleep every night and try to go to bed and wake up at the same time every day. [19] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Try to get at least 150 minutes of exercise a week in the form of running, biking, or weightlifting to relieve stress and feel great about yourself! [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source It’s impossible to build productive habits if you don’t feel good. Taking care of your body is important for your overall health, but it’s also extremely key if you want to be a productive person. Take care of your mind and soul as well! Meditation and yoga are great ways to stay mentally and emotionally healthy."
    },
    {
      "title": "As you’re improving your overall productivity, reward yourself for sticking with it.",
      "content": "As you’re improving your overall productivity, reward yourself for sticking with it. After you fill out your planner for the day, take a minute or two to enjoy a warm cup of coffee. Once you finish filing those reports in the morning, eat a small piece of candy. Giving yourself regular, small rewards for sticking with your productive habits is essential to making those habits permanent. [21] X Research source Time your breaks so that you take them right after you’ve finished a productive task. Breaks are a great way to reward yourself and you need to take regular breaks anyway. That’s a win-win!"
    }
  ]
}