{
  "url": "https://www.wikihow.com/Develop-Telepathy",
  "title": "How to Telepathically Communicate with Someone",
  "steps": [
    {
      "title": "Tune out your physical senses.",
      "content": "Tune out your physical senses. Try playing white noise through headphones and wearing blackout goggles . Shifting attention away from your physical perceptions might allow you to focus more deeply on sending the telepathic message. You and the receiver should both try tuning out your senses. Sensory deprivation might help you each concentrate on the message."
    },
    {
      "title": "Stretch",
      "content": "Stretch your muscles or try doing yoga . Trying to send a telepathic message requires a lot of mental focus, so try to become physically and mentally relaxed . Regular stretching and practicing yoga can help you learn how to put yourself in a focused, relaxed state. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source When you prepare to send a telepathic message, try stretching your legs, arms, and back. Breathe in as you move into a pose, then exhale slowly as you stretch for 15 or 20 seconds. As you stretch, visualize all your tension leaving your body."
    },
    {
      "title": "Meditate",
      "content": "Meditate to calm your mind. Wear loose-fitting clothes and sit upright in a comfortable position. Inhale and exhale slowly, and do your best to clear your mind of unwanted thoughts. Imagine scattered, random thoughts leaving your mind as you exhale. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Spiritual director Jennifer McVey, Cht, says “Find a position that you're comfortable in, right in a space in your home (or wherever you're going, or outside)...and let yourself slip into a deep meditative state.” Do your best to focus your mind on a single thought. Try meditating for at least 20 minutes a day. With practice, it should get easier to focus your mind. Once you’re in a calm, focused state, you’re ready to try sending a telepathic message. Keep in mind that both the sender and receiver of the telepathic message should relax and clear their minds."
    },
    {
      "title": "Visualize",
      "content": "Visualize the person receiving your message. Close your eyes and picture the receiver as clearly as possible. Try to imagine that they are sitting or standing right in front of you. See details with your mind’s eye, such as the person's eye color, weight, height, length of hair, and the way they sit or stand. [3] X Research source According to McVey, “Visualizing a person that you want to telepathically communicate with will help you establish a better connection with them.” If you are far away from the receiver, it might be helpful to look at a picture of them before you begin visualizing them. As you build your mental image and send it to the receiver, they should relax and focus on being open to the message. Ask them to clear their mind and imagine you in front of them with as much detail as possible."
    },
    {
      "title": "Imagine how it feels to communicate with the person.",
      "content": "Imagine how it feels to communicate with the person. Call to mind the feelings you experience when you interact with the person face-to-face. Feel these emotions as if the person was actually in your presence. Focus on these feelings, and believe that you are creating a connection with the other person."
    },
    {
      "title": "Focus on a simple image or word.",
      "content": "Focus on a simple image or word. When you’re just starting out, stick with something simple, such as a nearby object. Visualize it with as much detail as possible, and focus your mind solely on it. Concentrate on what it looks like, what it’s like to touch it, and how it makes you feel. For instance, imagine an apple. See a particular apple as clearly as possible in your mind’s eye. Imagine its taste and the feeling of biting into it. Focus your thoughts solely on the apple."
    },
    {
      "title": "Transmit your message.",
      "content": "Transmit your message. After forming a clear mental image, imagine the object traveling from your mind into the receiver’s. Visualize yourself face-to-face with the receiver, and say to them, “Apple,” or whichever thought you’re transmitting. In your mind’s eye, see the look of realization on their face as they understand what you’re telling them. Imagining something visceral and sensory, like a person’s face, increases your intuition and personal power. [4] X Research source Keep in mind there’s a difference between being focused and straining. Concentrate on the mental image, but stay relaxed. Once you’ve sent the thought, release it from your mind, and don’t think about it anymore. Imagine that you’ve given it away to the receiver and are no longer holding onto it."
    },
    {
      "title": "Ask the receiver to write down what comes to their mind.",
      "content": "Ask the receiver to write down what comes to their mind. Once you’ve sent the message, the receiver should remain relaxed and open until they sense that a thought has entered their mind. They should then write down whatever has come to their mind. [5] X Research source Before checking in with the receiver, you should also write down the thought you were trying to send. This can help you stay objective when you compare your results."
    },
    {
      "title": "Compare results with one another.",
      "content": "Compare results with one another. When you’re both ready, you and the receiver should show each other what you’ve written. Don’t get discouraged if you’re not successful, especially at first. Take some time to clear your mind, and then try again with a different image. [6] X Research source Don’t get down on yourself if you’re not able to send a clear telepathic message. Just try to have fun while you try!"
    },
    {
      "title": "Take turns trying to send and receive messages.",
      "content": "Take turns trying to send and receive messages. Switch up your roles as you practice and see if you have more success with one or the other. Maybe you’ll find that you’re better at receiving messages and your friend is better at sending them. [7] X Research source Keep in mind it’s helpful to practice with someone you trust, like a close friend or relative."
    },
    {
      "title": "Try playing a card game.",
      "content": "Try playing a card game. Take five unique cards, such as playing cards or cards with symbols on them. With your partner in a separate location, pick a card at random. Relax and calm your mind, then focus your thoughts solely sending the card’s image to your friend. Have your partner calm their mind and try to sense your message. When they feel an image has come to mind, have them write down the card you sent, then check your results."
    },
    {
      "title": "Draw an image, then send it to your partner.",
      "content": "Draw an image, then send it to your partner. Try drawing a shape or simple combination of shapes, like a circle inside a triangle. Focus your thoughts on the shape and visualize the image traveling from your mind to your partner’s. When they sense that they’ve received the message, have them draw whatever shape has entered their mind. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Alternatively, someone else could draw an image and show it to the sender, who would then try to transmit it to the receiver."
    },
    {
      "title": "Keep a telepathy journal to track your progress.",
      "content": "Keep a telepathy journal to track your progress. Each time you try to communicate telepathically, write down the details of your attempt. Note who the sender and receiver were, what the transmitted image was, and whether or not you were successful. A journal might help you find ways of refining your abilities. Even if an attempt was unsuccessful, note any promising details. For instance, if the message was “apple” and your friend wrote down “red” or “fruit,” that’s a great sign! Try journaling about your dreams, too. Some believe you’re more open to telepathic communication while you sleep, particularly if you can lucid dream . [9] X Research source"
    },
    {
      "title": "Guess the time or who’s sending you an email to hone your intuitive skills.",
      "content": "Guess the time or who’s sending you an email to hone your intuitive skills. At random moments, try to guess what time it is without looking at a clock or your phone. Or, every few hours, try to guess who’s sent you an email recently before checking. Record your guesses to see how often you’re correct and if you’re improving. [10] X Research source You can also try guessing who’s calling or texting you every time you hear your phone go off."
    }
  ]
}