{
  "url": "https://www.wikihow.com/Cure-Nail-Fungus",
  "title": "How to Treat Nail Fungus and Prevent It from Coming Back",
  "steps": [
    {
      "title": "Apply over-the-counter antifungal medication on infected nails.",
      "content": "Apply over-the-counter antifungal medication on infected nails. Look for a product that contains terbinafine since it will help control the fungus better. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Clean your nails with soap and water and dry them thoroughly so the medicine soaks in easier. Apply enough antifungal cream or solution to cover the surface of your nail, and rub it in thoroughly. After you finish coating your nail, rub some of the medication into the skin under and around your nails too. [2] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source Use a cotton ball or cotton swab to apply the medication so there’s less risk of the fungus spreading to your other nails. Nail fungus can be pretty persistent, so it could take a few months to completely remove nail fungus with topical treatment."
    },
    {
      "title": "Soak your nails in a white vinegar solution for a natural remedy.",
      "content": "Soak your nails in a white vinegar solution for a natural remedy. Make a foot bath by filling a large container with 2 parts warm water and 1 part distilled white vinegar. Soak your toenails in the vinegar solution for about 10–15 minutes so it can penetrate your nails and surrounding skin. After you’re finished, rinse your nail off with warm water and dry it off. [3] X Research source Try to soak your foot twice a day until the fungus is gone, which could take a few months. If your skin gets irritated from the vinegar, try adding more water to the solution or only soaking your nails every other day."
    },
    {
      "title": "Rub tea tree oil onto your nails to help kill the fungus.",
      "content": "Rub tea tree oil onto your nails to help kill the fungus. Mix 1 teaspoon (4.9 ml) of your tea tree oil with 1 ⁄ 2 teaspoon (2.5 ml) of olive oil that you’d use in your kitchen. Then, use a cotton ball or cotton swab to rub the oil directly onto the infected nails. Use the tea tree oil in the morning and evening until you see the fungus go away. [4] X Research source Tea tree oil has fungicidal properties, so it could help get your nail fungus under control. Instead of tea tree oil, you can try oregano oil since it also has potential to stop fungus from growing or spreading. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you develop any skin irritation where you’re applying tea tree oil, stop using it. Avoid swallowing tea tree oil since it’s toxic and can cause loss of coordination and breathing problems. [6] X Research source"
    },
    {
      "title": "Apply snakeroot extract as a natural antifungal.",
      "content": "Apply snakeroot extract as a natural antifungal. Studies have shown that snakeroot extract is just as effective as over-the-counter antifungals. Just apply the snakeroot extract directly to the infected nails once every 3 days to kill the fungus. After the first month of using it, then only put it on twice a week. Only apply the extract once a week during the third month to cure your nail fungus. [7] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Try putting mentholated ointment on your nails.",
      "content": "Try putting mentholated ointment on your nails. Apply the ointment right after you shower or wash your hands so your nails are nice and clean. Dip a cotton swab into the mentholated ointment and spread it over the surfaces of your infected nails. Apply the ointment once or twice a day until the fungus disappears. [8] X Research source It may take a few months for mentholated ointment to fully get rid of nail fungus."
    },
    {
      "title": "Soak your nails in Listerine to help kill the fungus.",
      "content": "Soak your nails in Listerine to help kill the fungus. Fill a container with enough Listerine mouthwash to completely submerge your nails. Alternatively, wet cotton balls in the mouthwash and bandage them over your nails. Let the Listerine soak in for about 20 minutes, and then wash your hands or feet. [9] X Research source You can use Listerine for nail fungus twice a day."
    },
    {
      "title": "Spread chopped garlic over your nails to slow down fungal growth.",
      "content": "Spread chopped garlic over your nails to slow down fungal growth. Crush a few cloves of garlic and place them over your infected nails. Put a bandage over the garlic so it stays in place and slip on a pair of socks. Leave the garlic against your nails for about 30 minutes before taking it off and rinsing your nails clean. [10] X Research source Alternatively, you can sprinkle garlic powder in your socks for a similar effect."
    },
    {
      "title": "Trim",
      "content": "Trim the infected parts of your nail. Start by soaking your nails in warm water for 10 minutes so they get softer and easier to cut. Use a pair of nail clippers for fingernails or larger nail nippers for toenails. Cut straight across the tops of your nails and slightly round the corners with a file . [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Try to get rid of as much of the white or yellow areas of your nail as you can. [12] X Research source Apply nail fungus bandages that contain urea onto your nails the night before you trim them. The urea will soak into your nails to help soften them. If your nails are really thick and difficult to cut on your own, visit a podiatrist or dermatologist to trim them."
    },
    {
      "title": "Talk to a doctor if your nail fungus is painful or persistent.",
      "content": "Talk to a doctor if your nail fungus is painful or persistent. Since nail fungus doesn’t usually lead to long-term issues, you may not need to see a doctor if it isn’t bothering you. [13] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source However, if your nail is deformed, painful, or affecting how you go through your daily routine, reach out to a doctor to find out what treatment options they recommend. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Your doctor may take a clipping of your nail to confirm that you have fungus rather than psoriasis or another skin condition."
    },
    {
      "title": "Use oral or topical prescription antifungals from your doctor.",
      "content": "Use oral or topical prescription antifungals from your doctor. Oral prescriptions are the most effective ways to cure nail fungus completely, but topical prescriptions can also help control and prevent it from spreading. Follow your doctor’s instructions and take every dose to ensure it gets rid of your fungal infection. [15] X Research source Typically, you’ll have to take a pill every day or apply a topical ointment 1–2 times daily. Your prescription may last for a few weeks, but it could take up to a few months. Oral antifungals, such as itraconazole, terbinafine, or fluconazole can cause dizziness, headaches, stomach problems, rash, or liver damage. Avoid these medications if you have liver disease, heart failure, or are pregnant. [16] X Research source Common topical medications include amorolfine, ciclopirox, efinaconazole, and tavaborole. Possible side effects may include redness, swelling, or a stinging sensation. [17] X Research source Some forms of topical medication come in a clear nail polish that you paint onto your nails."
    },
    {
      "title": "Ask your doctor about laser treatments to remove the fungus.",
      "content": "Ask your doctor about laser treatments to remove the fungus. Laser treatments use short pulses of light to help kill the fungal cells in your nails. Typically, your doctor will give you laser treatments once every 1–2 months until the fungus dies out completely. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source There haven’t been a lot of studies on how effective laser treatments are, so talk with your doctor to make sure it’s the right option for you."
    },
    {
      "title": "Have surgery to remove your nail if your doctor recommends it.",
      "content": "Have surgery to remove your nail if your doctor recommends it. If your nail is extremely thick or causing you a lot of pain, your doctor may partially or fully take off your nail. They’ll use an anesthetic so you don’t feel any pain as they remove your nail and the fungal infection. [19] X Research source Removing the nail lets topical medications penetrate your nail bed easier to stop and kill fungal growth."
    },
    {
      "title": "Wash and dry your nails at least once a day.",
      "content": "Wash and dry your nails at least once a day. Clean your toenails every time you’re in the shower and scrub your fingernails each time you wash your hands. Be sure to dry off thoroughly since too much moisture can also increase your risk of developing fungus. [20] X Research source If you have dry or cracked skin around your toenails or fingernails, apply moisturizer to help your skin heal and prevent a fungal infection from getting in. [21] X Research source Taking care of your nails makes it more difficult for fungus to build up or cause an infection."
    },
    {
      "title": "Disinfect your nail clippers with rubbing alcohol before using them.",
      "content": "Disinfect your nail clippers with rubbing alcohol before using them. Each time you cut your nails , start by washing your clippers clean with soap and water. Then, wet a cloth with your rubbing alcohol and rub it over the surface to get rid of any fungi and bacteria. [22] X Research source Use a different set of clippers for infected nails and healthy nails so you don’t spread the infection between them. Avoid sharing your nail clippers with other people since that could increase the spread of nail fungus. If you get your nails done at a salon, make sure they’re a reputable business that disinfects their products every time they use them."
    },
    {
      "title": "Wear breathable socks and shoes.",
      "content": "Wear breathable socks and shoes. Nail fungus can easily form when your shoes and socks get wet. Rather than dealing with sweaty feet , put on a pair of moisture-wicking socks that dry out quickly. Then, wear shoes with a wide toe area and good support to help them air out. [23] X Research source If you get your socks or shoes wet, take them off as soon as you can. That way, there’s less of a chance that fungus will develop."
    },
    {
      "title": "Spread antifungal powder in the soles of your shoes.",
      "content": "Spread antifungal powder in the soles of your shoes. Just sprinkle a little bit of the antifungal powder inside your shoes, and shake them so the powder spreads evenly. Even though antifungal powder won’t kill an active infection, it will help absorb moisture to keep your feet dry and prevent fungal growth in the future. [24] X Research source If you don’t sprinkle antifungal powder in your old shoes, throw them away so you don’t reinfect yourself with nail fungus. Alternatively, try using an antifungal spray in your shoes every day before you put them on."
    },
    {
      "title": "Put on sandals when you’re in public showers or locker rooms.",
      "content": "Put on sandals when you’re in public showers or locker rooms. Fungus can spread over wet surfaces, so get a cheap pair of flip-flops or slides that you can take with you to the gym, pool, or school locker rooms. Rather than walking barefoot and risking getting nail fungus, just slip on your sandals for an extra layer of protection. [25] X Research source"
    },
    {
      "title": "Treat athlete’s foot",
      "content": "Treat athlete’s foot right away. Athlete’s foot is a common foot fungus that can spread to your nails if you leave it untreated. Check your feet regularly for signs of athlete’s foot, such as peeling skin between your toes or on the bottom of your feet. If you have an infection, wash and dry your feet, apply a topical antifungal ointment, and let your feet air out so you can get your athlete’s foot under control. [26] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source If you can’t get rid of athlete’s foot on your own, contact your doctor to see if they can offer a stronger prescription treatment."
    },
    {
      "title": "Look for white, yellow, or brown discoloration on your nails.",
      "content": "Look for white, yellow, or brown discoloration on your nails. Check around the edges of your nails since that’s where fungal infections first develop. If your nails may have small spots or large splotches of discoloration, then you’re more than likely dealing with nail fungus. If you’ve had fungus for a while, your entire nail may look discolored. [27] X Research source Nail fungus is more common on your toenails than your fingernails."
    },
    {
      "title": "Check for any thickened nails.",
      "content": "Check for any thickened nails. Nail fungus causes layers to build up on your nails, so they’ll get thicker and may even raise up off of your nail bed. A smaller section may get thicker than the rest of your nail and give them an uneven appearance. If you notice your nails are misshapen or more difficult to cut, it’s a sign that they’ve gotten thicker. [28] X Research source You may also notice your nails develop ridges that are raised off the surface."
    },
    {
      "title": "Inspect your nails for brittle or jagged edges.",
      "content": "Inspect your nails for brittle or jagged edges. As the fungus infects your nails, they may break apart easier. Pay attention when you cut your nails if they neatly trim away or crumble into smaller pieces, which could mean you’re dealing with nail fungus. [29] X Research source The residue or buildup on your nails may also have an unpleasant odor if you have a nail infection."
    }
  ]
}