{
  "url": "https://www.wikihow.com/Get-Rid-of-Spider-Crickets",
  "title": "8 Strategies to Kill Spider Crickets in Your House",
  "steps": [
    {
      "title": "Search for a curved hump, inch-long body, and long legs.",
      "content": "Search for a curved hump, inch-long body, and long legs. Spider crickets (also called \"cave\" and \"camel\" crickets) do actually look like a cross between a spider and a cricket. According to etymologist Samuel Ramsey, \"they love to chew on cardboard boxes\" and \"they love humidity.\" More likely than not, you’ll immediately observe differences between the spider crickets in your home and the field crickets you may be used to seeing. Search for photos online and note the pests' identifying qualities: [1] X Research source Humped body 1-1.5 inches (2.5-3.8 cm) long 6 long legs Light to dark brown, often with dark-colored bands around their body Antennae"
    },
    {
      "title": "Reduce moisture in your home with a dehumidifier.",
      "content": "Reduce moisture in your home with a dehumidifier. Spider crickets seek out damp, humid environments—like your muggy basement, for instance. Etymologist Samuel Ramsey emphasizes that if you \"run a dehumidifier, it will dry out the air, [which] will make it a lot more difficult for [the crickets] to find a suitable habitat if they happen to make it inside.\" Purchase a dehumidifier online or in home-improvement stores. Once your home’s air is dry and crisp, spider crickets are likely to leave on their own. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source For best effects, make sure to buy the right size . Your dehumidifier should be powerful enough to help with your entire space. Buy one that’s too weak, and it won't affect your air quality enough to solve your issue."
    },
    {
      "title": "Use a vacuum to suck up spider crickets and their eggs.",
      "content": "Use a vacuum to suck up spider crickets and their eggs. You may not want to get close enough to squash the bugs, and we don’t blame you. Instead, thoroughly vacuum your floors, especially in your basement.This way, you can rid your home of the pests from a comfortable distance. According to Etymologist Samuel Ramsey, \"crickets infrequently reproduce inside of human homes. They are most likely to reproduce outside of the home and to come into the home itself through cracks and crevices that they're allowed to access.\" However, on the off chance there are any eggs, this method can help you catch a majority of them, thus helping to prevent future spider cricket infestations. [3] X Research source Spider crickets can survive being vacuumed. Empty your vacuum bag immediately into an outdoor garbage bin so they don't make their way back into your home."
    },
    {
      "title": "Set store-bought traps to catch and kill spider crickets.",
      "content": "Set store-bought traps to catch and kill spider crickets. According to Etymologist Samuel Ramsey, \"there are sticky traps that can be used to capture [crickets]. They are very, very effective.\" Station the traps in areas where you’ve spied the bugs in the past. As long as they won't inconvenience you, place as many sticky traps as you can in as large of an area as you can. The more ground you cover, the better chance you have of catching more pests. [4] X Research source Spider crickets love fungi, so for extra effect, place pieces of moldy bread in the center of the traps. This will make your traps even more enticing to them! Even without the bread, sticky traps will catch unsuspecting bugs while they move around your home. As Etymologist Samuel Ramsey notes, \"the [bug will] just [sit] there until it eventually starves.\""
    },
    {
      "title": "Catch spider crickets in soapy, homemade traps.",
      "content": "Catch spider crickets in soapy, homemade traps. In muggy areas (like your basement) or areas where you’ve spotted bugs already, leave out a big tub of water. Squirt in a little dish soap, and you'll have created your own DIY bug trap. Spider crickets will come for the water, but because of the dish soap, they'll have a difficult time getting out of your container. [5] X Research source The dish soap will create suds and slippery sides. The water's surface tension will break, making it more difficult for the spider crickets to stay afloat and escape. This is a quick, easy spider cricket killer."
    },
    {
      "title": "Call a professional if you're facing a full infestation.",
      "content": "Call a professional if you're facing a full infestation. Spider crickets are a bit elusive because they move quickly and love warm hiding spots. If the problem has already gotten out of control, it may be extremely difficult to rid your house of the bugs yourself. So, make a call to an exterminator. When you're deciding on a service, consider asking for a free quote and references. [6] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Pro tip: ask fellow homeowners for their recommendations on the best local pest control."
    },
    {
      "title": "Seal up your home's entryways with sealant and weatherproofing.",
      "content": "Seal up your home's entryways with sealant and weatherproofing. According to Etymologist Samuel Ramsey, \"One of the clearest reasons why people have homes full of crickets are that they have pest entry points on the outside of their home that allow these organisms to easily get inside. [...] [For example], if you're approaching the stoop and you have a concrete foundation and you see the large cracks that are going toward the house itself, it’s easy for creatures like crickets that live in the soil to cross through that broken barrier and to get into the home that way.\" Walk around your house, keeping an eye out for cracks, holes, crawlspaces, vents, and voids. Seal up any potential entry points for a cold or hungry spider cricket. For an immediate solution, use caulk sealant . For long-term solutions, try a concrete filler. [7] X Research source Next, turn your attention to windows and doors. Use sealant or weather-stripping to ensure no spider crickets can get into your home. If spider crickets can't get into your home, then they can't infest your home. Etymologist Samuel Ramsey explains that \"they are most likely to reproduce outside of the home,\" so they're probably coming from the outside."
    },
    {
      "title": "Declutter your home to discourage future infestations.",
      "content": "Declutter your home to discourage future infestations. Spider crickets love the warmth and darkness of your messy piles on the floor—so tidy up . Cardboard boxes stored in a humid basement are specially enticing for the crickets. According to Etymologist Samuel Ramsey, \"[crickets] can feed on the paper fibers that the cardboard is made out of, as [it's] a good source of sugar and food for them. But, in addition to that, when cardboard is allowed to sit for long periods of time, especially if it gets a bit damp, small amounts of micro-fungi grow on it that the crickets are attracted to and consume.\" Plus, by keeping your floors free, you're more likely to spot spider crickets sooner. This will make it easier to get rid of spider crickets in your basement in the future. If you need to store items, especially in a humid part of your home, use airtight containers. Avoid leaving food out and clean up crumbs and spills right away to deter spider crickets from entering your home in search of their next meal. [8] X Research source"
    },
    {
      "title": "Tidy up the outdoor perimeter bordering your home.",
      "content": "Tidy up the outdoor perimeter bordering your home. If spider crickets are comfortable in the area surrounding your home, then eventually, they could move indoors. Mow the weed and grass areas around your home regularly, because spider crickets are more likely to live in long grasses over short, manicured yards. Keep high-moisture yard features away from your walls—like mulch piles, woodpiles, and shrubs. [9] X Research source"
    },
    {
      "title": "You likely live East of the Mississippi and have a humid basement.",
      "content": "You likely live East of the Mississippi and have a humid basement. [10] X Research source Though spider crickets can pop up in homes across the US, they’re more common in Eastern US homes. Spider crickets seek out muggy, quiet, dark areas with lots of hiding places. So if you have a basement, that elevates your risk of attracting spider crickets, especially during fall months. [11] X Research source"
    },
    {
      "title": "No, spider crickets aren't dangerous.",
      "content": "No, spider crickets aren't dangerous. [12] X Research source These creepy insects are often confused with wolf spiders and because of this, they often cause homeowners to panic. But spider crickets don't bite and are entirely harmless. [13] X Research source However, spider crickets do jump when they feel threatened. As a defense mechanism, they may actually head straight for their potential predator. So even though they're not dangerous, keep your distance."
    },
    {
      "title": "Spider crickets can damage fabrics and woods in your home.",
      "content": "Spider crickets can damage fabrics and woods in your home. Though these pests aren’t physically dangerous to you, they are famous for chewing through clothes, drapes, boxes, rugs, furniture, and even wood. In short, these bugs can definitely do damage. To avoid unnecessary, annoying destruction to your items, get these critters out of your home. [14] X Research source During large infestations, spider crickets may spread dark spots around the home. These are fecal smears, and they can leave stains."
    }
  ]
}