{
  "url": "https://www.wikihow.com/Determine-the-Material-Facts-in-a-Case-(Common-Law)",
  "title": "How to Determine the Material Facts in a Case (Common Law)",
  "steps": [
    {
      "title": "Read the opinion once.",
      "content": "Read the opinion once. Before you brief a legal opinion you should read through the whole case once. This will help you understand the overall story and will give you an idea of what you will be looking for the next time around. [1] X Research source When you read the case, pay attention to any facts and highlight them as you go."
    },
    {
      "title": "Create a heading.",
      "content": "Create a heading. You will always start your case brief with a heading, which will include the case's identifying information. This information will make your brief easily identifiable and will help you incorporate a citation into a piece of work down the road. Everything you need for the heading can be found near the beginning of the judicial opinion. [2] X Research source In general, your heading will always include the: Case name; Court name; Date of decision; and The page number where the case appears in the applicable reporter. Try and create a heading that conforms to a legal citation manual (e.g., the Bluebook or ALWD Manual). For example, you might try using a heading that looks like this: Roe v. Wade , 410 U.S. 113 (1973). Within that citation is the case name, the court name, the date of decision, and the page numbers where it can be found."
    },
    {
      "title": "Explain the procedural history.",
      "content": "Explain the procedural history. The procedural history of a case is its disposition in lower courts For this section of your brief, you will want to explain how the case got to the court whose opinion you are now briefing. Be sure you include the decisions of the lower courts (i.e., who won and why), the damages that were awarded, and who appealed and why. The procedural history can usually be found near the beginning of a judicial opinion when the judge discusses the facts and issues of the case. [3] X Research source For example, if you are explaining the procedural history of Roe v. Wade , you might state that the United States District Court for the Northern District of Texas ruled the Texas abortion statute unconstitutional and there was a direct appeal by Texas to the United States Supreme Court."
    },
    {
      "title": "Identify the issues of the case.",
      "content": "Identify the issues of the case. When you identify the issue of a case, you will need to include a statement of the point of law in dispute. This statement should be in the form of a question. The issue of a case is often stated explicitly by the court writing the opinion, but sometimes you may have to tease the issue out. [4] X Research source For example, the issue in Roe v. Wade might be stated like this: Does the Texas abortion statute violate the Ninth Amendment to the United States Constitution?"
    },
    {
      "title": "Include the court's holding.",
      "content": "Include the court's holding. The holding of a case is a statement of law that directly answers the question posed in the issue. This is the majority's basic answer to the legal question and should include the vote count if there is one. [5] X Research source For example, the holding of Roe v. Wade is: (Vote: 7-2) Yes: The Texas statute is unconstitutional because the Constitution and the Ninth Amendment recognizes the right to an abortion."
    },
    {
      "title": "Ascertain the rule of law.",
      "content": "Ascertain the rule of law. This is the rule the court applies to determine the holding of the case. The rule could come from a statute, judicial opinion, or regulation. While the rule may be explicitly stated in the opinion, it may also be implied. [6] X Research source In Roe v. Wade , the rule of law is the test used to reach the holding, which was that the Texas statute was unconstitutional. In that case, the rule of law was announced that during the first trimester of pregnancy, most abortion regulations would be invalid. During the second trimester of pregnancy, some regulations may be okay. During the third trimester, abortions can be outlawed."
    },
    {
      "title": "Describe the court's reasoning.",
      "content": "Describe the court's reasoning. The reasoning is how the court applies the rule to a particular set of facts. This section is extremely important when you are trying to identify the material facts of a case. If you can correctly identify a court's reasoning, you will be able to quickly find the important facts as well. [7] X Research source Within the reasoning, a court will explain the particular facts of the case that lead them to use the law they did and to decide the outcome the way they did. For example, in Roe v. Wade , the court reasoned that a woman has a privacy right, as well as an interest in avoiding physical and psychological harm, and therefore abortions cannot be outright denied. The court further stated that while the state of Texas had legitimate interests in banning abortions, those interests had to be balanced with the interests and rights of the female. As a pregnancy progresses, the interests of the state become stronger. This reasoning gives you clues to what some material facts might be. For example, the fact that Texas' abortion law was an absolute prohibition is material. This is the case because the court concludes that while Texas has interests, they have to be balanced. Put a different way, if Texas' law would have allowed abortions in some circumstances, perhaps the case would have turned out differently."
    },
    {
      "title": "Understand what a material fact is.",
      "content": "Understand what a material fact is. A \"material fact\" is a fact that is crucial to the determination of an issue at hand. [8] X Research source Without this particular fact, the court's determination of the issue would have been different. Material facts can also be thought of as those facts which a party would use to prove his or her case. [9] X Research source Think about who the parties are, what their dispute is, and how they got to where they are."
    },
    {
      "title": "Keep in mind the particular subject you are concerned with.",
      "content": "Keep in mind the particular subject you are concerned with. Case briefing helps you put cases in context. [10] X Research source However, cases are rarely only about a single issue. The court's opinion may cover more issues than are relevant to the subject upon which you are focused. This additional information can distract you from the purpose of your assignment. For example, if you are briefing a case for your contracts course about an office lottery pool, you will want to focus on what the court says about the agreement between the parties, and pay less attention to what the court says about the tax consequences to the lottery winners."
    },
    {
      "title": "Read the facts of the case.",
      "content": "Read the facts of the case. The court's opinion usually has a recitation of the facts near the beginning. This section tells the story prior to the presentation of the analysis of the facts and applicable law. Although you cannot be certain which facts the court considered material until you have finished reading, highlight or take note of the facts that seem most important to you as you read."
    },
    {
      "title": "Determine how each fact fits in.",
      "content": "Determine how each fact fits in. To do this, look through the case and determine how each fact affects the holding and reasoning of the opinion. If a particular fact affects the holding or reasoning, then it should be considered material. If, on the other hand, a fact does not have any bearing on the holding or reasoning, you can safely assume it is not a material fact. [11] X Research source You should brief your entire case before determining the material facts for this reason. If you know the holding and the reasoning, you will be able to better analyze the facts. In general, if a fact is brought up in the reasoning of a case, it is likely going to be a material fact. For example, in Roe v. Wade , ask yourself how the fact that the Texas statute outlawed all abortions affects the holding and reasoning of the case."
    },
    {
      "title": "Identify the material facts.",
      "content": "Identify the material facts. For each factual detail, ask yourself, \"If this fact were changed, would the outcome of the case be different?\" This helps you separate the material facts from immaterial background information and explain why the court reached the conclusion that it did. Example A: The plaintiff emailed a contract to the defendant. The plaintiff and defendant disagree on specific terms of the contract. Thus, the method of sending the contract is not a material fact, because the method of transmission does not affect the court's interpretation of the terms of the contract. Example B: The plaintiff emailed a contract to the defendant. The defendant refuses to perform because the contract did not arrive in time. Plaintiff sues for nonperformance. Now the method of sending the contract is a material fact, because the details of the method of transmission, whether by email, postal service, etc., is necessary for the court determine whether the contract arrived in time."
    },
    {
      "title": "Create a statement of facts to include in your brief.",
      "content": "Create a statement of facts to include in your brief. When you include your statement of facts in your case brief, identify the parties and their relationship and identify the material facts of the case. Try writing the statement of facts in chronological order so as to create a mini story of the important pieces of the case. [12] X Research source"
    }
  ]
}