{
  "url": "https://www.wikihow.com/Emotional-Parentification",
  "title": "Emotional Parentification: What It Is and Why It Hurts",
  "steps": [
    {
      "title": "Parentification is a role reversal between parent and child.",
      "content": "Parentification is a role reversal between parent and child. With emotional parentification in particular, the parent leans on their child for emotional support in ways that aren't age-appropriate. Essentially, the parent expects the child to meet their emotional needs on a regular basis. Here are some examples: [1] X Research source A single mother discusses her dating life with her daughter and depends on her daughter for support when she's upset. A parent comes home frustrated after work and complains about their boss to their children, expecting their children to comfort and support them. A child comforts their parent when their other parent is physically or emotionally abusive."
    },
    {
      "title": "The child feels like they have to be responsible.",
      "content": "The child feels like they have to be responsible. A parentified child often feels as though they grew up too fast and never really got to have a childhood. They've taken on parental stress about adult situations and this can fill them with a sense that they're mature beyond their years. But at the same time, if they let go and be a kid, they're afraid everything will fall apart. [2] X Research source People may compliment the child that they're \"so responsible\" or \"so mature,\" but these aren't necessarily good things in the life of a child. Kids need to be able to be kids and not have their heads filled with adult problems and adult responsibilities."
    },
    {
      "title": "The child feels like they have to be the peacemaker.",
      "content": "The child feels like they have to be the peacemaker. Emotionally parentified kids often mediate between their parents or between a parent and a sibling. They feel as though it's their responsibility to calm down a parent who's angry. When there's an argument, the parentified kid might think whatever happens is their fault because they didn't step in soon enough. [3] X Research source Parentified kids often take on this role in other contexts or with other people. So, for example, a parentified kid might step in to mediate between a friend's parents who are arguing, just as they would for their own parents."
    },
    {
      "title": "The child has more empathy than most children their age.",
      "content": "The child has more empathy than most children their age. Because parentified kids are often responsible for a lot of parenting duties as well as being an adult friend for one or both of their parents, they develop empathy really quickly. They understand other people better than most kids and can understand where they're coming from and what they need. [4] X Research source A parentified child who is also abused can be even more highly attuned to differences in mood that could signal someone is about to fly off the handle. Having a greater sense of empathy seems like a good thing (and it can be), but for most parentified kids this is actually a survival mechanism they use so they can maintain at home."
    },
    {
      "title": "The child offers advice on adult situations.",
      "content": "The child offers advice on adult situations. Children really shouldn't have any advice to offer adults when they're talking about situations the child has likely never experienced. But if a child was emotionally parentified, their parent likely asked them for advice in similar situations, so they know what to say. [5] X Research source This is another situation where adults might praise a child for having an old soul or being wise beyond their years, but this really isn't a good thing. The parentified child has a hard time just being a kid because they can see how difficult adulthood is."
    },
    {
      "title": "The child provides emotional support for their parents.",
      "content": "The child provides emotional support for their parents. This is the ultimate role reversal because it really should be the other way around. Parents are supposed to provide emotional support for their kids and lean on other adults for the emotional support they need. [6] X Research source Kids in this situation are also often forced to bury their own emotions rather than express them openly. If they do try to express their emotions, their parents will likely scold them."
    },
    {
      "title": "Difficulty trusting other people",
      "content": "Difficulty trusting other people Parentified kids grow up not feeling as though they can rely on their parents to provide the support they need. This can mean that as adults, they don't feel comfortable relying on other people, either. They might naturally assume that they can't depend on anybody but themselves. [7] X Research source This might come across as though they're extremely independent people, but it can also cause them to have a hard time getting close to anyone else. Because trust is so important for a strong, healthy relationship, adults who were parentified as kids often struggle with romantic relationships."
    },
    {
      "title": "Problems with emotional regulation",
      "content": "Problems with emotional regulation Emotionally parentified kids are frequently led to believe that emotions are bad things. They're taught to hide or bury their emotions or made to feel guilty for having perfectly normal feelings. As an adult, this can mean that they don't have a good handle on their emotions or know how to deal with them properly . [8] X Research source Some parentified kids become violent or aggressive as adults, in part because of this difficulty regulating their emotions."
    },
    {
      "title": "High levels of emotional stress",
      "content": "High levels of emotional stress There's no question that handling adult emotional issues as a child causes a lot of stress on that child. Parentified kids are likely to carry those high levels of stress into adulthood. Often, they believe that they're responsible for making sure that everyone around them is okay. If someone is facing a tough situation or feeling down, an adult who was a parentified child often feels as though it's their fault. [9] X Research source #*These high levels of emotional stress can lead to anxiety and other physical symptoms, such as headaches and stomachaches."
    },
    {
      "title": "Increased likelihood of engaging in risky behavior",
      "content": "Increased likelihood of engaging in risky behavior Parentified kids are forced to grow up fast and might feel as though they missed out on the carefree days of youth. As an adult, they might tend to go out and get drunk or high, engage in risky sexual encounters, gamble, or get involved in other risky or dangerous activities. [10] X Research source Some of this is also tied up in feeling as though they need to cut loose or do something to relieve the constant stress and pressure they feel."
    },
    {
      "title": "Persistent feelings of guilt and shame",
      "content": "Persistent feelings of guilt and shame As a parentified kid, they were typically made to feel guilty for doing—or wanting to do—normal childlike things. This guilt can carry over into adulthood so that they feel guilty for doing anything that they want to do—or not doing something that they don't want to do. They often feel as though it's their responsibility to take care of others, and saying \"no\" is something that they'll feel immediately guilty about. [11] X Research source Parentified kids also tend to grow up with the idea that not being supportive and helpful to others is something to be ashamed of. For example, an adult who was parentified as a child might feel ashamed or guilty because they go to the movies with a friend instead of canceling those plans to help their mother with a home repair."
    },
    {
      "title": "Increased risk of depression and anxiety",
      "content": "Increased risk of depression and anxiety Studies have shown that parentified kids are far more likely than others to have bouts of depression and anxiety as adults. For some of them, these issues are a chronic and consistent part of their life as adults. [12] X Research source Therapy and medication can help with these symptoms of depression and anxiety. Unfortunately, parentified kids also might feel ashamed or guilty about seeking treatment."
    },
    {
      "title": "Inability to set healthy boundaries",
      "content": "Inability to set healthy boundaries Parentified kids grow up with parents who don't set appropriate boundaries or model healthy boundary setting. This means that as adults, parentified kids might not even have a good idea what boundaries are or why they're important. [13] X Research source Many parentified kids also have low self-esteem as adults, which goes right along with the inability to set boundaries. Setting boundaries is an act of self-care and someone with low self-esteem might believe they aren't entitled to do that. As adults, parentified kids likely believe that if they set boundaries they will disappoint someone, and they typically believe it's their job to make everyone happy."
    },
    {
      "title": "Difficulty forming healthy relationships",
      "content": "Difficulty forming healthy relationships Because parentified kids don't have healthy relationships with their parents, they often find it hard to have healthy relationships with other people as adults. This includes both romantic and platonic relationships. [14] X Research source This also includes the risk that the adult who was a parentified child will end up parentifying their own child, simply because it's the only way they know. [15] X Research source"
    },
    {
      "title": "The parent has an alcohol or substance use disorder.",
      "content": "The parent has an alcohol or substance use disorder. When a parent is addicted to alcohol or other substances, they aren't able to care for their child properly. They might also lean on their child for emotional support—especially if they're regularly drunk or high around the child. It becomes the child's responsibility to look after their parent, rather than the other way around. [16] X Research source With an addicted parent, instrumental parentification is also common. With this type of parentification, the child is expected to do things to keep the household running, such as cleaning, paying bills, or cooking meals."
    },
    {
      "title": "The parent has a physical or mental illness or disability.",
      "content": "The parent has a physical or mental illness or disability. Both emotional and instrumental parentification are common with an ill or disabled parent—especially if that parent is single or has an unreliable partner. While a disabled parent might not intentionally parentify their child, it's often the case that the child grows up acutely aware of things their parent isn't capable of. An empathetic child will do what they can to help their parent out, even doing things that aren't age-appropriate. [17] X Research source For example, an emotionally parentified child might comfort their parent when they have a panic attack."
    },
    {
      "title": "The parent is emotionally immature.",
      "content": "The parent is emotionally immature. If a parent has difficulties understanding or regulating their own emotions , they might frequently depend on their child to meet their emotional needs. Emotionally immature parents also have difficulty setting healthy boundaries and might not understand that it isn't appropriate to have their child meet those needs. [18] X Research source For example, an emotionally immature parent might complain to their child about their relationship with the other parent or ask their child for advice when they get into an argument with the other parent. Emotionally immature parents might also get uncomfortable or upset when their child has a problem or expresses their emotions, which encourages the child to bury their feelings rather than express them."
    },
    {
      "title": "The parent doesn't have a strong support system.",
      "content": "The parent doesn't have a strong support system. If a parent lacks close adult friends or family to talk to, they might turn to their child. They might not even realize that they're saddling their child with adult problems that the child shouldn't have to deal with at a young age. [19] X Research source For example, the parent might go to their child for advice on a work-related issue or ask their child to help them decide who they want to date."
    },
    {
      "title": "The parent experienced neglect or abuse as a child.",
      "content": "The parent experienced neglect or abuse as a child. If a parent was neglected or abused as a child and became parentified themselves, it's possible that they will continue the cycle by parentifying their own child. This can happen regardless of whether the parent is also neglectful or abusive. [20] X Research source In this situation, the parent might not be parentifying the child on purpose—it's just that this type of parent-child relationship is the only relationship they've ever known."
    },
    {
      "title": "The relationship between the two parents is abusive.",
      "content": "The relationship between the two parents is abusive. If one of the child's parents is abusive towards the other, the child might become emotionally parentified by the non-abusive parent. The child will naturally want to comfort or even protect that parent and the parent might come to rely on the child for the solace they don't get from their abusive partner. [21] X Research source This can also happen if someone else in the family is physically or emotionally abusive to one of the child's parents."
    },
    {
      "title": "The parent is neglecting or abusing the child.",
      "content": "The parent is neglecting or abusing the child. Emotional parentification can go hand-in-hand with other neglectful or abusive behavior. Children who are sexually abused can also experience emotional parentification if the abusive parent expects the child to basically fulfill the same role as a romantic partner. [22] X Research source In abusive situations, the child may essentially parentify themselves as a way to protect themselves and their siblings from further physical or emotional abuse. [23] X Research source"
    },
    {
      "title": "The parent is dealing with overwhelming responsibilities.",
      "content": "The parent is dealing with overwhelming responsibilities. If a parent is working multiple jobs or has a lot of kids, they might emotionally parentify one or more of their children. This is especially likely with the oldest child of a single parent because the parent might come to rely on that child to fulfill the same responsibilities a partner would. [24] X Research source For example, the parent might come home drained after work and expect their child to comfort and care for them."
    },
    {
      "title": "The family is facing particularly difficult circumstances.",
      "content": "The family is facing particularly difficult circumstances. Financial difficulties, a death in the family, and other issues sometimes mean a child has to step up and provide emotional support for their parent even though it should be the other way around. Parents who talk to their kids about their adult problems and their difficulties coping are expecting their children to support them through those difficult circumstances the same way a partner or adult friend would. [25] X Research source Other people in the family can cause emotional parentification of a child as well. For example, a son whose father has died might be told by his uncle that he is the man of the house now."
    },
    {
      "title": "Parentification is psychological trauma and can be abusive.",
      "content": "Parentification is psychological trauma and can be abusive. Sometimes, emotional parentification happens because of circumstances outside of anyone's control, such as a death in the family. When this happens, it's not necessarily abusive but it's still traumatic for the child. A parent who intentionally parentifies their child, on the other hand, would be considered emotionally abusive. [26] X Research source Sometimes parentification accompanies other types of abuse as well. For example, if a child has a physically abusive parent, they might become emotionally parentified because they care for and provide emotional support for their siblings or their other parent."
    },
    {
      "title": "Seek therapy to discuss your childhood trauma.",
      "content": "Seek therapy to discuss your childhood trauma. There are several different models of therapy that have helped adults heal from their childhood as parentified kids. Look for a therapist who has experience dealing with parentification, relational problems, and adults with childhood trauma. [27] X Research source A therapist can help you talk about the trauma you experienced and validate your feelings. They can also teach you how to better express and deal with your emotions . If you were a parentified kid, it's totally normal for you to feel ashamed or guilty about seeking help for yourself. Just remember that you deserve to feel good about yourself and take care of yourself ."
    },
    {
      "title": "Try family therapy with your parent.",
      "content": "Try family therapy with your parent. If you want to build a healthy relationship with the parent who parentified you, a therapist can help. The therapist typically serves as a mediator to help you talk about your childhood with your parent and discuss ways that things could have been handled differently. [28] X Research source Keep in mind that this type of therapy is typically only beneficial if both you and your parent are interested in reconnecting and healing from the past. If your parent believes that they did nothing wrong, you might have a hard time getting them to go to therapy with you."
    },
    {
      "title": "Show compassion to yourself through re-parentification.",
      "content": "Show compassion to yourself through re-parentification. With this method, you figure out how the ways you learned to adapt as a child might be working against you now. When you've identified those survival mechanisms you used as a child, you can start to correct them and alleviate some of the damage done by emotional parentification. [29] X Research source When you re-parent yourself, you treat yourself with kindness and allow yourself to feel and express your emotions. You have patience with yourself and recognize that you're not perfect and you don't have to be perfect. Reparenting yourself is about accepting yourself and loving yourself as you are. It's a process that takes time, but paying attention to your feelings and validating them is the first step."
    },
    {
      "title": "Start a meditation practice.",
      "content": "Start a meditation practice. Meditation helps you retrain your brain to live in the moment rather than worrying about what's happened in the past or what might happen in the future. This also lowers your stress levels and can help decrease any anxiety you might have. [30] X Research source You might also try yoga , which is another good mindfulness practice. Exercise generally, even if it's just getting out for a walk every day, is great for your mental and physical health and will help you on your healing journey."
    },
    {
      "title": "Join a parentification support group.",
      "content": "Join a parentification support group. Often, talking to other people who had similar childhood experiences can make you feel better about yourself and your healing journey. Sharing with others tells you that you're not alone, that other people have gone through similar trauma, and that there is a path to recovery. [31] X Research source Support groups can also help you learn to form healthy relationships with other adults. Since you went through similar things and understand each other, you can also help each other unlearn past habits and behaviors."
    },
    {
      "title": "Write about your feelings in a journal.",
      "content": "Write about your feelings in a journal. Journaling gives you the opportunity to tell your story so it's no longer buried deep inside you. Letting those feelings come to the surface can help you start to heal and recover from parentification. Often, with emotional parentification, children aren't allowed to openly express their emotions. Writing about your feelings in a journal allows you to do that. [32] X Research source If you get in the habit of journaling a little every day, you'll gradually become more comfortable expressing your emotions freely."
    }
  ]
}