{
  "url": "https://www.wikihow.com/Cut-Frozen-Meat",
  "title": "How to Cut Frozen Meat",
  "steps": [
    {
      "title": "Pick a heavy-duty knife with a serrated edge for smooth cuts.",
      "content": "Pick a heavy-duty knife with a serrated edge for smooth cuts. Choose a chef’s knife that feels heavy in your hand and has a serrated edge so you can easily cut through the meat. Make sure the knife is sharp so it doesn’t leave a jagged edge when you make your cut. If you don’t have a knife in your kitchen that will work, visit a kitchen specialty store and ask the employees for a knife that cuts through frozen meat. [1] X Research source Using a standard knife works best for thin cuts of boneless meat, such as chicken breasts, sausages, or tenderloins. Alternatively, you can also chop the frozen meat with a butcher’s cleaver, but it can be more dangerous if the blade slips."
    },
    {
      "title": "Hold the meat underneath cold running water for 2-3 minutes to soften it.",
      "content": "Hold the meat underneath cold running water for 2-3 minutes to soften it. Knives will slip off the meat you’re trying to cut if it’s still frozen solid. Turn your faucet onto the coldest water you can and hold the meat underneath the stream. Rotate the meat while you hold it under the water until the outer edges are soft, which usually takes a few minutes. [2] X Research source You can leave the meat inside its packaging or you can remove it before you run it underwater."
    },
    {
      "title": "Hold the cut of meat firmly against a cutting board.",
      "content": "Hold the cut of meat firmly against a cutting board. Use a wooden cutting board when you cut meat so you don’t accidentally contaminate other surfaces. Put the cutting board on a flat surface and place your cut of meat on top. Use your non-dominant hand to hold the meat against the board so it doesn’t move around while you’re cutting it. Make sure your cutting board is large enough to hold your entire piece of meat or else you’ll need to sanitize the countertops after you make your cuts."
    },
    {
      "title": "Cut through the meat slowly with your knife.",
      "content": "Cut through the meat slowly with your knife. Set the cutting edge of the knife against the meat where you want to make your cut. Hold the meat with your non-dominant hand to keep it stable and prevent injuries. Start slowly sawing into the meat with the serrated edge, being careful not to let the knife slip. Apply a small amount of pressure onto the knife with your dominant hand so it cuts through the middle of the frozen meat. Be sure to hold your knife correctly to avoid the risk of cutting yourself."
    },
    {
      "title": "Plug in your electric knife and wrap the cord around your arm.",
      "content": "Plug in your electric knife and wrap the cord around your arm. Find a flat area of countertop that has an outlet nearby so you can use your knife. Plug the electric knife into the outlet and guide the cord so it’s on the same side of your body as your dominant hand. Loop the cord once around your arm so it doesn’t get in the way while you’re cutting the meat. [3] X Research source Electric knives work best for boneless cuts of meat that are shorter than the length of the knife blade. You can buy electric knives from the kitchen section in most department stores or online."
    },
    {
      "title": "Use the switch or trigger on the electric knife to start it.",
      "content": "Use the switch or trigger on the electric knife to start it. Set the serrated edge of the knife blade against the meat where you want to make your cut. Hold the meat in place with your non-dominant hand so your fingers are away from the blade. When you’re ready to start cutting, pull the trigger or press the button on the handle to start the blade. [4] X Research source Keep your fingers away from the blade while the electric knife is running since it will easily cut you."
    },
    {
      "title": "Push the electric knife through the frozen meat.",
      "content": "Push the electric knife through the frozen meat. The blade on the electric knife quickly saws back and forth to make it easier to cut through your meat. Apply a small amount of pressure and push it down into the meat while the knife is running to cut through it. If your knife still has trouble cutting the meat, push and pull the knife back and forth to help guide it. [5] X Research source Be careful when you first start cutting so the knife doesn’t slip toward your fingers. Cutting through meat that’s frozen solid could damage or dull your knife blades."
    },
    {
      "title": "Rotate the piece of meat if your cut doesn’t go completely through it.",
      "content": "Rotate the piece of meat if your cut doesn’t go completely through it. When you get about halfway through the cut of meat, turn the piece on its side so your first cut faces toward you. Align your blade with the cut you already made and turn on the knife again to cut through the remaining meat. Apply a small amount of pressure to guide the blade down to finish your cut. [6] X Research source If you have a thick piece of meat, you may have to rotate it multiple times to cut through it."
    },
    {
      "title": "Wear a safety glove on your non-dominant hand in case your saw slips.",
      "content": "Wear a safety glove on your non-dominant hand in case your saw slips. A safety glove is made of metal links and helps protect your hands from cuts. Put the safety glove on your non-dominant hand and use it to hold the meat firmly against a cutting board. Make sure you have a firm grip on the meat without putting any of your fingers over the area you plan on cutting. [7] X Research source You can buy a safety glove from a kitchen specialty store or online."
    },
    {
      "title": "Place the cutting edge of the saw on your meat where you want to cut.",
      "content": "Place the cutting edge of the saw on your meat where you want to cut. Hold the handle of the saw in your dominant hand with a firm grip. Set the teeth of the saw blade against your meat where you plan on cutting so you have a good starting point. Keep the blade of the saw pointing straight in front of you so you can easily cut into the meat. [8] X Research source Butcher saws work well with larger cuts of frozen meats, like shoulders or ribs, and they can cut through bones. You can buy a butcher saw online or from kitchen specialty stores."
    },
    {
      "title": "Push and pull the saw through the meat to cut through it.",
      "content": "Push and pull the saw through the meat to cut through it. When you’re ready to start, apply firm downward pressure on the saw so it doesn’t slip while you’re cutting. Hold the meat still with your non-dominant hand, making sure your fingers are away from the saw. Keep pushing and pulling the saw blade through the meat until you cut completely through it. Try to maintain the same speed if throughout your cut so you don’t have any jagged edges. [9] X Research source If it’s difficult to cut through the meat, try turning it on its side and continuing your cut."
    }
  ]
}