{
  "url": "https://www.wikihow.com/Dispose-of-Mercury",
  "title": "How to Dispose of Mercury",
  "steps": [
    {
      "title": "Leave the room while you plan.",
      "content": "Leave the room while you plan. Do not spend time in areas where mercury has been spilled until you are prepared to clean it up. Close all doors, windows, and vents leading to other rooms of the building, and open windows leading to the outside. Let everyone in the area know that the room is off-limits, or leave a sign on the door. Make special effort to ensure that children stay away. Only turn on a fan if you can blow the air to an outdoor window that does not lead to another residence. If possible, lower the temperature in the room to reduce the spread of the mercury vapor."
    },
    {
      "title": "Call a professional for large spills.",
      "content": "Call a professional for large spills. If more than 2 tablespoons (30 milliliters) have been spilled, the spill should be handled by a professional when possible. This is about the size of a pea, or the amount in one mercury thermometer. If the spill is smaller, or finding a professional is not feasible, skip to the next step. Otherwise: Check your local yellow pages or search online for \"Hazardous waste cleanup,\" \"environmental engineers,\" or \"engineering services\" in your area that you could hire. If the mercury was spilled outdoors, phone our local, state, or national environmental response team. In the United States, call 1-800-424-8802."
    },
    {
      "title": "Put on gloves, old clothing, and old shoes, and remove jewelry.",
      "content": "Put on gloves, old clothing, and old shoes, and remove jewelry. Wear rubber, nitrile, latex, or vinyl gloves whenever handling mercury. Wear old clothes and shoes, as you may need to throw them away afterward. Because mercury can react with metals, remove all jewelry and piercings, especially gold. If you do not have a spare pair of disposable shoes, put your shoes in sturdy plastic bags and fix them to your ankle with rubber bands. If you have safety goggles, put them on. This is not vital for cleaning up mercury spills smaller than a pea, but a large spill may require professional-quality eye protection."
    },
    {
      "title": "Sprinkle the area with powdered sulfur (optional).",
      "content": "Sprinkle the area with powdered sulfur (optional). This is not necessary for small home spills, but if you do find a mercury cleanup kit at a hardware store, the powdered sulfur will make the task easier. This yellow powder turns brown in contact with mercury, making detection of small spills easier, and binds with the mercury to make cleanup easier. [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Place small objects and fragments in a puncture-proof container.",
      "content": "Place small objects and fragments in a puncture-proof container. Begin by carefully picking up pieces of broken glass or other small objects that have come into contact with mercury. Place these in a disposable puncture-proof container such as a sharps container or glass jar. If no disposable puncture-proof container is available, instead place a zip-locked bag inside a second zip-locked bag, and fold all broken material inside a paper towel before placing in the bag. Leave tiny specks of broken glass alone for now. We'll handle them later."
    },
    {
      "title": "Bag carpet, clothing, or other soft contaminated material.",
      "content": "Bag carpet, clothing, or other soft contaminated material. If the mercury has spilled onto an absorbent surface, you cannot save this material on your own. A trained professional may be able to help, but if you are cleaning up the spill at home, all you can do is cut out the affected area and discard it in a double trash bag. Never wash this material, as it can contaminate your washing machine or pollute the water or sewage system. [2] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Locate and gather visible beads.",
      "content": "Locate and gather visible beads. Use index cards, small pieces of cardboard, or a disposable squeegee to slide beads of mercury along hard surfaces, pooling them into one location. To locate more mercury, dim the lights and hold a flashlight low to the floor, looking for glints. [3] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Mercury can scatter quite far, so check the entire room."
    },
    {
      "title": "Transfer the mercury with an eyedropper.",
      "content": "Transfer the mercury with an eyedropper. Use an eyedropper to pick up the beads of mercury. Slowly squeeze each bead onto damp paper towel, fold the paper towel, and place it inside a zip-locked bag. [4] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Pick up tiny beads and shards.",
      "content": "Pick up tiny beads and shards. Small beads of mercury or tiny pieces of broken glass can be picked up with sticky tape. Wrap the sticky tape around your gloves finger, with the sticky side out, then pick up the contaminants and place the tap inside a zip-locked bag. Alternatively, dab shaving cream onto a disposable paint brush and use the brush to pick up the mercury. Place the paint brush in the bag along with the mercury. Do not apply shaving cream directly to a mercury-contaminated brush."
    },
    {
      "title": "Bag all contaminated clothing and tools.",
      "content": "Bag all contaminated clothing and tools. This includes shoes that walked over the contaminated area, clothing that mercury dripped on to, and any tools that came into contact with mercury."
    },
    {
      "title": "Continue to ventilate to the outside for 24 hours.",
      "content": "Continue to ventilate to the outside for 24 hours. If possible, leave windows to the outside open for 24 hours after cleanup. Keep children and pets outside of the contaminated room during this time. In the meantime, continue to the next section for information on getting rid of your contaminated materials."
    },
    {
      "title": "Seal and label all trash containers.",
      "content": "Seal and label all trash containers. Tightly seal all containers used for mercury disposal. Clearly label them as \"Mercury Waste Disposal — Do Not Open.\""
    },
    {
      "title": "Check whether waste contains mercury.",
      "content": "Check whether waste contains mercury. Many household products contain mercury. While these are typically harmless unless the product breaks, these still need to be disposed of as hazardous waste, not in the regular trash. Refer to this abbreviated list of common household mercury-containing items: Compact Fluorescent Light bulbs (CFL) Liquid Crystal Display monitors (LCD) on television or computer screens Button batteries in toys or phones (but not lithium button batteries) Any object containing a silver liquid."
    },
    {
      "title": "Search Earth911 for a recycling location.",
      "content": "Search Earth911 for a recycling location. Visit search.earth911.com and enter the type of object you are recycling, and your city or zip code. A list of nearby addresses should appear that can recycle your mercury waste. Earth911 provides best results for United States addressed, but some international cities are included."
    },
    {
      "title": "Contact the manufacturer.",
      "content": "Contact the manufacturer. Some companies will take back their products for recycling. These include Lowes, Home Depot, and IKEA. [5] X Research source"
    },
    {
      "title": "Contact a local environmental regulation office.",
      "content": "Contact a local environmental regulation office. If you cannot find a nearby recycling center, search online for an \"environmental regulation office\" or \"environmental health department\" in your area that can inform you about legal disposal requirements. If you have a large amount of mercury to dispose of, you may be required to dispose of it through a professional or government cleanup service."
    }
  ]
}