{
  "url": "https://www.wikihow.com/Filter-Email-in-Outlook",
  "title": "How to Filter Email in Outlook",
  "steps": [
    {
      "title": "Click a message sent to or from an address you want to filter.",
      "content": "Click a message sent to or from an address you want to filter. This opens the message in the right panel. For example, if you want to filter all mail sent from one email address, click an email from that sender. If you want to filter messages sent to one of your email addresses, click a message addressed to that address."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It’s near the top-left corner of the window."
    },
    {
      "title": "Click Rules.",
      "content": "Click Rules . It’s in the row of icons near the top of the screen, toward the center. If you don't see this option, click the three dots at the far-right corner of the toolbar. You can also right-click a message or folder and select Rules . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Always Move Messages From <sender> or Always Move Messages To <address>.",
      "content": "Click Always Move Messages From <sender> or Always Move Messages To <address> . A list of folders on your account will appear. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select the folder to which you want these messages filtered.",
      "content": "Select the folder to which you want these messages filtered. If you don’t see a folder you want to use, click New to create one, then select it. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click OK.",
      "content": "Click OK . Future email sent to or from the email address you selected will be moved to the selected folder upon receipt."
    },
    {
      "title": "Click a message containing a word or phrase you want to filter.",
      "content": "Click a message containing a word or phrase you want to filter. The word or phrase can be anywhere in the message, such as the subject, body, or header."
    },
    {
      "title": "Click the Home tab.",
      "content": "Click the Home tab. It’s near the top-left corner of the screen."
    },
    {
      "title": "Click Rules.",
      "content": "Click Rules . It’s in the row of icons near the top of the screen, toward the center. If you don't see this option, click the three dots at the far-right corner of the toolbar. You can also right-click a message or folder and select Rules ."
    },
    {
      "title": "Click Manage Rules & Alerts.",
      "content": "Click Manage Rules & Alerts . [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click New Rule.",
      "content": "Click New Rule . It’s at the top-left corner of the window."
    },
    {
      "title": "Select Move messages with specific words in the subject to a folder.",
      "content": "Select Move messages with specific words in the subject to a folder . Even if you don’t want to filter only words in the subject, select this option for now. [5] X Research source"
    },
    {
      "title": "Click Next.",
      "content": "Click Next . A list of options and check boxes will appear. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Remove the check mark from “with specific words in the subject.”",
      "content": "Remove the check mark from “with specific words in the subject.” You can skip this step if you only want the filter to look at words in the subject line."
    },
    {
      "title": "Select the parts of the message where the filter will look for the words.",
      "content": "Select the parts of the message where the filter will look for the words. Choose at least one of these options: with specific words in the subject or body Example: You want to filter messages with the word “coupon” in either the subject or the body to a folder called Coupons. with specific words in the message header Example: You want messages sent through a certain mail server to go straight to the trash. with specific words in the recipient’s address Example: You want mail sent to support@yourdomain.com to go to a folder called Support. with specific words in the sender’s address Example: You want messages sent from anyone with the word “wiki” in their email address to a folder called Wiki."
    },
    {
      "title": "Click Next.",
      "content": "Click Next ."
    },
    {
      "title": "Type the word or phrase and click Add.",
      "content": "Type the word or phrase and click Add . You can add multiple words and phrases if you wish. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This brings you back to the list of filter conditions. [8] X Research source"
    },
    {
      "title": "Click the specified link.",
      "content": "Click the specified link. It’s in the box at the bottom of the window as a part of the phrase “specified folder.” A list of folders on your email account will appear. [9] X Research source"
    },
    {
      "title": "Select the folder you to which you want these messages filtered.",
      "content": "Select the folder you to which you want these messages filtered. If you don’t see a folder you want to use, click New to create one, then select it. [10] X Research source"
    },
    {
      "title": "Click OK.",
      "content": "Click OK ."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . Now you’ll see a list of actions Outlook can take based on the filter you created."
    },
    {
      "title": "Check the boxes next to what you’d like to happen.",
      "content": "Check the boxes next to what you’d like to happen. Make sure “move it to the specified folder” (the second option) is checked so the message lands in its folder. The others are optional, but can be helpful based on your needs."
    },
    {
      "title": "Click Next.",
      "content": "Click Next ."
    },
    {
      "title": "Enter a name for the filter.",
      "content": "Enter a name for the filter. This is how it will appear in your list."
    },
    {
      "title": "Check the box next to “Turn on this rule.”",
      "content": "Check the box next to “Turn on this rule.” If you’d like, you can also check “Run this now” so the filter will scan the mail you’ve already received."
    },
    {
      "title": "Click Finish.",
      "content": "Click Finish . Future incoming messages will now be sorted based on the word or phrase you entered. [11] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open Microsoft Outlook.",
      "content": "Open Microsoft Outlook. It’s usually in the Microsoft Office folder, which you’ll find in the All Apps area of the Start menu. You'll want to use this method to search or filter all your current email."
    },
    {
      "title": "Click Filter Email.",
      "content": "Click Filter Email . This is next to a funnel icon in the \"Find\" grouping of the Home tab. [12] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Select your filter.",
      "content": "Select your filter. You can see all the emails marked as unread, has attachments, when they were received, if they are categorized, flagged or marked important, or based on the \"Sent to\" field. For example, if you select \"Has attachments,\" you will see a list of emails that have attachments (even if they are categorized into email folders that aren't the Inbox). To clear the filter search, click the x in the search box. [13] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}