{
  "url": "https://www.wikihow.com/Get-Skyscrapers-in-SimCity-4",
  "title": "How to Get Skyscrapers in SimCity 4",
  "steps": [
    {
      "title": "Focus mainly on commercial districts.",
      "content": "Focus mainly on commercial districts. You will not get any commercial skyscrapers at all unless you have an office population of at least 5,000 workers. Once you reach that milestone, you can build a stock market which attract large buildings."
    },
    {
      "title": "Make sure your area is desirable enough.",
      "content": "Make sure your area is desirable enough. A good commercial area will be away from industrial parts of the city and have several plazas nearby, along with a high land value. Also be sure that the commute is okay. This means that there are residential areas nearby and it doesn't take long for Sims to get from their homes to the business area."
    },
    {
      "title": "Give your city good highway and freeway connections.",
      "content": "Give your city good highway and freeway connections. Freeways are a good choice because they support far more traffic than other roads. It is definitely needed if your city has commuters from other cities. For shorter distances, like just across town, avenues work well also."
    },
    {
      "title": "Give your city enough power and water.",
      "content": "Give your city enough power and water. Make sure you have high density zones, because taller buildings cannot develop on low density land plots. You will also need Hi-Tech Industrial zones in your region or city."
    },
    {
      "title": "Make sure your taxes aren't too high.",
      "content": "Make sure your taxes aren't too high. Low taxes means less income, but more people will come."
    },
    {
      "title": "Get your city population to 45,000.",
      "content": "Get your city population to 45,000."
    },
    {
      "title": "Make sure the area you want skyscrapers in has good commute time.",
      "content": "Make sure the area you want skyscrapers in has good commute time."
    },
    {
      "title": "Rezone all the buildings to high density residential.",
      "content": "Rezone all the buildings to high density residential."
    },
    {
      "title": "Make sure you have demand for residential and put the game on cheetah speed.",
      "content": "Make sure you have demand for residential and put the game on cheetah speed."
    }
  ]
}