{
  "url": "https://www.wikihow.com/Draw-a-Church",
  "title": "How to Draw a Church",
  "steps": [
    {
      "title": "Understand the Church.",
      "content": "Understand the Church. To make a good Church you must first understand the size of the Church. The Church must fit well on the drawing surface or paper. So justify your desired Church figure as to how far and wide it will stretch so it fits well."
    },
    {
      "title": "Understand the dimension of the Church.",
      "content": "Understand the dimension of the Church. The Church will not be visible from all four sides on a sheet of paper. Understand which sides of the Church will be displaying in your drawing. This sets the view or the perspective of the drawing. The front view will look larger and the back side of the Church will look narrow. This narrowness shows that the Church is small or big. The more narrow it gets from front to back, the bigger the Church appears. Draw the lines keeping the Church's walls in mind. The lines of the walls will start straight and end in a slope depending upon your design in mind."
    },
    {
      "title": "Sketch a shape that looks like a house.",
      "content": "Sketch a shape that looks like a house. This is like a rough outline for your understanding. Once you being drawing from a direction either left, right, top or bottom, you can develop on it as you draw more. As you progress, check the original Church image if you have one. If you are drawing a Church on your own with your imagination, then it will appear like your imaginative Church. You may use stencils for drawing perfect shapes or just make triangle from the sides of a rectangle."
    },
    {
      "title": "Add detailing to the Church.",
      "content": "Add detailing to the Church. Draw a tower on top. Add some windows to the walls. The windows could be well-shaped or ornate like in most Churches. Draw the rectangular door in front. You may make the door conical at the top."
    },
    {
      "title": "Draw the entrance.",
      "content": "Draw the entrance. For the entrance you may make steps. Make a straight line on your sketch and create box like figures to add a third dimension to the stairs."
    },
    {
      "title": "Beautify the Church.",
      "content": "Beautify the Church. Depending upon your requirement you may beautify your Church. It is seen that many Churches have colored glass on the doors and windows. You may make a colorful display on the doors and windows to make your drawing look more aesthetic and beautiful. Add some details on it. Create lines that will form different kinds of shapes for the window."
    },
    {
      "title": "Color and outline.",
      "content": "Color and outline. You may try dark colors for the roof and light colors for the windows. You may blend different colors too for creating the illusion of depth and dimension. Outline the drawing with a darker sketch pen or charcoal pencil depending upon your choice of colors. If you are not very proficient with coloring you may use crayons or pencil colors and make very light strokes. As you color, you may play with the light and darker colors. Remember that you can vary the pressure and create a lighter or darker color using the same pencil. To make your drawing more realistic, keep in mind light, shadow, and contrast. A hint to color well is to assign an area where light falls. Like sunlight will not be alike on the east and the west. Hence, one side will be dark, another will be lighter."
    },
    {
      "title": "Create shadow.",
      "content": "Create shadow. Try to put some shadow on it and change the color of the outline. You may darken the areas at the joining of two walls. Make the coloring strokes either horizontal or vertical. If you make dark strokes of color which is showing horizontal and vertical patches of color, it may not look very appealing. Make the colors blend and maintain the coloring strokes in a flow. Start with lighter layers, and add more if you need to make the area darker, or add one color on top of the other to create a different tone."
    }
  ]
}