{
  "url": "https://www.wikihow.com/Fix-Curb-Rash-on-Rims",
  "title": "How to Fix Curb Rash on Rims",
  "steps": [
    {
      "title": "Put on protective gear.",
      "content": "Put on protective gear. You’ll be sanding, using putty, priming, painting, and clear coating to complete this project! It’s important to wear eye protection, gloves, and a mask when working with paint thinner, sandpaper, primer, or paint. [1] X Research source"
    },
    {
      "title": "Sand the scuffed areas with 400-grit sandpaper.",
      "content": "Sand the scuffed areas with 400-grit sandpaper. Use 400-grit sandpaper to even out the metal in the damaged area. Don’t go much beyond the damaged area—there’s no need to do more work than necessary. Keep sanding until the damage is smoothed out. [2] X Research source"
    },
    {
      "title": "Apply spot putty to the scuffed areas and let it dry.",
      "content": "Apply spot putty to the scuffed areas and let it dry. Any kind of automotive spot putty will work. Squeeze a small amount of the product onto a putty knife and use it to fill in the damaged area. Aim to cover the area in a very thin layer. Then, let the putty dry, which typically only takes about 30 minutes. [3] X Research source"
    },
    {
      "title": "Sand the excess putty away with 400-grit sandpaper.",
      "content": "Sand the excess putty away with 400-grit sandpaper. Once the putty is dry, you can sand away the excess. Use 400-grit sandpaper to smooth out the putty until it is even and level with the rest of the rim. [4] X Research source"
    },
    {
      "title": "Add more putty and sand the area again, if necessary.",
      "content": "Add more putty and sand the area again, if necessary. If the damage is deep or you sanded too much of the putty away, you can add more. Use the same technique as before and be sure to let the putty dry before you sand the second layer."
    },
    {
      "title": "Use a scouring pad to remove the clear coat from the rest of the rim.",
      "content": "Use a scouring pad to remove the clear coat from the rest of the rim. Though you could try to exactly match the paint to the color of your rims, it would be a very difficult task. It’s better to repaint the entire rim so it is a single, solid color. For the paint to adhere, the surface can’t be shiny. Use a scouring pad to scuff up the entire rim until it has a matte finish. [5] X Research source"
    },
    {
      "title": "Clean the rims with paint thinner.",
      "content": "Clean the rims with paint thinner. It’s important to clean the rims before moving forward so that the primer and paint will adhere well to the metal. Put a small amount of paint thinner on a lint-free cloth and use it to wipe down the rims. [6] X Research source"
    },
    {
      "title": "Mask the entire car so only the damaged rims are showing.",
      "content": "Mask the entire car so only the damaged rims are showing. Mask off the valve stem, lug nuts, and center cap of the tire. Stuff masking paper or plastic into the holes in the rims to cover the brake pads, too. Put masking tape behind the rim to cover and protect the tires. Then, cover your entire car with masking paper or a drop cloth. Secure all seams with masking tape so that only the damaged rim is showing and the rest of the tire and car is masked. [7] X Research source Spraying the primer and paint can ruin the rest of your car if you don’t mask it properly, so take your time with this step! Alternatively, you could remove the tires from the car so you only have to mask the tire, valve stems, lug nuts, center cap, and brake pads."
    },
    {
      "title": "Spray the primer over the entire rim.",
      "content": "Spray the primer over the entire rim. Shake the can of primer thoroughly before using it. Hold the can about 6 inches (15 cm) from the rim. Then, spray the entire rim using short back-and-forth motions. Work from the top of the rim down to the bottom. Aim to cover the rim in a thin, even layer. [8] X Research source"
    },
    {
      "title": "Allow the primer to dry, then apply a second coat if desired.",
      "content": "Allow the primer to dry, then apply a second coat if desired. The primer should only take about 10-15 minutes to dry. If your first coat is too thin or is uneven, you can apply a second coat using the same method as before. Let it dry for at least 15 minutes before painting over the primer. [9] X Research source"
    },
    {
      "title": "Apply a thin layer of paint to the rim.",
      "content": "Apply a thin layer of paint to the rim. Before you spray the paint, shake the paint can thoroughly. Spray the paint in a thin, even layer over the entire rim. Don’t hold the can too close to the rim—it should be about 6 inches (15 cm) away. Use short strokes and a back-and-forth motion. Start at the top of the rim and work toward the bottom. [10] X Research source Choose a paint color that is as close to the original color of the rims as possible."
    },
    {
      "title": "Apply a second layer of paint after 30 minutes, if necessary.",
      "content": "Apply a second layer of paint after 30 minutes, if necessary. If the paint is uneven or sheer, you can apply another coat. Wait 30 minutes for the first coat to dry, then add another coat using the same method as before. [11] X Research source"
    },
    {
      "title": "Let the paint dry for 2-12 hours.",
      "content": "Let the paint dry for 2-12 hours. For best results, you should allow the paint to dry thoroughly before moving on. If possible, let the paint dry overnight so it is completely set. If you’re in a big hurry, allow the paint to dry for at least 2 hours before adding the clear coat. [12] X Research source"
    },
    {
      "title": "Spray a thin layer of clear coat over the rims.",
      "content": "Spray a thin layer of clear coat over the rims. Shake the can before beginning, and hold it about 6 inches (15 cm) away from the rim. Apply a very thin layer! If you spray too much, it will drip, run, and ruin the look of your rims. Again, work your way from the top of the rim to the bottom, using short back-and-forth strokes. [13] X Research source"
    },
    {
      "title": "Let the clear coat dry for 30 minutes, then add another layer.",
      "content": "Let the clear coat dry for 30 minutes, then add another layer. Avoid touching the rim to see if it’s dry, which could smudge the finish. Instead, wait 30 minutes before adding the second layer. Take your time when spraying the clear coat so that the entire rim is evenly coated. [14] X Research source"
    },
    {
      "title": "Allow the clear coat dry for 12-24 hours.",
      "content": "Allow the clear coat dry for 12-24 hours. It’s best to let the clear coat dry fully before moving on. If the clear coat isn’t dry, you could ruin the finish and have the start the entire project over. If you can’t wait 24 hours, wait at least 12 hours before removing the masking tape. [15] X Research source"
    },
    {
      "title": "Remove the masking tape and replace the center cap.",
      "content": "Remove the masking tape and replace the center cap. Once the clear coat is completely dry, you can remove the masking tape and the masking paper or drop cloths. Don’t forget to replace the center cap as well. [16] X Research source"
    },
    {
      "title": "Polish the rims to restore their shine.",
      "content": "Polish the rims to restore their shine. Pick up rim polish from your local auto parts store. Apply it according to the package directions. This will help restore the shine of the rims and make them look new. [17] X Research source"
    }
  ]
}