{
  "url": "https://www.wikihow.com/Diet-Properly",
  "title": "How to Diet Properly",
  "steps": [
    {
      "title": "Ask yourself why you want to diet.",
      "content": "Ask yourself why you want to diet. Being clear about your reasons and your goals can help you choose an eating plan that makes sense and pays off for you in the way that you hope it will. Manage diabetes. If you've been diagnosed with diabetes, changing your eating habits is a must. Reducing or eliminating sugar from your diet is key to living well with this disease. Reduce your risk of heart disease. Eating foods that will bring down your cholesterol levels and help rid you of excess belly fat can decrease your risk for heart disease. Drop that baby weight. Putting on extra pounds is part of any pregnancy, but at a certain point you may decide that baby fat looks best on your baby and be ready to get back to your pre-pregnancy weight. Get ready for swim suit season. Lots of folks go into diet mode when the weather warms up and the prospect of putting on a swim suit is downright frightening. Sometimes just small changes in your diet can make the difference between being bikini-ready or swim-trunk-terrified."
    },
    {
      "title": "Bulk up.",
      "content": "Bulk up. You might be interested in adding muscle and putting on some extra weight in a way that's healthy. Protein is integral in developing muscle mass, so your diet should focus on maximizing the daily amount of recommended protein."
    },
    {
      "title": "Verify that you can diet safely.",
      "content": "Verify that you can diet safely. Before you take on any new eating plan, it's best to consult with a physician to make sure a diet won't prove dangerous for you. Let your physician know your plan for dieting. Anything under 1200 calories a day can be dangerous. Michelle May, a weight management doctor says, “Rapid weight loss by critical calorie restriction causes water, some fat, and muscle loss, which ultimately decreases metabolism so the body needs fewer calories to survive.” It also causes a shift toward a higher percentage of body fat, which increases the risk for metabolic syndrome and type 2 diabetes. Some people use calories as a way to measure their target food consumption, others base their diet on grams (of protein, whole grains, etc.), while some create lists of foods to eat more of and foods to eat less of. Decide how you'll approach your diet. Review your prescription medications with your doctor. It's important to be sure that your diet plans are in sync with any nutritional guidelines that may be associated with the prescriptions you take. For example, if you take ACE inhibitors to lower your blood pressure you need to watch your intake of bananas, oranges and green leafy vegetables. If you've been prescribed tetracycline you may need to avoid dairy products during the period you take the drug."
    },
    {
      "title": "Analyze your current eating habits.",
      "content": "Analyze your current eating habits. Before you change what you're doing, you need to know what you do now. Keep track of what, when and where you eat for insight into your current eating habits. Keep a food diary. Put a journal in the kitchen or next to your bed and write down what you eat (meals, snacks, those little \"tastes\" from your friend's plate--all of it), the time of day that you eat and where you eat (kitchen table, sofa, bed). Track online. Several websites offer online tools that allow you to track your eating habits electronically. If it's as close as your smartphone, it should be easy for you to keep track."
    },
    {
      "title": "Identify problem areas.",
      "content": "Identify problem areas. We all have different eating habits and \"triggers\" that can cause us to overeat. Being aware of yours is the first step in managing them as part of your new eating plan. Stress. One of the biggest causes of overeating is stress. When we feel under-the-gun or anxious, we often turn to food for comfort. If this is a problem area for you, you may need to include stress management techniques or stock healthier food options to deal with this trigger. Fatigue. When we're tired we're less likely to make good food choices. If you realize you often eat while tired, you'll need to think about how you can get more rest and make sure that you grocery shop when you're feeling your most rested and focused. Loneliness or boredom. Friends all out of town? Can't find something to do? If you discover that you turn to food when you're on your own, you might want to think about supplementing your new diet with some new activities or hobbies that will get you out of the house, keep you engaged and stop you from overeating. Excessive hunger. If you put off eating because of a busy schedule, you may discover that by the time you sit down to dinner you're ravenous and eat everything in sight. If this is a problem area for you, think of how you can schedule mini-meal breaks in your new eating plan."
    },
    {
      "title": "Learn about calories.",
      "content": "Learn about calories. Most dieters report that they count calories, but an overwhelming majority also say that they don't really know how many calories they need. We are trained to think that fewer calories means more weight loss, but really, you need to be mindful of where you calories are coming from, not just how many you consume. [1] X Research source Men report eating an average of 2,600 calories per day, with women consuming about 1,800. You may need less than that if you are trying to lose weight, but you should always eat at least 1,200 calories a day. Any fewer and your body thinks it is in starvation mode. That means it will hold on tightly to fat stores. Ask a registered dietitian or personal trainer to help you figure out how many calories you should eat per day for healthy weight loss. Take into account how active you are. Make your calories work for you. Fill up on foods that have a lot of fiber (whole grains) and protein (lean meats). These will help you feel full longer and give you more energy. Avoid \"empty\" calories that don't give your body much fuel. Alcohol and items like potato chips are good examples of calories that aren't serving much of a nutritional purpose."
    },
    {
      "title": "Follow dietary guidelines.",
      "content": "Follow dietary guidelines. The USDA has dietary recommendations to help ensure you get the proper amount of nutrients from your meals and eat a balanced diet. This means you are getting the proper amount of servings from each of the food groups without eating too much from any one group. You also want to vary the foods you eat in each group — don't only eat apples and no other fruits, for instance. Other key recommendations include: make less than 10% of your daily calories from added sugar; make less than 10% of your daily calories from saturated fats; and consume less than 2,300 mg of sodium daily. [2] X Trustworthy Source Health.gov Online collection of health and fitness standards set by the U.S. Office of Disease Prevention and Health Promotion Go to source In addition, there are specific recommendations for the amounts of foods you should strive to eat every day. These are as follows: Eat nine servings of fruit and vegetables daily. One serving of fruit is equivalent to about 1 cup of chopped fruit or one small piece of fruit. One serving of vegetables is equivalent to 2 cups of loose, leafy greens, or about 1 cup of cut veggies. Eat six servings of grains per day and make at least half of those grains whole grain. One serving of grains is equivalent to one slice of bread or 1/2 cup of cooked rice or pasta. Eat two to three servings of dairy per day, but try to make it low-fat dairy. 1 cup of milk is the equivalent to one serving of dairy. Eat two to three servings of proteins daily. One serving of meat is 3 oz., or about the size of an adult's palm. One serving is also equal to one large egg, 1 tablespoon of peanut butter, 1 ounce of walnuts, and 1/4 cup of beans. Try to \"eat the rainbow,\" meaning eat foods that are a variety of colors (blueberries, red apples, asparagus, etc.). Different colored foods mean you are getting different nutrients and vitamins."
    },
    {
      "title": "Consume more lean protein.",
      "content": "Consume more lean protein. Your body needs protein to build muscle, provide immunity protection and keep your metabolism on track. To get the benefits with none of the detriments that can be associated with protein sources, choose foods that are high in protein and low in fat. Be a fat detective. Pick skim milk rather than whole milk, lean ground beef or ground turkey rather than marbleized ground beef. Look for fat that's hidden--or not so hidden--in your protein choices. Avoid full-fat dairy products, organ meats such as liver, fatty and marbled meats, spareribs, cold cuts, hot dogs and sausages, bacon, fried or breaded meats and egg yolks. [3] X Research source Become a fan of fish. Certain types of fish are rich in omega-3 fatty acids, which can lower blood fats called triglycerides. You'll find the highest amounts of omega-3 fatty acids in cold-water fish, such as salmon, mackerel and herring. [4] X Research source Be one with beans. And peas and lentils--legumes in general are good sources of protein and contain no cholesterol and less fat than meat. Try a soy or bean burger in place of a hamburger or toss some tofu into a veggie stir-fry or salad."
    },
    {
      "title": "Look for whole grain foods.",
      "content": "Look for whole grain foods. Whole grains are the entire seed of a plant and contain three parts: the germ, the bran and the endosperm, so whole grain foods contain all three of these components. Unfortunately, when plants are refined the bran and the germ are removed and about 25% of a grain’s protein and at least 17 key nutrients are lost. To get all the benefits, look for foods that are labeled as whole grain. [5] X Research source Reap the benefits. Studies have documented numerous benefits of a diet rich in whole grains. They include reduced risk of stroke, heart disease, type 2 diabetes, inflammatory disease, colorectal cancer, gum disease and asthma, better weight maintenance, healthier carotid arteries and healthier blood pressure levels. Shoot for 48 g. of whole grains in your diet daily. [6] X Research source Source your supermarket. About 15% to 20% of products on supermarket shelves are whole grains. [7] X Research source Look for products labeled as \"whole grain\" or check to see if a product has the \"Whole Grain\" stamp from the Whole Grains Council. Check multiple food items. It's not just grains, flours and breads that can be whole grain; pastas, cereals, cookies, tortilla chips, pancake mixes and other grain-based products can be labeled whole grain, so read the package carefully."
    },
    {
      "title": "Include healthy fats.",
      "content": "Include healthy fats. Not all fats are bad for you; in fact, some should definitely be a part of your healthy eating plan. Monounsaturated fatty acids (MUFAs) are a healthy type of fat as are polyunsaturated fats and offer certain benefits such as a reduction in LDL cholesterol (the bad kind), an increase or maintenance of HDL cholesterol (the good kind), help stabilize insulin levels and control blood sugar. Foods high in MUFAs include avocados, canola oil, nuts (almonds, cashews, pecans and macadamias plus nut butters), olive oil, olives and peanut oil. Saturated fat is complex. Modern research suggests that it has a fairly neutral effect on your body. While you should not go out of your way to eat saturated fat, you should still be cautious about how much you're eating."
    },
    {
      "title": "Eliminate trans fats.",
      "content": "Eliminate trans fats. Trans fats are oils infused with hydrogen, so you might see them listed as \"hydrogenated\" oil on package labels. They raise bad cholesterol and lower good cholesterol, cause weight gain, increase the risk for heart disease, cancer, stroke and infertility. Among the biggest sources for trans fat are commercially fried food and packaged foods, especially baked goods. Beware of labels claiming no trans fats. The FDA allows food with up to a half-gram of trans fat per serving to be labeled \"trans fat free.\" Eat enough of them and those half-grams add up. Trans fats are so bad for you, New York City has passed a law prohibiting the use of them in restaurants."
    },
    {
      "title": "Read labels.",
      "content": "Read labels. Paying attention to the nutrition labels on food packages can help you make sure that you are making healthy choices. One of the most important parts of the label is the serving size information. This tells you how many servings are in each package, and what the nutrition facts are for each serving. [8] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source You should also note how many calories are in each meal. Try to limit the following nutrients: trans fats, saturated fats, and sodium. These are not only linked to obesity, but also to heart disease and high blood pressure. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [10] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source [11] X Research source Look for foods that have significant amounts of fiber, vitamin A, vitamin C, iron, vitamin D, and calcium. Your dietitian can help ensure you are getting all the nutrients you need and in the proper quantities."
    },
    {
      "title": "Cook.",
      "content": "Cook. Eating out or buying prepared foods is convenient, fast, and easy. But it also means that you can't control how your food is prepared or what ingredients are used. One of the most effective ways to lose weight is to cook your meals at home. You can choose healthy cooking methods (e.g. baking instead of frying) and fresh ingredients. Plan your meals in advance . By making a weekly menu, you will be less likely to go off track and call for take-out midweek. You can make things easier on yourself by preparing healthy meals to keep in the freezer and eat as needed. Make cooking fun. Treat yourself to a new set of knives or a cute apron. These sorts of things can give you the motivation you need to spend more time in the kitchen."
    },
    {
      "title": "Snack.",
      "content": "Snack. Good news! You actually need to snack while you're dieting. Eating frequently keeps your metabolism going and will help your body burn more calories throughout the day. Healthy snacks can also reduce hunger and keep you from overeating at meals. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The key is to make sure that you are choosing healthy snacks. Reach for fresh fruits and veggies, nuts, or low-fat dairy. Try some cucumber slices with hummus for a satisfying afternoon snack. Keep healthy snacks handy in your desk at work. If you have some roasted almonds nearby, you'll be less likely to head for the cookies someone left in the break room."
    },
    {
      "title": "Add more flavor to your foods.",
      "content": "Add more flavor to your foods. If foods taste great, you're more likely to eat them. One way to add flavor to any healthy food is to add some salsa. Try topping your baked potato with salsa instead of butter and you'll save on calories and fat. Bonus: you've also added an extra serving of veggies to your meal. [13] X Research source Adding salsa to your chicken, fish, and even salads, can help liven up your meals and provide a little more zest. Try buying fresh salsa at the grocery store, or even making your own. You can add flavor to almost any dish by adding herbs and spices, most of which contain almost zero calories. Try buying fresh herbs such as parsley, rosemary, or thyme. They will make your chicken, pork, or salad taste fresh and original. Some ingredients offer an added bonus other than flavor. For example, garlic is known to have anti-inflammatory properties. Season your fish or soups with garlic for a flavorful meal that is also healthy. [14] X Research source Turmeric is another popular, flavorful staple that should be in your spice rack. Try adding it to healthy salad dressings for an extra pop of flavor."
    },
    {
      "title": "Avoid fad diets.",
      "content": "Avoid fad diets. It can be very tempting to try the latest trend in dieting. The media is often full of stories about celebrities who tried a fad diet and had great success. However, it is important to remember that not only do fad diets often not work, they can also be harmful to your health. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Most fad diets require you to cut out a major food group, such as carbs. The most important part of a healthy diet is making sure that you are eating a well-rounded meal plan that includes all nutrients. Avoid diets that require you to cut out food groups. Some fad diets can make you sick. Many fad diets promote eating a very low amount of calories, which can be dangerous to your health. Instead, eat the recommended number of calories for your body type and make healthy choices."
    },
    {
      "title": "Skip the processed foods.",
      "content": "Skip the processed foods. Processed foods and fast foods are high in the kinds of things you're better off avoiding--sodium, saturated fat and sugar. It doesn't mean the occasional fast-food burger or frozen entrée will kill you, but these are the kinds of foods you want to limit. The government's most recent Dietary Guidelines for Americans recommends that no more than 10% of calories come from saturated fats. If you're on a 1500 calorie-a-day diet, that means you can have 15g of saturated fat a day--fast-food burgers can have anywhere from 12g to 16g."
    },
    {
      "title": "Stay away from sugary drinks.",
      "content": "Stay away from sugary drinks. Sugary drinks, especially soft drinks, have been linked to weight gain and obesity. Calories consumed through a straw are still calories and contribute to packing on the pounds, so plan to cut down or reduce your consumption of these beverages on your diet. The best thirst quencher is and always has been water. Plus drinking more water will make you feel more full and may reduce your intake at mealtime. Make water more appealing to your taste buds by adding slices of citrus, cucumbers, mint or other herbs. Juice sounds healthy, especially drinks made from 100% juice, but they're high in sugar. Drink them in moderation or add water to get some of the nutritional benefits with fewer calories. In a study by Harvard University researchers, sugary drinks were linked to 180,000 deaths a year worldwide, 25,000 in the United States alone. [16] X Research source Another 2013 study, this one by the scientists at Imperial College London, found that the risk of type 2 diabetes rose by as much as 22% for every 12 oz. serving of sugar-sweetened drinks consumed per day. [17] X Research source"
    },
    {
      "title": "Avoid specific ingredients as needed.",
      "content": "Avoid specific ingredients as needed. You may have a condition that requires you to steer clear of certain ingredients, so read labels carefully and stock up on products that suit your specific dietary requirements. Celiac disease. Celiac disease is a digestive disorder caused by intolerance to dietary gluten, a protein found in wheat, rye, and barley. Thanks to a growing awareness of the needs of those who are not able to tolerate gluten, a number of gluten-free products are now on the shelves of not only specialty food stores but also your local supermarket. Hypertension. A dangerous condition and a precursor to heart disease and stroke, hypertension can be managed in part by a diet that's heavy on fruits, vegetables and lean protein. The DASH diet--which stands for Dietary Approaches to Stop Hypertension--has been shown to decrease blood pressure, is recommended by a number of health organizations including the National Institutes of Health and was ranked No. 1 best overall diet in the U.S. News & World Report's Best Diets 2012. Food allergies. If you suspect a food allergy, be sure to get tested by a physician. Eight foods account for 90% of all food allergies: peanuts, tree nuts, milk, eggs, wheat, soy, fish and shellfish. If you have any of these allergies, read food labels very carefully to avoid choosing items that may trigger an allergic reaction."
    },
    {
      "title": "Ease into your diet.",
      "content": "Ease into your diet. While it may be tempting to drastically cut calories and impose unrealistic eating expectations to hasten weight loss, a slow and steady approach is more effective and easier to maintain. Change just one meal a day. Rather than redoing your plate at every meal, try eating just one healthier or smaller meal a day. You won't feel deprived with this gradual change, which will give you time to adjust to your new way of eating. Eliminate or replace one snack a day. If you always have a cookie at your 3 p.m. coffee break have a peach instead or simply skip the sweet treat altogether. Or trade your large mocha for a cup of green tea with a squeeze of lemon."
    },
    {
      "title": "Get moving.",
      "content": "Get moving. Dieting properly is a great way to start living a healthier lifestyle. However, you'll see the best results if you also begin a healthy exercise regimen at the same time. Studies show that combining diet and physical activity will have positive benefits for your overall health and for weight loss. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Aim to be active for at least 60 minutes per day. You can break this up into small sections to make it manageable. For example, try walking to work and taking the stairs instead of driving and taking the elevator. Go outside. People who exercise outside report that they enjoy it more. Explore your neighborhood, or go hiking in a nearby state park. Call a friend. When you make plans to exercise with a friend you will be more likely to stick to the plan. Ask a buddy to join you at yoga or go for a long walk with you after work."
    },
    {
      "title": "Stay rested.",
      "content": "Stay rested. If you're not getting enough sleep , you might be more susceptible to weight gain. When you're low on rest, your body produces more cortisol, which is the stress hormone. This can make you more likely to reach for comfort foods instead of making healthy choices. [19] X Research source Try to get seven to nine hours of sleep per night. People who do tend to have a healthier body weight than people who clock only five to six hours per night. Avoid using devices that emit blue light, which can keep you awake, at least 30 minutes before bed. These devices include smartphones, tablets, laptops, and televisions. [20] X Research source Get on a schedule. If you try to go to bed at the same time each night and wake up at the same time each day, your sleep will be more restful and effective."
    },
    {
      "title": "Reduce stress",
      "content": "Reduce stress . There is a clear link between stress and weight gain. When you are stressed, your body releases more cortisol, which causes your body to retain more fat. This tends to happen especially in the abdominal region. To get the most out of your healthy diet, you need to work on reducing your stress levels. [21] X Research source A great way to reduce stress is to make sure that you are exercising regularly. This releases endorphins and generally improves your mood. Take deep breaths. Focusing on your breathing is a very effective method for reducing stress. Breathe deeply in and out, slowly inhaling and exhaling. This will slow your heart rate and help clear your mind."
    },
    {
      "title": "Treat yourself occasionally.",
      "content": "Treat yourself occasionally. Having a reward system in place can help keep your enthusiasm high while dieting and prevent you from going off track. Schedule a \"cheat\" day. Allow yourself one day a week when you can forget your dietary restrictions and eat whatever you want. It'll give you something to look forward to and keep you from feeling deprived. Be careful of labeling a food as \"forbidden.\" Human nature makes us desire something we can't have even more. Avoid saying that you can \"never\" have a certain food on your diet plan. Allow for exceptions to reduce the allure of certain tasty treats."
    },
    {
      "title": "Monitor your progress.",
      "content": "Monitor your progress. To track your success in taking off the pounds, set up a system that will let you see how you're doing. That same food diary you started at the beginning of your plan to track your eating habits can be used to track what you're eating on your new plan. Compare your entries from week to week to see trends, triggers and successes. Use an online program. Enter all the information about your new plan (starting weight, goal weight, daily menus) into an electronic program that will keep your progress at your fingertips. Many of these programs offer healthy recipes and community forums where you can connect with others who share your goals. Conduct weekly weigh-ins. It's not just what your food diary says that matters, it's what the scale says as well. Set a certain time each week to weigh yourself and make note of the results."
    },
    {
      "title": "Set healthy goals.",
      "content": "Set healthy goals. Part of living a healthy lifestyle is knowing how to set realistic goals. Avoid making impossible demands of yourself, such as \"I will lose 15 pounds this month.\" Instead, set smaller, more achievable goals. Healthy weight loss is generally considered 1 – 2 pounds per week. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Give yourself manageable goals, such as \"I will exercise six days this week.\" That progress is easy to track, and you can reward yourself for achieving these mini-goals. Avoid food-based rewards — instead, your rewards might include buying new exercise outfit or shoes."
    },
    {
      "title": "Don't skip meals.",
      "content": "Don't skip meals. You may be tempted to try and boost your weight loss by skipping meals, or you may simply get so busy or distracted that you forget to eat. Whatever the reason, skipping meals only serves to sabotage your diet. It may cause you to overeat later in the day or it may cause your body to cling to fat and slow down your metabolism. [23] X Research source Aim for three meals with one to two snacks every day or four to six small meals."
    },
    {
      "title": "Be mindful about eating.",
      "content": "Be mindful about eating. Eating while watching TV, looking at your phone, or while running out the door is common practice these days, but it may cause you to eat more. When it's time to eat a meal, remove all distractions and take a seat at the table. Focus on the food in front of you and take in its smell, how it looks, it's taste and texture. Try setting your fork down between bites to ensure you take your time and chew thoroughly. [24] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Stop once you reach your goal.",
      "content": "Stop once you reach your goal. Some diets are meant to be lifelong and others are simply short-term to achieve a weight loss goal. Many diets are fine temporarily but may not be healthy over the long run. Be careful of \"yo-yo\" dieting. \"Yo-yo\" dieting, also known as weight cycling, is the phenomenon by which you lose weight on a diet, regain it after the diet ends and embark on a new diet. Repeated \"yo-yo\" dieting can increase the risk for mental distress, life dissatisfaction and binge eating; over time it can damage the cells that line the blood vessels increasing your risk for heart disease."
    },
    {
      "title": "Ease out of your diet.",
      "content": "Ease out of your diet. Ending a diet can be a relief, but if you simply return to your old ways of eating, you can easily gain back the weight you worked so hard to lose. Instead, think about putting a maintenance plan in place to keep you at your new weight. If you've been on a liquid diet or one that seriously restricted caloric intake, you must be careful and add foods back slowly so as not to shock your system. Incorporate homemade soups, fruits and vegetables over a period of a few days before settling into a healthy eating routine."
    },
    {
      "title": "Stay positive",
      "content": "Stay positive . The power of positive thinking is not just a myth. In fact, positive thoughts are key to dieting properly. Thinking positive thoughts can increase your motivation and energy levels. Negative thoughts, on the other hand, can lead to behaviors such as emotional eating and skipping a workout. Avoid negativity. Try to not get angry at yourself if you slip up and reach for pizza instead of a healthier option. Instead, get back on track the next day."
    },
    {
      "title": "Have a good body image.",
      "content": "Have a good body image. Some days it can be hard to feel comfortable in your own skin. It doesn't help when you're surrounded by images in the media of exceedingly thin celebrities; however, a positive body image is very important to your overall health and wellness. It will increase your confidence and make you more likely to make healthy choices. [25] X Research source Focus on the good things. If you really like your arms, tell yourself that when you look in the mirror. Make it a habit to compliment yourself at least once a day. Tape a positive affirmation or quote to the mirror. Seeing encouragement each day will help you gain a more positive body image over time."
    },
    {
      "title": "Be kind to yourself",
      "content": "Be kind to yourself . Stop beating yourself up. Research shows that if you are kinder to yourself you will be more successful in your fitness goals. When you have a negative thought, try to acknowledge it and then let it go. There's really no point in berating yourself for skipping the gym. It's much more effective to forgive yourself and move on. [26] X Research source Tell someone (or everyone) that you're dieting. Making a public declaration can increase your chances of success by holding you accountable to others. It can also engender the support you need from family members and friends who can cheer you on to your goal. Join a support group. This could be formal group such as Weight Watchers or simply a group you organize yourself. Post an ad on Craigslist looking for weight-loss partners or organize or join a Meetup group dedicated to healthier eating. Post inspirational sayings on your fridge. Having mood-boosting words-of-wisdom close at hand can help you handle a difficult diet day. Do things that make you feel good. Get a pedicure, have your hair done, buy a new perfume. Little things that make you feel special and pampered can offset the feeling of deprivation that can sometimes creep in when you're dieting."
    }
  ]
}