{
  "url": "https://www.wikihow.com/Fill-a-Mont-Blanc-Fountain-Pen",
  "title": "How to Fill a Mont Blanc Fountain Pen",
  "steps": [
    {
      "title": "Buy ink cartridges made by Montblanc or a compatible brand.",
      "content": "Buy ink cartridges made by Montblanc or a compatible brand. It should state on the label whether the cartridge is compatible with your pen or not. You may be able to find cartridges at stationery shops, office supply stores, or online. [1] X Research source Monteverde, JetPens, Colorado Pen, and other brands carry cartridges compatible with Montblanc pens. You can use a standard fountain pen sized cartridge to fit a Montblanc cartridge pen."
    },
    {
      "title": "Unscrew the end cap of the pen from the grip.",
      "content": "Unscrew the end cap of the pen from the grip. Hold the grip of the pen with one hand. Grasp the other end of the pen with your other hand. Turn the end cap counterclockwise while keeping the grip still. The end cap should eventually screw off. [2] X Research source"
    },
    {
      "title": "Pull out the old cartridge.",
      "content": "Pull out the old cartridge. The cartridge is a thin tube inside of the pen. It should be pointing out of the nib and the grip. When you tug it, it will snap out of place. You can throw the empty cartridge away. [3] X Research source"
    },
    {
      "title": "Snap the new cartridge into place.",
      "content": "Snap the new cartridge into place. The stopper of the cartridge (where the ink comes out) should go in first in the grip. Push the stopper into the grip right below the nib of the pen until it snaps into place. This snap means that the stopper has been punctured so that the ink can flow. [4] X Research source The stopper will look like a clear, tapered end. Unlike the rest of the cartridge, which is filled with ink, the stopper will be clear."
    },
    {
      "title": "Screw the end cap of the pen back on.",
      "content": "Screw the end cap of the pen back on. Insert the end cap of the pen back over the grip and cartridge. Turn the end cap clockwise to screw it back in. [5] X Research source"
    },
    {
      "title": "Hold the nib downwards over a piece of paper for 5-10 seconds.",
      "content": "Hold the nib downwards over a piece of paper for 5-10 seconds. This will encourage the ink to start flowing. A few drops may come out onto the paper. Try writing a few words after a few seconds to help the ink flow. [6] X Research source"
    },
    {
      "title": "Buy Montblanc bottled ink or a compatible brand.",
      "content": "Buy Montblanc bottled ink or a compatible brand. Montblanc recommends that you use their specially formatted fountain pen ink for the best results. That said, you can use any bottle of fountain pen ink that you like. You can get these from stationery shops, office supply stores, or online. [7] X Research source Do not use India ink in a fountain pen. This type of ink can ruin the pen."
    },
    {
      "title": "Turn the converter at the end of the pen counterclockwise.",
      "content": "Turn the converter at the end of the pen counterclockwise. Remove the cap and hold the pen upside down so that the nib is facing downwards. This turning movement will open up the nib. Put a paper towel underneath the nib to catch any ink drops. [8] X Research source Unlike cartridge pens, the converter will not detach when you turn it counterclockwise."
    },
    {
      "title": "Dip the nib in the bottle of ink.",
      "content": "Dip the nib in the bottle of ink. The nib is the end of the pen that you write with. Put the nib about halfway into the bottle of ink to help draw up the most ink. [9] X Research source"
    },
    {
      "title": "Turn the converter clockwise to draw ink up into the barrel.",
      "content": "Turn the converter clockwise to draw ink up into the barrel. Rotate the converter as far as it will go in a clockwise direction. Do not remove the nib from the ink until you are done turning the converter. [10] X Research source"
    },
    {
      "title": "Turn the converter counterclockwise again to start the flow of ink.",
      "content": "Turn the converter counterclockwise again to start the flow of ink. Hold the nib just above the bottle of ink. As you turn the converter, a few drops will fall back into the bottle. Let about 6 drops come out."
    },
    {
      "title": "Turn the converter clockwise one last time to close the nib.",
      "content": "Turn the converter clockwise one last time to close the nib. Now that the ink is flowing, turn the converter clockwise as far as it will go. The pen is now ready to use, although there may still be extra ink on the nib. [11] X Research source"
    },
    {
      "title": "Clean the nib of any ink.",
      "content": "Clean the nib of any ink. Use a paper towel, lint-free cloth, or Montblanc nib cleaner to wipe the ink off of the nib. You may use the pen now or you may put the cap back on until you are ready to use it. [12] X Research source"
    },
    {
      "title": "Fill 2 cups with clean, lukewarm water.",
      "content": "Fill 2 cups with clean, lukewarm water. Distilled water is ideal, as tap water may contain particles that can damage the pen. You will use this water to flush out the barrel of your pen so that the colors do not mix together. [13] X Research source This process of flushing the pen is only necessary if you are using bottled ink. If your pen uses ink cartridges, you only need to take out the old colored cartridge and put in a new one."
    },
    {
      "title": "Turn the converter counterclockwise over 1 glass of water.",
      "content": "Turn the converter counterclockwise over 1 glass of water. Turn the converter as far as it will go. This will empty the pen of any remaining ink. The ink should pour into the glass of water."
    },
    {
      "title": "Fill the pen with clean water from the other glass of water.",
      "content": "Fill the pen with clean water from the other glass of water. Dip the nib into the clean water and turn the converter clockwise as far as it will go. This will draw water up into the barrel of the pen. This water will help flush out any remaining ink in the barrel. [14] X Research source"
    },
    {
      "title": "Empty the water-filled pen over the first cup of water.",
      "content": "Empty the water-filled pen over the first cup of water. Turn the converter counterclockwise again to release the water. The water will be tinted with the old color of ink."
    },
    {
      "title": "Repeat the process until the water runs clear from the pen.",
      "content": "Repeat the process until the water runs clear from the pen. Keep filling the pen with water from the clean glass and emptying it into the inky glass. Once the water runs clear from the pen, you may fill it with the new ink. [15] X Research source"
    },
    {
      "title": "Fill the pen with the new color from a bottle of ink.",
      "content": "Fill the pen with the new color from a bottle of ink. Make sure that the converter is turned counterclockwise. Put the nib in the ink and turn the converter clockwise to fill it. Lift the nib out of the ink and turn counterclockwise again. Release a few drops of ink before turning it clockwise one last time. Your new color is now ready to use. [16] X Research source As long as most of the water has been drained out of the pen, it is okay to go ahead and refill the pen. You do not need to wait for the barrel to dry completely."
    }
  ]
}