{
  "url": "https://www.wikihow.com/Create-a-Business-Name",
  "title": "How to Create a Business Name",
  "steps": [
    {
      "title": "Do a word dump for about 20 minutes.",
      "content": "Do a word dump for about 20 minutes. Word dumps are simple: just brainstorm and write down every word you can think of related to your business, brand, and industry. Remember, there are no bad ideas at this point! Don’t filter yourself or get overly analytical. Set a timer for at least 20 minutes (though you could do up to an hour if you want) and keep brainstorming for the duration. [1] X Research source Define your business plan and mission statement goals before brainstorming. If you know exactly what your brand is, it’ll be easier to think of usable words. Look at words from the dictionary and thesaurus too. You might find others words with similar meanings that you like better than the ones you brainstormed. Try to use words, names, and phrases that communicate the feeling and energy you want people to get when they see your business's name."
    },
    {
      "title": "Mash up 2 words for a short, snappy name that describes your business.",
      "content": "Mash up 2 words for a short, snappy name that describes your business. The best business names are simple–typically only 1 or 2 words. So instead of picking a single word, why not mash a couple together? Pick a few words from your word dump that are especially meaningful to you and descriptive of your business. [2] X Research source Try combining them in different ways to create a single catchy name. For example, if you’re starting up a to-go waffle cart, you could name it “GoWaffle.” Lots of well-known businesses do this! Think about the name “TurboTax.” It’s short, simple, and tells you exactly what the business is about using a mashup of 2 words. You could also abbreviate the words. For example, “Netflix” is a combination of “internet” (shortened to “net”) and “flicks” (shortened to “flix”)."
    },
    {
      "title": "Add a personal touch by incorporating your name into the business.",
      "content": "Add a personal touch by incorporating your name into the business. Plenty of businesses gain brand recognition by naming their business after themselves—or someone else. Names create a sense of individuality that often appeals to people! You could use a name with sentimental meaning, like your child’s or parent’s name or a childhood nickname that you remember fondly. [3] X Research source For example, if your new bakery uses a recipe passed down by your mother, you could use her name and call the business something like “Julie’s Bakery.” Think of businesses like “Tommy Hilfiger” or “Ben & Jerry’s.” They’re so widely recognized that many people know exactly what they sell by the name alone. You could also use the name of a place in your business title, like your hometown or the business’s town of origin."
    },
    {
      "title": "Make your business name metaphorical using myths and literature.",
      "content": "Make your business name metaphorical using myths and literature. There are many cool names scattered throughout old, beloved legends! Run a quick search for meaningful mythological names. Think about Greek mythology or Norse mythology, for example. Is there a deity or legendary creature whose name could be a metaphor for your business? [4] X Research source Let’s say you’re a dating coach who specializes in helping people find love. You could include “Aphrodite,” the Greek goddess of love, in your business name."
    },
    {
      "title": "Explore Latin phrases for a distinctive, intriguing business name.",
      "content": "Explore Latin phrases for a distinctive, intriguing business name. Latin words often pop up in business names, especially since so many words have their roots in Latin today. Look up Latin words and phrases that could be used for a business name. Make a note of any meaningful words that convey your goals or relate to your brand and incorporate them into your name ideas. For example, a counselor or life coach could name their business “Ad Meliora,” which is Latin for “towards better things.” You could also use a foreign language to name your business. For example, if you’re starting a gelato shop, look for Italian words and phrases like “Dolce Gelo” (sweet freeze). The company “Magnavox” (which makes and sells electronics) has a name based in Latin. It means “great voice,” referring to Magnavox’s origins in manufacturing speakers."
    },
    {
      "title": "Use acronyms to make your business name easy to remember.",
      "content": "Use acronyms to make your business name easy to remember. Can any of your potential names be shortened into an acronym (a set of initials using the first letter of each word)? Acronyms are more memorable and easier for people to pronounce if they aren’t too long. Try thinking of a business name that can be shortened into a simple 3 or 4-letter acronym. [5] X Research source For example, if you named your business “Venture Travel Agency,” you could shorten it to “VTA.” Lots of prominent businesses do this! Think of AT&T (“American Telephone and Telegraph Company”) or CVS (“Consumer Value Stores”)."
    },
    {
      "title": "Brainstorm adjective-noun phrases to make a unique, descriptive name.",
      "content": "Brainstorm adjective-noun phrases to make a unique, descriptive name. Think of phrases that include both a noun and a modifier; combined, they can make a simple yet accurate business name. Look at \"Urban Outfitters\" or \"American Apparel.\" They both have a noun (“outfitter” and “apparel”) behind an equally descriptive modifier (“urban” and “American”). Other examples include \"Black Cyprus\" and \"North Face,\" which are both extremely evocative and versatile business names. Try a gerund verb phrase. A gerund is simply an \"-ing\" word. This makes your business sound active, fun and welcoming. For example, \"Laughing Planet\" is an organic burrito chain, while \"Turning Leaf\" is a wine producer."
    },
    {
      "title": "Abbreviate or simplify a word for a more simplistic business name.",
      "content": "Abbreviate or simplify a word for a more simplistic business name. Since “simple” is the goal when it comes to business names, try taking a word you like and shortening it. Either abbreviate the word or drop a couple of letters, so it’s shorter but still recognizable. This ensures your business name is concise yet eye-catching for potential customers. [6] X Research source Say you’re starting a hair salon and like the word “Shimmer.” You could call the business “Shimmr Salon.” Look at the popular blogging site, Tumblr. You still know how to pronounce it, but the “e” in the original word “Tumbler” is dropped to make the business name short and catchy. Once you’ve compiled a list of potential names, it’s time to narrow them down and pick the best one! Use the next section to find your final business name."
    },
    {
      "title": "Choose the most descriptive and literal name.",
      "content": "Choose the most descriptive and literal name. A clear, direct name is catchy for customers and easier to understand. When customers don’t understand your business name, they might not remember and utilize it later. Ask yourself: can the name of your business tell customers what it’s about? Select a name that is true to your brand and goals for the company. [7] X Research source Consider your market: who are the people you’re trying to reach, and what do they respond to in other brands? For example, a florist could use descriptive, appealing names like “House of Blooms” or “Flower Power.” Avoid clichéd names that lack originality. For example, names with Ameri, Tech, Corp, or Tron as prefixes or suffixes aren’t original and might not stand out to people. Meaningless names like “Yahoo” or “Google” are still catchy (and obviously well-known). However, when you’re just starting out, it costs a lot more to market businesses with nondescript names."
    },
    {
      "title": "Make an adaptable name that won’t limit you over time.",
      "content": "Make an adaptable name that won’t limit you over time. Names that specify a geographic location or get a little too technical about the services offered can lock your business into a niche. While this is fine initially, it can cause problems if you eventually expand outside that niche. Think about the future of your business and pick an informative name that doesn’t limit the scope of your activities. [8] X Research source \"Omaha Pipe and Drain\" would work for a plumbing business in the Omaha area, but it won't help land a contract in another city. A name like “Urban Pipe and Drain” is more universally usable! For this reason, Kentucky Fried Chicken officially changed its name to \"KFC\". The location (“Kentucky”) and the product (“Fried Chicken”) imposed limits on the business, whereas “KFC” doesn’t."
    },
    {
      "title": "Choose a simple, memorable name that’s easy to search online.",
      "content": "Choose a simple, memorable name that’s easy to search online. When it comes to business names, the simpler the better! Look for concise yet catchy names that will appeal to your target audience. Say each name a few times, and focus on the ones that are both easy to say and feel good when said aloud. That way, customers will easily remember your business when searching for it. [9] X Research source Avoid hard-to-spell names. If you think potential customers could have trouble finding your business online because of its spelling, you might want to pick something simpler."
    },
    {
      "title": "Ask for feedback on your business name choices.",
      "content": "Ask for feedback on your business name choices. Run your top 5 to 10 names by friends, colleagues, and family members. Get as many opinions as you possibly can before finalizing your business name. Survey each person and ask them which names they prefer and why. If you can, ask members of your target audience what they think as well, and pick the name that appeals to them most. [10] X Research source Outside feedback can also ensure your chosen name doesn’t have any negative connotations you might be unaware of. For example, if your name utilizes a foreign language, ask someone fluent what they think of it."
    },
    {
      "title": "Conduct a search to ensure your business name isn’t taken.",
      "content": "Conduct a search to ensure your business name isn’t taken. Once you have a few favorites, ensure nobody else has trademarked them. Run a trademark search for the actual name of your business through the United States Patent and Trademark Office’s online search tool. It’s also good to think of a website domain name and use a service like GoDaddy to search for availability. [11] X Research source You can also use the Thomas Register of Manufacturers to search for business names, plus registered and unregistered trade and service marks. Some states maintain their own trademark registries, either through the secretary of state's office or county by county. Consult with your county clerk's office to learn how your state keeps track of its businesses."
    },
    {
      "title": "Buy a domain name for your new business.",
      "content": "Buy a domain name for your new business. A domain name is a unique address you use for a website. A website is vital for online shops, but it can expand your brand for any business! Once you have a domain name in mind, purchase it from an online registrar by entering the desired name, filling out any requested information, and paying the associated fees to claim a domain name officially. [12] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source Popular registrar choices include GoDaddy , IONOS , Domain.com , and Squarespace . Consider buying several related domain names simultaneously, in addition to the one you’ll actually be using. This prevents others from buying them and making it harder for people to find your website. For example, if you plan to use “mywebsite.com” as your domain name, you could also buy “mywebsite.net” and “mywebsite.info” to ensure that nobody else uses the same name with a different ending."
    },
    {
      "title": "Follow the naming rules for the type of business you plan to start.",
      "content": "Follow the naming rules for the type of business you plan to start. Pick from 2 main types of businesses: limited liability corporations (LLCs) and C-corporations. LLCs are popular with small business owners because they protect your personal assets if you ever face legal action. C-corporations are more complex and designed to protect you (the owner) and other officers and shareholders. [13] X Trustworthy Source U.S. Small Business Administration U.S. government agency focused on supporting small businesses Go to source If you create a limited liability corporation, the registered business name must end in “LLC” or “L.L.C,” or include the phrase “limited liability corporation.” For example, Google is actually an LLC. The company’s official name is “Google LLC,” but “LLC” just isn’t included in Google’s logo, branding, and advertisements. C-corporation names should include 1 of 4 phrases: “corporation,” “company,” “incorporated,” or “limited.” You can also abbreviate “corporation” to “corp” or “incorporated” to “inc.” Apple is a C-corporation. Its full name is “Apple Inc.,” but the logo and branding just use “Apple.”"
    },
    {
      "title": "Register and trademark your business.",
      "content": "Register and trademark your business. First, register your business name with your state’s government. Each state has its own specific process for this, so check your state’s website or call the county clerk to find out what paperwork you’ll need to file. Then, trademark your business by filing an application with the United States Patent and Trademark Office . [14] X Research source Before completing any paperwork, ensure you have all the materials for creating your business, including a slogan, logo, and \"basis\" for filing—which is an argument for why you need to trademark the business. You can always consult with a trademark lawyer throughout the process to ensure you're not missing anything."
    }
  ]
}