{
  "url": "https://www.wikihow.com/Get-Closer-to-Jesus",
  "title": "How to Get Closer to Jesus",
  "steps": [
    {
      "title": "Know that you are being specifically called.",
      "content": "Know that you are being specifically called. You must know that this \"hunger\" is fuelled by the Holy Spirit. Philippians 2:13 says: \"for it is God that works in you to will and to act in order to fulfil his good purpose.\" Not only is God through the Holy Spirit drawing you to his Word, but He will also provide the understanding of this Word as He affirms in John 14:26 : \"But the Advocate, the Holy Spirit, whom the Father will send in my name, will teach you all things and will remind you of everything I have said to you.\""
    },
    {
      "title": "Commit to Jesus.",
      "content": "Commit to Jesus. Serve man to serve God. Join a good Christian church and become committed. Join a group that you can function in and serve the Lord. Start by listening to or watching sermons and reading books. The sermon by your pastor who will refer to Bible verses that are relevant, will further get you closer to God. As you listen, take useful notes for later and pay attention to the context within which it is preached. Remember that your service is not a way to earn some benefits from God, but to strengthen your relationship to Him and help the community. At the same time, if you really work on your relationship with God and on your own loving nature, then you will serve Him and be close to Him whatever you do and wherever you go."
    },
    {
      "title": "Set aside some time to revise the scriptures.",
      "content": "Set aside some time to revise the scriptures. Get a Bible (choose a version of language that is easy for you to understand) and go through those verses. Pray that God gives you understanding of the scripture and that the Holy Spirit gives you the ability to remember. You don't have to read all of them at once, especially if they are many. Even as you read the scriptures, the Holy Spirit gives the understanding."
    },
    {
      "title": "Refer thoroughly to know the full context.",
      "content": "Refer thoroughly to know the full context. As you read more often, take more time to read the whole Chapter or sometimes even the chapter before or after. This is because many scriptures are spoken in context and reading just one verse may be incomplete. You don't have to memorise right away, try and get into reading and understanding first."
    },
    {
      "title": "Meditate on the message.",
      "content": "Meditate on the message. It is important to remember the message in the verse and the chapter. Take a verse and write it on a piece of paper. Meditate on that Word until your next Bible study. Meditating on the Word simply means to think about it and what it could mean, or how you could apply it. Bible studies can happen as often as you want them and can last as long as you are willing to read."
    },
    {
      "title": "Begin to ask questions about the Word.",
      "content": "Begin to ask questions about the Word. Ask your friends, church priest and at Church Bible studies. Have discussions around the scriptures that you have read. This ways, you will learn what other scriptures your friends know and increase your understanding of your scriptures."
    },
    {
      "title": "Don't worry if you're struggling.",
      "content": "Don't worry if you're struggling. Be patient and wait on God. Christianity was born of the necessity to comfort in times of suffering. Remember that God loves you and He will never abandon you. No matter what situation you come across, you can always call Jesus for help and guidance. Combine your reading of the Bible with application. Pray as you read and after you read, apply it in your life that the Word becomes real to you as you follow His commands. Live by the Bible. Don't add to it nor subtract anything––what is in the Bible was meant to be in the Bible."
    },
    {
      "title": "Spend quality quiet time with Jesus.",
      "content": "Spend quality quiet time with Jesus. Quiet time can involve you reading various gospel oriented books or listening to devotionals or even Christian music. Just taking some time off to sit and think about certain verses or passages from the Bible would also amount to quiet time. It's frankly just isolating yourself from this noisy world and letting God know that you are waiting on him. So quality quiet time would surely make you feel closer to Jesus."
    },
    {
      "title": "Attend church regularly.",
      "content": "Attend church regularly. It doesn't matter what church, as long as it is Bible based and teaches the truth. Be sure when you are attending you try to engage yourself in the mass. When hymns are being sung, sing along from the heart, when scripture is being read listen intently and focus your attention on the words. Being engaged in church can have you learning much more fulfilled and feeling closer to Jesus."
    },
    {
      "title": "Receive the sacraments.",
      "content": "Receive the sacraments. If you belong to a church that has sacraments (the Roman Catholic church, for example) talk to a priest about receiving the sacraments. And before each one, study what their meaning is and how they will affect your walk with Jesus. Whether it be your first communion (receiving Jesus's body) or Confirmation (confirming that you will follow Jesus), think about Jesus and pray to him to prepare yourself. Be sure to read your bible (as stated in the last step)."
    },
    {
      "title": "Read the Bible.",
      "content": "Read the Bible. The Lord has blessed you with the Bible so that you can get to know Him better, among many other reasons. So, take advantage of having this great book with you by exploring it and enjoying it. Try to also follow the instructions He has given in the Bible. Try to analyse how each verse or passage can be applied in your life. For instance, Psalm 46 verse 1 says \"God is our refuge and strength, a very present help in trouble.\" So next time you see trouble brewing at your workplace, school, college etc, you can look it in the eye and recite this verse aloud. This will surely bring you closer to Jesus and you will feel His presence in you."
    },
    {
      "title": "Talk to Jesus through prayer.",
      "content": "Talk to Jesus through prayer. Prayer is the foundation of your connection with Him. To Jesus you are his precious child. He loves you no matter what problem you are facing. Tell him what you are up to or what your plans are or why you are sad or what you need and so on. He is your Father. He wants what's best for you and most of all he wants you! Go to him for everything and you will feel closer to him in no time. He wants you to pray in the Spirit as well as in the understanding and He wants you to pray for other people so that they will repent and so that they will be healed. Use your prayer to express your gratitude to Jesus for everything He has given to you."
    }
  ]
}