{
  "url": "https://www.wikihow.com/Crochet-Doilies",
  "title": "How to Crochet Doilies",
  "steps": [
    {
      "title": "Pick a skein of double-knit yarn and a size G (4 mm) crochet hook.",
      "content": "Pick a skein of double-knit yarn and a size G (4 mm) crochet hook. You can use double-knit yarn in any color, but try to find a skein that's around 150 yards (140 m). [1] X Research source If you'd like to make a doily with tighter stitches, use a smaller crochet hook."
    },
    {
      "title": "Make 10 chain stitches on your hook.",
      "content": "Make 10 chain stitches on your hook. Take the yarn and tie a slip knot onto the crochet hook. Then, wrap the working yarn around the hook once so it catches on the hook. Pull the hook through the slip knot to make 1 chain stitch. Do this 9 more times to make a total of 10 chain stitches. [2] X Research source"
    },
    {
      "title": "Slip stitch into the first chain you made to join the ends.",
      "content": "Slip stitch into the first chain you made to join the ends. Insert your hook into the first chain and wrap the yarn around the hook. Pull the hook through the loops to join the ends and make the foundation row for your doily. [3] X Research source"
    },
    {
      "title": "Chain 3 and double crochet (dc) into each stitch around the circle.",
      "content": "Chain 3 and double crochet (dc) into each stitch around the circle. Once you've joined the round, make 3 chain stitches. These will count as the first 3 stitches of your round. Then, insert your hook into the next stitch at the base of the chain and double crochet. Make a dc stitch into every remaining stitch of the round. [4] X Research source To dc, wrap the yarn over your hook and insert it into the stitch. Grab the yarn with the hook and pull it through to make a loop. Yarn over and pull it through the first 2 loops on your hook before you yarn over and pull it through the remaining 2 loops."
    },
    {
      "title": "Join the round and make 4 chain stitches.",
      "content": "Join the round and make 4 chain stitches. When you reach the end of the double crochet round, insert your hook into the opposite stitch and slip stitch to join it. Then, chain 4 stitches to start the next round. [5] X Research source You might want to place a stitch marker at the start of each row. This can help you keep track of when you reach the end of a row."
    },
    {
      "title": "Double crochet and chain 1 into every stitch of the next round.",
      "content": "Double crochet and chain 1 into every stitch of the next round. Insert your hook into the next stitch on the round and double crochet into it. Then, make a chain stitch. Continue to dc and chain 1 into each stitch of the row. [6] X Research source Making a double crochet and chain stitch will create small spokes with gaps around the center of your doily."
    },
    {
      "title": "Slip stitch to join and make 10 chain stitches.",
      "content": "Slip stitch to join and make 10 chain stitches. To slip stitch into the round, insert your hook into the first stitch from the row you just finished. Wrap the yarn around it and pull the hook through both of the loops. Then, make 10 chains to start the next row of your doily. [7] X Research source"
    },
    {
      "title": "Treble crochet stitch",
      "content": "Treble crochet stitch (tr) into the second stitch. To treble crochet, wrap the yarn around your hook twice and insert it into the second stitch of your round. Keep in mind that you'll be skipping 1 of the gaps. Then, grab the yarn with the hook and pull up a loop before you yarn over again. Then, pull through the first 2 loops and yarn over. Pull through the second 2 loops and yarn over before pulling through the last 2 loops. [8] X Research source The treble stitch works up taller and faster than the double crochet stitch."
    },
    {
      "title": "Chain 6 and treble crochet into the following stitch.",
      "content": "Chain 6 and treble crochet into the following stitch. Remember to skip a stitch on the row when you insert the double-wrapped hook. Then, treble crochet and chain 6 more. Keep doing this around the entire row and stop after you've made 6 chain stitches at the end. [9] X Research source When you finish this row, you'll have 11 round gaps. Once you join the round, you'll have 12."
    },
    {
      "title": "Join the round, chain 1, and single crochet (sc) into it.",
      "content": "Join the round, chain 1, and single crochet (sc) into it. Insert your hook into the fourth chain of the beginning of the row that you're now finishing. Use the slip stitch to join the ends and chain 1. Then, make a single crochet stitch into the chain you made. [10] X Research source To single crochet, insert the hook into a stitch and grab the working yarn with the hook. Pull up a loop so there are 2 on your hook. Wrap the yarn around the hook again and pull through both of the loops to make 1 sc stitch."
    },
    {
      "title": "Chain 3 and double crochet into the following space.",
      "content": "Chain 3 and double crochet into the following space. Make 3 chain stitches and then insert your hook into the gap that's below your row. Wrap the yarn around your hook and make a double crochet stitch. [11] X Research source Don't worry if the dc stitch slides around on the row above it. Once you finish crocheting this decorative round, the stitches will stay in place."
    },
    {
      "title": "Chain 2 and double crochet into the same gap.",
      "content": "Chain 2 and double crochet into the same gap. Keep working in the same space and make 2 more chain stitches. Then, double crochet and make 3 more chain stitches into the gap. [12] X Research source This will create a ruffled edge that has 2 small spokes in it."
    },
    {
      "title": "Slip stitch to join the ruffle and single crochet 1.",
      "content": "Slip stitch to join the ruffle and single crochet 1. Insert your hook into the top of the next spoke and slip stitch to join the round. Make a single crochet stitch so the round is even before you start on the next ruffled edge. [13] X Research source You should be able to see 3 small gaps within the ruffle you just joined to the row."
    },
    {
      "title": "Continue to chain and double crochet around the circle.",
      "content": "Continue to chain and double crochet around the circle. Keep crocheting along the edges of the doily until you reach the end of the round. Remember that your repeating pattern for this round will look like this: [14] X Research source Chain 3 and dc, chain 2 and dc, chain 3, slip stitch to join, and sc 1."
    },
    {
      "title": "Cut the working yarn and weave in the tail.",
      "content": "Cut the working yarn and weave in the tail. After you've joined the last ruffle to your round with a slip stitch, pull up the loop so it's about 1 inch (2.5 cm) across. Then, cut the working yarn to leave an 8 inches (20 cm) tail. Thread it onto a needle and weave the tail into your doily. [15] X Research source If you'd like the doily to hold its shape, run it under cold water and wring it out so the doily is damp. Spread it flat on a piece of cardboard and use sewing pins to pin the doily in place. Then, let it dry completely and remove the pins."
    }
  ]
}