{
  "url": "https://www.wikihow.com/Do-a-Zigzag-Stitch-by-Hand",
  "title": "How to Do a Zigzag Stitch by Hand",
  "steps": [
    {
      "title": "Poke through to the front of the fabric.",
      "content": "Poke through to the front of the fabric. Insert the needle through the fabric at the starting point of your stitch line, A .Poke through from the back of the fabric to the front. Pull the needle and thread completely through so that the end knot lies flush against the back of the fabric. Your A point should be at the bottom right edge of your desired stitch line."
    },
    {
      "title": "Stitch a vertical line.",
      "content": "Stitch a vertical line. Cross over the front of the fabric and insert the needle at a position directly above your A point. This new insertion point will be point B . Pull the needle and thread completely through to the back of the fabric, creating a flat vertical stitch between A and B . This stitch must be straight, not slanted. The distance between A and B will be the width of your stitch. Unless otherwise specified, a width of 1/4 inch (6.35 mm) should suffice."
    },
    {
      "title": "Return to the starting point.",
      "content": "Return to the starting point. Insert the needle through the fabric at A again. Pull the needle and thread through from back to front. Tighten the thread until it creates a flat vertical stitch at the back of the fabric, mirroring the one on the front."
    },
    {
      "title": "Move the stitch diagonally across.",
      "content": "Move the stitch diagonally across. Cross the thread over the front of the fabric and insert the needle at a point lying even with B and to the left. This will be your C point. The horizontal distance between B and C should roughly match the stitch width. In this example, it should be 1/4 inch (6.35 mm). Continue pulling the needle and thread through to the back of the fabric until a flat diagonal stitch connecting A and C appears on the front of the fabric."
    },
    {
      "title": "Bring the needle back through to the front.",
      "content": "Bring the needle back through to the front. Insert the needle through the fabric from back to front, bringing it through at a point vertically beneath C and to the horizontal left of A . This newest point is point D . Pull the thread through completely, creating a flat vertical stitch along the back of the fabric from C to D . With this step, you have completed a single zigzag stitch."
    },
    {
      "title": "Repeat the stitch down the length of the row.",
      "content": "Repeat the stitch down the length of the row. Repeat the steps used to create the first stitch down the entire length of your stitch row. End the row with a vertical stitch. Reset your stitch labels at the end of each complete zigzag stitch. In other words, the C point of your first zigzag becomes the B point of your second, and the D point of your first zigzag becomes the A point of your second. For each stitch: Stitch a vertical line between A and B on the front of the fabric. Stitch a vertical line between B and A along the back, inserting the needle through to the front at A again. Stitch diagonally across the front of the fabric from A to C . Stitch a vertical line along the back of the fabric from C to D , inserting the needle through to the front at D . End the row with a vertical stitch across the front of the fabric between the D and C of your final zigzag. Make sure that you maintain the same stitch width and length for each zigzag."
    },
    {
      "title": "Overlap the end point.",
      "content": "Overlap the end point. Rename your stitch labels so that E is the bottom of your last vertical stitch and F is the top point of that same stitch. Cross over this final vertical stitch so that the needle comes out to the front of the fabric at E . If done correctly, the stitch prior to this should have gone through to the back of the fabric at F . To complete this step, make a vertical stitch along the back of the fabric from F to E , inserting the needle through E ."
    },
    {
      "title": "Cross over the last diagonal stitch.",
      "content": "Cross over the last diagonal stitch. Cross over the front of the fabric and insert the needle at the top point of the adjacent vertical stitch, now identified as point G . Pull the thread through to create a flat diagonal stitch. This newest diagonal stitch should cross over the center of the last diagonal stitch made during your first trip down the length of the row. The resulting stitch will be x-shaped. Note that G lies to the horizontal right of F ."
    },
    {
      "title": "Double behind the vertical post.",
      "content": "Double behind the vertical post. Insert the needle through to the front of the fabric at the bottom point of the current vertical post you're resting on. This point can now be referred to as point H. Point H is directly beneath point G and to the right of E ."
    },
    {
      "title": "Work your way back down the length of the row.",
      "content": "Work your way back down the length of the row. Zigzag your stitches down the length of the row, working from the left edge to the right edge. End by overlapping the very first vertical post you made. These stitches should be nearly identical to the ones you created down the first pass, but they will slant in the opposite direction (left to right instead of right to left). For each stitch: Stitch a vertical line between E and F on the front of the fabric, overlapping the vertical post already there. Stitch between F and E along the back of the fabric, inserting through to the front at E again. Stitch diagonally across the front from E to G . Stitch between G and H along the back of the fabric, inserting through to the front at H . The end of the row should conclude with a vertical stitch between your final H and G points."
    },
    {
      "title": "Knot the stitch in the back.",
      "content": "Knot the stitch in the back. If done correctly, the needle and thread should be at the back of your fabric. Knot the thread here and cut off any excess thread to complete the zigzag row. To knot the thread: Bring the needle through the front and back of the fabric at a spot directly next to your current insertion point. Before drawing the thread flat, insert the needle through the loop you just created. Do so two or three times, then draw the loop closed. This should create a secure knot."
    },
    {
      "title": "Poke the needle through to the front of the fabric.",
      "content": "Poke the needle through to the front of the fabric. Insert the needle through the fabric from back to front. Begin at the bottom left edge of your intended stitch line, point A . Pull the needle and thread completely through until the end knot lies flat against the back of the fabric."
    },
    {
      "title": "Insert the needle into the fabric at the same point.",
      "content": "Insert the needle into the fabric at the same point. Insert the needle through the front of the fabric at a point directly on top of A , point AA . As you look at the front of the fabric, A and AA should look like the same point. There needs to be a few threads separating them to prevent the stitch from falling out, though. Do not pull the needle and thread through this point yet. Only insert the tip of the needle for now."
    },
    {
      "title": "Poke through at a diagonal point.",
      "content": "Poke through at a diagonal point. Slide the tip of the needle along the back of the fabric at a 45 degree angle. Insert it through the front of the fabric at a point lying to the upward diagonal left of AA . This new point will be point B . The space between AA and B will determine the width of your stitches. Unless otherwise noted, distance of 1/8 inch (3.175 mm) is usually a good choice. Do not pull the needle and thread completely through AA or B yet."
    },
    {
      "title": "Pull the thread into a loop.",
      "content": "Pull the thread into a loop. Use your fingers to position the thread leading into AA underneath the tip of the needle coming out at B . [3] X Research source A little line of thread should run parallel to the needle on its left side. The rest should be tucked beneath the needle, extending down from the needle's right side."
    },
    {
      "title": "Tighten the loop.",
      "content": "Tighten the loop. Pull the needle and thread completely through to the front of the fabric again. Doing so should tighten the loop created in the previous step. The needle should now be free and lying along the front of the fabric. Note that the point of the loop comes together at A and AA . The rounded portion of the loop should lie to the immediate outside of B , and the thread should be coming out at B to the inside of the loop."
    },
    {
      "title": "Pierce the center of the loop.",
      "content": "Pierce the center of the loop. Insert the needle through the fabric at a point that overlaps B . Label this point BB . As with A and AA , B and BB should only have a few threads separating them. Only insert the tip of the needle. Do not pull the entire needle through to the back of the fabric."
    },
    {
      "title": "Bring the needle out at a slant.",
      "content": "Bring the needle out at a slant. Poke the tip of the needle back through to the front of the fabric at a 45 degree downward slant, bringing it out at point C . Point C should be horizontally even with A and AA . Do not pull the needle completely through BB or C yet."
    },
    {
      "title": "Repeat the chain procedure.",
      "content": "Repeat the chain procedure. Create another chain link using the same procedure followed for the first chain. Your two chains should form one zigzag. Slide the thread underneath the tip of the needle coming out at BB , creating a wide loop in the process. Pull the needle and thread completely through to the front of the fabric, tightening the loop you just created."
    },
    {
      "title": "Alternate the slant down the line.",
      "content": "Alternate the slant down the line. Continue making chains across the length of the row until you reach the end. Each chain should slant in the direction opposite the slant of the chain before and after it. Each chain stitch should be slanted at a 45 degree angle."
    },
    {
      "title": "Knot the thread at the back of the fabric.",
      "content": "Knot the thread at the back of the fabric. Once you reach the end of the stitch row, insert the needle into the front of the fabric and out through the back. Tie a knot at the back of the fabric. To knot the thread: Insert the needle through the front and back of the fabric at a point directly next to your final insertion point. Before you draw the thread flat, draw the needle through the newly created loop two or three times. Draw the loop closed to create a secure knot."
    }
  ]
}