{
  "url": "https://www.wikihow.com/Download-Music-from-Spotify",
  "title": "How to Download Songs, Albums, and Playlists from Spotify",
  "steps": [
    {
      "title": "Open the Spotify app.",
      "content": "Open the Spotify app. Tap the Spotify app icon, which has three black, horizontal bars on a green background. You can easily download up to 10,000 songs on up to 5 different devices each with your Spotify Premium membership. [1] X Research source If you haven't already, make sure you're connected to Wi-Fi before downloading music."
    },
    {
      "title": "Tap Your Library.",
      "content": "Tap Your Library . It's a tab in the bottom-right corner of the screen."
    },
    {
      "title": "Tap Playlists or Albums.",
      "content": "Tap Playlists or Albums . You can download any playlist or album from Spotify with your Premium account."
    },
    {
      "title": "Create a playlist for the songs you want to download (optional).",
      "content": "Create a playlist for the songs you want to download (optional). If you want to download individual songs on Spotify, you'll need to add those songs to a playlist first. To create a playlist: [2] X Research source Tap + at the top-right corner. Name your playlist and tap Create . Tap Add songs and select the songs you want to add. You can also add any song to the playlist by searching for the song, tapping its three-dot menu, and selecting Add to playlist ."
    },
    {
      "title": "Select a playlist or album.",
      "content": "Select a playlist or album. Tap the playlist or album that contains the songs you want to download."
    },
    {
      "title": "Tap the gray down-arrow at the top of the playlist or album.",
      "content": "Tap the gray down-arrow at the top of the playlist or album. If you haven't yet downloaded a playlist or album, you'll see a gray circle with an arrow inside above the song list. Tapping this icon downloads the playlist or album to your phone or tablet. [3] X Research source Once the download is complete, the gray arrow will turn to a green arrow. You'll also see a green arrow next to each downloaded song on the playlist or album. On some versions of Spotify, you'll tap the toggle switch at the top to turn on downloads instead of an arrow."
    },
    {
      "title": "Listen to Spotify music offline.",
      "content": "Listen to Spotify music offline. Whenever you're not connected to the internet, you can open Spotify, tap the Your Library tab, go to the location of the music you want to listen to, and tap a song to begin listening. You can also put Spotify into Offline Mode if you are connected to the internet but don't want to use your data—just tap the Home icon, tap the gear, select Playback , and then switch on \"Offline.\""
    },
    {
      "title": "Open the Spotify app on your PC or Mac.",
      "content": "Open the Spotify app on your PC or Mac. Click or double-click the Spotify app icon, which is three black, horizontal bars on a green background. If you haven't already downloaded the Spotify desktop app, you can get it from https://www.spotify.com/us/download ."
    },
    {
      "title": "Create a playlist if you want to download individual songs (optional).",
      "content": "Create a playlist if you want to download individual songs (optional). You can only download albums and playlists from Spotify, not individual songs. If you don't want an entire existing playlist or a full album, you can just add the songs you want to download to a new playlist. Here's how: Click + Create Playlist in the left panel. Click My Playlist , type a name for the playlist, and then tap Save . Add songs to the playlist by dragging them to the new playlist. You can also click the three dots on any song, select Add to playlist , and select your new playlist name."
    },
    {
      "title": "Select a playlist or album.",
      "content": "Select a playlist or album. This displays all of the songs on the selected playlist or album. [4] X Research source"
    },
    {
      "title": "Click the gray download arrow at the top of the playlist or album.",
      "content": "Click the gray download arrow at the top of the playlist or album. If the arrow inside of a circle at the top of the playlist or album is gray, click it to start the download. The arrow will turn green once the download is complete. [5] X Research source When a song finishes downloading, it will have a downward-facing arrow icon to the right of it."
    },
    {
      "title": "Listen to Spotify music offline.",
      "content": "Listen to Spotify music offline. Whenever you're not connected to the internet, you can open Spotify, click your downloaded playlist, and click the \"Play\" icon to the left of a song to play it. If you want to stay connected to the internet but not use your internet connection to listen, you can turn on Offline Mode. On Windows, click the File menu and choose Offline Mode . On a Mac, click the Spotify menu and choose Offline Mode ."
    }
  ]
}