{
  "url": "https://www.wikihow.com/Get-Ink-or-Dye-Off-a-Painted-Wall",
  "title": "How to Get Ink or Dye Off a Painted Wall",
  "steps": [
    {
      "title": "Wipe the stain with a clean, damp cloth.",
      "content": "Wipe the stain with a clean, damp cloth. If the ink or dye is fresh, then you may be able to remove it using just a clean, damp cloth. [1] X Research source Try to wipe the dye or ink away in one motion, and then go back over the spot with a clean section of the cloth. Use your fingertip to help you clean a small area. Wrap the cloth over your fingertip and use it to rub the dyed or ink-covered area. You can also try adding a small amount of dish soap to the water. Be sure to wipe the wall with water only after wiping it with soapy water. Use a clean, smooth cloth first and then try a more abrasive cloth or a sponge if that does not work. Don’t use an abrasive cloth if you don’t have to. Avoid using too much water when you wipe down your walls. [2] X Research source Wet the cloth and then wring out excess water so that the cloth feels damp."
    },
    {
      "title": "Try a pencil eraser.",
      "content": "Try a pencil eraser. A pencil eraser is a safe, gentle way to remove ink and dye stains from a painted wall without removing the paint. You can also control the area that you are cleaning more easily than some other cleaning methods. [3] X Research source Be sure to use a clean pencil eraser. Rub the pencil eraser gently over the dyed or ink-covered areas of the wall only."
    },
    {
      "title": "Make a baking soda paste.",
      "content": "Make a baking soda paste. Baking soda is great for removing stains from surfaces, however it is a slightly abrasive option, so be careful when trying this method. You can make a baking soda paste by mixing a tablespoon of baking soda with one to two tablespoons of water. [4] X Research source To use baking soda paste to clean a wall, apply it to the dyed or ink-covered area using a cotton ball, clean cloth, old toothbrush, or a sponge. Then, gently rub the dyed areas only. Use a clean wet cloth to wipe away the excess baking soda. You may need to repeat this method a few times before it removes the dye completely."
    },
    {
      "title": "Use toothpaste.",
      "content": "Use toothpaste. Apply a non-gel toothpaste to the stain and let it sit for 10 minutes. Wipe the toothpaste off with a damp cloth. Be careful not to rub the toothpaste too hard since it could spread the stain even more. [5] X Research source"
    },
    {
      "title": "Use a magic eraser.",
      "content": "Use a magic eraser. Magic erasers are cleaning sponges that use micro abrasive texture to scrub away stains. You can safely use magic erasers on many different types of surfaces, so this may be a good option for getting the dye or ink off of your wall. [6] X Research source However, keep in mind that there is still a chance of discoloration. To use a magic eraser, get the sponge wet and wring out the excess water, Then, rub the sponge over the dyed or ink-covered area of the wall until the dye or ink stain is gone."
    },
    {
      "title": "Use a bleach pen for spot treatments.",
      "content": "Use a bleach pen for spot treatments. [7] X Research source If you just have some small specks of dye or ink on your walls, then you may be able to use a bleach pen as a spot treatment. A bleach pen will lighten the dye or ink in a small area, so this may reduce the chances of discoloring the paint. To use a bleach pen, go over the dyed or ink-covered areas with the tip of the bleach pen. The stains should lift after a few minutes."
    },
    {
      "title": "Try a bleach spray for white painted walls.",
      "content": "Try a bleach spray for white painted walls. If you have white walls, then you can use some bleach cleanser to remove the stain. This is an effective way to get ink or dye off of your painted walls, but it will likely cause discoloration if your walls are not white. To use a bleach cleanser, spray it directly onto the dye or ink, let it sit for a few minutes, and then wipe it away. You should only use bleach cleanser as a last resort because it is the harshest option and there is a good chance that it will discolor your paint."
    },
    {
      "title": "Try using rubbing alcohol.",
      "content": "Try using rubbing alcohol. Dip a cotton ball into the rubbing alcohol and make sure that it is not dripping or oversaturated. Hold the cotton ball on the stain and dab it lightly until the stain transfers. Change the cotton ball frequently until the stain is gone. [8] X Research source Test alcohol on a small, unnoticed area of your wall first to make sure it doesn’t cause any damage."
    },
    {
      "title": "Act fast.",
      "content": "Act fast. The sooner you clean up an ink or dye stain, the easier it will be to remove. You may also be able to get away with an easy cleaning method like a damp cloth and water if you clean up ink and dye as soon as they get on your walls. [9] X Research source If you didn’t notice the spill or waited to clean it, don’t worry! You can still remove the stain. It may just be a little harder to remove."
    },
    {
      "title": "Test the cleaning product on a discrete location.",
      "content": "Test the cleaning product on a discrete location. You may want to test any cleaning option you plan to use on a discrete portion of your painted wall first to see if they cause any discoloration. This will give you a chance to see if the method works and whether or not it discolors the paint. For example, you could try the cleaning option on an area that is behind a piece of furniture or near the floor."
    },
    {
      "title": "Rub gently and in a small area.",
      "content": "Rub gently and in a small area. To reduce the chances that the cleaning product will mess up your paint, you can also confine the area that you clean to where the dye or ink has stained it. Unless the dye or ink is spread over a large area, this will require dabbing on the cleaning product or limiting your application of the product in other ways. Some things you can try include: Using a cotton ball or cotton swab to dab on a cleaning product. Cutting a magic eraser or sponge into small pieces for use on a small area. Making small, precise movements with the cloth or sponge."
    },
    {
      "title": "Have some matching color paint handy.",
      "content": "Have some matching color paint handy. If you do end up discoloring your paint in the process of removing the dye or ink, then you can always paint over the area to fix the discoloration. Find out the exact shade that was used to paint the wall and get a small can of this paint to touch up the area if it is discolored from the cleaning option you use."
    }
  ]
}