{
  "url": "https://www.wikihow.com/Drain-Cauliflower-Ear",
  "title": "How to Drain Cauliflower Ear",
  "steps": [
    {
      "title": "Apply ice.",
      "content": "Apply ice. Immediately after an injury to your ear that causes swelling, stop your activity and apply ice (or something cold) in order to reduce the inflammation and numb the pain. [2] X Research source The ice will reduce the flow of blood into the space between the skin and cartilage of your upper ear. Apply the cold therapy for about 10 minutes at a time, every hour or so, for about three to four hours from the time of the injury. Wrap the ice cubes, crushed ice or frozen gel pack in a thin cloth before applying it to your ear in order to prevent frostbite or skin irritation. As an alternative, use a small bag of frozen vegetables or fruit to combat the swelling of your ear."
    },
    {
      "title": "Use a head wrap to compress your injured ear.",
      "content": "Use a head wrap to compress your injured ear. In addition to applying ice to your swollen ear, wrap a Tensor or Ace bandage around your head so you feel pressure against your ear. [3] X Research source The combination of cold therapy and compression is the most effective way to combat swelling of virtually all musculoskeletal injuries. Pressure can stop the internal bleeding faster, thereby reducing the severity of the cauliflower deformity. You can also use a long strip of gauze or an elastic exercise band to compress the ice against your ear. Consider wedge packing some gauze in front of and behind your ear before wrapping it with a stretchy bandage to increase the pressure on it. Do not wrap the gauze so tightly that it causes a headache or dizziness or cuts off circulation, as blood flow is necessary to carry away excess fluid. You should also avoid wrapping it in a way that causes the gauze to block your vision or reduce hearing in your uninjured ear. Remove the bandage once every hour to let your ear rest."
    },
    {
      "title": "Take anti-inflammatories.",
      "content": "Take anti-inflammatories. Another method of reducing swelling and the pain of a cauliflower ear is to take over-the-counter anti-inflammatories, such as ibuprofen (Advil), aspirin or naproxen (Aleve). [4] X Research source Take them as soon as possible after your injury for best results. Combine them with cold therapy and compression also. Painkillers, such as acetaminophen (Tylenol) are obviously helpful for pain, but they don't reduce swelling at all. Aspirin and ibuprofen can increase and worsen internal bleeding, so ask your doctor if anti-inflammatories are appropriate for your case. Don't take anti-inflammatories for longer than two weeks in order to reduce side effects, such as stomach and kidney irritation. For cauliflower ear, a couple of days of medication is probably sufficient."
    },
    {
      "title": "Understand the risk.",
      "content": "Understand the risk. Even though it's possible to drain a mild cauliflower ear without going to the doctor, particularly if you have some sort of medical training, doing so significantly increases your risk of infection and later complications. You should only attempt to drain a cauliflower ear if there's no possibility of seeing a doctor or medical professional within two to three days. Furthermore, draining your own ear should only be attempted if the trauma is mild with only moderate swelling and no torn skin. If you have a cell phone, call emergency services to get some helpful advice and support."
    },
    {
      "title": "Sanitize your hands and/or wear gloves.",
      "content": "Sanitize your hands and/or wear gloves. Before dealing with your cauliflower ear, make sure to sanitize your hands by washing them with warm water and regular soap for about 30 seconds, then dry them with paper towels. If you have latex surgical gloves, then put them on after you wash your hands, but it's not critical to wear them. Having clean or protected hands greatly reduces the risk of spreading bacteria to the ear injury and causing an infection. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Alternatively, if you don't have soap and water, lather your hands in some alcohol-based hand sanitizer. Alcohol or baby wipes can also be helpful to clean your hands if you find yourself in an emergency situation."
    },
    {
      "title": "Disinfect and prepare your injured ear.",
      "content": "Disinfect and prepare your injured ear. Before attempting to drain your cauliflower ear, make sure to disinfect it thoroughly. Soak a sterile cotton ball with rubbing alcohol and apply it to the top half of your ear where the swelling is worse. [6] X Research source The top half of your ear is where you'll be puncturing the skin, so make sure it's entirely disinfected. Use a generous amount of rubbing alcohol to coat all the crevices, both inside and outside the upper half of your ear. Alcohol swabs are also great for disinfecting, as is alcohol-based sanitizing lotion, which can be applied with a clean Q-tip. Apply ice for about 10 – 15 minutes just prior to puncturing your ear in order to numb the pain — ice is a natural anesthetic."
    },
    {
      "title": "Pierce the hematoma with a needle and syringe.",
      "content": "Pierce the hematoma with a needle and syringe. If you don't have one at home or wherever you are, buy a new 20-gauge 1-inch needle with at least a 3 milliliters (0.10 fl oz) syringe attached to it in order to pierce the hematoma — the large pocket filled with blood. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The 20-gauge needle isn't the smallest type, but it's the best choice to suction up the thick, coagulated blood inside a cauliflower ear. The 3 mL syringe capacity will ensure that all the fluid can be suctioned up, and the 1-inch needle length will help prevent you from puncturing the ear too far and damaging the cartilage. Only pierce the swollen portion of the mid-to-upper ear deep enough to get the tip of the needle in. Do not shove the needle in too deeply since you could cause more damage."
    },
    {
      "title": "Draw out the blood and other fluid.",
      "content": "Draw out the blood and other fluid. Once the tip of the needle has pierced the skin of your cauliflower ear, slowly and steadily pull the plunger of the syringe to draw out the blood, pus and inflammatory liquid. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Continue drawing out fluid until you can no longer pull the plunger back or until the wounded area appears completely drained and deflated. You may need to gently squeeze the affected part of your ear as you drain it to help move all the blood and fluid to the tip of the needle and, ultimately, out of the ear. While you do this, try to hold the needle as still as possible to keep it from causing micro-cuts inside your ear. The fluid may look a little milky red if pus is present, or bright red if the injury is fresh (within hours). When removing the needle, do it slowly and with a steady hand so the puncture wound remains small. Again, moving the needle around too much can tear the skin, so be careful."
    },
    {
      "title": "Disinfect the area once again.",
      "content": "Disinfect the area once again. After gently squeezing all the remaining fluid out from your ear, disinfect the small puncture wound with more rubbing alcohol, tea tree oil or alcohol-based sanitizer applied to a clean cotton ball/swab or soft tissue. With an open wound, your ear is most susceptible to infection at this stage, so take your time and do a thorough job of disinfecting. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Note that the skin will still seem wrinkled afterward, but this usually heals and flattens out over time as long as all the ear has been thoroughly drained. Let the small puncture \"weep\" for a few minutes if need be, which means it might continue to leak a small amount of blood."
    },
    {
      "title": "Apply pressure to stop the bleeding.",
      "content": "Apply pressure to stop the bleeding. Depending on your injury and how well you drained the cauliflower ear, there may be no more blood after a few minutes of light weeping; however, if blood continues to trickle or drip from your ear, then you need to apply pressure for a few minutes with some clean gauze or tissue to stop the bleeding and promote clotting. After a few minutes of pressure to stop the bleeding, consider applying a small bandage to cover it up and deter infection. Make sure to change your bandage daily or every time it gets wet."
    },
    {
      "title": "Undergo drainage and compression.",
      "content": "Undergo drainage and compression. Although drainage with a needle is still widely used by doctors, it's no longer recommended by many sources because the hematoma often returns to some extent. [10] X Research source Regardless, your doctor may prefer needle aspiration and go about it in a similar fashion to the above recommended procedures. Afterward, your doctor will apply a special compression wrap to the site to prevent additional blood from pooling in the wounded ear. Aside from expertise, the main difference between you draining your ear and your doctor doing it is that your doctor will use a local or topical anesthetic to make the procedure nearly painless. Applying pressure with a tight bandage also helps any torn skin reconnect to the ear cartilage beneath it. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The doctor will likely apply gauze to both the front and back of your ear before wrapping it with sterile bandages."
    },
    {
      "title": "Ask about drainage and splinting.",
      "content": "Ask about drainage and splinting. This procedure is quite similar to the needle and syringe drainage and compression technique, but instead of using a compression wrap to apply pressure on your ear, a physician will place a special splint inside to keep more constant pressure on the wound in order to completely drain it. Splinting may take the form of sutures, which are placed through the ear in a manner that holds a special gauze in place. [12] X Research source Alternatively, the splint can be made from pediplast or silicone and molded to your ear. If a splint is used, your ear will need to be checked by your doctor again in one week. Sutures stay in place for two weeks unless redness or tenderness develops. A molded splint may be kept in place even longer."
    },
    {
      "title": "Get an incision to drain your ear instead.",
      "content": "Get an incision to drain your ear instead. The most commonly recommended method for doctors to drain a cauliflower ear is by a small incision from a scalpel. Making an incision completely drains the blood and greatly reduces the chance of a hematoma forming again, which can be an issue with the needle drainage technique. Making an incision is also easier to get thickly coagulated or clotted blood out of your ear. This type of procedure is typically performed by a plastic surgeon or by a licensed otolaryngologist (ear, nose and throat specialist). With an incision technique, the doctor will have to close the wound with a few stitches, which will either dissolve or be taken out a week or so later. Stitches will keep the detached skin over the cartilage, giving it an opportunity to reattach itself to the cartilage properly. [13] X Research source"
    }
  ]
}