{
  "url": "https://www.wikihow.com/Coptic-Bind-a-Book",
  "title": "How to Coptic Bind a Book",
  "steps": [
    {
      "title": "Create your folios.",
      "content": "Create your folios. Take each large page, set it on a flat work surface, and fold it in half. Make sure that the edges of the paper align perfectly and are not skewed or lopsided in any way. These individual folded pages are called folios. Run the blunt edge of a knife or a bone folder across the fold to ensure a crisp edge."
    },
    {
      "title": "Create your signatures.",
      "content": "Create your signatures. A signature is a set of folios placed together. Open up your folded folios and lay them one inside of another until you have four to six of them stacked. Then, close each signature and once more run a bone folder along the fold to create sharp exterior edge or spine. Set your completed signatures aside. [1] X Research source There is no limit to the number of signatures that you can include in your book. The number of signatures will directly correspond to the number of final pages. For example, a book with 10 signatures will have 160 useable interior pages. If you are new to Coptic binding, it’s generally best to start off with fewer signatures. When you get more comfortable with your technique, go ahead and tackle thicker books with additional signatures. [2] X Research source"
    },
    {
      "title": "Prepare your backing board.",
      "content": "Prepare your backing board. These will be the covers for your book, so you’ll want to handle them very carefully. Take a hard paper board and cut it down until you have two equal pieces that are large enough to cover the exterior of your folios. To make clean cuts, lay a metal or plastic ruler down on the board and then run a utility knife along the edge. This will let you get the size that you want with a smooth outer edge."
    },
    {
      "title": "Mark the signatures.",
      "content": "Mark the signatures. Gather all of your signatures and stack them together, applying some pressure to ensure that they are even on all sides. Set them down. Get a metal ruler and make a series of pencil marks. The marks should start one inch (2.5 cm) in from the bottom and top and continue until you have three marks on each end, each separated by an inch (2.5cm). Place the ruler against the spine and draw lines from the holes down over the spine ends of the signatures. [3] X Research source These markings are intended to show where the thread will enter and exit the spine of your signatures. You can end up with as many thread holes as you like, but each hole will raise the level of difficulty. You can also space the holes out however you choose. Be aware that the fewer holes you include the looser your interior pages will be. Likewise, too many holes can leave you with a book that may be stiff with difficult to turn pages."
    },
    {
      "title": "Mark and puncture one cover board.",
      "content": "Mark and puncture one cover board. Place the signature from the top of your signature stack on top of one of your cover boards. The cover board should be laying with its exterior facing downward to protect it from markings. Align the signature with the board, leaving a bit of space spine edge. Get an awl or small screwdriver and make holes in the board in the spots next to the marks on the signature’s spine. [4] X Research source For this example you will end up with a total of six holes in each cover board. They should correspond in location and spacing with the spine markings of the signatures. Try to make each hole as wide as your needle. Holes that are too wide will let the thread slip and holes that are too small will make threading more difficult."
    },
    {
      "title": "Puncture the next cover board.",
      "content": "Puncture the next cover board. Take the board that you’ve punctured and place it together with the other cover board. They should be positioned with their interiors facing one another, almost like a book with no pages. Use your awl or screwdriver to push through the holes of the one board and through into the new one. Once you’ve completed the set of holes, pick up the second board to make sure that they are correct in size and re-puncture or adjust as necessary."
    },
    {
      "title": "Puncture the signatures.",
      "content": "Puncture the signatures. Pick up one of your signatures and fold it open with the interior pages facing downward on a table. The outer spine crease should be on the outside and facing upwards. Make six holes along the spine according to the markings. Try to keep your holes right on the spine, if possible. Repeat with all signatures, close each of them until folded, and place them back into a stack. [5] X Research source"
    },
    {
      "title": "Thread your needle.",
      "content": "Thread your needle. Hold your needle firmly. Take a long length of thread and put it through the eye of the needle. Continue to pull this thread through until you have two pieces of equal length, making your needle “double-threaded.” Tie a knot at the end unifying the two pieces. Now, you are ready to start binding. It’s best to use a waxed thread, as it will slide smoothly through the pages and won’t snag. It will also resist aging. This is where you can express a bit of your creativity. Choose a thread color that you enjoy and that matches the cover of the book, as your thread will be highly visible on the spine of the final product. The amount of thread that you start with is really up to you. You want enough to make some good progress, but not enough to get overly tied up. It is possible to re-thread in the middle of binding."
    },
    {
      "title": "Start your first stitch.",
      "content": "Start your first stitch. Position the bottom cover laying down with the signature on top of it and open. Go to the lowest hole on the bottom of the signature (one inch from the edge, for this example). Pierce your needle through it. Then, loop your thread over the outside of the cover’s spine. Come up through the lowest hole in the bottom cover. The one that corresponds to your entry point in the signature."
    },
    {
      "title": "Finish your first stitch.",
      "content": "Finish your first stitch. Tighten your thread to pull the cover and signature together. Then, loop your needle around and inside the existing stitch. Guide your needle back into the hole leading into the interior of the signature. (The same hole that you started with earlier, but coming at it from the opposite direction.) Open the signature up and pull your thread through. You will see the knot from your thread just outside the lowest interior hole of this signature. When you are finished with this step you should see a completed stitch on the exterior of the spine holding the cover and signature together."
    },
    {
      "title": "Continue your stitching.",
      "content": "Continue your stitching. Head to the next hole up on the interior signature. Enter into this hole with your needle and complete the same process as above to finalize the stitching. Repeat this process over and over again, moving from hole to hole."
    },
    {
      "title": "Attach the next signature.",
      "content": "Attach the next signature. When you reach the last hole of the signature, then it’s time to make preparations to attach the following one. Lay the unattached signature on top of the attached one. Then, after you finish the outer loop on that final hole, instead of going back inside the attached signature, return the needle into the interior of the new signature to bind everything together."
    },
    {
      "title": "Continue adding signatures.",
      "content": "Continue adding signatures. Repeat the stitching process, as with the previous signature. The only difference will be that you’ll always need to loop around the previous signature’s outer stitch before making that final move into the interior. This will help to hold everything together."
    },
    {
      "title": "Rethread as needed.",
      "content": "Rethread as needed. When you reach a point where you have around six inches of thread left, then go ahead and stop to get more. Pull your needle and thread under one of the thread lines inside a signature and tie it off into a knot. Tuck the ends under a thread line and cut the extra off. Add new thread to your needle, knot it at the end, and continue one to the next open signature hole in the interior. It’s fine to leave the knot visible at this point. When you are finished, go back through and tuck all of the visible knots into the thread strands and cut away any excess with small scissors."
    },
    {
      "title": "Attach the front cover.",
      "content": "Attach the front cover. When you reach the first hole of the last signature, then it’s time to put on the cover. Place it on top and align the holes. Go from the last exterior stitch in the signature and push the needle directly into the top exterior hole in the top cover. Pull the thread through the inside, making it come out of the spine between the cover and signature. Loop the needle around the last signature’s knot and come out once before going into the signature hole from the spine."
    },
    {
      "title": "Repeat to finish the cover binding.",
      "content": "Repeat to finish the cover binding. Repeat this process until you have secured the rest of the cover to the final signature. When you’ve pulled the needle and thread through the last hole of the interior signature, then loop the needle under an existing thread and tie it off. Tuck away and cut off any excess."
    }
  ]
}