{
  "url": "https://www.wikihow.com/Get-Into-Oxford-University",
  "title": "How to Get Into Oxford University",
  "steps": [
    {
      "title": "Review the full list of courses on the University of Oxford’s website.",
      "content": "Review the full list of courses on the University of Oxford’s website. When you apply to Oxford, you need to know what course of study you'll follow from the start. The university offers a wide variety of undergraduate courses and Bachelor’s degree programs. [1] X Research source Take a look at the courses that pique your interest at the academic level that’s right for you. Expand your search beyond your favorite topic in school. You may not have studied Archaeology before but it could be a perfect combination of your interests. Consider some of the joint course offerings. A program like Economics and Management or History and English could allow you to explore multiple avenues during your studies. [2] X Research source"
    },
    {
      "title": "Review the course’s application requirements and selection criteria.",
      "content": "Review the course’s application requirements and selection criteria. Each course’s info page outlines the scores and skills required for entry. There may be requirements for languages, standardized test scores, and grades. Beyond these metrics, you’ll be asked to submit supporting materials like references, a personal statement, writing samples, and official transcripts. Plus, your course may have a dedicated admissions exam. [3] X Research source The undergraduate Classics course, for example, requires 2 writing samples, proficiency in Greek or Latin, and the completion of the Classics Admissions Test. As for grades, it requires 3 “A” grades at the A-level and an IB score of 39. [4] X Research source If A-levels and the IB sound unfamiliar, don’t worry! Oxford outlines international requirements for students applying from outside the U.K. A student from the U.S. would need a score of 1,470 on the SATs or a 32 on the ACT. [5] X Research source"
    },
    {
      "title": "Develop a strong work ethic.",
      "content": "Develop a strong work ethic. You're going to need to work very hard to get admitted to Oxford, not to mention once you start your university studies. Learn to love studying and to thrive under a rigorous study schedule. [6] X Research source"
    },
    {
      "title": "Be passionate about your area of study.",
      "content": "Be passionate about your area of study. Genuine enthusiasm and curiosity can get you very far in the admissions process. [7] X Research source Go beyond the standard curriculum. For the ideal Oxford candidate, things learned in school and for standardized tests are still fairly limited in scope. Broaden your knowledge as much as possible. If you have the financial resources, take extra classes at a local community college, summer school, or tutoring center. If you can't afford to pay for additional courses, teach yourself more about your subject by reading as much about it as you can get your hands on. Go to a nearby university library and check their collection of books, do Internet searches on your subject, etc."
    },
    {
      "title": "Get perfect grades in high school.",
      "content": "Get perfect grades in high school. As rigid as this may seem, it's important. Oxford has extremely high standards when it comes to grades, so they need to be perfect. [8] X Research source Don't let extracurricular activities overshadow your academic work. It's a myth that you must be incredibly well-rounded to be accepted into Oxford. While some Oxford students have lots of extracurricular interests, others may be solely focused on their passion for study. This doesn't mean you should give up an activity you really love and bury yourself in books all day, every day. Passions and talents are always attractive in candidates–and besides, they make your life more enjoyable."
    },
    {
      "title": "Decide which Oxford school or college you want to attend.",
      "content": "Decide which Oxford school or college you want to attend. At Oxford, students belong to a department or faculty as well as a college or hall. The university is comprised of over 30 colleges, which function as academic communities where students have small-group study sessions called tutorials. (Lectures, testing, grading, etc. is organized by the department.) Each college also has its own dining hall, common room and library, plus groups and societies. Find out which colleges accept applications for your course of study by visiting the course page of the university website. Browse information about the colleges on the website. You'll find they differ in terms of accommodation, location, funding opportunities, and whether they are for graduates and undergraduates alike. [9] X Research source Your application is judged by the department, not the college, so your candidacy will not be affected by your choice of college. You might also be reallocated to a college different from the one you applied to. You also have the option of making an \"open application\" by entering the specified code on your application (see application instructions for more details). In this case, the university will assign you to a college or hall. [10] X Research source"
    },
    {
      "title": "Find out the entrance requirements for your chosen field of study.",
      "content": "Find out the entrance requirements for your chosen field of study. The fastest way to do this is by visiting the course page of the website, as well as the general undergraduate admissions information page. Admissions requirements include certain scores on standardized tests, coursework in high school, and examples of written work. [11] X Research source You'll also need to write a personal statement about the subject you've chosen to study, and a reference from a teacher or advisor. [12] X Research source"
    },
    {
      "title": "Write your personal statement in the summer.",
      "content": "Write your personal statement in the summer. Your personal statement will explain why you’re interested in pursuing your chosen course of study. Use this opportunity to demonstrate your commitment to the field. Provide concrete examples to illustrate your curricular and extracurricular experiences and how they’ve led you to pursue the path you’re applying for. [13] X Research source Once you’ve put together an initial draft, cross-reference your statement with the selection criteria for your course. See if you’ve addressed each point or rework some passages to more clearly and specifically address these criteria."
    },
    {
      "title": "Begin your online application as soon as possible.",
      "content": "Begin your online application as soon as possible. Depending on your course and academic level, the online application portal may open up as early as June. Begin yours as soon as possible so you can start inputting your personal information and prepare all the required materials. To do so, you’ll click on the “Apply” button on your chosen course’s page under the “How to Apply” header. [14] X Research source Fill out as much information as you can, such as your name, address, contact details, and academic history. Look through the rest of the application and make note of the specific documents you need to upload or mail in."
    },
    {
      "title": "Seek out academic references from professors and mentors in the summer.",
      "content": "Seek out academic references from professors and mentors in the summer. Find out how many references your course requires. Schedule meetings with your potential references during which you’ll explain your intentions at Oxford as well as the recommendation process. Once they confirm, you can register these individuals through your online application. [15] X Research source Since every university follows a different timeline and process, your references may not be familiar with Oxford’s. You’ll need to clearly communicate the ins and outs of the recommendation process as well as the deadline. Be prepared to share your transcripts, writing samples, and personal statement with your recommender. This can help them decide how best to describe your abilities and qualities. If you’d like them to describe a specific instance or attribute, don’t be afraid to say so. Give your potential references time to consider your request. Once the reference has been submitted, follow up with a thank-you card and keep your recommenders up-to-date on your application status."
    },
    {
      "title": "Take an English-language proficiency test if you're not a native speaker.",
      "content": "Take an English-language proficiency test if you're not a native speaker. Accepted standardized tests include IELTS, TOEFL, CAE, CPE, the English Language GCSE, International Baccalaureate Standard Level in English, and the European Baccalaureate. [16] X Research source"
    },
    {
      "title": "Keep potential dates for your Oxford interview free.",
      "content": "Keep potential dates for your Oxford interview free. If the department you've applied to thinks your application is strong enough, they'll shortlist you. In that case, you need to attend an interview. However, sometimes applicants receive notice that they've been shortlisted just a few days before the interview is scheduled. In that case, you should be ready to go. Check the interview timetable on the university website for dates when they're holding interviews. The interview schedule is very tight, and rescheduling is generally not possible. [17] X Research source Keep in mind that accommodation and meals are free of charge when you come for your interview. If you have a disability, let the university know as soon as possible so they can accommodate you during the interview scheduling and process. International students living far from the UK may be able to schedule an interview over the phone or Internet. The exception is applicants for Medicine, who must come to Oxford. [18] X Research source You'll receive a letter from the college if you've been selected to come to an interview. It might be very short notice, up to a week in advance. [19] X Research source"
    },
    {
      "title": "Practice talking through your thinking process.",
      "content": "Practice talking through your thinking process. During the interview you'll be asked questions whose aim is not for you to regurgitate what you already know, but rather to apply the knowledge you have to solve new tasks. The interview tutor wants to hear you think aloud, so practice this in advance with a friend or teacher, with them asking you questions and you talking through your response. [20] X Research source An applicant to psychology might be asked why studies have shown that Welsh speakers have more difficulty memorizing phone numbers than English speakers. Hopefully, the interviewee would be able to make the connection that memory and arithmetic depend on how easily pronounced the words are (Welsh numbers are longer than English ones). A would-be art history student might be asked to discuss a painting that they've never seen before. [21] X Research source In this case they could apply their analytical skills, refer to relevant influences or movements, etc. Remember, the best preparation you can have is a broad knowledge of your area of focus."
    },
    {
      "title": "Watch mock interview clips.",
      "content": "Watch mock interview clips. The university's website features clips of mock interviews. This is a great opportunity to get a sense of the interview format. You can also find sample questions on the Interview section of the university's website."
    },
    {
      "title": "Be prepared to talk about your personal statement and possibly other schoolwork at the interview.",
      "content": "Be prepared to talk about your personal statement and possibly other schoolwork at the interview. The tutor will try to put you at ease by asking you some simple questions to start off with, such as about your personal statement. Be sure you reread your statement and any other written work you've submitted with your application so you're ready to talk about it. [22] X Research source Your letter of invitation will specify any documents you need to bring along, but it's a good idea to bring a copy of your personal statement. Dress comfortably on your interview. The tutors who interview you tend to be casually dressed, and formal dress on your part is not at all required."
    },
    {
      "title": "Develop a strong work ethic.",
      "content": "Develop a strong work ethic. Study at Oxford is highly rigorous, and they want students who can handle a demanding academic workload. Prove you've got what it takes by investing time in your studies every day. If you need help balancing your academic load with other commitments (work, family, etc.), talk to your academic advisor for suggestions. Some Oxford departments require a minimum of a 3.7 GPA (on the 4.0 scale), while others require a minimum of 3.5. [23] X Research source"
    },
    {
      "title": "Take advantage of academic opportunities at your current university.",
      "content": "Take advantage of academic opportunities at your current university. You can become a more attractive candidate for graduate study if you've shown a strong interest in your area of study. Chances are your current university offers opportunities to go beyond the required coursework, including clubs related to your subject, extra research opportunities, and internships. If you're unsure about what opportunities are available to you, ask your academic advisor to point you in the right direction. Don't forget that your university's library is a major resource. Check out books on your subject and read up on topics that interest you."
    },
    {
      "title": "Research the course of study you want to apply for at Oxford.",
      "content": "Research the course of study you want to apply for at Oxford. You can do this via the university's website, which has specific pages for each course. Application requirements vary from course to course. The course pages also provide information about what makes you eligible, particularly with regard to your university grades."
    },
    {
      "title": "Read the university's Application Guide.",
      "content": "Read the university's Application Guide. This guide is available through the graduate admissions page and differs from year to year, so make sure you're reading the guide for your admissions year. Familiarize yourself with the application process and note any and all requirements, including standardized tests, undergraduate transcripts, references (letters of recommendation), and any written work you need to submit. On the whole, if there are discrepancies between what the course page and the Admissions Guide state regarding the application process, the Admissions Guide takes precedence. If you have questions, contact the Graduate Admissions and Funding office through the website. Specific application processes apply to the following programs: the Postgraduate Certificate in Education, said Business School courses, Software Engineering courses, Clinical Medical degrees, the Doctoral Program in Clinical Psychology, and the Foreign Service Program. [24] X Research source If you're applying as a transfer student from the US, know that the British educational system is a little bit different. They don't typically tend to focus as much on extracurricular involvement, but they are very much concerned with your grades."
    },
    {
      "title": "Decide what college you want to attend.",
      "content": "Decide what college you want to attend. Graduate students belong to both their department and a college or hall. The colleges and halls are smaller communities within the university, where you'll be assigned a tutor who'll provide academic support. Each college has its own facilities, including accommodation, library, dining hall, and common room. [25] X Research source Find out which colleges accept applications for your course of study. You can do this on the course webpage. Other factors when choosing a college include: accommodation for couples, families and/or students with disabilities; funding opportunities; location within Oxford; and whether it is specifically for graduates (some are a mix of undergrads and grads). Your application status does not depend on the college you choose. However, you may be reallocated to a college different from the one you've applied to. Note that you can also make an \"open application,\" and you'll be assigned to a college by the university. In this case, use the code provided on the application to indicate you have no college preference. [26] X Research source"
    },
    {
      "title": "Research funding opportunities.",
      "content": "Research funding opportunities. Unlike US universities, Oxford does not always provide funding for its graduate students, and teaching opportunities, though there are a few, are not institutionalized. You'll need to consider how to finance your graduate study at Oxford, which can be a big investment. Fortunately, there are a number of funding opportunities available to UK and international students. Learn more on the Fees and Funding page of the university's website. [27] X Research source"
    },
    {
      "title": "Choose referees who know your academic work.",
      "content": "Choose referees who know your academic work. You'll need to provide references as part of your application. Ideally, these should be professors or advisors familiar with your academic work who can speak to your ability and potential for graduate study. Don't be afraid to ask for letters of recommendation: this is something professors do all the time. Be sure to ask them well in advance of the deadline. Give them clear instructions as to the process (for Oxford it's all done online), and when the deadline is. You'll need to register them on the Oxford online application, and then they will receive a reference request. Oxford does not send reminders about reference deadlines; you are responsible for checking that your referee has submitted the letter on time. Do not get references from friends or family. [28] X Research source"
    },
    {
      "title": "Complete the online application.",
      "content": "Complete the online application. Make sure you do so before the deadline for graduate admissions. You may or may not be asked to do an interview, depending on your department. Use the checklist on the Applications page to ensure you've submitted all necessary application materials."
    },
    {
      "title": "Take an English-language proficiency test if you're not a native speaker or national of a majority English-speaking country.",
      "content": "Take an English-language proficiency test if you're not a native speaker or national of a majority English-speaking country. Ideally, you should have this done before the application deadline; however, if you complete it after the deadline, have your results sent to Oxford as soon as they're available or submit them yourself electronically. [29] X Research source Tests recognized by Oxford include: English Language Testing System (IELTS) Internet-based Test of English as a Foreign Language (TOEFL iBT) Cambridge Certificate of Proficiency in English (CPE) Cambridge Certificate in Advanced English [30] X Research source"
    }
  ]
}