{
  "url": "https://www.wikihow.com/Fend-off-a-Mountain-Lion",
  "title": "How to Fend off a Mountain Lion",
  "steps": [
    {
      "title": "Recognize the signs of a pending attack.",
      "content": "Recognize the signs of a pending attack. If a mountain lion is less than 25 yards away from you and is staring directly at you, it is preparing to attack you. It will be positioned low to the ground with its tail twitching back and forth."
    },
    {
      "title": "Back away slowly.",
      "content": "Back away slowly. Conventional wisdom has suggested you should never run away from a mountain lion because this will trigger its instinct to chase its prey and attack you by biting your neck. However, recent studies have shown that freezing in your current position in front of the mountain lion leaves you at a greater risk for serious or fatal injury than backing away slowly or even running away quickly. Slowly backing away from the lion has been shown to have the lowest levels of fatality. [1] X Research source If you choose to run (which is unrecommended), check your terrain and make sure if you can get a strong, flat spring. If you have to run up jagged or hilly terrain, the mountain lion might think you are injured and thus, even better prey."
    },
    {
      "title": "Make some noise.",
      "content": "Make some noise. If you decide to stand your ground in front of the mountain lion, don't do it silently. Speak very loudly and firmly to the mountain lion; you can even try yelling at it to intimidate it. Do not scream or shriek as if you are terrified; rather, yell very forcefully."
    },
    {
      "title": "Make yourself larger.",
      "content": "Make yourself larger. Stand tall and raise your arms overhead and open your coat so you make yourself seem as big and intimidating as possible. If small children are with you, pick them up. (By doing so, you are making yourself look bigger and protecting the child at the same time.) Puff up your chest and throw your shoulders back. Do not bend down before the mountain lion as they will take this as a sign of weakness."
    },
    {
      "title": "Have a weapon to defend yourself.",
      "content": "Have a weapon to defend yourself. If you have any kind of walking stick, a hunting knife, rocks or another large weapon to deter the mountain lion, you should use it at the moment of attack. Pepper spray might also be a successful deterrent. If the mountain lion acts aggressively, throw stones at or near it; convince it that you could be dangerous. You can also use a hunting rifle or pistol to fire at the lion if it makes a charge at you. You should first attempt to fire a warning shot to scare off the lion before it attacks."
    },
    {
      "title": "Protect your neck, throat, and head.",
      "content": "Protect your neck, throat, and head. The mountain lion will most likely attempt to tackle you and crush your skull or bite your throat. Try to block the mountain lion from your eyes and face as you strike it. Do everything you can to fight it off. An average adult should be able to ward off an attack by fighting back since mountain lions are rather small. Aim for the head, mouth, and eyes."
    },
    {
      "title": "Report the sighting.",
      "content": "Report the sighting. As soon as you are able, report your encounter to authorities."
    },
    {
      "title": "Look out for tracks.",
      "content": "Look out for tracks. The best way to avoid a mountain lion is to leave the area at the first sign of its presence. If you are hiking or camping, be on the lookout for mountain lion tracks. Its paw prints will have an imprint of slightly triangular heel surrounded by four toes. The top of the heel will have two lobe bumps while the bottom of the heel will have three. The toes are slightly elongated, so they will look like extended ovals; they generally will not have claw marks. Mountain lions move at a much slower pace than dogs or coyotes, so the tracks will be further spread apart and also directly behind each other. Be sure not to dismiss paw prints for those of a dog or coyote."
    },
    {
      "title": "Watch out for mountain lion scat.",
      "content": "Watch out for mountain lion scat. This will be a telltale sign a mountain lion has been nearby! The scat is broken into segments that are about 1\"-1 1/2\" in diameter (or roughly the same size as a dog's poop). If you dare to look closer, it might also contain bones, teeth and hair from its latest kill. [2] X Research source"
    },
    {
      "title": "Be aware of claw rakings.",
      "content": "Be aware of claw rakings. These are scratches that male mountain lions will often leave on tree trunks to announce their presence and also to mark their territory. They will generally fall between four and eight feet up on the tree. If mountain lions are common in your area, it might be a sign that you are in a mountain lion's favorite path. Mountain lions are not the only animals that make these kinds of markings; bears will often make similar markings, but there will be larger chunks of bark missing. Elk will sometimes scrape their antlers on tree trunks, but these will be smaller, more horizontal markings."
    },
    {
      "title": "Respect the mountain lion's space.",
      "content": "Respect the mountain lion's space. If you see a mountain lion off in the distance (more than 100 yards away), do not run after it, especially if it is moving away from you. If you have children with you, do not let them go after the mountain lion. Unlike lions or other big cats, mountain lions have not been socialized around human communities; they are therefore much more likely to avoid you than to attack you."
    },
    {
      "title": "Hike and camp in groups.",
      "content": "Hike and camp in groups. Mountain lions are solitary creatures: they do not hunt in packs. Therefore, if you are hiking or camping in a group of people, they will be far less likely to attack you than if you are just by yourself."
    },
    {
      "title": "Avoid hiking at dusk or dawn.",
      "content": "Avoid hiking at dusk or dawn. Mountain lions are most active between twilight and dawn; they have superior vision at night and they prefer to use this advantage when they hunt. If you are in an area known to have mountain lions avoid walking alone at night, early morning, or in the early evening."
    },
    {
      "title": "Deer-proof your home.",
      "content": "Deer-proof your home. Mountain lions love to eat deer; therefore, you should attempt to deter deer from your property if you live in an area with mountain lions. Deer, in turn, love to eat vegetation such as roses, chrysanthemums, and berries, so you should avoid planting these items or keep them in an enclosed planter. Installing outdoor lighting and automated sprinklers will also help detract deer and mountain lions."
    },
    {
      "title": "Keep your domestic pets indoors.",
      "content": "Keep your domestic pets indoors. Generally, a mountain lion will always prefer to eat deer, elk, or porcupines, but in an area where food is scarce, they will also attack livestock and your household pets. Make sure you keep your dogs and cats indoors or on a leash if they are outside so they do not attract a mountain lion. Livestock should be kept in fenced or sheltered areas (like a barn or stables) for protection. [[Image:Fend off a Mountain Lion Step 14.jpg|center]"
    }
  ]
}