{
  "url": "https://www.wikihow.com/Create-an-Online-Bitcoin-Wallet",
  "title": "How to Create an Online Bitcoin Wallet",
  "steps": [
    {
      "title": "A Bitcoin wallet allows you to send and receive Bitcoin.",
      "content": "A Bitcoin wallet allows you to send and receive Bitcoin. Before you can buy your first Bitcoin, you'll need a wallet to keep it in. You can think of a wallet as being similar to a checking account—you can make deposits and withdrawals, or you can transfer your Bitcoin from one wallet (account) to another. [1] X Research source Most wallets also keep records of your Bitcoin transaction history and allow you to manage your balance, much like a bank account."
    },
    {
      "title": "Online wallets are typically easiest for beginners.",
      "content": "Online wallets are typically easiest for beginners. An online wallet is just like an online bank account and the interface is relatively easy to navigate. Because many online wallets also have mobile apps, you can access your Bitcoin anywhere. [2] X Research source One major drawback of online wallets is that instead of storing your private keys on your own device, online wallet providers generate and store your keys online. [3] X Research source If you've ever heard the phrase \"not your keys, not your coins,\" it's referring to this—if you don't have custody of your keys as you would with a downloadable or hardware wallet, your funds can be withheld by the wallet provider at any time. [4] X Research source You're responsible for keeping your account safe. Another downside of online wallets lies in their very nature. Since they're always online, they're always vulnerable to hackers. If an online wallet provider is hacked, you could lose your coins forever. Review security features very carefully when choosing an online wallet, and refrain from storing large quantities of Bitcoin on the web."
    },
    {
      "title": "Software wallets allow you to keep your Bitcoin on your personal computer.",
      "content": "Software wallets allow you to keep your Bitcoin on your personal computer. Because your Bitcoin keys are kept on your computer, not online, software wallets are much safer than online wallets. However, they're only as safe as your computer, so make sure you have strong security and firewalls in place before you download a software wallet. [5] X Research source Many companies that offer software wallets have connected online or mobile wallets. It's a simple option if you're concerned about the vulnerability of keeping all your Bitcoin in an online wallet (even if you don't have that much of it)."
    },
    {
      "title": "Hardware wallets are the most secure option for holding Bitcoin.",
      "content": "Hardware wallets are the most secure option for holding Bitcoin. If you're holding large amounts of Bitcoin, or if you plan on holding it for a long time, a hardware wallet is your safest bet. Because they're not connected to the internet, you don't have to worry about hackers stealing your stash. [6] X Research source Because they're not online, they're not convenient if you plan to use Bitcoin for day-to-day purchases. You might consider also having an online wallet where you keep a small amount of Bitcoin for that purpose, in addition to a hardware wallet—kind of like having a savings account and a checking account."
    },
    {
      "title": "Exodus is one of the most accessible wallets for beginners.",
      "content": "Exodus is one of the most accessible wallets for beginners. This downloadable wallet has a simple, straightforward user interface and is available through both desktop and mobile apps. It also has strong support features so you can get help if you need it. Exodus also holds other cryptocurrencies, so it's a good choice if you're not planning on sticking to just Bitcoin. An advantage of using Exodus is that it includes a built-in exchange, allowing you to trade Bitcoin and other cryptocurrencies without leaving your wallet. [7] X Research source"
    },
    {
      "title": "Blockchain.com is a truly online wallet.",
      "content": "Blockchain.com is a truly online wallet. If you're looking for a fully online wallet that you can access in any web browser, Blockchain.com is a simple, popular option. Keep in mind that even though Blockchain.com is a legit company with a functional wallet product, you won't actually own your private keys—they are stored on Blockchain.com's servers rather than your own computer. Like Exodus, Blockchain.com supports multiple cryptocurrencies. You can also purchase Bitcoin from within the wallet, as well as trade it for other cryptocurrencies."
    },
    {
      "title": "Electrum is a downloadable, Bitcoin-exclusive wallet with a hardware option.",
      "content": "Electrum is a downloadable, Bitcoin-exclusive wallet with a hardware option. If you're thinking about adding a hardware wallet at some point to hold the bulk of your Bitcoin, you can do this easily with Electrum. This wallet also has a lot of customization features, which you'll find yourself using more and more if you become more involved."
    },
    {
      "title": "Mycelium is a mobile-only online wallet with hardware support.",
      "content": "Mycelium is a mobile-only online wallet with hardware support. Like Electrum, Mycelium allows you to connect and manage Bitcoin in a hardware wallet within its user interface. But unlike Exodus or Electrum, the online wallet is only accessible through a mobile app. Users have found that Mycelium can be a bit confusing for beginners, although, with hardware support and the ability to hold multiple cryptocurrencies, it might be something for you to look at if you become more invested in crypto."
    },
    {
      "title": "Find the best wallet for you through Bitcoin's website.",
      "content": "Find the best wallet for you through Bitcoin's website. Not all wallets are available for users in all countries, and the most popular wallets might not necessarily have the features you want. Go to https://bitcoin.org/en/choose-your-wallet to use Bitcoin's tool. It will help you choose the best wallet for your needs based on your answers to a few questions."
    },
    {
      "title": "Most online Bitcoin wallets are free if you're using them for storage.",
      "content": "Most online Bitcoin wallets are free if you're using them for storage. You don't have to pay anything for setting up an online wallet or accessing it, nor are you charged a fee for keeping your Bitcoin there—the same goes for software wallets. However, if you want to spend your Bitcoin, you'll pay a fee for every transaction. Depending on your wallet or method of payment, you may be able to set this fee yourself, but beware that it might take longer to complete your transactions if you set the fee too low. Hardware wallets aren't free. They typically run you anywhere from $50-200."
    },
    {
      "title": "Open an account at the website that offers the wallet.",
      "content": "Open an account at the website that offers the wallet. For an online wallet, this is typically all you need to do. If you want mobile access to it, download the mobile app on your smartphone. Choose the link on the homepage to open an account, then follow the prompts. For example, if you want the official Bitcoin wallet, go to https://wallet.bitcoin.com/ . The mobile app is available for both iOS and Android."
    },
    {
      "title": "Create a strong password and use 2-factor authentication.",
      "content": "Create a strong password and use 2-factor authentication. Securing an online wallet is much like securing your online bank account. The biggest difference is that Bitcoin wallets don't have as many online password recovery options in the event you forget your password—so memorize it or write it down and keep it in a safe place! If you lose access to your wallet, you lose access to your Bitcoin and might not be able to get it back. [8] X Research source Think of an online Bitcoin wallet as being the same as having a physical wallet with cash. If it's stolen, you have no way of getting it back, so only store as much as you can afford to lose."
    },
    {
      "title": "Write down your security key and store it somewhere safe.",
      "content": "Write down your security key and store it somewhere safe. When creating any type of Bitcoin wallet, you'll be shown a security key that looks like several unrelated words in an ordered list. This key is meant to restore your wallet if you ever lose your password. Make sure to write this key down exactly as you see it. Do not take a screenshot or photo of the key and leave it on a phone, tablet, or computer—if someone finds your private key, they can use it to restore your wallet and access your funds. It is extremely important that you never lose this key!"
    },
    {
      "title": "Yes, and many online wallets also have a mobile app.",
      "content": "Yes, and many online wallets also have a mobile app. With a smartphone, you can access an online wallet from your phone's browser as long as you have access to the internet. While that might be all you need, you might find that the mobile app (if there is one) is more accessible and easier to navigate. [9] X Research source Mobile wallets are great if you're planning on buying things with Bitcoin in brick-and-mortar shops. Many restaurants and retailers accept payment in Bitcoin, so if this is something you want to take advantage of, set up an app on your phone."
    },
    {
      "title": "Buy Bitcoin from a cryptocurrency exchange, then transfer it.",
      "content": "Buy Bitcoin from a cryptocurrency exchange, then transfer it. Online cryptocurrency exchanges work just like online stock brokers, although they're not as tightly regulated. Do your research before choosing an exchange to make sure it's secure and has a strong reputation. Once you open your account, you'll need to connect a bank account so you can make your initial purchase. [10] X Research source When your Bitcoin appears in your exchange account, navigate to the option to transfer it to a wallet, then enter your wallet's public address and the amount of Bitcoin you want to place there. The Bitcoin should appear in your wallet almost immediately after you click the button to transfer it. Online wallets are designed to hold as much Bitcoin as you have—none of them have a limit on how much Bitcoin you can keep. That being said, it's still not a good idea to keep a lot of Bitcoin in an online wallet because being online makes it vulnerable to hackers."
    },
    {
      "title": "Set your transaction fee as low as possible for everyday transactions.",
      "content": "Set your transaction fee as low as possible for everyday transactions. Transaction fees are paid to the \"miners\" who verify transactions on the blockchain. This is really all Bitcoin is—a record of transactions. Miners are just people with supercomputers that solve complex equations extremely fast to verify a transaction when it pops up. The fee is their \"bounty\" for doing that work. [11] X Research source A good transaction fee depends on the average transaction fee at the time of your purchase (and this fluctuates). Transaction fees are measured in satoshis/byte, where a \"satoshi\" is approximately 0.00000001 BTC. You can find the average transaction fee online (many wallets will allow you to choose the average transaction fee by default). [12] X Research source If you set your transaction fee as low as possible, it might take a little longer for your transaction to be verified and confirmed. But for most transactions, this shouldn't really be a problem. For example, if the average transaction fee was 25 satoshis/byte and you set your transaction fee to 40 satoshis/byte, you'd likely have your transaction verified within an hour or so. Since you have the option of setting your transaction fee for each transaction, you can easily bump it up if you have an urgent transaction that you want to be verified more quickly."
    },
    {
      "title": "Businesses typically have a QR code you scan with your phone.",
      "content": "Businesses typically have a QR code you scan with your phone. Scanning the code gives you the business's wallet address, then you just type in or confirm the amount of Bitcoin you want to send. You'll need access to your Bitcoin wallet from your smartphone to use this feature. [13] X Research source If there's no mobile app for your online wallet, just pull it up using your phone's browser. For online purchases, simply copy the vendor's Bitcoin address and paste it into the appropriate field in your wallet, then enter the amount of Bitcoin you want to send. You'll pay the transaction fee for every purchase you make. This is why it's a good idea to have that fee set as low as possible if you're planning on making a lot of small purchases (such as lunch or a cup of coffee)."
    },
    {
      "title": "Copy the person's public wallet address to send Bitcoin to their wallet.",
      "content": "Copy the person's public wallet address to send Bitcoin to their wallet. It's really as simple as this! Simply ask the person you want to send Bitcoin to for their public wallet address. Open your wallet and navigate to the \"send\" feature, then enter the person's public wallet address and the amount of Bitcoin you want to send to them. [14] X Research source Confirm that the address is correct before you hit that send button. If you make a mistake, you won't be able to get the Bitcoin back."
    }
  ]
}