{
  "url": "https://www.wikihow.com/Culture-Microworms",
  "title": "How to Culture Microworms",
  "steps": [
    {
      "title": "Find a microworm starter culture.",
      "content": "Find a microworm starter culture. Because these worms don't lay eggs, you will need a few live adult microworms to start your culture. Remember that not all nematode species are a good food source, and some may even make your fish sick. If your local fish store sells live food, check for microworms there. Try getting in touch with other local hobbyists through aquarist clubs. A member there may cultivate microworms and may be willing to either give or sell you a starter. For a few dollars, you can also order microworms online. They are sold everywhere from large general auction sites to small hobbyist forums. If the species is listed, check to make sure that it belongs to the Panagrellus genus. Panagrellus redivivus is the most commonly found microworm. Remember that microworms are tiny white worms that are barely visible to the naked eye. A started culture of a large group of worms should like a gray or light brown clump. If your starter looks significantly different from this, you may have another type of worm that has been misidentified. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Buy or repurpose a container and some type of food starch.",
      "content": "Buy or repurpose a container and some type of food starch. Almost any container can be used, as long as it's deep enough for you to fit your index finger inside. Clear containers with resealable lids are the most convenient. Some popular options include yoghurt tubs, mason jars, and resealable plastic food containers. Any type of human food-grade starch is usable. Common sources of starch include oatmeal, wheat flour, bread, cornmeal, mashed potatoes, and cereal. If you're using a sealable container, be sure to poke small slits in the lid with a knife. Air exchange is necessary for a microworm colony to thrive. If your container doesn't have its own lid, cover the top up with tin foil."
    },
    {
      "title": "Obtain some active yeast.",
      "content": "Obtain some active yeast. Microworms don't actually eat the starch. Instead, they eat microscopic yeast that feed on carbohydrates. You can find conveniently packaged dry yeast in the baking section of most supermarkets. Some stores also sell fresh compressed yeast that must be refrigerated. [2] X Research source If you bake bread or brew beer at home, you can also use the same yeast to culture microworms."
    },
    {
      "title": "Add starch to the bottom of your container.",
      "content": "Add starch to the bottom of your container. You don't need to cook or otherwise prepare your starch before placing it in the container. Use enough so that it covers the bottom of the container and is roughly half an inch (1.6 centimeters) thick. Spread your starch out so that it is roughly even."
    },
    {
      "title": "Pour some water on top of the starch.",
      "content": "Pour some water on top of the starch. Add enough water to thoroughly soak the starch but not so much that a water line rises above it. You can also stir the two together to get a creamy consistency. This is not necessary but may make your culture grow faster."
    },
    {
      "title": "Sprinkle yeast over the starch.",
      "content": "Sprinkle yeast over the starch. If you purchased dry yeast, sprinkle some all across the starch in your container. If you're using compressed yeast, shave off some thin pieces from the cake and lay them flat on top of the starch. The exact amount of yeast you'll use isn't exact and will vary based on how wide your container is. You want to distribute yeast all across the starch."
    },
    {
      "title": "Add a spoonful of microworms.",
      "content": "Add a spoonful of microworms. Take a teaspoon and scoop up some microworms and add them to the container. Microworms can move easily across the starch, so you don't need to spread them out. The more worms you start with, the faster your culture will grow. However, even only two worms can reproduce quickly enough for a usable starter in a few weeks. Consider refrigerating your starter culture. In case you experience a catastrophic crash in all of your cultures, make sure to keep your starter to begin them anew. When kept in cold temperatures, microworms slow their metabolisms down. At refrigerator temperature, a starter can stay alive for over six months. Your starter culture likely came in a resealable bag. If so, simply seal it back up and place in the refrigerator. If not, transfer your starter into a resealable bag or a sealable plastic storage container."
    },
    {
      "title": "Cover your culture.",
      "content": "Cover your culture. Wait about one week. You will know your worms are ready to harvest when you start seeing worms moving up the sides of the container. Microworms reproduce well at room temperature. In a warmer environment, the culture will grow more quickly but won't last as long. Don't worry if you have a cold snap; microworms can survive in temperatures down to 32 °F (0 °C)."
    },
    {
      "title": "Stir your culture weekly.",
      "content": "Stir your culture weekly. Microworms don't burrow like earthworms do. To keep their food source available, mix your culture by stirring once a week. This will bring fresh nutrients and yeast to the surface."
    },
    {
      "title": "Keep at least two cultures going at a time.",
      "content": "Keep at least two cultures going at a time. Microworm cultures don't last forever, and it's good to have a backup in case your worm colony crashes unexpectedly. To make sure you always have enough microworms on hand for your fry, start at least one more culture."
    },
    {
      "title": "Recognize when a culture has gone bad.",
      "content": "Recognize when a culture has gone bad. Microworm cultures only last about two weeks to a month. Sometimes, because of contamination, they may go bad even more quickly. Bad cultures won't stay alive long and should be thrown out. Know the signs of a microworm culture going bad: It undergoes significant visual changes. If the color of your culture media changes significantly, play it safe and toss it out. Older cultures will also darken as waste accumulates. Keep in mind that it's normal for the consistency to become soupier and more like a liquid as the yeast break down their food source. Contaminants are growing in the culture. If you see a significant amount of mold or maggots, it's best to start fresh. If there's mold in only a tiny section, try scooping it out first. Keep in mind that maggots aren't dangerous to fry and actually make a good live food for adult fish. You can still harvest microworms from a culture with maggots, but keep in mind the culture itself may not last long. It takes on a foul odor. While some may find the smell of a healthy culture unpleasant, it has a relatively mild yeasty odor. If your culture begins to smell foul, then it's likely to have been contaminated with bacteria. These bacteria can potentially harm your fish and may kill the microworms themselves."
    },
    {
      "title": "Place your culture on a mild heat source for 10-20 minutes.",
      "content": "Place your culture on a mild heat source for 10-20 minutes. On top of your aquarium is the perfect spot. The heat will cause the worms to crawl further up along the side of the container, making them easier to harvest. This step isn't required, but it will let you harvest more microworms. [3] X Research source Remove the container lid."
    },
    {
      "title": "Scoop up a portion of worms and add them to your tank.",
      "content": "Scoop up a portion of worms and add them to your tank. Wipe the side of your container where the worms are crawling with your finger, a rubber spatula, or a spoon. By focusing on the sides, you will avoid scooping out the culture media. While a little yeast and starch is harmless, too much can foul your aquarium water. The worms won't live more than 24 hours in water, so try not to overfeed. Be sure to replace the lid on your container as soon as possible."
    },
    {
      "title": "Dip the worms into your aquarium.",
      "content": "Dip the worms into your aquarium. Watch the microworms drop to the bottom. Nematodes don’t swim, so the fish will eat most of them at the bottom of the tank. If you're counting on the current to keep them from sinking, double-check that it's strong enough. Worms that fall between pieces of gravel will be impossible for most fish to get to. It's best to use either a different substrate or keep a bare bottom tank when regularly feeding microworms."
    }
  ]
}