{
  "url": "https://www.wikihow.com/Dress-a-Burn",
  "title": "How to Dress a Burn",
  "steps": [
    {
      "title": "Take off burnt clothing and restricting jewelry.",
      "content": "Take off burnt clothing and restricting jewelry. Remove burnt clothing so it does not cover the burn area. Do not pull any clothing off of the burn if it is stuck. [1] X Research source Remove any rings, bracelets, earrings, or necklaces that are close to the burn area or restricting blood flow to the area."
    },
    {
      "title": "Place the burn under cool running water for 10-20 minutes.",
      "content": "Place the burn under cool running water for 10-20 minutes. Make sure the water is not ice cold or hot, as this can damage the skin further. [2] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Try not to touch, pinch, or scrub the burn, as you do not want to disturb the skin. [3] X Research source"
    },
    {
      "title": "Confirm the burn is not severe.",
      "content": "Confirm the burn is not severe. After the burn has been rinsed, examine it closely. If the burn is 3 inches (7.6 cm) in diameter or smaller and it appears a bit red or swollen, you can treat it at home. If the burn is large, blistering, and the skin appears leathery or waxen, the burn is severe and should be treated by a doctor. [4] X Research source If the burn is severe, you can wash and cover the burn temporarily until you get to a doctor."
    },
    {
      "title": "Wash your hands with antibacterial soap.",
      "content": "Wash your hands with antibacterial soap. Use cool, running water to lather your hands with the soap. Do not touch the burn until you have washed your hands well. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Clean the burn with mild soap and cool water.",
      "content": "Clean the burn with mild soap and cool water. Place the burn under cool running water and apply a small dab of mild soap to the area. Gently rinse and clean the burn to remove any dirt, debris, or bacteria. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid touching any blisters that form.",
      "content": "Avoid touching any blisters that form. If blisters start to form on the burn, do not prick or pinch them. Breaking open the blisters can cause infection. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Leave the blisters alone so your doctor can assess them later."
    },
    {
      "title": "Dress the burn in layers of clear cling wrap.",
      "content": "Dress the burn in layers of clear cling wrap. Get cling wrap typically used to cover food, as it will not stick to the skin and is protective. Remove the first 1–2 inches (2.5–5.1 cm) of cling wrap on the roll. Then, tear off strips of cling wrap. Layer the cling wrap over the burn to cover it and protect it. Use medical tape to keep it in place. [8] X Research source Do not wind the cling wrap around the burn, as this can reduce circulation to the area, especially if the burn starts to swell. Layer it onto the burn instead. If the burn is on a hand or foot, place a clear plastic bag over the area and loosely attach it with medical tape."
    },
    {
      "title": "Use a sterile cotton sheet if you do not have cling wrap.",
      "content": "Use a sterile cotton sheet if you do not have cling wrap. If cling wrap is not available, get a clean cotton sheet that is non adhesive. Place it over the burn and secure it with medical tape. Do not apply the medical tape too tightly around the sheet, just enough for it to stay in place. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Do not use gauze or bandages that can shed fibers, as they can stick to the burn and cause more damage to the area. [10] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Do not apply ointment or cream to the burn.",
      "content": "Do not apply ointment or cream to the burn. Avoid putting on antibacterial ointments or sterilizing creams, as this can cause more damage to the skin. They can also keep you from properly assessing and monitoring the burn. Keep the burn dry under the cling wrap or cotton sheet for the first 24 hours. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Check the burn after 24 hours.",
      "content": "Check the burn after 24 hours. Carefully remove the dressing and examine the burn. It should appear less swollen and red thanks to the protective dressing, along with your body's natural healing process. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If the burn has a foul smell, blisters have formed, or it appears very swollen and red, go see your doctor."
    },
    {
      "title": "Change the dressing every 48 hours.",
      "content": "Change the dressing every 48 hours. Remove the cling wrap or cotton sheet and rinse off the burn with running water. Then, put on new cling wrap or a cotton sheet. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Apply a small amount of antibacterial ointment or cream with clean fingers to the burn every time you change the dressing. If small blisters have formed, you can apply fluffy, non-adhesive dressing to them or go see your doctor for treatment. If the dressing becomes dirty, wet, or soaked through before the 48 hours are up, change it. The dressing should be clean and comfortable at all times."
    },
    {
      "title": "Take over-the-counter painkillers.",
      "content": "Take over-the-counter painkillers. Manage any pain from the burn by taking ibuprofen or acetaminophen. Follow the dosage instructions and only take the recommended amount. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Allow 10-14 days for the minor burn to heal.",
      "content": "Allow 10-14 days for the minor burn to heal. Most minor burns will start to scab over within 1-2 weeks. Try to expose the burn to air by leaving it uncovered as it scabs over. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If the burn does not heal within 1-2 weeks, or blisters form, go see your doctor. Be sure to keep the burn moist while it heals. A moist atmosphere over the wound creates a suitable environment for healing. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "See your doctor if the burn does not heal after 2-3 weeks.",
      "content": "See your doctor if the burn does not heal after 2-3 weeks. The burn may have become infected or be more severe than you initially thought. Keep the burn properly dressed or covered and head to your doctor’s office right away. [17] X Research source"
    },
    {
      "title": "Get medical attention if the burn has a foul smell and the skin turns black.",
      "content": "Get medical attention if the burn has a foul smell and the skin turns black. These are signs that burn has become infected or more severe. Go to your doctor’s office right away, as you are at risk of developing serious health issues due to the burn. [18] X Research source"
    },
    {
      "title": "Let your doctor assess the burn.",
      "content": "Let your doctor assess the burn. Your doctor will clean the burn and examine it to determine how severe it is. They may ask you how you got the burn and how long ago you got the burn. [19] X Research source As a precaution, they may give you an injection of tetanus to prevent bacteria from infecting the burn."
    },
    {
      "title": "Discuss treatment options for the burn.",
      "content": "Discuss treatment options for the burn. For second degree burns, they will apply a hydrocolloid dressing, which contains gel that helps the burn to heal. You will need to change the dressing every 3-5 days until the burn heals. They may also give you prescription pain medication. If you have a third or fourth degree burn, your doctor will recommend debriding, where the burned tissue is removed, or a skin graft to cover the damaged skin. Most health insurance plans will cover the cost of treating second, third, and fourth degree burns. Speak to your insurance representative for more information."
    }
  ]
}