{
  "url": "https://www.wikihow.com/Dress-a-Rectangle-Body-Shape",
  "title": "How to Dress a Rectangle Body Shape",
  "steps": [
    {
      "title": "Choose form-fitting tops and jackets that hit you at the waist.",
      "content": "Choose form-fitting tops and jackets that hit you at the waist. Coats and tops that go down past your waist will elongate your torso and accentuate the rectangle shape of your body. Purchase tops and jackets that contour to your body and hit at the waist to create curves. [1] X Research source [2] X Expert Source Kalee Hewlett Image Consultant Expert Interview. 23 April 2019. Denim jackets and bomber jackets are short jackets that generally hit at the waist."
    },
    {
      "title": "Wear shirts with scooped necklines to show off your collar bones.",
      "content": "Wear shirts with scooped necklines to show off your collar bones. Many people with rectangle body shapes have prominent collar bones. Choose shirts with wide or scooped necklines to accentuate your neck and collar bones. Off-the-shoulder tops will also emphasize your collar bones. [3] X Expert Source Kalee Hewlett Image Consultant Expert Interview. 23 April 2019."
    },
    {
      "title": "Tuck your shirts in to accentuate your waist.",
      "content": "Tuck your shirts in to accentuate your waist. People with rectangle body shapes often have trouble defining their waist. Tuck long shirts into your bottoms, or buy shirts that hit your waistline to create a waist for yourself. [4] X Research source Your natural waistline sits just above your hips, right along your belly button. Try pairing a solid dark-colored shirt with light wash jeans, a skinny belt, and a large handbag."
    },
    {
      "title": "Accentuate your bust with a good-fitting bra.",
      "content": "Accentuate your bust with a good-fitting bra. Rectangle body shapes often come with busts that can be lost in baggy shirts or blouses. Purchase a bra that fits you well to define your bust. Visit a retail store that has bra fittings included with your purchase. [5] X Research source Your bra should be fitted without being too tight or uncomfortable. Padded bras are great if you have a rectangular body since they give your bust more shape. [6] X Expert Source Kalee Hewlett Image Consultant Expert Interview. 23 April 2019."
    },
    {
      "title": "Define your body by wearing different colors on the top than the bottom.",
      "content": "Define your body by wearing different colors on the top than the bottom. Rectangle-shaped bodies have the tendency to become one straight line. Avoid this by wearing different colors on the top and bottom to draw attention to the individual parts of your body. [7] X Research source Avoid wearing monochromatic outfits, like red from head to toe. If you like wearing patterns, try large, bold ones that draw attention to whatever piece they are on."
    },
    {
      "title": "Don't wear shoulder pads or boxy-fitting tops and coats.",
      "content": "Don't wear shoulder pads or boxy-fitting tops and coats. As shoulder pads come back into style, watch out for tops that can make your shoulders look wider or make your torso seem boxy. Instead, choose tops that are more flowy and soften your shoulders and overall torso."
    },
    {
      "title": "Avoid shapeless dresses that don’t accentuate your waist.",
      "content": "Avoid shapeless dresses that don’t accentuate your waist. Since rectangle body shapes can be boxy, don’t wear dresses that have no defined shape to them. Instead, choose ones that come in slightly at the waist and flare out at the bottom to give your body shape. [8] X Research source You can add a belt to a shapeless dress to define your waist. [9] X Expert Source Kalee Hewlett Image Consultant Expert Interview. 23 April 2019."
    },
    {
      "title": "Show off your curves by wearing skinny jeans and pencil skirts.",
      "content": "Show off your curves by wearing skinny jeans and pencil skirts. Rectangle body shapes look good in form-fitting clothes. Add some curves to your body by wearing skinny jeans and pencil skirts that form to your legs. Pair form-fitting bottoms with a flowy top to create a balanced look. A pencil skirt with a loose top and some ankle boots creates definition in your body."
    },
    {
      "title": "Choose mid-rise jeans to accentuate your hips and define your waist.",
      "content": "Choose mid-rise jeans to accentuate your hips and define your waist. Mid-rise jeans will flatter both your torso and your legs as they hit your hips. Choose form-fitting jeans that are not baggy to give your body curves. [10] X Research source Dark wash jeans with a brown belt and matching shoes creates a seamless, classic look."
    },
    {
      "title": "Buy A-line skirts and flared jeans to add more shape to your body.",
      "content": "Buy A-line skirts and flared jeans to add more shape to your body. If you’d like to break away from your rectangle shape, choose skirts and jeans that have a flare at the bottom. Bell bottom jeans, boot cut jeans, and a-line skirts all add shape to your body. [11] X Research source Form-fitting tops go best with flared jeans and skirts."
    },
    {
      "title": "Elongate your body by wearing maxi skirts.",
      "content": "Elongate your body by wearing maxi skirts. Rectangle body shapes often come with the added bonus of long legs. Draw attention to this by wearing maxi skirts that go down to your ankles. You can choose a solid color maxi skirt for a classic look, or go with a pattern to make your outfit stand out. [12] X Research source Wear leggings under your maxi skirt in the cold weather for extra warmth. A solid colored maxi skirt with strappy sandals and a small handbag would be a great casual summer outfit."
    },
    {
      "title": "Add belts to pants and skirts to accentuate your waist.",
      "content": "Add belts to pants and skirts to accentuate your waist. Wear thin belts to define your waist with your bottoms. Make sure your pants and skirts are hitting your natural waistline. [13] X Research source"
    },
    {
      "title": "Choose low-rise Bermuda shorts in the summer.",
      "content": "Choose low-rise Bermuda shorts in the summer. Bermuda shorts have longer in-seams, so they go well with a straight body type. Avoid high-waisted shorts that might create bagginess in your hips or thighs. [15] X Research source Dress up your shorts with chunky wedges and a statement necklace for parties and get-togethers."
    }
  ]
}