{
  "url": "https://www.wikihow.com/Cope-With-the-Death-of-a-Cousin",
  "title": "How to Cope With the Death of a Cousin",
  "steps": [
    {
      "title": "Embrace your feelings.",
      "content": "Embrace your feelings. Grieve. Many people wrongly assume that ignoring their feelings or “toughing it out” will help the pain go away more quickly. This is a common myth associated with grief. Children and teens typically follow suit with the reaction of the adults in their lives. If the adults openly grieve and show sorrow, the children may feel more comfortable doing this, too. However, if the adults try to swallow their feelings or stay strong, the youth may think grieving is inappropriate or a sign of weakness. [1] X Research source"
    },
    {
      "title": "Don’t feel weird if you react differently than others.",
      "content": "Don’t feel weird if you react differently than others. Even if you have encountered a loss before, you may react differently after your cousin’s death depending on your relationship with this person and the unique circumstances surrounding the death. [2] X Expert Source William Gardner, PsyD Clinical Psychologist Expert Interview. 25 July 2019. As there is no normal death, there is also no ordinary response to death. Common reactions to death include: Shock. At first, it may be difficult to come to terms with the fact that your cousin is gone. You may feel completely numb and no pain at all; you may also argue with others and deny the truth. You may even be filled with anticipation and hope, waiting for your cousin to appear and clear up this misunderstanding. Anger. You may feel upset and resentful after your cousin’s death. You may have angry and bitter feelings toward yourself, medical professionals, God, and or even towards your cousin for leaving you. Guilt. You may feel guilty that you couldn’t prevent what happened or that you survived. Sadness. This is one of the most common reactions to death. Sadness may include feeling like there is a hole in your life, loneliness, or hopelessness. You may cry for hours on end."
    },
    {
      "title": "Know that grief takes time.",
      "content": "Know that grief takes time. After a death in the family, everyone must heal and grieve at their own pace. Some people may start to feel better in a few weeks while, for others, the grieving process may take months or more. Be patient with yourself and anticipate that you will feel better again in your own time."
    },
    {
      "title": "Talk to someone.",
      "content": "Talk to someone. During this mourning period surround yourself with family and close friends who will be able to support you during this process. Often it helps to talk about your emotions rather than bottling them up, as this can make healing and growing after a loss more difficult. Journaling may also help you to release the pent-up emotion or confusing feelings you are experiencing after your cousin’s death. You might write about the good times and happy memories the two of you shared."
    },
    {
      "title": "Commemorate your cousin.",
      "content": "Commemorate your cousin. This can be done through the observance of rituals such as funerals/cremations. Attending the funeral can give you the much needed closure, and helps you to realize you are not the only one mourning. If your family does not follow a religion or have memorial services, you can find other meaningful ways to commemorate your cousin."
    },
    {
      "title": "Remember your cousin's life.",
      "content": "Remember your cousin's life. Once you have come to terms with the loss of your cousin you can then move on to fondly remembering the time you spent together. This can help you to appreciate the time that you had together and honoring your cousin’s memory by focusing on the positives. You might even start a tradition of celebrating this person’s birthday each year or releasing balloons on this day to keep his/her memory alive."
    },
    {
      "title": "Live your own life to the fullest.",
      "content": "Live your own life to the fullest. Your cousin would not want you to mourn forever. You must live life yourself. Although this may seem a long way off to you at the moment, there will come a day when you will not think of your lost one as often or with as much pain. Then, you can live for your cousin, and live to the fullest. [3] X Research source Suggestions for living your life to the fullest might be to take advantage of the time you have on earth to set new goals. Create a \"bucket list\" of things you'd like to do before your own death, and start ticking items off."
    },
    {
      "title": "Get professional help if you need it.",
      "content": "Get professional help if you need it. Everyone reacts to death differently. If the death of your cousin provokes you to withdraw from friends or family, stop participating in school or performing at work, feel extremely depressed, or use drugs or alcohol to cope, you should see a mental health professional. A counselor or therapist can help you find positive ways of channeling your grief and coping with loss."
    }
  ]
}