{
  "url": "https://www.wikihow.com/Deal-More-Damage-in-Genshin-Impact",
  "title": "How to Deal More Damage in Genshin Impact",
  "steps": [
    {
      "title": "Select a main attacker (or two, if desired).",
      "content": "Select a main attacker (or two, if desired). Tartaglia, Keqing, Beidou, Xiao, and Ayaka are a few of many characters with combat talents designed to deal top-tier damage. It is quite easy to maximize these characters' damage output. While it is possible to build characters designed as supports as your main attacker (such as Barbara, Qiqi, Noelle, and Amber) and get excellent results, it will take a lot more guesswork, farming, and time to get the damage you want. Some characters can also be played as burst attackers. A character built as such has their build optimized for damage when their elemental burst is active, however, another character will do the majority of the damage when said characters burst is not active."
    },
    {
      "title": "Choose characters to support this main role.",
      "content": "Choose characters to support this main role. Some characters have passive roles that maximize damage, while others are able to heal your primary attacker or reduce incoming damage and resistance to interruption. Barbara, Qiqi, Bennett, and Diona are excellent healers. Sucrose is able to provide an Elemental Mastery boost after casting her elemental skill, and she (along with Kazuha and Venti) can group enemies together. Zhongli and Noelle can protect your character from incoming damage. Mona can temporarily stun smaller enemies and provide a big damage boost for enemies affected by her burst. Kaeya, Ayaka, Xingqiu, Barbara, and Mona can apply Cryo and Hydro respectively in a pinch (which makes them good support candidates for melt/vaporize or freeze teams). You should also keep elemental reactions in mind when selecting supports, since they can also greatly boost your damage. If Razor or Keqing is your main attacker, it is crucial to add a Cryo character (such as Kaeya) to your party. Likewise, if Eula is your main attacker, you should add an Electro character (such as Fischl) to your team comp. If you're running a character who is neither an Electro or Cryo user as a physical attacker (such as Jean or Xinyan), two of your supports should be Cryo and Electro respectively. This is because the Superconduct reaction greatly boosts physical DMG output."
    },
    {
      "title": "Take advantage of elemental resonance.",
      "content": "Take advantage of elemental resonance. Elemental resonance can give your team a boost without farming artifacts or the like. Having characters of any four elements will give all characters a 15% resistance to all elements and physical DMG. Having two Pyro characters in your team increases ATK by 25% and decreases the Cryo status effect time by 40%. Having two Hydro characters in your team increases healing by 30% and decreases Pyro time by 40%. Having two Cryo characters in your team increases CRIT rate against enemies affected by Cryo by 15% and decreases Electro time by 40%. Having two Electro characters in your team generates elemental particles everytime Electro reactions are triggered and decreases Hydro time by 40%. Having two Anemo characters on your team decreases stamina consumption by 15%, increases movement speed by 10%, and shortens skill CD by 5%. Having two Geo characters on your team increases shield strength by 15% and gives a 15% damage boost to players protected by a shield and decreases enemy resistance to geo by 20% within 15 seconds of the shield being created."
    },
    {
      "title": "Select a party's weapons.",
      "content": "Select a party's weapons. You must choose four weapons that have stats and effects that complement your DPS and supports. Each new character comes with a 1-star weapon, but it can be changed to one of higher rarity. 3-star and higher weapons also have passive effects. For your attacker, stats such as high base ATK, ATK%, CRIT rate, and CRIT DMG are highly effective. For your supports, it depends; Elemental Mastery is great on Sucrose and Kazuha, but not so much for Fischl. High defense is needed for Noelle and Albedo, but high HP is needed for Bennett and Diona."
    },
    {
      "title": "Attempt the Gacha",
      "content": "Attempt the Gacha for characters. If you do not have a good set of characters, the Wish system will allow you to attempt for more characters. You are guaranteed characters at set intervals."
    },
    {
      "title": "Level your characters up.",
      "content": "Level your characters up. Leveling up characters will allow you to maximize outgoing damage as well as increase their other substats like CRIT Rate (the probability a critical hit is scored). You can get Adventurer's EXP as well as character level-up materials by fighting enemies and bosses, provided you spend Resin."
    },
    {
      "title": "Level up their three talents.",
      "content": "Level up their three talents. For this, you will need to collect the appropriate talent level-up materials. You can get talent level-up materials from domains that offer them, provided that you spend Resin. You can also get some talent level-up materials by defeating each of the weekly bosses. \"Crowning\" a talent refers to getting a talent to its maximum (Lv. 10 or Lv. 13, depending on constellation). Once at its maximum, it cannot be leveled up further, except when the max talent level has been upped to 15."
    },
    {
      "title": "Level up weapons.",
      "content": "Level up weapons. Weapons can be enhanced with enhancement ore and ascended by completing domains that offer them, provided you spend Resin. Higher level weapons deal more damage than lower level weapons."
    },
    {
      "title": "Select good artifacts.",
      "content": "Select good artifacts. Artifact stats are randomized upon obtaining them, but to get maximum damage potential, you want to focus on artifacts that increase ATK, artifacts that give the appropriate elemental damage bonus, as well as artifacts that increase CRIT Rate and CRIT DMG. Hitting opponent weak spots is guaranteed to score a critical hit and deal critical damage. For this reason, CRIT rate might not be super important for archers. Artifacts can be obtained by completing domains that offer them as well as defeating bosses. Obtaining artifacts with good stats will take multiple tries. Artifacts can be used to level up other artifacts."
    }
  ]
}