{
  "url": "https://www.wikihow.com/Defrost-Pork-Chops",
  "title": "How to Defrost Pork Chops",
  "steps": [
    {
      "title": "Prepare a bowl with cold tap water.",
      "content": "Prepare a bowl with cold tap water. Temperature is key when it comes to safely defrosting frozen food; the water should always be in the cold range. Fill the bowl to a water level that will allow you to fully submerge the pork chops. Bacteria multiplies more rapidly starting at 40°F so using cold water only keeps the pork chops below this temperature."
    },
    {
      "title": "Wrap the pork chops in leak-proof packaging.",
      "content": "Wrap the pork chops in leak-proof packaging. You can wrap the pork chops individually or if the cuts are stacked, place them together as one in a resealable plastic bag. Such protective packaging will prevent any water from reaching the meat and potentially introducing bacteria from the air."
    },
    {
      "title": "Submerge the pork chops into the cold bath.",
      "content": "Submerge the pork chops into the cold bath. You will want to keep the water from reaching room temperature, so switch it out every 20 to 30 minutes with more cold water. [1] X Research source You could also place the bowl under a running tap, though this way will waste water."
    },
    {
      "title": "Remove pork chops from the cold bath as they thaw out.",
      "content": "Remove pork chops from the cold bath as they thaw out. Expect the individually wrapped chops to thaw in about 30 minutes. For stacked chops, the top and bottom pieces will defrost first. Once thawed, break away these pieces and transfer them to the refrigerator. Reseal the remaining chops and submerge them in the cold bath again. [2] X Research source Once thawed in cold water, pork chops must be cooked before you can freeze them again."
    },
    {
      "title": "Place unwrapped pork chops evenly on a microwave-safe plate.",
      "content": "Place unwrapped pork chops evenly on a microwave-safe plate. If you have one pork chop, make sure it's in the center. If you have three, divide the plate into three equal parts. To help a microwave thaw more evenly, remove any packaging. If the pork chops are different sizes, place the smaller or thinner ones in the center of the plate as the edges of a carousel are the hottest. [3] X Research source"
    },
    {
      "title": "Use the 30% (low) or 50% (medium) power setting for 2 minutes.",
      "content": "Use the 30% (low) or 50% (medium) power setting for 2 minutes. Microwaves vary when it comes to power and efficiency. The \"high\" or regular setting for any microwave though would be too powerful for thawing. The \"defrost\" setting on a microwave is equal to 30-50% power. [4] X Research source"
    },
    {
      "title": "Turn the pork chops; thaw for another 2 minutes.",
      "content": "Turn the pork chops; thaw for another 2 minutes. Because microwaves cook unevenly, you should flip and also rotate the pork chops to help with heat distribution. Use a fork or a pair of chopsticks to handle the chops and continue the process until the chops are thawed, which could take 5-10 minutes depending on how many pieces you have. If the chops are stacked, start with 30-second bursts and separate the pieces into a single layer as soon as you can. The edges of the pork chops may begin to cook during this process."
    },
    {
      "title": "Remove the thawed pork chops from the microwave and prepare to cook.",
      "content": "Remove the thawed pork chops from the microwave and prepare to cook. Because food thawed in the microwave should be cooked immediately, you'll want to defrost your pork chops 10 or so minutes before you're ready to cook, grill, or roast them. [5] X Research source As with cold-bath thawing, you can safely refreeze the pork chops after cooking."
    }
  ]
}