{
  "url": "https://www.wikihow.com/Dress-for-Your-Body-Type",
  "title": "Tips and Tricks for Dressing Every Body Shape",
  "steps": [
    {
      "title": "Measure your bust, waist, and hips to determine your body type.",
      "content": "Measure your bust, waist, and hips to determine your body type . The first step in understanding your body shape is to look at how your bust, waist, and hips fit together on your body. Your chest might be bigger than your waist and hips, or your hips might be your largest feature. Just get out a measuring tape and place it around the fullest portion of your bust, smallest area on your waist, and widest part of your hips to find out. [1] X Research source The body types below describe women's bodies. Although it is sometimes possible to determine body type prior to maturity, your body type is most evident after you’ve finished developing bust and hips. There is no such thing as a \"good\" or \"bad\" body type. All bodies are unique and beautiful in their own ways. Knowing your body type is just a general guideline to help you dress to look and feel your best. Even model's bodies fall into one of these categories."
    },
    {
      "title": "You’re likely apple shaped if your shoulders are wider than your hips.",
      "content": "You’re likely apple shaped if your shoulders are wider than your hips. This body shape is often called the inverted triangle and described as \"top-heavy.\" You’ll often have wide shoulders, a full bust, and a straight waist line. Women with this body shape typically have thinner legs, arms, and hips. All you need to do is look at yourself in the mirror to see if you are an apple body type. [2] X Research source About 14% of women have this body type, where their bust is more than three inches (7 cm) larger than their hips. [3] X Research source If you have an apple body shape, your weight might be concentrated around your midsection and chest, giving the appearance of a bigger bust and protruding stomach. If you naturally have a smaller bust, weight often gathers around your midriff."
    },
    {
      "title": "You’re probably pear shaped if your hips are wider than your bust.",
      "content": "You’re probably pear shaped if your hips are wider than your bust. This is the opposite of an apple body type, being more bottom-heavy than top-heavy. Women with a pear shaped body usually have a defined waist, full hips, and narrow, sloping shoulders. Your body is likely more curvy than straight, with a fuller behind and more muscular legs. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source About 20% of women are pear shaped, with hips significantly larger than their chest. [5] X Research source"
    },
    {
      "title": "If your hips, waist, and bust are equal, you may have a straight body.",
      "content": "If your hips, waist, and bust are equal, you may have a straight body. This body shape, often called athletic or rectangular, isn’t as curvy as pear or apple shapes. Instead, your silhouette is fairly straight looking without a noticeable curve around your waist area. [6] X Research source About 46% of women are this shape, where their waist is about the same width as their hips and bust. [7] X Research source If your waist is 1 to 8 inches (2-20 cm) smaller than your bust, you’re probably this type. Your rib cage defines most of your shape, as there is no waist definition to add curves. You can still have a rectangular body shape if you have a curvy bottom or a wide chest with a little bit of extra weight around the midriff."
    },
    {
      "title": "You’re likely an hourglass shape if your hips and bust are the same size.",
      "content": "You’re likely an hourglass shape if your hips and bust are the same size. This body type tends to be curvy on both the top and the bottom with a defined waist—which is why it’s called an hourglass shape. If you have this body type, your hips and bust are very proportional with almost equal measurements. [8] X Research source This is the least common body shape, with only 8% of women having it. [9] X Research source You can still have an hourglass body if you have slightly fleshy upper arms, wider looking shoulders, or a slightly fuller bottom."
    },
    {
      "title": "Bone structure shapes your body, but weight can alter your proportions.",
      "content": "Bone structure shapes your body, but weight can alter your proportions. Your bone structure largely determines your body shape, which can’t be changed no matter your weight. However, losing excess weight by eating healthy and exercising , or consuming more calories to gain weight, can help modify your body proportions. [10] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Unfortunately, it’s not possible to reduce fat in specific areas. Doing core exercises will strengthen your abdominal muscles, but it won’t make fat dissolve in just your stomach. While increasing your muscle tone can make a difference on your body, you also can’t “spot increase.” For example, chest exercises will firm and tone your bust line, but they won’t increase your breast tissue. Certain body types are predisposed to gain or lose weight in certain areas. For example, women with hourglass figures tend to gain and lose weight in the bust and hips, but not the waist. But, an apple shaped woman tends to gain weight in her hips and not in her bust. Adding cardio and resistance training to your workout can help tone your body. Knowing where you tend to retain and lose fat also helps you create a solid exercise plan. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Clothes are meant to flatter your body, so choose styles that make you feel good. There are clothes that don’t flatter even the most beautiful of models. In fact, when a designer selects models for shows, they pick ones that show off their clothes best. While there’s no “perfect” or “ideal” body, what’s considered beautiful tends to change with history. During the Victorian period, hourglass bodies were celebrated, with many women wearing corsets to get the look. In the 1920s, straight body types came into vogue. Many women wore girdles to flatten their chests! [12] X Research source The beauty of body shapes is also often cultural. An African-American woman may be praised for her hourglass figure, while a Japanese woman is celebrated for her straight body type."
    },
    {
      "title": "Genetics also play a large role in your body shape.",
      "content": "Genetics also play a large role in your body shape. Look at other women in your family to see a common trend. If the women in your family tend to have the same body type, chances are you do too. Remember, it is not just your mother's family that determines your shape, but your father's as well! [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Wear V-shaped necklines and flared pants if you’re apple shaped.",
      "content": "Wear V-shaped necklines and flared pants if you’re apple shaped. To dress an apple shaped body , highlight your torso and legs. Direct attention away from your midriff and go with shirts and dresses that accentuate your neck, chest, and lower half. Follow your bodyline and keep details on the top and lower third of your body. With this body type, it is great to wear shirts, blouses, or dresses with slight V-neck shapes. Choose flared pants over straight-leg or skinny jeans to balance out your wider shoulders and heavier upper body. Wearing bottoms just below your hip bone also helps draw attention away from your midriff. Dresses and belts that cinch in at your waist can highlight your midsection. If this is an area you want to show-off, go for it! Otherwise, avoid these styles to draw less attention to this area. If there are features on your body that you want to diminish, wear dark colors like black and navy blue. Wearing tops that drape over your curves can also draw attention away from areas you want to cover."
    },
    {
      "title": "Accentuate your upper body with structured shirts if you’re pear shaped.",
      "content": "Accentuate your upper body with structured shirts if you’re pear shaped. The trick to dressing a pear body type is wearing anything that adds to your shoulder and bust area. This adds focus to your upper body, evening out the proportions between your top and bottom half. Choose shirts and dresses that have ruffles, pleats, and ties at the top to draw focus to your top half. Boat neck, scoop neck, and sweetheart necklines also emphasize your shoulders. Shoulder pads will always do the trick, too! Wear straight-leg or slightly flared pants with heels. These styles help balance out your more bottom-heavy shape. Wearing a well-fitting bra can also enhance your bust and bring balance to your shape. Pants or tights that narrow your legs, like skinny and very flared jeans, can emphasize your bottom half even more. If you want to create more balance in your figure, avoid these styles. If you want to hide your bottom half, doing glute exercises and cardio might shrink butt fat . If you want to emphasize it, add weights to your workouts and increase your protein intake to grow your booty ."
    },
    {
      "title": "Wear voluminous tops and skinny jeans if you have a straight body type.",
      "content": "Wear voluminous tops and skinny jeans if you have a straight body type. To dress a rectangular body shape , choose clothes that highlight your arms and legs. By wearing bold, patterned tops and figure-hugging jeans, you also break up your silhouette and help create curves along your body. Go for shirts and dresses with ruffles and frills to add texture, volume, and femininity to your figure. A dress with a lot of embellishment at the bust can give weight to the area and make it look a bit bigger. Make the most of your great legs by wearing miniskirts with bright tights. Or, throw on skinny jeans. These figure-hugging styles help add more shape and curve to your body. To pinch in your waist and exaggerate your curves, wear belts with your dresses and skirts. Putting on shapewear can also create curves to help balance out your more angular features. Wearing straight or baggy clothing on both your bottom and top can give you a more shapeless look. If you want to create definition with this body type, stay away from these styles."
    },
    {
      "title": "Emphasize your waist with figure-hugging styles if you’re an hourglass.",
      "content": "Emphasize your waist with figure-hugging styles if you’re an hourglass. When dressing an hourglass figure , embrace your curvy top and bottom. Bring focus to your cinched in middle with shirts and dresses that fit snugly against your waist. Choose V-neck dresses and tops to accentuate your bust and flatter your hourglass shape. Plunge and sweetheart necklines are also great choices to emphasize your balanced figure. Draw attention to your waist with belts and accessories that pinch at the midsection. This also helps emphasize your curvy top and bottom. Get your clothes tailored so they better fit against your body’s outline and accentuate your curves. Wearing a comfortable, supportive bra also helps flatter your bust. Boxy and shapeless clothing tends to hide your hourglass shape. If you want to emphasize your curves, avoid these styles."
    }
  ]
}