{
  "url": "https://www.wikihow.com/Determine-Whether-a-Perfume-Is-Authentic",
  "title": "How to Determine Whether a Perfume Is Authentic",
  "steps": [
    {
      "title": "Know the seller.",
      "content": "Know the seller. Most counterfeit perfume purchases can be avoided by going to a reputable seller. There are a variety of outlets for perfume, and it’s important to understand the benefits and dangers of each. Department stores are always the safest way to buy perfume, as you have the advantage of being able to closely examine the bottle in its packaging and talking to the retail staff. This allows you to approach the staff if it’s possibly a fake, and you are able to return the perfume if it’s not authentic. Be very cautious at flea markets or swap meets where sellers can easily rip you off without recourse. Always carefully inspect the perfume before you purchase it, and if at all possible get the vendor’s contact information in case it turns out to be unsatisfactory. Feel free to ask the buyer very direct questions based on the information explained here. For example, \"Can you please tell me the batch number?\" and \"Can you put up a photo of the text on the back of the box?\", etc. When buying online through eBay or Amazon it’s important to check for product and online seller reviews. Make sure the seller is PayPal verified as this means they had to disclose their contact information. Check to see if they have a return policy, and demand one if they don’t. Pay attention to whether the listing is written with proper grammar and spelling."
    },
    {
      "title": "Pay attention to the price.",
      "content": "Pay attention to the price. Although this isn't always indicative of the quality of the perfume, if it's really cheap for the \"brand\" it claims to be, then it's likely to be too good to be true and it isn't the real perfume. There may be exceptions, such as a stock clearance where a store is closing down, but on the whole, the price provides a good indication of authenticity. [1] X Research source"
    },
    {
      "title": "Research the perfume beforehand.",
      "content": "Research the perfume beforehand. Check the manufacturer’s website to see if they have provided sufficient information on the packaging, bottle and the placement of the bar code. You might want to visit mall stalls to see how the bottle and cellophane wraps look on the authentic perfumes to get a good idea of what to expect."
    },
    {
      "title": "Check the wrapping.",
      "content": "Check the wrapping. Legitimate perfumes typically have cellophane tightly wrapped around the boxes. See if the cellophane is loosely or poorly wrapped, to the point where it is moving around the box. Improperly wrapped cellophane is a telltale sign of counterfeit perfumes. [2] X Research source"
    },
    {
      "title": "Inspect the box closely.",
      "content": "Inspect the box closely. You can often discern the authenticity of a perfume merely by inspecting the right parts of the box. Before opening your perfume, carefully examine the box for any signs of unprofessional packaging and design. Examine the text on the back of the packaging. Check for grammatical errors, misspellings, poorly laid out information, etc. Real packaging for a real perfume should ideally be grammatically correct. Spelling or grammar mistakes can indicate the mark of a counterfeit. Real packaging is made from high quality paperboard. Boxes made from thin, flimsy material are often counterfeit. Look for the barcode on the packaging. The barcode must be placed on the lowest back portion and not on the sides. Check to see if there is any excess glue or tape. Real perfume shouldn’t have any messy glue residue or extra tape inside or outside the container."
    },
    {
      "title": "Check the control, batch and serial numbers.",
      "content": "Check the control, batch and serial numbers. Authentic perfume will have all of these numbers on the packaging, which can then be used to independently verify its authenticity. Consult the manufacturer to see whether the numbers match with their production numbering."
    },
    {
      "title": "Feel the bottle.",
      "content": "Feel the bottle. Real perfumes have smooth bottle containers while imitation bottles are often a bit rough and are usually poorly made, sometimes constructed with plastic. Quality perfume bottles have tight fitting caps that are spill-proof. Be aware that designer perfume labels treat the bottle as part of the perfume experience, so the bottle should be of a superior quality"
    },
    {
      "title": "Understand the complexities of real perfume.",
      "content": "Understand the complexities of real perfume. The scent of authentic perfumes is complex and intricately constructed. While smell can be a difficulty measure of authenticity, those who know the perfume's scent can often sniff out a counterfeit. [3] X Research source"
    },
    {
      "title": "Know the layers.",
      "content": "Know the layers. Authentic perfumes will have three layers of scents that reveal themselves over time, consisting of top, middle and base notes. This complexity ensures that the scent is varied and multidimensional, allowing the scent to change from the initial application until complete skin absorption. Fake perfumes will have one dimensional fragrance layer and it will often have an \"off\" smell after only a short time of wearing it."
    },
    {
      "title": "Discern synthetic from natural ingredients.",
      "content": "Discern synthetic from natural ingredients. Authentic perfumes have had a lot of work put into creating the different notes in the perfume. They will use a mixture of scents derived from natural products and synthetic products. Cheap perfumes tend to be completely synthetic and therefore lack the complexity of layered perfumes created with natural ingredients."
    },
    {
      "title": "Pay attention to longevity.",
      "content": "Pay attention to longevity. An imitation perfume will initially smell similar but you will usually find that the authentic perfumes outlast their imitators in terms of longevity and effectiveness, which makes them better value in the long run. Opened bottles of authentic perfumes should retain their scents from six to 18 months. Citrus-based scents generally deteriorate around the six month mark, whereas floral-based scents should maintain until 18 months. Cheap opened bottles of perfume will lose their scents in a matter of weeks or a couple months. [4] X Research source"
    },
    {
      "title": "Know what kind of notes the perfume is supposed to have.",
      "content": "Know what kind of notes the perfume is supposed to have. When researching the perfume you’re about to purchase, it’s important to know whether it’s supposed to have a ‘single note,’ or a complex scent. Single note perfumes contain only the top notes, so a lack of middle and base notes doesn’t always indicate a counterfeit. When checking the authenticity of a single note perfume, pay attention to whether the scent smells strange and if the scent matches up with the description listed on the manufacturer’s website. [5] X Research source"
    },
    {
      "title": "Test it out.",
      "content": "Test it out. You should only test out the perfume once you’ve examined the packaging and analyzed the scent beforehand. Be cautious because counterfeit perfumes can often cause allergic reactions, or leave unwanted rashes on your skin. Once you’ve thoroughly checked every aspect of the perfume, apply it on your skin and pay attention to the way it smells throughout the day. If it’s an authentic complex perfume, then you should notice the tapering of the top notes throughout the day while the middle and base notes reveal themselves. A counterfeit perfume will often only keep its top scent for a few hours at the most."
    }
  ]
}