{
  "url": "https://www.wikihow.com/Find-the-Surface-Area-of-a-Rectangular-Prism",
  "title": "How to Easily Calculate the Surface Area of a Rectangular Prism",
  "steps": [
    {
      "title": "Draw the prism and label its length, width, and height, if necessary.",
      "content": "Draw the prism and label its length, width, and height, if necessary. If your prism isn’t already labeled, draw the 3D shape on a piece of paper. Write the symbols l , w , and h next to three different edges of the prism to represent length, width, and height, respectively. If you're not sure which sides to label, pick any corner. Label the three lines that meet at that corner. For example: A box has a base that measures 3 inches by 4 inches, and it stands 5 inches tall. The long side of the base is 4 inches, so l = 4, w = 3, and h = 5. If you don't know which way up the prism is, you can call any side the height. The length is usually the longest side, but even that's not really important. As long as you stick with the same names for the whole problem, you'll be fine. [1] X Research source"
    },
    {
      "title": "Calculate the area of each face by multiplying its two edges together.",
      "content": "Calculate the area of each face by multiplying its two edges together. A rectangular prism has six “faces:” a top and bottom face, a front and back face, and a left and right face. Each face of a rectangular prism is just a rectangle so, to find the area of each rectangle , “all you have to do is multiply length by width,” instructs expert academic tutor David Jia. In our example , l = 4, w = 3, and h = 5. These are the calculations you would do to find the correct area of each face: Top face l x w = lw = 4 x 3 = 12 Bottom face l x w = lw = 4 x 3 = 12 Front face: w x h = wh = 3 x 5 = 15 Back face: w x h = wh = 3 x 5 = 15 Left face: l x h = lh = 4 x 5 = 20 Right face: l x h = lh = 4 x 5 = 20 Alternatively, you can make a net of the rectangular prism to find its surface area. Making a net of a prism involves drawing out the shape as if it was two-dimensional—like the shape you would get if you broke down a box. Then, you can visually see each rectangle and calculate its area in the same way."
    },
    {
      "title": "Add the six areas together to get the value of the surface area.",
      "content": "Add the six areas together to get the value of the surface area. Add the area of each of the six faces together to get the surface area of the whole prism: lw + lw + wh + wh + lh + lh . You can use this formula for any rectangular prism to find the total surface area. [2] X Research source To finish our example , just add up all of the areas you calculated in the previous step (aka blue numbers): 12 + 12 + 15 + 15 + 20 + 20 = 94 ."
    },
    {
      "title": "Add the correct unit measurements to the surface area to get your final answer.",
      "content": "Add the correct unit measurements to the surface area to get your final answer. Surface area is measured in square units, e.g., mm 2 , cm 2 , in 2 , ft 2 , etc. Match your surface area measurements to the measurements used to describe the prism’s width, length, and height in the initial problem. [3] X Research source For example , if you measured your rectangular prism’s length, width, and height in inches (i.e., l = 4 in, w = 3 in, and h = 5 in), then your final answer must also use inches (i.e., 94 square inches (in 2 ) )."
    },
    {
      "title": "To calculate SA more quickly, use the formula SA = 2 (wl + hl + hw).",
      "content": "To calculate SA more quickly, use the formula SA = 2 ( wl + hl + hw ). If you don’t have to show your work solving for surface area, you can skip most of the above steps and simply plug the width, length, and height of the rectangular prism into this formula. [4] X Research source For example , a prism with l = 4, w = 3, and h = 5 would generate this formula: SA = 2 ( (3x4) + (5x4) + (5x3) ) = 2 ( 12 + 20 + 15 ) = 2 (47) = 94 . If you want to test out how this formula works, start with the formula we used before to calculate the surface area with the areas of each face: lw + lw + wh + wh + lh + lh . If you combine all of the like terms, you get 2lw + 2wh + 2lh . Then you can factor out the two to make it even shorter, ending up with 2(lw + wh + lh) ."
    },
    {
      "title": "Problem 1: SA of a Rectangular Prism",
      "content": "Problem 1: SA of a Rectangular Prism Calculate the surface area of a rectangular prism with the measurements l = 9cm, w = 3cm, and h = 4cm. Solution : Calculate the area of each face : Top & Bottom: 9 x 3 = 27 cm 2 Front & Back: 9 x 4 = 36 cm 2 Left & Right: 3 x 4 = 12 cm 2 Add the six areas together : 27 + 27 + 36 + 36 + 12 + 12 = 150 . Include the units: The initial measurements on the rectangular prism are in cm, meaning the final surface area of the rectangular prism is 150 cm 2 ."
    },
    {
      "title": "Problem 2: SA of a Rectangular Prism",
      "content": "Problem 2: SA of a Rectangular Prism Calculate the surface area of a rectangular prism with the measurements l = 2mm, w = 10mm, and h = 5mm. Solution : Calculate the area of each face : Top & Bottom: 2 x 10 = 20 mm 2 Front & Back: 2 x 5 = 10 mm 2 Left & Right: 5 x 10 = 50 mm 2 Add the six areas together : 20 + 20 + 10 + 10 + 50 + 50 = 160 . Include the units: The initial measurements on the rectangular prism are in mm, meaning the final surface area of the rectangular prism is 160 mm 2 ."
    },
    {
      "title": "Problem 3: SA of a Cube",
      "content": "Problem 3: SA of a Cube Calculate the surface area of a cubic rectangular prism with the measurements l = 8in, w = 8in, and h = 8in. Solution : Calculate the area of each face : Each face of a cube is the same, so the area of each face is 8 x 8 = 64 in 2 . Add the six areas together : 64 + 64 + 64 + 64 + 64 + 64 = 384 . Include the units: The initial measurements on the rectangular prism are in inches, meaning the final surface area of the rectangular prism is 384 in 2 ."
    },
    {
      "title": "Calculating volume instead of surface area",
      "content": "Calculating volume instead of surface area It can be easy to confuse volume and surface area when you’re first learning geometry, but these are two different concepts. The volume of a prism is the space inside the shape and is measured in cubic units (e.g., cm 3 ). The surface area of a prism is the total area of the faces on the outside of the shape and is measured in square units (e.g., cm 2 ). [5] X Research source"
    },
    {
      "title": "Assuming all lateral faces are equal",
      "content": "Assuming all lateral faces are equal Unless your rectangular prism is a cube, only the opposite sides of a shape will be equal. Essentially, the top and bottom of the prism may be equal to each other, but the other sides will have a different measurement. [6] X Research source It’s possible for all lateral faces to be equal, but only if the base is a square."
    },
    {
      "title": "Calculating the volume of a rectangular prism",
      "content": "Calculating the volume of a rectangular prism To calculate the volume of a rectangular prism , plug the shape’s width ( w ), length ( l ), and height ( h ) into the formula V = w h l {\\displaystyle V=whl} . [7] X Research source For example, a rectangular prism with the measurements l = 2cm, w = 3cm, and h = 4cm will have Volume = 3 x 4 x 2 = 24 cm 3 ."
    },
    {
      "title": "Calculating the space diagonal of a rectangular prism",
      "content": "Calculating the space diagonal of a rectangular prism To calculate the space diagonal of a rectangular prism, plug the shape’s width ( w ), length ( l ), and height ( h ) into the formula d = s q r t ( l 2 + w 2 + h 2 ) {\\displaystyle d=sqrt(l^{2}+w^{2}+h^{2})} . [8] X Research source For example, a rectangular prism with the measurements l = 2cm, w = 3cm, and h = 4cm will have space diagonal = sqrt(2 2 +3 2 +4 2 ) = 5.38516 ."
    }
  ]
}