{
  "url": "https://www.wikihow.com/Determine-if-You-Have-Pneumonia",
  "title": "How to Tell if You Have Pneumonia: Symptoms, Diagnosis, & Treatment",
  "steps": [
    {
      "title": "Identify symptoms of pneumonia.",
      "content": "Identify symptoms of pneumonia. If you think you might have pneumonia, it is important to treat it promptly before it gets worse. The symptoms may worsen gradually over several days or suddenly be very severe from the onset. Signs of pneumonia include: [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Fever Sweating and shivering Discomfort in your chest when you cough or breathe, particularly breathing when breathing deeply Fast, shallow breathing. This may occur only when you are physically active. Fatigue Nausea, vomiting, or diarrhea. These are common symptoms in infants. Coughing. You may even cough up yellow, green, rust-colored, or pink and bloody mucus. Headache Lack of hunger White fingernails Confusion. This commonly occurs in elderly people who have pneumonia. A lower body temperature than normal. This is most likely to occur in the elderly or people with weakened immune systems. Joint pain, rib pain, upper abdominal pain, or back pain Accelerated heartbeat"
    },
    {
      "title": "Go to the doctor if you think you have pneumonia.",
      "content": "Go to the doctor if you think you have pneumonia. All people who think they may have pneumonia should go immediately to the doctor. Pneumonia can be deadly if left untreated. You are particularly likely to be vulnerably to rapidly developing a severe infection if you belong to one of the following high risk groups: [4] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source [5] X Research source Children younger than two People over 65 People with other health conditions such as HIV/AIDS, heart, or lung problems People getting chemotherapy People taking medications which suppress their immune systems"
    },
    {
      "title": "Describe your symptoms to your doctor.",
      "content": "Describe your symptoms to your doctor. This will help him understand how long you have been sick and how severe your infection might be. Your doctor may want to know: [6] X Research source If you feel out of breath or breathe rapidly even when you are resting How long you have been coughing and whether it is getting worse If you are coughing up mucus that is yellow, green, or pink If your chest hurts when you inhale or exhale"
    },
    {
      "title": "Let the doctor listen to your lungs.",
      "content": "Let the doctor listen to your lungs. The doctor may ask you to lift up or remove your shirt so he or she can use a stethoscope to listen to your lungs. This doesn't hurt, and the only discomfort you may feel is because the stethoscope often feels cold when it touches the bare skin. The doctor will ask you to take deep breaths while he or she listens to the front and back of your chest. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If your lungs rattle or crackle, this is a sign of an infection. Your doctor may tap on your chest while listening. This can help detect lungs that are filled with fluid."
    },
    {
      "title": "Get additional tests if your doctor recommends it.",
      "content": "Get additional tests if your doctor recommends it. There are several things the doctor can do to identify if you have a lung infection and what exactly might be causing it. Possible tests include: [8] X Research source [9] X Research source A chest X-ray. This will help the doctor to see if you have an infection in your lungs and if so, which side it is in and how widespread it is. This test does not hurt. The doctor will use X-rays to create an image of your lungs. You may be asked to wear a lead apron to protect your reproductive organs. If you think you might be pregnant, tell your doctor, because X-rays may be dangerous for your baby. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Blood or sputum cultures. During this test, the doctor will either take blood or ask you to cough sputum into a vial. The blood or sputum will be tested in the lab to determine exactly what pathogen is causing the infection. If you are already in the hospital and/or your health is severely compromised, other tests may be done. This could include a test of your arterial blood gases to determine if your lungs are supplying your blood with enough oxygen, a CT scan if you are in the ER, or thoracentesis, during which a highly trained specialist uses a needle to go through the skin and muscles of your chest and remove a small amount of fluid for testing."
    },
    {
      "title": "Take antibiotics.",
      "content": "Take antibiotics. It takes a few days for testing to reveal effective antibiotic, in the interim a more broad spectrum antibiotic may be prescribed to initiate therapy. Similarly, there are times when pneumonia testing reveals no bugs — inadequate sputum or no septicemia (leading to a negative blood culture). Once treatment is determined, your symptoms should improve within a few days or weeks. You may still feel fatigued for over a month. [11] X Research source [12] X Research source Most people on antibiotics for pneumonia, especially mild pneumonia like walking pneumonia , can be treated at home. If your symptoms do not improve after two days or worsen, contact your doctor immediately. That is a sign that you need a different medication. You may continue coughing for two to three weeks after finishing the antibiotics. If this occurs, consult your doctor. Antibiotics will not work for viral pneumonia. Your immune system will have to fight it off."
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. If you have a high fever, sweating, and chills, you are probably losing a lot of water. It is important to stay hydrated so your body can fight off the infection. For severe cases of dehydration, you may need to be hospitalized. If you feel thirsty or have any of the following symptoms you need to drink more water: [13] X Research source Exhaustion, headaches, infrequent urination, passing dark or cloudy urine [14] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source"
    },
    {
      "title": "Control your fever.",
      "content": "Control your fever. If your doctor says it is ok, you may be able to reduce your fever with over-the-counter medications such as ibuprofen (Advil, Motrin IB and others) or acetaminophen (Tylenol and others). [15] X Research source Do not take ibuprofen if you are allergic to aspirin or other nonsteroidal anti-inflammatory drugs, have asthma, kidney problems, or stomach ulcers. [16] X Research source Do not give medications containing aspirin to children or teenagers. Consult with your doctor before starting these medications to make sure that they will not interact with any other over-the-counter medications, prescription medications, herbal remedies, or supplements you may be on. Do not take these medications if you are pregnant, nursing, or treating a child without first talking to your doctor."
    },
    {
      "title": "Ask your doctor about cough medicines.",
      "content": "Ask your doctor about cough medicines. Your doctor may suggest cough medicines if you are coughing so much that you can’t sleep. [17] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source However, coughing removes the mucus from your lungs and can be important in helping you heal and recover. For that reason, your doctor may advise against cough medications. [18] X Research source An alternative to cough medicine is a cup of warm water with lemon and honey in it. This can help soothe the pain caused by coughing. If you do take cough medicines, even over-the-counter medications, read the ingredients and make sure that it they are not the same as those in any other medications you are taking. If so talk to your doctor to make sure that you will not accidentally overdose."
    },
    {
      "title": "Get a bronchoscopy if you have aspiration pneumonia.",
      "content": "Get a bronchoscopy if you have aspiration pneumonia. This occurs when people choke on and accidentally inhale a small object into their lungs. If this occurs, you may need to have it removed. [19] X Research source The doctor will put a small scope through your nose or mouth and into your lungs to remove the object. You will probably receive medication to numb your nose, mouth, and airways. You may also be put under general anesthesia or take a medication that will help you relax. Removing the object will enable you to heal."
    },
    {
      "title": "Go to the hospital if home-care isn’t helping.",
      "content": "Go to the hospital if home-care isn’t helping. You may need to be admitted to the hospital for more intensive care if you are unable to fight off the infection at home and your symptoms are worsening. You may need to stay in the hospital until you stabilize if: [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You are over 65 You are suffering from confusion You are vomiting and cannot take your medications Your breathing is rapid and you need to be placed on a ventilator Your temperature is lower than normal Your pulse is abnormally fast (over 100) or abnormally low (under 50)"
    },
    {
      "title": "Bring a child to the hospital if they are not improving.",
      "content": "Bring a child to the hospital if they are not improving. Newborns and children under two are most likely to need hospitalization. Severe symptoms in children that indicate that they need emergency care even after starting treatment include: [21] X Research source Having trouble staying awake Breathing difficulties Insufficient oxygen in the blood Dehydration A low body temperature"
    }
  ]
}