{
  "url": "https://www.wikihow.com/Find-True-North-Without-a-Compass",
  "title": "7 Ways to Tell North Without a Compass (Northern & Southern Hemispheres)",
  "steps": [
    {
      "title": "Poke a straight stick that’s 2-3 feet (0.6-0.9 m) long into flat, clean ground.",
      "content": "Poke a straight stick that’s 2-3 feet (0.6-0.9 m) long into flat, clean ground. Insert the stick so it's standing straight up. If the ground is hard, poke a hole with a knife or other tool you may have. Notice how the stick casts a shadow—that’s the shadow you’ll use to find your direction. [1] X Research source Generally, the longer the stick, the longer the shadow will be. This helps make the shadow more visible. The thickness of the stick can vary, but something around 0.5 inches (1.3 cm) should work. If the sky is overcast, a thicker stick can cast a more visible shadow. Use rocks or dirt to keep the stick standing up straight. It’s important that the shadow is cast on flat ground, free of grass and other vegetation. If the ground is uneven or grassy, the shadow will be distorted. Clear some ground if you have to."
    },
    {
      "title": "Put a rock at the end of the shadow, then wait 15-20 or so minutes.",
      "content": "Put a rock at the end of the shadow, then wait 15-20 or so minutes. This rock marks the shadow’s original location; as the sun moves across the sky, the shadow will move too. Then, wait about 20 minutes. This allows enough time for the sun to move across the sky. If the shadow hasn’t visibly moved enough after 20 minutes, wait another 10. [2] X Research source Since the sun moves across the sky from east to west, it’s casting a shadow on the opposite side. This means that the shadow’s original location is your western-most point. If you have no way to keep time, then just keep an eye on the shadow. When you see that it’s moved, you can mark the new location and proceed."
    },
    {
      "title": "Mark the shadow’s new location with another rock.",
      "content": "Mark the shadow’s new location with another rock. As the sun moves, the shadow will move east. Put either a rock or a stick at the end of the shadow to mark its new location. [3] X Research source Remember, use something that won't blow away. If you lose both shadow locations, you'll have to start over. Optional: Draw a line on the ground or lay a stick between the two rocks to create a visible east-west line. [4] X Research source Optional: If you have a marker, mark a “W” on the first rock and an “E” on the new rock. This creates a compass so you don’t forget which side is which. [5] X Research source Remember that the directions on a compass are North, East, South, and West in a clockwise direction. If you forget the order of the directions on a compass, remember the phrase “Never Eat Soggy Watermelon,” a memory device to remember the directions."
    },
    {
      "title": "Stand with your left foot on the first rock (W) and right foot on the second (E) to find north.",
      "content": "Stand with your left foot on the first rock (W) and right foot on the second (E) to find north. When you're in this position, your front will be facing north and your back will be facing south. This completes the compass! The north you’re facing is true north, because you’ve used the sun rather than the Earth’s magnetic field. [6] X Research source If you want to keep track of these directions, mark an “N” where your front is facing and an “S” where your back is facing. This method works the same in the Northern and Southern Hemispheres. The only difference is that in the Northern Hemisphere, the sun will be at your back, and in the Southern Hemisphere, the sun will be in front of you. [7] X Research source"
    },
    {
      "title": "Point the hour hand of an analog watch toward the sun (Northern Hemisphere).",
      "content": "Point the hour hand of an analog watch toward the sun (Northern Hemisphere). In the Northern Hemisphere, the sun points toward the south. Remove your analog watch (if you have one) and line up your watch's hour hand with the sun as the first step to discovering the north-south line. [8] X Research source For this method, use an analog watch with an hour and minute hand. A digital watch won’t work."
    },
    {
      "title": "Find the halfway mark between the hour hand and 12 o’clock to find north.",
      "content": "Find the halfway mark between the hour hand and 12 o’clock to find north. Imagine a straight line running through this point. In the Northern Hemisphere, this halfway point marks the north-south line. True north is the side pointing away from the sun. [9] X Research source Some analog watches have an adjustable rim for direction finding. If your watch has this, you can adjust it so an arrow sits at this halfway point. Note that this method isn’t perfect because time zones throughout the world are not always consistent. You may not be able to locate the precise point of true north, but it will give you its general location."
    },
    {
      "title": "Or, point the 12 o’clock mark towards the sun if you’re in the Southern Hemisphere.",
      "content": "Or, point the 12 o’clock mark towards the sun if you’re in the Southern Hemisphere. Then find the halfway mark between the hour hand and the 12 o’clock point to locate the north-south line. [10] X Research source In the Southern Hemisphere, true north is the side pointing towards the sun."
    },
    {
      "title": "Use 1 o'clock instead of 12 during Daylight Saving Time.",
      "content": "Use 1 o'clock instead of 12 during Daylight Saving Time. Depending on the time of year and area of the world, Daylight Saving Time could be in effect. The method works the same, but since there is a 1-hour time difference, use 1 o'clock instead of 12. [11] X Research source Remember that Daylight Saving Time is between March and November in participating areas."
    },
    {
      "title": "Locate the outer edge of the Big Dipper constellation.",
      "content": "Locate the outer edge of the Big Dipper constellation. This constellation, also known as Ursa Major, is the key to finding the North Star (Polaris), the star that shows you where true north is in the Northern Hemisphere. This is a large constellation, and finding it on a clear night is usually straightforward. [12] X Research source The Big Dipper gets its name because it looks like a large spoon and is made up of some of the brightest stars in the sky. Look up and find the collection of stars that look like this. The outer edge, which looks like the end of a spoon, is made up of 2 stars. These 2 stars are known as “pointers,” because they literally point towards the North Star. [13] X Research source Contrary to popular belief, the North Star is not the brightest star in the sky. Use these constellations to locate it."
    },
    {
      "title": "Imagine a line going outward from the pointer stars to find the North Star.",
      "content": "Imagine a line going outward from the pointer stars to find the North Star. This line should extend through the top of the spoon. The North Star sits at the end of this line. [14] X Research source The North Star forms the end of the handle on the Little Dipper and is the brightest star in that constellation. When you think you’ve found the North Star, look around it and see if it’s part of a small, spoon-shaped constellation. If so, then you’ve located it!"
    },
    {
      "title": "Stand facing the North Star to face north.",
      "content": "Stand facing the North Star to face north. When you’re facing the North Star, you’re facing true north. You can now use this knowledge to figure out the other directions. [15] X Research source Remember that if you’re facing north, the other directions from right to left are east, south, and west."
    },
    {
      "title": "Estimate the distance if the sky is cloudy.",
      "content": "Estimate the distance if the sky is cloudy. Sometimes the weather doesn’t cooperate with this method. In this case, you can still find the Big Dipper and estimate the distance to the North Star. [16] X Research source The North Star is approximately 6 times the distance between the 2 pointer stars. Look at the space between those 2 stars and then multiply that distance by 6. This gives you the approximate location for the North Star."
    },
    {
      "title": "Locate the Southern Cross constellation.",
      "content": "Locate the Southern Cross constellation. If you’re in the Southern Hemisphere, the North Star won’t help you navigate. Instead, find true south using the Southern Cross constellation. This constellation is always visible in the Southern Hemisphere. [17] X Research source The constellation is made up of 4 bright stars that form a kite shape if you trace the border around them."
    },
    {
      "title": "Find the pointer stars next to the Southern Cross.",
      "content": "Find the pointer stars next to the Southern Cross. Outside the Southern Cross are 2 more bright stars known as the pointers. These are roughly parallel with the 2 stars in the Southern Cross that are closest together. [18] X Research source The pointer stars are some of the brightest in the Southern Hemisphere. If you're having trouble finding the Southern Cross, locating the pointer stars is a good starting point."
    },
    {
      "title": "Visualize a line down from the longest angle in the Southern Cross.",
      "content": "Visualize a line down from the longest angle in the Southern Cross. Two stars in the Southern Cross, Gacrux and Acrux, are the furthest apart in the constellation. Starting at the top, imagine a line extending between these 2 stars, and then continuing at the same angle outward. [19] X Research source Hold a string or a straight stick out in front of you to help envision a straight line. Depending on the time of year, this line may hit the ground since the constellation rotates along with Earth."
    },
    {
      "title": "Imagine a line from the midpoint between the pointers.",
      "content": "Imagine a line from the midpoint between the pointers. In the same way you drew an imaginary line from the Southern Cross, imagine a line connecting the pointers. From the midpoint of that line, extend a perpendicular line outward. This line should intersect with the line you drew from the Southern Cross. That intersection point is true south. [20] X Research source Use a natural landmark as a reference point. For instance, a tall tree in the distance could mark the intersection between the 2 lines, indicating where true south is."
    },
    {
      "title": "Turn around 180 degrees with your back facing south to find true north.",
      "content": "Turn around 180 degrees with your back facing south to find true north. When you locate true south, it’s simply a matter of turning around to find true north. Make sure you rotate exactly 180 degrees, or you'll be off-center and not facing true north."
    },
    {
      "title": "Grab 2 tall sticks and plant them in the ground to align with a star.",
      "content": "Grab 2 tall sticks and plant them in the ground to align with a star. First, put a long stick in the ground so that its tip is about at your eye level (if you can’t find one tall enough, sit down instead of standing up). Then, grab a second, taller stick and plant it in the ground behind the first one. Orient the sticks so that the tips of both are aligned with a bright star from your point of view. [21] X Research source"
    },
    {
      "title": "Wait for the star to move, then note its direction to find north.",
      "content": "Wait for the star to move, then note its direction to find north. As the Earth rotates, the stick tips will move out of alignment with the star you chose. The direction that the star appears to move will tell you which direction you’re facing: [22] X Research source If the star moves up , you’re facing east . If the star moves down , you’re facing west . If the star moves left , you’re facing north . If the star moves right , you’re facing south ."
    },
    {
      "title": "Moss often grows on the north side of trees and rocks in the Northern Hemisphere.",
      "content": "Moss often grows on the north side of trees and rocks in the Northern Hemisphere. Moss favors the damp and cold, and since the sun hangs in the south in the Northern Hemisphere, that means the north faces of objects like trees and rocks are more likely to grow moss than other sides. This isn’t a 100% effective rule—moss can grow anywhere, technically—but it can help reassure you that you’re heading in the right direction. [23] X Research source In the Southern Hemisphere, the opposite is true. Moss tends to grow on the south side of trees and rocks."
    },
    {
      "title": "Ants prefer to build colonies on the south side of tree bases (Northern Hemisphere).",
      "content": "Ants prefer to build colonies on the south side of tree bases (Northern Hemisphere). After you’ve examined some tree moss, check the base of the tree for an ant colony. Ants prefer warmth and sunlight, so they often orient their colonies to face the sun. Since the sun hangs in the southern sky, this means they often build on the south-facing sides of trees. [24] X Research source So, north would be on the opposite side of the tree than the ant colony (approximately). Think the opposite in the Southern Hemisphere. Ant colonies are more likely to be on the north side of trees down under. Again, this isn’t a 100% accurate rule, but it can be a supporting clue if you’re lost and trying to find your way."
    },
    {
      "title": "Tree branches and plants tend to face the south to receive more sun.",
      "content": "Tree branches and plants tend to face the south to receive more sun. Since sunlight is crucial for photosynthesis and plant survival, you may notice that some trees have a little bit more branch growth on the south side of the trunk. Likewise, if you come across a particularly lush patch of vegetation in the wilderness, there’s a good chance that you’re on a south-facing slope. [25] X Research source So, the direction facing away from heavy growth would be north (approximately). These definitely aren’t surefire solutions to finding north, so use this knowledge to complement a different direction-finding method, like using a watch or stick. In the Southern Hemisphere, tree branches and plants are more likely to face the north."
    },
    {
      "title": "Use a compass app or widget to find north if you have a smartphone.",
      "content": "Use a compass app or widget to find north if you have a smartphone. Most smartphones come with a pre-installed compass you may be able to use. This is a pretty handy tool as long as you have battery. As outdoor education expert Josh Goldbach says, “Some of those kinds of tools are incredible. But, I always have a lot of nerves about relying on something that's so battery-dependent.”"
    },
    {
      "title": "Download a topographical map to your phone or another device.",
      "content": "Download a topographical map to your phone or another device. Goldbach continues, “There are a lot of forms of technology that have really helped me, whether they're those Garmin-style GPS devices or even your phone. For most people, you’re able to load a map of the whole area and use your GPS location [to navigate]. Even if it's at night and you only have a topographic map, if you have enough visibility via moonlight to see really great landmarks, you can identify yourself in relation to objects. That's really useful.”"
    }
  ]
}