{
  "url": "https://www.wikihow.com/Get-Lugia-on-Soul-Silver-without-Cheating",
  "title": "How to Get Lugia on Soul Silver without Cheating",
  "steps": [
    {
      "title": "Get everything you need.",
      "content": "Get everything you need. You must have already received the Silver Bell from the Kimono Girls in Ecruteak City. You also need the Silver Wing, and a Pokémon that knows Surf, Whirlpool, Waterfall, Rock Smash (optional), and Strength. Whirlpool islands are unlit, so having Flash as well is worthwhile. Having Pokémon with status affecting moves (i.e. Sleep, Paralysis, Frozen) is also very helpful. Bring plenty of Ultra Balls. Make sure your Pokémon are level 40 or greater. Bring plenty of Repels to avoid fighting Pokémon along the way. A strong Electric or Ice-type Pokémon also helps."
    },
    {
      "title": "Go to Cianwood City.",
      "content": "Go to Cianwood City. It is located on the far eastern edge of Johto."
    },
    {
      "title": "Go to the Pokémon Center and head North.",
      "content": "Go to the Pokémon Center and head North. Follow the shoreline until you reach the corner where the rock wall starts."
    },
    {
      "title": "Use Surf to get to the Whirl Islands.",
      "content": "Use Surf to get to the Whirl Islands. Go North until you reach a wall or rocks and go East. Go past the first swimmer and continue East until you reach another wall or rocks. Go South until you see the Whirlpool. [1] X Research source"
    },
    {
      "title": "Use Whirlpool to get past the whirlpool.",
      "content": "Use Whirlpool to get past the whirlpool. The Islands are just past the whirlpool."
    },
    {
      "title": "Use Surf to get to the cave entrance.",
      "content": "Use Surf to get to the cave entrance. You'll need to go around behind the cave and use Surf to get to the cave entrance to the North. [2] X Research source"
    },
    {
      "title": "Navigate your way through the cave.",
      "content": "Navigate your way through the cave. Use the following steps to get through the cave: Use Flash to light your way. Go up and then to the right. Continue right until you hit a wall. Go up and go down the ladder. Go down and stay on the path until you see another ladder to the right. Go down the ladder and go down and take the path on the right. Continue down until you reach the old man."
    },
    {
      "title": "Use Silver Wing to get past the old man.",
      "content": "Use Silver Wing to get past the old man. He will let you through if you have the Silver Wing. [3] X Research source"
    },
    {
      "title": "Go down and into the cave with a massive waterfall within.",
      "content": "Go down and into the cave with a massive waterfall within. There's some rare candy inside the cave."
    },
    {
      "title": "Enter the cave at the bottom of the sloping path.",
      "content": "Enter the cave at the bottom of the sloping path. The Kimono girls will be inside. They will talk to you before performing a dance to summon Lugia. [4] X Research source The battle will take place inside. You may want to save your game now."
    },
    {
      "title": "Use Surf to get to Lugia.",
      "content": "Use Surf to get to Lugia. Lugia is out in the middle of the pond. [5] X Research source"
    },
    {
      "title": "Catch Lugia.",
      "content": "Catch Lugia. Use status effects like Freeze and Sleep to increase the chance of catching Lugia. Paralysis also helps, but doesn't have as much of a chance-boosting effect. Use as many Dusk Balls, and Ultra Balls as you can find. If those are unavailable, focus on using Dive Balls, and Net Balls. [6] X Research source Keep lots of potions and some PP Up, if you can. Have an Escape Rope ready so you can leave without going through the labyrinth again, and heal your party before going in."
    }
  ]
}