{
  "url": "https://www.wikihow.com/Do-Shadow-Work",
  "title": "How to Do Shadow Work",
  "steps": [
    {
      "title": "The Shadow is the part(s) of yourself you don’t want to claim.",
      "content": "The Shadow is the part(s) of yourself you don’t want to claim. In the 1900s, the psychologist Carl Jung divided the personality into 4 archetypes: Persona, Anima/Animus, Shadow, and Self. [1] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source With his theories, the Shadow soon became a popular representation of the lesser, repressed sides of the soul. The Shadow comprises the personality traits and thoughts you wish you didn’t have—your “darker” side. [2] X Research source Think of the Shadow as anything that is holding you back in life (trauma, perceptions, insecurities, etc.). [3] X Research source Not all traits and feelings of the Shadow are considered negative, as every individual will have a different view on what is negative. [4] X Research source For instance, celibacy may be pushed into the Shadow if an individual suppresses sexual desires because of an unwanted emotion or feeling. This doesn’t necessarily mean celibacy is “bad,” but it suggests that the individual has a negative reaction toward sexual intimacy."
    },
    {
      "title": "The Shadow may cause you to judge others.",
      "content": "The Shadow may cause you to judge others. Deep down, you may be afraid that people will judge you. To repress those feelings, you may repulsively judge others with the hope that they won’t have time to judge you. [5] X Research source For example, if someone was bullied as a child, they may bully others when they’re older as a reaction to repressing negative feelings of the past."
    },
    {
      "title": "The Shadow might have you pointing out other people’s flaws.",
      "content": "The Shadow might have you pointing out other people’s flaws. These are a reflection of your own insecurities, and projecting them onto others is an act of repression. If you find something undesirable in others, you can pretend it’s something you simply don’t like in another person rather than in yourself. [6] X Research source An example of this would be a father who lies punishing his child for lying."
    },
    {
      "title": "The Shadow could instigate you to play the victim.",
      "content": "The Shadow could instigate you to play the victim. To avoid being exposed to something unpleasant and showcasing a part of yourself you’d rather suppress, your Shadow may cause you to act as a victim. This unconscious strategy keeps responsibility and blame away from you and towards others. [7] X Research source For instance, if someone starts a verbal fight that later escalates into something physical, they may say they had no part in it even if they were the initial instigator."
    },
    {
      "title": "The goal of shadow work is to accept the darker parts of yourself.",
      "content": "The goal of shadow work is to accept the darker parts of yourself. Shadow work is the act of uncovering, acknowledging, and understanding the parts of yourself you instinctively want to suppress. Rather than acting on them unconsciously, you take notice of your Shadow and consciously integrate it into your whole self. This doesn’t happen overnight, and many psychologists suggest that shadow work is never completed or finished. It’s an ongoing practice meant to help you be more self-aware and conscious of your decisions and the world around you. [8] X Research source Shadow work gives you the chance to understand yourself better by facing the parts of yourself you’d rather ignore or disclaim."
    },
    {
      "title": "Take deep breaths before starting your practice.",
      "content": "Take deep breaths before starting your practice. Shadow work isn’t necessarily fun or easy. Because of this, it may be difficult to sit down with yourself and do the work. Grounding yourself with breathing exercises before starting a shadow work practice can help you feel present while calming the mind, body, and spirit. [9] X Research source"
    },
    {
      "title": "Take a step back and look at your life objectively.",
      "content": "Take a step back and look at your life objectively. Imagine you’re a bystander in your own life. In other words, how would a friend look at you? How would they react to your actions and behaviors in a given situation? Answering these questions will help you recognize behavioral patterns and feelings. [10] X Research source Observe patterns in the way you react to specific words, scenarios, or incidents. Ask yourself, “Why did that get to me? Why did I feel that way? What triggered that behavior or emotion?” Meditating and journaling at the end of the day can help you process your thoughts and reflect on your actions."
    },
    {
      "title": "Be honest with yourself.",
      "content": "Be honest with yourself. Healing takes time, but progress won’t be made unless you’re completely honest with yourself. We know pulling back the curtain on your most undesirable traits is more than difficult, but you can do it. Know that even if the truth is hard to swallow, you’re learning from it, and it’s leading you to become the best version of yourself. [11] X Research source"
    },
    {
      "title": "Question your reactions.",
      "content": "Question your reactions. Pause, reflect, and understand why you feel a certain way before you instinctively react. If you feel like you're about to judge someone or make a rude comment, refrain from it and question, “What triggered me to think this? Why was I about to say that?” Stopping and taking a moment to reflect will ultimately help you reframe your thoughts and actions to be more positive. [12] X Research source"
    },
    {
      "title": "Acknowledge, understand, and forgive your insecurities.",
      "content": "Acknowledge, understand, and forgive your insecurities. Now that you’ve discovered the aspects of your personality that have negatively impacted your life, it’s time to give yourself space to move on. Life is all about change; you’re expected to change with it, but don’t be afraid to question those changes. As you evolve, acknowledge the lesser parts of yourself you want to change, learn to understand why your thinking may have changed, and then forgive yourself. [13] X Research source This isn’t something that can happen overnight, and that’s okay. Go at your own pace, uncovering a new part of the Shadow when you’re ready. Healing takes time, so be gentle with yourself."
    },
    {
      "title": "Give art therapy a try.",
      "content": "Give art therapy a try. Doodling, painting, dancing, and singing are passionate and artistic techniques that can help you get in touch with your Shadow. Pick your favorite medium (whether that’s oil paints or modern dance), and let your heart and soul pour out of you. This can help bring out repressed feelings and images for analysis. [14] X Research source"
    },
    {
      "title": "Visit a therapist who’s trained in shadow work.",
      "content": "Visit a therapist who’s trained in shadow work. Some therapists and psychologists are specifically trained to guide patients through shadow work. They may use a meditative state to help you uncover the deepest parts of your Shadow, asking questions to access repressed memories and analyze projections. [15] X Research source If you’re seeking professional help with shadow work, make sure to ask the therapist if they’re trained in shadow work before scheduling an appointment."
    },
    {
      "title": "Write your Shadow a letter.",
      "content": "Write your Shadow a letter. With pen and paper, tell your Shadow how you feel about it. Has it caused you pain? Is there a part of you that’s jealous of its traits? Be open and honest—there’s no “right” or “wrong” way to do this. Then, once the letter is done, rip it up, toss it in a fire, or ball it up. This is a great way to release resentment while acknowledging your relationship with your Shadow."
    },
    {
      "title": "Say affirmations every day.",
      "content": "Say affirmations every day. Speak your power into existence by reframing your Shadow. Think about your undesirable traits and how they negatively impact you. Then, consider how you can reframe the narrative into something positive. For instance, if you easily judge your body, try focusing on the affirmation, “I love my body for all it does for me.” Consider giving these affirmations a try: [16] X Research source I am worthy of love, affection, and respect. I am powerful, strong, and courageous. I honor and love my Shadow and own all parts of myself. I speak the truth even when it’s hard to tell myself. I deserve love and respect even at my lowest."
    },
    {
      "title": "Analyze what you’re avoiding.",
      "content": "Analyze what you’re avoiding. In your journal or on a piece of paper, answer the question “What am I avoiding?” Write as much or as little as you want—just make sure not to restrict yourself. By answering this simple question, you’re acknowledging what you want to achieve from your shadow work. [17] X Research source For instance, if you answer, “I’m avoiding a relationship,” sit back and consider why you might be doing this. Perhaps you’re hurting from a recent breakup or are afraid of commitment."
    },
    {
      "title": "Empowerment",
      "content": "Empowerment There’s something freeing about being able to control your reactions in a given situation. Shadow work is all about understanding the “why” behind your undesirable behavior and insecurities. When you ask yourself, “Why?” you take control of your perceptions and find your truth, which can be extremely empowering and eye-opening. [18] X Research source"
    },
    {
      "title": "Self-Improvement",
      "content": "Self-Improvement Working on your inner self will help you become a better person. Shadow work functions on self-awareness and acknowledgment. When you learn to understand and forgive the negative sides of yourself, a huge weight is lifted off your chest, and you can start to be the best version of yourself with no strings attached. [19] X Research source"
    },
    {
      "title": "Healing",
      "content": "Healing Shadow work is the part of the healing process that helps you confront your most repressed and resisted truths. [20] X Research source Practicing shadow work gives you the power to know where and why you are unhealed or traumatized. By acknowledging and accepting your past and truths, you slowly begin to heal your relationship with yourself, accepting that you deserve to be healed. [21] X Research source"
    }
  ]
}