{
  "url": "https://www.wikihow.com/Get-Smoke-Odor-Out-of-Leather",
  "title": "How to Get Smoke Odor Out of Leather",
  "steps": [
    {
      "title": "Put a container of cat litter next to the leather to absorb heavy odors.",
      "content": "Put a container of cat litter next to the leather to absorb heavy odors. Cat litter is known for absorbing all kinds of smells and is great for getting rid of smoke odors. Fill a bag or open container with cat litter and place it near the leather item. After a couple days, the smoke odor should be gone! [1] X Research source If the smoke smell is still lingering after several days, dump out the used cat litter and replace it with fresh cat litter. Purchase cat litter from your local pet supply store or big box store."
    },
    {
      "title": "Sprinkle baking soda on the leather to absorb the smoke odor for 20 minutes.",
      "content": "Sprinkle baking soda on the leather to absorb the smoke odor for 20 minutes. Spread the baking soda across large leather surfaces like leather couches, leaving the baking soda for 20 or so minutes to let the smoke smell be absorbed. If you have a smaller item that smells or you’d rather not apply the baking soda directly to the leather, fill a plastic or paper bag with baking soda and place the bag on or in the leather item. [2] X Research source Leave the bag filled with baking soda on or in the leather item for at least 1-2 days so it has time to properly absorb the smell. For example, place a bag of baking soda in a purse or wrapped in a leather jacket."
    },
    {
      "title": "Set a bowl of charcoal by the leather for 2-3 days to soak up the smell.",
      "content": "Set a bowl of charcoal by the leather for 2-3 days to soak up the smell. Charcoal isn’t only great for heating up a grill, but it can absorb smells too. Fill a large bowl with charcoal and set it next to the leather item for several days. Over time, the charcoal will absorb the smoke odor so the leather smells fresh again. [3] X Research source If you’re trying to get rid of a smoke odor in your car with leather interior, place the bowl or bag of charcoal in the car and leave it in there for at least 2 days."
    },
    {
      "title": "Wrap the leather in newspaper for 2-3 days to let the paper absorb the smell.",
      "content": "Wrap the leather in newspaper for 2-3 days to let the paper absorb the smell. Newspaper is very porous, making it a great material for soaking up smells. Wrap smaller leather items in the newspaper and let them sit for several days so the newspaper has time to soak up the odor. If you have larger items, try placing several sheets of newspaper overtop the leather, covering up as much of it with newspaper as possible. [4] X Research source Recycle the newspaper after several days or once the odor has been absorbed."
    },
    {
      "title": "Spray white vinegar on the leather to clean and deodorize it.",
      "content": "Spray white vinegar on the leather to clean and deodorize it. Pour vinegar into a spray bottle and spray it on your leather item in a thin layer to get rid of the smoke smell. Wait a few minutes for the vinegar to absorb into the material before wiping it off with a clean, dry rag using circular motions. [5] X Research source Vinegar is a natural cleaner and shouldn’t damage your leather, but if you’d rather not apply it directly to the leather, fill a bowl with vinegar and place the bowl next to the leather instead."
    },
    {
      "title": "Place the leather in the sunlight for 5-6 hours for an all-natural deodorizer.",
      "content": "Place the leather in the sunlight for 5-6 hours for an all-natural deodorizer. Sunlight and fresh air are great cures for smelly odors. Set your leather item out in indirect sunlight for several hours, letting the air and light remove the smoke smell. Avoid leaving your leather out for more than 5 or 6 hours, as the sunlight can dry out the leather if it’s exposed for too long. [6] X Research source [7] X Expert Source Mallika Sharma Certified Leather Care Technician Expert Interview. 14 May 2021. Try leaving your leather item outside for several hours each day, bringing it inside before it starts to dry out too much or receive a lot of direct sunlight."
    },
    {
      "title": "Put a paper bag full of coffee grounds on the leather for a day to neutralize odors.",
      "content": "Put a paper bag full of coffee grounds on the leather for a day to neutralize odors. Coffee grounds have a strong scent that is often used to mask the smell of bad odors like smoke. Pour coffee grounds into a paper or plastic bag and place them on or near the leather item. Leave them there for at least 1 day so they can help get rid of the smoke odor. [8] X Research source The longer you leave out the coffee grounds, the better."
    },
    {
      "title": "Rub dryer sheets onto the leather item to give it a fresh scent.",
      "content": "Rub dryer sheets onto the leather item to give it a fresh scent. Just like dryer sheets leave your clothes smelling fresh, they can help to combat the smell of smoke too. Gently rub a new dryer sheet along the surface of your leather, moving your hand in circular motions to ensure you cover it all evenly. [9] X Research source For larger leather items like couches or big chairs, use a couple dryer sheets so that the fresh scent is distributed evenly."
    },
    {
      "title": "Place fruit peels on the leather for a day to give it a citrus scent.",
      "content": "Place fruit peels on the leather for a day to give it a citrus scent. Peel a couple oranges and lemons and place the peels in a bowl or on paper towels. Set the bowl or paper towels on the leather and leave them there for at least 1 day so they can soak up the smoke odor. [10] X Research source Make sure the peels don't have any leftover juice from the fruit on them to avoid damaging the leather. If you place your peels in a bowl, this won't be an issue. For example, place lemon and orange peels in a napkin and put them in your leather purse to get rid of the smell."
    },
    {
      "title": "Rub a leather conditioner or cleaner onto the leather",
      "content": "Rub a leather conditioner or cleaner onto the leather to mask the odor. While a leather cleaner or conditioner won’t get rid of the smoky odor, it can make the leather smell better. Purchase a leather cleaner or conditioner from a local home improvement or big box store and squirt a dollop out onto a clean cloth. Gently rub the cleaner or conditioner into the leather using circular motions, covering the entire leather item. [11] X Research source This will clean the surface of the leather and add a protective coating while giving it a temporary fresh scent. Avoid using saddle soap, as this has to be washed out using water."
    },
    {
      "title": "Take the leather item to the dry cleaners if possible as a last resort.",
      "content": "Take the leather item to the dry cleaners if possible as a last resort. If you’re having trouble getting the smoky scent out of your leather item, bring it to your local dry cleaners to see if they can help. This works best on items like leather jackets, pants, purses, or other small accessories. Tell them that your item has a strong smoke odor and ask if they have suggestions for how to get it out or if they’re able to do it themselves."
    }
  ]
}