{
  "url": "https://www.wikihow.com/Fix-a-Burnt-Cake",
  "title": "How to Fix a Burnt Cake",
  "steps": [
    {
      "title": "Remove the burnt edges from the cake.",
      "content": "Remove the burnt edges from the cake. Trim off the burnt edges from the cake using a bread knife by using a fast but gentle cutting action. Ensure you also slice off the burnt bottom and sides to remove the burnt areas. Shaving off the burnt edges will prevent the cake from having an unpleasant taste and will help make it more enjoyable to eat. This method can also be useful if your cake has gotten minor brown burns while baking. While the cake may end up looking smaller and the serving amount will decrease, the burnt edges will be gone and the cake can be happily devoured. If the top is burnt, level it to remove the burnt part."
    },
    {
      "title": "Add butter if the cake is dry.",
      "content": "Add butter if the cake is dry. Sometimes when over-baking a cake it won't burn or blacken, but instead, taste dry and crumbly. You can fix that by spreading the cake with butter with a large butter knife while the cake is still warm. The butter will melt into the cake and allow it to moisten and not taste as dry. [1] X Research source"
    },
    {
      "title": "Consider making a trifle out of the cake.",
      "content": "Consider making a trifle out of the cake. If you shaved off the burnt edges from the cake and notice the cake is too small, fix the cake and save it by making it into a trifle instead. Cut off the burnt edges of the cake if you haven't already and crumble it up into a bowl. In a tall glass, make a variety of layers such as one layer of chocolate pudding, another layer of the cake, one layer for walnuts, etc. Others won't notice the burnt cake and you'll end up with a new tasty dessert to enjoy. [2] X Research source You can also add freshly chopped fruit into your trifle for a sweeter flavor that can hide the taste of the burnt, dry cake."
    },
    {
      "title": "Add toppings, icing, and frosting.",
      "content": "Add toppings, icing, and frosting. Cover up the burnt flavor of your cake by adding a variety of cake toppings such as icing, frosting, ganache, vanilla glaze, fresh fruit, chocolate candies, gummies, sprinkles, and nuts to hide the burnt, dry flavor. After you snip off the burnt edges from a cake, cover the cake with icing and frosting. This fixes the cake from looking and tasting burnt. [3] X Research source"
    },
    {
      "title": "Enjoy the cake with a beverage.",
      "content": "Enjoy the cake with a beverage. While you and others enjoy the cake; serve the cake with a glass of milk, a mug of hot chocolate , some tea , or coffee. This prevents the burnt flavor the cake to show and will usually hide the dry, crumbly flavor of a burnt cake. [4] X Research source"
    },
    {
      "title": "Freeze the cake and re-frost if.",
      "content": "Freeze the cake and re-frost if. One way to fix a burnt cake is to freeze it in a freezer. Snip off the burn edges from the cake, frost it, and then freeze it until the frosting is solid. Allow it to thaw and then re-frost it again with more frosting. The dry, burnt taste will be gone and you won't even notice it. It will usually take about 5 hours till overnight until a frosted cake can freeze solid. [5] X Research source"
    },
    {
      "title": "Make cake pops.",
      "content": "Make cake pops. If your cake ended up pretty much dry and crumbly, cake pops are a good idea to save and fix up your cake. Crumble the cake up into a large bowl and then add a cup or two of frosting. Combine them together and roll the mixture into medium-sized bowls. Allow the balls to chill until firm and then stick cake pop sicks into each pop. Dip and roll into any desired toppings and enjoy. [6] X Research source"
    },
    {
      "title": "Cut the cake into mini-sized cubes.",
      "content": "Cut the cake into mini-sized cubes. If the cake has many burns and the edges are brown, snip them off and only cut the inside of the cake into cube-sized pieces. Garnish it with whipped cream, fresh fruit, and sprinkles to fix up the cake and make it more enjoyable to eat. [7] X Research source"
    },
    {
      "title": "Set a timer.",
      "content": "Set a timer. This is a common and known method to keep any foods from over-cooking or baking when making them. If you know you'll be away or get distracted, set a timer for the amount prescribed by the recipe. Make sure the timer is loud enough to hear if you're far away from the kitchen."
    },
    {
      "title": "Check the oven temperature before baking.",
      "content": "Check the oven temperature before baking. It's possible you could accidentally set the temperature too high without meaning too. Double-check the oven temperature before placing the cake in the oven to bake to ensure it doesn't burn. [8] X Research source"
    },
    {
      "title": "Use aluminum foil to avoid the cake from burning.",
      "content": "Use aluminum foil to avoid the cake from burning. When the cake starts to brown while it bakes, but the inside of the cake is still raw, cover the edges and top with foil. The aluminum foil will protect the cake from burning and blackening. [9] X Research source"
    },
    {
      "title": "Make sure your oven settings are working properly.",
      "content": "Make sure your oven settings are working properly. If you've set the correct temperature and time for the cake to bake and it stills ends up burnt, double-check your oven to make sure there is nothing wrong and that the settings are correct. It's possible your oven's settings could have been switched which causes it to not produce the correct heat level. [10] X Research source"
    },
    {
      "title": "Check the cake every now and then.",
      "content": "Check the cake every now and then. While the cake bakes, check it every 10-15 minutes to ensure it isn't burning and that it is baking correctly. It's best not keep opening the oven door, however, since the heat leaves every time you open it. Instead, use the oven light that's placed in your oven so you can watch the cake, but also avoid it from under-baking."
    }
  ]
}