{
  "url": "https://www.wikihow.com/Germinate-Cannabis-Seeds",
  "title": "How to Germinate Cannabis Seeds",
  "steps": [
    {
      "title": "Know the law.",
      "content": "Know the law. Recreational and medicinal marijuana use is legal in 4 states (Alaska, Colorado, Oregon, and Washington) and Washington D.C. whereas marijuana can only be possessed and used for medically prescribed purposes in 19 states. It is important you familiarize yourself with state laws and regulations before attempting home cultivation. In a search engine, type the \"state name\" plus \"marijuana laws\"."
    },
    {
      "title": "Comply with state regulations and restrictions.",
      "content": "Comply with state regulations and restrictions. Cannabis cannot be grown at home, and can only be obtained with a prescription from a licensed physician from licensed dispensaries in Connecticut, Delaware, Illinois, Maryland, Minnesota, New Hampshire, New York, New Jersey, and Washington D.C. In Nevada and Arizona, you can only cultivate at home if you live 25 miles or more from a dispensary or receive a hardship waiver. Most states do not allow marijuana use for any reason by individuals under 21 years of age. How many plants you can grow (ranges from 0 to 24) or how much marijuana you can possess at a time (ranges from 1 oz to 24 oz; 10 to 60 day supply) varies by state. You can be fined or arrested if you do not comply. Most states require you to sign-up and pay a registration fee that can range from $15 to $200."
    },
    {
      "title": "Comply with federal laws.",
      "content": "Comply with federal laws. Federal laws supersede state laws. The Department of Justice continues marijuana enforcement under the Controlled Substances Act. [1] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source It is illegal to grow or possess marijuana on public or federal lands, or distribute it to a minor."
    },
    {
      "title": "Comply with international laws.",
      "content": "Comply with international laws. Countries outside the U.S. have their own laws and regulations when it comes to growing and possessing cannabis. Research laws in your country to avoid fines or even imprisonment. [2] X Research source Countries where it is legal to grow cannabis include: Colombia (20 plants), Czechia (5 plants), Spain, and Switzerland (4 plants). In all these countries, cannabis can only be grown for personal use (medical or recreational) and cannot be sold or transported out of the country. [3] X Research source"
    },
    {
      "title": "Select the seeds you want to germinate.",
      "content": "Select the seeds you want to germinate. Cannabis contains over 70 cannabinoids that produce a psychoactive effect in humans, the strongest being delta-9-tetrahydrocannabinal (THC). THC is produced as a sticky resin on the surface of plants. Levels of THC vary based on: part of the plant (buds contain the most followed by the leaves, stems, and seeds), growing conditions, and subspecies. [4] X Research source There are three subspecies of cannabis differentiated on the basis of cannabinoid content: sativa, indica, and ruderalis. Untreated or organically grown seeds will produce 50% male (staminate) and 50% female (pistillate) plants. Sativa and indica are the most common types of cannabis grown for recreational or medicinal use. Most plants grown today are sativa-indica hybrids. Indica hybrids are known for their pain-relieving and calming properties, and are good for growing indoors as they only grow 2-3 feet tall and have a diameter of 12-18 inches."
    },
    {
      "title": "Consider different growing methods.",
      "content": "Consider different growing methods. Growing cannabis indoors is notoriously energy inefficient and can increase you electricity bills more than 10%. [5] X Research source Your seeds will have to be germinated indoors. However, if you plan on replanting outside, you should start your seeds by late-March to early-April at the latest. The growing season for cannabis in the northern hemisphere runs from early May to October. You want to give plants a headstart and gradually acclimate them to outdoor climates by growing indoors under fluorescent grow lights for 2 to 3 weeks after germination. Expect germination to take from 2 days up to 2 weeks. The benefit of growing plants indoors is that you can control temperature, light, and humidity, and they can be grown year-round. Additionally, most states require cannabis to be grown inside in a secure location. [6] X Research source"
    },
    {
      "title": "Obtain necessary materials.",
      "content": "Obtain necessary materials. This method uses basic items found around your house, though you may have to purchase distilled water and pH test strips. Feminized cannabis seeds. 1 to 2 gallons of distilled (non-chlorinated) water. 2 clean dinner plates. 1 roll of paper towels. A warm, dark place to store seeds. Tweezers (do not handle seeds with your hands). pH test kit. Good potting soil. Seed tray with 1x1 inch cells or plastic cups. Compact fluorescent Lights. Grow light timer."
    },
    {
      "title": "Soak seeds in distilled water for 24 hours.",
      "content": "Soak seeds in distilled water for 24 hours. To distill water at home, fill the container you will use to soak the seeds with tap water and let it sit in the open for 24 hrs to evaporate chlorine. You can also purchase distilled water from a grocery store or plant nursery. Test the pH of the water with pH test strips. It should measure between 5.8 and 6.5. You want pH of water and soil to be as close to ideal as possible to ensure proper germination. The seeds will float at first, but eventually sink. You can give the seeds a little tap with the tweezers to help them sink. If they still float after 24 hours, they might not be viable (able to germinate)."
    },
    {
      "title": "Lay two sheets of paper towels over a dinner plate.",
      "content": "Lay two sheets of paper towels over a dinner plate. Use distilled water at room temperature to moisten the paper towels. Drain-off excess water."
    },
    {
      "title": "Place cannabis seeds in center of moist paper towel.",
      "content": "Place cannabis seeds in center of moist paper towel. Use tweezers to remove seeds from water and place on moistened paper towel. Cover these with two additional moist paper towel sheets. Then, place a second dinner plate over the paper towels and seeds. This will help keep the seeds warm. Keep the seeds covered and store in a warm, dark place. Ideally the temperature should be between 70-90 degrees Fahrenheit for the seeds to germinate. Check seeds and paper towels regularly. Re-moisten the paper towels as needed, making sure to drain any excess water."
    },
    {
      "title": "Plant your germinated seed.",
      "content": "Plant your germinated seed. After about 5-6 days (though it may take longer depending on the variety) you should observe a small white taproot extending from one end of the seed. Fill a small plastic cup or seed tray with good potting soil and water until saturated. Use your finger to create a 1/4 in (0.75 cm) hole and drop your seeds in with the taproot facing down. Cover with loose soil - do not pat or tamp down soil over the seed. Use a spray bottle to ensure the soil remains moist, but not inundated. A sprout should appear within 4-6 days, and seedlings should have leaves after 10-14 days. Set tray or plastic cups with seedlings under a fluorescent (T5, T8, or T12) grow lamp positioned no closer than 2-4 inches above the surface of the soil. Set grow light to a 24 hour light cycle. Germinated seeds and seedlings require 24 hours. This can be reduced to 16 hours of light once the seedling produces leaves."
    },
    {
      "title": "Obtain necessary materials.",
      "content": "Obtain necessary materials. Rockwool cubes are better at retaining water than paper towels, you can maintain a constant pH, and they are easier to transplant after sprouting. Feminized cannabis seeds. Set of 1 inch Rockwool cubes. Small pointed object such as a toothpick or clean nail. Metal or plastic tweezers. Waterproof tray to hold water and cubes. Tweezers (do not handle seeds with your hands). pH test kit. pH balancing chemicals (lime juice, pH Up/Down, Phosphoric Acid) 2-liter bottle with plastic lid. A warm, dark place to store seeds. Good potting soil. Seed tray with 1x1 inch cells or plastic cups. Compact fluorescent Lights. Grow light timer."
    },
    {
      "title": "Stabilize and hydrate Rockwool cubes.",
      "content": "Stabilize and hydrate Rockwool cubes. Rockwool has an alkaline pH of 7.8, which is too high for cannabis seeds that prefer a more acidic environment (pH 5.5 to 6.5). Fill a bowl with tap water or distilled water. Use test strips to measure pH of water. You may have to acidify (decrease the pH value) of the water by adding lime juice or pH down. Add this to water in very small increments (a few drops at a time) and remeasure pH with test strips. Repeat until you reach ideal levels. If the pH of the water goes below 5, you will have to discard it and start over, or increase it with pH Up. Soak Rockwool cubes in water for 1 hour. Remove Rockwool cubes from water. Do not squeeze or drain water - Rockwool is designed to maintain ideal air to water ratio for several days. Do not discard water. Pour into a 2-liter plastic bottle or spray bottle and reuse for watering."
    },
    {
      "title": "Prepare Rockwool cubes for seeds.",
      "content": "Prepare Rockwool cubes for seeds. Place soaked cubes in a waterproof tray. Some cubes come with preformed holes, but if not use a pointy object (clean nails work fine) to create a 1/4 inch (0.75 cm) hole in one side. Make sure the hole is wide enough for the seed to fit. Place 1 cannabis seed in each hole, use a toothpick or tweezers to gently push it down to the bottom. Cover the hole with a small piece of Rockwool to create a dark, moist environment."
    },
    {
      "title": "Cover tray with clear plastic dome or saran wrap.",
      "content": "Cover tray with clear plastic dome or saran wrap. This will help maintain a humid environment by trapping moisture and retaining heat. Place covered tray with cubes 2 to 3 inches under a 40 Watt fluorescent tube. Leave the lights on 24 hours. It should take between 24 hours and 10 days for a sprout to appear. Place a thermometer neck to the tray, underneath the dome or saran wrap. Monitor the temperature, ensuring it does not go below 70 or above 90 degrees Fahrenheit. Cannabis seeds do not require light until their sprouts penetrate the top of the cube. However, it is good to have a light source set-up and ready for when they do sprout - especially since you cannot monitor the seeds 24/7. Check Rockwool cubes 2-3 times a day. Re-moisten them with the pH-balanced water (stored in a 2-liter plastic bottle) if needed. Spray or trickle water onto the cubes until you observe it soaking through and coming out at the bottom. The cubes should be damp, not drenched."
    },
    {
      "title": "Transplant sprouted seeds.",
      "content": "Transplant sprouted seeds. After 2-3 weeks, the roots should begin poking out of the Rockwool cube. You want to transplant your seedling before the roots begin to tangle. Cut 1 1/4 inch wide by 1 inch deep holes into a slab of Rockwool. Remove the 1 inch Rockwool cubes, being careful not to touch or damage the roots (you might want to use tongs for this part), and place in holes you already cut out in the big Rockwool slab. If the cube does not fit (too small), gently remove it and widen or deepen the cut. Do not try to force the cube into a hole that is too small. The cube should not sink down into the hole or be lower than the surrounding surface. It is better if the cube sticks out a bit rather than sinking in. This prevents water from pooling that can cause stem rot."
    },
    {
      "title": "Germinate cannabis directly in soil rather than hydroponically.",
      "content": "Germinate cannabis directly in soil rather than hydroponically. Germinating and growing seeds in soil is beneficial in that it reduces the risk of damaging the plant after it has sprouted or transplanting as a seedling. You can purchase a propagation kit or create your own. You will need: Feminized cannabis seeds. Small peat cups. Waterproof tray to hold peat cups. 40 watt fluorescent grow light. Thermometer. pH test strips. pH balanced water (pH 5.5 to 6.5) in a spray bottle. Saran wrap."
    },
    {
      "title": "Select appropriate potting soil or create your own soil mix.",
      "content": "Select appropriate potting soil or create your own soil mix. Purchase a soil mix that is entirely organic, such as Sunshine Mix or Pro mix, as many commercial blends contain too much nitrogen or phosphorous. If you purchase a soil mix, check the bag to make sure the pH is between 5.5 to 7. Cannabis does not like alkaline (high pH) soil. Choose a soil mix that drains well. Mixes that drain well often contain a one-to-ten ratio of sand, sponge rock, or pearlite. You can also purchase pearlite separately and mix it in, or add porous materials such as rice hulls or pumice. You can also purchase a mycorrhizae mixture to add to store-bought soil. This is a fungus that is beneficial to plant root growth. If you create your own soil mix rather than buying commercial potting mix, it needs to be sterilized to kill fungus and parasites. Preheat your oven to 180 degrees Fahrenheit. Fill a non-plastic oven safe container with unsterilized soil, making sure it is no more than 4 inches deep. Cover it with aluminum foil and bake for 30 minutes. Remove from oven and set aside to cool. Do not remove aluminum foil until ready to use."
    },
    {
      "title": "Fill peat cups with soil mix and plant cannabis seed.",
      "content": "Fill peat cups with soil mix and plant cannabis seed. Once you prepare your soil mix, and sterilize it if necessary, use it to fill peat cups. Use your finger to make a small 1/4 inch (0.75 cm) deep hole in the center of the cup. Drop a single cannabis seed in the hole and loosely cover with soil. Place peat cups in waterproof tray. Using a spray bottle filled with pH-balanced water (between 5.5 to 6.5), moisten but do not drench the soil. Stop watering if you notice water seeping out of the cups into the tray. Use saran wrap to create a dome over the tray. You can place a cup in the center of the tray or use toothpicks to support the plastic dome. Once the seeds have been planted, place the covered tray with cups under a 40 watt fluorescent light positioned 3 inches above the tray. Leave on 24 hours until plants begin to sprout. Check soil 2 to 3 times a day to make sure it is moist. If needed, spray with pH-balanced water."
    },
    {
      "title": "Monitor the environment.",
      "content": "Monitor the environment. Cannabis germination and growth can be affected by environmental factors such as moisture, temperature, insects, bacteria and fungi, and ultraviolet radiation. [7] X Research source Set a thermometer next to the peat cups under the saran wrap dome. The ideal temperature for germination of cannabis seeds in soil is 90 degrees Fahrenheit. Once they sprout and produce leaves, you can decrease the temperature to 70 to 80 degrees Fahrenheit. If you notice insects, remove them manually with your hands as soon as possible to prevent an infestation."
    }
  ]
}