{
  "url": "https://www.wikihow.com/Finger-Knit",
  "title": "The Easiest Way to Finger Knit: A Full Beginner's Guide",
  "steps": [
    {
      "title": "Hold the yarn between the thumb and index finger of your non-dominant hand, leaving a short length of extra yarn (the \"tail) at the end.",
      "content": "Hold the yarn between the thumb and index finger of your non-dominant hand, leaving a short length of extra yarn (the \"tail) at the end. Keep your thumb pressed against the side of your index finger in order to keep the yarn in place. Turn your hand so that your palm faces you."
    },
    {
      "title": "Start the weave.",
      "content": "Start the weave. With your palm facing you, take the \"working end\" of the yarn and weave it behind your index finger, over your middle finger, behind your ring finger, and over your pinky finger. During the weaving process, be sure to keep the tail tightly gripped between the side of your thumb and index finger. [1] X Research source"
    },
    {
      "title": "Loop around and continue weaving.",
      "content": "Loop around and continue weaving. Once you reach the end of your hand, loop the yarn around your pinky and continue the weave, this time in the alternate pattern. After it wraps around your pinky, the yarn will go over your ring finger, behind your middle finger, and over your index finger."
    },
    {
      "title": "Repeat this sequence.",
      "content": "Repeat this sequence. Wrap the yarn around your index finger and then repeat the original wrapping pattern: behind your index finger, over your middle finger, behind your ring finger, over and around your pinky finger, over your ring finger, behind your middle finger, over and around your index finger. Once finished, you should have two loops around each finger. [2] X Research source"
    },
    {
      "title": "Pull up the bottom loops.",
      "content": "Pull up the bottom loops. Starting with your index finger, take the bottom loop of yarn and pull it up, over (the top loop), and off of your finger. Once finished, the bottom loop should now be on the back of your index finger. [3] X Research source"
    },
    {
      "title": "Repeat with the next three fingers.",
      "content": "Repeat with the next three fingers. Pull the bottom loop up, over, and off of your middle, ring, and pinky fingers. Once finished, you should have one loop on each finger."
    },
    {
      "title": "Reposition the yarn.",
      "content": "Reposition the yarn. Using your dominant (free) hand, press the yarn down so that the remaining loops are closer to the bottom of your fingers and do not risk falling off."
    },
    {
      "title": "Continue the weave.",
      "content": "Continue the weave. Grab the tail (which should be between your index and middle fingers) and wrap it over your middle finger, behind your ring finger, and over and around your pinky. Continue the other direction by wrapping it over your ring finger, behind your middle finger, and over and around your index finger. Once finished, you should once again have two loops on each finger. [4] X Research source"
    },
    {
      "title": "Repeat pulling up the bottom loops.",
      "content": "Repeat pulling up the bottom loops. As with before, start with the index finger and pull the bottom loop up, over (the top loop), and off your finger. Repeat this for the remaining three fingers until you end up with only one loop on each finger."
    },
    {
      "title": "Repeat repositioning of the yarn.",
      "content": "Repeat repositioning of the yarn. Once again use your dominant (free) hand to slightly push the yarn down so that the remaining loops are closer to the bottom of your fingers, allowing additional room to continue the weave."
    },
    {
      "title": "Repeat these three actions (weaving, pulling up loops, repositioning) as long as desired.",
      "content": "Repeat these three actions (weaving, pulling up loops, repositioning) as long as desired. A nice, rope-like structure of yarn should form at the back of your hand, which will allow you to roughly gauge the length you've made. Don't be afraid to lightly tug on it to tighten it up as you go."
    },
    {
      "title": "Stop weaving.",
      "content": "Stop weaving. Once your rope is as long as you want it, stop with one loop on each finger, just after you've pulled over the bottom loops. Do not continue to weave."
    },
    {
      "title": "Finish your index finger.",
      "content": "Finish your index finger. Take the remaining loop from your index finger and flip it up and over, onto your middle finger. Now, pull the bottom loop up from your middle finger and over to the back of your hand. [5] X Research source"
    },
    {
      "title": "Finish your middle finger.",
      "content": "Finish your middle finger. Take the remaining loop from your middle finger and flip it up and over, onto your ring finger. Again, pull the bottom loop up from your ring finger and over to the back of your hand."
    },
    {
      "title": "Finish your pinky.",
      "content": "Finish your pinky. Take the remaining loop from your ring finger and flip it up and over, onto your pinky. Again, pull the bottom loop up from your pinky and over to the back of your hand. Once finished, you should have on loop on your pinky."
    },
    {
      "title": "Slip the loop off your pinky.",
      "content": "Slip the loop off your pinky. Be careful to not let the loop close once it is off your finger."
    },
    {
      "title": "Cut the working end of the yarn a few inches away from the loop.",
      "content": "Cut the working end of the yarn a few inches away from the loop. Be sure to leave a few inches of extra yarn at the end. [6] X Research source"
    },
    {
      "title": "Pull this working end (now a new tail) through the loop.",
      "content": "Pull this working end (now a new tail) through the loop. Tug it a few times to tighten the loop upon the new tail. [7] X Research source"
    },
    {
      "title": "Tighten the other end.",
      "content": "Tighten the other end. Return to the original tail and also give it a tug to tighten off the other end. If desired, you can even tie a knot to finish off this end."
    },
    {
      "title": "Finished.",
      "content": "Finished. If you want your yarn to make a circle (for a bracelet, headband, etc.), tie the two ends in a tight, square knot. If not, you're all done."
    }
  ]
}