{
  "url": "https://www.wikihow.com/Get-Stronger-and-Thicker-Wrists",
  "title": "How to Get Stronger and Thicker Wrists",
  "steps": [
    {
      "title": "Warm up your wrists.",
      "content": "Warm up your wrists. Before working your wrist muscles, warm them up by performing unweighted wrist movements. These could include hand circles and wrist flexions and extensions. This helps gradually loosen the wrist area and prepares you for training your wrists."
    },
    {
      "title": "Practice wrist extensions.",
      "content": "Practice wrist extensions. Wrist extensions are an easy exercise that you can start doing at home to increase flexibility in the forearm muscles that power your wrist. Doing wrist extensions is the best way to gradually start getting bigger wrists. Rest the back of your forearm on a table or on your leg. Your palm should be facing up, and your hand should be aligned with your arm. Place a light weight in that hand, then slowly lower the weight toward the floor. The movement should take you five seconds, then bring the wrist back up to starting position. Do two sets of 10 or 15 reps with each wrist four or five times a week."
    },
    {
      "title": "Do radial training.",
      "content": "Do radial training. Radial training works much like wrist extensions, except you're emphasizing a different muscle motion by changing the direction of the exercise. This type of exercise is very common in physical rehabilitation routines after wrist injuries, and you can do radial wrist exercises at home. Grab a dumbbell, then stand with your arms at your side. Tilt the dumbbell toward the ceiling and slowly lower it down. Do two sets of 10 or 15 reps with each wrist four or five times a week."
    },
    {
      "title": "Do wrist releases.",
      "content": "Do wrist releases. This is an excellent way of stretching your wrists out at the end of a work out, decreasing the possibility of injury or soreness. [1] X Research source Do this at the end of each exercise routine. Place one hand on the back of the other with the hand flexed towards the wrist. Hold the hand in place by applying some pressure on it and move the forearm lower to increase the angle. Hold for six to ten seconds, then work the opposite arm."
    },
    {
      "title": "Stretch out your wrists.",
      "content": "Stretch out your wrists. Doing wrist stretches is an important part of working up to any strength training routine that you want to integrate into your overall fitness. Especially if you've got small or \"weak\" wrists, it's a good idea to stretch things out before you get started. Get on your hands and knees and place your hands flat on the ground with your fingers pointing back toward your body. Keep your arms straight and locked and stretch your wrists gently. Don't force them. Count to fifteen. When you get comfortable with that stretch, try to extend your legs out behind you and bring your hips down to the ground while pushing your torso up by fully extending your arms with your palms flat on the floor. In yoga, this is called the \"cobra pose\" and it can be very effective at stretching your wrists."
    },
    {
      "title": "Be patient",
      "content": "Be patient . Building strength takes time, which means you need to be patient. You're not going to do a couple exercises and wake up tomorrow to some big meat-claws at the end of your arms. The name of the game is consistency, not speed. Commit to a training routine and start doing it consistently, without taking a day off because you just don't feel like it. Have patience and work for stronger wrists."
    },
    {
      "title": "Do curls with a straight bar and a fat bar.",
      "content": "Do curls with a straight bar and a fat bar. Bicep curls obviously target the biceps, primarily, but you can also use curls as a chance to strengthen your forearms as well. Basic bicep curls require you to keep your wrists straight, which helps to build strength while you're doing the exercise, but you can also mix it up and do some wrist curls with both the fat bar and the straight bar to increase hand strength and wrist strength. Grip the bar over hand, with less weight than you'd use for a bicep curl. At the curl station, instead of bringing the bar all the way up as you would in a bicep curl, flex your wrists to bring the bar up. Do the same number of sets and reps you use for bicep curls. Repeat the exercise with an under-hand grip as well. Reader Poll: We asked 590 wikiHow readers what type of exercise they enjoy most for arm workouts, and 72% of them said weightlifting. [Take Poll]"
    },
    {
      "title": "Do plate pinches.",
      "content": "Do plate pinches. Plate pinches are one of the most common forearm strength training exercises, commonly used by bodybuilders to bulk up the forearms and the grip. It couldn't be an easier exercise, provided you've got some heavy stuff to lift. [2] X Research source Line up one or two plates from the weight machine on the ground, perpendicular with the ground. Squat down, gripping them with your hands, then stand up, holding it securely. That's it. Alternate hands, doing three sets of five-ten reps, or whatever is comfortable for you. You could also use a stack of a few heavy books, something that will stretch out your grip and force you to spread your fingers relatively wide as you lift. It's mostly about the strength required to grip the objects together."
    },
    {
      "title": "Do wrist rollers.",
      "content": "Do wrist rollers. Wrist rollers require a special device called a wrist roller, but this is commonly available at most gyms, and you could also bootleg one in a pinch. The exercise itself is simple, but challenging, extremely effective at building forearm strength and bigger wrists. A wrist roller bar is basically a short bar with a rope in the center, from which a weight hangs. If you don't have one, you could also use a bar from a barbell, hanging one of the weights from it with a length of rope, about 24 inches (61.0 cm) long. Grip the bar with both hands, palms facing down and extend your arms straight out in front of you. As the weight hangs, twist the bar up and backward with your wrists, one at a time, as if you were activating the gas on a motorcycle. Try 10 or 15 reps at three sets."
    },
    {
      "title": "Do knuckle push-ups.",
      "content": "Do knuckle push-ups. If you want to work on stability and strength in your forearms, doing push-ups is a great way of exercising. Traditional, flat-handed pushups, though, can actually stress your wrists, causing soreness and stiffness in the joint. Instead, use push-ups as an opportunity to build strength in your wrists by doing them on your knuckles instead of your flat palms. Focus on keeping your wrists very straight and solid while you do push-ups, however many you're comfortable doing. If you're just getting started, try doing three sets of ten."
    },
    {
      "title": "Avoid the use of wrist straps.",
      "content": "Avoid the use of wrist straps. Lots of beginners who are trying to build strength in their forearms over-use wrist-straps, which is counter-productive. Your wrists won’t get stronger if you’re relying on wrist-straps to bear some of the burden of the weight. If you feel like you need wrist-straps, lower the weight you’re lifting. [3] X Research source"
    }
  ]
}