{
  "url": "https://www.wikihow.com/Get-Microsoft-Office-For-Free",
  "title": "7 Ways to Use Microsoft Office for Free: Web, Mobile, & Desktop Versions",
  "steps": [
    {
      "title": "Visit the Microsoft 365 website.",
      "content": "Visit the Microsoft 365 website . Microsoft offers Word , Excel , PowerPoint , and other Office apps for free online. These versions aren't quite as powerful as the desktop versions, but you can still do just about anything you'd need to without installing or paying for anything. Visit the Office Online website to view the available web apps. In the online version of Word, you can’t create or modify new styles, use rulers or gridlines, customize the spellcheck dictionary, or edit password-protected documents. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Log in or sign up for a free Microsoft account.",
      "content": "Log in or sign up for a free Microsoft account . If you don’t already have a Microsoft account, you’ll need to sign up for one to start using Office apps online. Click Sign in or Sign up for free to get started. Follow the prompts to either log in or create your new account. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source With the basic free account, you’ll get 5GB of storage in Microsoft’s cloud service, OneDrive . Any documents you create in the online Microsoft 365 suite will be automatically saved to OneDrive."
    },
    {
      "title": "Select the online app you want to use.",
      "content": "Select the online app you want to use. Once you’re logged in, you’ll be taken to the Microsoft 365 online interface. From there, you can select the app you want to use from the toolbar on the left-hand side of the page, or choose one of the options under the Create New header in the central dashboard area. For example, click the tile that says Document and shows the Word icon to create a new Word document. Documents you create will automatically be saved to your OneDrive account. However, you can also save them to your computer by opening the File menu, selecting Save as , and choosing Download a Copy . You can also open documents in the online version of Microsoft 365 by uploading them to OneDrive , then opening them in the appropriate app. Use the Share feature to share links to your documents or manage who can access and edit them."
    },
    {
      "title": "Download the Microsoft 365 mobile apps on your Android, iPhone, or iPad.",
      "content": "Download the Microsoft 365 mobile apps on your Android, iPhone, or iPad. Microsoft has free Office apps available for Android and iOS. You can download them from the Google Play Store or the Apple App Store . The free versions of the apps provide basic editing and creation features. Using an Office 365 subscription gives you access to more advanced features."
    },
    {
      "title": "Allow the Office apps to access your device storage.",
      "content": "Allow the Office apps to access your device storage. When you launch the apps for the first time, you may be prompted to grant access to your device's storage. Allow access so that you can easily save and load files."
    },
    {
      "title": "Sign in with a Microsoft account to connect to OneDrive.",
      "content": "Sign in with a Microsoft account to connect to OneDrive. You'll be prompted to sign in with a Microsoft account when you first launch the app. While you can skip this, signing in or creating a free account will give you 5GB of OneDrive storage and will allow you to sync Office files across your devices. When you skip signing in, you won’t be able to save your documents, although you can use the Share button to send a copy or save it to your device. The keyboard may also not work properly if you aren’t signed in."
    },
    {
      "title": "Tap the folder icon to open files from various locations.",
      "content": "Tap the folder icon to open files from various locations. You can open files that have been downloaded to your device, documents stored in Google Drive or Dropbox, your OneDrive files, and more. The Office apps support all of the normally compatible formats (i.e. the Word app can open DOC, DOCX, and TXT files). If you’re logged in, you’ll be able to see recent documents stored in your OneDrive on the Home screen."
    },
    {
      "title": "Select + to create a new document.",
      "content": "Select + to create a new document. Tap the + button and select one of the options from the New screen to make a new document. You can either create a blank document from scratch or choose from a variety of templates."
    },
    {
      "title": "Use the buttons at the top to access formatting tools.",
      "content": "Use the buttons at the top to access formatting tools. The \"A\" button with a pencil will open the formatting frame. You can select basic editing and formatting tools from the familiar Office tabs in this frame. Tap the \"Home\" button to view the different tabs you can switch between. You can scroll the formatting frame up and down to view all of the available options. When the keyboard is open, you can swipe the bar above it left and right to view quick-access formatting tools."
    },
    {
      "title": "Tap the \"Save\" button to save.",
      "content": "Tap the \"Save\" button to save. If you are logged in, your document will save automatically at regular intervals. You can also tap the Save button that appears to create an instant save, or tap the ••• Menu button in the upper-left corner and select \"Save\" at any time."
    },
    {
      "title": "Visit the Office 365 Education website to get started.",
      "content": "Visit the Office 365 Education website to get started. If you’re a student or teacher at a participating school, you can get Office 365 for free. Start by visiting https://www.microsoft.com/en-us/education/products/office . The Education version of Microsoft 365 offers a wide range of full-featured desktop Office apps, including Word, Outlook, PowerPoint, Excel, OneNote, Teams, Access, and Publisher . If you’re not sure whether you’re eligible for a free Education version of Office, ask at your school’s IT department."
    },
    {
      "title": "Enter your school email address and click Get Started.",
      "content": "Enter your school email address and click Get Started . On the Office 365 Education website, type your school email into the text box near the top of the page. Click the blue Get Started button under the text field. [3] X Research source"
    },
    {
      "title": "Select I’m a student or I’m a teacher.",
      "content": "Select I’m a student or I’m a teacher . From there, Microsoft will attempt to verify your account. If Microsoft can’t verify that the email address you entered is currently valid at your school, you’ll be prompted to try a different login or reach out to your school’s IT department."
    },
    {
      "title": "Download Microsoft 365 onto your computer.",
      "content": "Download Microsoft 365 onto your computer. If you’re eligible for an Education account, follow the login prompts to sign in with your school ID and password. Then, follow the on-screen instructions to download and install Microsoft 365. You’ll be able to use the Office apps for free until you graduate or leave the school. [4] X Research source"
    },
    {
      "title": "Find out if any family or friends have a 365 Family subscription.",
      "content": "Find out if any family or friends have a 365 Family subscription. Microsoft 365 Family subscribers can share their subscription with up to 5 other people. If you know someone who subscribes, this can be an easy way to get free access to the Office apps. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The shared plan includes 1TB of OneDrive storage for each person on the plan. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Ask them to log in from the Sharing page.",
      "content": "Ask them to log in from the Sharing page. To start sharing with you, your friend or family member will need to visit the sharing page: https://account.microsoft.com/services/office/sharing . Once they sign in, they’ll need to select Start Sharing ."
    },
    {
      "title": "Have them choose an option from the Share Office menu.",
      "content": "Have them choose an option from the Share Office menu. They’ll see a popup with the option to invite you to share via email. Or, they can copy a share link and email or text it to you."
    },
    {
      "title": "Click the share link and sign in with your Microsoft account.",
      "content": "Click the share link and sign in with your Microsoft account. Once you get the share link or email invitation, click it to go to the You’re Invited page. Select Get Started and follow the instructions to sign in and get access to Office 365. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If your family member sent you an email invitation, you’ll need to use that same email address to create your free Microsoft account. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Install Microsoft 365 on your computer.",
      "content": "Install Microsoft 365 on your computer. Once you’re signed in with the shared account, you will be taken to the Microsoft 365 Family page. From there, select Install Office to install the Office apps on your computer for free. You’ll have access as long as your family member’s subscription is active and they continue to share their subscription with you. [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The owner of the account can stop sharing with you at any time if they wish."
    },
    {
      "title": "Use the trial to try out Microsoft 365 for a month.",
      "content": "Use the trial to try out Microsoft 365 for a month. You can use Office suite for free for one month by downloading the Microsoft 365 trial. This includes the latest versions of Word, Excel, PowerPoint, Outlook, and other Office programs. Microsoft 365 is the only version of Office with a free trial available. Signing up for the free trial will require a valid credit card, but you will not be charged until the start of the second month. Canceling before the end of the first month will prevent any charges and allow you to use the trial for the entire first month."
    },
    {
      "title": "Visit the Office trial website.",
      "content": "Visit the Office trial website. You can download the trial from the official Office website. Visit https://www.microsoft.com/en-us/microsoft-365/try to open the trial page."
    },
    {
      "title": "Click the Try 1 month free button.",
      "content": "Click the Try 1 month free button. This will begin the sign-up process."
    },
    {
      "title": "Log in with your Microsoft account or create one.",
      "content": "Log in with your Microsoft account or create one. You'll be prompted to log in with your Microsoft account. You can use any Hotmail, Live.com, or Outlook.com email address to sign in, or you can create a new account for free. Creating an account is required for the trial."
    },
    {
      "title": "Enter a valid credit card.",
      "content": "Enter a valid credit card. You'll need to enter a credit or debit card in order to start your trial. This card will not be charged immediately, but you will be charged the monthly Office 365 fee if you don't cancel by the end of the trial."
    },
    {
      "title": "Download the Office 365 installer.",
      "content": "Download the Office 365 installer. After creating your account and entering your credit card information, you'll be given a link to download the Office 365 installer. The installer itself is very small, and should only take a few moments to download."
    },
    {
      "title": "Run the installer after downloading it.",
      "content": "Run the installer after downloading it. Once the installer has downloaded, run it to begin the actual download and installation of Office. You may be prompted to enter your Microsoft account again before the download begins. During installation, you'll be given the option to select which Office products you want to install. You can save time and hard drive space by deselecting the programs you won't be using. You can always install them again later if you end up needing them. The installation process will take a fair amount of time, especially if you have a slow internet connection. You'll be able to find your newly installed Office programs in your Start menu. You can use all of the features of the programs for your entire trial. The free trial will also allow you to access the full versions of the Office apps across multiple devices where you’re logged into your Microsoft account."
    },
    {
      "title": "Keep in mind that there are no freeware versions of Office.",
      "content": "Keep in mind that there are no freeware versions of Office. Microsoft has never released any desktop version of Office for free. However, you may be able to use an old copy of Office if you’re also able to get the license or original product key."
    },
    {
      "title": "Download an older version that you own from the Microsoft website.",
      "content": "Download an older version that you own from the Microsoft website. If you have ever owned a copy of Office in the past, you may be able to re-install it using your Microsoft account. This will only work for versions of Office that were linked to your Microsoft account. To get started: [10] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Visit account.microsoft.com/billing/orders Select All available from the Ordered within dropdown menu. Find the old version of Office you want to install and select Product key/install . Follow the instructions on the screen. Select Install Office and follow the prompts to begin the installation process."
    },
    {
      "title": "Be careful downloading cracked copies of Office.",
      "content": "Be careful downloading cracked copies of Office. There are various websites where you can download old copies of individual Office apps or the whole Office suite for free. However, these services may not be safe or legal. Try them at your own risk, and make sure you have good anti-malware software installed on your computer. Archive.org has several old versions of Office available. You can try using the product key or serial number listed on the download page for each version of Office. Visit the software archive page and search for Microsoft office to see the options: https://archive.org/details/software"
    },
    {
      "title": "Check out the available desktop Office replacements.",
      "content": "Check out the available desktop Office replacements. There are several programs available that can give you most of the features found in Office, and even some that Office doesn't have. These programs are all able to open and edit Office documents, as well as a variety of open formats. The most popular suites are FreeOffice, OpenOffice, and LibreOffice . [11] X Research source FreeOffice is considered the most user-friendly of the options, while OpenOffice and LibreOffice are more powerful. If you are familiar with Office, consider FreeOffice or LibreOffice."
    },
    {
      "title": "Download the software.",
      "content": "Download the software. Once you've settled on a choice, you can download the installer for the program you want. Visit the following sites to download the installer for your chosen program: LibreOffice: https://www.libreoffice.org/download/download-libreoffice/ FreeOffice: https://www.freeoffice.com/en/download/applications OpenOffice: https://www.openoffice.org/download/index.html"
    },
    {
      "title": "Run the installer.",
      "content": "Run the installer. You'll be given the option to choose which of the productivity programs you want to install. By only selecting the ones you plan to use, you can cut down on installation time and hard disk space."
    },
    {
      "title": "Get acquainted with your new program.",
      "content": "Get acquainted with your new program. All three Office alternatives listed above look and behave differently, and they are all full-featured software programs. As such, they'll all have a bit of a learning curve, especially if you're used to using Office. The basic features should be fairly straightforward, and you can look on YouTube or here on wikiHow for instructions on performing more advanced tasks. See Use OpenOffice Writer for details on using Writer, the OpenOffice Word alternative. See Use LibreOffice for tips on getting familiar with the LibreOffice word processor."
    },
    {
      "title": "Consider web-based Office alternatives.",
      "content": "Consider web-based Office alternatives. As online tools become more powerful, there is less and less need for installing productivity programs on your computer. Besides the apps detailed above, there are several web-based productivity suites you can use. All of these services allow you to upload and edit Office documents. Google Docs is the most famous of the web-based options. You can create and edit documents, spreadsheets, and presentations using Google's online tools. You can access everything from Google Drive, where your documents will be stored. If you have a Gmail account, you have access to Google Docs. See Use Google Drive for details on creating and editing documents. Zoho is another cloud-based Office replacement. Its interface is much more similar to the Office interface than Google Docs. Like Google Docs, you can create documents, spreadsheets, and presentations. OnlyOffice is an online Office alternative that allows you to create documents, spreadsheets, and presentations."
    }
  ]
}