{
  "url": "https://www.wikihow.com/Flirt-with-a-Capricorn",
  "title": "How to Flirt with a Capricorn to Capture Their Attention",
  "steps": [
    {
      "title": "Dress to impress the smart, sophisticated Capricorn.",
      "content": "Dress to impress the smart, sophisticated Capricorn. This sign has high standards and an eye for elegance. Wear flattering but conservative clothes to show Capricorn you have great taste. The phrase \"dress for the job you want\" applies to flirting with a Capricorn; dress the part if you want to get their attention. Capricorns love simple, classy clothing. Try dark jeans and a dapper, neutral-toned sweater for a chic and polished look. If your style is more feminine, try dark pants (or a dark skirt) and a cute top with one noticeable embellishment, like a ruffled hem or a twist knot."
    },
    {
      "title": "Approach cautious Capricorns first.",
      "content": "Approach cautious Capricorns first. Capricorns are prudent and will sit back and wait for you to show interest first. Because Capricorns can be unsure of themselves when it comes to flirting, they'll appreciate you breaking the ice. Just smile and walk up to them! You might say: \"Hey! We met the other day at Jenna's get-together—it's great to see you.\" Don't push too hard initially. These stubborn earth signs don't like to feel rushed at anything, especially love. Astrologer Tara Divina suggests that “a Capricorn might be slower to make a move, take a little longer, contemplate it, plan it out a little more in advance versus being spontaneous—it might be an overly practical approach.” [1] X Expert Source Tara Divina Vedic Astrologer Expert Interview. 20 November 2019."
    },
    {
      "title": "Focus on being friendly but not too forward.",
      "content": "Focus on being friendly but not too forward. Capricorns are old-fashioned, so don't make an obvious pass at them. [2] X Research source Wait until you've hung out with your Capricorn a few times before you flirt openly with them. Let them get to know you better while being polite and friendly in the meantime. If you act too soon, it might scare a Capricorn off. If you take it slow, your Capricorn will loosen up and joke around—a clear sign that they like you. Try inviting your Capricorn to a group hangout or game night. This gives you a chance to spend time together without getting flirty too soon."
    },
    {
      "title": "Ask about their favorite interests.",
      "content": "Ask about their favorite interests. Capricorns love to chat about their hobbies and passions. Find out what your Capricorn likes and try to find some shared interests. Express curiosity and enthusiasm about their hobbies, while asking thoughtful questions. A Capricorn will be flattered by your genuine interest. Say something like, \"I bet you have great taste in music. What are a few of your favorite artists?\" If your Capricorn tells you about a book they love, offer to read it. \"I think that sounds fascinating—would you lend it to me? If you like it, I'm sure I will too.\" Take it slow and don't expect to learn everything about your Capricorn at once; they like to be a little mysterious and get to know people gradually."
    },
    {
      "title": "Stick to intelligent topics when in conversation.",
      "content": "Stick to intelligent topics when in conversation. Show off your smarts to catch a cerebral Capricorn's attention. They don't like mindless flirting—they like to be mentally stimulated and flirt while discussing topics with substance. Bring up deep subjects with your Capricorn, such as politics, economics, or philosophy. They'll be impressed by your knowledge and will be eager to share their own. [3] X Research source \"I love weird history facts. Any good podcast or documentary recommendations? I trust your opinion.\" \"I've been thinking about this one concept from my politics class a lot, and I'd like to talk it through with you. You've always got an interesting perspective!\" If you’re flirting with a Cap over text , send them a link to a news story. \"I've got some thoughts about this, and I'm curious to know what you think too!\""
    },
    {
      "title": "Be open about what drives you the most.",
      "content": "Be open about what drives you the most. This ambitious sign is attracted to people who also reach for the stars. Tell a Capricorn about your career goals, and ask about theirs. Get flirty by complimenting Capricorn on the progress they've made while celebrating their accomplishments. [4] X Research source “Capricorns are very work-oriented. They're looking to develop themselves and grow what they're doing in the world,” notes astrologer Liv Woodford. [5] X Expert Source Liv Woodford Astrologist Expert Interview. 2 May 2023. Capricorn wants to know that you're also motivated and can help them work towards their goals too. \"I've worked hard to get where I am in life—and I have much more planned for the future! 😉\" \"I think it's so impressive that you have plans to start your own company. If anyone can do it, you can!\" Astrologer Angel Eyedealism notes that Capricorns can be social climbers, and they like being with people who give them practical help to meet their goals. [6] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Hint that you have connections and other successful friends (and offer to introduce them)."
    },
    {
      "title": "Ask Capricorns for their advice about anything.",
      "content": "Ask Capricorns for their advice about anything. Capricorns are practical and like to feel useful. Asking for a Capricorn's help is a great way to get their attention. Astrologer Stina Garbis suggests starting simply by asking for help with a minor household problem or car issue. [7] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. Or, if there's a subject your Capricorn is knowledgeable about, ask them a question about it. \"Any pointers for hanging up a picture frame? You've got a great eye for balance, and I want my walls to look neat!\" \"My car is having trouble starting because of the cold. What's the first thing you do when that happens?\" is a great text for a Capricorn man . Text them, \"I need a true film enthusiast's advice: what should I watch tonight?\""
    },
    {
      "title": "Make the humor-loving Capricorn laugh.",
      "content": "Make the humor-loving Capricorn laugh. Capricorns have a hidden funny bone and a dry sense of humor. Flirt with your Capricorn by telling witty jokes; they enjoy dark humor that highlights the funny side of a negative situation. Capricorns can get lost in their own thoughts, so they'll appreciate your ability to make them smile no matter what. Though they appear serious, Capricorns love to laugh, suggests Garbis. [8] X Expert Source Stina Garbis Psychic Astrologer Expert Interview. 10 December 2021. \"Did you know that in New York, someone gets stabbed every 52 seconds? Poor guy.\" \"Yeah, obviously I talk to myself—sometimes I need expert advice!\" Steer clear of crude humor with your Capricorn. They tend to have a more refined sense of humor and find crudeness distasteful overall; their serious demeanor extends to humor, too!"
    },
    {
      "title": "Use clean language when speaking to a Capricorn.",
      "content": "Use clean language when speaking to a Capricorn. Straight-laced Capricorns are turned off by suggestive comments. They'll enjoy that side of flirting one day, but only when you're more familiar with one another. For now, make sure your flirts are more classy and subtle. Charm a Capricorn with your sophistication, and they'll be yours in no time. \"Wow! You look amazing today. I'm lucky to be with you.\" \"I love that I can talk about anything with you. We're a great match!\" Avoid teasing your Capricorn as well; they don't like being made fun of, even if you're doing it in good fun."
    },
    {
      "title": "Focus solely on them so they know you’re loyal.",
      "content": "Focus solely on them so they know you’re loyal. Capricorns want nothing less than to compete for your affection. Make sure you're not flirting with anyone else once you show interest in a Capricorn. Make it clear to the Capricorn that they're the only person you have eyes for. Some signs treat flirting like a game, but Capricorn flirts as a means to get to know you better and deepen your relationship."
    },
    {
      "title": "Be consistent and reliable no matter what you do.",
      "content": "Be consistent and reliable no matter what you do. Protocol is important to the organized and rigid Capricorn. For example, a Capricorn would be offended if you showed up late to a date because you'd be going against your agreement to arrive at a certain time, says Eyedealism. [9] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Follow through on your commitments and prove that you'll be a dependable partner for your Capricorn crush. \"Let's meet up at 8 PM sharp! I wouldn't dream of keeping you waiting.😘\" \"I really appreciate how responsible you are—it makes me happy to be with someone who respects my time as much as I respect theirs.♥️\""
    },
    {
      "title": "A Cap will observe you from afar to see what you’re into.",
      "content": "A Cap will observe you from afar to see what you’re into. Capricorns are known for being subtle and understated when they’re trying to flirt. By watching you and noticing what you respond to, they can try to become the type you’re interested in so they can win your attention (and maybe your heart)."
    },
    {
      "title": "Capricorns will then show you how they’re feeling—not tell you.",
      "content": "Capricorns will then show you how they’re feeling—not tell you. They flirt with practical actions, like offering you advice and guidance or being generally helpful about anything you might need. By assisting in your life, they’re hoping that you recognize their worth and give them a chance to show you more."
    },
    {
      "title": "Once they start flirting, a Cap will act playful to express interest.",
      "content": "Once they start flirting, a Cap will act playful to express interest. When a Capricorn likes you, they’ll flirt by telling you jokes or funny stories to entertain you. They may even tease you in a lighthearted way. Their mischievous attention is a sure sign that they’re interested in you as more than a friend or acquaintance."
    },
    {
      "title": "Be practical and reliable when on a date with Capricorn.",
      "content": "Be practical and reliable when on a date with Capricorn. Your commitment to these traits will match up nicely with theirs and let them know that a long-term relationship is possible. Capricorns love well-planned, meaningful dates. Think museum trips and cultural events to appeal to their intellectual side; a cozy dinner at home is another practical way to spend quality time with your Capricorn so they’ll end up wanting more . [10] X Research source Try to never run late when on a date with a Capricorn, but if you can’t help it, be honest about your situation. Capricorns hate lies and excuses, but they might be understanding if your lateness is unavoidable."
    },
    {
      "title": "Capricorns are turned on by those who take things seriously.",
      "content": "Capricorns are turned on by those who take things seriously. Having a dedicated work ethic and being responsible are hallmark Capricorn traits; they respond positively when they see them in others. Showing loyalty and trust, and being open to new ideas are also ways you can get a Capricorn’s attention. Find more Capricorn turn-ons ahead: Ambition and hard work Practicality and responsibility Loyalty and commitment Sensual touch High standards Vulnerability Intellectual stimulation"
    },
    {
      "title": "Capricorns are turned off by laziness and complacency.",
      "content": "Capricorns are turned off by laziness and complacency. They don’t know how to treat someone who isn’t interested in getting ahead or bettering themselves. A disregard for work ethic and being generally disorganized are also ways to turn off an action-oriented Capricorn. Find more Capricorn turn-offs ahead: Laziness and complacency Lack of ambition Messy appearance All talk and no action No work ethic Pushiness Neediness Drama"
    },
    {
      "title": "Most compatible",
      "content": "Most compatible Cap is most compatible with Taurus, Scorpio, Cancer , Virgo, Pisces, and Libra . Fellow earth sign Taurus provides a healthy, harmonious connection, while fixed-water sign Scorpio allows for an easygoing relationship that thrives easily. The practical Capricorn and dreamy Pisces can also complement each other well. Overall, top matches for Capricorn include: [11] X Research source Taurus: An organic, down-to-earth connection. Scorpio : A well-matched, hardworking power couple. Cancer: Opposites attract for a secure partnership. Virgo : Both are pragmatic and hardworking for a lasting bond. Pisces: They teach each other well in a heartfelt, friendly way. Libra: They’re natural initiators who can meet a shared goal."
    },
    {
      "title": "Least compatible",
      "content": "Least compatible Cap is least compatible with Aries, Gemini , Leo, Sagittarius , and Aquarius. Aries’ supercharged motivation can prove too much for the slow and steady practicality of Capricorn. Gemini is too flighty, while the extroverted Leo makes a better friend than a romantic partner. Sagittarius and Aquarius are too free-spirited for the super-pragmatic Capricorn. Overall, the worst matches for Capricorn include: [12] X Research source Aries : Too speedy with their energy for Capricorn. Gemini: Opposites can’t align when it comes to boundaries. Leo: Leo’s motivations are too focused on ego. Sagittarius: It can’t work unless Sagittarius gets organized. Aquarius : Proves too unconventional and free-spirited personality-wise. Love astrology? Take this quiz to discover your soulmate’s sign."
    },
    {
      "title": "Capricorns are practical, ambitious, and strong.",
      "content": "Capricorns are practical, ambitious, and strong. They’re known for being extremely hard workers who want to get ahead in life. Capricorns are loyal and supportive of their friends and loved ones. They are ambitious and determined, and make great partners, as well as friends and collaborators. [13] X Research source"
    },
    {
      "title": "Capricorns can be uptight, pessimistic, and relentless.",
      "content": "Capricorns can be uptight, pessimistic, and relentless. Their ambition can easily turn into being seen as workaholics who are overly practical. Their constant need for discipline and etiquette can be a problem for those who don’t want to live their lives so tightly wound. They also have zero tolerance for jokes at their expense, which makes them come across as overly sensitive at times. [14] X Research source"
    },
    {
      "title": "Capricorn is born between December 22 and January 20.",
      "content": "Capricorn is born between December 22 and January 20. Their symbol is a sea goat, and they’re ruled by the planet Saturn . Capricorn is an earth sign and one of the 4 cardinal signs . Earth signs are known for being practical, reliable, and grounded. The 4 cardinal signs initiate the seasons; in Capricorn’s case, it marks the start of winter. Birthstone: Garnet. Flower: Pansy and Carnations. Color: Dark green, brown, black, and purple. Lucky numbers: 4, 8, 13, 22."
    }
  ]
}