{
  "url": "https://www.wikihow.com/Future-Faking",
  "title": "All About Future Faking & How to Tell When a Narcissist Does It",
  "steps": [
    {
      "title": "Future faking is when someone makes false promises about the future.",
      "content": "Future faking is when someone makes false promises about the future. It’s a common tactic used by people with narcissistic tendencies in relationships. They may quickly think up detailed plans for your future together, creating an illusion of intimacy to manipulate you into feeling close to them. However, they don't bother following through on their promises because they’re just trying to win you over in the moment. [1] X Research source Example 1: You and your partner have talked about a vacation in Europe since the early days of your relationship but never booked the trip because they always have an excuse for why they can’t go at the moment. Example 2: You and your partner agreed that you wanted to get married and have children in the future, but it’s been several years, and they haven’t proposed. Every time you mention it, they put it off longer. Example 3: You’ve asked your spouse to stop working so late every day, but they still do it. They promise they’ll try harder whenever you talk to them about it, but it never happens. Future faking can also happen in the workplace. For example, your boss at work might promise you a raise—but every time you ask about it after that, they have an excuse for why they can’t do it just yet."
    },
    {
      "title": "Narcissistic people use future faking to get you invested in relationships.",
      "content": "Narcissistic people use future faking to get you invested in relationships. People who have narcissistic tendencies often employ the future faking technique because they want their partners to blindly adore them. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source They use future faking to keep their partners in the relationship, and because they typically lack empathy, they don’t often consider how this behavior might hurt their partner. Some signs of narcissistic behavior include: Grandiosity and arrogance Seeking attention from others Insecurity and hypersensitivity Manipulation Lack of empathy"
    },
    {
      "title": "Narcissistic people rely on future faking to gain narcissistic supply.",
      "content": "Narcissistic people rely on future faking to gain narcissistic supply. \"Narcissistic supply\" is basically all the things that narcissistic people want but can't get on their own—including admiration, validation, attention, power, and control. They also use future faking to hide their true selves, playing the role of someone thoughtful and generous when they're really just playing games. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Because future faking is designed to strengthen a narcissistic person's bond with you, it may prevent you from realizing when you're in a toxic (or even abusive) relationship. It's harder to leave someone you feel deeply connected to, which is why some narcissistic people use future faking to get partners invested."
    },
    {
      "title": "Some people deliberately future fake and some do it unconsciously.",
      "content": "Some people deliberately future fake and some do it unconsciously. Not all narcissistic people may be conscious of the fact that they’re stringing you on, but it’s a common behavior regardless. Even if you point out that someone with narcissistic tendencies is future faking and making promises without living up to them, they’re unlikely to believe you or seek help (because they lack empathy and tend to be arrogant). [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Before assuming your partner is deliberately making false promises, consider whether they display a lack of empathy. Some people overpromise due to wishful thinking, a desire to avoid conflict, or a simple error in judgment. In other words, a partner who really feels bad about breaking a promise might have made a mistake, but a partner without remorse might be narcissistic."
    },
    {
      "title": "The relationship is progressing a little too quickly.",
      "content": "The relationship is progressing a little too quickly. There’s no “proper” pace for relationships, but normal couples don’t usually start talking about romantic month-long vacations or saying “I love you” within the first couple weeks of dating. If you’ve only been dating someone for a short time and they already repeatedly and frequently talk about the future with you, they might be future faking. [5] X Research source If you’re dating a narcissist , they’re likely to use future faking. Narcissistic people move quickly at the beginning of relationships and rush intimacy to subtly manipulate their partner into feeling attached to them. For example, a narcissistic future faker might say something like, “I could really see us being together forever!” or “You’re exactly the kind of person I want to marry someday” on the first or second date."
    },
    {
      "title": "Their words feel too good to be true.",
      "content": "Their words feel too good to be true. Being the target of future faking can feel like you’re the main character in a magical fairy tale. A narcissistic future faker might make grand statements to make you think this relationship is more special than any other, even if you haven’t been together long; however, it's really just a way to love-bomb you into becoming more involved in the relationship. [6] X Research source For example, you might hear statements like, “I’ve never felt this way about anyone else before,” or “I felt a bond with you the instant we met. We have a soulmate connection.” Love-bombing and idealization are common in narcissistic relationship patterns. Love-bombing means manipulating someone with excessive praise, flattery, and romantic attention."
    },
    {
      "title": "They don’t accept responsibility for their promises.",
      "content": "They don’t accept responsibility for their promises. Usually, couples in a relationship take responsibility for their actions can apologize when they hurt their partner. However, a narcissistic future faker may instead start making excuses for why they can’t follow through on their promises yet without taking any responsibility for making a false promise, letting you down, or betraying your trust. [7] X Research source For example, if you ask a future faker when they’ll be ready to get engaged (or married), they might say something like, “We can start planning after I get a promotion at work,” or “Let’s wait until after my brother gets married.” If you call them out, they may resort to gaslighting and try to blame you instead, claiming that you made a mistake or you’re the reason they can’t uphold their promise yet."
    },
    {
      "title": "Their behavior changes overnight.",
      "content": "Their behavior changes overnight. When your partner is done with future faking, they may abruptly go from warm and affectionate to cold and distant. This is a common reaction among narcissists if you question their over-the-top promises or they decide they’ve already gotten what they wanted from you. Generally, this signifies that a future faker’s feelings aren’t genuine—they likely have a specific manipulative goal in mind. [8] X Research source For example, if you ask your partner whether they’re finally ready to plan that trip you’ve been putting off for years, they might suddenly seem annoyed and tell you to forget about it. No matter why they do it, their behavior change is a choice—not a reflection of you as a partner or person. You’re not at fault when a future faker suddenly starts acting cold and distant."
    },
    {
      "title": "They make you feel isolated from others.",
      "content": "They make you feel isolated from others. As you get swept up in the relationship, a future faker might try to get you to neglect other parts of your life, like your friends, family, or career. People with narcissistic tendencies often want to be the center of your world, so when they manipulate you with future faking, they may want you to pour all your energy into the relationship, leaving none for other people in your life. [9] X Research source For example, if your partner asks you to stop spending so much time with your friends or pushes you to cancel multiple family dinners, that’s a sign they may be trying to limit your time with people outside the relationship. This can be a dangerous tactic because, when you’re isolated from the people in your life, you may not feel like you have a support system to rely on outside the relationship. A new romance is always exciting, but that doesn’t mean it should interfere with the rest of your life or cut you off from other people you care about."
    },
    {
      "title": "Press pause on the discussion if they start making grand promises.",
      "content": "Press pause on the discussion if they start making grand promises. When you feel like you’re starting to get swept up by the excitement of a narcissistic person’s over-the-top future planning, take a break from the conversation—or, alternatively, change the subject . Later, when you’re alone, reflect on the conversation and how it made you feel. If your instincts tell you that your partner may be manipulating you, listen to them. [10] X Research source For example, if you feel that your partner may be future faking and you want to get out of the conversation, take a deep breath and say, “Sorry, but I think we should pause this conversation for now. Let’s talk about something else.” If you ever do encounter a partner who uses future faking, it’s important to trust your feelings. Reflection is helpful because it makes you more self-aware—and helps you spot red flags or narcissistic behavior from your partner."
    },
    {
      "title": "Ask for more details about the plans they propose.",
      "content": "Ask for more details about the plans they propose. If your partner says something that feels too good to be true and makes an unrealistic promise, try to talking to them . Ask them questions! [11] X Research source If they really mean what they say, they’ll be able to give you some details—but if they’re just future faking and manipulating you, they probably won’t have anything to add to their original extravagant idea. For example, if your partner assures you they want to find a place to live with you and move in together, ask questions like, “Do you have a timeframe in mind?” or “Do you know what kind of apartment you’d want to get? Or a budget in mind?” If your partner is serious about getting an apartment, they might not have all the details right away, but they could probably tell you they want to find a place in the next 6 months (for example) or give a rough estimate of their budget. Conversely, if they’re just future faking, they might say things like, “I don’t know off the top of my head. Let’s discuss it more after I know whether I’m getting promoted at work.”"
    },
    {
      "title": "Keep track of your partner’s promises and check in on them.",
      "content": "Keep track of your partner’s promises and check in on them. If you’re concerned about future faking and manipulation, check in with your partner after they make a promise to ensure they still plan to follow through with it. Ask them if they’re any closer to fulfilling that promise and whether they have a plan for doing so. Checking in keeps your partner accountable and shows them they need to truly mean their promises. [12] X Research source For example, your partner might agree to move in together in the next 6 months but say they need to save up money for the move in that time. In that case, check in with them to see if they’re saving money and preparing to look for a new place. If they aren’t future faking, they’re likely saving up money. Even if they don’t save the money, a partner who isn’t future faking will own up to that. They might say, “I’m sorry, I had an unforeseen expense last month. Could we make a new plan and timeline?” On the other hand, a partner who is future faking might shrug you off and say, “Actually, money is tight right now. Let’s revisit this idea next year.”"
    },
    {
      "title": "Point out instances where they’re lying or going back on their word.",
      "content": "Point out instances where they’re lying or going back on their word. If you think your partner is manipulating you and making excuses to back out on their promises, it may help to confront them about it. Some narcissists aren’t totally aware of what they’re doing—or they may keep manipulating you because they think you haven’t noticed. Beat them at their game by showing them you’ve noticed and want it to stop. [13] X Research source For example, if you check in with your partner and ask if they’re ready to book the Caribbean vacation you’ve both been dreaming about, and they make an excuse for the third time, point that out. Say something like, “I just want to make sure this is something you really want to do because I noticed you put it off when I asked 2 months ago—and 3 months before that. Is there an issue I don’t know about?” Be respectful and rely on the facts when you confront your partner; don’t call them a liar or accuse them of anything. Starting a fight may draw out the problem further."
    },
    {
      "title": "Consider ending the relationship if they refuse to take responsibility.",
      "content": "Consider ending the relationship if they refuse to take responsibility. You deserve a partner who is honest with you, makes earnest promises, and is willing to own up to their mistakes. However, relying on a partner who makes empty promises or tries to manipulate you is difficult. If respectfully confronting your partner about their behavior doesn’t change anything, it may be time to consider whether the relationship is right for you . [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Remember, if your partner is a future faker, that doesn’t mean there’s anything wrong with you or that you deserve it somehow. It’s their issue to deal with—and you certainly aren’t obligated to stay with a partner who isn’t honest with you."
    },
    {
      "title": "Future faking is most common in the early stages of a relationship.",
      "content": "Future faking is most common in the early stages of a relationship. The beginning of a relationship typically involves a bonding period where couples find out how well they click, which is why future faking happens most during that time. Future fakers try their hardest to get potential partners to fall for them during that early bonding period and use their grand promises to do it. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Future faking usually dies down as the relationship progresses and settles more. Over time, future fakers spend less time making grand promises and more time coming up with excuses for why they can’t fulfill the promises they’ve already made. Eventually, future fakers may push their partner away or end the relationship entirely (again, without following through on their old promises)."
    }
  ]
}