{
  "url": "https://www.wikihow.com/Get-Rosy-White-Skin",
  "title": "How to Get Rosy White Skin",
  "steps": [
    {
      "title": "Apply sunscreen with SPF 30 or higher each day to keep your skin fair and prevent sun damage.",
      "content": "Apply sunscreen with SPF 30 or higher each day to keep your skin fair and prevent sun damage. [1] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. Choose a sunscreen that's water resistant and offers broad-spectrum protection for the best results. Apply it liberally each morning whether you're planning to spend time outside or not. Going outside without sunscreen, even for just 5 minutes a day, eventually adds up! Your skin won't stay as white as you like unless you keep it well-protected at all times. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Limit your exposure to sunlight.",
      "content": "Limit your exposure to sunlight. Try to stay indoors between 10am and 2pm, since that's when the sun's rays are the strongest and most damaging. When you're outside, try to stay in shady areas. Wear protective clothing like lightweight long-sleeved shirts and sunglasses, if possible, for even more protection. [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Completely avoid using tanning beds."
    },
    {
      "title": "Wash and exfoliate your skin regularly.",
      "content": "Wash and exfoliate your skin regularly. Use a mild facial cleanser twice daily, in the morning and before bed, to keep your skin looking fresh and light. Exfoliate gently a few times every week to slough away dead skin cells that are often dark and damaged, revealing a brightened complexion. Exfoliating may also give your cheeks a rosy glow by improving blood circulation. [4] X Research source Be sure to exfoliate gently! Exfoliating too vigorously can cause red, irritated skin."
    },
    {
      "title": "Stop smoking",
      "content": "Stop smoking to brighten your complexion. Over time, cigarette smoke can cause fine lines and wrinkles, making skin look dull and tired. Smoking also prevents blood from flowing properly to the face area, which can give your skin a greyish cast. Quitting smoking can brighten up your skin and make it look fairer."
    },
    {
      "title": "Stay hydrated to keep your skin looking bright and fresh.",
      "content": "Stay hydrated to keep your skin looking bright and fresh. [5] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. Try to drink at least 6 to 8 glasses of water each day to keep your skin looking fresh and supple. Staying well-hydrated also helps your skin rejuvenate faster, keeping the top layers of skin lighter and brighter."
    },
    {
      "title": "Exercise regularly for a healthy glow.",
      "content": "Exercise regularly for a healthy glow. Working up a sweat can keep your skin looking healthy and fresh by increasing blood flow. The increased blood flow carries oxygen to your skin cells, nourishing them and carrying away free radicals and other cellular debris. [6] X Research source"
    },
    {
      "title": "Try over-the-counter skin lightening creams.",
      "content": "Try over-the-counter skin lightening creams. Face creams that contain kojic acid, glycolic acid, alpha hydroxy acids, vitamin C and arbutin can help your skin reduce melanin, which is pigment responsible for tan skin, freckles, and brown spots. Apply the cream of your choice according to the product's instructions. If you experience skin irritation, stop using the cream and consider visiting a dermatologist."
    },
    {
      "title": "Apply retinoid creams.",
      "content": "Apply retinoid creams. You can buy retinoid creams at most drug stores or visit your dermatologist for a prescription cream, which will be much stronger than the over-the-counter varieties. Retinoids work by speeding up cell turnover and exfoliating the top layer of skin, making skin looking brighter, fresher, and more youthful. [7] X Expert Source Adarsh Vijay Mudgil, MD Board Certified Dermatologist & Dermatopathologist Expert Interview. 8 October 2020. Retinoids can make your skin very sensitive to sunlight, so be sure to use a good sunscreen every day to protect your skin."
    },
    {
      "title": "Visit your dermatologist for a chemical peel.",
      "content": "Visit your dermatologist for a chemical peel. Chemical peels slough away the top layers of skin, resulting in lighter, brighter, and more youthful looking skin. These peels are pretty harsh, so expect to have sensitive, red skin for a few days after the procedure. Stay out of the sun and apply your sunscreen liberally to protect your skin after the procedure."
    },
    {
      "title": "Try microdermabrasion sessions with your dermatologist.",
      "content": "Try microdermabrasion sessions with your dermatologist. Microdermabrasion is a form of extreme exfoliation that is best performed by a licensed professional. The procedure polishes the top layers of skin, sloughing away dark and damaged cells and revealing a brighter, fresher look. You'll probably need between 6 and 12 treatments before you see real results. Luckily, each treatment only takes about 15 minutes! Your skin will be very sensitive after the procedure, so stay out of the sun."
    },
    {
      "title": "Mix tomatoes and lemon juice to lighten your skin.",
      "content": "Mix tomatoes and lemon juice to lighten your skin. Chop a large tomato into 4 sections, and toss them into a blender. Pour in 1–2 US tbsp (15–30 mL) of natural lemon juice, and mix them together into a paste. Apply the mask to your entire face, and let it sit for 20-30 minutes. Then, wash off the tomato and lemon juice with cool water. [8] X Research source The tomato plant contains lycopene, a natural chemical compound that protects your skin from the sun. It gives tomatoes their rich, red color. Lemon contains natural lightening agents and antibacterial properties. Do this once a week for several months, and you may notice that your skin looks lighter."
    },
    {
      "title": "Spray a mix of lemon juice and water on your skin to lighten it.",
      "content": "Spray a mix of lemon juice and water on your skin to lighten it. Get a small, cosmetic spray bottle, and mix one part fresh-squeezed lemon juice with 4 parts water. After you wash your face, spray a light, even layer of the mixture over your skin. The acidity of the lemon juice can naturally lighten the pigment of your skin. It may take 4 or more weeks to notice any difference in your skin. Use a hand juicer if you want to juice your lemons yourself. Cut the lemon in half, and push it into the juicing section. Twist the fruit back and forth slightly to release the juice."
    },
    {
      "title": "Create a papaya face mask for a nourishing, exfoliating option.",
      "content": "Create a papaya face mask for a nourishing, exfoliating option. To make the mask, peel away the papaya skin with a sharp knife, use a spoon to scoop out the seeds, and slice it into small chunks. Throw the chunks into a blender, and blend the papaya into a smooth paste. Then, scoop the papaya with a spoon and apply a thin, even layer across your face. Let the mask sit for 20 minutes, then rinse it away with warm water. [9] X Research source Papaya nourishes your skin with a high concentration of vitamin C, which can help lighten skin over time."
    }
  ]
}