{
  "url": "https://www.wikihow.com/Get-Motor-Oil-Off-a-Cat",
  "title": "How to Get Motor Oil Off a Cat",
  "steps": [
    {
      "title": "Look for signs of poisoning before you start washing.",
      "content": "Look for signs of poisoning before you start washing. If your cat has ingested motor oil and appears sick, you should go to the vet right away. Don’t wait until after you’ve finished washing the oil off. The following signs are good indications that your cat has been poisoned by the motor oil: [1] X Research source Stomach-related symptoms including vomiting, diarrhea, drooling, or cries of pain when you touch its abdomen. Behavioral symptoms such as confusion, dizziness, lethargy, pawing at its muzzle, and/or difficulty walking. More severe symptoms like extreme difficulty breathing, loss of consciousness, or an irregular heartbeat. You will also notice greasy, dark material on its hair, coat, or paws, and you may smell motor oil."
    },
    {
      "title": "Remove your cat’s collar.",
      "content": "Remove your cat’s collar. It’s likely that your cat’s collar has also been contaminated by the motor oil. This will need to be washed as well. Once you’ve removed it, set it aside to deal with later. Depending on the material, you can either hand wash your cat’s collar with dish soap and water or run it through the washing machine."
    },
    {
      "title": "Grab your cat’s scruff gently to restrain it.",
      "content": "Grab your cat’s scruff gently to restrain it. Put your cat on a stable, flat surface. Keep your cat calm by speaking to it in soothing tones. Take the loose skin at the back of your cat’s neck in your hand and tighten your grip. Your hand should be close to the ears, and the ears should move back slightly when you close your hand. [2] X Research source This grip should help prevent your cat from biting or scratching you while you handle it. Never pick an adult cat up by its scruff, as this could injure the cat."
    },
    {
      "title": "Clip off",
      "content": "Clip off thoroughly contaminated fur. If the oil is sticky or has caused mats to develop in your cat’s fur, you may need to clip it off. This is the fastest and most effective way to remove large amounts of motor oil. Without using pressure, lightly graze the electric clippers in the same direction that your cat’s fur lies. [3] X Research source Clip off only the matted fur without shaving down to your cat’s skin. [4] X Research source Do not use scissors to clip off the affected fur, as you may accidentally cut the cat. Only clip off your cat’s fur if you already have a pair of electric pet clippers at home that you can use immediately. It’s best to get the oil off as quickly as possible, so go to the vet if there are mats of oily fur you can’t remove."
    },
    {
      "title": "Cover the oily area with vegetable oil.",
      "content": "Cover the oily area with vegetable oil. For smaller areas of motor oil or oily spots that remain after you’ve finished clipping, you can remove the oil with oil! Only use vegetable oil, as it's safe for cats to consume in small doses. Pour a small amount in your hand and rub the oil into the fur that’s been affected. Do not use other oil products (such as essential oils) on your cat."
    },
    {
      "title": "Bathe your cat with warm water and mild dish soap.",
      "content": "Bathe your cat with warm water and mild dish soap. Transfer your cat to the kitchen sink. This will give you enough space but should also make it a little easier to control your cat. Cover your cat in warm water and then lather the soap into their wet fur. Rinse and repeat as many times as you need to completely remove all traces of both types of oil. As you bathe the cat, check for any burns or scalding to its skin and any signs of skin irritation, such as redness or scabs. Be sure to use dish soap, as it contains degreasers that will remove the oils. Most regular soaps do not contain degreasers. Continue using the scruff hold to restrain your cat."
    },
    {
      "title": "Dry your cat thoroughly and keep it warm.",
      "content": "Dry your cat thoroughly and keep it warm. Use a fluffy towel to get as much water as possible off your cat. Once it’s no longer dripping, keep it in a warm room until it’s completely dry. You can also try wrapping your cat in a blanket to keep it warm while it dries."
    },
    {
      "title": "Observe your cat for 24 hours for signs of poisoning.",
      "content": "Observe your cat for 24 hours for signs of poisoning. If your cat hasn’t shown signs of poisoning after twelve hours, it’s likely that they’re okay. However, watch your cat for a full day and night to be safe. If your cat begins panting, coughing, or vomiting, call your vet right away."
    },
    {
      "title": "Go to the vet right away if your cat appears to be poisoned.",
      "content": "Go to the vet right away if your cat appears to be poisoned. If you think your cat has consumed any of the motor oil that’s on its fur, go to the vet. It’s much better to be safe than sorry. If your cat is vomiting, has diarrhea, isn’t breathing normally, or has an irregular heartbeat, get to the vet’s office as quickly as possible. [5] X Research source If you see your cat licking itself before you have a chance to remove the motor oil, go to the vet. If your vet’s office isn’t open, go to an emergency vet clinic. Do not attempt to make your cat vomit before you visit the vet! Some products can actually permanently damage your cat’s esophagus."
    },
    {
      "title": "Expect the vet to remove the motor oil.",
      "content": "Expect the vet to remove the motor oil. Your cat will be clipped and bathed at the vet’s office, just as it would have been at home. Depending on your cat’s condition, your vet will either do this right away or take care of urgent medical issues first. [6] X Research source The vet may also provide you will topical antibiotics that you’ll need to put on your cat’s skin to prevent infection."
    },
    {
      "title": "Wait for the results of diagnostic tests and scans.",
      "content": "Wait for the results of diagnostic tests and scans. The vet will order a complete blood profile, a urine test, and an electrolyte panel. Each of these tests will help your vet determine which of your cat’s organs are being affected by the motor oil. Since motor oil can sometimes cause pneumonia in cats, your vet may also order an X-ray to see if your cat has built-up fluid in its lungs. [7] X Research source If your cat vomited at home, take a sample of the vomit for your vet to test. You can collect it with a resealable plastic bag. Be sure to wash your hands after you’ve gotten the sample. This may help your vet treat your cat more quickly."
    },
    {
      "title": "Allow your vet to give your cat activated charcoal.",
      "content": "Allow your vet to give your cat activated charcoal. The charcoal will help absorb the motor oil and halt any damage it’s causing in your cat’s system. If your cat ate the motor oil recently, your vet may also flush your cat’s stomach. [8] X Research source"
    },
    {
      "title": "Give more severely affected cats oxygen therapy.",
      "content": "Give more severely affected cats oxygen therapy. If your cat is struggling to breathe, oxygen therapy may help stabilize it while the motor oil is removed from its system. This treatment can only be given at your vet’s office, so your cat will need to stay there for as long as the oxygen therapy is necessary. [9] X Research source Sometimes IV fluids will also be given to support the cat's internal organs."
    },
    {
      "title": "Continue to observe your cat once you return home.",
      "content": "Continue to observe your cat once you return home. If your vet allowed you to take your cat home, you’re probably in the clear. However, it’s a good idea to monitor them closely for the next several days to make sure they’re healing from their ordeal. If you see them panting, coughing, or if they have an increased heart rate, take them back to the vet right away. [10] X Research source"
    },
    {
      "title": "Keep car-related products in a locked cabinet.",
      "content": "Keep car-related products in a locked cabinet. We all know that cats are curious! If you keep antifreeze, motor oil, or gasoline in a place where your cat could knock them over, chances are that it will happen at some point. Antifreeze actually gives off a sweet smell that attracts animals and makes them want to eat it, so it’s especially dangerous to leave out. [11] X Research source For extra protection, use a child-safe lock. Usually, if it can keep out small children, it can keep out pets."
    },
    {
      "title": "Clean up oil spills right away.",
      "content": "Clean up oil spills right away. If your car has leaked oil in your garage or driveway, you can use cat litter to absorb it. Pour a healthy amount of litter over the entire spill. Confine your cat to your house to keep it away from the oil while the litter does its job. After about 6 to 8 hours, sweep up the litter and absorbed oil. You can then use dish soap and water to scrub off any remaining oil residue."
    },
    {
      "title": "Dispose of car-related products at hazardous waste centers.",
      "content": "Dispose of car-related products at hazardous waste centers. When throwing away motor oil , gasoline, or antifreeze, it’s best not to use your normal trash can. These materials can be flammable and harmful to the environment. [12] X Research source Your cat could also easily sneak into your trash can and consume them! Put this type of waste in airtight containers and take them to a hazardous waste center. If you don’t know where to find your local waste center, call your trash disposal company. They’ll point you in the right direction."
    },
    {
      "title": "Consider keeping your cat indoors.",
      "content": "Consider keeping your cat indoors. Most cats get motor oil on them when they’re roaming around outside. While outdoor cats can live long and happy lives, indoor cats are generally safer and suffer less health problems and injuries. So long as you entertain your cat with toys and interaction, they can be completely content to stay inside all the time! [13] X Research source"
    }
  ]
}