{
  "url": "https://www.wikihow.com/Deal-With-Your-Dad%27s-Girlfriend",
  "title": "How to Deal With Your Dad's Girlfriend",
  "steps": [
    {
      "title": "Adjust your routine.",
      "content": "Adjust your routine. If you live with your dad, his dating life can really impact your everyday life. Even if you only live with him part time, a new person in your environment takes some getting used to. If it seems like your dad's girlfriend is always around, you might want to alter your routine. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Maybe it seems like she is always watching tv when your favorite shows are on. Ask her politely if she would mind hanging out in another room while you relax with your show. Or watch it later on DVR. You could also change your routine. For example, if you feel like she is always in the kitchen whenever you are trying to make a snack, start changing your habits. Grab something on your way out the door instead of sitting down to eat. Changing your routine is probably not the best long term solution. But in the early days of getting to know someone, it can be helpful. When you are getting used to your dad's girlfriend being around, feel free to take a time out if necessary. Go to your room or for a walk if you find yourself needing some room to breathe."
    },
    {
      "title": "Protect your space.",
      "content": "Protect your space. When someone new enters your household, it is sometimes necessary to identify boundaries. One way that you can do this is to define what counts as your space. You can have physical space (such as your room) and also emotional space. [2] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you have your own room at your dad's house, ask that his girlfriend respect your privacy. Tell her if your door is closed, that means you are having alone time. Your emotional space is also important. If she is trying to discipline you, speak up for yourself. For example, if your curfew is 11 p.m., but she tells you to be home by 10, address the situation calmly. Try saying, \"Actually, my dad requires me to be home by 11. I'll stick to his rules, thanks.\""
    },
    {
      "title": "Assert your needs.",
      "content": "Assert your needs. It can be confusing when your dad starts dating. Don't be afraid to let him know how his romantic life impacts you. Ask that he please not introduce you to every new woman that he dates. [3] X Research source If your dad is in a serious relationship, it makes sense that you will be around his girlfriend. But you don't need to meet everyone he takes to dinner. Try saying, \"Dad, I understand you need to socialize. But it makes me uncomfortable to make small talk with women I don't know. Please only introduce me to a serious girlfriend.\" Choose your words carefully. Think about what you want to say ahead of time. This will help ensure that your message is clear."
    },
    {
      "title": "Voice your concerns.",
      "content": "Voice your concerns. There are many different ways that your dad's girlfriend can interfere with your life. Maybe she is teasing you, or offering you unwanted advice. She could also be trying to discipline you in ways that don't work for your family. Whatever the problem is, you should clearly articulate your concerns. [4] X Research source Talk to your dad about the problem. Be clear and specific. Try saying, \"Dad, Mary has been teasing me about liking boys. This is not a topic I want to discuss with her. Please ask her to stop.\" When you are voicing your concerns, explain your feelings. Say, \"It makes me angry when Mary interrupts me while I'm talking.\" Follow that by offering an idea for a solution. Try, \"Dad, it would be great if you could explain to her that we don't talk to each other like that in our house.\""
    },
    {
      "title": "Make yourself heard.",
      "content": "Make yourself heard. Sometimes simply voicing your concerns is not enough. As a young person, it can be difficult to get adults, even your parents, to take you seriously. Make it clear that this situation in a big problem for you and you will not continue to be ignored. Schedule a time to talk. You want to have your dad's full attention. Say, \"Dad, I need to talk to you about my conflicts with Tina. When is a good time for you?\" Give him a chance to think. Don't demand a solution immediately. Say, \"Dad, I know you're in a difficult spot. But I really need your help, so please get back to me with a plan within a couple of days.\" If your dad refuses to speak with you, talk to another adult. Ask your mom or another family member to be with you while you talk to your dad."
    },
    {
      "title": "Be realistic.",
      "content": "Be realistic. Whether you're almost ready for college or a pre-teen, dealing with your parents' divorce can be difficult. It will likely cause a lot of changes in your life, and maybe even your living situation. As much as you might want your parents to get back together, the first step in coping with divorce is to face the reality of the situation. Face the realities of your dad having a girlfriend. Whether this is a new relationship or one that has been going on for a while, it is important to accept that she is now in your life. Accepting reality doesn't mean you can't improve the situation. It simply means that you are acknowledging that things have changed. Once you have accepted the fact that your dad is dating, you can begin to take steps to handle the situation in a positive way."
    },
    {
      "title": "Keep living your life.",
      "content": "Keep living your life. It can take some time to sort through your feelings. That is normal. But in the meantime, don't let your dad's dating life consume you. Remember that you have other things in your life to focus on. Spend time with your friends. Dealing with your dad's girlfriend can be stressful. Having fun with your friends can help relieve the pressure. Find a new hobby. Having a new focus in your life can help take your mind off of your worries. Try out for a sports team or join a club at school. Being around other people can also be a great stress relief. Make a list of the good things in your life. When you feel upset about your dad's girlfriend, look at the list and choose an item to focus on."
    },
    {
      "title": "Find a support system.",
      "content": "Find a support system. It can be challenging to deal with your dad's girlfriend. Maybe she chats nervously and doesn't let you get a word in edgewise. Or maybe she has no interest in you at all. Whatever your situation is, it's important that you have other people to rely on. [5] X Research source Remember that your individual situation is different from other people's experience. But that doesn't mean that they can't support you. Turn to a trusted family member for support. Maybe you have a favorite aunt that you are close to. Tell her you're having a tough time and could use someone to talk to. Rely on your friends. Having divorced parents is very common. It's also common that they will date other people. Ask a friend to tell you about her experience. Knowing that someone else has experienced this transition can be very helpful."
    },
    {
      "title": "Set boundaries.",
      "content": "Set boundaries. Your dad's girlfriend may be an important part of his life. But if she is a new addition to your family unit, it may be necessary to set boundaries. Family holidays, vacations, and events such as weddings are particularly important to manage. [6] X Research source Remember that everyone's situation is different. Maybe you don't mind if your dad's long time girlfriend comes along on the family vacation. But if you do, speak up. Make your feelings clear. Be firm but kind. Try saying something like, \"Dad, our time at the cabin is really special to me. If you want to bring Susan for the last two days, that's fine. But I'd appreciate it if you devote most of the week to just spending time with our family.\" Holidays can be especially emotional. If your dad has a new girlfriend, don't feel like you have to include her in every event. If you have an annual cocktail party that includes friends and extended family, by all means, she should be invited. But that doesn't mean she has to attend gift opening with your kids on Christmas morning."
    },
    {
      "title": "Be flexible.",
      "content": "Be flexible. Being an adult doesn't always mean that you will feel comfortable dealing with your dad's girlfriend. However, it does mean that you are probably emotionally mature enough to find ways to compromise. Talk to your dad about the situation and try to find solutions that work for everyone. [7] X Research source Weddings can be a difficult social occasion to navigate, even under the best of circumstances. If there is a family wedding coming up, talk to your dad about the proper role for his girlfriend. If it is your wedding, you should be able to decide who you want there. However, unless you have a good reason, it's probably not fair to completely exclude the girlfriend. Be flexible by inviting her to the wedding. But you don't have to include her in the intimate details of the day, such as helping you get ready. Family pictures can also be tricky. Try to pick a standard to stick to. For example, someone who hasn't been part of the family dynamic for at least several months might not need to be in the picture. Talk to your dad about what feels right for everyone. Consider the duration of the relationship. It's understandable if you don't feel comfortable having your dad's new girlfriend involved in intimate family events. The longer the relationship lasts, the more flexible you should be. If the couple has been together for a year or more, it's probably time to start allowing her to be more active in the family."
    },
    {
      "title": "Have an open conversation.",
      "content": "Have an open conversation. Once you have figured out your emotions, you can move forward on trying to build a relationship. Hopefully, you have had some time to consider what you want that relationship to be. Are you looking for her to be your friend? Or to take on more of a friendly aunt role? Start spending time together. It is perfectly appropriate for you to initiate a conversation about what role you will play in each others' lives. Schedule a time to talk. Try saying, \"Hey, Tracy, I was wondering if you have some time to sit down and have a conversation with me this week.\" Let her know what you need from her. It's ok to say, \"I already have a mother. But I am open to having a different kind of relationship with you.\" Be open and honest. Remember to also be respectful."
    },
    {
      "title": "Plan fun activities.",
      "content": "Plan fun activities. Having a good time can be a great way to bond. Ask your dad's girlfriend to join you in an activity that you enjoy. You can either plan something in advance or offer a spontaneous invitation. [8] X Research source Next time you are heading to the gym, ask her to come along. You can say, \"Hey, Tracy, I love my kickboxing class. Do you want to come?\" If you need to take things slow, go see a movie together. You'll be hanging out together, but you won't feel pressure to make conversation the entire time. Do some everyday activities together. It can be fun to have someone to make dinner with or to watch your favorite tv shows with."
    },
    {
      "title": "Get to know her better.",
      "content": "Get to know her better. In order to build a relationship with someone, it is important that you get to know them. Try thinking of her as an individual, rather than just your dad's girlfriend. Start by learning more about her. Getting to know someone can be as simple as learning her likes and dislikes. It might turn out that you have something in common. For example, you could ask her to go out for ice cream. If it turns out you both have the same favorite flavor, that's a really simple thing to bond over. After you feel a little more certain of your new relationship, you can delve a little deeper. Try asking her about her job or her family. Maybe your dad has been dating this woman for a long time and you think you already know her. Spend time with her anyway. It's always possible to learn something new about a person."
    },
    {
      "title": "Be prepared to compromise.",
      "content": "Be prepared to compromise. Compromise is important in any relationship. Maybe you are upset because when your dad spends time with her, it takes away from time he could spend with you. Propose a compromise by asking if he can take a day off of work to spend with you. [9] X Research source If you find yourself arguing with your dad's girlfriend, take a step back and consider the situation. There is likely a situation that could be workable for both of you. For example, maybe you disagree on where to go for dinner. Try coming up with an alternative restaurant that sounds good to everyone. If the conflict is more serious, take a time out. Once you have calmed down, ask if you can talk about a way to compromise."
    },
    {
      "title": "Reflect on your emotional needs.",
      "content": "Reflect on your emotional needs. Dealing with your dad's girlfriend can feel confusing and even awkward. It's important to understand that feeling a wide range of emotions is completely normal. Spend some time thinking about how you are feeling and how it is affecting your life. This will help you figure out how to communicate your feelings. [10] X Research source Examining your feelings can help you figure out what you need. For example, are you feeling jealous? Maybe spending more time with your dad would help. Perhaps you are feeling confused. Sometimes you might actually enjoy being around your dad's girlfriend, but that makes you feel like you are betraying your mom. Try keeping a journal. Each day, write down the events of the day and how they made you feel. Take some time each week to flip through your journal and review your thoughts. This can help you figure out what your major concerns are."
    },
    {
      "title": "Consider the other point of view.",
      "content": "Consider the other point of view. Your feelings about dealing with your dad's girlfriend are very important. Your emotions are valid, whatever they are. But remember that the other people involved have feelings, too. [11] X Research source When you are figuring out how to handle this situation, it's a good idea to consider other viewpoints. For example, how does your dad feel? Maybe your dad has explained to you that is girlfriend is an important part of his life. If that's the case, you might want to spend some time thinking about how he feels. Your dad probably has some good reasons for liking this woman. Try to look at her from a new point of view. You could also take the girlfriend's feelings into account. It's possible that she is nervous around you. Try to imagine how she feels. It could be difficult for her to try to fit in with you and your dad."
    },
    {
      "title": "Talk to your dad.",
      "content": "Talk to your dad. One of the keys to dealing with this complex situation is to have an open line of communication. It's important to let your dad know how you are feeling about his girlfriend. Take some time to talk to him about your emotions. Make your feelings clear. Use statements such as, \"Dad, it makes me feel left out when you spend so much time with Tracy.\" Try writing down what you want to say ahead of time. It can be difficult to have an open conversation. It can relieve your stress if you plan ahead. Remember that your emotions are valid. Just try to explain them in a constructive way. Instead of saying, \"I hate her!\", be more specific. Say, \"It makes me sad when she ignores me or talks down to me.\""
    },
    {
      "title": "Be a good listener.",
      "content": "Be a good listener. Give your dad a chance to respond. Chances are, this is a difficult situation for him, too. Let him know that you respect his feelings. [12] X Research source If you don't understand his point of view, ask questions. You have a right to understand the situation. For example, try saying, \"Dad, I don't understand why you go on vacations with just your girlfriend. Would it be possible to include me and my sister some time?\" Demonstrate that you are listening by using positive body language. Nod your head and maintain eye contact."
    },
    {
      "title": "Maintain a relationship with your dad.",
      "content": "Maintain a relationship with your dad. Remember that having a relationship with your father is a priority. If it wasn't, it wouldn't matter that he has a girlfriend. Make a point to keep your bond strong. [13] X Research source Schedule time to hang out with just your dad. Ask him if the two of you can go on a hike or go to a ball game together. If you don't get to see your dad very often, find other ways to communicate. Keep in touch via text, e-mail, or video chat."
    }
  ]
}