{
  "url": "https://www.wikihow.com/Determine-Your-Body-Shape",
  "title": "How to Determine Your Body Shape",
  "steps": [
    {
      "title": "Remove your clothing or wear a camisole and pair of underwear.",
      "content": "Remove your clothing or wear a camisole and pair of underwear. To get accurate measurements, it helps to have little to no clothing on. Strip down to your underwear if you’re able, or put on something light and form-fitting, such as a tank top and a pair of leggings. [1] X Research source You may also find it helpful to look in a mirror while you take your measurements. This will help you to determine if you’re positioning the measuring tape properly."
    },
    {
      "title": "Measure around the fullest part of your chest.",
      "content": "Measure around the fullest part of your chest . Use a soft, flexible measuring tape to take all of the measurements in inches or centimeters. Wrap the measuring tape around the fullest part of your bust, which is usually the area of your chest that's level with your nipples. Keep the measuring tape snug around your chest, but don’t pull it so tight that you’re squeezing your breasts or chest. Check the measurement and record it. [2] X Research source Some people also take the shoulder measurement into account when determining their body type, but it's optional. If your shoulders are wider than your bust, waist, and hips, you might be you might be an inverted triangle type. Take a shoulder measurement to help you determine if you are."
    },
    {
      "title": "Locate the smallest part of your waist and measure it.",
      "content": "Locate the smallest part of your waist and measure it. This is usually just below your ribs and about 2–3 in (5.1–7.6 cm) above your belly button. Wrap the measuring tape around this part of your body and record the measurement in inches or centimeters. [3] X Research source Make sure that the measuring tape is not too tight. Check to ensure that it’s snug, but that you can still fit 1 finger in between the measuring tape and your skin."
    },
    {
      "title": "Identify the widest part of your hips and measure them.",
      "content": "Identify the widest part of your hips and measure them . This is usually at the level of your crotch. Wrap the measuring tape around your hips at this point and record the measurement in inches or centimeters. [4] X Research source"
    },
    {
      "title": "Compare the 3 measurements to determine which is the largest and smallest.",
      "content": "Compare the 3 measurements to determine which is the largest and smallest. Rank your bust, hip, and waist measurements from largest to smallest to help you visualize the shape of your body. However, if the difference between 2 measurements is 1 in (2.5 cm) or less, consider them equal. For example, if your bust was 34 in (86 cm), your waist was 38 in (97 cm), and your hips were 48 in (120 cm), then your hips were the largest and your bust was the smallest measurement. You may have a couple of measurements that are very close or even equal. Note this as well since it will affect your body type. For example, if your bust was 38 in (97 cm) and your hips were 39 in (99 cm), but your waist was 42 in (110 cm), then your bust and hips are about equal and your waist is the largest measurement."
    },
    {
      "title": "Identify yourself as a pear-shape if your bust and waist are smaller than your hips.",
      "content": "Identify yourself as a pear-shape if your bust and waist are smaller than your hips. If your hips are the largest of the 3 measurements, and your bust and waist are equal in size or if your bust is smaller than your waist, you’re a pear shape. This is also known as a triangle shape and it’s a very common body type. [5] X Research source For example, if your bust is 32 in (81 cm), your waist is 34 in (86 cm), and your hips are 40 in (100 cm), then you’re a pear shape."
    },
    {
      "title": "See if you’re an inverted triangle if your bust is larger than your waist and hips.",
      "content": "See if you’re an inverted triangle if your bust is larger than your waist and hips. This shape is the opposite of the pear or triangle shape. In an inverted triangle, the chest and/or shoulders are wider than the waist and hips. This is a common body type for athletic men and women, but some people may naturally have this body type. [6] X Research source For example, if your bust is 40 in (100 cm), your waist is 36 in (91 cm), and your hips are 35 in (89 cm), then you’re an inverted triangle shape."
    },
    {
      "title": "Call yourself a square if your bust, waist, and hips are all about the same size.",
      "content": "Call yourself a square if your bust, waist, and hips are all about the same size. If there’s no more than a 2 in (5.1 cm) difference between your bust, waist, and hips, then you’re likely a square shape. This is a common shape for people who are athletic and for young girls. However, some people naturally have this shape. [7] X Research source For example, if your bust is 36 in (91 cm), your waist is 35 in (89 cm), and your hips are 37 in (94 cm), then you’re a square shape."
    },
    {
      "title": "Know that you’re apple shaped if your waist is wider than your bust and hips.",
      "content": "Know that you’re apple shaped if your waist is wider than your bust and hips. If your waist is 2 in (5.1 cm) larger than your hips and bust, you may be an apple shape. Some people with apple-shaped bodies have slim hips and slender legs as well. If you’re a woman, you might also have a full bust. [8] X Research source For example, if your bust is 42 in (110 cm), your waist is 48 in (120 cm), and your hips are 40 in (100 cm), then you’re an apple shape."
    },
    {
      "title": "Identify yourself as an hourglass if your waist is smaller than your bust and hips.",
      "content": "Identify yourself as an hourglass if your waist is smaller than your bust and hips. Hourglass shapes usually have bust and hip measurements that are about the same size, and their waist measurement is noticeably smaller than the bust and hip. This creates a noticeable curving silhouette going from the bust to the waist and hips. [9] X Research source For example, if your bust is 38 in (97 cm), your waist is 30 in (76 cm), and your hips are 40 in (100 cm), then you’re an hourglass shape."
    },
    {
      "title": "Draw a shape that represents your measurements if you’re unsure.",
      "content": "Draw a shape that represents your measurements if you’re unsure. If you’re having trouble determining your shape, try creating a scaled down drawing of your silhouette. Draw 3 parallel lines on a piece of paper that are each 1/10th of the size of your measurements. Space them so that the lines are each 2 in (5.1 cm) apart. Then, connect the edges of the lines to see what shape they create. For example, if your measurements were 32 in (81 cm), 36 in (91 cm), and 44 in (110 cm), then your lines would be 3.2 in (8.1 cm), 3.6 in (9.1 cm), and 4.4 in (11 cm). Connecting the ends of these 3 lines creates a pear or triangle shape."
    }
  ]
}