{
  "url": "https://www.wikihow.com/Feel-Better-After-Throwing-Up",
  "title": "What to Do After Throwing Up: How to Feel Better Fast",
  "steps": [
    {
      "title": "Refrain from eating or drinking for 15 minutes to let your stomach rest.",
      "content": "Refrain from eating or drinking for 15 minutes to let your stomach rest. Your stomach muscles will feel sore after you throw up, especially if you vomited a lot. Letting your stomach rest and calm down will reduce the risk of you vomiting again when you do try to eat. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source It’s okay to rinse your mouth with a little bit of water to get rid of the taste of vomit after you throw up. Just try to avoid swallowing any of it for the first 15 minutes."
    },
    {
      "title": "Drink small sips of water or suck on ice chips to prevent dehydration.",
      "content": "Drink small sips of water or suck on ice chips to prevent dehydration. After 15 minutes have passed and you haven’t vomited again, start taking sips of water every 5 to 10 minutes to get fluids back into your system. Vomiting causes you to lose a lot of water, so it’s important to rehydrate your body as soon as you’re able to. [2] X Research source If you start vomiting again after drinking water, stop drinking and wait another 15 to 20 minutes before trying again. Try sipping on weak teas, sports drinks, or clear soft drinks without carbonation at this stage to put a different flavor in your mouth."
    },
    {
      "title": "Chew on a piece of fresh ginger or sip a cup of ginger tea.",
      "content": "Chew on a piece of fresh ginger or sip a cup of ginger tea. Ginger has antiemetic properties, which means that it can help to stop nausea and vomiting. If you have some fresh ginger around, cut off a 0.5 in (1.3 cm) piece and chew on it or use it to make ginger tea . [3] X Research source To chew on the ginger, cut off the skin with a knife and place the whole piece in your mouth. To brew tea, steep cut ginger in boiling water for 10 minutes."
    },
    {
      "title": "Try eating bland, soft, starchy foods 8 hours after you’ve stopped vomiting.",
      "content": "Try eating bland, soft, starchy foods 8 hours after you’ve stopped vomiting. Wait until you can keep liquids down for 8 hours without vomiting before you try eating. When you’re ready to eat, start with the BRAT diet —eating foods that are easy to digest, like bananas, rice, applesauce, and toast. [4] X Research source The BRAT (Bananas, Rice, Applesauce, and Toast) Diet is recommended for people suffering from an upset stomach."
    },
    {
      "title": "Eat small meals every 2 to 3 hours to slowly return to a normal diet.",
      "content": "Eat small meals every 2 to 3 hours to slowly return to a normal diet. Focusing on smaller meals puts less strain on your stomach than eating a big meal every 6 to 8 hours. Try eating small meals composed of mashed potatoes, rice, cream soup, pretzels, and low-fat pudding. Try to only eat foods cold or at room temperature for the first 24 hours after vomiting to minimize the risk of upsetting your stomach again. [5] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source Avoid fried, greasy, acidic, and sweet foods until you’re vomit free for 48 hours. [6] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source"
    },
    {
      "title": "Avoid caffeine, tobacco, and alcohol until your stomach feels better.",
      "content": "Avoid caffeine, tobacco, and alcohol until your stomach feels better. Caffeine, alcoholic drinks, and tobacco products can irritate your stomach and potentially cause you to start vomiting again. To be safe, avoid consuming these products for at least 24 to 48 hours after you’ve stopped vomiting. [7] X Trustworthy Source American Cancer Society Nonprofit devoted to promoting cancer research, education, and support Go to source If you’re lactose intolerant or sensitive to dairy, also refrain from eating dairy products."
    },
    {
      "title": "Rest in an upright seated position with your head elevated.",
      "content": "Rest in an upright seated position with your head elevated. Moving around after you vomit can make you feel more nauseous, so do your best to stay still. Prop yourself up and rest in a seated position with your head elevated about 12 inches (30 cm) above your feet to help your body recover. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid lying down in a flat position to rest, even if you vomit in the middle of the night; this may inadvertently cause you to start throwing up again. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Stay in this resting position for at least an hour or until your stomach no longer feels nauseous. If you vomit at night, try sleeping upright in a recliner or watching TV in a seated position until you feel well enough to go back to bed."
    },
    {
      "title": "Place a cool compress over the back of your neck.",
      "content": "Place a cool compress over the back of your neck. Hold a clean washcloth under cool, running water until it’s soaked. Then, wring the washcloth out and fold it in half. Lay the cloth across the back of your neck and keep it there for 5 to 10 minutes to soothe your nervous system and lower your body temperature. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid strong or unpleasant smells until you’re no longer nauseous.",
      "content": "Avoid strong or unpleasant smells until you’re no longer nauseous. Tobacco smoke, strong perfumes, or spicy-smelling foods can cause vomiting if you’re already nauseous. Limit your exposure to these kinds of scents until you’ve gone at least 24 hours without vomiting. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hot foods tend to have stronger scents than cold foods, so avoid heating up leftovers or cooking while you’re nauseous."
    },
    {
      "title": "Refrain from taking oral medications that may irritate your stomach.",
      "content": "Refrain from taking oral medications that may irritate your stomach. These include aspirin, non-steroidal anti-inflammatory drugs (NSAIDs) like ibuprofen or naproxen, and blood pressure medications. Consult with your doctor before stopping any oral medicines you were taking for a different condition before you started vomiting. [12] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Some antibiotics have also been known to cause nausea; however, you should never stop taking antibiotics before talking with your doctor first."
    },
    {
      "title": "Go outside for fresh air if you still feel nauseous.",
      "content": "Go outside for fresh air if you still feel nauseous. Getting fresh air by taking a stroll can be a great way to manage nausea and vomiting. The crisp and open environment helps calm your senses. Just make sure not to overexert yourself on your walk, as too much physical activity could make your symptoms worse. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If walking outside isn’t feasible, try sitting by an open window to breathe fresh air."
    },
    {
      "title": "Diffuse essential oils",
      "content": "Diffuse essential oils to relieve your nausea. Inhaling certain scents through aromatherapy may help ease your nausea and calm your nerves after throwing up. Place a few drops of essential oils in a diffuser to fill the room with a nausea-fighting aroma. [14] X Trustworthy Source National Cancer Institute An agency in the National Institutes of Health focused on cancer research and patient support Go to source Try using one or more of these oils: Ginger Peppermint [15] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Lavender Fennel seed Lemon [16] X Research source"
    },
    {
      "title": "Try deep breathing exercises",
      "content": "Try deep breathing exercises to quell nausea. Believe it or not, deep breathing has been scientifically proven to decrease feelings of nausea and symptoms of an upset stomach. Sit in a comfortable position, close your eyes, and inhale deeply through your nose for 5 seconds. Then, slowly exhale through your nose for 7 seconds. Repeat this process until you start feeling better. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Fill your lungs completely when you inhale to get the best results."
    },
    {
      "title": "Limit physical activity for at least 1 to 2 days.",
      "content": "Limit physical activity for at least 1 to 2 days. After vomiting, your body will need plenty of rest. Too much physical activity after getting sick can aggravate your symptoms and make it harder to recover. So, avoid overexerting yourself until the nausea is completely gone. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have friends or family who can help care for you while you’re recovering, ask if they’d be willing to stay with you until your nausea is gone."
    },
    {
      "title": "Use medication to control frequent nausea and vomiting.",
      "content": "Use medication to control frequent nausea and vomiting. If you’ve done all you can through self-care to control your nausea and still have frequent bouts of vomiting, ask your doctor for help. They’ll be able to prescribe an anti-nausea medication to help manage your symptoms. [19] X Research source Commonly prescribed anti-nausea medications include Phenergan and Zofran. Note that some over-the-counter medications used to treat upset stomachs, such as Pepto-Bismol and Kaopectate, probably won’t stop your vomiting if you have a stomach virus."
    },
    {
      "title": "Go to the doctor if your vomiting doesn’t go away or gets worse.",
      "content": "Go to the doctor if your vomiting doesn’t go away or gets worse. Although vomiting and nausea usually go away within 24 hours, they can sometimes be signs of more serious illnesses. Seek medical attention if your vomiting lasts for more than 24 hours, there’s blood in your vomit, or you start to experience severe abdominal pain. [20] X Research source Contact a doctor if you have nausea without vomiting that persists for more than 48 hours. To treat nausea without medication, find out the cause. If you get nauseous riding in a car, look out the front and try to drive. Do not read, and don't put your eyes at any place other than looking out the window. If you get nauseous due to motion, then there are medications you can use. If you are pregnant and get nausea frequently for no reason, you should see somebody. It can be stress related."
    }
  ]
}