{
  "url": "https://www.wikihow.com/Get-Started-with-Discord",
  "title": "How to Get Started with Discord",
  "steps": [
    {
      "title": "Access Discord.",
      "content": "Access Discord. Discord can either be used in a web browser on a computer, or by using the Discord application on a phone or computer. The browser-based version is a good choice if you just want to try out Discord, but the app notifies you when there's a new message in a channel or chat that you're in. The browser version of Discord can't be accessed on a mobile device. You'll have to download the app to use Discord on your phone."
    },
    {
      "title": "Create an account on Discord.",
      "content": "Create an account on Discord. When you start using Discord, you'll often start out by just creating a username. However, if you create an account, you'll be able to use the Discord app (and not just the browser version). If you connect an email address to your Discord username, you'll be able to use Discord regularly with the mobile app or computer program."
    },
    {
      "title": "Familiarize yourself with Discord's layout.",
      "content": "Familiarize yourself with Discord's layout. If you've never used Discord before, or aren't very familiar with instant-messenger apps in general, you may be a bit confused on how to use it. However, a lot of it is really just learning how to use the layout. The basics are easy enough to learn, too! The far left side of the screen is where Direct Messages will show up and where any servers you've joined will show up. The left side of the screen will be either your Friends List or a list of channels in a server, depending on whether you're on the Direct Message screen or a Discord server, respectively. Underneath these lists will be your username and profile image, your \"online\" status, whether your microphone is muted, whether your headphones are \"deafened\", and your settings. The center of the screen is the chat messages. If you're on the Direct Message screen without a chat open, it will either be the Activity page or your Friends list. The right side of the screen, if you're on a server or group DM, will be the list of members on the server and their roles. If you're on Direct Messages, this won't appear. If you search something in the search bar up at the top right, the search results will appear on the right-hand side and hide the member list."
    },
    {
      "title": "Access the settings.",
      "content": "Access the settings. To customize your account settings, click on the cog near your username. You can use the settings to: Change your username, email, avatar, and password, disable or delete your account, or enable two-factor authentication. (Access the My Account setting.) Change who can DM you, whose DMs get scanned by Discord for safety, who can add you as a friend, and what data you send to Discord. (Access the Privacy & Safety setting.) Edit apps and bots that you've authorized to your account. (Access the Authorized Apps setting.) Connect accounts (such as Twitch, Skype, Steam, and Spotify) to your Discord account, as well as authorize apps to use your Discord account. (Access the Connections setting.) Change your billing information, or redeem game codes. (Access the Billing setting.) Join Discord Nitro or HypeSquad. (Access Discord Nitro or Hypesquad , respectively.) Edit your Voice Chat settings and whether you press a button for your microphone to activate in voice chats, or change the camera that Discord accesses for video calls. (Access the Voice & Video setting.) Edit notification settings. (Access the Notifications setting.) Add or delete keybinds. (Access the Keybinds setting.) Show when you're playing a game on your device and add games to your Discord account. (Access the Game Activity setting.) Change how images, GIFs, links, and emoticons show up in the chat. You can also enable or disable the /tts (text-to-speech) command. (Access the Text & Images setting.) Alter the appearance of the Discord window or turn on Developer Mode. (Access the Appearance setting.) Enable \"Streamer Mode\", which is useful if you play video games for a site such as YouTube or Twitch. (Access the Streamer Mode setting.) Choose the language. (Access the Language setting.)"
    },
    {
      "title": "Send a message.",
      "content": "Send a message. When you use Discord, the message bar is at the bottom of the screen and will be labeled with \"Message [person or channel]\". You can just type your message and press ↵ Enter to send it."
    },
    {
      "title": "Learn how to mute users, channels, and servers.",
      "content": "Learn how to mute users, channels, and servers. At some point, you'll probably want to not get so many notifications on Discord, but still leave the app open. While there's no way to mute the Direct Message system yet, there are ways of muting single users as well as channels and servers. Setting your account to Do Not Disturb will mute all incoming notifications unless you're tagged in a message or messaged directly. Click on your avatar and click on Do Not Disturb . To mute a single user on a server, right-click on the person's username and check the Mute button. If you want to unmute them later, just uncheck the button using the same steps. To mute a channel in a server, right-click on the channel that you want to mute and check the Mute button. You can also click the alarm bell at the top of the screen. Follow the same steps to unmute the channel. To mute a server, right-click on the server icon and check the Server Mute button."
    },
    {
      "title": "Learn how to edit and delete your messages.",
      "content": "Learn how to edit and delete your messages. At some point, you'll make a typo or send a message you didn't mean to send, but thankfully on Discord, there are ways to fix that. To edit a message you've sent, right-click the message and click Edit . (If you hit the up arrow on your keyboard, you will automatically open the edit window of your latest message.) To delete a message you've sent, right-click the message and click Delete message . If you hold down ⇧ Shift while doing so, it will delete the message without prompting whether you want to delete it."
    },
    {
      "title": "Find servers that you want to participate in.",
      "content": "Find servers that you want to participate in. In order to join a server on Discord, you'll need to have an invite to it. Friends can invite you to a server directly through Discord. If you have a link to a Discord server, click on the link and you'll join the server."
    },
    {
      "title": "Read any channel guidelines.",
      "content": "Read any channel guidelines. If you don't read channel guidelines or rules, you may end up getting muted, kicked, or banned from the server. Use common sense while chatting, too."
    },
    {
      "title": "Don't spam.",
      "content": "Don't spam. It's annoying to many people on Discord. Many channels may ban you if you do this."
    },
    {
      "title": "Add people to your Friends list.",
      "content": "Add people to your Friends list. When you add someone to your Friends list on Discord, you become able to call them privately, and they get added to a contact list for your direct messages (also called private messages, DMs, or PMs), making it easier to reach them. To add someone as a friend: Right-click on a Discord user's name, or use the search function to search for a list of users in channels that you've joined. Click on Add Friend . You can also add someone directly through their Discord tag; go to your Friends list, click Add Friend , and enter their Discord tag (which would appear as Username#1234 , with the numbers being randomized). Wait for the person to accept or deny your friend request. If they accept it, they'll appear in your friends list."
    },
    {
      "title": "Voice-chat with users if you want to.",
      "content": "Voice-chat with users if you want to. Discord, being primarily for gamers, gives you the ability to voice-chat with people. If you want to, just make sure that your microphone and headphones are active (meaning that they don't have a red slash through them), and start up a call: To call a single person via Direct Message, you'll need to be on their Friends list. Click on the button that looks like a phone (or the camera, if you'd like to video call), or right-click their name and click Call . To call multiple people in a group DM, access the group DM and click on the phone (if you want to voice call) or the camera (if you want to video call). To voice-chat with users on a server, click on the voice channel that you want to join and you'll connect to the server."
    },
    {
      "title": "Block users who are bothering you or harassing you.",
      "content": "Block users who are bothering you or harassing you. If a user is driving you up the wall, you can block them from messaging you. Just right-click their username and select Block from the dropdown menu. They can no longer DM you. If you've been blocked by a user, any attempts to DM them will be met with an automated response saying that your message was not delivered."
    },
    {
      "title": "Have fun using Discord!",
      "content": "Have fun using Discord!"
    }
  ]
}