{
  "url": "https://www.wikihow.com/Eat-a-Kiwi",
  "title": "How to Eat a Kiwi",
  "steps": [
    {
      "title": "Trim the ends.",
      "content": "Trim the ends. Before you dig in, check the outside of your kiwi. Note that most of the skin’s surface is a fuzzy brown with a raised bumpy pit at the top, which is where it grew from its vine. This is the only inedible part of the kiwi, so either trim it off or eat it around it. [1] X Research source"
    },
    {
      "title": "Test for ripeness.",
      "content": "Test for ripeness. To test kiwi, gently press it in your hands. If the flesh yields under the skin, it’s ready to eat. If it still feels hard, let it sit at room temperature until it softens. Expect underripe kiwi to taste too tart to really be enjoyed. [2] X Research source If the kiwi is mushy and squishy, it's probably overripe."
    },
    {
      "title": "Eat it skin and all.",
      "content": "Eat it skin and all. Take the easiest approach and take sink your teeth right into it, as you would with an apple or peach. Enjoy the contrast in textures between the tougher skin and the soft flesh within. Reap the kiwi’s full nutritional value, since the skin contains a large part of its fiber, mineral, and vitamin content, as well as antioxidants and flavonoids. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However: As with all produce, be aware that the outside may have traces of pesticides used in farming. Wash it under cold water while gently scrubbing the skin with your fingertips to remove trace chemicals. Organic kiwi reduces the risk of ingesting pesticides, but should still be washed in order to remove any dirt or other chemicals that it may have come into contact with by chance."
    },
    {
      "title": "Spoon it out.",
      "content": "Spoon it out. If you don’t like fruit skins, simply chop the kiwi in half. Treat each half as a readymade bowl and spoon yourself out some bite-size chunks. Alternatively: Slice off both ends, where the kiwi was attached to its vine, and hold the kiwi in one hand. With your other hand, insert the tip of your spoon between the flesh and skin along your cut. Press the spoon deeper into the flesh and twist the kiwi around in your hand. Remove the flesh and cut it into slices."
    },
    {
      "title": "Use a vegetable peeler.",
      "content": "Use a vegetable peeler. Peel the skin off as you would with a potato. Once you’re done, eat the flesh as it is or slice it up into bite-size bits. [4] X Research source However, keep in mind that: You should still wash the skin before peeling. Even though you won’t be eating it, your vegetable peeler may transfer dirt and chemicals from the skin to the flesh as you go along."
    },
    {
      "title": "Remember to trim off the ends.",
      "content": "Remember to trim off the ends. Whether you decide to peel your kiwis for your smoothies is up to you. Either way, don’t forget to trim off the ends where they were plucked from their vines. Remember that this part is inedible, so discard before using. [5] X Research source"
    },
    {
      "title": "Pair kiwis with strawberries.",
      "content": "Pair kiwis with strawberries. Chop up two kiwis and place them in a blender. Add one cup (152 g) of strawberries and two cups (60 g) of a leafy green, like spinach. Pour in a half cup (118 ml) of water and blend until smooth. [6] X Research source"
    },
    {
      "title": "Try kiwis with banana and avocado.",
      "content": "Try kiwis with banana and avocado. Chop up two kiwis and one banana and throw them in your blender. Slice off a quarter of an avocado and add that to the other fruit. Add two cups (60 g) of leafy greens and a half cup (118 ml) of water, then blend until smooth."
    },
    {
      "title": "Go with an apple-carrot combo.",
      "content": "Go with an apple-carrot combo. Chop up two kiwis as well as one whole apple and one whole carrot. Throw them in the blender along with two cups (60 g) of leafy greens. Pour in a half cup (118 ml) of water. Blend until smooth."
    },
    {
      "title": "Make it minty.",
      "content": "Make it minty. Chop up two kiwis and one banana and transfer to your blender. Add two cups (60 g) of leafy greens, plus four mint leaves. Blend with a half cup (118 ml) of water until smooth. [7] X Research source"
    },
    {
      "title": "Prep your oven and baking sheet.",
      "content": "Prep your oven and baking sheet. First, set your oven to 300 degrees Fahrenheit (150 degrees Celsius). While that preheats, line your baking sheet with parchment paper. On the paper, trace a circle roughly nine inches (23 cm) in diameter."
    },
    {
      "title": "Make your meringue.",
      "content": "Make your meringue. Crack your eggs and remove the yolks. Add the whites to a large mixing bowl and beat them. Add one tablespoon of sugar and mix it in as you continue to beat your egg whites, then repeat until you’ve added all your sugar. [8] X Research source Once the mixture turns thick and glossy, fold in your vanilla extract, lemon juice, and cornstarch."
    },
    {
      "title": "Fill the circle, then bake.",
      "content": "Fill the circle, then bake. Use a spoon to transfer the meringue to the circle that you traced on your parchment paper. To start, keep the bulk of it toward the center. Once all the meringue has been transferred, use your spoon to spread the meringue from the center out toward the edges. Continue to do so until the edges are higher than the center. Place the baking sheet in the oven and bake for one hour."
    },
    {
      "title": "Top your meringue.",
      "content": "Top your meringue. Once the meringue has finished baking, transfer it to a wire rack to cool off. While it does, beat your heavy cream in a small mixing bowl until it turns into stiff little peaks on the surface. Peel and slice your kiwi as evenly as possible. Once the meringue has cooled, transfer it to a serving plate, fill the center with your whipped cream, arrange your kiwi slices on top, and serve. [9] X Research source"
    }
  ]
}