{
  "url": "https://www.wikihow.com/Fix-No-Signal-on-a-PS4",
  "title": "2 Easy Ways to Fix No Signal on a PS4 (HDMI and Resolution Fix)",
  "steps": [
    {
      "title": "Make sure the PS4 is connected to the correct HDMI port.",
      "content": "Make sure the PS4 is connected to the correct HDMI port . Is your PS4 plugged into the same HDMI input that's selected on your TV? Use our TV remote to cycle through all of the HDMI inputs to make sure you haven't chosen the wrong one. [1] X Research source Try unplugging and re-plugging the HDMI cable in again to make sure you have a secure connection. If it's connected to the correct port, you could switch it to another available port and try again."
    },
    {
      "title": "Bypass the receiver if you have one.",
      "content": "Bypass the receiver if you have one. If your PS4 is not plugged directly into the TV and is instead plugged into an audio/video receiver, try plugging it directly into the TV instead. The receiver may not be accurately passing the signal to your TV."
    },
    {
      "title": "Check the HDMI cable and ports physically.",
      "content": "Check the HDMI cable and ports physically. Remove the HDMI cable from the PS4 and the TV and look inside both ports with a flashlight—do you see any bent pins inside the HDMI ports? If there's a bent pin in the PS4 or the TV, you'd see a \"No Signal\" area or a blank screen. If there's a bent pin, unplug the TV or PS4 from the wall and gently push it back into place using a flat screwdriver. [2] X Research source"
    },
    {
      "title": "Try a different HDMI cable.",
      "content": "Try a different HDMI cable. HDMI cables can be faulty, so try swapping out your current cable with another one, if you have one. [3] X Research source If you're still getting the \"No Signal\" error or seeing a blank screen, continue to Changing the Resolution in Safe Mode ."
    },
    {
      "title": "Press and hold the power button on your PS4 for seven seconds.",
      "content": "Press and hold the power button on your PS4 for seven seconds. This ensures that the PS4 really turns off, which is necessary for starting it in Safe Mode. You will hear one beep when you begin to press and hold the button, and a second after about seven seconds. You can remove your finger from the button after you hear the second beep. [4] X Research source If you're seeing \"No Signal,\" \"Weak Signal,\" or a blank screen, it could be because the resolution is incorrect in your PS4 settings. This sometimes happens when you move the PS4 between different TVs, switch between game systems on the same TV, or make a change to your TV's display settings."
    },
    {
      "title": "Press and hold the Power button again until the PS4 restarts.",
      "content": "Press and hold the Power button again until the PS4 restarts. Again, you'll hear a beep when you first start pressing the button—when you hear the second beep, lift your finger. This boots the PS4 into Safe Mode. [5] X Research source"
    },
    {
      "title": "Use a USB cable to connect your controller to the PS4.",
      "content": "Use a USB cable to connect your controller to the PS4. If you're using a wireless controller, you'll see a message on the screen telling you to connect with a USB cable—this is required for using the controller in Safe Mode."
    },
    {
      "title": "Press the PS4 button on the controller.",
      "content": "Press the PS4 button on the controller. It's the one at the bottom-center. You should see a menu on the screen."
    },
    {
      "title": "Select Change Resolution.",
      "content": "Select Change Resolution . This is the second option on the menu. To select the option, press X . You'll see a message that says \"The PS4 will restart.\""
    },
    {
      "title": "Press ✕.",
      "content": "Press ✕ . This restarts your PS4. When it comes back up, it'll ask you to choose a resolution."
    },
    {
      "title": "Select a resolution.",
      "content": "Select a resolution. Leaving the default option of Automatic will nearly always work, but you can also select a different resolution if you know it works with your TV. Keep in mind that if you select a resolution that doesn't work with the TV, you'll continue getting no signal when trying to play your PS4. For example, if you have a 720p TV, select 720p . Don't try selecting something higher than that, or else it won't work!"
    },
    {
      "title": "Press ✕.",
      "content": "Press ✕ . As long as you selected a resolution that's compatible with your TV, you should now be able to play your PS4."
    }
  ]
}