{
  "url": "https://www.wikihow.com/Cook-Steak-in-a-Frying-Pan",
  "title": "How to Pan-Fry the Perfect Steak on the Stovetop",
  "steps": [
    {
      "title": "Your steak will cook more evenly if it’s at room temperature.",
      "content": "Your steak will cook more evenly if it’s at room temperature. Pull your steak out of the fridge and set it on a plate or cutting board so it can slowly warm up. Try to leave it for at least 10 minutes, but you can safely keep your steak out at room temp for an hour before you plan on cooking it. [1] X Research source Choose boneless cuts of steak, like ribeye, filet, or New York strip, that are around 1– 1 1 ⁄ 2 in (2.5–3.8 cm) thick. Save bone-in steaks for cooking in the oven or on the grill so they cook evenly. If you’re preparing a frozen steak, put it in your fridge the night before so it can thaw and defrost ."
    },
    {
      "title": "Salting your steak before you cook works the seasoning into the meat.",
      "content": "Salting your steak before you cook works the seasoning into the meat. Pat the meat dry with some paper towels first so your steak develops a crispy crust. Then, generously sprinkle a layer of salt onto both sides of your steak. Don’t be afraid to put on more salt than you think you need since some of the seasoning will fall off while you’re cooking. [2] X Research source Salt also helps draw out some of the steak’s moisture so your steak gets a perfect sear. Alternatively, marinate your steak for at least 1 hour or let it sit overnight. Avoid marinating for longer than 1 day since it will get over-seasoned. Avoid putting pepper or any other seasonings on your steak before you cook it since the flavors may burn off before you even taste them."
    },
    {
      "title": "Letting the skillet heat completely ensures your steak cooks evenly.",
      "content": "Letting the skillet heat completely ensures your steak cooks evenly. Use a thick-bottomed stainless steel pan or cast-iron skillet since they hold heat the best. Put the skillet on your stovetop and let it heat up for about 10 minutes. [3] X Research source Many cooks don’t use cooking oil to pan-fry a steak, but it may prevent the meat from sticking to the surface. If you want to use it, swirl 1 tablespoon (15 ml) of vegetable oil on the bottom of the pan once it’s hot."
    },
    {
      "title": "Pressing the meat flat in the pan gives it a crispy sear.",
      "content": "Pressing the meat flat in the pan gives it a crispy sear. Use a pair of tongs to transfer the steak into the hot pan. Push the meat down firmly against the bottom of the pan so it makes good contact with the cooking surface. [4] X Research source If you’re making multiple steaks, avoid crowding them all into one pan since they may not cook evenly. Prepare the steaks separately or use a larger pan with space for all of the meat."
    },
    {
      "title": "Pan-frying each side creates an even crust on the meat.",
      "content": "Pan-frying each side creates an even crust on the meat. Some experts recommend only flipping your steak once while it’s cooking. Sear the first side of your steak so a crust can form. Then, use your tongs or a spatula to flip your steak to the other side. If you want to get a more even sear on each side, try flipping the steak every minute instead. [5] X Research source Try cooking steaks both ways to see what you like best flavor-wise. If you’re making thin pieces of flank or flat-iron steak, it may only take 1–2 minutes per side. Steaks can overcook quickly if you aren’t paying attention to them, so prep any sides you want to serve before you start cooking the meat."
    },
    {
      "title": "Coating your steak with butter and herbs makes it more mouth-watering.",
      "content": "Coating your steak with butter and herbs makes it more mouth-watering. Drop in 1–2 tablespoons (14–28g) of unsalted butter into your skillet along with other aromatics and herbs, like chopped garlic, thyme, or rosemary. Once the butter melts, scoop some into a spoon and pour it over your steak a few times so it can absorb all the delicious flavors. [6] X Research source"
    },
    {
      "title": "A meat thermometer lets you see if your steak is still too rare.",
      "content": "A meat thermometer lets you see if your steak is still too rare. Stick the end of the thermometer into the center of the thickest part of your steak. Wait until the reading settles on a temperature to see how cooked through it is. Depending on how you like your steak, pull the meat off of your stove when it reaches the doneness you want. [7] X Research source Rare: 115–120 °F (46–49 °C) Medium-rare: 120–125 °F (49–52 °C) Medium: 130–135 °F (54–57 °C) Medium-well: 140–145 °F (60–63 °C) Well-done: 155–160 °F (68–71 °C) If you don’t have a meat thermometer, try doing a touch test instead. Feel your palm just below your thumb. Touch your thumb to your index finger to know what rare steak feels like, middle finger for medium-rare, ring finger for medium, and pinky for well-done."
    },
    {
      "title": "Resting your steak keeps the meat juicy and flavorful.",
      "content": "Resting your steak keeps the meat juicy and flavorful. Once you take your steak off of the stove, leave it on a cutting board or plate for a few minutes. After your steak rests for around 5 minutes, feel free to slice or cut it however you want so you can start eating. [8] X Research source Toss a salad or mash potatoes to serve along with your steak to make a delicious, hearty meal. Enjoy some red wine for a classic pairing with steak."
    }
  ]
}