{
  "url": "https://www.wikihow.com/Draw-Link",
  "title": "How to Draw Link",
  "steps": [
    {
      "title": "Draw a medium circle for the head at the center of the page.",
      "content": "Draw a medium circle for the head at the center of the page."
    },
    {
      "title": "Draw a slightly curved vertical line near the center of the circle.",
      "content": "Draw a slightly curved vertical line near the center of the circle."
    },
    {
      "title": "Draw a spade-like shape beneath the circle.",
      "content": "Draw a spade-like shape beneath the circle. This will be the guide to Link's chin and jaw."
    },
    {
      "title": "Draw three parallel horizontal across Link's head, intersecting their middle with the vertical line.",
      "content": "Draw three parallel horizontal across Link's head, intersecting their middle with the vertical line. This will serve as a guide where to place his eyes, mouth and other facial features."
    },
    {
      "title": "Draw lines for Links neck and shoulders.",
      "content": "Draw lines for Links neck and shoulders."
    },
    {
      "title": "Using the guide lines on his head, draw Link's facial details:",
      "content": "Using the guide lines on his head, draw Link's facial details: eyes, mouth, nose, etc."
    },
    {
      "title": "Draw Link's brushy hair, his ears and elf hat.",
      "content": "Draw Link's brushy hair, his ears and elf hat."
    },
    {
      "title": "Draw details on Link's clothes.",
      "content": "Draw details on Link's clothes."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    },
    {
      "title": "Near the topmost of the paper, draw a circle for the head.",
      "content": "Near the topmost of the paper, draw a circle for the head."
    },
    {
      "title": "Below the circle, draw a curved spade shape for the chin and jaws.",
      "content": "Below the circle, draw a curved spade shape for the chin and jaws."
    },
    {
      "title": "Beneath these, draw a polygon and stick figure to represent his torso and limbs.",
      "content": "Beneath these, draw a polygon and stick figure to represent his torso and limbs. Place circles where the joints are."
    },
    {
      "title": "We'll have Link carry a shield on his left hand.",
      "content": "We'll have Link carry a shield on his left hand. Draw little circle points to note the shield's curve and angles. Connect these little circles."
    },
    {
      "title": "Draw a vertical line at the center of the entire head and chin part.",
      "content": "Draw a vertical line at the center of the entire head and chin part. Make three parallel horizontal lines that will intersect their middle with the vertical line. This will be the lines to guide the placement of Link's facial features."
    },
    {
      "title": "Using these line guides, draw Link's facial details:",
      "content": "Using these line guides, draw Link's facial details: eyes, mouth, nose, etc."
    },
    {
      "title": "Draw Link's brushy hair, pointy ears, chin outline and his elf hat.",
      "content": "Draw Link's brushy hair, pointy ears, chin outline and his elf hat."
    },
    {
      "title": "Begin tracing the outline of Link's body.",
      "content": "Begin tracing the outline of Link's body. Add details on his clothes and accessory."
    },
    {
      "title": "Erase unnecessary lines, then trace necessary with black marker or black pen..",
      "content": "Erase unnecessary lines, then trace necessary with black marker or black pen.."
    },
    {
      "title": "Color the drawing as desired.",
      "content": "Color the drawing as desired."
    }
  ]
}