{
  "url": "https://www.wikihow.com/Deal-With-Exam-Stress",
  "title": "How to Deal With Exam Stress",
  "steps": [
    {
      "title": "Know what is expected of you.",
      "content": "Know what is expected of you. Be sure to consult your syllabus or ask your instructor what material you will be responsible for. If you have a concrete sense of what you will be tested on, the future test will feel less vague and more like something you can handle. [1] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source If you aren't clear on anything, ask your teacher. Teachers would much rather answer questions than have their students proceed without understanding what's expected. Make sure you have read your syllabus and any information your teacher has given you before asking the question. Your teacher won't be pleased if you send her an email asking when the test is if it's specified on page 1 of the syllabus."
    },
    {
      "title": "Study in conditions similar to your test room.",
      "content": "Study in conditions similar to your test room. There is a phenomenon in psychology called context-dependent memory. It refers to the idea that we are best able to remember things in environments similar to when the information was encoded [2] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source . A related phenomenon is called state-dependent memory, which means that our memory is better when we learn and retrieve information in similar bodily states. [3] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source If you will be in a quiet room during your exam, try to simulate those conditions while you prepare. This is using context-dependent memory to your advantage. As an example of state-dependent memory, if you prepare for your exam using caffeine, your memory on test day may be better if you have a similar amount of caffeine then, too. Use this knowledge and know that you are taking evidence-backed steps to maximize your exam score; keep that in mind if you are feeling stressed about your upcoming exam."
    },
    {
      "title": "Take notes",
      "content": "Take notes in class. Do not just rely on your memory or your course book. Take your class time seriously by taking notes summarizing what your teacher has said. If you are feeling exam stress, you can review your notes; this will help you remember things that happened in class that you didn't even take notes on, further giving you a sense of mastery over your material. When taking notes, focus on jotting down keywords and key ideas, rather than trying to take dictation. Copying out the exact sentences is not as important as getting down the main ideas. [4] X Research source Review your notes weekly. This will help you learn the material and transfer it to long-term memory. When it comes time for the exam, you'll feel much better prepared."
    },
    {
      "title": "Manage your time wisely.",
      "content": "Manage your time wisely. Do not just cram for an exam last minute; this will surely lead to exam stress. Break up your study time into chunks over days, or weeks even. When you \"chunk\" your study time over the course of a longer period of time, such as a few days or weeks, you will retain more of the information. If possible, because of state-dependent memory, try to study at around the same time of day as you will be taking the test. This way you will be similarly tired/awake when you study and when you take your test. You will be used to how you feel when dealing with your course material on test day."
    },
    {
      "title": "Know where you study best.",
      "content": "Know where you study best. Think about the kinds of factors that allow you to be most comfortable and relaxed as you prepare for your exam. When setting up a dedicated study space : Track the level of light in the room. Some people study better with light, others study better in dimmer light. Examine your work space. Decide whether you work better with a bit of clutter or if a clean, fresh work space is what you prefer. Pay attention to background noise. Does music help you concentrate or do you need a quiet environment in which to study? Find an alternate place to study such as a library or coffee shop. A change of scenery can give you a fresh look at the material and also provide additional resources."
    },
    {
      "title": "Take frequent breaks.",
      "content": "Take frequent breaks. According to psychology studies, the average human brain can only focus on one task effectively for about 45 minutes. In addition, research in neuroscience suggests that focusing on the same thing for too long diminishes the brain's ability to accurately process it. [5] X Research source"
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Be sure to drink plenty of water. [6] X Expert Source Katherine Demby Test Prep Specialist Expert Interview. 17 December 2020. Aim for at least 8 eight-ounce glasses of water per day. Not drinking enough water can make you feel sluggish and stressed. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Caffeine can make you feel anxious, which can contribute to feelings of stress and anxiety. Have a cup of coffee or a cola if you like, but don't go overboard. [8] X Research source Experts recommend getting no more than 400mg of caffeine per day for adults. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Kids and teens should limit themselves to about 100mg per day (one cup of coffee or 3 colas). [10] X Research source A cup of herbal tea can help you feel more relaxed and stay hydrated. Peppermint, chamomile, and passionflower are good choices."
    },
    {
      "title": "Reward your achievements, no matter how small.",
      "content": "Reward your achievements, no matter how small. If you are feeling stressed about an exam, be sure to reward yourself for your study time. This will motivate you to continue studying and may even reduce stress. For example, after studying hard for an hour, take a break and play on the internet for 20 minutes or watch an episode of a TV show that you enjoy. This will help you get your mind off the exam while acting as a motivational carrot that may help you pick up studying again after your break."
    },
    {
      "title": "Exercise.",
      "content": "Exercise. Regular aerobic exercise can relieve stress, so if you find yourself a nervous wreck before an exam, go for a run or hit the gym. [11] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source [12] X Research source When you work out, listen to upbeat music that keeps you motivated throughout your workout. For other ways to beat stress, see this handy wikiHow: Relax Before a Final Exam in College . Meditate or do yoga after your upbeat excercise. This lets the mind focus and calm down"
    },
    {
      "title": "Eat healthy foods.",
      "content": "Eat healthy foods. When you eat unhealthy foods it can make you feel negative, which can interfere with your exam preparation. Therefore, it is important to eat right if you want to have the best odds of doing well on your exam and not stressing about it. [13] X Research source Try eating lean meats, nuts, fruits, and vegetables. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid too much sugar or heavily processed food. Part of eating healthy involves having a balanced diet. Try not to eat too much of only one food source. You can usually get variety in your diet by changing up the type of cuisine you eat every couple of nights. Try having a bit of time to do yoga or meditation after other excercise to calm your brain down. Remember to breathe in through your nose and out through your mouth heavily."
    },
    {
      "title": "Get enough sleep.",
      "content": "Get enough sleep. Not getting a full night's rest can contribute to feelings of fatigue, stress, and anxiety. [15] X Expert Source Katherine Demby Test Prep Specialist Expert Interview. 17 December 2020. If you have trouble sleeping, try making your bedroom pitch black . Block out sounds by changing your environment and/or wearing earplugs. Get into a routine and follow it every night. Take note of how many hours a night of sleep you need in order to feel refreshed in the morning; get that many hours of sleep every night. For example, if you tend to be in bed by 10:30 PM then read for 30 minutes before falling asleep, stick to that schedule as often as possible. In this way you will train your body for sleep. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source See this helpful wikiHow, Sleep Before Final Exams , for more advice."
    },
    {
      "title": "Ask yourself whether you have a learning disability.",
      "content": "Ask yourself whether you have a learning disability. It may be the case that you have something like ADHD or other learning disability that impairs your ability to perform well on an exam. This may be stressing you out but know that schools often have resources to help you excel in school. [17] X Research source If this is a concern for you, be sure to reach out to a school counselor or teacher for how to proceed in getting help."
    },
    {
      "title": "Eat a proper exam day breakfast.",
      "content": "Eat a proper exam day breakfast. Without a proper breakfast your energy levels will quickly crash and may lead to stress, anxiety, and fatigue. Be sure to have a healthy, energy packed breakfast on exam day. Try eating foods that provide long lasting energy, such as eggs or oats. [18] X Expert Source Katherine Demby Test Prep Specialist Expert Interview. 17 December 2020. Avoid foods that are high in sugar, which will give temporary energy but may cause you to crash mid-exam. [19] X Research source"
    },
    {
      "title": "Hydrate.",
      "content": "Hydrate. Being dehydrated negatively affects how efficiently the brain works. Be sure to stay hydrated before your exam; drink down some water with breakfast! [20] X Research source If you're allowed to, bring a water bottle with you to your exam. Thinking is thirsty work! Just don't be surprised if your teacher asks to examine the bottle, as some students have tried to cheat by writing answers on bottle labels. (Don't do that -- cheating is never worth it, and if you get caught, you'll be in way more trouble than you would if you'd just done poorly."
    },
    {
      "title": "Watch your caffeine intake.",
      "content": "Watch your caffeine intake. As tempting as it may be, don't have too much coffee/caffeine before your exam. Caffeine can increase feelings of anxiety and stress. If you are going to be stressed during your exam, caffeine will only exacerbate these feelings and make them more difficult to keep in check. [21] X Research source That said, do not drastically change your typical caffeine intake on exam day. This can cause withdrawal symptoms that may interact with your stress to make you feel especially negative. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Caffeine in limited quantities may have a positive effect on your memory, so if you usually have a cup of coffee with breakfast, go ahead. [23] X Research source"
    },
    {
      "title": "Arrive early.",
      "content": "Arrive early. You may be nervous about the test itself so there is no need for extra stress from fear of being late. Plus, by arriving early you will be sure to get the seat that you like. [24] X Research source"
    },
    {
      "title": "Read instructions carefully.",
      "content": "Read instructions carefully. Before answering any exam questions, figure out exactly what is expected of you. Skim the test to see its content and give yourself a rough idea of how long each question will take to complete. Ambiguity can cause stress, so, by knowing how long the test is, you will reduce your stress."
    },
    {
      "title": "Avoid rushing.",
      "content": "Avoid rushing. Take your time going through the exam. If you get stuck on a question for a long time, instead of getting stressed about it, keep in mind that it is just one question on the exam. If possible (if the way the test is structured allows it), skip that question and return to it at the end if you have time. [25] X Research source Keep an eye on the clock and give yourself five to ten minutes to go over your answers to check for any mistakes or to guess on any questions that you initially skipped."
    },
    {
      "title": "Chew some gum.",
      "content": "Chew some gum. Reduce your anxiety by chewing on some gum. This will keep your mouth busy and can act as a release for your anxiety."
    },
    {
      "title": "Ask your instructor if you're stuck.",
      "content": "Ask your instructor if you're stuck. It doesn't hurt to ask for clarification on something. She may or may not answer your question as it may give you an unfair advantage over other students, but you lose only a few seconds by raising your hand and asking. [26] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Recognize test anxiety.",
      "content": "Recognize test anxiety. Once you realize you are suffering from anxiety, use some or all of the steps below to alleviate it. Test anxiety can appear in the form of a number of symptoms including [27] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source : Cramps Dry mouth Nausea Headache Rapid heartbeat Restless thoughts Mental blackouts Trouble concentrating"
    },
    {
      "title": "Remember to breathe.",
      "content": "Remember to breathe. With your eyes closed, take three large breaths, then pause, exhale, and repeat the process. Large, deliberate breaths not only help relax the body, but also increase the flow of oxygen to the brain. Use this technique both before the test and during difficult areas of the exam. Inhale through your nose for a count of 4. Try to hold your breath for a count of 2, then slowly exhale through your mouth for a count of 4."
    },
    {
      "title": "Expand and contract your muscles.",
      "content": "Expand and contract your muscles. For example, tighten your shoulders and slowly relax them, repeating the process in other tense areas of your body. Tightening muscles before relaxing them enhances the body's relaxation awareness, which relaxes the body even more. [28] X Research source"
    },
    {
      "title": "Take a break if you need to.",
      "content": "Take a break if you need to. If allowed, get up and get a drink of water, use the bathroom, or simply stretch your legs if it will help you regain focus and decrease anxiety."
    },
    {
      "title": "Put the exam in perspective.",
      "content": "Put the exam in perspective. Keep in mind that, in the grand scheme of your future, doing poorly on one exam will likely not be that impactful. We often overestimate how bad things will be and how poorly they will make us feel. [29] X Research source Keep that in mind if you find yourself getting stressed out in the middle of your exam. It is probably not the end of the world if you do poorly. Life will go on and you can study harder for the next one! If you catch yourself stuck in a negative thought loop, try to detach from it. Ask yourself: what's the worst that can really happen if I don't do well on this test? Try to remain logical about it. Can you really handle the worst that could happen? Chances are, the answer is yes. [30] X Research source You can also think of alternatives if you find yourself stuck worrying over how important this exam is. You may be able to retake it. You may be able to make up your grade with extra credit. You can hire a tutor or study with friends for the next exam. This isn't the end of the world."
    },
    {
      "title": "Don't think about it.",
      "content": "Don't think about it. Easier said than done, of course, but, try to keep in mind that once the exam is over, you can't go back and change anything about how it went. So, avoid asking your friends what they put for certain questions if you think that will just stress you out. [31] X Research source To avoid ruminating, or getting stuck in that \"broken-record loop,\" try the following tips: Let go of the things you can't control. Ask yourself, \"what about my exam can I change at this point?\" If it is nothing, do your best to let it go. [32] X Research source View your mistakes as opportunities to learn. From this perspective, getting a exam question wrong isn't something to be worried about. Try scheduling a worry break. Set aside 30 minutes and let all your worries out during that time. Think hard about the things you are stressed about. Then, once that 30 minutes is up, let it go. Exercise can also help you to get your mind off of your exam after it is done. Consult the wikiHow article Calm Post Exam Nerves for some more tips."
    },
    {
      "title": "Take time off.",
      "content": "Take time off. Clear your mind from thinking about the exam by doing something you enjoy; try to pick an activity that you typically get lost in. For example, if you get absorbed when you watch a movie or read a book, do that. If you get really into sports when you play them, get outside and play some sports!"
    },
    {
      "title": "Treat yourself.",
      "content": "Treat yourself. Eat some pizza or sushi or candy or buy yourself a new shirt; whatever treat you like that makes you happy for a few moments. Exams are very stressful but you made it through. Now relax a bit with something you enjoy then start preparing early for your next exam!"
    },
    {
      "title": "Treat it as a learning experience.",
      "content": "Treat it as a learning experience. You can learn from your mistakes; remember that ultimately the goal of an exam is to assess your level of knowledge on a topic. This helps you to identify your strengths and weaknesses regarding your course content. [33] X Research source Instead of being stressed about this information, try to view it as an opportunity for an accurate assessment of your knowledge, which you can then use to improve yourself. Remember that your performance on an exam is not indicative of your worth as a person. You can do poorly on an exam and still be a good student."
    }
  ]
}