{
  "url": "https://www.wikihow.com/Disable-Comments-on-Videos-on-YouTube",
  "title": "How to Disable Comments on Videos on YouTube",
  "steps": [
    {
      "title": "Go to https://studio.youtube.com/ and log in.",
      "content": "Go to https://studio.youtube.com/ and log in. You'll use the YouTube username and password that you'll use to upload the videos that you want to turn off commenting on. Alternatively, you can go to https://youtube.com , click your profile picture, and select YouTube Studio ."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's on the left side of the page next to an icon of a gear. This will open a new window in the middle of your screen."
    },
    {
      "title": "Click Community.",
      "content": "Click Community . You'll see this in the panel on the left side of the window."
    },
    {
      "title": "Click the Defaults tab.",
      "content": "Click the Defaults tab. This will show you the default settings for your YouTube channel and all the videos that you upload."
    },
    {
      "title": "Click to select Disable comments.",
      "content": "Click to select Disable comments . This will turn off the commenting feature on all your future uploads. If you're experiencing something more like spam or gibberish comments, you can click Hold potentially inappropriate comments for review instead. [1] X Research source"
    },
    {
      "title": "Click SAVE.",
      "content": "Click SAVE . It's in the lower right corner of the window and will save your changes."
    },
    {
      "title": "Go to https://studio.youtube.com/ and log in.",
      "content": "Go to https://studio.youtube.com/ and log in. You'll use the YouTube username and password that you used to upload the videos to YouTube on which you want to delete the comments. Alternatively, you can go to https://youtube.com , click your profile picture, and select YouTube Studio ."
    },
    {
      "title": "Click Content.",
      "content": "Click Content . You'll see this in the menu on the left side of the page."
    },
    {
      "title": "Click the video's thumbnail.",
      "content": "Click the video's thumbnail. You'll be redirected to a new page with more options for that video."
    },
    {
      "title": "Click Show More.",
      "content": "Click Show More . It's at the bottom of the page."
    },
    {
      "title": "Click to select Disable Comments.",
      "content": "Click to select Disable Comments . This will turn off the commenting section for this existing video as well as delete previous comments. If you want to disable comments on a few previous videos, you can do it in bulk. From https://studio.youtube.com/ , click Content , then select all the videos you want to edit (click the boxes next to their thumbnails). At the top of your screen, click Edit > Comments > Disable comments > Update Videos . [2] X Research source"
    },
    {
      "title": "Get the commenter's channel URL from their YouTube channel homepage.",
      "content": "Get the commenter's channel URL from their YouTube channel homepage. All you need to do is go to their YouTube channel and copy the URL from their homepage. If you're looking at their comment on one of your videos, you can skip the rest of this method by simply clicking the three-dot menu icon next to their comment and selecting Hide user from channel ."
    },
    {
      "title": "Go to https://studio.youtube.com/ and log in.",
      "content": "Go to https://studio.youtube.com/ and log in. You'll use the same YouTube username and password that you use to manage your YouTube account."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It's on the left side of the page next to an icon of a gear. This will open a new window in the middle of your screen."
    },
    {
      "title": "Click Community.",
      "content": "Click Community . You'll see this in the panel on the left side of the window."
    },
    {
      "title": "Paste their URL into the \"Hidden users\" text box.",
      "content": "Paste their URL into the \"Hidden users\" text box. This will make it so that user cannot comment on your videos or channel."
    },
    {
      "title": "Click SAVE.",
      "content": "Click SAVE . It's in the lower right corner of the window and will save your changes. [3] X Research source Click the x next to their URL here if you want to unblock them."
    },
    {
      "title": "Navigate to https://youtube.com and sign in.",
      "content": "Navigate to https://youtube.com and sign in. You shouldn't have to do this if you went through YouTube Studio and changed the comment settings for all your YouTube videos, but this is good to know."
    },
    {
      "title": "Click the upload icon and Upload video.",
      "content": "Click the upload icon and Upload video . You'll find this video camera button near the top right corner of the screen. It is to the left of the notifications icon and profile icon"
    },
    {
      "title": "Select a file to upload or drag and drop the file onto the webpage.",
      "content": "Select a file to upload or drag and drop the file onto the webpage. The file will start to upload immediately."
    },
    {
      "title": "Click Show More.",
      "content": "Click Show More . It is located at the very bottom of the page and will display more options."
    },
    {
      "title": "Click to select Disable Comments.",
      "content": "Click to select Disable Comments . The circle will fill to indicate that it is selected."
    },
    {
      "title": "Click Next and continue to upload your video.",
      "content": "Click Next and continue to upload your video. Once you've selected Disable comments , no one will be able to leave a comment on your video when you upload it."
    },
    {
      "title": "Go to https://studio.youtube.com/ and log in.",
      "content": "Go to https://studio.youtube.com/ and log in. You'll use the YouTube username and password that you'll use to upload the videos that you want to turn off commenting on. Alternatively, you can go to https://youtube.com , click your profile picture, and select YouTube Studio ."
    },
    {
      "title": "Click Create and select Go live.",
      "content": "Click Create and select Go live . You'll see this video camera icon in the top right corner of YouTube Studio and clicking Go live will direct you to your live streaming dashboard of YouTube Studio."
    },
    {
      "title": "Click Start.",
      "content": "Click Start . You can either choose to go live immediately or set up a future stream."
    },
    {
      "title": "Select your streaming software or your webcam.",
      "content": "Select your streaming software or your webcam. If you have a streaming software that you're planning on using, choose that. If not, you'll opt to use your webcam."
    },
    {
      "title": "Click Show More.",
      "content": "Click Show More . It's at the very bottom of the window that pops up."
    },
    {
      "title": "Click to select Disable comments.",
      "content": "Click to select Disable comments . This will turn off the chat and commenting feature on your future live stream. If you're experiencing something more like spam or gibberish comments, you can click Hold potentially inappropriate comments for review instead. [4] X Research source"
    },
    {
      "title": "Click SAVE.",
      "content": "Click SAVE . It's in the lower right corner of the window and will save your changes. If you're doing a live stream on mobile, you may not be able to moderate the messages as well as you could on a computer. For instance, if you're on a computer, you can press Alt to pause the live chat and point to a user's name; from there, you can delete the user from your chat, put them in time-out (they can't message for a set time), or hide the user from the chat and your channel. In YouTube Studio, you can set a list of words that are blocked from your live stream chats. Go to YouTube Studio > Settings > Community > Blocked Words > Save . [5] X Research source"
    }
  ]
}