{
  "url": "https://www.wikihow.com/Drink-Amaretto",
  "title": "How to Drink Amaretto",
  "steps": [
    {
      "title": "Add several ice cubes to your glass.",
      "content": "Add several ice cubes to your glass. This helps chill your drink and dilute it. The more ice you add, the quicker your drink will be cold and ready to enjoy. Amaretto is tastier cold. [2] X Research source"
    },
    {
      "title": "Pour the amaretto and other alcohol into the glass.",
      "content": "Pour the amaretto and other alcohol into the glass. The options for drinks including amaretto is almost limitless. [3] X Research source Pair with bourbon for a remix of a classic drink. You can mix bourbon and amaretto. Don’t be afraid to add orange or walnut bitters. Think of this combination as a take on the old fashioned. [4] X Research source Drink amaretto with scotch. Mix 2 oz. of scotch with .25 oz. of amaretto to make a Godfather. [5] X Research source You can also make a Rob Roy by replacing the sweet vermouth with fino sherry and amaretto. Mix together 2oz. of scotch, .5 oz. of fino sherry, .5 oz. of fino sherry, and 2 dashes of bitters. [6] X Research source Use it as a float. Amaretto can be used as a float on top of drinks like a piña colada and painkiller. For a painkiller. Combine 2 oz. rum, 4 oz. pineapple juice, 1 oz. orange juice, and 1 oz. cream of coconut. [7] X Research source Using a spoon, slowly add .5 oz of amaretto on the top as the final step. [8] X Research source"
    },
    {
      "title": "Stir your drink using a bar spoon.",
      "content": "Stir your drink using a bar spoon. Don't let not having a bar spoon stop you from enjoying your beverage. Other spoons would work just fine too. Stirring helps each sip to have all the flavors of the mixture. Mix before pouring the amaretto if you are using it as a float. [9] X Research source"
    },
    {
      "title": "Enjoy with a hot chocolate or coffee.",
      "content": "Enjoy with a hot chocolate or coffee. Make 8oz. of hot chocolate with your favorite recipe or brew a cup of coffee. Add 1.5 oz. of amaretto to your cup and stir. These delicious mixtures are perfect in the winter when battling the cold. But why limit this option? They can be enjoyed all year long. For an extra touch, top with whipped cream, slivered almonds, and grated chocolate. [10] X Research source"
    },
    {
      "title": "Drink with soda.",
      "content": "Drink with soda. Pour 1.5 oz of amaretto into a glass. You can see if you poured too little or too much when you pour the alcohol first. Knowing if you under or over poured will help you make adjustments with the mixer. Add 8 oz. of soda water for a simple, pleasurable beverage. You’ll still get to enjoy the sweet flavor of the amaretto. Finish making your drink by stirring the ingredients together. [11] X Research source"
    },
    {
      "title": "Mix with ginger beer.",
      "content": "Mix with ginger beer. This mixture is refreshing and gingery. Mix 1.5 oz. of amaretto with 8 oz. of ginger beer. Stir your drink before enjoying. Add a couple dashes of bitters and a squeeze of lime. These can also reduce the sweetness of the drink. Using a spicier ginger beer will help avoid making the drink overly sweet."
    },
    {
      "title": "Savor with citrus.",
      "content": "Savor with citrus. Citrus juice and amaretto make a delightful drink. For a different take on the traditional screwdriver, add 2 oz. of amaretto to 4 oz. of orange juice. Shake the mixture and garnish with an orange wheel to add to the presentation. Try with pineapple juice for a tropical concoction."
    },
    {
      "title": "Make an amaretto sour if you're short on time.",
      "content": "Make an amaretto sour if you're short on time. An amaretto sour is a classic and easy-to-make drink. Combine 3 oz. of amaretto and 2 oz. of sweet and sour mix. Mix in an ice-filled shaker. Shake until the shaker feels very cold in your hand. Strain your cocktail and top of with lemon-lime soda. Add as many cherries as you desire to your drink. For a finishing touch, garnish with an orange wedge and a cherry. [12] X Research source"
    },
    {
      "title": "Add several ice cubes to your glass.",
      "content": "Add several ice cubes to your glass. Amaretto tends to be a little thick and excessively sweet straight out of the bottle. Pouring it over ice helps thin the liquid. Who wants their drink the consistency of cough syrup? [13] X Research source An old-fashioned glass is a traditional choice, but other glass types work fine. Use what you have."
    },
    {
      "title": "Pour the amaretto over the ice.",
      "content": "Pour the amaretto over the ice. The standard serving size is about 2 oz. It's enough that you can sip on your drink, enjoying the rich flavor of amaretto. Try using a measuring cup or measuring spoons if you need help determining how much to pour."
    },
    {
      "title": "Add a squeeze of lemon or lime.",
      "content": "Add a squeeze of lemon or lime. Cut the fruit into sections and squeeze one of the wedges over the glass. While adding citrus is optional, give it a try. The flavors complement each other very well. [14] X Research source To get the most juice out of the lemon or lime, try rolling it on the counter before sectioning the fruit. [15] X Research source"
    }
  ]
}