{
  "url": "https://www.wikihow.com/Do-You-Use-Pomade-on-Wet-or-Dry-Hair",
  "title": "Your Guide to Pomade: Should You Use Pomade on Wet or Dry Hair?",
  "steps": [
    {
      "title": "Most pomades are best applied to damp hair.",
      "content": "Most pomades are best applied to damp hair. The vast majority of pomade aficionados wash and condition in the shower, and then pat their hair mostly dry with the towel. Then, they work a pea-sized dollop of pomade into their hair by hand and make adjustments with their fingers and a comb. Once your hair dries fully, the pomade will keep your luscious locks in place. [1] X Research source Pomade often needs a little bit of water to “activate” and spread out, but too much water will thin it down. If you don’t put pomade on after showering, at least get your hands wet and run them through your hair a few times. It’s a lot easier to work with pomade if your hair is slightly wet."
    },
    {
      "title": "You can if you want extra shine, but it might make your hair greasy.",
      "content": "You can if you want extra shine, but it might make your hair greasy. If you have really dry hair and you want some extra shine for a more stunning rockabilly look, feel free to work pomade into your hair when it’s totally wet. Then, let it air dry or use a hair dryer set to low heat. Unfortunately, most folks feel like this makes their hair really greasy, and the pomade might leave hats, headrests, and pillows feeling a little yucky if you do this. [2] X Research source This might be an especially bad idea if you have water-soluble pomade, since it will get too diluted and it won’t spread out consistently. It may not offer much hold, either. The greasiness is going to be especially noticeable if you use oil-based pomade, which won’t thin out with water."
    },
    {
      "title": "Yes, if you want better holding power in exchange for inconsistent texture.",
      "content": "Yes, if you want better holding power in exchange for inconsistent texture. You can put pomade in your hair when it’s dry. In fact, if you really want to tame loose hairs and keep your style from falling apart in a stiff wind, this is a great way to go. However, most pomade users don’t use it this way; pomade is really thick, and your hair might feel kind of lumpy and uneven if you work it into dry hair. You also won’t get that classic shine most folks are looking for with pomade. [3] X Research source Pomade’s thickness can make it hard to work with if your hair is dry since there won’t be any lubrication to spread it out. This can lead to clumps of pomade drying out in random parts of your hair."
    },
    {
      "title": "Start with a pea-sized dollop and work your way up from there.",
      "content": "Start with a pea-sized dollop and work your way up from there. Less is more with pomade—this stuff tends to be very potent in small amounts. You can always add more pomade to your hair, but taking it out will require a thorough wash, so start with a tiny amount and work your way up. Most fellas out there find that a pea-sized amount of pomade is more than enough. [4] X Research source Pomade can harden up a bit if you leave it in a cooler area. If you scoop it up and it doesn’t have a soft feel to it in your hands, heat the pomade up by rubbing it between your palms. The heat from your hands should be more than enough. Warming pomade in your hands is important to apply it evenly. If you don’t do it, it may end up clumpy on your hair."
    },
    {
      "title": "Yes, especially if you want to keep your skin clear.",
      "content": "Yes, especially if you want to keep your skin clear. If you overdo it with the pomade, you’re very likely to get acne breakouts around your hairline. Pomade is thick stuff, and it’s going to clog your pores if you’re using it every day. If you want to keep your skin healthy and clear, you’re probably better off using pomade sparsely and taking breaks in between uses so that your skin has time to breathe. [5] X Research source If you really want to use pomade every day, use water-based pomade. The oil-based pomades out there have better holding power, but the excess oils will build up in your hair."
    },
    {
      "title": "Yes, you should wash your hair if you’re using pomade.",
      "content": "Yes, you should wash your hair if you’re using pomade. You do not need to wash your hair every single day if you aren’t using any products. But if you style your hair with pomade, you should wash your hair before you go to bed. Pomade is thick, and cleaning it out of your hair will keep your locks healthy and soft. With water-based pomade, just shampoo and condition your hair as you normally would. Oil-based pomade isn’t water-soluble, so you’ll need to take an additional step. Try one of the following: [6] X Research source You could buy a pomade shampoo designed specifically for oil-based pomade and shower with that. You can wash your hair with a clarifying shampoo designed specifically for oily hair. You could work a spoonful of olive oil into your hair to soften the pomade and then wash your hair with a grease-fighting dish soap."
    },
    {
      "title": "There’s no good evidence one way or another, but it theoretically could.",
      "content": "There’s no good evidence one way or another, but it theoretically could. Pomade tends to be fairly heavy, and it makes a lot of sense that putting something in your hair that weighs it down could lead to some hair loss over time. [7] X Research source However, there isn’t a ton of scientific evidence that pomade is explicitly bad for your hair or leads to hair loss. There are a lot of people out there who use pomade pretty regularly, so it seems unlikely it directly contributes to hair loss. [8] X Research source It’s possible that folks blame pomade for hair loss because you typically comb your hair after you work the pomade into it. Combing can pull weakened hairs off of your head, but that’s not the pomade’s fault! [9] X Research source"
    }
  ]
}