{
  "url": "https://www.wikihow.com/Evolve-Pichu",
  "title": "How to Evolve Pichu",
  "steps": [
    {
      "title": "Capture the Pichu in a Luxury Ball.",
      "content": "Capture the Pichu in a Luxury Ball. Like all the previous Generations, a Luxury Ball will provide a bonus to Friendship gained for certain activities."
    },
    {
      "title": "Perform Friendship raising activities where you first captured Pichu.",
      "content": "Perform Friendship raising activities where you first captured Pichu. A new addition to Generation VI Friendship is the bonus you get for performing Friendship-raising activities in the same spot you captured Pichu. This applies to using Vitamins, Rare Sodas, and EV-lowering berries."
    },
    {
      "title": "Walk with Pichu in your party.",
      "content": "Walk with Pichu in your party. You can get 2 Friendship points for walking 128 steps, but in Generation VI games you'll get the points less than 50% of the time."
    },
    {
      "title": "Take your Pichu to get a Massage.",
      "content": "Take your Pichu to get a Massage. In X and Y, you can find the massage lady in the house to the left of the Pokémon Center in Cyllage City. In Omega Ruby and Alpha Sapphire, you can find a groomer to the north of the Poké Miles shop in Mauville City. [1] X Research source Massages have a 6% chance of giving you a 30-point boost."
    },
    {
      "title": "Use Vitamins.",
      "content": "Use Vitamins. Like all Pokémon games, Vitamins will boost your Friendship by up to 5 (plus any bonuses). No new Vitamins have been introduced since Generation III."
    },
    {
      "title": "Use Wings to get a small boost.",
      "content": "Use Wings to get a small boost. Wings are items that are similar to Vitamins, but a little less powerful. They can be found randomly on the Driftveil Drawbridge and Marvelous Bridge. Wings can give you up to 3 Friendship."
    },
    {
      "title": "Level Pichu up by fighting.",
      "content": "Level Pichu up by fighting. When Pichu levels up in battle, you'll gain up to 5 Friendship. In Generation VI, levels attained by Rare Candy will not be rewarded with a Friendship Bonus"
    },
    {
      "title": "Take Pichu Super Training.",
      "content": "Take Pichu Super Training. Use the Super Training feature in Generation VI to boost Pichu's Friendship. You'll need to complete a few Regimens to unlock the Soothing Bag, which can give you a 20-point boost to your Friendship."
    },
    {
      "title": "Drink juices from the Juice Shoppe.",
      "content": "Drink juices from the Juice Shoppe. The Juice Shoppe in Lumiose City sells a variety of different juices, and a few of them will increase your Friendship. You'll need berries to create the juices. Rare Soda - 1 Lansat and 1 Starf Berry Colorful Shake - Any two berries Ultra Rare Soda - 1 Roseli and 1 Enigma Any colored juice"
    },
    {
      "title": "Don't let Pichu get knocked out.",
      "content": "Don't let Pichu get knocked out. Getting knocked out will drop your Friendship by 1, so make sure to pull Pichu out if its about to faint. Don't use any healing items on Pichu."
    },
    {
      "title": "Avoid healing items.",
      "content": "Avoid healing items. The healing items in the game can have a big negative impact on your Friendship. Do all of your healing at the Pokémon Center. The second value below applies if your Friendship is over 200. Energy Powder: -5/-10 points Heal Powder: -5/-10 points Energy Root: -10/-15 points Revival Herb: -15/-20 points"
    },
    {
      "title": "Check your Friendship level.",
      "content": "Check your Friendship level. You can find an estimation of your Pichu's Friendship level by visiting the checker in the Pokémon Fan Club in Laverre City. Make sure Pichu is the first Pokémon in your party. If you're playing Omega Ruby or Alpha Sapphire, see the Generation III instructions . 50 - 99: \"Hmm…I think you have a lot of time ahead of you to get to know one another better.\" 100 - 149: \"It's a little bit friendly to you… Something like that.\" 150 - 199: \"Well, I think you and Pichu will be an even greater combo someday!\" 200 - 254: \"You must really like your Pichu and always keep it by your side!\" 255: \"It's amazingly friendly toward you! It must be so happy spending every day with you!\""
    },
    {
      "title": "Level up Pichu once you think it's at 220 Friendship.",
      "content": "Level up Pichu once you think it's at 220 Friendship. You'll have to guess since the checker only tells you the range you're in. You can level Pichu up through battle or by using a Rare Candy, Rare Soda, or Ultra Rare Soda. If Pichu doesn't evolve, its Friendship is not 220."
    },
    {
      "title": "Capture Pichu is a Luxury Ball and give it as Soothe Bell.",
      "content": "Capture Pichu is a Luxury Ball and give it as Soothe Bell. Like Generation III, these will give your Pichu a Friendship boost. They work a little differently in Generation IV though; the Luxury Ball only gives a bonus when leveling up and walking, and the Soothe Bell will give a 50% boost to all Friendship activities."
    },
    {
      "title": "Walk with Pichu in your party.",
      "content": "Walk with Pichu in your party. Like Generation III, you'll gain 1 Friendship every 256 steps. You'll gain a bonus if your Pichu is in a Luxury Ball."
    },
    {
      "title": "Get your Pichu a massage.",
      "content": "Get your Pichu a massage. There are a couple of different massage locations that can give you a Friendship boost. You can only get one massage every 24 hours. Diamond, Pearl, Platinum - The massage girl in Veilstone City will give you a 3-point boost. Diamond, Pearl, Platinum - A massage at the Ribbon Syndicate will give you a 20-point(!) boost if your Friendship is less than 100. Black and White - A massage from the lady on Castelia Street can give you up to 30 Friendship points. Black 2 and White 2 - The massage lady can be found at the Medal Office, and gives the same bonuses as the one from Black and White."
    },
    {
      "title": "Use Vitamins to gain Friendship.",
      "content": "Use Vitamins to gain Friendship. Like the previous Generations, Vitamin items will give you a good Friendship boost. No new Vitamins were introduced in Generation IV or V."
    },
    {
      "title": "Level Pichu up for a Friendship boost.",
      "content": "Level Pichu up for a Friendship boost. You'll get a few Friendship points every time Pichu levels up"
    },
    {
      "title": "Use EV-lowering berries.",
      "content": "Use EV-lowering berries. EV-lowering berries can give you a big boost in Friendship. Give your Pichu Pomeg, Kelpsy, Qualot, Hondew, Grepa, or Tamato berries for up to 10 Friendship, depending on the current Friendship level."
    },
    {
      "title": "Don't let Pichu get knocked out.",
      "content": "Don't let Pichu get knocked out. Like all other Generations, getting knocked out will lower Pichu's Friendship by 1. Switch Pichu out with another Pokémon if it looks like it's going to faint."
    },
    {
      "title": "Don't use any healing items on Pichu.",
      "content": "Don't use any healing items on Pichu. Healing items have a major negative effect on your Friendship, and it can take a while to make the loss back. Avoid the following items, and do all of your healing at a Pokémon Center instead: Energy Powder: -5 points Heal Powder: -5 points Energy Root: -10 points Revival Herb: -15 points"
    },
    {
      "title": "Check your Pichu's Friendship (Generation IV).",
      "content": "Check your Pichu's Friendship (Generation IV). If you're playing the Generation IV games, you can check Pichu's happiness by visiting the Pokémon Fan Club in Hearthome City. Make sure Pichu is the first Pokémon in your party. The phrase that the checker says will change depending on Pichu's Friendship level, and the phrases for Platinum are different. 50 - 99: \"You should treat it better. It's not used to you.\" (D,P) \"It's feeling neutral toward you. It's up to you to change that.\" (Plat) 100 - 149: \"It's quite cute.\" (D,P) \"It's warming up to you. That's my impression.\" (Plat) 150 - 199: \"It's friendly towards you. It looks sort of happy.\" (D,P) \"It's quite friendly to you. It must be happy being with you.\" (Plat) 200 - 254: \"I get the feeling that it really trusts you.\" (D,P) \"It's very friendly toward you. I can tell you treat it kindly.\" (Plat) 255: \"It looks really happy! It must love you a lot.\" (D,P) \"It simply adores you! Why, I feel like I am intruding!\" (Plat)"
    },
    {
      "title": "Check your Pichu's Friendship (Generation V).",
      "content": "Check your Pichu's Friendship (Generation V). If you're playing the Generation V games, you can find the Friendship checker at the Pokémon Fan Club in Icirrus City. The phrase will change depending on Pichu's Friendship level: 70 - 99: \"The relationship is neither good nor bad… It looks neutral.\" 100 - 149: \"It is a little friendly to you… That's what I'm getting.\" 150 - 194: \"It is friendly to you. It must be happy with you.\" 195 - 254: \"It is quite friendly to you! You must be a kind person!\" 255: \"It is super friendly to you! I'm a bit jealous!\""
    },
    {
      "title": "Level Pichu up once you think it is at Friendship level 220 or higher.",
      "content": "Level Pichu up once you think it is at Friendship level 220 or higher. Since you won't know the exact number unless you're checking in every time you raise your friendship, you'll have to guess based on the phrase and the actions you perform. When you level up Pichu when it has a Friendship of 220 or greater it will evolve immediately into Pikachu. If Pichu doesn't evolve when leveled up, then its Friendship is not at 220 yet."
    },
    {
      "title": "Catch Pichu in a Luxury Ball.",
      "content": "Catch Pichu in a Luxury Ball. A Luxury Ball will give a bonus point to every Friendship-boosting activity. You can buy Luxury Balls from most stores."
    },
    {
      "title": "Give Pichu a Soothe Bell.",
      "content": "Give Pichu a Soothe Bell. If Pichu is holding this item, it will gain an additional Friend point for every Friendship-boosting activity. This stacks with the Luxury Ball, meaning if you use both Pichu will gain 2 extra points every time you perform a Friendship-boosting activity. You can find a Soothe Bell at the Pokémon Fan Club."
    },
    {
      "title": "Walk 256 steps with Pichu in your party.",
      "content": "Walk 256 steps with Pichu in your party. The walking requirements for gaining Friendship were cut in half for Generation III, meaning you'll get a point every 256 steps. This offsets the lack of grooming options for your Pokémon in the Generation III games."
    },
    {
      "title": "Use Vitamin items to get a boost.",
      "content": "Use Vitamin items to get a boost. Vitamin items give you a 2 - 5 point boost depending on your current Friendship level (the higher the Friendship, the lower the boost). Vitamins include all of the vitamins in Generation II, as well as the following additions: Zinc PP Max"
    },
    {
      "title": "Level Pichu up to gain Friendship.",
      "content": "Level Pichu up to gain Friendship. If Pichu has less than 100 Friendship, it will get a 5-point boost every time it levels up. This drops to a 3-point boost over 100, and a 2-point boost over 200."
    },
    {
      "title": "Give Pichu some EV-lowering berries.",
      "content": "Give Pichu some EV-lowering berries. If you are deep into EV-training , you may be using EV-Berries on a regular basis. Any EV-lowering berries will give you a 2-point boost. These include: Pomeg Kelpsy Qualot Hondew Grepa Tamato"
    },
    {
      "title": "Avoid getting knocked out.",
      "content": "Avoid getting knocked out. If Pichu faints during a battle, it will lose a Friendship point. Switch Pichu out if it looks like it's going to get knocked out soon. Don't use any healing items either (see the next step)."
    },
    {
      "title": "Don't use healing items on Pichu.",
      "content": "Don't use healing items on Pichu. Healing items have the largest negative effect on Friendship in the game. Do all of your healing and reviving at a Pokémon Center. [2] X Research source Energy Powder: -5 points Heal Powder: -5 points Energy Root: -10 points Revival Herb: -15 points"
    },
    {
      "title": "Check Pichu's Friendship level.",
      "content": "Check Pichu's Friendship level. While you can't see an exact number for your Friendship level, you can talk to a special Friendship checker character to get an approximation of your current level. You can find her in Verdanturf Town, in the house in the bottom-left corner. Make sure Pichu is the first Pokémon in your party and she will say a different phrase depending on your Friendship level. 50 - 99: \"It's not very used to you yet. It neither loves nor hates you.\" 100 - 149: \"It's getting used to you. It seems to believe in you.\" 150 - 199: \"It likes you quite a lot. It seems to want to be babied a little.\" 200 - 254: \"It seems to be very happy. It obviously likes you a whole lot.\" 255: \"It adores you. It can't possibly love you any more. I even feel happy seeing it.\""
    },
    {
      "title": "Level up Pichu once you feel its Friendship is 220.",
      "content": "Level up Pichu once you feel its Friendship is 220. If Pichu's Friendship is 220 or higher, it will evolve into Pikachu when leveling up. If Pichu doesn't evolve, it means its Friendship isn't a high enough level."
    },
    {
      "title": "Try to catch Pichu with a Friend Ball.",
      "content": "Try to catch Pichu with a Friend Ball. This is a special Poké Ball that sets the base Friendship stat for the Pokémon caught in it to 200, instead of the usual 70. Since Pichu evolves at 220 Friendship, you don't have much to do to get it to that level if you capture the Pichu in a Friend Ball. You can get Friend Balls from Kurt in Azalea Town if you bring him Green Apricorns."
    },
    {
      "title": "Keep Pichu in your party.",
      "content": "Keep Pichu in your party. You'll gain 1 Friendship point for every 512 steps that you walk in game. This is one of the easier ways to passively earn Friendship."
    },
    {
      "title": "Get Pichu a haircut from the Haircut Brothers.",
      "content": "Get Pichu a haircut from the Haircut Brothers. You can find the Haircut Brothers in Goldenrod Tunnel. The younger brother gives the biggest boost; up to 10 Friendship per haircut. You can only get a haircut once every 24 hours."
    },
    {
      "title": "Get Pichu groomed by Daisy.",
      "content": "Get Pichu groomed by Daisy. You can find Daisy Oak at Pallet Town between 3 and 4 PM. Getting Pichu groomed by Daisy will gain 3 Friendship."
    },
    {
      "title": "Give your Pichu Vitamins.",
      "content": "Give your Pichu Vitamins. There are several items in the game that are considered \"Vitamins\". Every time you give Pichu one of these, you'll gain between 3 to 5 Friendship: HP Up Protein Iron Calcium Carbos PP Up Rare Candy"
    },
    {
      "title": "Level Pichu up.",
      "content": "Level Pichu up. Pichu will gain Friendship every time it levels up. if Pichu has less than 100 Friendship, it will gain 5 per level. If it has between 100 and 200, it will gain 3. Above 200, you'll gain 2 Friendship per level."
    },
    {
      "title": "Challenge a Gym Leader with Pichu in your party.",
      "content": "Challenge a Gym Leader with Pichu in your party. Challenging a Gym Leader or Elite Four member while Pichu is in your party will give it a small boost of 1-3 Friendship."
    },
    {
      "title": "Avoid fainting.",
      "content": "Avoid fainting. If Pichu faints during battle, you'll lose 1 Friendship. Make sure to switch Pichu out if it looks like it's going to faint. Don't use healing items, though (more on that in the next step)."
    },
    {
      "title": "Don't give Pichu healing items.",
      "content": "Don't give Pichu healing items. If Pichu's health is low, try not to give it any healing items, including Energy Powder (-5 Friendship), Heal Powder (-5 Friendship), Energy Root (-10 Friendship), or Revival Herb (-15 Friendship). Do all of your healing and reviving at a Pokémon Center, which will not affect your Friendship."
    },
    {
      "title": "Check Pichu's Friendship level.",
      "content": "Check Pichu's Friendship level. You won't be able to find a number for Pichu's Friendship. Make sure Pichu is the first Pokémon in your party. You can find the Friendship checker lady in the house to the east of the Goldenrod City Department Store. She'll say a different phrase depending on Pichu's Friendship level: [3] X Research source 50 - 99: \"You should treat it better. It's not used to you.\" 100 - 149: \"It's quite cute.\" 150 - 199: \"It's friendly toward you. Sort of happy.\" 200 - 249: \"I get the feeling it really trusts you.\" 250 - 255: \"It looks really happy! It must love you a lot.\""
    },
    {
      "title": "Level Pichu up once you think it's Friendship is around 220.",
      "content": "Level Pichu up once you think it's Friendship is around 220. Pichu's Friendship must be at 220 or higher in order to evolve. The Friendship checker will not tell you exactly when you hit 220, so you'll have to do a bit of guesswork. You can level Pichu up by battling or by giving it a Rare Candy. If Pichu doesn't evolve, it's Friendship is not 220. Remember, the Friendship checker says the same phrase from 200 - 249, so you'll have to do a little bit of estimating as to your actual Friendship level."
    }
  ]
}