{
  "url": "https://www.wikihow.com/Get-Teenagers-to-Do-Chores",
  "title": "How to Get Teenagers to Do Chores",
  "steps": [
    {
      "title": "Explain to your teen why chores are important.",
      "content": "Explain to your teen why chores are important. Tell them that chores will help prepare them for adult life. It's important to make it clear that you aren't making them do chores as a way to control them. Instead, it's to teach them respect for others and self-reliance. If they understand this, they'll be more likely to help out. [1] X Research source Give them specific examples of how chores can help them. For example, cleaning their bedroom will help prepare them for living with a roommate or significant other."
    },
    {
      "title": "Assign your teen chores.",
      "content": "Assign your teen chores. Clearly outline the chores that your teen has to complete. Avoid assignments like, “Clean your room,” instead opting for, “Organize and vacuum your room.” The more upfront and clear you are, the less likely it is that you'll run into future arguments with your teen. There is no perfect amount of chores to assign your teen, but don't give them more than 1 or 2 on school nights. Anything can be a chore. They can range from taking out the trash, washing the dishes, or helping a younger sibling with homework. Limit the number of chores you assign. If you pile on a ton of things for your teen to do, they probably won't do all of them. Try only giving them the most important chores. Also, if your teen works or is part of extracurricular activities, you may consider giving them fewer chores."
    },
    {
      "title": "Teach your teen how to complete their chores.",
      "content": "Teach your teen how to complete their chores. Do the chore in front of your teen. Verbally and physically walk them through each and every step. Then, either test them on the steps or watch them complete the same chore to see if they retained the information. This should help prevent future issues about the quality of their work."
    },
    {
      "title": "Set a timeline for your teen's chores.",
      "content": "Set a timeline for your teen's chores. Do you want them to wash the dishes every night or once a week? Decide how often you want your teen to complete their chores and then tell them. It's important to do this ahead of time for transparency. If you spontaneously give them a chore as they are about to leave the house, they'll likely respond with resistance and frustration. [2] X Research source Create a weekly chore chart to help with this. Make a calendar for them and write down the due date for each chore."
    },
    {
      "title": "Establish a consequence and reward system.",
      "content": "Establish a consequence and reward system. Think of a consequence or reward that is predictable and can remain consistent. This will give your teen an incentive to complete their chores and more agency over their actions. Make it so it's up to them to decide whether they want to endure the consequences. [3] X Research source You can pick anything to use as a reward or a consequence. If they like watching TV, let them watch for an hour or 2 when they finish all their chores. Or, for example, you can give them an allowance for completing their chores. An allowance can be per chore, weekly, or monthly. Don't think of consequences on the spot. You'll be more likely to make a punishment that is too harsh."
    },
    {
      "title": "Make chores a family competition.",
      "content": "Make chores a family competition. It can be a competition between you and your teen or your teen and their siblings. The competition will not only give them an incentive to complete their chores but make it fun for them. [4] X Research source You can make a contest out of anything. For instance, you can create a competition where whichever child finishes their chores satisfactorily first can skip 1 of their chores for that week."
    },
    {
      "title": "Let your teen listen to music while they work.",
      "content": "Let your teen listen to music while they work. The upbeat music will make cleaning fun and help motivate them to work. The fast beat will also increase their productivity by giving them a fast and steady work pace. [5] X Research source Some good genres to listen to are rap, rock, and pop."
    },
    {
      "title": "Have your teen watch TV while they clean.",
      "content": "Have your teen watch TV while they clean. This can be great for immobile, repetitive chores like folding laundry. Watching TV or a movie will make their chores fun. They may even forget that they are doing chores. [6] X Research source Keep in mind that some teens may get too distracted by the TV."
    },
    {
      "title": "Let your teen pick out their cleaning tools.",
      "content": "Let your teen pick out their cleaning tools. They'll feel more independent if they have more control over their work. Also, they can get super cute or cool tools, like fun gloves to make cleaning more fun. [7] X Research source"
    },
    {
      "title": "Set a good example.",
      "content": "Set a good example. If you want your teen to do their chores, then you have to provide a good example. This will show them chores are not just busy work but are an important part of adult living. So, keep your spaces clean and consider doing the laundry or washing the dishes from time to time. [8] X Research source"
    },
    {
      "title": "Communicate openly with your teen.",
      "content": "Communicate openly with your teen. Ask them how their chores are going. Talk to them about any issues, like things that should or need to be changed. Listen to them and don't be afraid to adjust their chores if things need to be changed. Being open and communicative shows your teen that you respect them and are reasonable. This'll make it more likely that they'll complete their chores. Be specific with your questions. You can ask about how the cleaning tools are holding up, how long it's taking your teen to complete their tasks, or if there is a chore they want to swap."
    },
    {
      "title": "Refrain from micromanaging your teen.",
      "content": "Refrain from micromanaging your teen. Once you give your teen their chores and deadlines, take a step back. Let them do the chore when and how they want to, as long as it's done well and on time. [9] X Research source Micromanaging will not only frustrate your teen, but it'll take away some of their independence and make it seem like you don't trust or respect them. This can result in fights. [10] X Research source"
    },
    {
      "title": "Keep your emotions in check.",
      "content": "Keep your emotions in check. If your teen doesn't do their chores, don't respond with anger. Instead, take a deep breath and stick to the consequences that you worked out with your teen. Keeping your responses predictable makes fights less frequently. [11] X Research source Don't be negative or demeaning and avoid saying things like, “You're such a slob.” It won't get your teen to do their chores and can hurt their self-image. It also can damage your mutual respect."
    },
    {
      "title": "Follow through with the consequences.",
      "content": "Follow through with the consequences. You can offer your teen 1 warning the first time they don't finish their chores. After that warning, it's important to enact the consequences you outlined. Even if your teen gets angry, still enact the consequences. [12] X Research source"
    }
  ]
}