{
  "url": "https://www.wikihow.com/Download-Minecraft-Maps",
  "title": "How to Download Minecraft Maps",
  "steps": [
    {
      "title": "Go to a Minecraft map website.",
      "content": "Go to a Minecraft map website. Skip this method on Android. Some common websites with user-created content include the following: MinecraftMaps - https://www.minecraftmaps.com/ Planet Minecraft - https://www.planetminecraft.com/projects/?platform=1 MinecraftSix - https://minecraftsix.com/category/minecraft-maps/"
    },
    {
      "title": "Select a map.",
      "content": "Select a map. Click on a map that you want to download. Doing so should open the map's page, from which point you can download the map. Alternatively, you can type the name of a map into the site's search bar—which you can usually find at the top of the site—and press ↵ Enter ."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . This button's location will depend on the site, so scroll down if you can't find the Download button. For some map sites, you may have to click another link or map image before you can click Download . You may also have to click SKIP AD in the top-right corner of the page to continue to the download page after clicking Download ."
    },
    {
      "title": "Wait for the map to finish downloading.",
      "content": "Wait for the map to finish downloading. Once the map's ZIP or RAR folder finishes downloading onto your computer, you can proceed."
    },
    {
      "title": "Unzip the folder",
      "content": "Unzip the folder . If you're on a Windows computer, you'll need to extract the files from the folder before you can install the map. On a Mac, simply double-clicking the folder will unzip it."
    },
    {
      "title": "Open the unzipped map folder.",
      "content": "Open the unzipped map folder. Double-click the folder to open it. There will be another folder inside."
    },
    {
      "title": "Double-click the folder inside of the map folder.",
      "content": "Double-click the folder inside of the map folder. This will most likely open to a folder full of files and folders, including several folders labeled DIM1 and DIM-1 . If so, the folder you just opened is the folder you'll need to copy."
    },
    {
      "title": "Select the map folder.",
      "content": "Select the map folder. On Windows, you must first click the \"Back\" button in the top-left corner of the File Explorer. Click the map folder to select it."
    },
    {
      "title": "Copy the map folder.",
      "content": "Copy the map folder. Press Ctrl + C (Windows) or ⌘ Command + C (Mac) to copy the folder. Now that you've copied the map folder, you can continue along to installing it on your computer or smartphone. On a Mac, you can also click Edit in the top-left corner of the screen and then click Copy in the drop down menu."
    },
    {
      "title": "Open the Minecraft Launcher.",
      "content": "Open the Minecraft Launcher. Double-click the Minecraft program icon, which resembles a block of dirt with a green tuft of grass on it."
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . It's in the upper-right corner of the Minecraft launcher window. Doing so prompts a menu at the top of the window."
    },
    {
      "title": "Click Launch Options.",
      "content": "Click Launch Options . This option is in the upper-right side of the launcher menu."
    },
    {
      "title": "Enable advanced settings.",
      "content": "Enable advanced settings. Click the grey switch below the \"Advanced Settings\" heading, then click OK on the Java warning."
    },
    {
      "title": "Click + Add new.",
      "content": "Click + Add new . It's near the top of the page."
    },
    {
      "title": "Click the \"Game directory\" switch.",
      "content": "Click the \"Game directory\" switch. It's on the left side of the page. Clicking it will make the switch turn green."
    },
    {
      "title": "Open the Minecraft game folder.",
      "content": "Open the Minecraft game folder. Click the green, right-facing arrow on the far-right side of the \"Game directory\" row in the middle of the page. This will open your Minecraft game folder. You can close the Minecraft launcher at this point."
    },
    {
      "title": "Double-click the saves folder.",
      "content": "Double-click the saves folder. This folder is inside of the game folder. Double-clicking it will open your Minecraft saves folder."
    },
    {
      "title": "Add your map folder.",
      "content": "Add your map folder. Click a white space inside of the saves folder, then press Ctrl + V (Windows) or ⌘ Command + V (Mac). Doing so will paste the map folder into the saves folder then make sure you hit the save button which adds it to your saved worlds. You can now select the map like any other saved map in the Singleplayer menu. On a Mac, you can also click Edit and then click Paste Item ."
    },
    {
      "title": "Open the iFunBox website.",
      "content": "Open the iFunBox website. Go to https://www.i-funbox.com/ on your computer. iFunBox is a program that allows you to place files on your iPhone or iPad."
    },
    {
      "title": "Click Download iFunBox.",
      "content": "Click Download iFunBox . This blue button is in the middle of the page."
    },
    {
      "title": "Locate the version you want to download.",
      "content": "Locate the version you want to download. Below your computer type's heading (Windows or Mac), find the most recent version of iFunBox. The different versions of iFunBox are dated, so the most recent version should have the most recent date next to it."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . It's a blue button to the right of the most recent version of iFunBox. Doing so will prompt the iFunBox setup file to begin downloading."
    },
    {
      "title": "Install iFunBox on your computer.",
      "content": "Install iFunBox on your computer. This process will vary depending on your computer type: Windows - Double-click the iFunBox setup file, click Yes when prompted, select a language, click I agree , click Next several times, uncheck the \"Additional software\" box, and click Install . Mac - Double-click the iFunBox DMG file, verify the file if prompted, and click and drag the iFunBox logo onto the \"Applications\" folder icon."
    },
    {
      "title": "Open iFunBox.",
      "content": "Open iFunBox. Double-click the iFunBox logo to open it."
    },
    {
      "title": "Connect your iPhone to your computer.",
      "content": "Connect your iPhone to your computer. Use the charger cord that came with your iPhone to do so. If iTunes opens when you do this, close it before continuing."
    },
    {
      "title": "Click the My Device tab.",
      "content": "Click the My Device tab. It's in the top-left side of the iFunBox window."
    },
    {
      "title": "Click Apps.",
      "content": "Click Apps . This tab is in the upper-left corner of the iFunBox left-hand column of options."
    },
    {
      "title": "Double-click Minecraft PE.",
      "content": "Double-click Minecraft PE . You may have to scroll down to find this option. A window will open."
    },
    {
      "title": "Double-click the Games folder.",
      "content": "Double-click the Games folder. It's at the top of the Minecraft PE window."
    },
    {
      "title": "Double-click the com.mojang folder.",
      "content": "Double-click the com.mojang folder. You should see this at the top of the window."
    },
    {
      "title": "Double-click the minecraftWorlds folder.",
      "content": "Double-click the minecraftWorlds folder. Doing so opens the folder in which all of your Minecraft maps are saved."
    },
    {
      "title": "Add your map folder.",
      "content": "Add your map folder. Click part of the grey space in the minecraftWorlds folder, then press Ctrl + V (Windows) or ⌘ Command + V (Mac). Doing so will add the map to your iPhone's Minecraft PE game. Keep in mind that some Minecraft maps aren't designed for Minecraft PE. These maps will still be playable on PE, but they may not work properly."
    },
    {
      "title": "Mcworld files.",
      "content": "Mcworld files. In this section, we will install a map with mcworld format. This is a modern format that allows you to quickly install a map."
    },
    {
      "title": "Open a browser on your Android.",
      "content": "Open a browser on your Android. Google Chrome or Firefox are two popular options."
    },
    {
      "title": "Go to a Minecraft map website.",
      "content": "Go to a Minecraft map website. Some common websites with user-created content for Minecraft Bedrock: ModBay - https://modbay.org/maps/ MCPEDL - https://mcpedl.com/category/maps/ Planet Minecraft - https://www.planetminecraft.com/projects/?platform=2"
    },
    {
      "title": "Select a map.",
      "content": "Select a map. Select a category and a version. Tap on a map that you want to download. Doing so should open the map's page, from which point you can download the map."
    },
    {
      "title": "Tap on mcworld-file.",
      "content": "Tap on mcworld-file. Doing so will prompt the file to download onto your Android. For some other maps, you will have to watch ads before downloading."
    },
    {
      "title": "Tap on downloaded file.",
      "content": "Tap on downloaded file. First, open the Downloads folder and find the downloaded file."
    },
    {
      "title": "Open file with Minecraft.",
      "content": "Open file with Minecraft. On some devices, you will be prompted to choose the open method. You need to choose Minecraft."
    },
    {
      "title": "Wait for the successful import.",
      "content": "Wait for the successful import. If the import is successful, you will see a notification."
    },
    {
      "title": "Open your Android's Play Store .",
      "content": "Open your Android's Play Store . It's a multicolored triangle-shaped app icon in the App Drawer. If you already have WinZip installed on your Android, skip to the \"Open a browser\" step."
    },
    {
      "title": "Tap the search bar.",
      "content": "Tap the search bar. It's at the top of the screen."
    },
    {
      "title": "Type in winzip.",
      "content": "Type in winzip . This will prompt a drop-down menu to appear below the search bar with the WinZip icon at the top."
    },
    {
      "title": "Tap WinZip - Zip UnZip Tool.",
      "content": "Tap WinZip - Zip UnZip Tool . The icon next to it resembles a folder with a vice around it. This will open the WinZip app page."
    },
    {
      "title": "Tap INSTALL.",
      "content": "Tap INSTALL . This green button is below the app's icon."
    },
    {
      "title": "Tap ACCEPT when prompted.",
      "content": "Tap ACCEPT when prompted. Doing so prompts WinZip to begin downloading to your Android. You can now begin searching for a map to download."
    },
    {
      "title": "Open a browser on your Android.",
      "content": "Open a browser on your Android. Google Chrome or Firefox are two popular options."
    },
    {
      "title": "Go to a Minecraft map website.",
      "content": "Go to a Minecraft map website. Some common websites with user-created content include the following: Planet Minecraft - https://www.planetminecraft.com/projects/?platform=2 MinecraftMaps - https://www.minecraftmaps.com/ MinecraftSix - https://minecraftsix.com/category/minecraft-maps/ MCPEDL - https://mcpedl.org/maps-minecraft-pe/"
    },
    {
      "title": "Select a map.",
      "content": "Select a map. Tap on a map that you want to download. Doing so should open the map's page, from which point you can download the map."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . Doing so will prompt the file to download onto your Android. For some map sites, you may have to tap another link or map image before you can tap Download . You may also have to tap SKIP AD in the top-right corner of the page to continue to the download page after tapping Download . If you have the option of selecting Download .ZIP , tap that instead."
    },
    {
      "title": "Tap WinZip when prompted.",
      "content": "Tap WinZip when prompted. Doing so will open the ZIP file in WinZip. You may also need to tap OK when prompted to continue."
    },
    {
      "title": "Tap and hold the map folder.",
      "content": "Tap and hold the map folder. A pop-up menu will appear after a few seconds. You may first have to tap the \"Back\" button in the top-left corner of the screen to view the zipped folder itself."
    },
    {
      "title": "Tap Unzip to….",
      "content": "Tap Unzip to… . It's at the top of the pop-up menu. Another menu will pop up."
    },
    {
      "title": "Tap My Files, then tap UNZIP HERE.",
      "content": "Tap My Files , then tap UNZIP HERE . Doing so will unzip the folder into the My Files folder."
    },
    {
      "title": "Tap the unzipped folder.",
      "content": "Tap the unzipped folder. It should open to another folder with the map's name. This is the map folder. If it opens to a folder full of files and folders, tap the \"Back\" button to go back to the first folder."
    },
    {
      "title": "Tap and hold the map folder.",
      "content": "Tap and hold the map folder. A pop-up menu will appear."
    },
    {
      "title": "Tap Copy to….",
      "content": "Tap Copy to… . It's in the middle of the menu."
    },
    {
      "title": "Navigate to the Minecraft game folder.",
      "content": "Navigate to the Minecraft game folder. To do so: Tap Storage Tap Internal (or SD if that's where Minecraft is saved). Scroll down and tap games Tap com.mojang Tap minecraftWorlds"
    },
    {
      "title": "Tap PASTE HERE.",
      "content": "Tap PASTE HERE . Doing so will paste the Minecraft map folder into the saved game folder for the Minecraft PE app, which means you'll be able to find the map itself in the map menu in Minecraft PE app."
    }
  ]
}