{
  "url": "https://www.wikihow.com/Get-Clear-Skin-by-Using-Milk-and-Honey",
  "title": "How to Get Clear Skin by Using Milk and Honey",
  "steps": [
    {
      "title": "Start with a clean face.",
      "content": "Start with a clean face. Wash your face using warm water and your favorite face wash. Rinse the soap off and pat your face dry with a soft, clean towel."
    },
    {
      "title": "Consider protecting your hair and clothes.",
      "content": "Consider protecting your hair and clothes. Because this face wash contains honey, it can get sticky—especially if you are going to leave it on your face for a while. You can protect your hair by pulling it back and away from your face and securing it with a headband, hair clip, or hair tie. You can protect your clothes by draping a towel over the front of your chest and shoulders."
    },
    {
      "title": "Find a small bowl or cup.",
      "content": "Find a small bowl or cup. You will be mixing only a small amount of milk and honey, so the bowl or cup does not have to be big. A small dessert bowl would be ideal."
    },
    {
      "title": "Pour some milk and honey into the bowl.",
      "content": "Pour some milk and honey into the bowl. You will need 1 tablespoon (14.8 ml) of raw honey and 2 tablespoons (29.6 ml) of milk. Not only is honey a great moisturizer, but it is also antibacterial, which makes it great for fighting off acne. [1] X Research source [2] X Research source Milk also makes a great moisturizer. It also helps tone and exfoliate the skin. If you have very sensitive skin, consider using 2 tablespoons (29.6 ml) of oat flour, 1 tablespoon (14.8 ml) of milk, and 2 teaspoons of honey. The oat flour will help ease skin issues, such as acne and eczema."
    },
    {
      "title": "Stir the two ingredients together using a fork.",
      "content": "Stir the two ingredients together using a fork. Keep doing this until the honey has dissolved in the milk completely. You want to end up with something a cream-like consistency."
    },
    {
      "title": "Apply the mixture to your face.",
      "content": "Apply the mixture to your face. You can do this by dipping a cotton round into the milk-and-honey mixture, or you can simply use your fingers. Gently work the face wash into your skin, using circular motions. Avoid the sensitive areas around your nose, mouth, and eyes."
    },
    {
      "title": "For a deep cleaning, let the mixture sit for 5 to 10 minutes.",
      "content": "For a deep cleaning, let the mixture sit for 5 to 10 minutes. You can rinse the mixture off immediately, or you can let it sit on your face for 5 to 10 minutes. This will allow the mixture to seep into your pores and clean them out more effectively."
    },
    {
      "title": "Rinse your face with cool water.",
      "content": "Rinse your face with cool water. Gently massage your skin with your fingers until you have gotten all of the mixture out. You may use some face wash if necessary."
    },
    {
      "title": "Gently pat your face dry.",
      "content": "Gently pat your face dry. Use a soft towel, and do not rub your face."
    },
    {
      "title": "Consider following up with some toner an moisturizer.",
      "content": "Consider following up with some toner an moisturizer. Once you have your face clean, you can wipe your face with a cotton ball soaked in toner. This will help tighten your pores and balance the pH of your skin. You may also apply some moisturizer after the toner."
    },
    {
      "title": "Start with a clean face.",
      "content": "Start with a clean face. Wash your face using warm water and your favorite face wash. Once you have cleaned your face, gently pat it dry with a clean towel."
    },
    {
      "title": "Consider protecting your clothes and hair.",
      "content": "Consider protecting your clothes and hair. Because you will be leaving this mask on your face for a while, you may want to protect your clothes and hair so that they do not get sticky. You can keep your hair from getting sticky by pulling it back and securing it with a headband, a hair clip, or a hair tie. You can keep your clothes from getting dirty by draping a towel over the front of your chest and shoulders."
    },
    {
      "title": "Find a small, microwave-safe container.",
      "content": "Find a small, microwave-safe container. You will be mixing your face mask in this. Because you will be using small amounts of milk and honey, the container you use a small bowl or mug. The container has to be microwave-safe."
    },
    {
      "title": "Pour some milk and honey into the container.",
      "content": "Pour some milk and honey into the container. You will need 1 tablespoon (14.8 ml) of raw honey and 1 tablespoon of milk. This will be enough for one face mask. If you have blackheads on your nose, you can cut a thin strip of cotton fabric. It needs to be long enough to fit over the bridge of your nose. You will be applying this over the mask, and later removing it. [3] X Research source"
    },
    {
      "title": "Mix the two ingredients together.",
      "content": "Mix the two ingredients together. Using a fork, briskly mix the milk and honey together until you get a thick consistency."
    },
    {
      "title": "Heat the mask in the microwave.",
      "content": "Heat the mask in the microwave. Put the container into the microwave and heat it for a few seconds. You want the mask to be warm to the touch, but not hot. Watch the mixture carefully, so that you do not accidentally scorch it."
    },
    {
      "title": "Apply the mask to your face.",
      "content": "Apply the mask to your face. Take the container out of the microwave and apply the mask to your face using your fingers or a brush. Gently massage the face mask into your skin using circular motions. Avoid the sensitive areas around your nose, mouth, and eyes. If you have blackheads on your nose, wash your hands first, then place the cotton strip down onto the bridge of your nose. Gently press the fabric down into the face mask."
    },
    {
      "title": "Leave the mask on for 10 to 15 minutes.",
      "content": "Leave the mask on for 10 to 15 minutes. Get into a comfortable position, and wait 10 to 15 minutes. You can lay down in bed, or sit back in a chair. Consider passing the time by reading a book, meditating, or listening to music."
    },
    {
      "title": "Wash the mask off.",
      "content": "Wash the mask off. Use cool water, and soap if necessary. If you put a cotton strip on your nose, make sure that the strip is completely dry, then gently pull it off your nose before washing the face mask off your face."
    },
    {
      "title": "Gently pat your face dry.",
      "content": "Gently pat your face dry. Use a soft, clean towel, and do not rub your face."
    },
    {
      "title": "Consider following up with some toner and moisturizer.",
      "content": "Consider following up with some toner and moisturizer. If you'd like, you can wipe your face down using a cotton ball soaked in some toner. The toner will help balance out the pH of your skin, as well as tighten the pores. Afterwards, you can apply your favorite moisturizer to help lock the moisture in."
    },
    {
      "title": "Start with a clean face.",
      "content": "Start with a clean face. Before you can use this scrub, you will need to make sure that your face is clean and free of makeup. Use warm water and your favorite face wash. Gently pat your face dry with a soft, clean towel."
    },
    {
      "title": "Consider using heat to open your pores.",
      "content": "Consider using heat to open your pores. This will help make the mask even more effective. You can open your pores up by leaning over a bowl of hot water so that the steam hits your face. You can also hold a hot towel against your face. Do this for a few minutes. [4] X Research source"
    },
    {
      "title": "Tie your hair back.",
      "content": "Tie your hair back. Because this mask contains honey, it can get very sticky, especially if it gets into your hair. You can prevent a sticky, hairy mess by pulling your hair back and securing it with a headband, hair clip, or hair tie."
    },
    {
      "title": "Find a small container to mix your ingredients in.",
      "content": "Find a small container to mix your ingredients in. A small dessert bowl or a cup would be ideal. Whatever you decide to use, make sure that you can easily reach into it; you will be applying the scrub with your fingers."
    },
    {
      "title": "Add some milk, honey, and ground almonds into the bowl.",
      "content": "Add some milk, honey, and ground almonds into the bowl. You will need 1 teaspoon of raw honey, 1 teaspoon of milk, and 1 tablespoon (14.8 ml) of ground almonds. If you do not have ground almonds, or if you cannot find ground almonds, you can make your own by grinding some almonds in a blender, coffee grinder, or food processor."
    },
    {
      "title": "Mix the ingredients.",
      "content": "Mix the ingredients. Using a spoon, mix the milk, honey, and ground almonds until you get a thick paste."
    },
    {
      "title": "Apply the scrub to your face.",
      "content": "Apply the scrub to your face. Scoop the scrub out of the container using your fingers and apply it to your face. Gently massage it across your skin, so that the almond grains can exfoliate your skin. Avoid the sensitive areas around your nose, mouth, and eyes."
    },
    {
      "title": "Rinse the mask off.",
      "content": "Rinse the mask off. Use cool water, and gently massage your face until you have rinsed the mask off completely. Rinse off with warm water."
    },
    {
      "title": "Dry your face using a towel.",
      "content": "Dry your face using a towel. Do not rub your face with the towel. Instead, gently press the towel against your face in a light, tapping motion."
    },
    {
      "title": "Consider following up with toner and moisturizer.",
      "content": "Consider following up with toner and moisturizer. If you wish, you can wipe your face with a cotton ball soaked in toner, and apply some moisturizer afterward. The toner will help tighten the pore and restore the pH of your skin, while the moisturizer will help lock the moisture in."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}