{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Bad-Friend",
  "title": "How to Get Rid of a Bad Friend",
  "steps": [
    {
      "title": "Ask to speak to them privately.",
      "content": "Ask to speak to them privately. Set a time to meet with them. Find a place away from other people where the two of you could talk. You could say, “Could I talk to you today after school? I'll meet you by the door.” Speak where nobody else can hear you. If someone comes by, ask them to give you some privacy."
    },
    {
      "title": "Be as honest as possible about your motives for ending the friendship.",
      "content": "Be as honest as possible about your motives for ending the friendship. You may feel courageous enough to address all of your concerns, or you may only feel brave enough to be vague. Be as honest as your comfort level allows, but sharing your feelings is beneficial. [2] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. Break the news kindly to your friend. Even if you are confronting them about their behavior, you can still be respectful toward them. [3] X Research source Use “I” statements like “I felt very hurt when you made fun of me,” or “I feel like I'm being used when I hang around you.” These statements express your feelings and avoid blame. Saying things like “You use me for my car” or “All you do is pick on me” can make the listener defensive."
    },
    {
      "title": "Address concerns you may have about your friend.",
      "content": "Address concerns you may have about your friend. If you are ending a relationship with your friend due to problems you have with their behavior -- for example, substance abuse, risky behavior, or poor school performance -- you may be doing a favor to them by pointing it out. Let them know you care about them, but no longer want to be around them when they are doing what they're doing. [4] X Research source You could say, “Shannon, I care about you. But it seems to me like you are drinking a lot these days. And I can't be around that anymore. I hope you can get yourself some help.” If you feel that discussing their behavior could get you into more trouble with them, however, you may not wish to discuss it with them."
    },
    {
      "title": "Put the blame on yourself.",
      "content": "Put the blame on yourself. It is important to avoid blaming or criticizing your friend. Focus on your own views, feelings, and values. Blaming yourself for the end of the friendship could be a way to avoid arguing. You could say that the friendship doesn't bring out the best in you, or that you don't like how it makes you feel. [5] X Research source You could say, “After we would hang out, I always felt really stressed. I don't want a friendship to feel like that.” Acknowledge your role in the breakdown of the friendship. You could say, “I was never comfortable with some of the stuff we did, but I never said anything. I'm sorry I wasn't honest with you about it at the time.” [6] X Research source"
    },
    {
      "title": "Tell them what you need.",
      "content": "Tell them what you need. Inform your friend of what you want going forward. You may decide you want to end all communication, or you may want to take a break from the person. Make sure you are clear and that your friend understands. You could say, “I'm sure it's not easy to hear, and it's not easy for me to say, but I don't want to hang out with you anymore. So I'm not going to answer your texts or spend time with you. I'm sorry that it has to be this way, but I can't keep this up anymore.”"
    },
    {
      "title": "Allow yourself to grieve.",
      "content": "Allow yourself to grieve. It's okay to be sad about the loss of your friendship, even if was not a good one. [7] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. You are likely to have had some amazing times together and valued your connection. [8] X Research source Understand that you might have some confusing emotions around the end of your friendship. You might be sad, relieved, angry, and peaceful… all at once. It might help you to clarify your feelings by writing in a journal or talking to another trustworthy friend or adult. [9] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. Take some time to yourself and do things you enjoy. Listen to your favorite music, exercise or go for a long walk, go out for coffee with a friend, or spend time in prayer. Reconnect with yourself."
    },
    {
      "title": "Remain polite to the friend when you see them.",
      "content": "Remain polite to the friend when you see them. Even though you are no longer friends with this person, you can still be polite to them. It costs you nothing to be respectful to someone else, even if you don't especially like them. Work with them on class projects if necessary. Focus on the task at hand. If your friend tries to stir up drama, you could say “Let's just focus on getting this project done.”"
    },
    {
      "title": "Set some boundaries.",
      "content": "Set some boundaries. If you need some space from your friend and are not comfortable talking with them about it, you may decide to opt for setting some of your own limits on how you spend time with them. Determine your comfort level and stick with it. For example, you may decide that you are only comfortable seeing your friend when around other friends, or you may only want to talk to them in school. You could decide you want to avoid answering their calls or reading their texts. If your friend asks you why you're being distant, you could say, “I just need some space,” or “I've got a lot on my mind” and leave it at that."
    },
    {
      "title": "Make excuses.",
      "content": "Make excuses. If your friend invites you somewhere, and you don't want to go, you could make an excuse to get out of the invitation. You could say you have a family commitment, too much homework, or are not feeling well, for example. However, keep in mind that this can get complicated, especially if you have some mutual friends. You will need to keep all of your excuses straight and this can get confusing. If your friend says, “Hey, want to hang out this weekend?” you could say, “I'm pretty busy all weekend with work and family stuff.” Keep in mind that if your friend doesn't know you want to stop being friends with them, you may need to keep making excuses for a long time to not see them, and that can be draining, not to mention dishonest. You will eventually need to be direct with your friend and stop making excuses. Making excuses will only lead to stress, so it's important to only use this as a very short-term solution if you feel that it is necessary. Don't make up an excuse to get out of hanging out with your friend and then do something else instead. If you are saying you're sick, stay home. Don't show up at a friend's house an hour later. This makes you look dishonest to everyone."
    },
    {
      "title": "Ask your parents to set limits.",
      "content": "Ask your parents to set limits. Ask your parents to “make” you stop hanging out with your friend. Have your parents help you put some distance between you and the friend. This may be easy if your parents do not like this friend. You could tell your friend that your parents want you to spend more time on your homework, or don't want you hanging out so late on weekends -- whatever excuse you need to employ to get out of the situation. Most parents are generally okay with being perceived as the “bad guy” in order to help their kid out of a difficult situation. Talk to your parents about having problems with a friend. Tell them why you no longer want to be friends with them, giving specific examples of their behavior. Ask your parents to help you manage the situation. You could say, “Lately Tara has been really mean. She's picking fights with me, and she's hanging around with a group of kids I'm not comfortable with. I really don't want to hang out with her outside of school anymore, so I was hoping you guys could help me. The next time she asks me to do something with her, could you help me find a way to tell her no?”"
    },
    {
      "title": "Write a letter.",
      "content": "Write a letter. Consider writing a letter if you want your friend to know how you feel, but you don't want to confront them directly. Writing a letter allows you to spend as much time as you need to get the words just the way you want them, and it also helps you make sense of your own feelings. You could say, “Dear Juan, I know you are wondering why I haven't been talking to you much lately. I thought I would write this letter to explain why.” Then you could tell your friend how you are feeling and what you would like to see happen going forward."
    },
    {
      "title": "Don't talk bad about your friend to other friends.",
      "content": "Don't talk bad about your friend to other friends. While you may no longer like or want to be around this person, take the high road and refuse to gossip about your friend or try to turn your other friends against them. If you are no longer friends with this person because they treated you badly, it may be only a matter of time before other friends begin to see this person's true colors on their own. If a friend of yours asks, “Why aren't you talking to Bennett?” you could say, “I really don't want to talk about him behind his back,” or “I'd like to keep it private right now.” If you need to vent about your situation, talk to someone not at all connected to your social circle. For example, reach out to a friend at another school, or your cousin who lives far away and ask if you could talk."
    },
    {
      "title": "Be prepared to feel uncomfortable around them.",
      "content": "Be prepared to feel uncomfortable around them. When there is unresolved tension in a relationship, it is usually fairly awkward to be around another person. This is why speaking to your friend in person is preferable to giving them the silent treatment if at all possible. You will likely feel less uncomfortable knowing where you stand with somebody. [10] X Expert Source Mary Church, PhD Research & Clinical Psychologist Expert Interview. 6 August 2021. If you are uncomfortable being around your friend, you could try moving away from them and trying to get some physical distance between the two of you. If you are hanging out in a group, try starting a separate conversation with someone else."
    },
    {
      "title": "Find a new circle of friends.",
      "content": "Find a new circle of friends. Having a group of friends who care about and value you is important. Feeling that you belong matters, particularly if you are a teenager. If you no longer feel that you fit in or belong with your group of friends, make some new friends or find a different group of people to hang out with. If you are friendly with a group of people you normally don't hang out with outside of school, like fellow band members or teammates, see if they want to get together outside of class or practice. If you are involved in any activities outside of school, like a part-time job or a youth group, try spending time with people you know from those places."
    },
    {
      "title": "End all communication as a last resort.",
      "content": "End all communication as a last resort. Cutting off your friend without warning may seem like the easiest solution, but it is not fair to them to not give them a chance to understand what is happening. Even if your friend was a bad, hurtful friend to you, they still have the right to know what is happening. [11] X Research source Do not “ghost” a friend just because you want to avoid confrontation (as long as you know that a confrontation would not end with a physical fight). Breaking up with a friend is uncomfortable and painful, but that doesn't mean you should avoid it. Ghosting a friend may cause you to lose some social clout. It makes you look like you took the easy way out. It can also cause the person you are ghosting a lot of pain and uncertainty. Consider which method would be the best way for you to stop communicating with a friend. For example, you might decide that it is best to tell them in-person, over the phone, or via email. Reader Poll: We asked 718 wikiHow readers to give us their opinion on the most effective way to avoid someone, and 44% said that completely cutting off all contact (including text, social media, and in-person communication) was the best strategy. [Take Poll]"
    },
    {
      "title": "Recognize when ending a friendship suddenly may be appropriate.",
      "content": "Recognize when ending a friendship suddenly may be appropriate. Most of the time, it is good to have a conversation with the other person to let them know you do not want to be friends anymore, no matter how vague and brief it may be. But there may be times when ghosting someone is the best option: Your friend enables your bad behavior, particularly if it is an addiction issue. [12] X Research source You feel controlled or manipulated by your friend, and worry how they would react to an announcement that you no longer wanted to be friends. [13] X Research source You fear for your safety, and are concerned about your physical well-being if you talk to your friend directly."
    },
    {
      "title": "Defriend",
      "content": "Defriend or block your friend from social networks. Cut off their access to your life on social media. Avoid messaging them or responding to their messages. [14] X Research source If you choose to remain friends with them on social media, prevent them from seeing posts you don't want them to see. Do not comment on their feeds. You could also choose to unfollow them so you no longer see their updates."
    },
    {
      "title": "Enlist help.",
      "content": "Enlist help. If you do not feel comfortable talking to your friend, you could ask your parents to get in touch with your friend's parents. This is an option you may want to use if you are feeling threatened by the other person. Otherwise, you may wish to try to handle it on your own first. [15] X Research source Ask your parents to inform your friend's parents about the situation, and/or that you no longer want to hang out with this person. You could say, “You know I've been trying to distance myself from Jamal, but he won't leave me alone. Do you think you could talk to his parents for me?” You could also ask a teacher or school guidance counselor for help. You could say, “I've been trying to work through some problems with David, but he won't leave me alone. I don't want to be friends with him anymore, and can't think of anything else to do. Could you help me?”"
    }
  ]
}