{
  "url": "https://www.wikihow.com/Feed-a-Sugar-Glider",
  "title": "How to Feed a Sugar Glider",
  "steps": [
    {
      "title": "Fill your glider's water bottle with fresh water.",
      "content": "Fill your glider's water bottle with fresh water. Sugar gliders may not drink very much, since they tend to get most of their water from the food they eat. However, you should always have a source of water in your glider's cage, should they get thirsty. Keep a water bottle or water dish in their cage to make sure they have access to water at all times. [1] X Research source Change the water daily so that your glider always has fresh water. Using filtered water is recommended, but not a necessity. [2] X Research source"
    },
    {
      "title": "Balance out your glider's diet.",
      "content": "Balance out your glider's diet. Sugar gliders are omnivores, and in the wild, they feed on a mixture of insects and vegetation such as eucalyptus leaves, honeydew, sap, and flower nectar. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source While it can be difficult to emulate the diet exactly, it's frequently possible to give your glider the necessary nutrients with other foods. You'll want to make sure your glider is getting protein, calcium, fruits and vegetables, and enough vitamins in their meals. Many owners of sugar gliders recommend that the glider's meal should consist of a ratio of half protein, a quarter of fruits, and a quarter of vegetables. [4] X Research source Usually, though, gliders require less protein in the winter, since it isn't their breeding season."
    },
    {
      "title": "Find sources of protein for your glider.",
      "content": "Find sources of protein for your glider. Feeding your glider too much protein should be avoided, and generally, non-breeding gliders require less protein than breeding gliders. [5] X Research source However, all gliders need some protein in their meals. Some sources of protein that you could give your glider are: [6] X Research source Bugs (unaffected by pesticides) Hard-boiled eggs Plain nonfat yogurt Boiled chicken or turkey"
    },
    {
      "title": "Give your glider fresh fruits and vegetables.",
      "content": "Give your glider fresh fruits and vegetables. The best way to ensure your glider gets a variety of nutrients is to give them an assortment of fruits and vegetables. Things like apples, carrots, spinach (in moderation), melons, occasional berries, sweet potatoes, and kiwis can be great for your sugar glider - just make sure to thoroughly wash them beforehand, and to remove the peel if the food has one. [7] X Research source Gliders prefer sweet fruits and vegetables, but these should not be the core of their diet to ensure they get enough nutrients. Avocado, lettuce, chives, and onions should not be fed to your glider. The same applies to grapes, which have not been studied enough to know if they're safe to feed to gliders. [8] X Research source If you're in a pinch, dried or thawed-out frozen fruits and vegetables are acceptable, but avoid giving your glider canned fruits and vegetables."
    },
    {
      "title": "Make sure your glider has a good source of calcium.",
      "content": "Make sure your glider has a good source of calcium. One of the most common health problems in pet sugar gliders is calcium deficiency, which can lead to weakened bones and teeth, and even paralysis. [9] X Research source To avoid this, you'll want to make sure your glider gets plenty of calcium. Choose foods that are high in calcium, such as papaya, plain yogurt, and the occasional berry. If you're feeding your glider foods especially high in phosphorus - such as eggs or meats - you'll want to make sure your glider gets extra calcium that feeding, since phosphorus can make it hard for your glider to absorb calcium. Many owners of sugar gliders recommend using a calcium supplement that doesn't have phosphorous in it."
    },
    {
      "title": "Recognize what foods should only be used as treats.",
      "content": "Recognize what foods should only be used as treats. Sugar gliders enjoy treats just as much as humans do, but it's important not to overfeed treats, as doing so can hurt your glider's health. In particular, fatty foods and extremely naturally sweet foods should be given sparingly. Generally, it's best to avoid excessive feeding of: Mealworms or gut-loaded crickets, due to their high fat content [10] X Research source Foods of a moderate to high oxalate level (such as, but not limited to, pears, beets, and figs) due to the potential for loss of calcium absorption [11] X Research source Raw corn, due to its high sugar content [12] X Research source Unsalted raw nuts and seeds, due to their high fat content"
    },
    {
      "title": "Know what not to feed your glider.",
      "content": "Know what not to feed your glider. Some foods aren't safe to give gliders under any circumstances, and can result in severe illness or death. Avoid feeding your glider foods such as: Foods that are considered toxic (e.g. apple seeds, tomato stems and leaves, and eggplant stems and leaves) Sugary foods, such as chocolate or candy, or foods with artificial sweeteners [13] X Research source Foods treated with pesticides or preservatives Bugs and insects from outside (they may have been affected by pesticides) If you don't know whether or not the food is safe, err on the side of caution and don't give it to them until you've gotten a chance to look it up or ask the vet."
    },
    {
      "title": "Talk to your glider's veterinarian.",
      "content": "Talk to your glider's veterinarian. If you're unsure of how to feed your sugar glider, or you notice problems with their weight or eating habits, the best choice is to take your glider to the vet. The vet can help you balance out your sugar glider's diet and make recommendations for what you should and shouldn't feed them."
    },
    {
      "title": "Ensure your glider gets a variety of foods.",
      "content": "Ensure your glider gets a variety of foods. In order to make sure that your glider is getting a variety of nutrients, and to keep them from getting bored with their meals, it's a good idea to change up the foods they get in their feedings. For example, if you give your glider eggs as protein one day, give them another form of protein the next day, like bugs or yogurt. Establishing a meal routine may make this easier. Gliders are sometimes finicky about their meals and may pick out their favorite parts of the meal, leaving the rest of it alone. To reduce the risk of them doing this, it's important to chop the food and mix it thoroughly. [14] X Research source"
    },
    {
      "title": "Feed your glider in the morning and at dusk.",
      "content": "Feed your glider in the morning and at dusk. It's important to feed your glider a small meal at the start of the day, to avoid them being too hungry during the day. Since sugar gliders are nocturnal creatures, though, it's a good idea to feed them the majority of their meal just before the sun fully goes down, to ensure that they eat enough. [15] X Research source You can leave a bowl of dry glider food in the cage in case your glider is hungry outside of their normal feeding times."
    },
    {
      "title": "Cut up the food before feeding.",
      "content": "Cut up the food before feeding. Your sugar glider can't eat giant chunks of food, so before you give it to them, chop the food into small pieces. This will make it easier for them to eat their meals, and will encourage them to eat a wider variety as well. [16] X Research source"
    },
    {
      "title": "Don't overfeed your sugar glider.",
      "content": "Don't overfeed your sugar glider. Wild gliders tend to eat about 15 to 20 percent of their body weight in food, and pet gliders should eat less than that since they aren't as active as their wild counterparts. Feeding your glider too much can result in weight gain, which can lead to health problems down the road and even premature death. [17] X Research source Overfeeding too much of certain foods (e.g. too much protein or too much of foods high in phosphorus) can result in health problems, such as bone weakening."
    },
    {
      "title": "Remove perishable foods from the cage after feeding.",
      "content": "Remove perishable foods from the cage after feeding. After your sugar glider eats, you should remove foods that can rot from their food dish. Gliders can be picky eaters, so they may not want to eat their food if it isn't fresh anymore. [18] X Research source"
    },
    {
      "title": "Try mounting the food bowls higher up in the cage.",
      "content": "Try mounting the food bowls higher up in the cage. Sugar gliders are natural tree-dwellers and eat many types of vegetation, so if the food is up higher in their cage, they may be more inclined to eat (and it will also help keep the bowls cleaner). [19] X Research source"
    },
    {
      "title": "Give treats sparingly.",
      "content": "Give treats sparingly. You don't want to spoil your sugar glider or encourage picky eating, and many of the treats that are recommended for gliders are not good for them when eaten all the time. Only about 5% of a sugar glider's daily meals should consist of treats, [20] X Research source and that doesn't mean you should give your glider treats every day!"
    }
  ]
}