{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Fever-Fast",
  "title": "How to Get Rid of a Fever Fast",
  "steps": [
    {
      "title": "Use over-the-counter medication for fevers caused by colds and flu.",
      "content": "Use over-the-counter medication for fevers caused by colds and flu. Taking an over-the-counter medication is one of the fastest and easiest ways to get rid of a fever. If your fever is from a viral infection, then it may be difficult to treat. According to internal medicine physician David Nazarian, viruses live in the cells of the body and reproduce rapidly. They do not respond to antibiotics. Instead, Nazarian recommends taking acetaminophen (Tylenol) to help bring down your fever. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When taking acetaminophen, always make sure that you follow the instructions on the package and do not exceed the recommended dosage. Don't give aspirin to children, because it can cause Reye's syndrome if they have viral infections. Acetaminophen is a safer option. Look for \"children's\" formulas, and follow dosage instructions carefully. According to Nazarian, NSAIDs like ibuprofen (Motrin, Advil) and naproxen (Aleve) can also help when you have a fever. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Try taking a cool bath.",
      "content": "Try taking a cool bath. Internal medicine physician David Nazarian agrees that bathing or showering in cool water may help to cool down your body faster. Fill the bathtub with cool to lukewarm water or adjust your shower until the water is cool or lukewarm. Soak in the tub or stand in the shower for 10 to 15 minutes to help cool down your body. Do not take a freezing cold shower or add ice to the bath to bring down your fever. You can also use a damp washcloth to give yourself a cool sponge bath."
    },
    {
      "title": "Drink water.",
      "content": "Drink water. According to internal medicine physician David Nazarian, a fever can dehydrate you and this may make matters worse. Make sure that you drink plenty of water to help your body combat the fever and keep yourself well-hydrated as well. [5] X Research source Kids may also need to drink an electrolyte fluid, such as Pedialyte, to help replenish lost electrolytes. Ask your child's pediatrician first to see if this is necessary. Gatorade or Powerade are also an option. You may want to cut these with water to reduce the sugar and calorie content."
    },
    {
      "title": "Take supplements to boost immune health.",
      "content": "Take supplements to boost immune health. Supplements can fill nutritional needs, helping your body fight the cause of fever. Taking multivitamins will not fight the fever directly, but it will strengthen your body so it can fight. Take a multivitamin with vitamins A, C, E, and B-complex vitamins, magnesium, calcium, zinc, and selenium. Take 1 or 2 capsules or 1–2 teaspoons (4.9–9.9 mL) of fish oil every day for the omega-3 fatty acids. You can also try zinc or echinacea. Probiotic supplements or foods (like yogurt with \"active cultures\") will introduce more Lactobacillus acidophilus bacteria into your system and improve your immune health. But if you have a severely compromised immune system, talk to your doctor before taking probiotics. Do not take herbal supplements without consulting your doctor. Some can interact with prescription medication or medical conditions."
    },
    {
      "title": "Administer the \"wet socks treatment\" at home.",
      "content": "Administer the \"wet socks treatment\" at home. Some holistic medicine practitioners believe that if you go to sleep wearing wet socks, your body will defend itself by circulating blood and lymphatic fluid to your wet feet. The theory goes that this, in turn, stimulates the immune system and triggers a more restful, healing state of sleep. There’s no scientific evidence that this actually works. [6] X Research source However, the cool socks might bring some relief from the discomfort of your fever. To try this method: Soak a pair of thin cotton socks in lukewarm water, then wring them out until they're moist but not dripping. Put them on when you're going to bed, then wear a thicker pair of dry socks over them. Take 2 nights off after 5 to 6 days."
    },
    {
      "title": "Cool children's bodies if necessary.",
      "content": "Cool children's bodies if necessary. Adult bodies can handle fever pretty well, but children may suffer febrile seizures if the fever rises too high. In fact, a high fever is the leading cause of seizures in children between 6 months and 5 years of age. [7] X Research source Reese Graves MD, Karen Oehler MD, PhD, Leslie Tingle MD. Febrile Seizures : Risks, evaluation and prognosis American Family Physician 2012, Jan 15 85 (2) 149-153 If the child's temperature rises over 104 °F (40 °C), or begins to rise quickly, start cooling them off immediately. Remove their clothing. Use a sponge or washcloth to pat tepid (not cold) water all over their body to bring down their temperature. [8] X Research source Fisher, Randall G. and Thomas G. Boyce. Moffet's Pediatric Infectious Diseases. Philadelphia: Lippincott, Williams &amp; Wilkins, 2005. Applying ice to a fevered body can be dangerous if done incorrectly. It causes shivering, which actually raises the body temperature. They may apply ice in a hospital setting, but it's best to use tepid water at home. Call the doctor immediately if your child’s fever spikes. They will either direct you to take the child to an ER or provide detailed guidance for how to care for them at home. Call 911 or your local emergency number for emergency assistance if the child has a seizure. Your doctor may administer rectal diazepam to treat febrile seizure in your child."
    },
    {
      "title": "Stay as comfortable as possible.",
      "content": "Stay as comfortable as possible. Sometimes a fever just has to run its course, but you can do things to make yourself more comfortable while you wait for it to go away. For example, placing wet towels on your skin won't reduce the fever, but it may help to reduce discomfort from the fever. Moisten a washcloth or hand towel with cool water and apply it to your neck or forehead. Wear warm clothes and stay under blankets to deal with the chills from the fever. If you feel hot, then just use a light sheet and wear light, breathable clothes."
    },
    {
      "title": "Hydrate and eat mild foods to recover from gastrointestinal (GI) infection.",
      "content": "Hydrate and eat mild foods to recover from gastrointestinal (GI) infection. GI infections are more commonly known as the \"stomach flu.\" Symptoms include diarrhea, stomach pain, nausea or vomiting, and muscle or headaches. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source They often also present with a low-grade fever. GI infections resolve on their own in 3 to 7 days, so you just need to take care of yourself until yours passes. Drink an 8 fl oz (240 mL) glass of water at least 8 to 10 times per day, especially if you are vomiting. [10] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Watch for symptoms of dehydration in children, as this needs emergency attention. In babies, signs include fewer wet diapers, decreased fontanelle (soft spot on the skull) size, sunken eyes, and lethargy. If you see these symptoms, call emergency services or seek immediate medical attention. The BRAT (Bananas, Rice, Applesauce, and Toast) diet is often recommended for GI trouble, but the evidence to support it is weak. The American Academy of Pediatrics does not recommend using it for children, as it does not provide adequate nutrition. [11] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Eat reasonably, stay away from greasy, heavy, and spicy foods, and drink plenty of water."
    },
    {
      "title": "Consume herbs known to fight fever.",
      "content": "Consume herbs known to fight fever. Herbal remedies can be taken in a number of forms: powder, capsule, or tincture. Many people prefer to brew hot teas with dried herbs. The warm liquid soothes the throat while the herbs may fight the fever. To brew an herbal tea, steep 1 teaspoon (about 2/3 g) of the herb in a cup of hot water for 5 to 10 minutes for leaves or flowers or 10 to 20 minutes for roots. Talk with your doctor before consuming any herbs or natural remedies, as they may interfere with prescription medication or other medical conditions. The following herbs all improve immune function, but can have some negative side effects: Green tea may increase your anxiety levels and raise your blood pressure. You may want to avoid drinking green tea if you have diarrhea, glaucoma, or osteoporosis. Consult your doctor if you have liver disease. Cat's claw may make autoimmune disorders or leukemia worse. It can also interfere with certain types of medications, so talk to your doctor before drinking it. Reishi mushroom. You may find this as a tincture rather than in dried form. Take 30-60 drops 2 to 3 times a day. Reishi may interact with some medicines as well, like blood thinners and blood pressure medications."
    },
    {
      "title": "Take care not to spread infection.",
      "content": "Take care not to spread infection. [12] X Research source While you are ill, make sure to cover your mouth and nose while coughing and sneezing, and dispose of used tissues properly. Wash your hands often with antibacterial soap. Keep your distance from uninfected people and public spaces as much as possible. Don't share drinking glasses or utensils with anyone, and don't take it personally if your partner doesn't want to kiss you for a while! Have children play with hard toys that can be cleaned easily in the sink with soap and water."
    },
    {
      "title": "Recall if anyone around you has been sick lately.",
      "content": "Recall if anyone around you has been sick lately. If someone in your household or workplace has been ill in the recent past, you may have picked it up from them. Children often spread illnesses to each other, and may catch a cold or the flu from friends at school or the playground. [13] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source If you know that the other person’s illness resolved on its own, you can relax a bit. Your illness will likely also resolve with rest and plenty of water."
    },
    {
      "title": "Keep a temperature log.",
      "content": "Keep a temperature log. If the illness doesn't resolve on its own, you want to be able to give the doctor a detailed log of how the fever has behaved. They may be able to use that information to diagnose you with a specific illness. For example, you may assume you have a simple cold, but after a week, your fever spikes suddenly. Odds are you have a secondary bacterial infection like an ear infection or pneumonia. Some cancers, like non-Hodgkin lymphoma, on the other hand, cause a fever at night, but none during the day. Make sure to take your temperature multiple times every day until the fever recedes. Night fevers may be a sign of tuberculosis or HIV/AIDS."
    },
    {
      "title": "Record your other symptoms.",
      "content": "Record your other symptoms. Make note of anything that seems out of the ordinary, even if it doesn't make you feel ill, necessarily. Unexpected weight change, for example, can point to several causes. Your other symptoms may be able to point to the organ system being affected, which will narrow the field for diagnosis. For example, a cough suggests a lung problem like pneumonia. Burning during urination points to a bladder or kidney infection. A sore throat could be a symptom of a cold, flu, or strep infection."
    },
    {
      "title": "Seek medical advice.",
      "content": "Seek medical advice. Give your temperature log and list of symptoms to your doctor, who will try to diagnose the cause of the fever. They will do a physical examination to find further clues about the source of the fever. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The history you provided and physical exam will help the doctor narrow down the possible causes. The causes can be easily confirmed or ruled out with lab analysis or imaging. Common tests your doctor may order include a physical examination, white blood cell count, urine analysis, blood cultures, and a chest X-ray."
    },
    {
      "title": "Follow your doctor's instructions for viral infections.",
      "content": "Follow your doctor's instructions for viral infections. Cold and flu are by far the most common viral infections doctors see. However, there are a number of somewhat less common viral infections that also won't respond to antibiotic treatment. Croup, bronchiolitis, varicella (chickenpox), roseola, and hand, foot, and mouth disease are caused by viruses too. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Many of these resolve on their own; for example, foot, hand, and mouth disease usually passes within 7 to 10 days. For most of these viruses, good self-care (proper hygiene, nutrition, and rest) are the best treatment, but talk to your doctor. Ask your doctor how long the virus will last and whether there are any ways to speed up the healing process. Ask what you should be looking for as you monitor your symptoms, as some normally harmless viruses can progress and become dangerous. Foot, hand, and mouth disease, for example, can cause fatal brain inflammation in rare cases."
    },
    {
      "title": "Take antibiotics for bacterial infections.",
      "content": "Take antibiotics for bacterial infections. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Bacterial infections are highly treatable, and generally respond well to antibiotics. Antibiotics either kill the bacteria or stop them from reproducing in your body. From there, your immune system can fight off the remaining infection. Bacterial pneumonia is a common cause of fever. The doctor will take a blood sample to determine which bacteria is causing the fever. They will use that information to decide which antibiotic to use to fight the infection and reduce your fever. Don’t take antibiotics for a fever unless your doctor prescribes them. Antibiotics won’t fight a viral infection, and taking them when you don’t need them could do more harm than good."
    },
    {
      "title": "Talk to your doctor about other causes of fever.",
      "content": "Talk to your doctor about other causes of fever. Viruses and bacteria are the most common causes of fever, but they aren't the only ones. Fevers can also be caused by reactions to immunizations, allergic reactions, and chronic inflammatory conditions such as IBS (inflammatory bowel disease) and arthritis. If you get frequent or recurring fevers, talk to your doctor about potential causes. You may be able to treat the underlying condition and reduce the number of fevers you get."
    },
    {
      "title": "Use a digital thermometer to take your temperature orally.",
      "content": "Use a digital thermometer to take your temperature orally. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source A digital thermometer can measure your temperature orally, rectally, or in the armpit. You should not try to measure your own temperature rectally, so use the thermometer either orally or in the armpit. Clean the thermometer with cold water, then rubbing alcohol, then a final cold water rinse. Never use a thermometer that has been used rectally in your mouth. Don't eat or drink anything for 5 minutes before taking your temperature. This could change the temperature in your mouth and lead to an inaccurate measurement. Put the tip of the thermometer under your tongue and hold it still for about 40 seconds. Most digital thermometers beep to let you know when they've finished taking the measurement. After reading the measurement, rinse the thermometer in cold water, clean it with rubbing alcohol, and rinse it again to sterilize it."
    },
    {
      "title": "Take your temperature in the armpit.",
      "content": "Take your temperature in the armpit. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Either remove your shirt or wear a loose shirt that allows you to take the measurement at your armpit. Place the tip of the thermometer directly into your armpit. It should only be touching your skin, not the fabric from your shirt. Wait for about 40 seconds or until you hear the beep letting you know the measurement is finished."
    },
    {
      "title": "Decide which measurement method to use on a child.",
      "content": "Decide which measurement method to use on a child. Take the child’s temperature by whichever method they can realistically handle. A 2-year-old, for example, cannot hold a thermometer still under the tongue long enough to get an accurate reading. Ear thermometers have been met with mixed results. The most accurate measurement you can take is a rectal one, which is not painful for the child. This is recommended for children between three months and four years of age. [19] X Research source"
    },
    {
      "title": "Take the child’s temperature rectally with a digital thermometer.",
      "content": "Take the child’s temperature rectally with a digital thermometer. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Make sure the tip of the thermometer has been sterilized in rubbing alcohol then rinsed clean. After drying the tip, lubricate it with petroleum jelly for ease of movement. Have the child lie down on their back, then lift their legs into the air. For babies, you should lift the legs like you would when changing a diaper. Gently insert the thermometer about 1 ⁄ 2 to 1 inch (1.3 to 2.5 cm) into the rectum, but don't force it against resistance. Hold the thermometer still for about 40 seconds or until it beeps to let you know the measurement is ready."
    },
    {
      "title": "Interpret the results.",
      "content": "Interpret the results. You may have heard that a healthy body temperature is 98.6 °F (37.0 °C), but this is merely a guideline. A normal body will fluctuate in temperature, even in the course of 1 day. Temperature is usually lower in the morning and warmer in the evening. Furthermore, some people simply have higher or lower resting temperatures. A healthy daily range can be from 97.5 to 98.8 °F (36.4 to 37.1 °C). The guidelines for feverish temperatures are as follows: Children: 100.4 °F (38.0 °C) measured rectally; 99.5 °F (37.5 °C) measured orally; 99 °F (37 °C) measured in the armpit. [21] X Research source Adults: 100.7 °F (38.2 °C) measured rectally; 100 °F (38 °C) measured orally; 99 °F (37 °C) measured in the armpit. Temperatures under 100.4 °F (38.0 °C) are considered \"low-grade\" fevers. You shouldn't worry about a fever until it reaches 102 °F (39 °C)."
    },
    {
      "title": "Get vaccinated.",
      "content": "Get vaccinated. Viral infections don't respond well to treatment. But scientists have developed vaccines that can prevent a large number of viral infections. Talk to your doctor about which vaccinations they would recommend. Having children vaccinated at an early age can prevent many potentially serious illnesses later in life. Consider getting vaccinations against: Pneumococcal infection, which protects against the bacteria that cause ear infection, sinus infection, pneumonia, meningitis, and sepsis. [22] X Research source Olaf Hoffman, R Joeng Weber,Pathophysiology and Treatment of Bacterial Meningitis, Therapeutic Advanced Neurological Disorders , 2009 2 (6) 1-7. H influenzae, which causes upper respiratory infections like ear and sinus infections. It can also cause more serious infections, like meningitis. Children age 11 years and older should be vaccinated for meningitis. [23] X Research source Pathophysiology of Meningiocococcal Meningitis and Septicemia Journal of Clinical Pathology, Volume 56, Issue 12, 941 doi 10.1136/jcp 5612.941 Vaccines don't cause autism. The only researcher who made this claim was faking his data and concealing payments from lawyers, [24] X Research source > and every independent researcher since then has found no link. Vaccinations must be licensed by the FDA and be extensively tested to show that they work. Vaccinating your child could save their life."
    },
    {
      "title": "Get enough sleep every day.",
      "content": "Get enough sleep every day. According to internal medicine physician David Nazarian, getting enough sleep can help boost your immune system. [25] X Research source Adults who get less than 6 hours of sleep per night have impaired immune responses. This reduces your ability to fight off infection. Try to get at least 7 to 8 hours of uninterrupted sleep every night to keep your immune system strong."
    },
    {
      "title": "Eat a healthy diet.",
      "content": "Eat a healthy diet. [26] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source What you put into your body can have a massive effect on its ability to fight infection. Nourish your body with whole foods like fruits, vegetables, and whole grains. Avoid processed foods, which tend to be high in sugars and saturated fats that are bad for your body. Make sure to get 1000 mg of Vitamin C and 2000 IU of Vitamin D per day. Vitamins A and E are also important for their antioxidant properties."
    },
    {
      "title": "Avoid contact with germs.",
      "content": "Avoid contact with germs. [27] X Research source If you know someone is ill, keep your distance until they've recovered and are no longer contagious. Even when there's no visible illness around you, maintain good hygiene practices. Wash your hands after leaving public spaces, and always wash them before eating. If you don't have access to water in public, carry a small bottle of hand sanitizer with you."
    },
    {
      "title": "Reduce your stress levels.",
      "content": "Reduce your stress levels. [28] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Studies show that high levels of stress actually depress the immune system's response. This leaves you vulnerable to illness. Make room in your life for relaxation and activities you enjoy, and try to be present in those moments when you have them. Yoga and meditation are popular activities that help people reduce their stress levels. Aerobic exercise also has a significant impact on stress. Try to get at least 150 minutes of aerobic exercise every week, in periods of 30 to 40 minutes per day. When you exercise, aim for a target heart rate appropriate to your age. Calculate this by subtracting your age from the number 220. [29] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Target heart rate is 60-80% of your Max Heart Rate depending on fitness."
    }
  ]
}