{
  "url": "https://www.wikihow.com/Extend-a-Cable-Cord",
  "title": "How to Extend a Cable Cord",
  "steps": [
    {
      "title": "Measure the distance from the cord to where you’re plugging in to.",
      "content": "Measure the distance from the cord to where you’re plugging in to. Pull your cable cord out. Grab a measuring tape and calculate how far you want to extend your cable cord by measuring from the end of the cord to the location where you want to plug it in. Write this measurement down to determine how long of an extension cable you need. Add 1–2 feet (0.30–0.61 m) to this measurement if you want some slack in the cord."
    },
    {
      "title": "Find the cord’s connection type by inspecting the end of the cord.",
      "content": "Find the cord’s connection type by inspecting the end of the cord. Grab the cable that you’re going to extend and inspect the metal piece attached to the end of it. Look in the middle of this metal piece to see if it has a thin piece of metal sticking out or a hole in the middle. If it has a piece of metal sticking out, it is a plug. If it has a hole in the middle, it is a jack. Jot down the type of connection and take a photo with your phone. [1] X Research source The photo will give you a reference point when it comes time to buy your coupler. Plug and jack connections are commonly referred to as male and female connections. If you are extending the cable cord coming out of your wall, it’s going to have a plug at the end."
    },
    {
      "title": "Look at the port you want to reach and see if it’s a jack or plug.",
      "content": "Look at the port you want to reach and see if it’s a jack or plug. Inspect the port that you’re trying to connect your cord to. Check to see if there is a thin piece of metal sticking out, or a small opening for a plug. If you’re plugging in to a cable box or modem, it is almost certainly a jack. Take a picture and jot down the connection type to determine what kind of cord and coupler you need. [2] X Research source"
    },
    {
      "title": "Measure the diameter of the cable cord to figure out its type.",
      "content": "Measure the diameter of the cable cord to figure out its type. Coaxial cables come in a variety of frequencies, and your extension cord must be the same type as your current cord. To determine the type, measure the diameter of the cord. If it is 0.275 inches (0.70 cm), you have a standard RG-6 coaxial cord. [3] X Research source The coaxial cords used for cable are basically universal—they’re almost always RG-6 cables. Occasionally you will see an older cable that is a little longer, but the vast majority of cords are essentially the same. If you don’t have an RG-6 coaxial cord, write the diameter of your coaxial cable down and take it with you to the store. There are actually four different sizes of coaxial cable that are commonly used, but RG6 is what you're going to see in mostly residential applications."
    },
    {
      "title": "Purchase a coaxial coupler that matches the end of your preexisting cord.",
      "content": "Purchase a coaxial coupler that matches the end of your preexisting cord. Go to your local electronics store and ask to see coaxial couplers for cable cords. The coupler is basically a small metal adapter that connects 2 coaxial cords. Your coupler will go at the end of the cord you’re extending, so at least 1 of the ends must have a jack for your extension cord. The other side must match the connection at the end of your preexisting wire. [4] X Research source If you have a plug at the end of your cable cord, get a jack-to-jack coupler. If you have a jack at the end of the cord, get a plug-to-jack coupler. Use your photo to double-check that the coupler will fit the cord that you’re connecting to. Coaxial couplers are also known as F-type adapters. Make sure that you aren’t buying an F-type adapter kit designed for installing coaxial kits, though. These kits are designed for installing an adapter on a new cord."
    },
    {
      "title": "Pick up an extension cord that matches the coupler and port.",
      "content": "Pick up an extension cord that matches the coupler and port. Purchase an extension cord that is long enough to reach the port you’re connecting the preexisting cable to. Make sure that your cord has a plug on one end to connect it to the coupler. The other end of the cord must have a connection that matches the port in your cable box, modem, or server. If your port has a plug in it, get an extension cord with a jack on one end and a plug in the other. If your port has a jack in it, get an extension cord with 2 plugs. This cord must be the same type as the cord already in your wall. In most cases, this is going to be an RG-6 cord."
    },
    {
      "title": "Twist the coaxial coupler into the cord you’re extending.",
      "content": "Twist the coaxial coupler into the cord you’re extending. Install the coaxial coupler by hand. Simply slide the coupler into the cord you’re extending and turn it clockwise until the threading catches. Continue turning the coupler until it won’t turn any further. You do not typically need tools for this. [5] X Research source If you have a coupler with flat sides around the bracket, use a wrench to screw the coupler in and secure the connection between the coupler and the cord. [6] X Research source"
    },
    {
      "title": "Attach your extension cable to the coaxial coupler.",
      "content": "Attach your extension cable to the coaxial coupler. Take the plug end of your extension cable and screw it into the coupler by twisting it clockwise. Continue turning the cord until it won’t move any further. If you have a coupler with flat sides around the rim of the connection, use a wrench to twist it into place. [7] X Research source"
    },
    {
      "title": "Plug in your extended cable and test the connection.",
      "content": "Plug in your extended cable and test the connection. Take the final end of the cord and lift it up to the port that you’re connecting to. Insert the cord into the port and turn it clockwise to secure it. Continue turning the end of the cord until won’t move any further. Once your cable is extended, turn your TV, modem, or server on and test the connection. [8] X Research source"
    }
  ]
}