{
  "url": "https://www.wikihow.com/Get-Rainbow-Haki",
  "title": "How to Unlock the Rainbow Haki in Blox Fruits: Quick & Easy Walkthrough",
  "steps": [
    {
      "title": "Reach level 1950 or higher.",
      "content": "Reach level 1950 or higher. The Rainbow Haki quest has a single prerequisite in Blox Fruits : you must be at least level 1950 to start it. So, if you want to change the color of your character’s aura with the Rainbow Saviour haki and you’re not yet level 1950, take the time to level your character up. Take on other quests and improve your stats as much as possible in the meantime! [1] X Research source You can level up by simply playing the game—or, if you want to do it as fast as possible, check out our tips below."
    },
    {
      "title": "Speak to the Horned Man on Floating Turtle Island.",
      "content": "Speak to the Horned Man on Floating Turtle Island. To do this, head to the Third Sea—which you can unlock in the game by reaching level 1500, completing the Colosseum quest, defeating Don Swan, and helping King Red Head in the Second Sea. At Floating Turtle Island, climb the tree in front of the Mansion to find the Horned Man in a tree house; he’ll task you with defeating 5 boss enemies. [2] X Research source The 5 bosses you’ll need to defeat are: Stone Hydra Leader Kilo Admiral Captain Elephant Beautiful Pirate Remember that the Horned Man will only give you one task at a time. The first time you speak to him, he’ll tell you to defeat Stone. Then, you’ll have to return to him after Stone to get the next task, and so on."
    },
    {
      "title": "Defeat Stone.",
      "content": "Defeat Stone. You can find Stone in Port Town (an area in the Third Sea). He uses the X and Z moves of Bomb Fruit, so if you’re unsure how to defeat him, try the “hit and run” tactic. Dash in, attack him quickly, then run away before he can retaliate; this can protect you from getting hurt, so you can focus on dodging his projectile attacks with Instinct. [3] X Research source You may have to hop between servers to find Stone. If you do, just make sure to talk to the Horned Man each time you enter a new server. Stone’s respawn time is 20 minutes. Once you defeat Stone, remember to head back to the Horned Man for your next target!"
    },
    {
      "title": "Defeat the Hydra Leader.",
      "content": "Defeat the Hydra Leader. Track down the Hydra Leader in front of the palace at Hydra Island, which is also in the Third Sea. Since many of her attacks are short-range, try to keep your distance and attack her from afar whenever possible. Although she has a single long-range attack called Arrows of Imprisonment, you can still dash or even jump in the air to avoid it! [4] X Research source As with each boss enemy, return to the Horned Man after defeating the Hydra Leader."
    },
    {
      "title": "Defeat Kilo Admiral.",
      "content": "Defeat Kilo Admiral. Look for Kilo Admiral in the Third Sea, under the root and above the hill of the Great Tree. Like the Hydra Leader, Kilo Admiral’s attacks don’t have much range, so try to avoid her in combat, if possible. Try using the Phoenix or Love fruits against her while dodging her attacks; she uses Sharkman Karate’s M1 move and Kilo’s X and C moves. [5] X Research source"
    },
    {
      "title": "Defeat Captain Elephant.",
      "content": "Defeat Captain Elephant. The next target is Captain Elephant, located at the Floating Turtle Island in the Third Sea. He’s near the Mansion, right of the Forest Pirates. He uses the skills of the Twin Hooks to fight, so keep your distance to avoid his Prehistoric Punt attack, and dodge left or right to avoid his hooks in a Sky Cyclone attack. [6] X Research source"
    },
    {
      "title": "Defeat Beautiful Pirate.",
      "content": "Defeat Beautiful Pirate. The final target you’ll have to defeat is Beautiful Pirate; he’s located in the Beautiful Pirate domain on Floating Turtle Island. He’s also the most difficult boss to defeat, with plenty of speed and attacks that deal high amounts of damage, so do your best to keep your distance in battle and use long-range fruits (or the Buddha fruit) to attack him. [7] X Research source If you have low HP, try sky-camping above Beautiful Pirate to recover your health before fighting him. After defeating Beautiful Pirate, you don’t need to return to the Horned Man; you’ll automatically complete the quest and unlock the Rainbow haki! However, there’s still one more step needed to equip it."
    },
    {
      "title": "Go to the Mansion and speak to the Barista.",
      "content": "Go to the Mansion and speak to the Barista. With the Rainbow haki unlocked, you can equip it by visiting the Barista NPC (who’s nearby since the Mansion is also on Floating Turtle Island). Talking to them opens the Colors list; simply scroll down to the “Rainbow Saviour” option and click the yellow “Enable Color” button to turn it on. [8] X Research source With that, you’ve successfully unlocked and equipped the Rainbow haki in Blox Fruits —congratulations!"
    },
    {
      "title": "Complete quests",
      "content": "Complete quests The easiest (and fastest) way to level up in Blox Fruits is simply to complete quests. Many quests are available in the game; whenever an NPC has a task for you, accept it and complete it for a quick EXP gain. As a bonus, quests also typically reward you with weapons, other items, and in-game currency—all of which can help you with your goal of leveling up. [9] X Research source"
    },
    {
      "title": "Farm mobs",
      "content": "Farm mobs Grouping enemies together is an efficient way to defeat them; it’ll save you time and help you grind for EXP as you play. Use the Buddha fruit or Elemental fruits to help you defeat mobs of NPCs, as well as melee fighting styles (since you’ll probably need to fight off a mob of enemies at close range). [10] X Research source Mobs of pirates are especially great for farming EXP."
    },
    {
      "title": "Defeat bosses",
      "content": "Defeat bosses Boss enemies are essentially notable NPCs that are more difficult to defeat (and grant more EXP) in Blox Fruits . Whenever possible, look for boss enemies to fight and take on quests to fight boss enemies instead of run-of-the-mill NPCs. Additionally, try to take on bosses that match your current level; you’ll pick up lots of EXP that way! [11] X Research source Just remember that boss enemies are called “bosses” for a reason! They’re often challenging, so face them when you feel prepared, and keep in mind that you may struggle to defeat some of them."
    },
    {
      "title": "Visit areas with content for your current level",
      "content": "Visit areas with content for your current level Each area in Blox Fruits is designed for a certain level—and you can get the most EXP by farming in an area that matches your level. For example, various islands in the First Sea are built for levels 0 through 700, while the Second Sea is designed for levels 701 through 1500, and the Third Sea is designed for levels 1501 through 2450+. [12] X Research source If you’re thinking of visiting a particular island to farm EXP in Blox Fruits , figure out what its level range is first—and go for the island that matches your level. For example, say you’re level 1632, and you’re ready to grind for EXP. That means you might want to do so on Hydra Island in the Third Sea since it’s built for levels 1575 through 1700!"
    },
    {
      "title": "Buy EXP boosters",
      "content": "Buy EXP boosters EXP boosters increase the amount of EXP you collect in Blox Fruits for a certain amount of time, which can help you level up much faster than you normally would! You can buy them with Robux in the Blox Fruits shop. If you have the funds, consider getting an EXP booster right before farming EXP in the game to maximize your profits. [13] X Research source There are also codes that unlock EXP boosters in the game—so if you get one, use it!"
    }
  ]
}