{
  "url": "https://www.wikihow.com/Get-Sweat-Stains-out-of-Bras",
  "title": "How to Get Sweat Stains out of Bras",
  "steps": [
    {
      "title": "Find a bucket or basin to wash your bras in.",
      "content": "Find a bucket or basin to wash your bras in. Fill the bucket or basin with cold water and laundry detergent. Add a bit of 3% hydrogen peroxide to the bucket and mix thoroughly. This method works well if you have larger stains, as you will soak the entire bra. It would be ideal for sports bras which can get soaked in sweat while exercising. 3% hydrogen peroxide can be used on any bra: white, solid colored, or patterned. It should not leach color from the fabric. Do not use 35% hydrogen peroxide, as this can bleach your bras. [2] X Research source"
    },
    {
      "title": "Add your sweat-stained bras.",
      "content": "Add your sweat-stained bras. Gently swirl the bras around the bucket or basin. You may want to use a long spoon or stick to mix up the solution. Make sure each bra gets thoroughly saturated. You can let your bras sit in this solution for an hour or so."
    },
    {
      "title": "Remove the bras from the basin.",
      "content": "Remove the bras from the basin. Rinse them under cool water. Do not wring out the bra, but gently press the water out of it. Try gently rolling the bra in a towel to remove the excess moisture. [3] X Research source"
    },
    {
      "title": "Dry your bras in the sun.",
      "content": "Dry your bras in the sun. The sun is an excellent bleaching agent, so this will help remove any lingering stains. [4] X Research source Using a dryer to dry your bras can damage the fabric, including the elastic and underwire, and leave your bras misshapen."
    },
    {
      "title": "Mix together water and baking soda.",
      "content": "Mix together water and baking soda. Create a thick paste and apply onto yellowed areas. Be sure to get the paste on every part of the stain. Baking soda can be used to clean any bra: white, solid colored, or patterned. It is a mild abrasive so would be great for textured fabric. Baking soda also helps remove odors from clothing, so this may be the best method if your bras are retaining an unpleasant scent along with the stains. [5] X Research source"
    },
    {
      "title": "Leave your bras in the sun for a few hours.",
      "content": "Leave your bras in the sun for a few hours. This gives the baking soda time to remove the stain. Sunlight will also help the solution work."
    },
    {
      "title": "Peel the paste off the bra.",
      "content": "Peel the paste off the bra. Be gentle, as you don't want to ruin the fabric. Removing the paste before laundering will keep your washing machine or sink from getting gunked up."
    },
    {
      "title": "Wash your bra as usual.",
      "content": "Wash your bra as usual. Laundering will remove the rest of the paste and leave your bra smelling fresh. Do not wring out the bra, but gently press the water out of it. Try gently rolling the bra in a clean towel to remove the excess water. [6] X Research source"
    },
    {
      "title": "Dry your bra in the sun.",
      "content": "Dry your bra in the sun. The sun is an excellent bleaching agent, so this will help remove any lingering stains. [7] X Research source Using a dryer to dry your bras can damage the fabric, including the elastic and underwire, and leave your bras misshapen. [8] X Research source"
    },
    {
      "title": "Squeeze the juice from a fresh lemon into a bowl.",
      "content": "Squeeze the juice from a fresh lemon into a bowl. Add an equal amount of cold water. Mix the solution thoroughly. Lemon juice should only be used to clean white bras. It can further stain colored fabrics so do not use this method for patterned or solid colored bras."
    },
    {
      "title": "Rub the lemon juice solution on the sweat stain.",
      "content": "Rub the lemon juice solution on the sweat stain. Be sure to saturate every part of the stain. You can use an old toothbrush to rub the lemon juice into the fabric."
    },
    {
      "title": "Leave the solution on the stain for an hour.",
      "content": "Leave the solution on the stain for an hour. This gives the lemon juice time to soak into the fabric and remove the stain. [9] X Research source"
    },
    {
      "title": "Launder your bra as usual.",
      "content": "Launder your bra as usual. Do not wring out the bra, but gently press the water out of it. Try gently rolling up your bra in a clean towel to remove the excess water. [10] X Research source"
    },
    {
      "title": "Dry your bra in the sun.",
      "content": "Dry your bra in the sun. The sun is an excellent bleaching agent, so this will help remove any lingering stains. [11] X Research source Using a dryer to dry your bras can damage the fabric, including the elastic and underwire, and leave your bras misshapen. [12] X Research source"
    },
    {
      "title": "Pour a small amount of liquid dish soap on the stain.",
      "content": "Pour a small amount of liquid dish soap on the stain. Any dish soap you have in your kitchen will work: Dawn, Joy, Palmolive, etc. Use this method on white bras only. The bleach in the soap will remove color from dyed material, so don't use this for patterned or solid colored bras."
    },
    {
      "title": "Rub the soap into the stain.",
      "content": "Rub the soap into the stain. Saturate the stain completely. Be sure to get the edges of the stain as well. You can even use an old toothbrush to rub the soap into the fabric."
    },
    {
      "title": "Wash the bra in cold water.",
      "content": "Wash the bra in cold water. You can add a mild laundry detergent to help remove the soap. You may want to wash the bra again to ensure all the soap and detergent will be removed. [13] X Research source Do not wring out the bra, but gently press the water out of it. Try gently rolling up the bra in a clean towel to remove excess water. [14] X Research source"
    },
    {
      "title": "Dry your bra in the sun.",
      "content": "Dry your bra in the sun. The sun is an excellent bleaching agent, so this will help remove any lingering stains. [15] X Research source Using a dryer to dry your bras can damage the fabric, including the elastic and underwire, and leave your bras misshapen. [16] X Research source"
    },
    {
      "title": "Pour color-safe bleach on the stains.",
      "content": "Pour color-safe bleach on the stains. [17] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. Be sure to get all stained edges and areas, inside and out. Rub the bleach into the fabric, or use a toothbrush to scrub the area. Wash your hands when you are done. Color-safe bleach can be used on any bra: white, solid colored, or patterned. The active ingredient is hydrogen peroxide, which does not leach dye from fabric like chlorine bleach."
    },
    {
      "title": "Let the bleach sit for several minutes.",
      "content": "Let the bleach sit for several minutes. This will give the bleach time to break down the stain and remove it from the fabric. You can leave the bleach on for up to an hour if the stains are severe. [18] X Research source"
    },
    {
      "title": "Launder your bra as usual.",
      "content": "Launder your bra as usual. [19] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. The detergent will help remove the bleach as well as the stains. Do not wring out the bra, but gently press the water out of it. Try gently rolling the bra in a clean towel to remove the excess water. [20] X Research source"
    },
    {
      "title": "Dry your bra in the sun.",
      "content": "Dry your bra in the sun. The sun is an excellent bleaching agent, so this will help remove any lingering stains. [21] X Research source Using a dryer to dry your bras can damage the fabric, including the elastic and underwire, and leave your bras misshapen. [22] X Research source"
    }
  ]
}