{
  "url": "https://www.wikihow.com/Find-the-Square-of-a-Number",
  "title": "How to Find the Square of a Number",
  "steps": [
    {
      "title": "Learn how to do basic multiplication.",
      "content": "Learn how to do basic multiplication. When you square a number, you simply multiply the number by itself so it's important to know how to multiply . To make it easier to square commonly used single digits, try to memorize basic times tables . [1] X Research source For example, learn how to multiply single digit times tables."
    },
    {
      "title": "Multiply the single digit number by itself.",
      "content": "Multiply the single digit number by itself. Write down the number you want to square. Remember that when you're squaring a number, you multiply it by the same number, not 2. [2] X Research source For example, 5 2 {\\displaystyle 5^{2}} is not 5 x 2 = 10. Instead, it's 5 x 5 = 25."
    },
    {
      "title": "Recognize other terms for squaring a number.",
      "content": "Recognize other terms for squaring a number. If you read word problems asking you to square a number, keep in mind that they may also ask you to raise the number to the 2 power or factor. This is just another way of asking you to square the number. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You may also see a problem written as 6^2. This is another way of asking you to square 6."
    },
    {
      "title": "Distinguish between squaring and finding the square root.",
      "content": "Distinguish between squaring and finding the square root. It's easy to get these terms mixed up, but remember that finding the square root of a number is the opposite of squaring a number. Finding the square root means that you're looking for the number that can be multiplied by itself to get the number in the square. [4] X Research source For example, 9 2 {\\displaystyle 9^{2}} means 9 x 9 = 81 while √9 = 3 because 3 2 {\\displaystyle 3^{2}} is equal to 9."
    },
    {
      "title": "Write the problem out.",
      "content": "Write the problem out. To find the square of a number with more than 1 digit, it will help if you rewrite the problem as a double digit multiplication problem. Start by writing the same number on top of itself. [5] X Research source For example, to do 24 2 {\\displaystyle 24^{2}} , write 24 x 24."
    },
    {
      "title": "Multiply the number on the bottom ones place by the 1 directly above it.",
      "content": "Multiply the number on the bottom ones place by the 1 directly above it. Write a line below the numbers and place the result below the ones space. [6] X Research source For example, with 24 x 24, multiply the 4 by 4 to get 16. Write a 6 below the ones space and carry the 1 above the top tens number."
    },
    {
      "title": "Multiply the bottom ones place by the top tens number.",
      "content": "Multiply the bottom ones place by the top tens number. Take the same number on the bottom and multiply it by the top tens number. Remember to add the number you carried and write the result below the line. [7] X Research source For example, with 24 x 24, multiply 4 by 2 and add the 1 you carried. The result below the line should be 96."
    },
    {
      "title": "Put a 0 under the result and multiply the bottom tens number by the top ones.",
      "content": "Put a 0 under the result and multiply the bottom tens number by the top ones. The 0 will act as a placeholder. Write the result of multiplying the bottom tens number by the top ones number next to the 0. [8] X Research source For the 24 x 24 example, multiply 2 by 4. You should now see 80 below the 96."
    },
    {
      "title": "Multiply the bottom tens number by the top tens number.",
      "content": "Multiply the bottom tens number by the top tens number. If you carried any numbers, remember to add them to your result. Write the result below the line. [9] X Research source To finish multiplying 24 by 24, multiply the 2 by 2 to get 4. The result on this line should be 480."
    },
    {
      "title": "Add the 2 results to get your answer.",
      "content": "Add the 2 results to get your answer. If you multiplied a number with 3 or more digits, you'll have more lines to add together. Write the answer from your results to show the square of the number. Add 96 + 480 to get the answer for 24 x 24. 24 2 {\\displaystyle 24^{2}} = 576."
    },
    {
      "title": "Square the numerator",
      "content": "Square the numerator . Multiply the top number of the fraction by itself to find its square. Write the result and place the fraction line below it. [10] X Research source For example, with ( 8 / 2 ) 2 , you'd multiply 8 by 8 to get a numerator of 64."
    },
    {
      "title": "Square the denominator.",
      "content": "Square the denominator. Multiply the bottom number of the fraction by itself. Write the result of this square below the fraction line. [11] X Research source So for ( 8 / 2 ) 2 , multiply 2 by 2 to get a denominator of 4."
    },
    {
      "title": "Simplify the result",
      "content": "Simplify the result . While you could leave the fraction large or improper, most directions will tell you to simplify or reduce the result. If you have an improper fraction, turn it into a mixed number. [12] X Research source For example, ( 8 / 2 ) 2 = ( 64 / 4 ) can be simplified to 16 because 4 goes into 64 16 times."
    }
  ]
}