{
  "url": "https://www.wikihow.com/Eat-and-Lose-Weight",
  "title": "How to Eat and Lose Weight",
  "steps": [
    {
      "title": "Eat several servings of fresh fruits and vegetables throughout the day.",
      "content": "Eat several servings of fresh fruits and vegetables throughout the day. Choose fresh, nutrient-rich, healthy, low-fat foods. Fruits and vegetables are filling without lots of empty calories, so you'll be able to eat enough to feel full without taking in too many calories, making weight loss easier. [1] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Adding a lot of vegetables and fruits to your diet will help you. One way to add more fruits and veggies to your diet, cut calories, and still enjoy the foods you love is to add or \"hide\" veggies to dishes. Researchers have found that adding pureed vegetables to dishes (e.g., cauliflower to mac and cheese) helped people eat a few hundred calories less of the dishes. [2] X Research source Veggies add but bulk to a dish but not really a ton of extra calories. Get a lot of color on your plate. Make sure your meals have lots of colors; the best way to do this is by adding lots of fresh produce, from eggplant to beets to kale to yellow peppers. This color blocking usually helps you eat more produce and makes the meal look appetizing and appealing at the same time! [3] X Research source"
    },
    {
      "title": "Eat foods high in fiber.",
      "content": "Eat foods high in fiber. Fiber-rich foods keep you full for longer, so that you don't reach for unhealthy snacks that will only make you gain weight. [4] X Expert Source Lyssandra Guerra Certified Nutrition & Wellness Consultant Expert Interview. 3 March 2020. Beans, for example, are filling, high in fiber and are an excellent source of protein. They're also slow to digest, meaning that you feel satisfied for a while (which may in turn stop you from eating more!) [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Skip the juices, eat the fruit.",
      "content": "Skip the juices, eat the fruit. Instead of drinking juices or smoothies, which tend to be high in calories, opt instead to eat a whole piece of fruit, like an apple. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Eating a whole piece of fruit fills you up more than juice because raw fruit has more fiber. In addition, the act of chewing the fruit communicates to the brain that you've eaten something substantial."
    },
    {
      "title": "Eat foods that contain a lot of water, like fruits and vegetables.",
      "content": "Eat foods that contain a lot of water, like fruits and vegetables. Studies have shown that people who eat foods with high water content have lower body mass indexes. The water in these foods helps keep you full for longer so you eat less overall. Watermelon and strawberries have about 92 percent water per volume. Other fruits with high water content include grapefruit, cantaloupe, and peaches. [7] X Research source Remember, though, that many fruits are high in sugar, so try to limit how much fruit you eat daily. For vegetables, cucumber and lettuce have the highest water content at 96 percent. Zucchini, radish and celery have a water content of 95 percent. [8] X Research source"
    },
    {
      "title": "Include foods that improve your metabolism",
      "content": "Include foods that improve your metabolism . By choosing your foods carefully, you can drop the pounds without going hungry. Hot peppers, green tea, berries, and whole grains are all foods that improve your metabolism, meaning the rate your body burns calories. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Avoid processed foods and sugars. These cause an insulin spike, which can result in fat storage instead of fat burning. [10] X Expert Source Lyssandra Guerra Certified Nutrition & Wellness Consultant Expert Interview. 3 March 2020."
    },
    {
      "title": "Add good fats to your diet.",
      "content": "Add good fats to your diet. Monounsaturated fats have been clinically proven to help you burn fat, especially in your midsection. So, add foods like avocados, kalamata olives, olive oil, almonds, walnuts, and flaxseed to your diet, and watch the weight fall right off you. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Eat superfoods.",
      "content": "Eat superfoods. Superfood is a term sometimes used to describe food with high nutrient content that some believe confers health benefits as a result. Some superfood claims are supported with scientific evidence, while other claims make some foods hugely popular even though they have few proven benefits. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Quinoa, for example, is a legitimate superfood because it is a complete protein (meaning it has all eight of the essential amino acids we need for our tissues). In addition, quinoa has more protein than most cereal grains and is higher in calcium, phosphorus, magnesium, potassium, and iron than other grains like wheat and barley. [13] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Just make sure to do your research before deciding on adding certain alleged \"superfoods\" to your diet."
    },
    {
      "title": "Avoid unhealthy food with empty calories.",
      "content": "Avoid unhealthy food with empty calories. \"Empty calorie\" foods are those which have calories (from sugar and/or solid fats) but little to no nutritional value. [14] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Foods and beverages that provide the greatest number of empty calories for Americans include cakes, cookies, pastries and donuts, sodas, energy drinks, fruit drinks, cheese, pizza, ice cream, bacon, hot dogs and sausages. With some of these, you can find alternative versions. For example, you can purchase low-fat hot dogs and low-fat cheese at grocery stores. You can also have sugar-free drinks. In other foods, like candy and regular soda, all the calories are basically empty. [15] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source It's okay to have small amounts of \"unhealthy\" foods as a reward. In fact, doing so can help keep you on a diet! But make sure you're only giving yourself small amounts rather than binging on them. [16] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020."
    },
    {
      "title": "Eat more soups.",
      "content": "Eat more soups. Soups are relatively low in calories. Moreover, if you start with a soup, you will probably eat less of the main meal. Stick to soups with a broth base and of around 100-150 calories per serving. You can choose either chunky or pureed soups, just avoid soups with added cream."
    },
    {
      "title": "Feed your temptations once in a while.",
      "content": "Feed your temptations once in a while. Go ahead and have the odd doughnut or slice of pizza. Indulging in occasional craving will help ward off any binging episodes. If you really feel a hankering for something, have just a little bit. Remember that the more you restrict yourself, the greater the draw to the restricted item. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try eating a bowl of raw veggies or drinking a full glass of water before you indulge. Doing this will fill you up and leave you with less room to overindulge on your treat."
    },
    {
      "title": "Eat slowly.",
      "content": "Eat slowly. Your brain takes around 20 minutes to register feelings of fullness, suggesting that you need to slow down so that your brain can properly communicate those feelings. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you don't feel full immediately after a meal, wait. The chemicals your brain releases when you eat or drink take time to rise and to communicate that sense of fullness. As the chemicals increase, your hunger dissipates; this is why you should pause for a little bit after eating and before having a second helping."
    },
    {
      "title": "Use utensils and sit at a table when eating.",
      "content": "Use utensils and sit at a table when eating. Eating with your hands will mean that you take in more food in one scoop . Studies also show that people who eat with larger utensils eat less than those who eat with smaller utensils. [19] X Research source"
    },
    {
      "title": "Stop eating when you feel full.",
      "content": "Stop eating when you feel full. When you feel comfortably satiated after eating, stop and put your utensils and napkin on the plate to signal that you're finished. This is also a signal to yourself that you're done with your meal as well as to those around you. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Remember, you don't have to eat all of your meal once you feel satisfied. Eat until you are 80% full. No one should feel stuffed and sick after eating."
    },
    {
      "title": "Drink more water.",
      "content": "Drink more water. Often we mistake thirst for hunger which means we eat when it's not necessary. By keeping yourself well hydrated you'll feel hungry less as well as getting a clearer complexion and shinier hair. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you're not sure what you're feeling is actually hunger, try drinking a big glass of water and then wait a few minutes. If you don't feel hungry anymore, it's because your body was actually in need of water, not food."
    },
    {
      "title": "Record what you eat",
      "content": "Record what you eat . This is a simple yet very powerful exercise to open your eyes to see whether you are keeping up with your food plan. Often, we tend to overlook the snacking we do between meals and instead really think that our diet is failing us. Most people underestimate their daily intake by about 25 percent. You might also discover useful information about your daily habits and a reality check about how many calories you actually consume. Once you know your habits and patterns better, you can begin to address problem behaviors that are hindering your progress. Keeping a journal also makes you more accountable."
    },
    {
      "title": "Learn how to manage eating out.",
      "content": "Learn how to manage eating out . Eating in restaurants or at other people's homes can be a real challenge. You want to eat, but you also don't want to eat the wrong things and risk backtracking on your progress. [22] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Choose foods that are steamed, grilled, broiled or baked instead of fried. Avoid dishes that are labeled as \"breaded\", \"crispy\" or \"battered\" – these are code words for \"fried\". Don't be afraid to ask for modifications. For example, ask to swap out potatoes or bread for a side salad. Request sauce on the side of chicken or other entrée, rather than smothered on top. This will enable you to still eat something delicious but without all of the extra calories. If the restaurant is known for especially large portion sizes, opt to split something with a friend. To avoid overeating when going out, eat a small and healthy snack at home beforehand. Try some carrots and hummus or an apple.This will curb off your hunger and keep your head clear while you make healthy and informed choices from the restaurant's offerings. Pack away food. At the beginning of the meal, ask for a doggie bag, and put what you aren't going to eat in the bag. When ordering salads, always ask for dressings and sauces on the side. Lots of dressings can be very fatty and full of calories. Your seemingly \"healthy choice\" can pack as many calories as a burger if it’s swimming in a fatty dressing. Be also wary of other high-calorie additions like bacon bits and cheese."
    },
    {
      "title": "Expect to cheat once in a while.",
      "content": "Expect to cheat once in a while. You might overeat one night. You might have a bad day where you indulge in way too much junk food. Just don't despair when you realize you've strayed from your goals. It took you a lifetime to achieve your current weight, and it will take time to achieve your new weight and size goal. [23] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To keep up your optimism, reward yourself for meeting smaller goals. For example, buy yourself a small token or treat every time you lose another five times. The prospect of the reward will eventually become its own form of motivation."
    }
  ]
}