{
  "url": "https://www.wikihow.com/Get-Hard-Muscles",
  "title": "How to Get Hard Muscles",
  "steps": [
    {
      "title": "Start with cardio.",
      "content": "Start with cardio. Although much of your muscle strengthening and definition will come with typical weight lifting or resistance exercises, if you want your muscle definition to show or your muscles to feel hard, you'll need to include regular cardio. Cardio exercises are great for a variety of reasons. They help improve your mood and sleep habits, decrease your risk for obesity, diabetes, and high blood pressure, and can even help you have more efficient circulation. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In addition to the health benefits, regular cardio is necessary to help your body burn calories and decrease the excess fat that can accumulate both on top of and underneath your muscles. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The lower amounts of fat you have or the lower your body-fat percentage is, the more defined and hard your muscles will look and feel. Include at least 150 minutes of moderate-intensity cardio each week. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source This could include: jogging/running, rowing, dancing, using the elliptical, or doing an aerobics class."
    },
    {
      "title": "Include a variety of strengthening exercises for each muscle group.",
      "content": "Include a variety of strengthening exercises for each muscle group. To get the best workout and get the best results, you'll want to do more than one type of exercise per muscle group. [4] X Research source Doing a variety of exercises can help ensure you're strengthening and defining your muscles in different ways. Each exercise may work different parts of the muscle group or engage a variety of different smaller muscles. This will help you get the most defined look. [5] X Research source For example, do not just do squats to tone your legs. Do a combination of squats, lunges, calf raises, leg raises, and leg curls. Each exercise is unique in which muscles they engage."
    },
    {
      "title": "Do a combination of high repetitions and low weights and low repetitions and higher weights.",
      "content": "Do a combination of high repetitions and low weights and low repetitions and higher weights. Both higher reps and lower rep exercise plans can benefit your muscles in a variety of ways. Include both to get the best workout. If you're doing higher reps with a lower weight, this can help you build bigger muscles. These will show more, be more defined and may feel harder. This is a good thing to keep in mind if your goal is also be to bulk up. [6] X Research source However, higher reps with a lower weight doesn't necessarily build strength. It mainly builds muscular bulk. [7] X Research source Lower reps with higher weight help you build more strength. The lower repetition amount and higher weights works your muscles differently that results in stronger more powerful muscles. [8] X Research source"
    },
    {
      "title": "Always include one to two rest days.",
      "content": "Always include one to two rest days. Rest days are equally as important as days where you work out. Studies have shown that the actual strengthening and size increase happens during rest, not work. It's typically recommended to include at least one to two rest days weekly. However, these should be \"active rest days.\" That means, instead of lounging around all day, do some light intensity or stretching exercises like walking or yoga. In addition to your active rest days, make sure to rest between muscle groups. For example, if you focus on lower body muscles on Monday, use Tuesday to work your upper body instead."
    },
    {
      "title": "Squat with added weight.",
      "content": "Squat with added weight. [9] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Squats are a great basic exercise to help achieve more defined and toned muscles. This move works a variety of muscle groups and can really help you have defined legs and glutes. Choose an appropriate weight on a barbell. Carefully lift the barbell and place it gently on the back of your shoulders right underneath your neck. Squeeze your shoulder blades together so the barbell is resting on your muscles, not on your spine. Stand with your feet slightly wider than hip width apart and toes facing forward. Begin to squat down as if you were sitting back into a chair. Squat until your thighs are almost parallel to the floor. Pause at the bottom for one to two seconds. Slowly push yourself back up to the starting position. Push through your heels and squeeze your glutes. This is one repetition. Repeat as desired. Start with a fairly high weight and do a lower number of repetitions (six to eight) for this exercise. This exercise should feel very intense for you to be building muscle."
    },
    {
      "title": "Walk your lunges.",
      "content": "Walk your lunges. Walking lunges are another great exercise that works a variety of leg muscles. In particular, it helps strengthen hips, thighs, and glutes. [10] X Research source Stand with your feet shoulder-width apart and place your hands on your hips, or rest them on the back of your neck. Step forward with one leg and drop your back knee down while bending your front knee. Lower your body down until your rear knee almost touches the ground. Make sure your front knee stays over your ankle, not in front of it. Push and pull yourself up back to standing with your front leg. The muscles used should mainly be from your front leg and glutes. Step forward again with the opposite leg. Continue \"lunge walking\" for eight to 10 reps per leg."
    },
    {
      "title": "Include a Spiderman plank crunch.",
      "content": "Include a Spiderman plank crunch. Any variation of the plank exercise will work your entire core. This is one of the exercises that work all muscle groups in your core in addition to your upper body and lower body. [11] X Research source Start in a traditional plank position by lying face down on the floor. [12] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Support your body weight on your forearms and toes. Keep your body perfectly straight by keeping your core engaged and your hips tucked under. Start by bringing your left knee up towards your left elbow and place your left toes on the floor. Then return your left leg back to the starting position. Repeat on the right side. Repeat this series for 10 reps per side."
    },
    {
      "title": "Do bicycle crunches.",
      "content": "Do bicycle crunches. Another great exercise that targets your core, bicycle crunches specifically target the front of your abdominal muscles and your obliques (the sides of your abs). [13] X Research source Lie on your back on an exercise mat. Place your hands behind your head, bring your knees up in the air so they are bent at a 90 degree angle. Start the crunch by bringing your right knee toward your right elbow. Lift up your shoulders and head off the mat to help you meet your ankle. Alternate sides by switching over to the left leg and left arm. Aim to build up to at least 60 seconds of the crunches. [14] X Research source"
    },
    {
      "title": "Do single arm overhead presses.",
      "content": "Do single arm overhead presses. This is a great movement to work a variety of muscles in your arms, back and shoulder. It's an all-encompassing upper body exercise. [15] X Research source Start by choosing a dumbbell or kettlebell of appropriate weight. Hold it in one hand at shoulder height with your palm facing forward. Push and press your hand up in the air until your arm is completely straight (but not locked at the elbow joint). Pause here at the top. Slowly lower your hand back down to shoulder height. Start by doing two reps per arm, then progress to three reps per arm and end with five reps per arm. [16] X Research source"
    },
    {
      "title": "Bench press on an incline.",
      "content": "Bench press on an incline. Doing an incline bench press helps build mass and strength in the chest and shoulders. Lay down on an incline bench that is set to about 30 or 45 degrees. Place your feet flat on the floor for proper form. Lift an appropriate weighted bar with a grasp width that is about shoulder-width apart. Start with the bar in the air and arms fully extended and locked. Slowly lower down the bar until you are just about an inch or two away from the top of your chin or clavicle bone. Pause for a moment and then push the weight back up to the top position. To build mass and strength with this exercise, choose a weight on the barbell that is heavy enough to bring on complete muscle fatigue after four to six repetitions."
    },
    {
      "title": "Monitor calories.",
      "content": "Monitor calories. Although you may not be trying to lose weight, it's still a good idea to keep track of your overall calorie intake each day. Know how much you typically eat in one day. If you start to gain or lose unwanted weight, you'll have a starting number to work with. You can keep track of your calories in a food journal or app. In addition, many of the apps have a food journal included. Consider using an online calculator to figure out about how many calories you need each day to maintain your weight with your exercise."
    },
    {
      "title": "Go low carb.",
      "content": "Go low carb. In order for your muscles to look defined or to feel toned and hard, you'll need to lose any excess fat that is stored above or beneath of them. Low-carb diets have been shown to be the best for reducing body fat. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In addition to reducing body fat, low-carb diets help you lose weight more quickly compared to other dieting styles (like low calorie diets). [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Carbs are found in a variety of food groups. Limit foods like grains, starchy vegetables or high sugar fruits. Many of the nutrients found in these foods can be consumed from other food groups. Still include carbohydrate containing foods like dairy and low-sugar fruits. These contain other nutrients that are essential for your health. Include 1 cup servings of low-fat dairy throughout the day. These foods are rich in protein, calcium and Vitamin D. [19] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Low-sugar fruits still contain carbohydrates but also contain high amounts of fiber and antioxidants. Try 1/2 cup servings of blackberries, strawberries, raspberries and cranberries. [20] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source"
    },
    {
      "title": "Fill up on protein.",
      "content": "Fill up on protein. [21] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Protein is essential to your health, but also plays an important role in your diet when you're exercising and trying to build and tone your muscle mass. Aim to have one to two servings of lean protein at each meal. Including a 3 – 4-oz portion can help you reach your daily recommended amount. [22] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source If you want to find out exactly how much protein you should be eating daily, there's a simple equation to follow: Weight in kg x 0.8-1.0 g of protein. [23] X Research source The harder your workouts or longer you're active, the more protein you'll need. For example, if you weighed 150 pounds, the equation would be: 150 / 2.2 = 68.1 kg. Take 68.1 x 0.8-1.0 = 54-68 g of protein daily. Most people do not need large quantities of protein daily. Only athletes, power lifters, and bodybuilders need larger quantities of protein daily. In addition, large quantities of protein over a long period of time can cause kidney damage. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Choose leaner protein sources like: eggs, poultry, low-fat dairy, seafood, lean beef, pork, and tofu."
    },
    {
      "title": "Make half of your plate a low-sugar fruit or non-starchy vegetable.",
      "content": "Make half of your plate a low-sugar fruit or non-starchy vegetable. To make your meals more balanced, you'll need to eat more than just protein based foods. Include a large quantity of low-sugar fruits and non-starchy vegetables to help balance your meal. Health professionals typically recommend consuming about 5-9 servings of fruits and vegetables daily. [25] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you're following a lower carb diet, you might want to emphasize the non-starchy vegetables more. Include a serving or two of non-starchy vegetables or leafy greens at most meals. This is generally about 1 cup or 2 cups of the leafy greens. [26] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source Stick to fewer servings of those low-sugar fruits and keep portions at a 1/2 cup. [27] X Trustworthy Source USDA Center for Nutrition Policy and Promotion U.S. agency responsible for promoting good nutrition based on scientific research Go to source"
    },
    {
      "title": "Fuel up and recover appropriately.",
      "content": "Fuel up and recover appropriately. When you're trying to build muscle mass and strengthen or define muscles, you'll need to snack or eat in a way that helps fuel your body through a workout and help you recover afterwards. Not fueling or recovering appropriately can leave you feeling more tired, fatigued and cause poor performance down the road. [28] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Eating a pre-workout snack can help give your body the energy it needs to actually perform your workout. It should be mostly simple and nutritious carbohydrates so they can digest easily and give your body the energy it needs readily. Ideas for pre-workout snacks include: a piece of fruit, a whole grain waffle with a little peanut butter or a bowl of oatmeal. Post workout snacks need higher amounts of protein, but also need carbs too. You need to replace the energy spent during your workout and give protein to help repair the muscle tissue. Great post workout snacks include: protein shake, trail mix, chocolate milk or your next meal (if it is within an hour)."
    },
    {
      "title": "Include protein shakes.",
      "content": "Include protein shakes. You may want to consider including some protein shakes in your daily meal plan. Some studies have shown that 100% whey shakes can help you lose weight, increase muscle mass easier and increase strength. [29] X Research source Whey protein is a derivative of milk. It contains all the essential amino acids your body cannot make itself. Since it's a complete protein, it's a high quality protein to use. You can use your protein shake as a snack or use it to fuel or recover from a workout. Remember, try to stay within your protein goal for the day. More is not always better. Other options for protein shakes include egg white protein, pea protein, or hemp protein. You can find protein powders specifically made for women or people with dietary restrictions, such as vegans."
    },
    {
      "title": "Consider creatine.",
      "content": "Consider creatine. Creatine is a fairly common supplement used by many athletes and people looking to improve their performance. Some studies have shown that there are some benefits to using creatine if you want to increase muscle strength and performance. [30] X Research source Creatine is made naturally in the body by the liver. It's transported in the blood to help supply energy to all cells. However, most creatine is used and stored by your skeletal muscles. [31] X Research source Creatine may help you build more strength and muscle bulk because it provides you with additional energy to do more repetitions and higher weights. [32] X Research source You should always talk to your doctor prior to starting any supplements (as they are not regulated by the FDA). Ask if it would be safe and appropriate for you. Discontinue use if you feel any of the following symptoms: nausea, cramping, diarrhea or stomach pains."
    },
    {
      "title": "Indulge in moderate amounts of caffeine.",
      "content": "Indulge in moderate amounts of caffeine. Having a cup of coffee before a workout is another option that's a natural way of boosting your performance. Studies show that when you drink coffee prior to a workout you can train longer and use a higher weight. In addition, if you're doing cardio, you can finish more quickly. [33] X Research source It's typically recommended to drink 1 6-8 oz cup of coffee prior to your workout. This contains about 80-100 mg of caffeine which is all you need before you hit the gym. Do not try caffeine pills or other supplements as these may come with adverse health effects."
    }
  ]
}