{
  "url": "https://www.wikihow.com/Do-a-Compression-Test",
  "title": "How to Do a Compression Test",
  "steps": [
    {
      "title": "Bring the engine to its normal running temperature.",
      "content": "Bring the engine to its normal running temperature. If you haven’t driven the car lately, the engine will be cold. Start your vehicle as usual and keep the engine running for 5 to 10 minutes. Be careful not to overheat the engine by letting it run too long before the test. You will be able to feel the heat radiating from the engine when you go near it. If you have taken your car for a long drive recently, give it at least 30 minutes to cool down. Make sure the engine feels warm instead of burning hot. You could also try doing a compression test on a cold engine. The test is more accurate when the engine is warm, but it may still alert you to problems that need to be fixed in order to keep your vehicle in good shape."
    },
    {
      "title": "Switch off the engine before opening the hood.",
      "content": "Switch off the engine before opening the hood. Make sure it is all the way off without any electricity or fuel flowing to the engine. Remove the key from the ignition to ensure the components can be safely removed from the engine bay. If your car plugs into a wall, unplug the charging cable first before handling any components."
    },
    {
      "title": "Put on insulated gloves and safety glasses for protection.",
      "content": "Put on insulated gloves and safety glasses for protection. Since you’re going to be near hot parts, wear heat-resistant gloves while reaching into the engine compartment. Always wear gloves to protect yourself from burns. The safety glasses are good protection against possible gas and oil spray when you’re detaching engine components. In most cases, you won’t get any gas or oil on you during the test, but you’re still better off safe than sorry. Put on the safety glasses just in case. If you’re performing the test on a cold engine, you won’t need the gloves."
    },
    {
      "title": "Remove the fuel pump or injection fuse in your vehicle.",
      "content": "Remove the fuel pump or injection fuse in your vehicle. Locate the fuse box, which is usually inside the engine compartment. Open the black case to expose the colorful plastic tops of the fuses plugged into various slots. The fuel pump fuses are often colored blue, although this can vary depending on your vehicle. Once you find the one you need, pull it out with a pair of tweezers to prevent gas from flowing to the engine during the compression test. [1] X Research source The fuse box can be located somewhere else in your car, such as underneath the steering wheel or inside the passenger glove box. It differs depending on the vehicle. Refer to the owner’s manual or look for a diagram on the fuse box case. It will show you the location of the fuse or fuses you need to remove. If you don’t have the manual or a diagram, search for your car’s make and model online to see if you can find one."
    },
    {
      "title": "Disconnect the ignition coil fuse in the fuse box.",
      "content": "Disconnect the ignition coil fuse in the fuse box. This will disable the ignition system so it can’t send a spark of electricity to the engine’s spark plugs. [2] X Research source Use your owner’s manual or fuse box diagram to locate it and remove it. Keep it separate from the fuel fuses so you know which one goes where after the test. [3] X Research source If your vehicle doesn’t have an ignition fuse, look for the big ignition coil in the engine compartment. It looks like a cylinder perched on top of the engine. Pull off the big wire plugged into the top part of the coil."
    },
    {
      "title": "Detach wires from each spark plug on the engine.",
      "content": "Detach wires from each spark plug on the engine. Check the engine for a series of black cables coming out the top end. Grasp each wire at the end, then twist it while simultaneously pulling it up to detach detach it from the engine block. The opposite end of each wire will still be plugged in, so you won’t be able to take them out of the vehicle. Instead, push them aside so they are off the engine. [4] X Research source Label the wires so you know which spark plug each one connects to. The spark plug wires are generally well-routed to avoid confusion, but keep them separate anyway to reduce the possibility of switching them. You don’t need to take the wires out to perform the test, but consider taking the opportunity to inspect them and replace worn-out ones . Some vehicles have ignition coils instead of spark plugs, but they can be removed the same way."
    },
    {
      "title": "Remove the spark plugs with a socket wrench.",
      "content": "Remove the spark plugs with a socket wrench. To make the removal process as easy as possible, fit the wrench with an extension handle and a spark plug socket. Fit the socket into the engine holes uncovered by the wires you removed. Once the wrench is onto the spark plug inside, turn it counterclockwise until you are able to lift it out of the engine. Each cylinder will have a spark plug for you to remove. [5] X Research source </ref> [6] X Research source Socket wrench kits, along with compression gauges and replacement parts, are available online or at most auto part stores. Label each spark plug with chalk or a piece of masking tape so you know which cylinder they belong to. Lay them out in a secure spot near your vehicle. Consider checking the spark plugs for damage while you have them out. If they look worn out, replace them . Burned oil or other debris could be a sign of an engine problem."
    },
    {
      "title": "Put the compression test adapter into the engine's first cylinder.",
      "content": "Put the compression test adapter into the engine's first cylinder. Look down on the engine to figure out which cylinder is closest to the front of the engine. Note the circular cylinders and the timing belt on the engine’s front. The first cylinder is on the rightmost ones in most engines. Once you have it, put the test compressor’s hose into the spark plug slot, turning it clockwise by hand until it locks in place. [7] X Research source Keep in mind that compression testing kits often come with multiple adapter hoses. Use one that fits well in your vehicle’s engine. Check the sizing label on the hose and match it to the size of the spark plugs."
    },
    {
      "title": "Connect the compression gauge to the opposite end of the hose.",
      "content": "Connect the compression gauge to the opposite end of the hose. If you’re testing a diesel engine, make sure you’re using a gauge designed for diesel since it will have a higher compression tolerance. Then, check the end of the gauge for a metal connector that fits on the end of the hose adapter. Your gauge may also have a ring on it that needs to be lifted as you fit it on the hose. Otherwise, it’s as simple as plugging one into the other. [8] X Research source Make sure the gauge is well-connected to the hose. If it feels loose, it will affect the test. Keep in mind that some compression gauges plug directly into the engine and don’t require a hose. However, most gauges you will come across make use of a hose adapter."
    },
    {
      "title": "Crank the engine at least 4 times to complete the test.",
      "content": "Crank the engine at least 4 times to complete the test. Turn the key as far as it will go in the ignition, then release it. Do this about 4 or 5 times without shutting off the vehicle at all. The engine will be running throughout the entire process. When you’re done, check the compression gauge to get the test result. [9] X Research source The needle on the gauge should stop moving and point to a number. If it doesn’t stay in place, crank the engine for up to 10 seconds. Ask a friend to sit in the driver’s seat and crank the engine for you. That way, you can keep an eye on the compression gauge. If your vehicle has a remote starter, you could also use it to avoid having to get behind the wheel."
    },
    {
      "title": "Move the compression gauge to repeat the test on the other cylinders.",
      "content": "Move the compression gauge to repeat the test on the other cylinders. Unscrew the hose adapter by hand, then move it onto the second cylinder. Keep doing it until you have a result for all of the engine’s cylinders. Be sure to record each number on a piece of paper so you can compare them when you’re done. [10] X Research source Test all of the cylinders in order, starting with the first one and working straight down the line to the engine’s opposite end. On your paper, label it “1, 2, 3” and so on. Keep the test results orderly so you know which cylinders they correspond to. Once you’re done testing, you can remove the compression gauge and hose adapter."
    },
    {
      "title": "Note pressure readouts between 125 and 175 PSI on a standard engine.",
      "content": "Note pressure readouts between 125 and 175 PSI on a standard engine. Most engine cylinders fall in the middle of that range, usually around 125 PSI. However, the exact rating could vary due to a lot of factors, like the vehicle you have, the type of engine you’re testing, and its overall condition. If you see a result that looks out of the ordinary, figure out what engine cylinder it corresponds to. [11] X Research source For diesel engines, the optimal PSI is between 275 and 400. Low individual readings indicate cylinder-specific problems like worn-out piston rings."
    },
    {
      "title": "Make sure the test results are no more than 10% apart.",
      "content": "Make sure the test results are no more than 10% apart. The difference between the highest and lowest cylinder rating should be no more than 15 to 20 PSI. Big pressure differences are a sure sign of engine problems. Note which cylinder has the low reading to uncover the source of the problem. You may also see multiple cylinders with low readings, which could alert you to more serious issues. [12] X Research source For example, a series of low readings could indicate that the valves between cylinders have worn out. It could also be a sign of overall engine failure."
    },
    {
      "title": "Retest cylinders below 100 PSI after adding engine oil to them.",
      "content": "Retest cylinders below 100 PSI after adding engine oil to them. Pour about 1 teaspoon (4.9 mL) of fresh engine oil directly into the open cylinder. Then, hook the pressure gauge and hose adapter to it again. Repeat the test by turning over the ignition a few times. When you’re done, check the readout again to see how it has changed. [13] X Research source The PSI typically rises when you do a wet test instead of a dry one. The change can help you determine what is wrong with the cylinder. If the test worked, a large change could mean the piston rings have worn out."
    },
    {
      "title": "Fix the engine if it doesn’t appear to be functioning correctly.",
      "content": "Fix the engine if it doesn’t appear to be functioning correctly. The engine is vital to your vehicle, so don’t ignore poor readouts from the compression test. Identifying and fixing engine problems can be very tough to do on your own. If you need help, get the car to a qualified mechanic as soon as possible. [14] X Research source If the low reading is from a single cylinder, check it for worn-out piston rings. If the test results were both the same, the cylinder could have a bad valve. If you notice 2 nearby pistons with low PSI readings, you most likely have a blown head gasket to replace. The gasket is between the 2 cylinders. Low compression in all cylinders could mean your engine needs a new timing belt . If that doesn’t work, the engine may need a tune up. If the engine no longer runs very well, you may be better off replacing it with a new one. Fixing an engine can be expensive, so sometimes getting a new engine from a scrapyard is more cost-effective."
    }
  ]
}