{
  "url": "https://www.wikihow.com/Do-a-French-Knot",
  "title": "How to Do a French Knot",
  "steps": [
    {
      "title": "Thread a needle and place your fabric or hoop in your lap.",
      "content": "Thread a needle and place your fabric or hoop in your lap. For a small French knot, thread a single strand of embroidery floss through the eye of a needle. If you'd like a larger knot, use 2 to 4 strands of floss. Then, place the fabric you're embellishing or the hoop you're embroidering on in your lap since you'll need both hands to make the French knot. [1] X Research source"
    },
    {
      "title": "Bring the needle up through the fabric.",
      "content": "Bring the needle up through the fabric. Hold the needle under your fabric and push the tip of it through where you want to make the knot. Pull the needle to extend the floss so only about 2 inches (5.1 cm) is left underneath the fabric. [2] X Research source If you're worried that you'll accidentally pull the floss completely through the fabric, hold the underside in place until you make the knot."
    },
    {
      "title": "Hold the needle horizontally so it points away from your work.",
      "content": "Hold the needle horizontally so it points away from your work. Lower the needle towards the surface of your fabric and hold it horizontally behind the floss so the floss forms a loop. Point the tip of the needle away from the center of your hoop or fabric. [3] X Research source Use the hand that's not holding the needle to pinch the floss that's coming away from the fabric so it's taut. This will prevent the floss from getting tangled."
    },
    {
      "title": "Wrap the floss around the needle 2 to 3 times.",
      "content": "Wrap the floss around the needle 2 to 3 times. Keep holding the needle horizontally and use your other hand to wind the floss 2 or 3 times around the needle. Go slowly so the floss doesn't slide off of it. [4] X Research source If you'd like a smaller knot, try wrapping the floss around the needle only 1 time. The more you wind the floss, the bigger the knot will be. To prevent the wrapped floss from sliding off, you can use your non-dominant hand to hold the working floss taut."
    },
    {
      "title": "Push the wrapped needle down through the fabric.",
      "content": "Push the wrapped needle down through the fabric. Point the tip of the needle right next to where you began the stitch. Then, insert it and bring the needle down through the fabric. To prevent tangling, hold the floss with your other hand until you've completely pulled the needle through the fabric. [5] X Research source The floss will form a loop until you pull the needle completely through. Use your fingers to prevent the loop from tangling as you make the stitch. To avoid pulling the French knot through the fabric, pull the floss slowly and stop as soon as the knot forms."
    },
    {
      "title": "Pull the floss until a knot forms and anchor the back to secure the stitch.",
      "content": "Pull the floss until a knot forms and anchor the back to secure the stitch. If you're going to make more French knots that aren't more than 1 inch (2.5 cm) apart, just start stitching the next knot. If you do want to tie off the knot, slide the needle under a stitch to make a loop under your fabric. Bring the needle through the loop and pull tightly before you cut the floss. [6] X Research source"
    },
    {
      "title": "Use French knots to create punctuation for embroidered words.",
      "content": "Use French knots to create punctuation for embroidered words. If you're embroidering a word or phrase, you may need to dot an \"i\" or make a period. French knots can make these stand out so your word or phrase is visible. [7] X Research source For a fun way to embroider a word, trace the outline of the word on your fabric. Then, make lots of French knots around the border for each letter. Leave the actual word empty so the space is visible because it's surrounded by French knots."
    },
    {
      "title": "Fill embroidered flower petals or centers with French knots.",
      "content": "Fill embroidered flower petals or centers with French knots. Make a simple flower by placing a cluster of French knots at the top of an embroidered stem. You could also sew the outline of a large flower and fill in the petals with French knots so your flower is full of rich color and texture. To make the center of the flower stand out, make the French knots in the middle a different color. [8] X Research source For example, to make a daisy, create white French knots that radiate out from a center point. Then, make a few yellow french knots in the center."
    },
    {
      "title": "Sew delicate stars or snowflakes using French knots.",
      "content": "Sew delicate stars or snowflakes using French knots. Stitch rows of French knots to make star or snowflake patterns that are as simple or detailed as you like. Although there's no need to connect the knots, you could use a straight stitch to join them and make the stars or snowflakes clearer. Try sewing constellations using French knots. To make brighter stars in the constellation, use 2 or 3 strands of thread instead of 1."
    },
    {
      "title": "Sew textured patterns on your projects.",
      "content": "Sew textured patterns on your projects. You can still use French knots even if you're not sewing text or images. Create a simple design of French knots to fill your fabric or create edging. For example, alternate French knots in different colors or sizes to add interest to the edge of your project. [9] X Research source Consider switching the thread color to make your pattern stand out even more."
    },
    {
      "title": "Work with yarn to make a French knot on your knitted or crocheted pieces.",
      "content": "Work with yarn to make a French knot on your knitted or crocheted pieces. French knots aren't only for sewing or embroidery. You can embellish finished knitted or crocheted pieces with French knots in matching or contrasting yarn. For example, if you want to add texture to a knitted scarf , make French knots along the ends of the scarf. [10] X Research source French knots are a great way to add interest to a crocheted baby blanket . You can make a pattern with the knots or use them to make a flower design."
    }
  ]
}