{
  "url": "https://www.wikihow.com/Dry-Ginger",
  "title": "How to Dry Ginger",
  "steps": [
    {
      "title": "Snap a small piece from the root to test for freshness.",
      "content": "Snap a small piece from the root to test for freshness. If the ginger snaps easily and does not have a lot of fibers, it is fresh. If it is hard to snap or has a lot of fibers connecting it to the root, it has more moisture in it than usual, and it will be harder to dry. [1] X Research source Ginger can be found at most grocery stores, but if the ginger there isn’t fresh, try looking for a farmer’s market or produce market in your area."
    },
    {
      "title": "Smell the ginger for a spicy and rich scent.",
      "content": "Smell the ginger for a spicy and rich scent. Fresh ginger will smell sharp and have a strong scent, even with the skin still on. If the scent is dull or subtle, the ginger is probably not fresh and might be harder to dry or not have as bold of a flavor. [2] X Research source"
    },
    {
      "title": "Press your nail into the skin to make sure it is thin.",
      "content": "Press your nail into the skin to make sure it is thin. Ginger is much easier to dry when the skin is thin because it holds in less moisture. The skin of your ginger should be shiny and you should be able to mark it with your nail. If the skin is too thick, it will be harder to mark and will look duller."
    },
    {
      "title": "Rinse the ginger in cold water to get rid of dirt on the skin.",
      "content": "Rinse the ginger in cold water to get rid of dirt on the skin. Ginger is a root, which means that it was covered in dirt before being dug up. There might still be some dirt left on the skin of your ginger, but you can run it under cold water for a few seconds to wash it off. The ginger doesn’t have to be perfectly clean, since you will be taking the skin off. [3] X Research source"
    },
    {
      "title": "Peel the skin off with a potato peeler.",
      "content": "Peel the skin off with a potato peeler. Ginger skin is tough and doesn’t taste very good. Use a potato peeler to cut the skin off so that you are left with the softer, more flavorful part of the ginger root. You don’t need to peel very far down into the ginger, you just need to slice the thin layer of skin off. [4] X Research source You can buy a potato peeler at most grocery and home goods stores. If you don’t have a potato peeler, you can use a sharp knife to carefully cut the skin off of your ginger."
    },
    {
      "title": "Cut your ginger into slices that are about 1⁄8 inch (0.0032 m) thick.",
      "content": "Cut your ginger into slices that are about 1 ⁄ 8 inch (0.0032 m) thick. The thinner your ginger pieces are, the faster they will dry. You can use either a sharp knife or a cheese grater to get your slices paper-thin. If you use a cheese grater, your slices will be smaller and may be easier to grind or chop later. [5] X Research source"
    },
    {
      "title": "Place the ginger pieces on a baking tray, making sure they don’t overlap.",
      "content": "Place the ginger pieces on a baking tray, making sure they don’t overlap. Spread your pieces of ginger on a baking tray that is large enough to ensure that none of the pieces overlap. If your ginger pieces are touching, they will probably dry slower. [6] X Research source You can line your baking tray with parchment paper for easy removal of the ginger later."
    },
    {
      "title": "Put your tray in an area that gets 8 hours of sun a day.",
      "content": "Put your tray in an area that gets 8 hours of sun a day. The more sun that your ginger pieces get, the faster they will dry. Find an area in your house that gets at least 8 hours of sun a day and place your baking tray in a place that it can stay for a few days. [7] X Research source Window sills are an ideal place for drying ginger. If you live in a climate with low humidity, you can leave your ginger outside to sit in the sun instead, but this could attract small pests, like aphids."
    },
    {
      "title": "Leave the tray in the sun for 3 days to 1 week.",
      "content": "Leave the tray in the sun for 3 days to 1 week. Depending on how much sun your ginger gets and how much humidity is in the air, sun drying can take anywhere from 3 days to 1 week. Ginger will snap when it is fully dry. Check your ginger daily to see if it is dry or if it needs more time in the sun. [8] X Research source"
    },
    {
      "title": "Store your dried ginger in an airtight container for 5 to 6 months.",
      "content": "Store your dried ginger in an airtight container for 5 to 6 months. After your ginger is dry, you can transfer it to an airtight container and store it in a cool, dry place. You can keep dried ginger for 5 to 6 months before using it. [9] X Research source"
    },
    {
      "title": "Lay ginger slices on your dehydrating tray, making sure the pieces don’t overlap.",
      "content": "Lay ginger slices on your dehydrating tray, making sure the pieces don’t overlap. Your ginger will dehydrate faster if the pieces are not touching each other. Lay your ginger on your dehydrating tray in a single layer so that they are not touching each other. Depending on how much ginger you are drying, you might have to do two rounds of dehydrating to make sure that all the pieces have enough room. [10] X Research source Make sure your ginger pieces are large enough that they won’t fall through the holes in the tray."
    },
    {
      "title": "Dehydrate your ginger at 135 °F (57 °C) for 3-4 hours.",
      "content": "Dehydrate your ginger at 135 °F (57 °C) for 3-4 hours. You can check your ginger after 3 hours to see if it needs more time. When your ginger is dry, it will snap easily and look much smaller than it did originally. Your ginger pieces may need more time to dehydrate depending on how big they are and how humid your climate is. [11] X Research source Try not to over-dehydrate your ginger. Over-dehydrating will give your dried ginger a burnt taste. If your ginger changes colors or crumbles, it might be over-dehydrated."
    },
    {
      "title": "Store it in an airtight container or plastic bag for 5 to 6 months.",
      "content": "Store it in an airtight container or plastic bag for 5 to 6 months. Once your ginger is dry, you can put it in an airtight container or a plastic bag and keep it in a cool, dry place. Be sure to use your dried ginger within 5 to 6 months of drying it. [12] X Research source"
    },
    {
      "title": "Spread the ginger on a baking tray, making sure they don’t overlap.",
      "content": "Spread the ginger on a baking tray, making sure they don’t overlap. Your ginger will dry faster if none of the pieces are touching. Spread your ginger out on a baking tray and give each piece enough room to sit without touching any others. Depending on how much ginger you have to dry, you may have to use 2 baking trays. [13] X Research source You can line your baking tray to help with removal later, but you don’t have to."
    },
    {
      "title": "Bake in the oven at 150 °F (66 °C) for 1 ½ to 2 hours.",
      "content": "Bake in the oven at 150 °F (66 °C) for 1 ½ to 2 hours. Your oven should be on a very low temperature so that the ginger doesn’t burn. Check the ginger every half an hour to make sure it isn’t getting overly dry or burning. Dried ginger should snap easily and be smaller in size than when it was not dry. [14] X Research source Your ginger can burn in the oven if it is in there for too long. If your ginger getting darker or smoking, take it out of the oven right away."
    },
    {
      "title": "Cool your ginger for 1 hour.",
      "content": "Cool your ginger for 1 hour. Before you use or store your dried ginger, make sure that it is completely cool. Set your baking tray on a kitchen counter to cool down for 1 hour before you take the pieces off. [15] X Research source"
    },
    {
      "title": "Store it in an airtight container or plastic bag for 5 to 6 months.",
      "content": "Store it in an airtight container or plastic bag for 5 to 6 months. Once your ginger is cool, you can take it off of your baking tray and put it in an airtight container or plastic bag. Store your ginger in a cool, dry place and use it within 6 months of drying it. [16] X Research source"
    }
  ]
}