{
  "url": "https://www.wikihow.com/Enable-Developer-Mode-on-an-iPhone",
  "title": "How to Enable Developer Mode on an iPhone or iPad",
  "steps": [
    {
      "title": "Install a developer build on your iPhone.",
      "content": "Install a developer build on your iPhone. Developer Mode is not available until after the user installs an app that requires developer mode. To do so, you will download Xcode on your Mac or PC, and develop a build for an iPhone or iPad app and install it on your iPhone. [1] X Research source"
    },
    {
      "title": "Open the Settings app on your iPhone .",
      "content": "Open the Settings app on your iPhone . It has an icon that resembles two silver gears. Tap the Settings icon on your Home screen to open the Settings menu."
    },
    {
      "title": "Tap Privacy & Security.",
      "content": "Tap Privacy & Security . It's next to a blue icon with a hand in the Settings menu."
    },
    {
      "title": "Scroll down and tap Developer Mode.",
      "content": "Scroll down and tap Developer Mode . It's near the bottom of the Privacy & Security menu"
    },
    {
      "title": "Tap the toggle switch next to \"Developer Mode.\"",
      "content": "Tap the toggle switch next to \"Developer Mode.\" It's at the top of the page. This displays a pop-up."
    },
    {
      "title": "Tap Restart.",
      "content": "Tap Restart . It's in the pop-up at the bottom of the screen. This will restart your iPhone."
    },
    {
      "title": "Wait for your device to restart.",
      "content": "Wait for your device to restart. After your iPhone or iPad restarts, you will see an alert warning that Developer Mode has reduced security."
    },
    {
      "title": "Tap Turn On.",
      "content": "Tap Turn On . It's in the warning that appears when your device restarts. This acknowledges the security risks associated with Developer Mode and turns on Developer Mode."
    },
    {
      "title": "Enter your device passcode.",
      "content": "Enter your device passcode. You will need to enter your passcode to complete the process and turn on Developer Mode. [2] X Research source"
    },
    {
      "title": "Install a developer build on your iPhone.",
      "content": "Install a developer build on your iPhone. Developer Mode is not available until after the user installs an app that requires developer mode. To do so, you will download Xcode on your Mac or PC, and develop a build for an iPhone or iPad app and install it on your iPhone. [3] X Research source"
    },
    {
      "title": "Open the Xcode app on your Mac.",
      "content": "Open the Xcode app on your Mac. It has a blue icon with a hammer in front of it. Tap the Xcode icon in the Applications folder to open Xcode. You must agree to the terms of the software and license agreements when you open XCode for the first time. This will install software components and finalize the XCode installation process."
    },
    {
      "title": "Plug your iPhone into your Mac.",
      "content": "Plug your iPhone into your Mac. Use your USB cable to plug your phone into your computer."
    },
    {
      "title": "Open the Settings app on your iPhone.",
      "content": "Open the Settings app on your iPhone. This is the gray gear icon on your iPhone’s Home screen."
    },
    {
      "title": "Scroll down and tap Developer Mode.",
      "content": "Scroll down and tap Developer Mode . This option will automatically appear next to a hammer icon on your iPhone’s Settings menu when you plug it into your computer while running XCode. Seeing this option in your Settings means you have enabled developer mode on your iPhone. You can now start demoing apps, checking logs, and playing with other developer settings on your device."
    }
  ]
}