{
  "url": "https://www.wikihow.com/Enter-Proxy-Settings-in-Internet-Explorer",
  "title": "How to Enter Proxy Settings in Internet Explorer",
  "steps": [
    {
      "title": "Press ⊞ Win+S to open the Windows search bar.",
      "content": "Press ⊞ Win + S to open the Windows search bar. This will open the search bar on all versions of Windows beginning with Vista. This method will also work for other web browsers, including Microsoft Edge, Google Chrome, and Mozilla Firefox. If you're using Windows XP, open Internet Explorer, click the Tools menu, and then skip to step 3."
    },
    {
      "title": "Type internet into the search bar.",
      "content": "Type internet into the search bar. A list of matching results will appear."
    },
    {
      "title": "Click Internet Options.",
      "content": "Click Internet Options . This opens the \"Internet Properties\" control panel."
    },
    {
      "title": "Click the Connections tab.",
      "content": "Click the Connections tab. It's at the top of the window."
    },
    {
      "title": "Click LAN Settings.",
      "content": "Click LAN Settings . It's the button on the bottom of the tab."
    },
    {
      "title": "Check the box next to \"Use a proxy server for your LAN.\"",
      "content": "Check the box next to \"Use a proxy server for your LAN.\" It's under the \"Proxy server\" header in the bottom half of the window."
    },
    {
      "title": "Enter the proxy server address and port.",
      "content": "Enter the proxy server address and port. The address and port both have their own boxes under the \"Proxy server\" header. If you need to specify different addresses and ports for different services (e.g., you have a separate proxy for FTP connections), click the Advanced button to enter your additional info."
    },
    {
      "title": "Check the box next to \"Bypass proxy server for local addresses.\"",
      "content": "Check the box next to \"Bypass proxy server for local addresses.\" This will allow you to do things like access your wireless router's admin website without going through the proxy server."
    },
    {
      "title": "Click OK and then OK again.",
      "content": "Click OK and then OK again. This will close the Internet Properties panel and save your changes."
    },
    {
      "title": "Close and re-open Internet Explorer.",
      "content": "Close and re-open Internet Explorer. Once you restart your browser, your web traffic will be routed through the proxy server you specified."
    }
  ]
}