{
  "url": "https://www.wikihow.com/Crack-Your-Knee",
  "title": "How to Crack Your Knee",
  "steps": [
    {
      "title": "Sit in a chair or lay down on your back.",
      "content": "Sit in a chair or lay down on your back. If you want to pop your knee gently and with some control, it's best to take all pressure off of it. Sitting or lying down will allow you to move it intentionally and control exactly when the popping occurs."
    },
    {
      "title": "Stretch your leg out straight.",
      "content": "Stretch your leg out straight. Extend your knee joint as straight as it can go. This puts the joint in its fully extending position, potentially moving your ligaments and knee cap across your leg bones enough to move air in the joint, which causes a pop. It may be that this movement alone is enough to crack your knee."
    },
    {
      "title": "Bend your leg, if necessary.",
      "content": "Bend your leg, if necessary. If your knee doesn't crack just by extending your leg, then move the joint into its completely opposite position. If you are sitting, simply bend the bottom of your leg in towards the chair. If you are laying down, raise your knee in the air and pull your foot in towards your buttocks. To contract the joint completely while sitting in a chair, you may need to move your buttocks forward to the edge of the chair. This will allow you to bend the knee further. Bending your leg completely will move the bones and ligaments across each other, causing a pop when ligaments go over uneven bones or when air moves through the joint."
    },
    {
      "title": "Extend and contract the knee joint until it pops.",
      "content": "Extend and contract the knee joint until it pops. It can take several rounds of moving the knee in this manner to get the joint to crack. Just be sure to move back and forth slowly, so that you can stop the movement if it becomes painful or uncomfortable. By moving your knees from extension to flexion and back again, you can help your kneecap fully engage into the center of your knee joint. [2] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 31 July 2020. If this gets your knee to crack there's nothing wrong with that happening. However, it is a sign you need to work on being more limber. [3] X Expert Source Jonathan Frank, MD Sports Orthopedic Surgeon & Joint Preservation Specialist Expert Interview. 31 July 2020. If you can't get your knee to crack with this movement, then you may need to put some pressure on the joint to make it happen."
    },
    {
      "title": "Position your body to do a lunge.",
      "content": "Position your body to do a lunge . Stand up with your feet hip-distance apart. Then step one foot back and bend your knees. You should step back far enough so that your front knee stays over the front ankle when you bend. The back knee should be in line with the hip when it is bent. [4] X Research source Being in the proper position will ensure that you don't injure your knee when you put pressure on it."
    },
    {
      "title": "Do a slow, controlled lunge.",
      "content": "Do a slow, controlled lunge. Lower your body down far enough so that the back knee is close to the floor, but not touching it. As you go down, your front foot should stay flat on the floor and your back foot will bend so that the toes are only touching the floor. [5] X Research source Putting pressure on the knee joint while trying to pop it will make the ligaments and bones move into slightly different positions than they would go into without added weight. This slight change may be enough to crack your knee."
    },
    {
      "title": "Try full squats to pop both knees, if necessary.",
      "content": "Try full squats to pop both knees, if necessary. If knee bends are not your cup of tea, then you can bend both knees at the same time. Place your feet hip width apart and then slowly squat your body down. Be sure to move in a slow controlled manner, so that you can abandon the movement if it becomes painful. [6] X Research source Squatting like this uses your body weight to contract the knee joint further than it would normally go. This position may be extreme enough to crack a knee that has been hard to crack. It is important to be careful and controlled when doing squats. If you just release all control and let your body drop, it could injure your knees."
    },
    {
      "title": "Consult with a doctor.",
      "content": "Consult with a doctor. If your knees feel like they need to be cracked often, and especially if you have associated pain, you should have them looked at by a doctor. Your doctor should be able to identify the problem and will give you options for treatment. While some knee popping is perfectly normal, a constant need to pop your knee could signal a problem with your cartilage being worn down, a tear in your meniscus , or developing arthritis. [7] X Research source In many cases, treatment options will include medication, physical therapy, and, if the problem is severe, surgery."
    },
    {
      "title": "Take anti-inflammatory medication.",
      "content": "Take anti-inflammatory medication. In a lot of cases, cracking in the knee occurs when the knee bones are not sitting correctly because there is excessive inflammation between them. If you can reduce this inflammation, then cracking will feel less necessary. You can take an over-the-counter anti-inflammatory, such as ibuprofen. Talk to your doctor if you think a prescription anti-inflammatory would be more effective for your condition."
    },
    {
      "title": "Do low-impact knee exercises.",
      "content": "Do low-impact knee exercises. While it may be tempting to stop moving a knee that feels like it needs to be cracked all the time, it is important to keep it moving. Low-impact exercises that will be good for your knees include: Swimming . Bicycling. Water aerobics. Elliptical ."
    },
    {
      "title": "Minimize activities that are hard on the knees.",
      "content": "Minimize activities that are hard on the knees. While some exercises are great for keeping the knees healthy and flexible, there are other exercises that can be particularly bad for knees that are already compromised. Avoid activities that create a strong impact on the knees, particularly activities that include running. If you want to continue running, at least try to give your knees time to recover between sessions. For instance, alternate your running days with days when you do a low-impact exercise like cycling."
    }
  ]
}