{
  "url": "https://www.wikihow.com/Eat-Dosa",
  "title": "How to Eat Dosa",
  "steps": [
    {
      "title": "Wash your hands",
      "content": "Wash your hands with soap and water. Indian food, including dosa, is traditionally eaten with your hands. Prevent the spread of bacteria to your food by thoroughly lathering your hands with soap and rinsing them off with water before you eat. [1] X Research source If you don’t have access to a sink, you can use hand sanitizer or hand wipes as an alternative."
    },
    {
      "title": "Tear off a small piece of dosa.",
      "content": "Tear off a small piece of dosa. If you are eating a funnel-shaped dosa, start tearing off pieces at the bottom of the dosa. If you're eating a traditionally-shaped dosa, start at one end of the pancake. Pinch the end of the dosa with your fingertips and tear away a bite-sized piece. Don't let the food touch your palms. [2] X Research source Dosa is not meant to be eaten like a sandwich. Traditionally, Indians will eat dosa with their right hand. Eating with your left hand could be considered rude in some places. [3] X Research source Use your thumb to tear away the dosa when using one hand."
    },
    {
      "title": "Dip the dosa in an accompaniment and eat it.",
      "content": "Dip the dosa in an accompaniment and eat it. Dosa will typically come with sambar and chutney. Sambar is a flavorful vegetable soup and chutney is a spicy condiment. Dip a piece of dosa in each accompaniment, one at a time, so that you get a taste of each ingredient separately. Avoid putting your fingers in your mouth as this could be considered rude. [4] X Research source If you want, you can dip the dosa in both the sambar and chutney for a unique flavor, however, this may contaminate the taste of each accompaniment. Avoid double-dipping it if you're sharing the dosa with someone else."
    },
    {
      "title": "Break the dosa in half if you’re eating a masala dosa.",
      "content": "Break the dosa in half if you’re eating a masala dosa. Sometimes dosa will come with masala, or spiced potatoes, inside of the dosa while other times the masala will be served on the side. Grab each end of the dosa and pull them towards you to break it in down the middle and reveal the masala. [5] X Research source Steam will usually escape out of the dosa as you split it in half. Order a masala dosa if you want a more filling, heartier meal."
    },
    {
      "title": "Wrap the dosa around some masala and dip it in an accompaniment.",
      "content": "Wrap the dosa around some masala and dip it in an accompaniment. Since you can’t dip the dosa in the masala because it’s solid potatoes, wrap the dosa around the masala and then dip it in the chutney or sambar. This will give you a nice bite of the dosa and other ingredients. [6] X Research source Wrapping the dosa around masala potatoes is the traditional way to eat masala dosa."
    },
    {
      "title": "Cut off a small piece of dosa.",
      "content": "Cut off a small piece of dosa. Stab the dosa with a fork to hold in place. Hold a knife in your other hand and cut off a small piece. You can enjoy a piece of dosa without any accompaniments to see how it tastes plain. [7] X Research source The piece of dosa should be small enough for a single bite. Use utensils when eating dosa in a formal environment."
    },
    {
      "title": "Cut the dosa in half if you are eating masala dosa.",
      "content": "Cut the dosa in half if you are eating masala dosa. If you are eating masala dosa, the masala, or spiced potatoes, are inside of the actual dosa. In this case, you’ll want to cut the dosa in half so that you can access the masala inside of the dosa. Use a fork to hold the dosa in place, then use a knife to cut the dosa down the middle, widthwise. [8] X Research source When you cut the masala dosa in half, the steam and aromatics from the potatoes will come out of the dosa."
    },
    {
      "title": "Spread the chutney and masala on the dosa with a knife.",
      "content": "Spread the chutney and masala on the dosa with a knife. Keep the dosa in place with a fork while you spread the chutney and masala onto your piece of dosa. You can also dip the dosa directly into each accompaniment if you prefer. [9] X Research source If you don’t want to mix the accompaniments, clean your knife off with a napkin after you use it."
    },
    {
      "title": "Sprinkle sambar on the dosa with a spoon and enjoy.",
      "content": "Sprinkle sambar on the dosa with a spoon and enjoy. Use a spoon or sprinkle the sambar directly from its container onto your piece of dosa and eat it. If done correctly, all the ingredients will complement each other for a perfect bite! [10] X Research source Experiment with different amounts of each ingredient to see what you like the most."
    },
    {
      "title": "Try sada dosa if you’re new to eating dosa.",
      "content": "Try sada dosa if you’re new to eating dosa. Sada dosa is the most basic kind of dosa and is a plain dosa pancake with the accompaniments on the side. If you’re new to dosa, you may want to try this variation at first. [11] X Research source"
    },
    {
      "title": "Order a masala dosa for a heartier dish.",
      "content": "Order a masala dosa for a heartier dish. Masala, or spiced potatoes, come in the center of this dosa. In addition, some of the oil and flavor from the masala is often transferred to the dosa itself. [12] X Research source Masala dosa is a little messier to eat than other dosas."
    },
    {
      "title": "Eat a paper dosa for a flakier dosa.",
      "content": "Eat a paper dosa for a flakier dosa. A paper dosa is the thinnest of all dosas. Try this dosa if you prefer your dosa to be lighter or thinner. [13] X Research source Paper dosa is popular in South India."
    },
    {
      "title": "Try a set dosa for a thicker dosa.",
      "content": "Try a set dosa for a thicker dosa. Set dosas look like wheat pancakes. The batter that's used is thicker, which creates a heartier dosa. [14] X Research source Set dosas originate from Karnataka, India."
    },
    {
      "title": "Try lesser-known dosas for unique flavors.",
      "content": "Try lesser-known dosas for unique flavors. There are hundreds of unique dosas made in different regions across India. Some dosas like the bene dosa have a lighter texture and are sometimes served with a potato filling called potato palya. Others include different ingredients like cheese, onions, and additional spices. Investigate the different dosas that are available and figure out which variation you like best! Other dosas include onion dosa, rava dosa, green gram dosa, moong dal dosa, oats dosa, neer dosa, and bajra dosa."
    }
  ]
}