{
  "url": "https://www.wikihow.com/Fade-Your-Tan-Fast",
  "title": "How to Fade Your Tan Fast",
  "steps": [
    {
      "title": "Dab on some dairy.",
      "content": "Dab on some dairy. The lactic acid in milk not only combats pigmentation problems, but stimulates collagen to improve your skin’s firmness and refines the appearance of wrinkles and lines. You can receive its benefits by dipping your hands directly into milk or milk mixtures, or by buying skincare products containing lactic acid. Full-fat Greek yogurt is another popular choice. Massage it into the tanned skin, let it sit for twenty minutes, and then wash it off with warm water. Repeat daily. Its fat content also moisturizes! Lactic acid peels are also available for more extreme, ongoing treatment (in case of irregular, unwanted pigmentation spots in skin), but skin generally takes time to adapt to and fully tolerate the process. Therefore, it's not best for our purposes here."
    },
    {
      "title": "Mix lemon juice with aloe juice.",
      "content": "Mix lemon juice with aloe juice. Lemon juice will dry your skin out, but has lightening properties. Adding aloe juice for its moisturizing properties makes for a winning combination. [1] X Research source Don’t sweat the ratios too much. Mix equal-ish parts aloe and lemon juice, rub it into your skin, and wash the area twenty to thirty minutes later. You should especially steer clear of the sun with any lemon juice-based mixture on your skin, as it can make your skin extremely sensitive to UV rays."
    },
    {
      "title": "Combine buttermilk and tomato juice.",
      "content": "Combine buttermilk and tomato juice. Tomato is a natural bleaching agent, and we already know about dairy. Apply two parts buttermilk and one part tomato juice to the tan via cotton ball, and wash off after thirty minutes."
    },
    {
      "title": "Attack a fake tan with baby oil.",
      "content": "Attack a fake tan with baby oil. With spray-on tans in particular, baby oil proves highly effective in helping you slough off that uppermost layer of color. Exfoliation is still the name of the game (and skin cell removal is the idea) so after leaving the baby oil on the area for thirty to forty minutes, take a bath and exfoliate appropriately. [2] X Research source"
    },
    {
      "title": "Coat yourself in sunscreen.",
      "content": "Coat yourself in sunscreen. You can’t go overboard here if you’re trying to stay as pale as possible! 30 SPF is the baseline advised by the American Academy of Dermatology, though going higher doesn’t hurt. [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source It’s easy to forget about the brief, incidental sun exposure we all incur just going about our daily lives. Remember to apply every day if you’re looking to avoid gaining color; you walk under the same sun when you get your mail as you do when you stroll along the beach."
    },
    {
      "title": "Cover up, even on cloudy days.",
      "content": "Cover up, even on cloudy days. Long sleeves may not be too fun in the heat, but you’ll need to cover as much skin as you can while you’re outside. Clouds make very little difference in the sun’s effect on your skin, too, blocking a mere 20% of UV rays. [4] X Research source And if you thought you were safe on the ski slopes, think again: snow actually reflects 80% of UV rays, increasing exposure. So if you were planning on skiing shirtless for some reason… maybe don’t."
    },
    {
      "title": "Open an umbrella.",
      "content": "Open an umbrella. Admittedly, you might feel a little silly at first, but it’s a surefire way to block out the sun during your walk down the block. Consider a parasol if you’re looking for something a little more chic. Don’t entrust it all to an umbrella at the beach, however. As you might’ve guessed after learning of snow’s powerful reflective potential, sand, too, reflects UV rays. Not as bad as snow—only 17% from sand—but still enough for the sun to make its mark. [5] X Research source"
    },
    {
      "title": "Stay indoors.",
      "content": "Stay indoors. When it comes down to it, staying inside will keep you the palest. Full-on hermit life isn’t an option for everyone, though, and keep in mind it’s not a requirement to keeping your skin lighter if you can abide by the above steps. The body does requires Vitamin D, though, and nutritional guidelines for vitamin D (600 IU from ages 1-70) are generally set with the assumption that a person will be receiving some regular sunlight. [6] X Research source Fatty fish, beef liver, eggs, cheese, and mushrooms provide some vitamin D, and U.S. milk is often fortified with it."
    },
    {
      "title": "Stop now if you’re sunburned.",
      "content": "Stop now if you’re sunburned . You might be tempted to attack your sun damage even harder if you’re burned, but the methods in this article are suitable for tans only. Exfoliating while you’re burned will be ineffective and extremely painful. Apply aloe vera to ease pain and hydrate your scorched skin. Revisit this guide once your burn has healed or peeled."
    },
    {
      "title": "Start with the proper exfoliant.",
      "content": "Start with the proper exfoliant. You don’t want to be rough on your skin, per se, but the overall idea here is to speed up the process by which your body sheds its skin cells. Your body wants something good for scrubbing. Good exfoliants for this purpose will have retinoids or alpha hydroxyl acids. These ingredients specifically help in skin-cell turnover rates and get rid of color."
    },
    {
      "title": "Use a loofah, not a pouf.",
      "content": "Use a loofah, not a pouf. Loofahs are dried, tubular gourds, the fibrous fruit of the loofa plant. The pouf, on the other hand, is a synthetic scrubber, made to be a gentler scrubbing tool with maximum lather-up potential. We don’t want gentle for this task—we want the tougher loofah."
    },
    {
      "title": "Dampen the affected skin.",
      "content": "Dampen the affected skin. Take a shower and then pat yourself (mostly) dry, or use a wet washcloth on your skin."
    },
    {
      "title": "Apply the exfoliant to the loofah, and massage your skin with it in a circular motion.",
      "content": "Apply the exfoliant to the loofah, and massage your skin with it in a circular motion. The exfoliant and loofah will be providing the grit, so don’t use an overly aggressive technique. Simply rub your skin in small circles, rinse it off with cool water, and repeat daily. [7] X Research source"
    }
  ]
}