{
  "url": "https://www.wikihow.com/Find-the-Admin-of-a-Facebook-Group",
  "title": "How to Find & Contact Admins & Moderators of a Facebook Group",
  "steps": [
    {
      "title": "Go to a Facebook group.",
      "content": "Go to a Facebook group. Go to Facebook's website or open the app, then choose the Groups tab. Click on the gray search bar at the top of the left menu. Type in the name of a group, then click on its title within the search results. This is located in the top right corner of your mobile device. It looks like a gray circle with a magnifying glass icon. Type in the name of a group and tap on its title in the search results. You can also simply click or tap on a group if it's the list on your screen or in the sidebar."
    },
    {
      "title": "View the members.",
      "content": "View the members. Once you are on the group's page, click on the Members tab in the menu bar directly underneath the header. [1] X Research source There is not a tab labeled \"Members\" in the mobile app. Instead, you should tap on the title of the group located within the header. Scroll down and tap the See all button next to the header that says \"Members.\""
    },
    {
      "title": "Locate the admin(s).",
      "content": "Locate the admin(s). The admins and moderators of a group will be located at the top of the \"Members\" page under the header that says \"Admins and moderators.\" You can view the admins of a public or private group regardless of if you are a member. However, if the group is private and you are not a member of it, keep in mind that you cannot see any of the other members."
    },
    {
      "title": "Identify the admin, if necessary.",
      "content": "Identify the admin, if necessary. There is a difference between admins and moderators. An admin has complete control over the group while a Moderator has limited control. Admins of a group will have the tag \"Admin\" under their name, while moderators will have the tag \"Moderator\" under their name. Depending on your issue, you might want to contact the group's admin instead of a moderator. However, some groups may have rules about whether you're supposed to contact an admin or moderator first for help."
    },
    {
      "title": "Go to their profile.",
      "content": "Go to their profile. If you haven’t already, tap or click on the name of the admin to navigate to their profile."
    },
    {
      "title": "Click or tap on the Messenger icon.",
      "content": "Click or tap on the Messenger icon. This button labeled, \"Message,\" has a speech bubble icon next to it. It is located directly underneath the user's name. On your computer, you will now see a chat box appear in the lower right corner. If you are using a mobile device you will be automatically redirected to the Messenger app."
    },
    {
      "title": "Send a message.",
      "content": "Send a message. This should be a relatively short message (a few sentences at most) that describes your overall comment, question, or issue you want to bring up with the admin. Type this out in the chat box and click or tap on the blue airplane/arrow icon in the bottom right corner of the chat box."
    },
    {
      "title": "Wait for a reply.",
      "content": "Wait for a reply. It may take a little while for the admin to message you back. If it’s been more than a few days without a reply, you can consider sending a follow-up message or friendly reminder. If you are not friends with the admin, keep in mind that they have to first accept your message request before replying. Remember that most group admins run Facebook groups in their spare time, so they might take a little time to reply if they're busy. They also might be dealing with a lot of messages from group members if the group is large."
    },
    {
      "title": "Send a message back.",
      "content": "Send a message back. Once the admin gets back to you, send them a reply if needed. This is also a good time to add any extra information you did not include in your original message."
    },
    {
      "title": "Go to your group on Facebook.",
      "content": "Go to your group on Facebook. In order to add an admin to your Facebook group , you need to be an admin yourself. If you're not an admin, you won't be able to complete these steps."
    },
    {
      "title": "Click the Members tab.",
      "content": "Click the Members tab. If you're on mobile, tap the name of your group and scroll down to the members section."
    },
    {
      "title": "Click the three-dot icon next to the member you want to promote to admin.",
      "content": "Click the three-dot icon next to the member you want to promote to admin. You may need to scroll to find the person you want to promote. Alternatively, you can search for the member using the search bar at the top of the member list."
    },
    {
      "title": "Choose Invite as admin.",
      "content": "Choose Invite as admin . You can also choose Invite as moderator if you'd rather promote someone to a mod. Click Send invite . Admins are able to edit the group, add members and admins, and remove members and admins. Make sure to only promote people you trust to be an admin of your group. [2] X Research source"
    }
  ]
}