{
  "url": "https://www.wikihow.com/Create-a-Harry-Potter-Bedroom",
  "title": "How to Create a Harry Potter Bedroom",
  "steps": [
    {
      "title": "Choose a color to paint your room.",
      "content": "Choose a color to paint your room. Choose the colors of your favorite Hogwarts house to show off your personality. Hogwarts is mostly wood or stone, so you can paint it to look like either. But remember you may not like Harry Potter or Hogwarts later on in your life. Know which house you're in because each Hogwarts dorm is decorated with the colors of the houses. The colors are: [1] X Research source Scarlet and gold for Gryffindor . Yellow and black for Hufflepuff . Blue and bronze for Ravenclaw . Green and silver for Slytherin ."
    },
    {
      "title": "Paint a mural if you're really dedicated and have enough money.",
      "content": "Paint a mural if you're really dedicated and have enough money. It will take up a big part of the room, and it will certainly imply that you're a Harry Potter fan. Plus, it'll look pretty awesome!"
    },
    {
      "title": "Decorate your room.",
      "content": "Decorate your room. You can decorate it with banners that match the color of the room, or you could use authentic-looking items that were used in the books or movies. Or, if you don't have a lot of money, you can just decorate your walls with posters. Another thing you can do is get some statues or toys of your house's animal! The house animals are: [2] X Research source Gryffindor: Lion Hufflepuff: Badger Ravenclaw: Eagle Slytherin: Serpent"
    },
    {
      "title": "Put up all the movie posters on your wall and different variations of them so you won't just have eight posters, but nine for Deathly Hallows parts one and two and the Cursed Child.",
      "content": "Put up all the movie posters on your wall and different variations of them so you won't just have eight posters, but nine for Deathly Hallows parts one and two and the Cursed Child. You can even make your own. If you're good at drawing, draw a picture of your favorite character. Or just write the name of the house you're in, using a marker."
    },
    {
      "title": "Add additional furnishings.",
      "content": "Add additional furnishings. Put up pictures of Harry Potter, fake potion bottles, a fake sword of Godric Gryffindor, a spellbook, etc. You could also make a Hogwarts acceptance letter, and display it proudly on your wall."
    },
    {
      "title": "Add soft furnishings.",
      "content": "Add soft furnishings. For your bed, you can put curtains around it if you have space, just like the students in your dormitory do. You can also change the sheets of your bed to your favorite house color. [3] X Research source Get Harry Potter pillows, bedsheets, etc. Etsy is a good place to look. However, you may find this is over-the-top to add Harry Potter bedding, so don't worry if you don't want it. You can hang pinch-pleat curtains. The best way to hang pinch pleat curtains is to use drapery pins. It is easy to adapt those pins. If you do not want the ring in which you are putting the pin to show, put the top of the pinch pleat in line with the rod. It raises the curtain off the ground a little more, and the hardware does not show."
    },
    {
      "title": "Place soft furnishings in other areas of the room.",
      "content": "Place soft furnishings in other areas of the room. A toy cat, owl or toad would be great. A rat is also okay. You can also get a pygmy puff."
    },
    {
      "title": "Place books on shelves.",
      "content": "Place books on shelves. If you have a bookshelf, put your Harry Potter books on top, so people know you treasure them [4] X Research source (You can also put the movies too.). Display your Harry Potter books and movies. It looks best if the books are in hardcover. There are many ways to display them; you could put them all on the top shelf of a bookshelf, or even get a special shelf just for them. Put these books on a bookshelf for everyone to see. Try to be creative and have a nice design layout."
    },
    {
      "title": "Put a sign on your door that has a picture of your favourite character or house emblem.",
      "content": "Put a sign on your door that has a picture of your favourite character or house emblem."
    },
    {
      "title": "Put Harry Potter things around your room such as the things mentioned in the tips.",
      "content": "Put Harry Potter things around your room such as the things mentioned in the tips. There are some other ideas too like taking a regular broomstick and painting it to look a little fancier, or for the spell books, put a fancy book cover on your books. You can also paint a stick to make it look like a wand if you don't have one."
    },
    {
      "title": "Hang up HP pictures on a bulletin board.",
      "content": "Hang up HP pictures on a bulletin board. You can draw your own or print some off the internet. You could even show off pictures of you. could also have photos of you in your Harry Potter Character Halloween costume."
    },
    {
      "title": "Hang Hogwarts robes in your closet.",
      "content": "Hang Hogwarts robes in your closet. Or even better, have a hook somewhere outside your closet and hang the robes on that. If you put them in the closet make sure the closet doors are open when guests come over."
    },
    {
      "title": "Add in some really cool stuff.",
      "content": "Add in some really cool stuff. Have an old trunk like the ones they bring to Hogwarts? Set it near your bed and use it as a toy chest or a cage for Hedwig. [5] X Research source Have a stuffed animal owl? Put it somewhere where people can see it. If you have a Harry Potter Wand, set it on your nightstand. You could even hang the model of a Firebolt or Nimbus 2000 on the wall."
    },
    {
      "title": "Enjoy your Harry Potter themed bedroom!",
      "content": "Enjoy your Harry Potter themed bedroom!"
    },
    {
      "title": "Add Harry Potter accents to your kitchen.",
      "content": "Add Harry Potter accents to your kitchen. Use mugs and glasses with your house colors on them. Use cauldrons instead of bowls when having guests over. Serve drinks in the cauldrons."
    },
    {
      "title": "Fix up the bathroom in Harry Potter style.",
      "content": "Fix up the bathroom in Harry Potter style. All you need to do with the bathroom is put a Girl or Boy sign, and find a friendly ghost to be Moaning Myrtle."
    }
  ]
}