{
  "url": "https://www.wikihow.com/End-a-Letter-Sincerely",
  "title": "How to End a Letter Sincerely: 14+ Tips for Business & Personal Letters",
  "steps": [
    {
      "title": "“Sincerely”",
      "content": "“Sincerely” “Sincerely” works for any kind of letter, both professional and personal. When you’re trying to express sincerity, why not do so literally? “Sincerely” is a classic complementary close. The tone is formal enough for any professional correspondence while also conveying your sincerity to the reader (whoever they may be). [1] X Research source Variations of this close include: Sincerely Sincerely yours Very sincerely Very sincerely yours"
    },
    {
      "title": "“Regards”",
      "content": "“Regards” Use distant but polite closes for new, important professional contacts. When you’re introducing yourself to a new contact or reaching out to a business associate you don’t know very well, it’s important to seem professional . “Regards” implies both sincerity and respect. [2] X Research source Use similar closes like: Cordially Respectfully Best regards “Regards” is a fairly neutral phrase. If you want to add some decorum without getting too friendly, “Best regards” is an easy switch."
    },
    {
      "title": "“Kind regards” or “Yours truly”",
      "content": "“Kind regards” or “Yours truly” Closers like “Kind regards” strike a balance between formal and friendly. If you frequently speak with the recipient, be it a close colleague or friend, it’s okay to close letters with more familiarity. “Kind regards” is polite but friendlier in tone, while “Yours truly” communicates a sense of integrity with your letter. [3] X Research source Try other closes like, Kindest regards Warmly Warm(est) regards Have a good day/evening/weekend Take care"
    },
    {
      "title": "“Hope to talk soon”",
      "content": "“Hope to talk soon” “Hope to talk soon” encourages the reader to get back to you quickly. Use this closing phrase when you're sending a letter with the goal of getting a reply. It clarifies your intent while still sounding polite and indicating your sincere desire to talk to them. [4] X Research source Use variations like: Looking forward to your reply Hope to hear from you soon When writing to a friend, you could shorten the phrase and say, “Talk soon.”"
    },
    {
      "title": "“Thank you for your time”",
      "content": "“Thank you for your time” Use “Thank you for your time” when asking for a professional favor. It’s polite and sincere because it thanks the reader for taking the time to read your message in the first place. Your correspondent will likely help you if you acknowledge their efforts! This also applies when you want to write letters of interest and cover letters. [5] X Research source Variations include: Thank you for your consideration Thank you for your recommendation Thank you in advance Thank you for your assistance Thank you (or “Thanks again” if you’ve already said it once near the beginning of the letter.)"
    },
    {
      "title": "“With appreciation”",
      "content": "“With appreciation” “With appreciation” is a formal variation of a simple “thank you.” If you already used “thank you” in the body of your letter, or you want to find a different phrase to express your gratitude, use “With appreciation” to thank the reader for looking over the correspondence. It’s especially helpful when you want to write a cover letter and letters of interest. [6] X Research source You could also say: With gratitude Gratefully With sincere thanks Many thanks"
    },
    {
      "title": "“Best”",
      "content": "“Best” “Best” is polite yet not overly formal and an ideal default for most letters. Whether you’re writing a business inquiry or a quick note to a family member, “Best” is a great way to communicate your well-wishes to them politely. Use it as a default option, especially if you want a slightly more casual alternative to “Sincerely.” [7] X Research source Other versions include: Best wishes All the best Best of luck"
    },
    {
      "title": "“Love” or “Fondly”",
      "content": "“Love” or “Fondly” Affectionate closers convey sincerity to close friends and loved ones. There are some closes that should never be included in business correspondence—but are lovely and sincere inclusions in a letter to a close friend, partner, or family member. [8] X Research source In addition to “Love” and “Fondly,” those include: Your friend Cheers With love Always Hugs XOXO"
    },
    {
      "title": "“As always”",
      "content": "“As always” Use “As always” with friends and contacts you haven’t spoken to in a while. The phrase is polite and sincere; it indicates that you and your feelings are still the same. When you’re writing to a friend you don’t see often, it doesn’t hurt to remind them that you’re still you! [9] X Research source You could also use “As ever” to close the letter instead."
    },
    {
      "title": "“With deepest sympathy”",
      "content": "“With deepest sympathy” Use your close to express emotions when you write personal letters. A descriptive closer can remind a friend of your relationship and how you feel. End the letter by writing out the exact emotion you mean to express, whether it’s sympathy, sorrow, admiration, and so on. This kind of closer isn’t ideal for business correspondences, so save it for friends and family. [10] X Research source With heartfelt admiration With my most sincere apologies With a heavy heart"
    },
    {
      "title": "Base your signature on how well you know the person you’re writing to.",
      "content": "Base your signature on how well you know the person you’re writing to. A signature is an important part of any handwritten letter and provides a feeling of authenticity to your words. Just be sure to consider who you’re writing to before signing your letter and sending it off! [11] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Sign your first and last name when you write to someone you’ve never met in person. Sign only your first name on letters to friends or work colleagues who know you. Write your last name in parentheses if you’ve spoken to the recipient on the phone but never met them in person."
    },
    {
      "title": "Use a handwritten or email format when sending professional letters.",
      "content": "Use a handwritten or email format when sending professional letters. The formatting is simple enough: add a comma directly after your closing phrase, then leave 2 to 4 lines of space before leaving your signature. Then, in the lines below your signature, add any key information the recipient might need, like your email, job title, phone number, or work address. [12] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source Choose from the following formats: On a handwritten letter, include: Sincerely, Ashton Bailey (Signature) Ashton Bailey (Your written name) email@gmail.com (Your email) 555-555-5555 (Your phone number) In an email, you only need your name, email address, company website, and logo (if there is one)."
    }
  ]
}