{
  "url": "https://www.wikihow.com/Deal-With-Parents-That-Show-Favouritism",
  "title": "How to Deal With Parents That Show Favouritism",
  "steps": [
    {
      "title": "Consider your feelings before having a discussion.",
      "content": "Consider your feelings before having a discussion. Take a step back and evaluate the emotions attached to your perceived experience of favoritism. Gather the facts, and do your best to remove any raw emotions. Determine based on this if you have experienced genuine favoritism or if perhaps perceived slights have been blown out of proportion by your own feelings. Evaluate, too, if your behaviors or actions in part may have contributed to your perception of favoritism. For example, if your sister has taken an interest in your mom’s favorite hobby to spend more time with her, that may explain why they are closer."
    },
    {
      "title": "Approach your parents when both of you are in good, calm moods.",
      "content": "Approach your parents when both of you are in good, calm moods. Ask if you can speak with them about something important. Avoid talking just as they have come in from work or while they are in the middle of doing something. Instead, choose a time when you are both free. Try asking after a meal, when everyone is relaxed."
    },
    {
      "title": "Open up the talk with an example.",
      "content": "Open up the talk with an example. Once you all have sat down to discuss the issue, open up the discussion with their most recent show of favouritism. Providing your parents with a concrete example of their own bias is a great way to help them understand your perspective. [1] X Research source Say “Mom and Dad, the other day when I asked to go to the movies, you told me no, but when Sarah asked, you said yes. I’m older than her and haven’t gotten into any trouble so I’m really confused on why she gets more privileges than me.”"
    },
    {
      "title": "Explain how you feel",
      "content": "Explain how you feel , using other examples to back yourself up. Remember not to get angry, or use the examples as accusations. Once you get angry, they may clam up and stop listening. You want this to be a discussion where you both can share your sides of the story, not an argument about what they're doing wrong. Say something like “When you punish me for the things Mark did, it really hurts my feelings and makes me resent him.”"
    },
    {
      "title": "Focus on your feelings and use “I” statements.",
      "content": "Focus on your feelings and use “I” statements. Instead of making comments like “You never” or “You always”, focus on your own perspective.Say \"I feel...\" instead. Don’t make them out to be the bad guys all of the time, but do let them know how things are from your point of view. [2] X Research source If you feel that you can’t talk in person, write a letter or speak over the phone instead. You might say, \"I feel lonely when you take Sarah to the park and leave me to finish my homework.\""
    },
    {
      "title": "Listen to their perspective.",
      "content": "Listen to their perspective. Once you have spoken your piece, listen to their views on the topic. There might be reasons that they show favouritism to your siblings, like an issue at school you may not know about. Avoid using your phone or daydreaming during this time. [3] X Research source Don’t interrupt them, yell or curse."
    },
    {
      "title": "Remain calm.",
      "content": "Remain calm. Though the situation seems unfair and is making you upset, stay calm with your parents. Take deep breaths in and out to keep yourself centered. If you become overly emotional, your parents aren’t likely to take you seriously. [4] X Research source Agree to step away from the conversation if things get hectic."
    },
    {
      "title": "Talk to your sibling.",
      "content": "Talk to your sibling. Though you might be feeling a little frustration with your sibling too, reach out to them to talk if you feel comfortable. They are the only other person who knows what it’s like to have the same parents as you, even if their experience is different from yours. [5] X Research source If you can’t talk to a sibling, talk to another family member. Try to counteract the negative effects of parental favoritism and possible sibling rivalry by cultivating a strong relationship with your sibling that is independent from your parents. You can do this by spending quality time together outside of family functions or making a date to go to lunch. Having a positive relationship with your sibling can help increase the emotional support you feel that you may not always get from your parents."
    },
    {
      "title": "Don't blame your sibling for the sins of your parents.",
      "content": "Don't blame your sibling for the sins of your parents. Sometimes, some of the \"less favorite\" siblings will see the child and the parents as a conspiracy against them. Remember, your sibling did not chose the favoritism, your parents did. Don't let one bad parental decision strain the relationship with your siblings."
    },
    {
      "title": "Consider whether it really is favoritism by looking at all sides of the issue.",
      "content": "Consider whether it really is favoritism by looking at all sides of the issue. Your parents may relate differently to your sibling, and act differently around them, but not favor them. They may not realize that they make you feel as though they favor your sibling. Your sibling might also be a lot younger or may be sick and need more attention. If some of these issues are present, consider letting it go for now."
    },
    {
      "title": "Vent in a journal.",
      "content": "Vent in a journal. Sometimes, the anger will get to you and you’ll need to vent. Don't worry, just get your feelings out so you can allow yourself to move on from them. Write down how the favouritism makes you feel. [6] X Research source"
    },
    {
      "title": "Talk to your friends about their experiences.",
      "content": "Talk to your friends about their experiences. Your friends might also have parents who favor their siblings over them, too; talk to them and find out how they cope, or just vent to them. [7] X Research source"
    },
    {
      "title": "Do something nice for yourself.",
      "content": "Do something nice for yourself. It can be really tough feeling that your parents favor your brother or sister over you. Treat yourself to something nice on the days that are tough. Go out and have ice cream with friends or watch that new movie you’ve been waiting to see. Don’t let this situation get you down."
    },
    {
      "title": "Follow all of their rules.",
      "content": "Follow all of their rules. Though you can’t force your parents to favor you, you can ensure that you keep all of their rules and stay out of trouble. Don’t give them any reason to find fault with you. You might find that your parents don’t really favor your sibling, but that they simply wish you were more responsible. [8] X Research source If your curfew is at 10PM, come home at 9:45PM. If you’re not allowed to watch certain shows or listen to certain music, don’t do so, even when you’re alone. If you feel that the rules are unfair, talk to your parents."
    },
    {
      "title": "Complete your chores and homework on time.",
      "content": "Complete your chores and homework on time. Be sure as well to do your homework before they get home each day so they don’t have to remind you. Complete any chores assigned well and without having to be told. Consider asking for additional responsibility around home, as well. However, if you have chores to do, but your older sibling does not, this is unfair. Talk to your parents about this rule and ask if your sibling can help you."
    },
    {
      "title": "Have good manners.",
      "content": "Have good manners. Always be respectful of your parent and others. Say ‘please’ and ‘thank you.’ Greet them with a smile when you see them. Help them if you see them struggling with something. [9] X Research source"
    },
    {
      "title": "Maintain a relationship with your sibling.",
      "content": "Maintain a relationship with your sibling. Though your parents favor them, try not to hold this against your sibling. They can’t help how your parents feel. Instead, talk and hang out regularly so that you don’t become distant. Put any issues between the two of you on the table so you can move past them. [10] X Research source If the two of you recently had an argument, say something like “Hey, want to go for ice cream with me? I want to talk about what happened last night.”"
    }
  ]
}