{
  "url": "https://www.wikihow.com/Deal-With-Unrequited-Love",
  "title": "How to Move on From an Unrequited Love",
  "steps": [
    {
      "title": "Give yourself permission to grieve.",
      "content": "Give yourself permission to grieve. Unrequited love hurts. Just because you shouldn’t beg or take it personally doesn’t mean you aren’t allowed to mourn the circumstances. Your hopes for a relationship with this person have been cut short. It’s perfectly okay to grieve. [1] X Research source Allow yourself to feel your emotions, however they come. You may feel betrayed, or your self-esteem may be hurt. Anger, humiliation, sadness—all of these feelings might pop up after dealing with unrequited love. Be gentle with yourself. Don’t put too much pressure on yourself to “shake off” what you’re feeling. Grant yourself permission to be upset for a few days."
    },
    {
      "title": "Accept their choice.",
      "content": "Accept their choice. Possibly the worst thing you can do in a case of unrequited love is to beg the person to change their mind. Begging is degrading and will only compromise your self-respect. Keep your self-respect intact and accept the person’s decision. [2] X Research source Keep in mind that begging someone won’t make them love you if they don’t. Doing so will only make you love yourself less. If the person relents simply to appease you, it will likely not be a healthy relationship."
    },
    {
      "title": "Pretend it happened to a friend to stop personalizing the situation.",
      "content": "Pretend it happened to a friend to stop personalizing the situation. Perhaps the most important take-home message of unrequited love is that it doesn’t have to be personal. More than likely, the person’s failure to reciprocate your feelings has absolutely nothing to do with you and everything to do with them. To help you not personalize the situation, imagine that it happened to a friend. How could you explain the outcome to them? Maybe the person isn’t in the market for a relationship or maybe they have a different type. Neither of these reasons has anything to do with your worth as a person."
    },
    {
      "title": "Recognize their pain, too.",
      "content": "Recognize their pain, too. When you get rejected, you’re often absorbed in your own feelings, which means you may not think about how the circumstances impact the other person. Turning you down may have actually hurt the other person, too. [3] X Research source Think about it: rejecting someone as great as you probably wasn’t easy for the person. Plus, if you are friends, they may have even risked your friendship to turn you down. It takes a lot of courage not to enter a relationship you know is not right for you. The person may have a variety of reasons why they don’t want to be in a relationship with you, and you show maturity by understanding their decision."
    },
    {
      "title": "Get some distance from the person.",
      "content": "Get some distance from the person. The best course of action for healing after unrequited love is to put some distance between you and the person you care about. Seeing them every single day will only make getting over them that much harder. [4] X Research source Press the pause button and avoid seeing them for a while. This means telling them “I need some space…” and refraining from calling, texting, or skimming their social media profiles. If you're afraid that seeing their social media profiles will bring back the pain, unfollow them. Facebook, for example, has an option where you can unfollow a person while still being friends. This way, you can always go back and follow them again in the future. If it is not possible to avoid seeing them, try to contact them less at least, and spend more time with other people."
    },
    {
      "title": "Take them off the pedestal.",
      "content": "Take them off the pedestal. It’s common to idolize someone you love. Unfortunately, this illusion prevents you from seeing the person as they really are. You may be broken-hearted because such a perfect person rejected you, but have you ever considered they aren’t actually perfect? Realizing that they are only human—just like you—may help ease your pain. Make a list of any qualities you see in the person that aren’t so great. For example, maybe your crush has an annoying laugh or perhaps they aren’t all that friendly to the non-popular kids at school."
    },
    {
      "title": "Get support",
      "content": "Get support . Reach out to your close friends and family. Talk to them about what happened. Then, fully hear them out and absorb the comforting and encouraging words they offer. They’ll remind you just how great you are. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Help your loved ones help you by making specific requests. For instance, you might ask a friend to go to the movies with you over the weekend. You might ask your mom or sibling to help you pack up things that remind you of your crush. You might even ask your pals to help you pinpoint your crush’s bad traits."
    },
    {
      "title": "Practice self-care",
      "content": "Practice self-care . Simply because the person you love didn’t return that love doesn’t mean you can’t pour love into yourself. Go above and beyond to make yourself feel cherished and cared for. [6] X Research source Eat healthy , nutrient-rich meals and get plenty of exercise and rest. Fend off stress with relaxing activities, such as coloring, listening to music, or playing with your pet. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source It can be cathartic to write the person a goodbye letter. Perhaps pretend that you broke up with them or decided they just weren’t right for you. Focusing on their attributes that don’t fit well with you can help you move on."
    },
    {
      "title": "Try a new hobby or activity.",
      "content": "Try a new hobby or activity. Join a new sports team or get involved in a local club the person you were rejected by has no ties to. It will get you out of your routine, create new patterns for being social, and is a great way to distract yourself as you heal."
    },
    {
      "title": "Cherry-pick your sources of entertainment.",
      "content": "Cherry-pick your sources of entertainment. This may not the best time to listen to the songs or watch the movies that made you think of your crush. Carefully select which sort of music, movies, and books you consume. Instead of choosing lovey-dovey sources of entertainment (or anything that makes you think of your crush), go for more neutral choices."
    },
    {
      "title": "Keep yourself busy",
      "content": "Keep yourself busy . A full calendar can feel like a life-saver when you’re getting over unrequited love. Plus, staying busy can help you distract yourself from thoughts of your crush. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Find other thing to be interested in, so that you can take your attention away from your feelings and make them less intense. Fill your schedule with lots of positive activities, such as studying, spending time with friends, completing projects at home, or taking on a new hobby."
    },
    {
      "title": "Channel your feelings into creative pursuits.",
      "content": "Channel your feelings into creative pursuits. When you do get wrapped up in your feelings, use them to create something new. Write that book you’ve always talked about, pen the words to a song to play on your guitar, or paint a picture to give to your parents. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Using your creative skills is a positive and helpful way to release and express your emotions."
    },
    {
      "title": "Set big goals.",
      "content": "Set big goals. Focusing on your future as an individual is a great way to move on after unrequited love. Set some powerful personal goals to help you get re-invested in your future. [10] X Research source Think about where you’d like to be in the next 6 months or a year. Then, write out SMART goals that help you get there. [11] X Research source For instance, you might decide to get a part-time job to help you save for a summer vacation in Europe. Looking for jobs might be one goal, while saving the money might be another."
    },
    {
      "title": "Look for patterns in your romantic feelings.",
      "content": "Look for patterns in your romantic feelings. Do you have a habit of falling for people who don’t love you back? If you can recall several other cases of unrequited love, you may be purposely seeking out people who are unavailable to protect yourself from forming any attachments. [12] X Research source If this seems true for you, consider seeing a therapist. This person can help you clarify the underlying issue in your relationship behaviors and help you overcome the fears and beliefs that contribute to them. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Date for fun.",
      "content": "Date for fun. When you’re ready, get back out there. This time, however, lower your expectations completely. Don’t date someone with the expectation that it will lead to everlasting love. Instead, spend time with interesting people just because you deserve it. Have a good time without worrying about where things will go. Challenge yourself to date someone drastically different from your previous crush. For instance, if this person was an artist, try dating a sports fanatic."
    }
  ]
}