{
  "url": "https://www.wikihow.com/Find-Your-Engine%27s-Top-Dead-Center-(TDC)",
  "title": "How to Find Your Engine's Top Dead Center (TDC)",
  "steps": [
    {
      "title": "Disconnect the battery.",
      "content": "Disconnect the battery. Before beginning the project, use a hand or socket wrench to loosen the nut holding the black “ground” cable on the negative terminal of the battery. Pull the cable up off of the terminal and tuck it to the side of the battery to prevent it from coming back into contact with the terminal until you’re done. [1] X Research source Disconnecting the battery will prevent you from shocking yourself or causing any blown fuses while you work. The car will not be able to start with the battery disconnected."
    },
    {
      "title": "Disconnect the plug wire from cylinder one.",
      "content": "Disconnect the plug wire from cylinder one. Refer to your vehicle’s service manual for help identifying which spark plug coincides with cylinder one. Once you’ve found it, grip the spark plug wire at the base where it connects to the spark plug and pull it backward to remove it. Make sure you check the service manual for your specific year, make and model vehicle. Do not pull on the spark plug wire itself, but rather from its base, when removing spark plug wires ."
    },
    {
      "title": "Remove the spark plug from cylinder number one.",
      "content": "Remove the spark plug from cylinder number one. Use a spark plug socket and a long extension on your wrench to remove the spark plug in the cylinder one position of your vehicle. Rotate the plug counter clockwise to unthread it before pulling it out. [2] X Research source The spark plug will stick in the spark plug socket thanks to a rubber ring inside it. Check the spark plug for any signs of damage , then set it aside someplace safe."
    },
    {
      "title": "Install the piston stop tool into cylinder number one.",
      "content": "Install the piston stop tool into cylinder number one. Take your piston stop tool and insert it into the spark plug socket you used to remove the spark plug. Lower it into the same hole you removed the spark plug from, and thread it into place carefully by turning it in a clockwise direction. Be extremely careful not to allow any debris to fall into the spark plug hole as you switch it out for the piston stop tool. You can purchase a piston stop tool and most auto parts stores. The piston stop tool doesn’t have to be too tight. Simply make it snug by hand."
    },
    {
      "title": "Use a wrench to slowly rotate the motor.",
      "content": "Use a wrench to slowly rotate the motor. Locate the crank pulley near the bottom of the engine. This circular pulley provides power to accessories like your power steering and air conditioning through the serpentine or accessory belts. At the center of the pulley will be a nut. Place an appropriately sized wrench on the nut and turn it counter-clockwise to rotate the motor. [3] X Research source Be sure to use the correct size wrench or socket, otherwise you could damage the bolt on the pulley. It may take a decent amount of force to rotate the motor. Larger motors will be even more difficult than smaller ones."
    },
    {
      "title": "Never use the starter to rotate the engine.",
      "content": "Never use the starter to rotate the engine. As you go about determining top dead center, you will need to rotate the engine assembly. Do not turn the key in the ignition to use the starter to do so, as it can cause serious damage to the engine if the piston strikes the piston stop tool you inserted. With the battery disconnected, you won’t be able to start the engine. Never attempt to start the engine while you have portions of it disassembled."
    },
    {
      "title": "Mark the pulley when the piston hits the stopper.",
      "content": "Mark the pulley when the piston hits the stopper. Continue to turn the pulley with the wrench until the piston in cylinder one comes into contact with the piston stop tool. When it stops, mark the pulley location on the harmonic dampener surrounding the pulley with a marker. [4] X Research source Be sure you can clearly make out the mark you draw on the harmonic dampener. A sharpie or paint pen will both work to make your mark on the harmonic dampener."
    },
    {
      "title": "Rotate the engine back the other way.",
      "content": "Rotate the engine back the other way. Once you’ve made your first mark, use the hand or socket wrench on the crank pulley to rotate the engine back in a clockwise direction until it comes into contact with the piston stopper tool once again. [5] X Research source Mark the second spot on the harmonic dampener where the pulley stopped turning because of the stopper tool. Be sure both marks are clearly visible on the harmonic dampener before moving on."
    },
    {
      "title": "Find the center point between the two marks.",
      "content": "Find the center point between the two marks. With both marks clearly visible, find the center point by measuring the distance between them and dividing by two. That should allow you to measure from on of the two lines and identify the exact center point between the two. That center point is top dead center. [6] X Research source Be sure to remove the piston stop tool and return the spark plug prior to starting the engine. Reconnect the battery to restore power to the vehicle once you’re done."
    },
    {
      "title": "Remove the spark plug from cylinder one.",
      "content": "Remove the spark plug from cylinder one. Instead of removing the spark plug to replace it with a stopper tool, you can use your thumb to get a good approximation of top dead center that will be accurate enough for you to install your distributor or spark plug wires, but will not be specific enough to align your camshafts. [7] X Research source Make sure to remove the spark plug using a spark plug socket, otherwise it will simply unthread and remain in the hole. Be extremely careful not to allow anything to fall in the hole while the spark plug is removed."
    },
    {
      "title": "Place your thumb over the spark plug hole.",
      "content": "Place your thumb over the spark plug hole. As the engine rotates, the piston will rise inside cylinder one and you’ll be able to feel the increase in pressure. Take your thumb and insert it into the hole the spark plug came out of so you’ll be able to feel the change in pressure within the cylinder. [8] X Research source Make sure your thumb is positioned to it creates a seal over the hole."
    },
    {
      "title": "Have a friend rotate the crankshaft with a wrench.",
      "content": "Have a friend rotate the crankshaft with a wrench. As you keep your thumb over the spark plug hole, have a friend rotate the engine counter clockwise using a wrench of the appropriate size. Have them continue to rotate the engine until the increase in pressure pushes your thumb off the spark plug hole as it nears top dead center. [9] X Research source Pay attention as your friend rotates the motor so you’ll notice when your thumb is pushed off the hole. As soon as your thumb moves it will relieve the pressure, allowing you to place it over the hole again."
    },
    {
      "title": "Look into the hole with a flashlight to find TDC.",
      "content": "Look into the hole with a flashlight to find TDC. Once your thumb has been pushed off the spark plug hole, use a flashlight to peer down into the hole at how close the cylinder is to the hole itself. Have your friend rotate the motor very slowly as you watch to get it as close as possible to top dead center. [10] X Research source This process is accurate to within 15 degrees, so it should not be used to install new camshafts. Make sure to reconnect the battery after reinstalling the spark plug."
    }
  ]
}