{
  "url": "https://www.wikihow.com/Create-Your-Own-Alien-Species",
  "title": "How to Create Your Own Alien Species",
  "steps": [
    {
      "title": "Brainstorm the basics.",
      "content": "Brainstorm the basics. Your alien species will develop and change as you give it more of a backstory, but you have to set some basic parameters to get started. Use a written outline or a quick sketch to get ideas down. [1] X Research source Are the aliens going to be human-like or physically different? Will they have their own language? Do you want your aliens to be scientifically plausible? Do they come from a known planet, or are you inventing the planet as well?"
    },
    {
      "title": "Define the role the aliens will play in your story.",
      "content": "Define the role the aliens will play in your story. The aliens you create will have a specific function in your story, and that function may define parts of how they look and act. Think about what role the aliens will play in your story. [2] X Research source Are your aliens going to be your main characters or supporting characters? Will they be good or evil? Will they be something in between? Will they be intelligent beings from an advanced society, or will they be primitive?"
    },
    {
      "title": "Consider their physiology.",
      "content": "Consider their physiology. Whether you build your story around your aliens’ features or you build your aliens around your story, their physical composition and storyline should work together. [3] X Research source Think about what your aliens need. What biological features do they need to survive in your story? If they come from a planet close to its star, for example, do they need thick or plated skin for protection? Will their physiology create meaningful challenges? For example, will a species with a tail be easier for alien head hunters to catch? Will the species have to find ways to adapt? Will their physiology create any unnecessary challenges? Look for features in your aliens’ physiology that might make for improbable scenarios, such as a species with gills invading a species on land. Find ways to rework those improbabilities. Remember, form follows function. A flying alien will probably be very slim and lightly built while a swimming one might be streamlined like a dolphin or shark. You can also \"reverse engineer\" an alien's habitat and lifestyle based on its looks. So a lanky alien with long arms might live in the trees like a monkey, or one with lots of fin-like crests might live somewhere wet like a lake or marsh."
    },
    {
      "title": "Do some sketches.",
      "content": "Do some sketches. Making a drawing can give your imagination a jump start if you're having trouble describing your alien. Even if you are not using images in your story, drawing may help you focus on your aliens’ details. [4] X Research source Try a basic sketch depicting the physical features of your aliens. Once you have their standard look established, depict your aliens in a few scenes from your story. Seeing how the aliens fit into the events and physical surroundings of the story may help you refine what they look like or how they act."
    },
    {
      "title": "Build the society.",
      "content": "Build the society. The actions of your alien are going to be informed by its social surroundings. You may opt not to create an entire history for the new species, but consider shared values and customs and how they relate to your alien characters. Consider political structure. Is it governed by or separate from religion? Are they autocratic, democratic, or governed by different means? Are your inherently peaceful or inherently militant? They may be neither, but if they are meant to be truly peaceful or truly warmongering, it will impact how they act. Think about social stratification. Are there any sub-races within your race? Do certain individuals have greater status based on their families, jobs, wealth, or other factors? Do your aliens form strong social connections, such as friendship and love?"
    },
    {
      "title": "Decide on communication.",
      "content": "Decide on communication. There are limitless ways in which your aliens can communicate. They might speak, use telepathy, communicate via scent or body language, or something else entirely. Establish how your aliens communicate with one another. Do they have their own language? Will they use the same language as the non-alien characters in your story? If they communicate by telepathy, consider how you will depict the experience. Will others hear a voice in their head, or will they emerge from interactions with an understanding that uses no words? Decide how your aliens will communicate with other species, if necessary. Will they use translators? Are they multilingual? Will they learn during the story?"
    },
    {
      "title": "Develop transportation.",
      "content": "Develop transportation. If your aliens are going to an area that is not their home planet, you need to decide how they get there. If others are coming to their world, you need to decide how. What means do your aliens use to get to one another? If they use locomotion, what type? Do they teleport? Develop a means of long-distance transportation. How do your aliens get around their planet? How do they get to other planets? Are there specialized vehicles for different purposes? If your aliens will be visited by beings from other planets, decide how they will react to alien ships. Will they understand what they are, or will they be confused or frightened? If your aliens are on earth, develop how they got there. If it was by ship, is that ship still present and functional?"
    },
    {
      "title": "Create individual characters.",
      "content": "Create individual characters. Once you have your alien species developed, you are ready to create the characters that will drive your story. [5] X Research source Your alien characters will be informed by the information you worked out, but they need to be individuals. Each alien character should have a distinct purpose that drives the story forward, as well as their own character arch. Diversify your alien characters. Like people, they should operate in the parameters you set for your world, but they should each have their own personality. What is your character’s social status? What is their emotional range? Do they have any personal relationships?"
    },
    {
      "title": "Find problems",
      "content": "Find problems . Individual characters should have personal focus, as well as a focus on the overall story arc. Create problems for your characters that impact them on an individual level. Give your character personal quirks and challenges. All of your alien characters may be focused on saving their planet, but is one in particular also having trouble learning to read? Create dynamic characters that are different from one another. If there is a problem pertaining to the whole species, give your character a personal interest in that issue. For example, if the species is about to fight for their own defense, create conflict by having a character that opposes violent conflict but fears losing family or a loved one. Make your characters more relatable by giving them small problems outside of the overall story arc. Characters focused on one matter will come off as one-dimensional."
    },
    {
      "title": "Create consequence.",
      "content": "Create consequence. Give your story depth by creating consequences for your alien characters. They may be positive or negative, but the actions of the alien characters should move the story forward. Consequences will naturally build your alien character’s story arch. If they invade another planet, for example, will they be welcomed home as a hero or exiled for their destruction? How will the consequences of their actions inform their future decisions? Create consequences that your audience might not see. Decide if there are major events in the history of your alien species that inform their actions and behavior. Try to use these events to create conflict and depth in your character."
    },
    {
      "title": "Do not divulge everything.",
      "content": "Do not divulge everything. You want to create a complete world so that you can make compelling alien characters, but your story should be clear and engaging for your audience. Provide detail that informs specific parts of your story. If, for example, an alien character is stranded on earth, establish how they got there and why. Avoid putting in too much detail that does not relate directly to the story. Use the details you created to inform your writing, but avoid including lengthy explanations of things that do not make sense of the story or move it along. You may decide, for example, that your aliens all glow blue in a mostly helium atmosphere. However, if they are never in a helium atmosphere during the story, there is likely no need to include that detail for your audience."
    }
  ]
}