{
  "url": "https://www.wikihow.com/Deal-With-a-Drug-Addicted-Family-Member-or-Loved-One",
  "title": "How to Deal With a Drug Addicted Family Member or Loved One",
  "steps": [
    {
      "title": "Search online for information about your loved one’s form of addiction.",
      "content": "Search online for information about your loved one’s form of addiction. The best plan for addiction management and rehabilitation may vary according to the substance on which your loved one is dependent. Focus on information from sites with a medical or scientific orientation. Look for trustworthy sites such as government or university information. There is a lot of information on the web, but not everything you read about drug addiction is true or realistic. Learning about the characteristics of your loved one’s drug addiction can help you understand what to expect. It can also provide guidance on how to best address the situation. NIDA’s DrugPubs Research Dissemination Center provides resources on drugs, drug abuse, and treatment. [1] X Research source drugpubs.drugabuse.gov"
    },
    {
      "title": "Recognize the complexity of addiction.",
      "content": "Recognize the complexity of addiction. Addiction is a complex and widespread problem. It can have both physical and mental dimensions. Understanding the complexity can help you cope with the situation. It is tempting to think that drug users just have poor morals or lack of willpower. But, there are underlying biological processes that make drug addiction very difficult to overcome. [2] X Trustworthy Source National Institute on Drug Abuse Leading U.S government agency supporting scientific research on drug use and its consequences. Go to source Drug abuse and addiction is a widespread problem. In 2009, about 23.5 million people over the age of 12 needed treatment for addiction. Only 11.6% of this number actually received the treatment they needed."
    },
    {
      "title": "Learn about treatments.",
      "content": "Learn about treatments. Mental health professionals use a variety of methods to help people overcome addictions. Some of these include: Cognitive-behavioral therapy. This type of therapy identifies triggers, and thoughts or behaviors which contribute to use. Therapists can teach strategies to change behaviors. They can help increase self-control, stop drug use, and deal with other issues that may occur. Contingency management. This is a behavioral approach that helps the client monitor their behavior. This helps them to slowly change the behavior with the use of positive rewards. Motivational enhancement therapy. This approach helps clients identify why they want help. It helps them see why they might be ambivalent toward treatment and stopping drug use. Family therapy. This approach involves the person's immediate family. It focuses on communication practices that can help or hinder someone's recovery."
    },
    {
      "title": "Find an organization that can provide support.",
      "content": "Find an organization that can provide support. Groups like Al-Anon, Ala-Teen and Nar-Anon which offer 12 Step programs for the families and friends of people who struggle with alcoholism and addiction. These groups offer support for dealing with the person struggling with addiction. Talking with people in similar situations can help you understand addiction and recovery. These programs also help you to recover from the emotional effects of a relationship with an addicted person. They can also help you heal from guilt and past hardships with your loved one who is addicted. It is important to find support for yourself as you try to help your loved one. The Al-Anon webpage has search tool to help you find a meeting near you."
    },
    {
      "title": "Speak up.",
      "content": "Speak up. Talk with your family member about your concerns regarding his or her substance use. Try to do this in a way that is non-confrontational, supportive, and non-judgmental. Focus on your feelings rather than making accusations or judgements. For example, you might say: \"I'm really worried that your drinking may be affecting your health,\" rather than \"you drink too much. Don't you know it can destroy your liver?\" You can ask friends and family members to voice their concerns as well. Help your loved one see how his or her addiction has affected him or herself. Tell your loved one how her or his behavior, goals, or attitudes have changed since she or he started using. Remind your loved one about goals he or she held before, or the person he or she wanted to be. [3] X Research source"
    },
    {
      "title": "Encourage your loved one to seek professional help.",
      "content": "Encourage your loved one to seek professional help. Do not ignore the drug use of your loved one. Instead, acknowledge the addiction and the strain it is putting on the family or relationship. Respectfully discuss this with your loved one and encourage him or her to seek help For example, you might say: \"I'm really worried that if you keep using drugs, something terrible will happen to you. I know it might be hard to give it up, but there are services our there that can help.\" You might even offer to help find a group, doctor, or therapist to get the process started. The earlier your loved one seeks treatment, the better the chances of overcoming addiction."
    },
    {
      "title": "Inform your loved one about treatment options.",
      "content": "Inform your loved one about treatment options. Talking to your loved one about treatment options can help the experience seem less threatening. Let him or her know what you have found in your research. Help your loved one understand that many others struggle with addiction too. Let your loved one know that you will be supportive as she or he goes through the process of treatment and recovery. Expect his or her reaction to be negative at first. Hearing that your loved ones want you to change and disapprove of your behavior is a hard thing to hear. Understand that your loved one may not be receptive to your concerns. She or he may deny that there is a problem or offer excuses for the behavior. [4] X Research source Prepare to hear these things and offer support, but maintain your position."
    },
    {
      "title": "Help when your loved one is ready.",
      "content": "Help when your loved one is ready. It may take some time before your loved one is ready to accept that she or he has a problem with addiction. It is important to remain supportive and remember who this person is apart from the addiction. [5] X Research source Be ready to suggest places to get help, call and make an appointment, or attend appointments with them. Your loved one may make several appointments then cancel them before attending. This is normal behavior for those struggling with addiction. Help remind him or her of why treatment is important."
    },
    {
      "title": "Look into local detox clinics and rehabilitation centers.",
      "content": "Look into local detox clinics and rehabilitation centers. When your loved one is ready for help, you can make this easier by helping find treatment. Ask a health professional or search online for local facilities that treat people with addictions. A detoxification program involves treating the physical effects of dependence on a substance. The body has been functioning for a long time with the drug in the system. So, it can cause serious harm if a person quits “cold-turkey.” The detox process usually takes place under the care of a physician. The medical team systematically and safely rids the body of the addictive substance. [6] X Research source Many people have other conditions that contribute to their addictions. Find a detox center or hospital that can address all aspects of health for your loved one. This can make the difference between temporary and permanent recovery. Your family member can also receive treatment on an outpatient basis. This involves seeing a mental health professional who specializes in the treatment of addiction."
    },
    {
      "title": "Search for support groups.",
      "content": "Search for support groups. Your loved one may need to attend group or independent therapy. Many organizations have regular meetings to promote drug-free living and provide a support network. These groups often offer anonymous support. There are also organizations that can help you find treatment and other resources for a loved one: The Substance Abuse and Mental Health Services Administration (SAMHSA) offers information on drug treatment facilities. This includes residential, outpatient, and hospital inpatient treatments. You can call 1-800-662-HELP. [7] X Research source www.findtreatment.samhsa.gov If you're in the United States or Canada, you can call or text 988 to reach a suicide crisis helpline. They can help with many issues, including suicide prevention and drug and alcohol abuse. They can help you find resources. The National Alliance on Mental Illness and Mental Health America offer self-help support for patients and families dealing with a variety of mental disorders. [8] X Research source www.nami.org [9] X Research source www.mentalhealthamerica.net The American Academy of Addiction Psychiatry and the American Academy of Child and Adolescent Psychiatry can help you locate a near by physician you specializes in addiction. [10] X Research source www.aaap.org [11] X Research source www.aacap.org Faces & Voices of Recovery helps people struggling with long-term addiction and recovery. They try to help on a community level by providing resources to care. [12] X Research source www.facesandvoicesofrecovery.org The Partnership at Drugfree.org helps teens, and can also offer parents information and support. Call the helpline for parents at (1-855-378-4373). [13] X Research source www.drugfree.org The American Society of Addiction Medicine can help you find treatment options and access addiction resources. [14] X Research source www.asam.org"
    },
    {
      "title": "Speak with a professional therapist or counselor.",
      "content": "Speak with a professional therapist or counselor. Aside from learning about resources for your addicted loved one, it can be helpful for you and other family members to speak with a therapist or family counselor. Living with a drug addicted loved one can put significant stress on others in the household. Family therapy can help confused or stressed parents, children, or romantic partners. The purpose of family therapy is to identify behavior patterns that are unhelpful or reinforce the drug user's behavior. The therapist helps the family to overcome these obstacles and build a new way of interacting. The therapist can help the family learn to cope with relapses. He or she will also provide information about how to handle emergencies. This includes overdoses or addiction-related violence. Many schools have counselors to help parents deal with children who have an addiction. There are also therapists who specialize in helping children and teenagers with addictions. Don't ignore your own feelings and struggles. Dealing with a drug-addicted family member can be really hard and take an emotional toll. [15] X Expert Source Lauren Urban, LCSW Licensed Psychotherapist Expert Interview. 3 September 2018."
    },
    {
      "title": "Offer emotional support without enabling the addiction.",
      "content": "Offer emotional support without enabling the addiction. “Rescuing” your loved one, financially or otherwise, is not helpful. It only enables him or her to continue their behavior. Be clear that you can offer support, but only if he or she is serious about treatment. Here are some examples of healthy boundaries you can set: Do not give money to your loved one to allow him or her to continue to buy drugs or alcohol. But, do remind your loved one that you are ready and willing to help him or her find treatment. Tell your loved one that you can offer emotional support, but that you will not allow her or him to use drugs in your home. Let your loved one know that you are there for him or her, but also that you will not drop everything to deal with a drug related problem or emergency. Your loved one must learn to help him or herself. Tell your loved one that you hope she or he can attend events with you. But, also emphasize that if she or he does not show up because of drug use, plans will continue without him or her."
    },
    {
      "title": "Develop effective communication skills.",
      "content": "Develop effective communication skills. Relationships can develop communication patterns that make it harder for everyone to express themselves. Learning to share your thoughts and feelings effectively can help a lot. Effective communication lets you to focus on conversations that make progress toward seeking help. It helps you avoid spiraling into negativity, blaming, threats, or shouting matches. Speak about yourself and your feelings rather than making accusations. For example, start sentences by saying: \"I've noticed,\" \"I'm worried,\" or \"I feel.\" Don't focus on the other person. [16] X Research source Approach the person when he or she is sober. You will be more likely to get a calm and rationale response. Try to keep your voice calm and even during conversations. Concern and compassion are helpful. Anger is not. Emphasize your love and concern for the addicted person. This may help him or her feel less threatened and more cared for. Be assertive with your loved one about your boundaries and needs. If you have the opportunity to do so, speak with a counselor or therapist for more suggestions about effective communication."
    },
    {
      "title": "Avoid negative communication patterns.",
      "content": "Avoid negative communication patterns. Along with improving your communication skills generally, there are several behaviors you should avoid. Stay away from these unhelpful actions: [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Preaching at your loved one or manipulating him or her to change. Using guilt to try to get her or him to change or stop using. Coming to the aid of your loved one with excuses to save her or him from consequences. Taking on your loved one's responsibilities for him or her. Hiding his or her drugs or drug paraphernalia, or throwing them away. It is a better idea to tell your loved one that he or she must throw them away, or at least get these items out of your home. Fighting or arguing with your loved one if she or he is under the influence. Using drugs with your loved one."
    },
    {
      "title": "Cut ties if necessary.",
      "content": "Cut ties if necessary. Prepare to maintain your personal safety by cutting ties if your loved one’s behavior warrants it. [18] X Research source Behavior that may lead you to consider separating yourself from the situation include: Violent or abusive behavior toward you or others. Endangering the home or family with risky behavior. This could include using drugs near children or conducting drug deals on the property. Putting the family’s economic stability in jeopardy. This could include draining the bank account or selling items from the home to pay for the habit. Cutting ties can require harsh measures. You may need to consider reporting illegal behavior to civil authorities. You might consider admitting a minor to an in-patient substance abuse program. You may need to ask your loved one to leave the home and not return until sober. In extreme cases, you may need to move without announcing your new address."
    }
  ]
}