{
  "url": "https://www.wikihow.com/Frame-a-Picture",
  "title": "How to Frame a Picture",
  "steps": [
    {
      "title": "Consider the design of your room.",
      "content": "Consider the design of your room. If the room looks modern, you'll want to avoid ornate, wooden frames. If the room is classic, you'll want to avoid sleek or brushed metal, modern-looking frames. Of course, this rule can be broken in order to make a design statement."
    },
    {
      "title": "Consider the style of the picture.",
      "content": "Consider the style of the picture. Older style pictures will generally look more at home in older styled frames. You will also want to consider the color of your picture. If black and white, it will look better with a colored or black/white frame. If the picture has color, it can look better with either color frames or wooden frames."
    },
    {
      "title": "Choose the frame style.",
      "content": "Choose the frame style. You'll have to decide if you want a thin frame, thick frame, shadow box frame, or other styled frame. Some pictures, such as printed canvases, might look better with no frame at all!"
    },
    {
      "title": "Choose the size relative to the room.",
      "content": "Choose the size relative to the room. Do you want the picture to feature prominently in the room and take up a large amount of space or do you want to have it be smaller and simply be a beautiful detail to the room? You'll have to decide what works better for your design."
    },
    {
      "title": "Choose the size relative to the picture.",
      "content": "Choose the size relative to the picture. Think about how big the picture is going to be. Now, do you want there to be a lot of space between the picture itself and the frame? Or do you want there to be no space at all? 1-2\" of mat (or space between the frame an picture) is normal, as is no mat whatsoever. However, you can make a dramatic statement by having a larger gap (4-6\" or more). Of course, this is relative to the size of the picture. If the picture is enormous, a 4\" mat might be very reasonable. Using an acid-free mat board is recommended."
    },
    {
      "title": "Choose your color.",
      "content": "Choose your color. Generally, black, white, and brown are considered good neutral colors that will generally match with most pictures. You can also go with colors, however. This is an especially good idea if you really want to make a picture pop, and draw attention to it in the room. Generally, you would choose a color by finding a highlight or significant color in the picture and then making the frame that color. For example, if your degree has a red seal, you might make that pop by having it framed in a matching red as well."
    },
    {
      "title": "Consider using a mat.",
      "content": "Consider using a mat. If you decide to have a gap between the frame and the picture, you'll need a mat. This is a piece of paper, cardboard, or cardstock which creates a secondary \"frame\" for the picture. You'll need to decide what color you want your mat to be. Usually, a white or cream color is used, but you can also use more brightly colored mats which compliment your picture."
    },
    {
      "title": "Measure your mat.",
      "content": "Measure your mat. Take the measurement of your picture and add the width you want for your mat to get the mat size. Let's frame an imaginary 8x10 photo. For this photo, we want a mat with a 1.5\" width. So the measurements for the mat become 11x13\" (since the width needs to be added to each side)."
    },
    {
      "title": "Cut the outside edge.",
      "content": "Cut the outside edge. Measure a square corner, using a tool if you have one, and then cut the mat to the desired measurement. Use a box cutter or other extremely sharp tool in order to get a clean line. Our mat will be 11x13\" around the outside."
    },
    {
      "title": "Cut the inside edge.",
      "content": "Cut the inside edge. Cut the inside edge where you want the picture to go. The usual advice is to have the gap on the bottom marginally larger than the one on top (this should be almost imperceptible). Dry fit it to figure out where you want it and then measure and cut a hole in the center of the mat that fits the measurement of your image. A good tip is to measure the exact shape, in this case the 8x10 rectangle, and then make the actual cuts just inside of the line you drew. This way you won't accidentally end up with gaps where you made the hole too big."
    },
    {
      "title": "Attach the picture.",
      "content": "Attach the picture. Fit the picture into the hole for the mat. Take two pieces of tape and use them to bridge the gap along the top line. These should be evenly spaced, towards the center. Next, take two more pieces of tape and place these over the top, mat-side of the first tape pieces. The long edge of these pieces should follow the line of where the picture and mat meet. This is a safe way to tape photos to mats, since the tap can simply be cut where the picture and mat meet, leaving only minimal tape on the picture itself."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. We're going to make a frame for our theoretical 8x10 photo with our 1.5\" width mat. You'll need: 1x2 lumber in a wood type of your choice 1/4\" square dowels in a matching or pleasantly contrasting wood of your choice 5 mm diameter dowel rods A miter box, saw, square measure, and measuring tape Glue and rubber bands Materials to make a basic jig, such as plywood. Optional materials like paint or stain"
    },
    {
      "title": "Cut the pieces to the desired lengths.",
      "content": "Cut the pieces to the desired lengths. For now just think about the 1x2s. The inside measurement of that portion of the frame will be the same size as your mat, with the outside measurement adding the additional length for the miter. Cut the 1x2s to the size you'll need for the outside measurement of the frame. Once you have your 1x2s cut, cut your square dowels to the same measurement. In our example, since the 1x2s are actually 1.5\" x .75\", we need to add 1.5\" to each end to get the outer edge measurement. So the short side pieces will then be 14\" and the long side pieces will be 16\"."
    },
    {
      "title": "Glue the two sections together.",
      "content": "Glue the two sections together. Glue the square dowel to the 1x2, so that the faces are flush."
    },
    {
      "title": "Miter the ends.",
      "content": "Miter the ends. Using a box miter (or miter saw, if you have one), cut the ends of the four pieces so that they are at a 45 degree angle. The short end of each miter should be on the side with the square dowel. Sand any rough edges. The measurement on one side of the short pieces should now be 14\", with the other at 11\". The measurement on one side of the long pieces should now be 16\", with the other side at 13\"."
    },
    {
      "title": "Make a simple jig.",
      "content": "Make a simple jig. Set out a plywood sheet. Measure out the outline of the 14x16\" frame, as well as the inside 11x13\" shape. Nail small pieces of scrap wood at the center on both the inside and outside lines, so that the pieces of the frame can sit snugly between them with the mitered corners still accessible. Glue the mitered edges and then insert the pieces into the jig (careful not to glue them to the surface)."
    },
    {
      "title": "Drill and insert dowels.",
      "content": "Drill and insert dowels. Using a drill, make pilot holes and then drill a 5 mm hole for your dowels at each of the four corners. This should pass diagonally through the corner, passing at the halfway point along the mitered edge. Then, cover your dowel in glue and fit it through the hole. There should be some extra sticking out on either side. Stretch rubber band around the dowel ends on opposite sides of the frame to hold it together and then remove it from the jig. Allow the glue to dry."
    },
    {
      "title": "Sand and add finishing touches.",
      "content": "Sand and add finishing touches. Score and snap off the extra dowel ends and then sand it down until it's smooth. You can now paint or stain your picture frame."
    },
    {
      "title": "Cut glass or plastic.",
      "content": "Cut glass or plastic. You can get glass custom cut to the measurement of the larger square (so that it nestles in the recess created by the square dowels). You can also buy clear acrylic and cut it to size (score on one side and then snap). Place the plastic into the recess, followed by your mat and picture. A backing can be added or you can use nails or clips to hold the picture and glass in place."
    }
  ]
}