{
  "url": "https://www.wikihow.com/Edit-Your-Security-Settings-on-Facebook",
  "title": "How to Change Facebook Security Settings",
  "steps": [
    {
      "title": "Log into Facebook.",
      "content": "Log into Facebook. From your laptop or desktop computer, open your favorite web browser, type in www.facebook.com, and hit Enter on your keyboard. On the login page, enter your username and password into the text fields, and then click on “Log in.” If you want to use a phone or tablet, you can do this from the mobile app."
    },
    {
      "title": "Go to Settings.",
      "content": "Go to Settings. To get there, click your profile icon in the top right corner of the page and a menu will drop down. Click “Settings & privacy.” On the mobile app, tap the three-line menu in the top right corner, then tap the gear icon."
    },
    {
      "title": "Go to the \"Security and login\" Settings page.",
      "content": "Go to the \"Security and login\" Settings page. Look to the column on the left side of the General Account Settings screen and click Security and login next to a shield icon. If you're using the mobile app, tap Password and security . Each item on this page can be edited with the goal of tightening the security of your Facebook account. To the right of each item is a clickable “Edit” button."
    },
    {
      "title": "Click or tap View next to \"Recommended.",
      "content": "Click or tap View next to \"Recommended. \" The first block will recommend actions you can take to tighten the security of your account, like changing your password to prevent hackers from taking over your account . Follow the on-screen sections to apply or change security settings that are aimed to increase your account's protection. [1] X Research source"
    },
    {
      "title": "Edit your login notifications.",
      "content": "Edit your login notifications. Click on the “Edit” button to the right of \"Setting Up Extra Security\" if you want to be notified by email and/or text message/push notification when someone tries to log into your Facebook using a computer or mobile device you have never used before. [2] X Research source"
    },
    {
      "title": "Impose a security code using Login Approvals.",
      "content": "Impose a security code using Login Approvals. Click on the “View” button next to \"Authorized Logins\", and tick the box next to devices that you want to require a security code when it uses Facebook."
    },
    {
      "title": "Use your Facebook app to get security codes using Code Generator.",
      "content": "Use your Facebook app to get security codes using Code Generator. Click on the “Edit” button next to \"Use two-factor authentication\" if you want to enable and set up another way to get security codes. Click Use authentication app and follow the on-screen instructions to connect your code generator (like Google Authenticator or Duo Mobile) to Facebook. If this is on and an unrecognized device or browser attempts to log in, it'll be prompted for the Authenticator's code. They can only log in to your Facebook account if they have access to this verification code."
    },
    {
      "title": "Review your Saved Logins.",
      "content": "Review your Saved Logins. Click Edit next to \"Save your login info\" to see which devices and browsers automatically log in to your Facebook account. Remove unrecognized or unwanted saved login info by clicking Remove saved login info\" or \"Remove account\" under the section that you want to clear. For example, if you see an unfamiliar device listed, click Remove saved login info for that device."
    },
    {
      "title": "Review your login locations via \"Where you’re logged in.",
      "content": "Review your login locations via \"Where you’re logged in. \" Click See More under the \"Where you’re logged in\" header to review and manage the places where you are logged into Facebook. Should you notice any unfamiliar devices or locations, click the three-dot menu icon and select “Log out” to end the session."
    },
    {
      "title": "Go to your Privacy Checkup.",
      "content": "Go to your Privacy Checkup. From the website on your computer, click your profile icon and select Settings & privacy > Privacy Checkup . If you're using the mobile app, tap the three-line menu, then tap the gear icon to open another menu. Finally, tap Privacy Checkup ."
    },
    {
      "title": "Click or tap the different tiles to see how you can change your account privacy.",
      "content": "Click or tap the different tiles to see how you can change your account privacy. There are tiles to adjust who can see your posts , who can see what you share, how to keep your account secure, how people can find you on Facebook, your data settings, and your ad preferences."
    },
    {
      "title": "Change these settings manually if you don't want to follow the guide.",
      "content": "Change these settings manually if you don't want to follow the guide. To change each of these settings, you can find them in Settings & privacy > Privacy Center on your computer. Using the mobile app, these settings aren't conveniently in one section; instead, you'll have to find these settings in different menus. For example, if you want to change your post audience, you'll find it in \"Privacy Center\" on your computer, but under the \"Audience and visibility\" header in the mobile app."
    }
  ]
}