{
  "url": "https://www.wikihow.com/Disable-Pop-Up-Blocker-on-iPad",
  "title": "How to Disable Pop Up Blocker on iPad",
  "steps": [
    {
      "title": "Open Settings .",
      "content": "Open Settings . You'll find this grey gear icon on one of your Home screens or in the Utilities folder."
    },
    {
      "title": "Tap Safari.",
      "content": "Tap Safari . This is usually in the sixth grouping of options next to a blue compass icon."
    },
    {
      "title": "Tap the toggle next to \"Block Pop-ups\" to turn it off .",
      "content": "Tap the toggle next to \"Block Pop-ups\" to turn it off . A white toggle indicates that the feature is turned off, so you will get pop-ups. [1] X Research source"
    },
    {
      "title": "Open Chrome .",
      "content": "Open Chrome . You'll find this red, green, yellow, and blue orb on one of your Home screens."
    },
    {
      "title": "Tap … .",
      "content": "Tap … . It's the three dots at the bottom-right corner of the screen."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . This is next to an icon of a gear."
    },
    {
      "title": "Tap Content Settings.",
      "content": "Tap Content Settings . You'll find this next to a gear icon under Privacy ."
    },
    {
      "title": "Tap Block Pop-ups.",
      "content": "Tap Block Pop-ups . This is usually the first option in the menu."
    },
    {
      "title": "Tap the toggle next to \"Block Pop-ups\" to turn it off .",
      "content": "Tap the toggle next to \"Block Pop-ups\" to turn it off . A white toggle indicates that the feature is off, so you will get pop-ups. [2] X Research source If you are getting pop-ups on a specific site and want to show them, navigate to that site and tap Always show at the bottom of the page where you get pop-up notifications."
    },
    {
      "title": "Open Firefox.",
      "content": "Open Firefox. You'll find this orange fox icon on one of your Home screens."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's the three horizontal lines at the bottom-right corner of your screen."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . You'll find this at the bottom of the menu next to an icon of a gear."
    },
    {
      "title": "Tap the toggle next to \"Block Pop-up Windows\" to turn it off .",
      "content": "Tap the toggle next to \"Block Pop-up Windows\" to turn it off . A white toggle indicates that the feature is off; pop-ups will come through. [3] X Research source"
    }
  ]
}