{
  "url": "https://www.wikihow.com/Flamboyant-Gamine",
  "title": "How to Style the Flamboyant Gamine & Build a Capsule Wardrobe",
  "steps": [
    {
      "title": "Flamboyant Gamine is a body type that combines yin and yang for a sassy chic style.",
      "content": "Flamboyant Gamine is a body type that combines yin and yang for a sassy chic style. Generally, this body type has balanced yin (feminine features) and yang (masculine features) with a little extra yang. They have a youthful, bold, and brassy essence. Overall, they are small with broad and angular bodies. [1] X Research source Flamboyant Gamines are usually under 5’5” with straight figures, long arms and legs, extremely large eyes, and full lips. When a Flamboyant Gamine gains weight, they may become stocky and square, carrying more of their weight from the waist down. [2] X Research source"
    },
    {
      "title": "Physical characteristics:",
      "content": "Physical characteristics: This body type represents a combination of opposites, with both masculine and feminine characteristics. They tend to be small, with a broadly angular bone structure. If you have most of the following characteristics, your body type is most likely a Kibbe Flamboyant Gamine. [3] X Research source 5’5” and under Square shoulders Bones that are slightly wide Large hands & feet Long arms & legs Very defined musculature Lean & strong Long, straight vertical lines Small to medium bust Straight hips & waist"
    },
    {
      "title": "Facial characteristics:",
      "content": "Facial characteristics: This Kibbe type tends to have wider, sharper facial features than other Gamines. The Flamboyant Gamine is characterized as having very large eyes and clearly defined cheekbones. They also have fuller, more dramatic lips. [4] X Research source A few additional facial features include: Broad facial contours Extremely large eyes Broad or long face shape Sharply defined jaw Medium or large nose Taut cheeks with prominent cheekbones Moderate to full lips"
    },
    {
      "title": "Non-Gamine characteristics:",
      "content": "Non-Gamine characteristics: Still questioning whether you fit into the Flamboyant Gamine category? Check out the characteristics that are never seen in this body type. A Flamboyant Gamine body type will never: [5] X Research source Be tall Have exotic facial features (except for the large eyes) Have a delicate bone structure Have small feet & hands Have an hourglass figure with a wasp waist Have curvy hips & bustline Be completely symmetrical"
    },
    {
      "title": "Mix extravagant and menswear-inspired pieces to suit your yin/yang duality.",
      "content": "Mix extravagant and menswear-inspired pieces to suit your yin/yang duality. Fitted or tailored clothing in a retro style (think 1920s or 1930s) looks fantastic on the Flamboyant Gamine body type. Choose pieces in matte fabrics with asymmetrical lines or prints to showcase your natural combination of opposite energies and to break up your square outlines. [6] X Research source Chunky or sculpted shapes both work well on you…especially if you find ways to combine them. Try starting with a slim or narrow base and adding a wider geometric shape for contrast. Choose slightly crisp fabrics that are light to moderate in weight. More tailored or clingy fits pair well with lighter fabrics. Go with bold, animated prints with irregular patterns and contrasting colors. You can get away with more humorous or whimsical designs that match your flamboyant personality. [7] X Research source"
    },
    {
      "title": "Wear tailored blouses or tight-fitting turtlenecks.",
      "content": "Wear tailored blouses or tight-fitting turtlenecks. Go with narrow tops in crisp fabrics with clean, simple necklines. Sleek, fitted turtlenecks are the perfect basic layer. Asymmetrical detailing or geometric trim is ideal. Try an asymmetrical cami in either a matte fabric or one that’s very shiny for a night out. [8] X Research source Avoid frilly or ultra-clingy styles that clash with your yang energy. Your style essence is sassy chic, which is way too fun and funky for traditional, symmetrical styles."
    },
    {
      "title": "Wear menswear-style pants in heavy fabrics with deep pleats.",
      "content": "Wear menswear-style pants in heavy fabrics with deep pleats. Your longer legs allow you to choose cuffed pants that hit at or above the ankle . Shorter cropped pants and short straight-legged jeans are also great options for the Flamboyant Gamine. Skin-tight pants are ideal for pairing with bulkier tops. [9] X Research source Avoid wide, unstructured, shapeless styles that can overwhelm your small stature. Draped pants with a gathered waist and tapered legs clash with your vertical line."
    },
    {
      "title": "Try a basic straight skirt with a short hemline and slim fit.",
      "content": "Try a basic straight skirt with a short hemline and slim fit. Severe tailoring or a clean, tapered hemline best showcase your long legs and small figure. Choose skirts that are no longer than the middle of your knee. Don’t be afraid to go super-short with funkier styles. Wear a longer skirt only if it has a slit and tapers to the knee and then very slightly flares. Mid-calf pleated skirts work if the pleats are stitched down in the hip area. [10] X Research source Avoid traditional styles, like A-line skirts or anything that’s unstructured or long and flowing. Flouncy, overly ornate styles are way too big and fussy for your short stature and vertical lines."
    },
    {
      "title": "Wear dresses that are tailored and short with asymmetrical details.",
      "content": "Wear dresses that are tailored and short with asymmetrical details. Opt for narrow styles that are cut close to the body and dresses that have a dropped waist , like the flapper styles of the 1920s. Go with shorter lengths to show off your long legs. Asymmetrical hemlines that are a little lower are also flattering. Ribbed-knit dresses that sculpt your figure are excellent choices. [11] X Research source Avoid frilly, flouncy dresses with full, flowing skirts that can be overwhelming on your petite frame. [12] X Research source Wide, unstructured dresses will swallow your slight stature."
    },
    {
      "title": "Sweaters in skinny ribbed knits or cropped, bulky styles work best.",
      "content": "Sweaters in skinny ribbed knits or cropped, bulky styles work best. The Flamboyant Gamine is a combination of opposites. That holds true for their wardrobe. For example, try a chunky sweater that’s cropped and hugs your body. Try quirky sweaters with bold, geometric patterns in vibrant colors. [13] X Research source Avoid traditional crew-neck and cardigan styles as they are too bland for your style. Instead, choose a cropped cardigan with funky detailing. Soft, fluffy knits like Angora are too romantic and fussy for your dramatic yang energy."
    },
    {
      "title": "Choose short jackets with a sharp shoulder line and contrasting trim.",
      "content": "Choose short jackets with a sharp shoulder line and contrasting trim. Boxy jackets in cropped lengths no longer than the top of the hip are best for your shorter stature. Jackets with fitted waistlines can work with your frame as long as they have pronounced shoulders and sharp lapels. Look for asymmetrical lines or irregular detailing to compliment your natural asymmetry. [14] X Research source Avoid long or oversized jackets that hide your body. Only wear longer jackets open over a very slim silhouette. Standard blazers may be too plain and boring for your sassy chic vibe."
    },
    {
      "title": "Opt for shoes that are slightly chunky with an angular shape.",
      "content": "Opt for shoes that are slightly chunky with an angular shape. Go with either funky flats or straight high heels with flair. Low boots with a lug sole and chunky heels are great choices, as are loafers in a fun and funky print . [15] X Research source Avoid plain pumps or delicate, strappy shoes with overly ornate trim."
    },
    {
      "title": "Choose highly original accessories in angular shapes.",
      "content": "Choose highly original accessories in angular shapes. Small triangle, square, and skinny rectangle shapes are great choices for fun structured bags . Wear wide, stiff belts in bright colors with unique (or even wild) patterns. Try hats that are small, crisp, and asymmetrical. [16] X Research source Avoid rounded or delicately shaped bags and belts with ornate trim. Oversized bags and hats are also less flattering for the Flamboyant Gamine body type."
    },
    {
      "title": "Focus on basics to build a Flamboyant Gamine capsule wardrobe.",
      "content": "Focus on basics to build a Flamboyant Gamine capsule wardrobe. A capsule wardrobe is a curated collection of timeless clothing that you can mix and match to create the perfect outfit for every occasion. When creating a capsule wardrobe invest in essential pieces that are less trendy and more classic. [17] X Research source For a Kibbe Flamboyant Gamine, try: A fitted striped shirt An asymmetrical camisole A fitted ringer tee A mock-neck sweater A fitted turtleneck A black leather mini skirt A short, drop-waist dress An oversized, quirky sweater A cropped cardigan Ankle-length trousers Cropped, straight-leg jeans A short blazer with sharp lapels A cropped, slightly boxy jacket Chelsea boots White sneakers Loafers in a funky print A small, structured bag"
    },
    {
      "title": "Avoid pieces that are overly ornate or unstructured.",
      "content": "Avoid pieces that are overly ornate or unstructured. Frilly, flouncy styles in drapey fabrics and oversized, unstructured clothing will drown your slim, petite frame. This can make you look immature. Pass on: Shirts with cowl necks Flowy maxi skirts & dresses Long blazers Fluffy sweaters Delicate, strappy shoes Hobo bags Floppy oversized hats"
    },
    {
      "title": "Wear short, tousled, or asymmetrical hairstyles.",
      "content": "Wear short, tousled, or asymmetrical hairstyles. Your flamboyant nature allows you to try wild or very trendy styles. Whatever style you choose, your hair mustn’t hide your face, especially your large eyes. Ask your stylist for layers or beveled edges to keep geometric cuts fresh. Choose bigger, over-the-top styles for longer hair. [18] X Research source Avoid overly severe cuts, as they can overemphasize your angular features. A dramatic asymmetrical sweep of hair looks elegant on you. Choose clear, vivid hair colors, whether you go with natural hues or theatrical shades like blue-black, fiery red, or platinum."
    },
    {
      "title": "Go with a bold eye look and shiny, deep colors for your lips.",
      "content": "Go with a bold eye look and shiny, deep colors for your lips. Use makeup to add a little sophistication to your look. Your best look combines deeper, sultry colors with more vibrant eyeshadows and liners. Stick with mattes during the day, but a little sheer sparkle will elevate your style for the evening. [19] X Research source Avoid pastels or watercolor blends that may seem to age your youthful features. Stay away from overly glittery or ornate looks that often appear a little unsophisticated when paired with your youthful energy."
    },
    {
      "title": "Audrey Hepburn is an iconic Flamboyant Gamine celebrity.",
      "content": "Audrey Hepburn is an iconic Flamboyant Gamine celebrity. In his book, Kibbe identified several celebrity Flamboyant Gamines. Since the book was published, some fashion and Kibbe imagery experts have identified other celebrities as having the body type. Here’s a list of a few Flamboyant Gamine celebrities: Julie Harris Nastassja Kinski Debbie Allen Debra Winger Tina Turner Twiggy Bonnie Franklin Patti LuPone Shari Belafonte Shirley MacLaine Kelly Osbourne Penélope Cruz Zooey Deschanel Jennifer Love Hewitt Zoë Kravitz Kiernan Shipka FKA Twigs Julia Garner"
    },
    {
      "title": "The Flamboyant Gamine is one of the 13 Kibbe body types.",
      "content": "The Flamboyant Gamine is one of the 13 Kibbe body types. In his 1987 bestseller, Metamorphosis: Discover Your Image Identity and Dazzle As Only You Can , David Kibbe identified 13 body types, including the Flamboyant Gamine. [20] X Research source These body types fall along a yin/yang or feminine/masculine spectrum, with each type representing a combination of the two energies. The yin end of the spectrum features more feminine and romantic figures, while the yang features dramatic, masculine figures. [21] X Research source According to Kibbe, your unique balance of yin and yang can help you choose makeup, hairstyles, and clothing that look natural on you. Kibbe’s other body types are Dramatic, Soft Dramatic , Flamboyant Natural , Natural, Soft Natural , Dramatic Classic , Classic, Soft Classic , Gamine , Soft Gamine, Theatrical Romantic , and Romantic . Since writing his book, Kibbe has removed the pure Gamine, Classic, and Natural body types from his system. These three body types represent an equal balance of yin and yang, and he believes that no one will fall perfectly into these types."
    },
    {
      "title": "Kibbe identified 2 more Gamine body types.",
      "content": "Kibbe identified 2 more Gamine body types. Along with the Flamboyant Gamine, Kibbe originally included the pure Gamine and the Soft Gamine in his system but later removed the pure Gamine. All 3 Gamine body types share shorter statures and angular bone structure. However, there are characteristics that differentiate them. [22] X Research source Soft Gamine has shorter arms and legs than the Flamboyant Gamine. She has slightly rounded hips and a larger bust that gives her a delicate hourglass shape. The Soft Gamine is softer and curvier than the more angular, Flamboyant Gamine with more delicate facial features. [23] X Research source Pure Gamine also has shorter arms and legs, which makes her appear shorter overall than the Flamboyant Gamine, even if they are the same height. Her body is slightly less square and looks less sturdy due to her narrower bone structure. [24] X Research source"
    },
    {
      "title": "Take our Kibbe Body Type test.",
      "content": "Take our Kibbe Body Type test. Do the descriptions of this body type sound like you? If so, you just might just be a Flamboyant Gamine. If you’re still not totally sure whether this Kibbe type is your perfect match, take our Kibbe body type test to help you make your decision. Remember, the most important thing is finding a style that makes you feel comfortable and confident. If the test says you’re another Kibbe type , but you feel like the Flamboyant Gamine style fits you best, go ahead and wear what you like! Unfortunately, Kibbe’s book Metamorphosis: Discover Your Image Identity and Dazzle As Only You Can is out of print, but your may be able to find it at a local used bookstore or thrift store. The good news is that David Kibbe is working on a new book with updated style tips."
    }
  ]
}