{
  "url": "https://www.wikihow.com/File-Down-Dentures",
  "title": "How to Treat Denture Pain until a Dentist Can File Them",
  "steps": [
    {
      "title": "Know the risks of filing down dentures yourself.",
      "content": "Know the risks of filing down dentures yourself. If you try to file your dentures yourself, you risk damaging them beyond repair. As dentures are expensive, you risk losing a large amount of money if you try filing them yourself. It's always best to ask your prosthodontist or dentist to adjust them. [2] X Expert Source Pradeep Adatrow, DDS, MS Board Certified Dentist & Oral Surgeon Expert Interview. 5 November 2020. If you cannot get to a dentist soon and the pain is severe, try using a nail file or a fingernail drill to file down the painful point or area. Take off as little of the denture material as possible and tell your dentist where you needed to make an adjustment."
    },
    {
      "title": "Try dental adhesives.",
      "content": "Try dental adhesives. When you first get dentures, your mouth needs time to adjust to the new teeth. To help your mouth out, use dental adhesives to hold them in place for the first few days. [3] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Eventually, though, the muscles in your mouth should adjust to keep your dentures in place, so you should only need to use them for a short time. The adhesive is helpful when you have pain as it holds your denture still in your mouth. Movement against an already sore spot can lead to an ulcer. [4] X Research source You can also use adhesives as a temporary measure when they start to become loose after years of wearing. However, you need to have your dentist reline your dentures when they become loose, so you should only use the glue for a short while. [5] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Every adhesive is a bit different. However, in general, you take the dentures out of your mouth and clean them. Shake some of the powder onto the gum side of the dentures. Put your dentures back in. Cream adhesive must be applied to a dry denture in order to work. Rinse your mouth, place the denture onto a wet gum, and then wait five minutes before eating or drinking anything. [6] X Research source"
    },
    {
      "title": "Put your dentures in the freezer.",
      "content": "Put your dentures in the freezer. One option some people use for helping to relieve pain, especially with new dentures, is to place them in the freezer. When you take them out, the cold will help soothe the pain in your gums. [7] X Research source"
    },
    {
      "title": "Try a pain cream.",
      "content": "Try a pain cream. Creams such as benzocaine topical can provide temporary relief from pain. Simply rub the cream on the painful area in your mouth, and it will numb the pain. Baby teething gel is available in most supermarkets. There are much stronger medications available, but if cost or accessibility is a problem, then the baby gel is a good option. It is very safe and gives reasonable relief to sore spots on your gums. [8] X Research source"
    },
    {
      "title": "Remove your dentures.",
      "content": "Remove your dentures. If other options don't help, go ahead and take your dentures out for a bit—that will at least provide pain relief. See your dentist for help."
    },
    {
      "title": "Have your dentist examine your dentures.",
      "content": "Have your dentist examine your dentures. If you just got your dentures and they are not fitting properly, your dentist should work with you to get them adjusted properly. You shouldn't be experiencing sharp pains, at the very least. [9] X Research source Tell your dentist where it is hurting, and ask him or her to look for small surface tags or irregularities that may need to be filed down. You should also inform your dentist if you've had any bleeding or gum pain in the first few days of wearing the dentures."
    },
    {
      "title": "Ask about trimming.",
      "content": "Ask about trimming. After your dentist identifies any issues with your dentures, they may recommend trimming them down. [10] X Research source"
    },
    {
      "title": "Get your dentures polished.",
      "content": "Get your dentures polished. After trimming, your dentist can polish the dentures (except for the tissue surface, which would alter the fit). Polishing will make your dentures smoother, and can also help prevent bacteria from developing in your mouth. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Reline dentures after years of wearing.",
      "content": "Reline dentures after years of wearing. After you wear dentures for a period of time, they start to wear down, which means they won't fit as well. Most of the time, your dentist can reline them to fit better again. Sometimes, you may need new dentures. [12] X Research source Relining just means that your dentist refits the bottom portion of the denture. [13] X Research source You can have a soft reline or a hard reline. Soft relines last for a couple of years, and can be completed in the dentist’s office. Hard relines last for around 5 years, but are more expensive and can’t be completed in a single day. [14] X Research source"
    },
    {
      "title": "Try rebasing.",
      "content": "Try rebasing. Another less common procedure is rebasing—this is typically done after your gum line recedes a significant amount. The downside to this process is your dentist must keep your dentures for a few days. However, they should fit better when they come back to you. [15] X Research source"
    },
    {
      "title": "Check the fit.",
      "content": "Check the fit. Once the dentures are examined, trimmed, and polished, your dentist will evaluate the fit. Let your dentist know if anything feels painful or uncomfortable. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    }
  ]
}