{
  "url": "https://www.wikihow.com/Fill-a-Flask",
  "title": "How to Fill a Flask",
  "steps": [
    {
      "title": "Choose a funnel that fits in your flask.",
      "content": "Choose a funnel that fits in your flask. Many flasks come with small metal funnels that fit in the flasks. These are the best funnels with which to fill your flask as they are designed perfectly for the job and are nice and portable as well! [1] X Research source If you’ve lost the funnel that came with your flask you may be able to find a replacement one in a liquor store or online. Alternatively you can use a small kitchen funnel, just make sure that the spout will fit nicely in the neck of your flask."
    },
    {
      "title": "Place the funnel in the opening of the flask.",
      "content": "Place the funnel in the opening of the flask. Once you have chosen an appropriately-sized funnel, open the lid of your flask and place the spout of the funnel inside. [2] X Research source Make sure to place the flask on a flat and stable surface! If you are using a funnel that did not come with the flask you may need to hold it in place to keep it steady."
    },
    {
      "title": "Open your preferred bottle of liquor.",
      "content": "Open your preferred bottle of liquor. Get ready to fill your flask by opening up that prized bottle you’ve been saving for the occasion."
    },
    {
      "title": "Fill the flask from your bottle.",
      "content": "Fill the flask from your bottle. Slowly pour your chosen liquor into the flask. Keep an eye on the level of the liquor to be sure that it does not overflow the funnel. It is a good idea to stop pouring periodically to look at the level of the liquor in the flask. Once the liquid rises to the neck of the flask and spout of the funnel, stop pouring, remove the funnel, and close the flask."
    },
    {
      "title": "Check the bottom of your flask to determine the capacity.",
      "content": "Check the bottom of your flask to determine the capacity. Flasks come in many different sizes, but most flasks will have their volume in ounces engraved on the bottom of the flask. [3] X Research source If you don’t see the capacity on the bottom, your flask may have it written somewhere else, so take a quick look all over your flask just to be sure. If your flask does not display the capacity, you can fill it first with water, and then pour it out into a measuring cup to determine how much liquid it holds."
    },
    {
      "title": "Fill a measuring cup to the correct capacity.",
      "content": "Fill a measuring cup to the correct capacity. Once you know the volume of your flask, open your chosen bottle of liquor and fill a measuring cup with the amount that the flask will hold. [4] X Research source You may want to fill the measuring cup just slightly under the capacity of the flask to avoid filling the flask right to the brim."
    },
    {
      "title": "Set your flask on a stable surface.",
      "content": "Set your flask on a stable surface. This method especially requires a lot of stability and control during pouring so a hard, flat surface such as a table or kitchen counter will work best. [5] X Research source"
    },
    {
      "title": "Pour the contents of the measuring cup into the flask.",
      "content": "Pour the contents of the measuring cup into the flask. Slowly pour out the liquor from the measuring cup into the flask. [6] X Research source It will take a bit of patience and control to avoid pouring too fast and splashing over the sides of the mouth of the flask. Remember to stop pouring periodically to check on the level of liquor in the flask."
    }
  ]
}