{
  "url": "https://www.wikihow.com/Delete-Archived-Emails-in-Gmail",
  "title": "How to Delete Archived Emails in Gmail: Mobile & Desktop",
  "steps": [
    {
      "title": "Open Gmail.",
      "content": "Open Gmail. The app icon looks like an M on a white background. You’ll find it on one of your Home screens, in the app drawer, or by searching. This method works for iPhone and Android. If you’re just looking for old emails, check out our guide on how to search for old emails in Gmail ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this three-line menu icon in the top left corner of your screen. [1] X Research source"
    },
    {
      "title": "Tap All Mail.",
      "content": "Tap All Mail . This shows you all the mail that's in your inbox as well as all the mail you've archived. Unfortunately, there is no way to search for only archived mail, so you'll need to look at the ones not labeled \"Inbox.\" [2] X Research source"
    },
    {
      "title": "Tap an email you want to delete.",
      "content": "Tap an email you want to delete. When you tap on mail that doesn't have the \"Inbox\" label, you'll see that it has been archived. To delete multiple emails, return to the \"All Mail\" folder and long-tap an email. When you release, you'll see the logo next to each email is covered with a checkmark; you can continue tapping emails to select them as well. When you're done selecting emails, tap the trashcan icon. You'll see a notification at the bottom of your screen that your emails have been deleted."
    },
    {
      "title": "Tap .",
      "content": "Tap . You'll see this trashcan icon at the top of your screen while you’re viewing the email’s content. Have you been getting a lot of spam emails lately? See our guide on stopping spam email in Gmail ."
    },
    {
      "title": "Go to https://mail.google.com in a web browser.",
      "content": "Go to https://mail.google.com in a web browser. You can use any web browser to delete your archived mail in Gmail. Sign in to your Gmail account if you aren't already signed in. You can change your Gmail password if needed."
    },
    {
      "title": "Click All Mail.",
      "content": "Click All Mail . You'll see this in the menu on the left side of the page. It will display all the mail that's in your inbox as well as all the mail you've archived. Unfortunately, there is no way to search for only archived mail, so you'll need to look at the ones not labeled \"Inbox.\". [3] X Research source"
    },
    {
      "title": "Click an email to open it.",
      "content": "Click an email to open it. Once you find an email not labeled \"Inbox,\" you can click it to open it. To delete multiple emails, return to the \"All Mail\" folder, click to select the boxes next to each email that you want to delete, and then click the trashcan icon. You'll see a notification that your emails (or conversations) have been moved to the Trash, where they will be deleted after 30 days."
    },
    {
      "title": "Click .",
      "content": "Click . You'll see this trashcan icon above the email preview space. This will delete the archived email. [4] X Research source If you’re doing a complete email cleanup, check out how to find unread emails in Gmail next!"
    }
  ]
}