{
  "url": "https://www.wikihow.com/Dress-Hip-Hop",
  "title": "How to Dress Hip Hop",
  "steps": [
    {
      "title": "Choose a brand that works for you.",
      "content": "Choose a brand that works for you. With the number of musicians that have jumped into the fashion scene, it will be fairly easy to find a style that works for you. Who better to give you expert advice on Hip Hop style than those that are part of the fashion forward movement? Sean John by P. Diddy, Rocawear by Jay-Z, the River Island Collection by Rihanna, or T.I.’s AKOO are only a few of the clothing lines available to you and all made Fuse’s list of “12 Dope-est Hip Hop Fashion Lines”. [1] X Research source"
    },
    {
      "title": "Find clothes that complement your body type.",
      "content": "Find clothes that complement your body type. Beauty comes in all different sizes and so do clothes. When it comes to dressing Hip-Hop you want to ensure you are selecting clothes that fit your body type. Wearing something that fits too tight, or is way too big, will make it seem like you are trying too hard and may not necessarily look on you the way it does on someone else. Hip-Hop is about expressing your own fashion tastes and allowing your inner goddess to come to the surface."
    },
    {
      "title": "Find age-appropriate clothing.",
      "content": "Find age-appropriate clothing. Even if you grew up in the 1980s, when hip-hop fashion was really hitting the scene, you will find that the style you were accustomed to seeing then has taken a turn in many directions. While red Kangol hats, big rimmed sunglasses, and old school Adidas sneakers were cool back in the day you will want to upgrade to something more modern and make sure it suits your age."
    },
    {
      "title": "Find the best pant for dressing hip hop.",
      "content": "Find the best pant for dressing hip hop. The sagging pant is highly regarded as hip hop style, but you are not limited there. Brightly colored skinny jeans are coming to the forefront of the fashion scene along with leather leggings and creased shorts. Consider your pant to be the base of your outfit and build from there. If you choose the saggy pant then skip the baggy shirt. [2] X Research source Match your pant up with a classy sweater or a simple t-shirt under a jacket."
    },
    {
      "title": "Step out in the perfect shoes.",
      "content": "Step out in the perfect shoes. The right footwear can make or break your outfit, whether you are going for that casual look or want to spice it up a bit for a night out on the town. Nike and Adidas are the top brands when it comes to hip hop style sneakers while Baby Phat may get you noticed with a pair of trendy high top boots. There are more choices out there than you realize when it comes to completing your hip hop look with fancy footwear. Flat sneakers without laces High top sneakers Suede mid-rise work boot"
    },
    {
      "title": "Add a baseball cap to top off your outfit.",
      "content": "Add a baseball cap to top off your outfit. Adding a baseball style cap to your ensemble can really complete a look; you don’t have to stick to sporting your favorite team. Hats come in a wide variety of colors, graphics, and styles to choose from that will help you make a statement for any occasion. Men and women can add a fitted baseball cap to their hip hop ensemble."
    },
    {
      "title": "Choose a colorful pair of sweatpants or baggy pants.",
      "content": "Choose a colorful pair of sweatpants or baggy pants. From fashion hip hop dance pants to the tighter fitting crop pant combined with a pair of heels, you’ll find that there are more choices in sweats than ever before. Combined with an oversized t shirt, crop top and a hoodie or a jersey, your hip hop look can go from flab to fab in a matter of minutes. If you are looking to go completely retro with your hip hop look, consider the Adidas track suit or the spandex pant."
    },
    {
      "title": "Decide on casual or high style shoes.",
      "content": "Decide on casual or high style shoes. Shoes for women looking to complete their hip hop look come in a wide variety of style, colors, and brands. Baby Phat may get you noticed with a pair of trendy high top boots while a pair of Pastry sneakers will brighten up the casual look. Bright colored high top sneakers Neutral color Converse Fashionable stiletto heels High heel over the knee boots"
    },
    {
      "title": "Go all natural with your hair.",
      "content": "Go all natural with your hair. Gone are the days of bandanas and Kangol hats. Headband wraps, braids, and poufy hair are here; and the bigger, the better. Whether you are looking for a classy style or something a little more inventive, have fun with it. Hip hop is a state of mind and your hair says a lot about the look you are trying to achieve. [3] X Research source"
    },
    {
      "title": "Accessorize without going overboard.",
      "content": "Accessorize without going overboard. You don’t have to spend a fortune to dress like the stars. Accessories make the outfit complete but don’t get carried away with too much bling. Keep it simple. Bling was once considered all things flashy, expensive and big but with changing styles comes a simpler way to accessorize with the minimalistic rings, belt buckles and watches. In women’s Hip-Hop fashion an entire ensemble can be accessorized with simple hoop earrings and a petite chain. Gone are the days of massive necklaces with a huge clock face pendant."
    },
    {
      "title": "Go retro and save money.",
      "content": "Go retro and save money. Many styles in hip hop are making a comeback and if you are someone that has a hard time throwing anything away then you may already have the clothing you need. Jersey’s, Jordans, or even that pair of skinny jeans you held onto are all making their way back to the hip hop fashion scene. [4] X Research source"
    },
    {
      "title": "Be confident in what you wear.",
      "content": "Be confident in what you wear. No matter the style you are attempting to achieve you should always feel confident in what you wear. Just like the perfect accessory, a fresh look goes a lot further with an attitude to match. Choose an outfit that fits well and let your personality do the rest."
    }
  ]
}