{
  "url": "https://www.wikihow.com/Fill-a-Syringe",
  "title": "How to Fill a Syringe",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You will need the medication vial, syringe-needle unit, alcohol pads, a cotton ball, a band-aid, and a sharps container. [1] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The alcohol pad is used to wipe the rubber top of the medication container once you remove the outer seal. You may also need to clean the area of the skin where the injection will be administered. The bandage and cotton ball are used to cover the area of the skin where you injected the medication to reduce bleeding. The sharps container is the thick plastic bin that holds the used supplies, including the syringes and needles. When you use a lancet, syringe, or needle, these items are called sharps. Proper storage of used sharps is a safety measure. When the containers are full, they can be transferred to a place that destroys biohazard equipment. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Each state and/or city may have their own protocol for disposing biohazard material/sharps disposal sites. Contact local health department for specific instructions on how to dispose of hazardous materials."
    },
    {
      "title": "Read the literature provided.",
      "content": "Read the literature provided. If the injection you are giving is something other than insulin, the product literature that comes with the medication provides precise instructions on preparing the drug for administration. However, this literature should be considered a refresher and not the sole source of information — it is very important that a qualified medical professional trains you on preparation and how to administer the medication. If you have not received this training, you should not try to give someone an injection. Not all medications are packaged the same way. Some medications need to be reconstituted with water before administration, while others may require using only the syringe and needle that comes with the product. Be thoroughly familiar with the steps you need to take that are specific to the medication. Most injections given at home, other than insulin, will be done using a single dose vial. The label will say either single dose vial, or will contain the abbreviation, SDV. This means that that only one dose can be given from that vial, regardless of the amount remaining after you have withdrawn the amount of medication you need. In some cases, you may be administering a medication that is packaged in a vial called a multi-dose-vial. The package label will have the words multi-dose vial or the abbreviation MDV. Insulin vials are considered a multi-dose vial. However, this is rare for medication intended for home use. If you are using a multi-dose vial, write the date, using a marker that will not wipe off, when the container is first opened. This type of product usually contains small amounts of preservatives, but still should not be used at all once 30 days after the first date of opening has passed, unless your doctor advises you differently. Keep these products in the refrigerator, but not frozen, between uses."
    },
    {
      "title": "Always examine the medication.",
      "content": "Always examine the medication. In order to maintain your safety, check the medication vial for several elements: [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Be sure you have the right medicine, and it is the right strength. Be sure the expiration date has not passed. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Be sure the product has been stored according to the manufacturer’s guidelines. For example, some products can be stored at room temperature, while others may need refrigeration. Check the integrity of the packaging. Make sure there are no cracks or dents in the vial that holds the medication. Look for particulate matter. This means you must examine the medication in the vial to be sure nothing unusual is floating inside the container. Examine the seal. Make sure there are no cracks or dents in the seal around the top of the vial."
    },
    {
      "title": "Check the syringe and needle.",
      "content": "Check the syringe and needle. Be sure the syringe and needle have not deteriorated or been damaged. Visible cracks in the barrel, or discoloration of any part of the syringe, including the rubber top on the plunger, indicates the syringe should not be used. Examine the needle for damage. Check the needle to be sure it is not broken or bent. Do not use any product that appears to have been damaged. While some packaged syringes have a visible expiration date, many do not. If you are not sure, contact the manufacturer. Have any lot numbers available when you call. Discard damaged or deteriorated syringes safely in a sharps container."
    },
    {
      "title": "Verify that you have the correct type of syringe.",
      "content": "Verify that you have the correct type of syringe. Do not interchange syringe types. Using the wrong type of syringe can easily result in giving the wrong amount of medication. Insulin syringes are intended for insulin administration only. The markings along the barrel are in units, and are specific for insulin dosing. Your syringe should be able to hold a little more than the required amount for the dose. The needle should be the correct length for the type of injection you are going to administer. Your doctor or pharmacist should have trained you on proper administration of the drug, including the type of syringe and needle recommended. You can use the product literature as a reference as well, but only once you have received adequate training. If you have any questions, talk to your doctor or pharmacist. They can help you to be sure you have the correct syringe-needle unit for the medication you are giving."
    },
    {
      "title": "Practice with the safety features of the syringe.",
      "content": "Practice with the safety features of the syringe. Safety syringes have a patented way to safely recap the needle once the medication has been drawn up. Practice this method prior to drawing up the actual dose of medication. This helps you to be prepared to re-cap the needle in situations where you do not give the prepared dose immediately. [5] X Research source Discard the practice syringe safely in a sharps container. It is generally not recommended to re-cap syringes, as this can result in accidental needle sticks."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Thoroughly clean your hands using soap and water. Include washing your nail area, and between your fingers."
    },
    {
      "title": "Know if you need to gently mix the medication.",
      "content": "Know if you need to gently mix the medication. Some medication, like insulin that appears cloudy, need to be gently mixed before drawing it up. Roll the medication between your hands gently. Do not shake it, as this will create bubbles. The product literature will advise you on products that should be gently mixed."
    },
    {
      "title": "Remove the cap from the vial.",
      "content": "Remove the cap from the vial. Wipe the rubber seal with an alcohol pad. Allow the alcohol to air-dry. Do not fan it with your hand or blow on it. Doing this may contaminate the cleaned area. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Pull the plunger back on the syringe.",
      "content": "Pull the plunger back on the syringe. Your target is the line, or mark on the barrel, that is equal to the amount of medication you need to draw up. [7] X Research source"
    },
    {
      "title": "Remove the needle cover.",
      "content": "Remove the needle cover. Use caution not to touch the needle."
    },
    {
      "title": "Insert the syringe needle into the rubber center.",
      "content": "Insert the syringe needle into the rubber center. Use a straight motion as you push the needle into the top of the medicine bottle. [8] X Research source"
    },
    {
      "title": "Push the plunger of the syringe down.",
      "content": "Push the plunger of the syringe down. This forces the air from the syringe into the bottle. You are inserting the amount of air that equals the amount of medication you will be removing. [9] X Research source"
    },
    {
      "title": "Turn the bottle upside-down.",
      "content": "Turn the bottle upside-down. Do this carefully so as not to dislodge the needle from the bottle. Hold the neck of the bottle between your thumb and index finger of your non-dominant hand. Support the syringe with your other hand. Do not allow the needle to bend. [10] X Research source"
    },
    {
      "title": "Pull the plunger back.",
      "content": "Pull the plunger back. Use your dominant hand to pull the plunger back to the line marked on the barrel of the syringe indicating the prescribed amount of medication. Do not remove the needle from the medication vial yet. [11] X Research source"
    },
    {
      "title": "Inspect the medication in the syringe for air bubbles.",
      "content": "Inspect the medication in the syringe for air bubbles. Gently tap the barrel of the syringe. This will move any air bubbles trapped in the medication toward the needle. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Push the plunger gently.",
      "content": "Push the plunger gently. Once the air bubbles are at the top of the syringe, push the plunger until the air bubbles are removed. A small amount of medication may squirt out as you remove the air bubbles. [13] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Draw more medication if needed.",
      "content": "Draw more medication if needed. Once you have removed the air bubbles, check the amount of medication remaining in the syringe to be sure you have the exact dose you need."
    },
    {
      "title": "Remove the needle from the vial.",
      "content": "Remove the needle from the vial. Avoid touching the needle once you have drawn the medication into the syringe. If you do not plan to give the injection immediately, then place a safety cover, as practiced, back on the needle. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you do not have a safety re-cap feature, carefully use the needle to scoop up the original needle covering. Then you can secure it in place with your fingers. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Give the injection.",
      "content": "Give the injection. Injection techniques vary depending on the type of injection being given."
    },
    {
      "title": "Use safe injection practices.",
      "content": "Use safe injection practices. According to the World Health Organization, there are 4 areas of focus in giving injections safely. [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Those 4 areas include: Avoid giving unnecessary injections. Always use sterile equipment, including the needles. Avoid contaminating the injection as it is prepared. Properly dispose of the used syringes and needles."
    },
    {
      "title": "Never re-use a needle.",
      "content": "Never re-use a needle. Once the injection has been given, discard of the needle in a sharps container. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source A needle that has pierced the skin of someone is not only dulled, but contaminated with possibly serious and contagious diseases."
    },
    {
      "title": "Get a sharps container.",
      "content": "Get a sharps container. Sharps containers are designed to be a safe way to dispose of syringes and needles. Sharps containers are available for purchase at your local pharmacy, or online. [18] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Never put syringes or needles in the regular trash. [19] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source If you do not have access to a sharps container, then you can use a container made from very thick plastic that has a tight-fitting lid, such as an empty laundry detergent container. Label the container with the words \"Sharps Biohazard\" and take it to a sharps disposal location when it is full. [20] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Review your state’s guidelines.",
      "content": "Review your state’s guidelines. Many states have specific recommendations and programs that can help you develop a regular system for disposing of biohazardous waste. Sharps, including used needles and syringes, are considered to be biohazardous waste since they came in direct contact with someone's skin or blood. [21] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Work with a mailbox kit.",
      "content": "Work with a mailbox kit. Some companies offer to supply you with the appropriate sizes of sharps containers, and agree to set up an arrangement for you to safely mail those containers back to them when they are full. The company will dispose of the biohazard materials appropriately, according to EPA, FDA, and state requirements. [22] X Research source"
    },
    {
      "title": "Ask your pharmacy about the unused medications.",
      "content": "Ask your pharmacy about the unused medications. Some states have specific guidelines regarding the disposal of unused medications. In many cases, you may able to place the opened vials of medication directly into the sharps containers. Your pharmacy, physician, mailback company, or state agency, can advise you on the proper disposal of unused medication."
    },
    {
      "title": "Explore the available types of syringes.",
      "content": "Explore the available types of syringes. Syringes are categorized by how their parts work and how they are designed to function."
    },
    {
      "title": "Recognize a luer-lok syringe.",
      "content": "Recognize a luer-lok syringe. Common syringes most recently used in clinical practice are called luer-lok syringes. Luer-lok describes the type of locking mechanism built into the tip of the syringe. The mechanism works by securely holding luer-lok needles once they are twisted in place. Using this type of syringe requires an added step in assembly. The added step is to secure the needle to the syringe, prior to drawing up the medication."
    },
    {
      "title": "Identify syringes designed for a specific function.",
      "content": "Identify syringes designed for a specific function. Examples of syringe types that are designed for a certain purpose or function include an insulin syringe, tuberculin syringe, and safety syringe. Insulin syringes are intended only for giving insulin. The barrel is graduated in units instead of mls. Tuberculin syringes are used when you need to give a very small dose of a medication, such as 0.5mls."
    },
    {
      "title": "Know what makes a safety syringe different.",
      "content": "Know what makes a safety syringe different. A safety syringe is an all-in-one unit. That means that the syringe has a pre-attached needle, so the added step of attaching the needle by hand is not needed. A safety syringe also has a built-in mechanism that either covers, or retracts, the needle once the medication has been administered to the patient. Due to the increasing number of healthcare accidents involving needle sticks, regulatory agencies are mandating the use of safety syringes in healthcare facilities. Safety syringes are recommended by health organizations including the CDC and the World Health Organization. [23] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Identify the parts of a syringe.",
      "content": "Identify the parts of a syringe. A syringe is made of 3 basic parts. Those parts include the barrel, the plunger, and the tip."
    },
    {
      "title": "Know what the barrel does.",
      "content": "Know what the barrel does. The barrel is the clear part in the middle that holds the medication. The barrel is marked with numbers and lines in a graduated manner. These help to guide you as you fill the syringe. The inside of the barrel is considered to be a sterile environment. The numbers indicate the amount of medication you are putting in the syringe in mls, or ccs. The abbreviation “mls” stands for milliliters. The abbreviation “ccs” stands for cubic centimeters. ONE ml is the same as ONE cc. The numbers and lines on an insulin syringe indicate the units of insulin being drawn into the syringe. Insulin syringes usually have a graduated measurement in mls also, but this is in smaller or lighter type. The focus of an insulin syringe is to provide clarity regarding the number of insulin units being drawn up."
    },
    {
      "title": "Recognize the plunger.",
      "content": "Recognize the plunger. The plunger is the part of the syringe that you manipulate as you fill the syringe. The end of the plunger extends out from the bottom of the syringe, and gently glides inside the barrel. This action helps you to accurately draw up the correct amount of medication. The rubber tip of the plunger that slides inside the barrel is considered sterile. The lower part of the plunger extends from the bottom of the syringe. This is the also the part you push to deliver the medication when you give the injection."
    },
    {
      "title": "Know about the syringe tip.",
      "content": "Know about the syringe tip. The tip of the syringe is where the needle is attached. For reasons of safety and convenience, safety syringes, or all-in-one syringes, are available with the needle already attached. Using a luer-lok syringe requires attaching the needle. This type of syringe, and the separate needle, have grooves that allow for the needle to be securely attached to the tip of the syringe with a simple twisting motion."
    },
    {
      "title": "Identify the parts of the needle.",
      "content": "Identify the parts of the needle. The needle attaches to the tip of the syringe and has 3 parts. Those parts include the hub, shaft, and bevel. The hub is the part closest to the barrel where the needle connects to the syringe. The shaft is the longest part of the needle. The bevel is the very tip of the needle that comes in direct contact with the skin of the person receiving the injection. Needles are designed to have a slight slant, or bevel, on the very tip."
    },
    {
      "title": "Choose the proper syringe-needle unit.",
      "content": "Choose the proper syringe-needle unit. Many drugs that must be administered by injection are now being packaged by the manufacturers in kits that contain everything you would need, including the syringe and needle. If you need to purchase the syringe-needle combo unit separately from the medication, try to find safety syringes that will work for the medication and delivery site needed. Syringes can be purchased separately from needles, but for safety reasons this is not recommended. Even hospitals are being mandated to use safety syringe-needle combo units to avoid complications that include a greater risk of infections for the patients and needle stick injuries that may occur to the staff."
    },
    {
      "title": "Know what the numbers on the package mean.",
      "content": "Know what the numbers on the package mean. In order to select the correct syringe, it is important that you understand what you need to properly fill the syringe and give the injection. An all-in-one syringe needle unit will have 3 distinct numbers on the package labeling. One of the numbers indicates the size of the syringe barrel, such as 3cc. A second number will give the length of the needle, such as 1 inch. The third number indicates the gauge of the needle, such as 23g. Always select a syringe that holds more than you need to inject. If your medication requires that you inject 2cc, same as 2mls, for each dose, then you will want to choose a syringe that is larger, say a 3cc, or 3ml, syringe. The needle length is specific to the place where the medication needs to be delivered. Something that needs to just go under the skin would require a shorter needle, such as ½ to ¾ inch. If you need to get the medication delivered into a muscle, you will need to select a longer needle size. The size of the person receiving the injection is also something to consider. Obese people may need a longer needle to reach a muscle than people with less body fat. The gauge of the needle tells you how fat the needle is. It is actually a measure of the diameter of the hole inside the needle. Some medications are thicker and need a fatter needle to properly pass the medication through it and into the skin. Other medications can be given using a skinnier needle. The numbers that tell you the gauge of the needle are backwards. The larger numbers indicate the smaller actual diameter of the needle. Using an 18 gauge needle would allow for a thicker medication to pass through easily, but it also might hurt a little more. A 23 gauge needle has a smaller diameter for the medication to pass through. Try to select the smallest thickness, or diameter, of the needle, meaning a higher number, that will work with the medication you need to inject. Remember, the larger the number, the smaller the thickness or diameter."
    },
    {
      "title": "Learn about the types of injections.",
      "content": "Learn about the types of injections. Syringes hold medications that are intended to be given by injection. Injections can be given by 3 primary routes. [24] X Research source Subcutaneous injections are a common type of injection administered at home. Insulin is administered in a subcutaneous manner. IM, or intramuscular injections, are more complicated than giving a subcutaneous injection. This is the type of injection that requires getting the medication delivered into muscle tissue. The final route is called intravenous. This is not a common route of administration, unless someone has an indwelling venous catheter, or they are in a hospital setting. IV medication should never be administered at home unless through a port-a-cath and patient's have been trained sufficiently. This is very dangerous and if done incorrectly, can introduce bacteria into blood stream, thus causing systemic deadly infection."
    }
  ]
}