{
  "url": "https://www.wikihow.com/Fill-Out-a-Money-Order-that-Asks-for-Purchaser-Signature",
  "title": "How to Fill Out a Money Order that Asks for Purchaser Signature",
  "steps": [
    {
      "title": "Find a company that provides money orders.",
      "content": "Find a company that provides money orders. Most banks issue money orders to their account holders. They may also sell money orders to non-account holders who are willing to pay cash. [1] X Research source If you purchase a money order from a bank and don’t have an account there, they will probably charge you an expensive fee. The United State Postal Service (USPS) sells money orders. You can visit a post office branch to get a money order form. MoneyGram and Western Union are two other companies that provide money orders. You can find locations online. In some cases, your local grocery store will provide access to money orders through these two companies."
    },
    {
      "title": "Transfer a negotiable instrument.",
      "content": "Transfer a negotiable instrument. When you complete a money order and give it to the payee, you are transferring a negotiable instrument. In this case, the term “negotiable” means “transferable”. [2] X Research source Your money order has a line that says “pay to the order of”. That language is the same type of instruction you see on a check. If your money order says “pay to”, it means the same thing. Consideration is an important term for negotiable instruments. If each party gives consideration, each party is relying on the other. You may purchase a money order to pay for a product or service, for example. If that’s the case, you are paying an amount and expecting something in return. Both parties (the payor and the payee) are providing consideration."
    },
    {
      "title": "Complete the information on your money order.",
      "content": "Complete the information on your money order. Put the recipient's name on the “pay to” or “pay to the order of” line. Look for the section of the money order that asks for the purchaser or drawer’s information. Include your name and address as the payor. The purchaser or drawer is also the payor. [3] X Research source When you buy the money order, fill in the name of the person you are paying immediately. If you lose the money order, someone else can write their name in as the payee and cash the money order. The “pay to” section may also ask you to write in the recipient's address. Fill in the receipt section on the money order. Detach it and keep for your records. Some money orders have a carbon copy behind the original. Other money orders have a portion of the original form that you can detach and keep."
    },
    {
      "title": "Sign the original money order and file your copy.",
      "content": "Sign the original money order and file your copy. Look for the area on the money order that requires the payor’s signature. Your signature authorizes the financial institution to pay your money order funds to the payee. The payor is also referred to as the purchaser or the drawer. Look for any of these three terms in the required signature section on the money order. The money order will include a tracking number. You should be able to use the financial institution’s website or toll free number of track the status of your money order. You may want to confirm when the money order is cashed. If the payee loses the money order, you can use the tracking number to cancel the payment and replace the money order. You will pay a fee to replace the lost money order."
    },
    {
      "title": "Return the money order and exchange it for a new one, if you make out the money order to the wrong person.",
      "content": "Return the money order and exchange it for a new one, if you make out the money order to the wrong person. If you make some other sort of error when filling out the money order, take it back to the financial institution. You can replace the money order or ask for a refund. You may pay fees for these services. Always use a pen when filling out money orders. By using a pen, the information is more difficult to alter. Be sure you factor in the cost of the money order in your budget. Don't lose the money order: treat it just like cash. The process of getting a money order cancelled or replaced is complex and expensive."
    }
  ]
}