{
  "url": "https://www.wikihow.com/Do-a-Dip-Powder-Manicure",
  "title": "How to Do a Dip Powder Manicure",
  "steps": [
    {
      "title": "Use polish remover as well as a cuticle pusher.",
      "content": "Use polish remover as well as a cuticle pusher. If you have polish on your nails, remove it with non-acetone nail polish remover on a lint-free pad. Use a cuticle pusher to gently nudge your cuticles slightly back. Gently remove any excess cuticle sticking up with a cuticle trimmer or scraper. [4] X Research source This will allow new nail growth to show so that your manicure will last longer before needing a fill."
    },
    {
      "title": "Buff the top surfaces of the nails.",
      "content": "Buff the top surfaces of the nails. Whether natural, acrylic or gel, smooth the surfaces of your nail manually with a nail file. Use a 180 grit file or block, or a natural nail stone. Brush away the grit from filing with a nail brush or makeup powder brush. [5] X Research source Pay extra attention to buffing the grooves and the cuticle area."
    },
    {
      "title": "File away any problematic areas.",
      "content": "File away any problematic areas. Examine the sides of your nails for any loose or damaged edges. Also look for any lifting if you have a previous dip manicure you’re filling. Use a coarse nail file (100 or 180 grit) on any such areas. [6] X Research source If you don’t already have tips on and you want to add them to lengthen your nails, trim your natural nails down to short length. Use the nail file to smooth the edges."
    },
    {
      "title": "Sanitize your nails with alcohol.",
      "content": "Sanitize your nails with alcohol. Dampen a paper towel or lint-free pad with alcohol or nail sanitizer. You can use an antiseptic spray, or a sanitizer in a pourable container. Rub the moistened towel over your nails, and your fingers – from the closest knuckle to your cuticles, down towards your nails. [7] X Research source This cleans and dehydrates the surface of your nails to prepare them for a dip manicure. You don’t want to seal in any bacteria or grime."
    },
    {
      "title": "Find the right-sized tips.",
      "content": "Find the right-sized tips. If you want to extend the length of your nails, find a tip for each nail that covers no greater than a third of your nail bed. Each tip should reach across the whole width of your nail, from nail groove to nail groove, without overlapping onto your skin. [8] X Research source Coat the wells of the tips with tip resin. Hold each one gently but firmly to the tip of the nail at a 45 degree angle for twenty seconds. [9] X Research source If you can’t find a nail tip that is the right size, you can use a nail file to make slight adjustments so that it will fit securely. Pinch the sides of the tips for a few seconds to adhere the tips to curvature of your nail edges. Try not to get resin on your fingers."
    },
    {
      "title": "Trim and file the tips.",
      "content": "Trim and file the tips. File the edges of the tips all the way across. Buff the top surfaces of the tips to remove their shine. Then buff the nails all over."
    },
    {
      "title": "Paint on the bonder.",
      "content": "Paint on the bonder. Follow the steps in this method for each nail, one at a time. Apply it in small strokes, starting about 1/16” away from your cuticles. Spread it out so that it doesn’t well up near the cuticle area. [10] X Research source Let it sit for one minute. [11] X Research source"
    },
    {
      "title": "Brush resin onto your nails.",
      "content": "Brush resin onto your nails. Move slowly, and apply it evenly. [12] X Research source Resin should be dotted on with the belly of the brush applicator, rather than applied in strokes like nail polish. [13] X Research source Try to apply the resin as evenly and neatly as possible. Focus on creating a clean edge just above the cuticle, since this will be what your powder adheres to. If you’re only doing a fill, and it has been two weeks since your last dip manicure, apply resin to your desired thickness – for instance, three to four coats. No follow-up with powder is necessary. [14] X Research source If you’re doing a manicure to your natural nails or it has been three or more weeks since your last dip manicure, apply one coat of resin only at this point."
    },
    {
      "title": "Dip your finger into the container of clear nail powder.",
      "content": "Dip your finger into the container of clear nail powder. Shake the closed container of powder well first. Open the container, then use a nail stick or pusher to mix the powder. Push your finger forward within the container and roll your finger gently. Keep your finger in the powder for five seconds. Remove your finger and tap the edge of the pot. [15] X Research source Then, with your other hand, tap the finger you just dipped, to shake excess powder off your finger and back into the container. [16] X Research source Once the nail is dry, use a nail brush to remove the rest of the extra powder over a paper towel. [17] X Research source Do not use a colored powder at this point. If you want to add a color, that will come after applying more resin."
    },
    {
      "title": "Apply more resin and powder.",
      "content": "Apply more resin and powder. Apply a layer of resin over the full nail, including the tips. Paint it on slowly and evenly. If you want to use colored powder, now’s the time to do it! Dip your finger into nail powder again, then remove any excess powder. Add a third and final application of resin. [18] X Research source You can repeat this step once more to achieve a slightly thicker and stronger manicure."
    },
    {
      "title": "Brush on activator.",
      "content": "Brush on activator. Apply it in strokes as you would regular nail polish . Allow it to sit for five seconds on the nails. Apply a second coat, and allow that to sit for five seconds as well. [19] X Research source"
    },
    {
      "title": "File the nail edges to dull and shape them.",
      "content": "File the nail edges to dull and shape them. Use a soft-grid file on the exposed edges and sides of the nails. [20] X Research source"
    },
    {
      "title": "Finish with a top coat.",
      "content": "Finish with a top coat. Make sure it is a top coat meant for acrylic nails. Keep your fingers sedentary and allow your nails to air-dry for two minutes. Gently rub cuticle oil into the skin surrounding your fingernails. [21] X Research source Apply the top coat as you would normal nail polish."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. Make sure that your nails are completely dry first. Use warm water, hand soap and a nail brush. Make sure to get around and underneath the tips of your nails. Pat your nails dry with a towel."
    },
    {
      "title": "Maintain your manicure.",
      "content": "Maintain your manicure. Follow tips to prolong the life of your manicure. Your manicure can last three to four weeks before needing a fill. However, you may notice new nail growth near the cuticle area and wish to do the fill as early as two weeks after your dip manicure. [22] X Research source If you apply colored polish on top of your manicure, don’t get it on your cuticles. This can cause chipping and lifting of the polish. Also, mix the polish by rolling it between your hands instead of shaking it, so that air bubbles don’t promote chipping. If you use a fan to dry your nails, opt for cool air instead of warm air. Use a blow dryer on the cool setting. Reapply a clear top coat every few days to deter chipping. Massage cuticle oil onto your nails every day, if possible. Use mild soap to wash your hands instead of applying hand sanitizer. Hand sanitizer is strong and dehydrating, and can eat away at your protective top coat."
    }
  ]
}