{
  "url": "https://www.wikihow.com/Fall-Asleep-when-You-Can%27t",
  "title": "How to Fall Asleep when You Can't",
  "steps": [
    {
      "title": "Breathing exercises can help you relax.",
      "content": "Breathing exercises can help you relax. Take in a long, slow breath through your nose over 4 counts, hold it for 4 counts, then exhale slowly through your mouth for 4 counts. Wait 4 more counts before you start the cycle again. By slowing your breathing, you can help regulate your heart rate and get your whole body ready for sleep. In fact, taking deep breaths may help you fall asleep faster and sleep more soundly. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Box breathing gets its name from the 4 counts, since a box has 4 walls. But you can start with 2-3 counts if 4 feels too long. You can also try deep breathing exercises like counting your breaths or breathing in and out for a certain number of counts. [2] X Research source"
    },
    {
      "title": "Close your eyes and imagine yourself on vacation.",
      "content": "Close your eyes and imagine yourself on vacation. Pick a place you’ve actually visited, where you felt deeply relaxed and at peace. Imagine yourself standing up and walking around, engaging all five of your senses and noticing the small details of the environment. [3] X Research source You can even use a guided visualization recording to talk you through imagining yourself on a beautiful beach or in a peaceful meadow."
    },
    {
      "title": "Research shows that a pressure point on your wrist might help insomnia.",
      "content": "Research shows that a pressure point on your wrist might help insomnia. Find the hollow-feeling space on your wrist, just below your palm on the side of your pinky finger. Apply firm pressure for several minutes using the thumb from your opposite hand. When you feel calm and at peace, release the pressure. [4] X Research source This pressure point is called the Shen Men point or “spirit gate.”"
    },
    {
      "title": "Focus on your physical senses to stay in the present.",
      "content": "Focus on your physical senses to stay in the present. Mindfulness is a way to keep from getting lost in your thoughts, so when you're trying to sleep, make a deliberate effort to keep your attention on what's actually around you. Notice things like the soothing feeling of your blankets against your skin, the cool feeling of the air on your face, and the gentle hum of your fan. This can help clear your mind and allow you to slip into sleep. [5] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 8 January 2021. Try body scan meditation, which helps you be more aware of the sensations in your body. Start by focusing on what you can feel in your toes and feet, for instance, then let them relax. Next, move up into your legs, your hips, your stomach, and so on. [6] X Research source For a guided body scan, try this one recommended by MIT: https://medical.mit.edu/sites/default/files/body_scan.mp3 ."
    },
    {
      "title": "Turn your attention to just one specific thought or mantra.",
      "content": "Turn your attention to just one specific thought or mantra. Sometimes it's hard to sleep because you just have too many thoughts spinning around in your head. If that's the case, think up something comforting to focus on. You might simply pick a word to repeat to yourself—like \"calm\" or \"peaceful\"—or you might choose a phrase, like, \"You're comfortable and safe.\" [7] X Research source It's normal for your mind to wander sometimes while you're trying to fall asleep. Just keep bringing your attention back to your focus phrase or image until you drift to sleep."
    },
    {
      "title": "This trick can help you release tension in your body.",
      "content": "This trick can help you release tension in your body. Next time you're lying in bed awake, stretch your legs out straight in front of you, then flex your foot and try to stretch your toes back toward your face. Hold them like that while you count to 10, then relax your foot and count to 10 again. Do this for a total of 10 times. [8] X Research source Tensing and releasing your toes can make you feel more relaxed, which might make it easier to fall asleep. Also, focusing on the process can help you clear your mind if you're feeling worried or stressed. For a whole-body experience, try progressive muscle relaxation. After you tense your toes, move up into your legs, then your hips and buttocks, then your stomach, chest, shoulders, arms, hands, and face. This might help you relax enough to drift off to sleep. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Do something relaxing for a few minutes.",
      "content": "Do something relaxing for a few minutes. Tossing and turning in bed is more than just frustrating—it can actually start to trick your mind into thinking you're supposed to be awake when you're in bed. Instead, leave the room and spend about 30 minutes reading or listening to quiet music. When you feel sleepy again, go back to bed. [10] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source It's okay to watch something calming on TV, like a nature show, but don't put on anything too intense—and definitely don't put on a new episode of that show you've been binge-watching! Similarly, don't grab a novel that will keep you gripped with suspense all night. It's probably better to go with a biography or a long-form essay instead. If you can't sleep because you have too much on your plate, try making a to-do list for the next day to help put your mind at ease. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "The change in temperature might help you sleep.",
      "content": "The change in temperature might help you sleep. You probably already know that a nice, warm bath or shower is super relaxing. However, that's not the only reason it can help you sleep. The warm water will increase your body temperature slightly. When you get out, your temperature will drop, mimicking the natural process that happens when the sun goes down. That can help you feel drowsier, which may help you fall asleep. [12] X Research source"
    },
    {
      "title": "A warm drink can help you feel more relaxed.",
      "content": "A warm drink can help you feel more relaxed. Make a cup of soothing herbal tea, like chamomile, or gently warm a cup of milk or your favorite milk substitute. The routine of heating the beverage and sipping it slowly can be really comforting, which can help you unwind. Also, it might be easier to drift off if you have something in your belly. [13] X Research source In addition to being soothing, there's some evidence that chamomile might actually act as a mild sedative—so it may be especially helpful when you're trying to sleep. [14] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Talk to your doctor about whether these are good options.",
      "content": "Talk to your doctor about whether these are good options. Melatonin is a naturally occurring hormone that helps control your sleep/wake cycle. It might help you sleep if you take 1-3 mg about 2 hours before bed. However, you shouldn't take it if you're pregnant or breastfeeding, or if you have high blood pressure, an autoimmune disorder, experience seizures, or are diabetic. If it doesn't work, stop taking it after 1-2 weeks—but if it's effective, you can take it for up to 2 months. [15] X Research source Dietary magnesium has been shown to help improve sleep in elderly people with insomnia, so it may be helpful if you have long-term trouble sleeping. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source However, it's important to talk to your doctor about a safe dose for you. If you take too much, it can cause stomach issues like nausea and diarrhea, and it can also interact with some medications, like antibiotics."
    },
    {
      "title": "These substances can keep you awake.",
      "content": "These substances can keep you awake. Nicotine and caffeine are both stimulants that stay in your system for a long time—which is why smoking or drinking coffee too late in the day can result in trouble sleeping. Try to avoid coffee past early afternoon and if you smoke, make an effort to quit . Also, while alcohol can cause you to feel sleepy, it can keep you from sleeping soundly, so don't drink more than 1-2 drinks a night if you want better quality sleep. [17] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source"
    },
    {
      "title": "It's really important to stick to a consistent sleep schedule.",
      "content": "It's really important to stick to a consistent sleep schedule. That way, your body will know when it's time to shut down for sleep, and when it's time to wake up. In fact, you should try to go to bed and wake up at about the same time every day, including on your off days. [18] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 8 January 2021. [19] X Research source Make a habit of winding down for at least 30-60 minutes before you go to bed. Avoid using electronic devices, dim the lights, and do something relaxing like reading a book, doing yoga, or taking a bath. [20] X Research source Avoid big meals or spicy food right before bed—these can disrupt your sleep. Try not to take naps during the day, even if you didn't sleep well the night before. Naps can make it harder to sleep the next night. [21] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source"
    },
    {
      "title": "Being comfortable will help you doze off.",
      "content": "Being comfortable will help you doze off. Keep your room dark and cool—use fans and light-blocking curtains, if you need to. Try to block out any loud or disruptive noises, too. However, some people have a hard time sleeping when their room is too quiet, so you might be more comfortable if you have a fan, white noise machine, or soft music in the room with you. [22] X Research source It might help to diffuse a calming scent like lavender in your bedroom. [23] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Get soft, cool bedding—cotton is a great option because it's breathable. If your pillow is lumpy or flat, replace it! [24] X Research source"
    },
    {
      "title": "Do your best to keep your waking life out of your bedroom.",
      "content": "Do your best to keep your waking life out of your bedroom. That space should really only be for sleeping or romance. If you have to use your room for daytime activities like work, try to create a separate zone for that, like a desk that's turned away from your bed. That way, when you get in bed, your brain won't shift straight to spreadsheets and invoices. [25] X Research source If you have a TV in your room, sit in a chair or on a beanbag when you watch it, and turn it off before you go to bed."
    },
    {
      "title": "Physical activity can make it easier to sleep at night.",
      "content": "Physical activity can make it easier to sleep at night. Even just a few minutes of exercise during the day can help your body release tension. [26] X Research source Just be sure not to exercise within about 3 hours of bed—the adrenaline boost might make it harder to doze off. [27] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source Yoga is a great way to get physical activity while also decreasing stress, so it may be a good option if you're struggling with insomnia. [28] X Expert Source Jeremy Bartz, PhD Clinical Psychologist Expert Interview. 8 January 2021."
    },
    {
      "title": "When you're stressed out, it's hard to sleep.",
      "content": "When you're stressed out, it's hard to sleep. If you can, try to reduce your overall stress level—take breaks throughout the day, use schedules and routines to help you stay organized, and learn to say no if you're feeling overwhelmed. However, you probably can't get rid of all of the stress in your life, so learning to manage it better is essential to helping you get a good night's sleep. [29] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Everybody's stress relief is different—you might prefer doing yoga, meditating, going for a run, gardening, baking, playing sports, or talking with a friend. There's no wrong answer, as long as you choose something that's mentally and physically healthy for you!"
    },
    {
      "title": "They may be able to help you determine why you can't sleep.",
      "content": "They may be able to help you determine why you can't sleep. If you've been struggling with insomnia and it's starting to affect your daily life, it's a good idea to talk to your doctor. You could have an underlying issue like sleep apnea or restless leg syndrome, or you might be taking a medication that's interfering with your sleep. They may even refer you to a sleep specialist to learn more about what's going on. [30] X Research source"
    }
  ]
}