{
  "url": "https://www.wikihow.com/Disney-Trivia",
  "title": "200+ Disney Trivia Questions to Challenge Fans of All Ages",
  "steps": [
    {
      "title": "Test your knowledge of beloved Disney films across the decades.",
      "content": "Test your knowledge of beloved Disney films across the decades. With the release of their first full-length animated feature, Snow White and the Seven Dwarfs , in 1937, Disney changed cinema as we know it. Their heartwarming animated and live-action movies have entertained generations. If you’ve been binge-watching Disney+ lately, you should be prepared to tackle this trivia category with ease. What are the names of Cinderella’s two stepsisters? Answer: Anastasia and Drizella. [1] X Research source What country does Beauty and the Beast take place in? Answer: France. What item does Ursula use to capture Ariel’s voice in The Little Mermaid ? Answer: A shell necklace. Who framed Roger Rabbit in Who Framed Roger Rabbit ? Answer: Judge Doom. In The Jungle Book , what kind of animal is King Louis? Answer: An orangutan. Who played Mary Poppins in Mary Poppins Returns ? Answer: Emily Blunt. What name did Mulan go by while pretending to be a man in Mulan (1998)? Answer: Ping. What’s the name of the villain in The Princess and the Frog ? Answer: Dr. Facilier, also known as “the Shadow Man.” What three things do you need to fly in Peter Pan ? Answer: Faith, trust, and pixie dust. How many sisters does Ariel have in The Little Mermaid ? Answer: She has six. (Bonus points if you can name them all: Attina, Alana, Adella, Aquata, Arista, and Andrina.) Which Disney song spent the most time on top of the Billboard Hot 100 chart as of 2025? Encanto ’s “We Don’t Talk About Bruno,” which held the number one spot for five weeks straight. Where does Big Hero 6 take place? Answer: San Fransokyo, a mash-up of real cities San Francisco and Tokyo. Which actress played Elizabeth Swann in the Pirates of the Caribbean franchise? Answer: Keira Knightley. When did the original The Lion King movie premiere? Answer: 1994. Who directed the live-action adaptation of Alice in Wonderland (2010)? Answer: Tim Burton. What are the names of the seven dwarfs in Snow White ? Answer: Dopey, Grumpy, Bashful, Happy, Doc, Sleepy, and Sneezy. What’s the name of the sorcerer in Fantasia ? Answer: Yen Sid—aka “Disney” spelled backward. Which Disney movie features several Elvis Presley songs? Answer: Lilo & Stitch . Who plays Professor Brainard in Flubber ? Answer: Robin Williams. What sport does the Queen of Hearts play in Alice in Wonderland ? Answer: Croquet. In The Little Mermaid , what are the names of Ursula’s two eel henchmen? Answer: Flotsam and Jetsam. What’s the title of the villain song in The Hunchback of Notre Dame ? Answer: “Hellfire,” sung by Judge Claude Frollo. Which Disney movie villain is based on a real historical figure? Answer: Governor Ratcliffe in Pocahontas . What’s the name of the game ruled over by Kind Candy in Wreck-It Ralph ? Answer: Sugar Rush. What is Yzma’s job at the palace in The Emperor’s New Groove ? Answer: She’s an advisor to the Emperor. In Aladdin , what’s the name of Jafar’s animal sidekick? Answer: Iago, a not-so-subtle reference to Shakespeare’s Othello . Rapunzel from Tangled makes a cameo in which other Disney film? Answer: Frozen —she can be seen walking into the castle in the background before the coronation. What year was Moana released? Answer: 2016. Who played the lovable chimney sweep Bert in Mary Poppins ? Answer: Dick Van Dyke."
    },
    {
      "title": "Quiz young Disney fans with simple questions about the movies.",
      "content": "Quiz young Disney fans with simple questions about the movies. Want to entertain your kids while you’re waiting in line at a Disney park? Trivia is the perfect way to keep them engaged. These easy Disney trivia questions are also great for including your littlest Disney fans in game night, since they focus on simple facts like character names and plot events. What’s the name of Ariel’s best friend and sidekick in The Little Mermaid ? Answer: Flounder. [2] X Research source What color is Belle’s ball gown when she dances with the Beast in the library? Answer: It’s yellow. Her regular dress is blue with a white apron. Which Disney princess sings “A Whole New World”? Answer: Princess Jasmine. What’s the name of Wendy’s dog in Peter Pan ? Answer: Nana. Who is Simba’s father in The Lion King ? Answer: Mufasa. Who is Mickey Mouse’s longtime girlfriend? Answer: Minnie Mouse. What type of animal is Dumbo? Answer: An elephant. Which Disney prince is the only one to star in his own movie? Answer: Aladdin. What is Tiana’s dream in The Princess and the Frog ? Answer: To open her own restaurant. Which fruit did the evil queen give Snow White to poison her? Answer: An apple. Who is Elsa’s snowman sidekick in Frozen ? Answer: Olaf. Who sings the song “How Far I’ll Go”? Answer: Moana. What does Mary Poppins say helps the medicine go down? Answer: A spoonful of sugar. Which animal ate Captain Hook’s hand, forcing him to wear a hook? Answer: A crocodile. In The Lion King , what does “hakuna matata” mean? Answer: It means “no worries.” Where does Winnie the Pooh live? Answer: In The Hundred Acre Wood. What kind of animal is the title character in Robin Hood ? Answer: A fox. What color is Stitch in Lilo & Stitch ? Answer: Blue. How does Rapunzel activate her magic glowing hair powers in Tangled ? Answer: She sings. Who are the two sisters in Frozen ? Answer: Anna and Elsa. What does Cinderella leave behind at the ball after dancing with the prince? Answer: Her shoe (a glass slipper). What does Vanellope von Schweetz like to do in Wreck-It Ralph ? Answer: She enjoys racing. Who trains Hercules to be a hero? Answer: Phil. His full name is Philoctetes. What does Rapunzel leave her tower to see on her birthday? Answer: The floating lanterns. What song does Roger sing in 101 Dalmatians ? Hint: It’s named after a character in the movie. Answer: “Cruella De Vil.” What’s the name of the dragon in Mulan ? Answer: Mushu. What object does Moana need to return to Te Fiti to save her island? Answer: The heart of Te Fiti. Who is Pinocchio’s father and his creator? Answer: Geppetto. What does Ariel call a fork in The Little Mermaid ? Answer: A dinglehopper. What type of animal is Bambi in Bambi ? Answer: A white-tailed deer. What meal do Lady and Tramp share in Lady and the Tramp ? Answer: Spaghetti and meatballs."
    },
    {
      "title": "See if you’re a true Disney superfan with this challenging trivia.",
      "content": "See if you’re a true Disney superfan with this challenging trivia. Think you know everything about the happiest company on Earth? Put your lore knowledge to the test with hard Disney trivia questions that rely on recalling obscure facts, minor details, and easter eggs most fans didn’t catch. What is Goofy’s son’s full name? Answer: Maximillian Goof. [3] X Research source Which Disney title character never speaks? Answer: Dumbo. What was the first animated sequel to a Disney film? Answer: The Rescuers Down Under (1990). How many fingers does Mickey Mouse have? Answer: Eight. Which Disney animated movie was the first to receive a PG rating? Answer: The Black Cauldron . What architect designed the Walt Disney Concert Hall in Los Angeles? Answer: Frank Gehry. [4] X Research source What short film served as Mickey Mouse’s first sound cartoon? Steamboat Willie . What is Madame Medusa’s job in The Rescuers ? Answer: She owns a pawn shop. Who voiced Cruella de Vil in 101 Dalmatians (1961)? Answer: Betty Lou Gerson. What is Princess Mia’s full name in The Princess Diaries ? Answer: Amelia Mignonette Thermopolis Renaldi. What does Lilo put in Stitch’s bottle in Lilo & Stitch ? Answer: Coffee. Which actor plays Gaston in the live-action remake of Beauty and the Beast ? Answer: Luke Evans. What’s the name of Rapunzel’s pet lizard in Tangled ? Answer: Pascal. Which famous TV showrunner co-wrote The Princess Diaries 2 ? Answer: Shonda Rhimes. How many brothers does Frozen ’s Prince Hans have? Answer: 12. When did The Little Mermaid television series premiere? Answer: 1992. How long (in feet) is Rapunzel’s hair in Tangled ? Answer: 70 feet long. Who performs the song “Everybody Wants to Be a Cat” in Lady and the Tramp ? Answer: Scatman Crothers. What’s the name of the sequel to Honey, I Shrunk the Kids ? Answer: Honey, I Blew Up the Kid . When Cinderella lost her glass slipper, which foot did it fall off of? Answer: Her left foot. Which of Angelina Jolie’s children appears in a scene in Maleficent ? Answer: Vivienne Jolie. Which live-action Disney remake was the first to receive a PG-13 rating? Answer: Mulan . What was the first animated movie to be nominated for Best Picture at the Oscars? Answer: Beauty and the Beast . Which three Disney movies are based on a novel by Robert Louis Stevenson? Answer: Treasure Island , Kidnapped , and Treasure Planet Which two actors voice the titular characters, Copper and Tod, in The Fox and the Hound ? Answer: Kurt Russell and Mickey Rooney. What is the last chore Lady Tremaine gives Cinderella? Answer: To give the cat a bath. What’s the name of Ariel and Prince Eric’s daughter in The Little Mermaid II: Return to the Sea ? Answer: Princess Melody. Where does Frollo kill Quasimodo’s mother in The Hunchback of Notre Dame ? Answer: In front of Notre Dame Cathedral. What is Maleficent’s only weakness? Answer: Iron."
    },
    {
      "title": "Refresh your knowledge of Walt Disney and his company’s history.",
      "content": "Refresh your knowledge of Walt Disney and his company’s history. The man behind the mouse lived an interesting life, driving creative innovation at the Walt Disney Company while creating hours of childhood magic. Use this trivia to test your familiarity with the life of Walt Disney, as well as key milestones in his company’s history. What was the last park attraction Walt Disney personally supervised before his passing? Answer: The Pirates of the Caribbean ride at Disneyland in Anaheim. What name did Walt Disney originally want to give to Mickey Mouse? Answer: Mortimer. [5] X Research source His wife Lillian talked him out of it. What’s the name of Walt Disney’s private island? Answer: Castaway Cay. In what city was Walt Disney born? Answer: Chicago, Illinois. [6] X Research source Which Disney CEO retired, then returned to the role? Answer: Bob Iger. Who created Mickey Mouse (2 people)? Answer: Walt Disney and Ub Iwerks. Which NFL quarterback first said “I’m going to Disney World”? Answer: Phil Simms. [7] X Research source What did Walt Disney want to build in Mineral King Valley? Answer: A ski resort. Who was Walt Disney’s business partner and brother? Answer: Roy Disney. Which major broadcast network does Disney own? Answer: ABC. Where did Walt Disney conceive the idea for Disneyland? Answer: The Griffith Park Merry-Go-Round carousel in Los Angeles. What was the name of Walt Disney’s star original cartoon character before he made Mickey Mouse? Answer: Oswald the Lucky Rabbit. Who voiced Mickey Mouse from 1928–1947? Answer: Walt Disney himself. How many Oscars has Disney Pictures received as of 2025? Answer: 151. 32 were won by Walt Disney personally. [8] X Research source In what year did Disney first re-release Snow White and the Seven Dwarfs in theaters? Answer: 1944. What professional sports franchise did the Walt Disney Company found in the ’90s? Answer: The Mighty Ducks of Anaheim, an ice hockey team that competes in the National Hockey League. (They changed their name to the Anaheim Ducks in 2006). What was the original name of The Walt Disney Company? Answer: The Disney Brothers Cartoon Studio. [9] X Research source What were Walt Disney’s earliest films? Answer: The “Alice Comedies,” a series of live-action shorts about a girl who lives in a cartoon world. In 1964, Disney showed four exhibits at what popular event? Answer: The New York World’s Fair. In what year did the first Disney store open? Answer: 1987, in Glendale, California. What football game did Disneyland sponsor in the early ‘90s? Answer: The Pigskin Classic at Anaheim Stadium. When did the wildly successful The Lion King Broadway adaptation premiere? Answer: 1997. When did Walt and his brother Roy Disney found (incorporate) CalArts, also known as the California Institute of the Arts? Answer: 1961. [10] X Research source What’s the title of the first Silly Symphony cartoon released in 1929? Answer: “The Skeleton Dance.” In what year was Walt Disney born? Answer: 1901. Which song was supposedly Walt Disney’s favorite? Hint: It’s from Mary Poppins . Answer: “Feed the Birds.” [11] X Research source How many feature-length films were released by The Walt Disney Company during Walt Disney’s lifetime? Answer: 81. [12] X Research source When did Disney acquire Lucasfilm, gaining the rights to the Star Wars franchise? Answer: 2012. What year did Disney lose copyright protection for the earliest version of Mickey Mouse? Answer: 2024. In what creative way did Walt Disney support the U.S. government during WWII? Answer: They created animated propaganda films. [13] X Research source"
    },
    {
      "title": "Find out how well you know Pixar films and their characters.",
      "content": "Find out how well you know Pixar films and their characters. Disney acquired Pixar in 2006, and the two studios have been a dream team ever since. Among Pixar’s many hits are tear-jerking classics like Wall-E and Up and fun family flicks like Toy Story , Ratatouille , and The Incredibles . See if your knowledge of Disney’s sister studio is up to snuff with these creative Pixar trivia questions. Which real-life artist appears as a character in Coco ? Answer: Frida Kahlo. [14] X Research source What kind of animal is Judy Hopps in Zootopia ? Answer: A rabbit. What are the five emotions inside Riley’s head in the first Inside Out film? Answer: Joy, sadness, anger, disgust, and fear. What does WALL-E stand for? Answer: Waste Allocation Load Lifter: Earth Class. Who are the antagonists in A Bug’s Life ? Answer: The grasshoppers. What’s the name of Joe’s mentor in Soul ? Answer: 22. What’s the address of the dentist’s office where Nemo is taken in Finding Nemo ? Answer: P. Sherman, 42 Wallaby Way, Sydney. What number is Lightning McQueen in Cars ? Answer: 95. In Toy Story 3 , which fruit does Lotso the bear smell like? Answer: Strawberries. In Up , what was Carl’s job before he retired? Answer: He sold balloons. What is Andy’s last name in the Toy Story franchise? Answer: Davis. What’s the name of Remy’s hero who appears to him as a ghost throughout Ratatouille ? Answer: Auguste Gusteau. In Monsters, Inc. , what is Boo’s real name? Answer: Mary. What are Ian and Barley looking for in Onward ? Answer: A Phoenix Gem. What fraternity do Mike and Sulley join in Monsters University ? Answer: Oozma Kappa. What type of fish is Nemo from Finding Nemo ? Answer: A clownfish. What year did Luca premiere? Answer: 2021. What were the names of the red panda statues outside Mei’s family’s temple in Turning Red ? Answer: Bart and Lisa. Who voiced the titular character in Luca ? Answer: Jacob Tremblay. What’s the name of Woody’s love interest in Toy Story ? Answer: Bo Peep. What animal does Merida actually curse her mother to turn into in Brave ? Answer: A bear. Which character does Samuel L. Jackson voice in The Incredibles ? Answer: Frozone, aka Lucius Best. Who composed the score for Pixar’s Up ? Answer: Michael Giacchino. What is WALL-E’s favorite movie in Wall-E ? Answer: Hello, Dolly! What sport does Riley play in Inside Out and Inside Out 2 ? Answer: Hockey. What series of letters and numbers are hidden in every Pixar film? Answer: A113, pronounced A-One-Thirteen. It’s a reference to a classroom at the California Institute of the Arts where many Pixar animators studied. What year was the first sequel to Cars , Cars 2 , released? Answer: 2011. [15] X Research source What’s Buzz Lightyear’s famous catchphrase? Answer: “To infinity and beyond.” Who voices Dory in Finding Nemo and Finding Dory ? Answer: Ellen DeGeneres."
    },
    {
      "title": "Test yourself on fun facts about Disney’s 12 theme parks.",
      "content": "Test yourself on fun facts about Disney’s 12 theme parks. That’s right—Disney has 12 theme parks at its 6 resorts around the globe. Even if you haven’t been to them all, you’re bound to know a few fun facts (and maybe even some of the parks' well-kept secrets !) and learn even more trivia about the happiest place(s) on Earth, from the original Anaheim park to the majestic Shanghai Disneyland. What’s the name of the castle at Disneyland in California? Answer: Sleeping Beauty Castle. [16] X Research source What was the original Dole Whip flavor? Answer: Pineapple. What was the first Disney park established outside of the U.S.? Answer: Tokyo Disneyland in Japan. [17] X Research source In what year did Walt Disney World open? Answer: 1971. Where is Walt Disney’s secret apartment in Disneyland? Answer: Above the first station on Main Street. What does EPCOT stand for? Answer: Experimental Prototype Community of Tomorrow. What’s the most popular Disneyland souvenir? Answer: Mouse ears. Which Disney attraction was the first to use animatronics? Answer: The Enchanted Tiki Room in Disneyland. [18] X Research source On what day did Animal Kingdom open? Answer: Earth Day, April 22, 1998. What’s the name of the Disney Parks’ private dining club? Answer: Club 33. Where are the six Disney resorts? Answer: 1. Anaheim, California. 2. Orlando, Florida. 3. Chiba, Japan. 4. Marne-la-Vallée, France. 5. Hong Kong. 6. Shanghai, China. [19] X Research source What’s the motto for the It’s A Small World attraction? Answer: “The Happiest Cruise That Ever Sailed.” How many theme parks are at the Walt Disney World Resort in Orlando? Answer: 4. Animal Kingdom, EPCOT, Magic Kingdom, and Hollywood Studios. Which ride appears at every Disney theme park? Answer: Dumbo the Flying Elephant. How much did it cost to buy a ticket to Walt Disney World on opening day? Answer: $3.50. Which fictional planet are guests taken to on the Star Wars: Galaxy’s Edge ride? Answer: Batuu. What was the original name of Disneyland Paris? Answer: Euro Disney. What candy do they NOT sell at Disney parks because it’s difficult to clean up? Answer: Chewing gum. What’s the name of the castle in Shanghai Disneyland? Answer: The Enchanted Storybook Castle. About how much did it cost to construct Magic Kingdom at Disney World Resort? Answer: $400 million. What’s the name for the subtle Mickey Mouse silhouettes that appear all around Disney parks? Answer: Hidden Mickeys. What series is Disneyland’s Tower of Terror ride based on? Answer: The Twilight Zone . How tall is Cinderella’s Castle in Walt Disney World’s Magic Kingdom? Answer: 189 feet (58 m). On what theme park ride are guests given motion sickness bags? Answer: Mission: SPACE. Which part of Magic Kingdom has no bathrooms? Answer: Liberty Square. How many ghosts inhabit The Haunted Mansion at Walt Disney World? Answer: 999. [20] X Research source Which Disney park doesn’t have an It’s a Small World ride? Answer: Shanghai Disneyland. When did Disneyland begin operating 365 days a year? Answer: 1986. Before that, it was closed on Mondays and Tuesdays. What’s the French name of the Ratatouille -themed ride at Disneyland Paris? Answer: L'Aventure Totalement Toquée de Rémy , which translates to Remy’s Totally Zany Adventure. The ride also appears at Walt Disney World."
    },
    {
      "title": "Revisit Disney Channel’s hit shows from the ‘90s to now.",
      "content": "Revisit Disney Channel’s hit shows from the ‘90s to now. While Disney is perhaps most famous for its movies and parks, you can’t overlook the company’s epic TV shows and Disney Channel Original Movies (aka DCOMs). The Disney Channel not only gave you your favorite programs to watch after school, but it also launched many a future star—from Miley Cyrus to Zendaya. Use these trivia questions to refresh your memory of the Disney Channel’s greatest hits. What are the names of Raven’s best friends on That’s So Raven ? Answer: Eddie and Chelsea. Who is the oldest Russo child in Wizards of Waverly Place ? Answer: Justin. Alex is the middle child, while Max is the youngest. Who plays Lily Truscott in the Hannah Montana series? Answer: Emily Osment. What song is sung at the end of each episode of Bear in the Big Blue House ? Answer: “The Goodbye Song.” What’s the name of the dog in Dog with a Blog ? Answer: Stan. Where is Jessica Olson from in Starstruck ? Answer: Kalamazoo, Michigan. Which actresses played the four Cheetah Girls in the popular musical DCOMs? Answer: Raven-Symoné, Adrienne Bailon, Kiely Williams, and Sabrina Bryan. Which pop singer was a main cast member on Girl Meets World ? Answer: Sabrina Carpenter. What’s the name of the school guidance counselor on Fish Hooks ? Answer: Ms. Lips. What is Isabella’s catchphrase on Phineas and Ferb ? Answer: “Whatcha doin’?” Which Disney Channel series features a restaurant called Bueno Nacho? Answer: Kim Possible . What is Mr. Moseby’s first name in The Suite Life of Zack and Cody ? Answer: Marion. Who does Lizzie McGuire have a crush on throughout her titular series? Answer: Ethan Craft. Which Disney Channel series featured a character named Deuce Martinez? Answer: Shake It Up . What’s the name of the Disney Channel series where Zendaya plays a teenage spy? Answer: K.C. Undercover . Where did they film the High School Musical movies set in Albuquerque, New Mexico? Answer: Salt Lake City, Utah. What’s the name of the new baby that joins the Duncan family in season 3 of Good Luck Charlie ? Answer: Toby. What actor played Louis Stevens on Even Stevens ? Answer: Shia LaBeouf. What was the first Disney Channel Original Movie, released in 1997? Answer: Under Wraps . Which Disney Channel series starred Debby Ryan as a small town girl who becomes a nanny in New York City? Answer: Jessie . In the show A.N.T. Farm , what does A.N.T. stand for? Answer: The Advanced Natural Talent program. Which Lemonade Mouth actress went on to play a live-action Disney princess? Answer: Naomi Scott. She played Jasmine in Aladdin (2019). What’s the name of Rory and Erica’s favorite band in My Babysitter’s A Vampire ? Answer: Single Tear. Who is Mickey’s helpful assistant in Mickey Mouse Clubhouse ? Answer: Toodles. In Amphibia , what is Marcy’s favorite game? Answer: Vagabondia Chronicles. In Gravity Falls , what classic combo do Dipper and Mabel dress up as for Summerween? Answer: Peanut butter and jelly. What’s the title of the 2011 Disney XD series about a group of teenagers who do karate? Answer: Kickin’ It . What’s the name of the theme song for Austin & Ally ? Answer: “Can’t Do It Without You.” What animated Disney Channel series starred Kyla Pratt as the voice of Penny Proud? Answer: The Proud Family ."
    }
  ]
}