{
  "url": "https://www.wikihow.com/Dance-K%E2%80%90Pop",
  "title": "How to Dance K‐Pop",
  "steps": [
    {
      "title": "Choose a girl group song for a playful, bubbly dance.",
      "content": "Choose a girl group song for a playful, bubbly dance. Every K-pop girl group has a unique style, with songs that range from sweet to empowering. Girl group dances tend to be energetic, flirty, sassy, and lots of fun. Choose a band you love and want to emulate, but remember to keep your skill level in mind! You can build up to more challenging dances from groups like Girls’ Generation, Blackpink, Everglow or ITZY, but if you’re a beginner, check out girl groups like: [1] X Research source EXID Sistar Apink AOA Twice"
    },
    {
      "title": "Pick a song from a boy group, if you want a more explosive style.",
      "content": "Pick a song from a boy group, if you want a more explosive style. Boy group dance styles tend to be more hard-hitting and powerful than girl groups’, with songs that can infuse rap elements into the energetic K-pop style. Choose a boy group if you want a dance that’s more aggressive, and get ready for big, bold movements and lots of jumping! You can build up to more challenging dances from groups like BTS, Stray Kids, ATEEZ, Seventeen or ONEUS. For moves that are easy to learn as a beginner, look at groups like: [2] X Research source BIGBANG iKON Pentagon"
    },
    {
      "title": "Choose a song you love, so that you’ll be excited to dance to it.",
      "content": "Choose a song you love, so that you’ll be excited to dance to it. It’s essential that you pick a song that makes you want to get up and dance! You’ll have lots of fun learning the dance, and that excitement and energy will make you even more determined to get the moves down, even when it gets hard. Remember that you don’t have to choose a song from a girl group if you’re a girl, or a boy group’s song if you’re a boy. Go with whatever song and style you love most!"
    },
    {
      "title": "Watch the music video or dance practice video (if there is one).",
      "content": "Watch the music video or dance practice video (if there is one). This way you can see if you’ll be able to pull off the dance. Before you make your final song decision, take a look at a music video or a live, choreographed version of the dance to get a feel for the style and difficulty. Make sure it’s a dance you’re physically able to do! If you’re a beginning dancer and this choreography has lots of difficult floorwork or advanced transitions, look for something more simple to start off with. Don’t worry, you won’t be learning the dance from this video--the cuts and editing would make it too difficult! You’re just watching to get a feel for the moves and dance style."
    },
    {
      "title": "Keep a list of the dances that you really want to learn.",
      "content": "Keep a list of the dances that you really want to learn. If you realize that a dance that you really want to is just too hard for you right now, don’t get discouraged! Write down the songs you really want to learn and use them as motivation to start learning the simpler dances. As you improve and get more experience, you’ll be able to tackle the harder dances on the list."
    },
    {
      "title": "Search online for a mirrored tutorial video.",
      "content": "Search online for a mirrored tutorial video. Video tutorials are the easiest way to learn, and there are many available online. Search for the song name, followed by “mirrored version” or “dance tutorial.” Whatever video you choose, make sure that the dancer either has their back to the camera like a dance teacher, or that the video is “mirrored”--flipped horizontally. [3] X Research source If you use a non-mirrored video, you’ll learn the dance backwards. If the dancer raised their right arm, for example, it would look to you like they raised their left arm. You would actually be doing the opposite moves! Choosing a mirrored video, or one where the dancers have their back to you, will let you follow each move exactly as it appears on the screen."
    },
    {
      "title": "Follow your choice dancer's moves.",
      "content": "Follow your choice dancer's moves. Some K-pop groups have lots of members, and it can get overwhelming if you’re trying to watch them all at once. Instead, pick one of the members to dance as and follow them the whole time. [4] X Research source Focus on the member you want to perform as. It can be your bias, or any other member. Watch the way they move closely as they might move to a different position as they dance! Remember the Main Dancer(s) tend to stay upfront and in the frame of the choreography and tend to get difficult parts of the dance, so look out! Sit back, relax, and watch the full choreography a few times to get a sense of the choreography and timing. Focus hard on the dancer that you’ll be following. If you can, watch the video on a computer or a TV screen rather than a phone so you can see all the small moves and details. K-pop dancing is all about precision, so the clearer you can see the moves, the better!"
    },
    {
      "title": "Set up in a big room in your house to start practicing.",
      "content": "Set up in a big room in your house to start practicing. The best place to learn your dance is in a big, quiet room in your house--it could even be your own room! If you don’t have a big enough room in your house, you could also practice in a room at the gym, in the hallways at your school, or even in a dance studio. All you need is some room to move around and Internet access. [5] X Research source"
    },
    {
      "title": "Film yourself dancing, if you don’t have a mirror.",
      "content": "Film yourself dancing, if you don’t have a mirror. Lots of people like to dance in front of a mirror so they can make improvements and see how the dance looks overall, but it’s definitely not necessary. If you don’t have a big mirror to practice in front of, set up a camera to film yourself and see what you need to work on. [6] X Research source You can choose to practice the dance without a mirror or a camera. Focus on how the moves feel and how the dancers in the video look, and work to copy them as best you can."
    },
    {
      "title": "Divide the dance up into small, manageable sections.",
      "content": "Divide the dance up into small, manageable sections. The best way to learn this complicated choreography is by tackling it a little bit at a time. It’s easiest to separate the dance based on the movements of the song, so you have musical cues dividing each segment. These sections will most likely be: [7] X Research source The intro The verses The pre-chorus The chorus"
    },
    {
      "title": "Practice each move in the intro with the video on half speed.",
      "content": "Practice each move in the intro with the video on half speed. If you’re watching a video on YouTube, click the Settings button in the right hand corner of the video, click Speed, and choose 0.5. Start the video at the beginning and pause it each time you see the dancer do a new move. Pause the video and replay the move, copying the dancer slowly. [8] X Research source If you’re watching a tutorial on a site other than YouTube, search online to see how to play the video at a slower speed. You can find the videos on YouTube, slow down the tempo, study the movements, and then practice in a mirror at home. [9] X Research source"
    },
    {
      "title": "Walk your way through the intro, focusing on your arms, then your legs.",
      "content": "Walk your way through the intro, focusing on your arms, then your legs. Pause and replay each move until you’ve got it down. If it helps, you can first focus on the arm movements in a certain move, then add in the legs. Once you’ve got it down, replay the video from the beginning and go through all the moves together, then move on. [10] X Research source Replaying from the beginning might be frustrating when you want to learn new moves right away, but it will help you with timing and making your transitions nice and smooth. You might want to go through the moves as fast as possible, but that will only frustrate you. Be patient and remember that the only way to get to the level of a K-pop star is through lots of practice!"
    },
    {
      "title": "Speed up the intro once you get it down at half speed.",
      "content": "Speed up the intro once you get it down at half speed. When you reach the last move in the intro, go through it all one more time at half speed. Then, speed it up to 0.75 speed (three-quarters as fast as the original). Don’t worry about hitting each move perfectly right now; just focus on getting them down roughly, getting familiar with the feel and flow of each movement."
    },
    {
      "title": "Repeat the process with the next part of the video.",
      "content": "Repeat the process with the next part of the video. Now that you’ve got the intro down, move the video on to the first verse. Use the same process to learn each new move, pausing and replaying at half speed until you know all of the movements."
    },
    {
      "title": "Practice from the beginning each time you learn a new part.",
      "content": "Practice from the beginning each time you learn a new part. Once you’ve learned the first verse, scroll the video back to the beginning and play it at three-quarters speed. Do all the moves that you know, again focusing more on flow and general placement than total precision. [11] X Research source"
    },
    {
      "title": "Aim to learn one to two parts of the dance per day.",
      "content": "Aim to learn one to two parts of the dance per day. Don’t overwhelm yourself! K-pop dances are pretty complicated, so take it nice and slow and work on learning just a couple parts per day. Move through the song in order, and do your best not to take any days off, since it can be easy to forget the steps once you’ve gotten out of practice. [12] X Research source Before you start a new section the next day, go over all the parts you’ve learned so far to keep them fresh."
    },
    {
      "title": "Play the video at full speed when you’ve learned all the parts.",
      "content": "Play the video at full speed when you’ve learned all the parts. Once you can do the full dance with the video on three-quarters speed, start inching it up to full speed. Feel the difference when you start going faster and make any adjustments you need to."
    },
    {
      "title": "Practice the dance without the video, once you learn it all.",
      "content": "Practice the dance without the video, once you learn it all. Turn your computer around or go on the other side of the room, then play the music and do the dance as well as you can without watching. It’s okay if you don’t remember everything! Go back and watch the video afterwards to see what you can work on, then keep trying until you get it all. [13] X Research source Have fun with it! Whether the dance is powerful, joyful, sassy or sexy, get into the attitude and let it show in your face and movements. Dances are much more fun to watch and perform if you’re focused on having a great time."
    },
    {
      "title": "Notice and focus on areas that need improvement.",
      "content": "Notice and focus on areas that need improvement. You might need to drill over a certain section of the dance, or work on a general skill, like being more precise or picking up your speed. It might take you up to a week or more to get down the dance perfectly, so be patient with yourself! Focus on improving a little bit every day."
    },
    {
      "title": "Do the full dance at least once every few days, to keep it fresh.",
      "content": "Do the full dance at least once every few days, to keep it fresh. Congratulations; you’ve learned a whole K-pop dance! If you want it to stick, make sure to practice every few days. Also, feel free to show off your moves to your friends whenever you hear the song! [14] X Research source If you can’t practice the moves physically all the time, try reviewing them in your head every few days. Listen to the song and envision yourself nailing each step. If you want to perform at a show or for a video, put together a cool outfit that lets you move but matches the song, like sneakers and shorts or skinny jeans and a shiny shirt."
    },
    {
      "title": "Be patient with yourself and don’t give up!",
      "content": "Be patient with yourself and don’t give up! It’s completely normal to get frustrated--K-pop dances are hard and fast. If you’re patient with yourself and commit to drilling the moves as much as you need to, you will get them down. Remember, the time and effort will be worth it in the end. [15] X Research source"
    }
  ]
}