{
  "url": "https://www.wikihow.com/Get-Rid-of-Goat-Heads",
  "title": "How to Get Rid of Goat Head Weeds: Identification, Removal, & Prevention",
  "steps": [
    {
      "title": "Identify goat head weeds in your garden or lawn.",
      "content": "Identify goat head weeds in your garden or lawn. Look for bright yellow flowers with five petals, long and low tendrils with pairs of hairy leaves of either side of the vine, and of course the trademark thorny seed pod. Each pod has five flat burrs that are perfect for sticking into your shoes, feet, or other clothing items. [1] X Research source Also, they tend to look a bit like goat heads, with long thorns that resemble a goat’s horns!"
    },
    {
      "title": "Pull individual goat head plants by hand.",
      "content": "Pull individual goat head plants by hand. The best way to get rid of goat heads is to pull them manually. [2] X Research source That way, you can remove the entire root system. As soon as you see a goat head weed, use a spade or weed digger to puncture the soil down to the bottom of the roots. Then, take hold of the base of the stem, and use the spade to pry the weed out of the soil, taking care to remove the entire taproot. [3] X Research source Finally, dispose of the weed in a sturdy garbage bag. Wear thick gardening gloves to avoid getting pricked by the burrs. If the soil is dry or tough, moisten it with water to loosen it."
    },
    {
      "title": "Hoe over the weeds to sever the taproots.",
      "content": "Hoe over the weeds to sever the taproots. Another way to manually remove goat heads is to hoe the area in which they grow in order to sever their taproots. [4] X Research source Sweep a Dutch hoe back and forth across the soil to slice the top of the weed from its base. Or, with a draw hoe, plunge the blade into the ground and pull it toward you. [5] X Research source Once severed, collect the weeds and dispose of them in a garbage bag. [6] X Research source Turning the soil over with your hoe also helps remove small weeds. It's best to do this on a hot, dry day so you can easily rotate the topsoil."
    },
    {
      "title": "Spray herbicides to kill mature goat heads.",
      "content": "Spray herbicides to kill mature goat heads. Herbicides that contain 2,4-D, glyphosate, or dicamba work well in killing established goat head plants, but are most effective on young plants. Spray herbicides only on the weed itself, as they can be harmful to other plants in your garden as well. Though they shouldn’t be sprayed on garden plants, 2,4-D and dicamba herbicides can be sprayed across lawns without worry, as they generally won’t harm lawn grass. [7] X Research source"
    },
    {
      "title": "Get rid of goat heads with natural, chemical-free herbicides, alternatively.",
      "content": "Get rid of goat heads with natural, chemical-free herbicides, alternatively. For a more natural herbicide without chemicals, products with citric acid, acetic acid , or garlic have been noted as effective against broadleaf plants like goat heads. [8] X Research source Household vinegar has also been found to be an effective weed killer. Use an off-the-shelf vinegar with about 5-10 percent concentration, and apply it directly to the mature goat head weeds with a spray bottle. [9] X Research source You can also use a store-bought horticultural vinegar, however many states require registration to use stronger vinegars such as these as a pesticide, so check with your agricultural commissioner if the practice is allowed in your area. [10] X Research source"
    },
    {
      "title": "Kill goat head plants with a flamer.",
      "content": "Kill goat head plants with a flamer. Weed flamers or weed torches work by heating and destroying weeds at a cellular level. Pass a weed flamer over sprouted weeds to kill them, then return about 3 hours later to remove them with a spade. [11] X Research source You can use a propane or gasoline-powered flamer to burn the weeds. Never use a weed flamer in a flammable area, such as sections of your garden that contain mulch or dry plants."
    },
    {
      "title": "Collect the goat heads seeds with a rake or a patch of carpet.",
      "content": "Collect the goat heads seeds with a rake or a patch of carpet. In order to prevent new goat heads, it’s important to stop their seeds from germinating in the soil. Collect these pods with a fine-combed rake, or press a square of carpet into the soil, which will work like hook-and-loop fastener to collect the seeds. [12] X Research source Dispose of the seeds in a sturdy garbage bag. When you’re done in the garden, inspect your clothes, shoes, wheelbarrow, and other tools for clinging seeds, and remove them so that they can’t fall off later and grow. [13] X Research source"
    },
    {
      "title": "Spray pre-emergent herbicide in late winter to prevent goat heads.",
      "content": "Spray pre-emergent herbicide in late winter to prevent goat heads. Herbicides made with the ingredients oryzalin, benefin, or trifluralin are effective in helping control germinating goat head seeds. Spray these across your garden in late winter or mid-spring, before the dormant pods take root. [14] X Research source"
    },
    {
      "title": "Spread mulch in your garden to stifle goat heads.",
      "content": "Spread mulch in your garden to stifle goat heads. After removing goat head weeds, lay down mulch around the garden area in order to starve the soil of sunlight necessary for goat heads to grow. Make sure all of the soil is covered because exposed soil will likely sprout new weeds. Just be sure you’ve got them all; goat heads can still take root on top of mulch. [15] X Research source For an added layer of protection, put a layer of newspaper or wet cardboard over the soil before you add the mulch. Don’t spread mulch over lawns, as it will kill the grass."
    },
    {
      "title": "Introduce weevils to kill goat head seed pods.",
      "content": "Introduce weevils to kill goat head seed pods. Strange as it may sound, two particular species of weevil, Microlarinus lareynii and M. lypriformis, have been found to control goat head propagation by eating the seed pods, which will prevent propagation, as well as the plant itself. You can purchase these from biological control suppliers, or even contact your county agricultural commissioner to enquire about obtaining them naturally. [16] X Research source This method is best used in tandem with other methods mentioned in this article, however when both species of weevil are used together, it can be adequately effective. [17] X Research source Always consult your local government agricultural authority before introducing a foreign species into the environment."
    }
  ]
}