{
  "url": "https://www.wikihow.com/Diagnose-a-Computer-Problem",
  "title": "How to Diagnose a Computer Problem",
  "steps": [
    {
      "title": "Check that the cables and components are properly connected.",
      "content": "Check that the cables and components are properly connected. This is especially important if you recently upgraded your computer. Open your computer and make sure that all the cables, RAM chips, the video card, sound card, network card, and other components are all securely attached to the motherboard. [1] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019."
    },
    {
      "title": "Check the POST.",
      "content": "Check the POST. POST stands for \"Power On Self Test\". This is part of a computer's startup program that is used to diagnose the keyboard, random access memory (RAM), disk drives and other hardware to make sure they are working properly. If the POST detects any errors in the hardware, it will either display a text error message on the screen or a series of short and long beeps. If an error message appears as you boot your computer, type the exact error message into a Google search to find more information about the error. Use your mobile phone or another computer, if needed. If you hear a series of beeps as your computer starts up, make a note of the pattern and visit https://www.computerhope.com/beep.htm to see what error the pattern indicates. [2] X Research source"
    },
    {
      "title": "Check the load time of the operating system.",
      "content": "Check the load time of the operating system. The time it takes for an operating system to load when a computer boots up greatly depends on the hardware of the computer is running. If you notice your operating system takes significantly longer to load than it used to, this may indicate a problem with your hard drive that is preventing your computer from retrieving information from your hard drive."
    },
    {
      "title": "Check for any graphics problems.",
      "content": "Check for any graphics problems. If your computer is able to boot properly, but you notice graphics problems, this may indicate driver failures or hardware failures with graphics cards. If you suspect there might be a problem with your graphics card, you should first update your graphics card drivers . If the problem still persists, you can download software to test your graphics card."
    },
    {
      "title": "Check for hardware problems.",
      "content": "Check for hardware problems. Many computer problems are caused by hardware failures or problems with hardware drivers. Windows will usually notify you about devices that have a problem. You can also use Device Manager to check the status of different hardware devices. Double-click a category in the Device Manager to display all devices in that category. Then double-click a specific device. Any errors with the device will be displayed in the \"Device Status\" box under the \"General\" tab. Check all devices. Use the following steps to open the Device Manager: Click the Windows Start menu in the lower-left corner. Type Control Panel . Double-click the Control Panel in the Windows Start menu. Click Hardware and Sound . Click Device Manager below \"Devices and Printers\"."
    },
    {
      "title": "Check any newly installed software.",
      "content": "Check any newly installed software. Some software may require more resources than the system can provide. Chances are that if a problem begins after software starts, the software is causing it. If the problem appears directly upon startup, it may be caused by software that starts automatically on boot. Uninstall any recently installed programs and see if the problem continues. You may also want to limit the number of startup programs."
    },
    {
      "title": "Check the RAM and CPU consumption.",
      "content": "Check the RAM and CPU consumption. If your computer is choppy or running slow, it is good practice to see if a program is consuming more resources than the computer can provide. An easy way to check this is to use the Task Manager, right-click on the taskbar at the bottom of the screen and click Task Manager . Click the Processes tab. Click CPU to display a graph of the current CPU usage. Click Memory to see a graph of the RAM consumption. If your computer CPU graph is running at 80%-100% most of the time, you may be able to upgrade your computer processor . If your computer is using too much memory, close all unneeded programs and browser tabs and see if your computer's performance improves. Limit the amount of multi-tasking you do on your computer. If your computer doesn't have enough memory to do basic operations, some computers allow you to purchase and install more RAM."
    },
    {
      "title": "Listen to the computer.",
      "content": "Listen to the computer. If the hard drive is scratching or making loud noises, shut off the computer and have a professional diagnose the hard drive. Also, listen to the CPU fan. If the fan is blowing hard, this could mean that your CPU is getting too hot because it is working too hard. If you suspect you have a damaged hard drive, be sure to backup all important data from the drive immediately and shutdown your computer. Each time you boot up a computer with a damaged hard drive, it will damage the hard drive further. If you are unable to backup your data, remove your hard drive and take it to a professional for data recovery."
    },
    {
      "title": "Run a virus and malware scan",
      "content": "Run a virus and malware scan . Performance problems can be caused by malware on the computer. Running a virus scan can unearth any problems. Use a trusted antivirus program that is frequently updated, such as Norton, McAfee, or Malwarebytes. [3] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019."
    },
    {
      "title": "Check for the problem in safe mode",
      "content": "Check for the problem in safe mode . As a last-ditch effort, check the problem in safe mode. If the problem persists in safe mode, it is a fair bet that the operating system itself is to blame. You may need to Reinstall Windows ."
    }
  ]
}