{
  "url": "https://www.wikihow.com/Create-a-Fake-Facebook-Profile",
  "title": "How to Make a Fake Facebook Account That Looks Real",
  "steps": [
    {
      "title": "Determine an identity.",
      "content": "Determine an identity. You don't need to enter very much personal information on Facebook, but you should have a few things in mind: Likes and interests — Draft a list of things your alias is interested in. Hobbies, daily activities, and favorite entertainment should be on your mind. Date of birth — Pick a DOB that correlates with your projected age. Depending on the likes and interests you choose to put on your profile, this will vary. Name — Pick a name that's common enough that it doesn't draw attention but is not so common that it raises suspicion. Avoid common aliases (e.g., \"John Smith\"). Consider picking a name that was popular during your \"birth year\" here. Location — To avoid setting off alarms, it's best to choose a location somewhat near where you are actually located. If this is impossible, some people have reported that using a VPN to spoof your location has worked to fend off the Facebook police. For example, if you have a VPN that allows you to set your location to Seattle, you can make your fake account from Seattle and always switch to the Seattle VPN server whenever you want to log in or post as that account."
    },
    {
      "title": "Set up a new email account.",
      "content": "Set up a new email account. You shouldn't use an existing personal email address for your fake profile; instead, create a brand-new email address that you use only for your fake account. Don't use your fake email for any service that ties back to you. For example, don't link it to your bank account or a subscription service. Use a different email service than the one you use regularly. For example, if you use Gmail on your current account, create a Yahoo or Outlook address for the fake account. Make sure your email address sounds believable. To be thorough, use the same name in your fake email address that you plan to use on Facebook. If Facebook has any reason to suspect the account you're creating is fake, they may require you to upload photo ID that matches the account name you're creating. [1] X Research source"
    },
    {
      "title": "Use a different device than you usually use.",
      "content": "Use a different device than you usually use. Facebook may become suspicious if too many accounts log in from the same device. When creating your fake Facebook account, use a different device and network than the ones you normally use to access Facebook. Some even recommend getting a burner phone and only accessing your fake account on that phone when connected to cellular data."
    },
    {
      "title": "Consider a VPN.",
      "content": "Consider a VPN. This tip is polarizing. Some believe you should always use a VPN to create and access your fake Facebook account, while others think Facebook flags users using VPNs to make them verify their identities. The best use of a VPN in this situation is for spoofing your location–if you want your fake Facebook user to live in a certain place, you can use a VPN with servers in that location to connect to the internet."
    },
    {
      "title": "Choose a photo of your fake persona.",
      "content": "Choose a photo of your fake persona. Pulling photos off of Google is a guaranteed way to get caught stealing content. To get around this, you can upload an artistic photograph you've taken, or try an AI photo generator like thispersondoesnotexist.com . Plenty of people on Facebook use pictures of their pets as profile photos. Pay attention to the background of the photo. If you're using an actual photo you've taken, make sure there aren't any identifying aspects that will give away your actual location. For example, you might upload a picture of a generic-looking meadow instead of a shot of a street in your city. If someone reports your profile or photos as fake, Facebook may suspend your account until you can prove your identity with a photo ID."
    },
    {
      "title": "Add friend on your fake account.",
      "content": "Add friend on your fake account. It doesn't matter how convincing your fake profile is if no one is around to interact with it, so add some friends ! Try to add people from the area in which your profile says you live and people from groups or interests you've listed. Keep in mind that harassing people with your fake account, apart from being wrong, may result in your account being suspended."
    },
    {
      "title": "Like pages.",
      "content": "Like pages. Clicking the Like button next to pages your profile might enjoy will add those pages to your profiles \"Likes\". This is an easy way to add more depth to your profile."
    },
    {
      "title": "Understand the \"less is more\" rule.",
      "content": "Understand the \"less is more\" rule. Adding believable details that no one can verify—such as photos, interests, and an appropriate current location—is fine, but don't overdo it. Adding details that people can verify as inaccurate will detract from your profile's credibility and ultimately give it away as fake. For example, don't list a specific school or workplace on your account, as determining whether or not someone actually attended a school or frequents a workplace is fairly easy. The more vague your profile's details are, the more believable those details will be."
    },
    {
      "title": "Limit the number of similarities between you and your fake profile.",
      "content": "Limit the number of similarities between you and your fake profile. Your fake profile's current location, age, name, interests, job, and so on should vary noticeably from your actual profile. Additionally, how you interact with people should be different. For example, if you use proper grammar and punctuation on your real account, try using poor grammar or capitalization on your fake profile. Things like your age and interests are impossible for anyone else to verify, so feel free to make these up without fear of anyone catching on. You'll also want to refrain from adding more than one or two people you know on your fake profile, and never add two people you wouldn't know if you hadn't been in a specific place (e.g., a college) or event."
    },
    {
      "title": "Show, don't tell.",
      "content": "Show, don't tell. People rarely talk about things like their personalities and other mundane topics. Explicitly stating facts about yourself in hopes of filling in the blanks about your profile will only serve as a red flag for people in your Friends list. You can instead demonstrate things about your personality by adding information to your profile's \"About\" section, liking pages, updating your interests, and so on."
    },
    {
      "title": "Limit your Messenger communication with others.",
      "content": "Limit your Messenger communication with others. This is another case in which the \"less is more\" rule applies: the more you have to talk about yourself or your activities, the easier it will be for another user to discover that your account is fake. Unless you have to discuss something with another Facebook user in private, consider avoiding Messenger entirely. If you use Messenger, remember to stick to grammar and other communication methods you've established in your posts (e.g., use casual, informal grammar in Messenger if that's how you post)."
    },
    {
      "title": "Open Facebook on a different device & network than you usually use.",
      "content": "Open Facebook on a different device & network than you usually use. For example, if you normally use your phone to access Facebook, use your computer this time. Ideally, you'll also be able to connect to a different network first, either with a VPN or by bringing your laptop to a public location with Wi-Fi. If you can't use a different device or network, open a new Incognito window to perform the steps to create your fake Facebook account."
    },
    {
      "title": "Click Create New Account.",
      "content": "Click Create New Account . It's the green button below the login fields. [2] X Research source"
    },
    {
      "title": "Enter a first and last name.",
      "content": "Enter a first and last name. Type the first name for your fake account into the \"First name\" text field, then type in the fake last name in the \"Last name\" field."
    },
    {
      "title": "Add your fake email address.",
      "content": "Add your fake email address. Type it into the \"Mobile number or email\" field, then re-enter it in the \"Re-enter email\" field below. Many providers allow you to create fake email addresses . If you don't have one already, create a disposable email with a fake name."
    },
    {
      "title": "Enter a password.",
      "content": "Enter a password. Type the password that you want to use into the \"New password\" text field. Be sure to create a secure password that you can easily remember ."
    },
    {
      "title": "Set your birthday.",
      "content": "Set your birthday. Click the month drop-down box and select your alias' birthday's month, then repeat this step for the day and year drop-down boxes."
    },
    {
      "title": "Select a gender.",
      "content": "Select a gender. You can choose Male or Female , or select Custom to select a pronoun and enter an optional gender."
    },
    {
      "title": "Click Sign Up.",
      "content": "Click Sign Up . It's a green button at the bottom of the \"Sign Up\" section. Doing so creates your Facebook profile. [3] X Research source"
    },
    {
      "title": "Verify your email address or phone number.",
      "content": "Verify your email address or phone number. Open the fake email address you used to create the profile, open the email from Facebook, and follow the on-screen instructions in the email to confirm your email address. Once confirmed, you can start filling out your profile."
    },
    {
      "title": "Open Facebook on a different device.",
      "content": "Open Facebook on a different device. For example, if you usually use your computer to access Facebook, use your phone or tablet. Ideally, you'll also be able to connect to a different network first, either with a VPN, cellular data, or a different Wi-Fi network. If you cannot use a new device, you will need to sign out of your existing Facebook account to continue. To do so, tap the menu ☰ at the top-right (Android) or bottom-right (iPhone), scroll down, then tap Log Out . [4] X Research source"
    },
    {
      "title": "Tap Create New Facebook Account.",
      "content": "Tap Create New Facebook Account . It's a button at the bottom of the screen. This starts the account creation process. Tap Next to continue."
    },
    {
      "title": "Add your fake first and last name.",
      "content": "Add your fake first and last name. Tap the \"First name\" field, type in the profile's fake first name, and then tap the \"Last name\" field and type in the last name."
    },
    {
      "title": "Set your birthday and select Next.",
      "content": "Set your birthday and select Next . Select a month, day, and year for your profile's fake date of birth."
    },
    {
      "title": "Select a gender and tap Next.",
      "content": "Select a gender and tap Next . Tap Female or Male , or choose Custom to select another option."
    },
    {
      "title": "Tap Sign Up with Email Address and enter your email address.",
      "content": "Tap Sign Up with Email Address and enter your email address. When prompted to enter a mobile phone number, tap this option to switch to the email entry field. Then, type the email address you created into the field. Once you've entered your email address, tap Next to continue."
    },
    {
      "title": "Create a password and tap Next.",
      "content": "Create a password and tap Next . Tap the \"Password\" text field, then type the password you want to use. If you're prompted for a verification code, open the email address that you used to create your Facebook account, look for the code in the subject line of the email from Facebook, and enter the code on the Facebook prompt."
    },
    {
      "title": "Can a fake Facebook profile be traced?",
      "content": "Can a fake Facebook profile be traced? Yes. If someone reports your fake Facebook profile for something illegal and calls the police, the police can subpoena your personal information from Facebook, including your IP address, ISP name, the name of the device you used to access FB, and even (if you weren't careful), your real name."
    },
    {
      "title": "Can Facebook detect fake accounts?",
      "content": "Can Facebook detect fake accounts? Yes, and they can be pretty good at it. If someone reports your account because they think it's fake, Facebook will likely ask you to prove your identity. Facebook's algorithms can also detect fake accounts if you don't take the proper precautions."
    },
    {
      "title": "Can I create a Facebook Page without creating a profile?",
      "content": "Can I create a Facebook Page without creating a profile? You must have a Facebook profile to create a Page for your business or organization. If you don't want people to know you're on Facebook, there are ways to hide your profile ."
    },
    {
      "title": "Can I have two Facebook profiles?",
      "content": "Can I have two Facebook profiles? It violates Facebook's terms to have more than one personal Facebook account. [5] X Research source"
    }
  ]
}