{
  "url": "https://www.wikihow.com/Drive-Safely-in-Heavy-Traffic",
  "title": "How to Drive Safely in Heavy Traffic",
  "steps": [
    {
      "title": "Remove all distractions.",
      "content": "Remove all distractions. In heavy traffic conditions, the road will be crowded with cars, the flow of traffic irregular, and people will start getting impatient, leading to them trying to merge where they likely shouldn’t. The last thing you need is a distraction preventing you from paying attention to these things. Limit your distractions by: Turning off your cell phone, or putting it on silent mode. Switching off your music, or turning the volume down. Telling your passengers to quieten down until you’re free of dense traffic. [1] X Research source"
    },
    {
      "title": "Drive defensively",
      "content": "Drive defensively . Defensive driving covers a wide range of skills you should employ to prevent dangerous situations on the road before these occur. You should plan for ways you can react in an emergency situation, like if another vehicle were to try and merge into you. In addition to this, you should also: Keep your eyes scanning traffic and road conditions. Identify vehicles that appear unsafe, such as those that are erratically merging across lanes, speeding dangerously, or drifting within a lane. Follow the flow of traffic. Signal before making a turn or merging into a lane. Allow plenty of space between you and other vehicles/structures. Never drive while tired or emotionally agitated. [2] X Research source"
    },
    {
      "title": "Plan your driving times to avoid heavy traffic.",
      "content": "Plan your driving times to avoid heavy traffic. In many cases, even leaving fifteen minutes before the start or after the end of rush hour can dramatically decrease the flow of traffic on your drive. Though the worst times for traffic (rush hour) will vary according to where you live, generally you can expect it to be heaviest between 08:00-09:00, and 17:00-18:00. [3] X Research source"
    },
    {
      "title": "Pay attention to heavy traffic in the distance.",
      "content": "Pay attention to heavy traffic in the distance. When you are approaching a crowded section of road, you should take your foot of the accelerator and coast forward, allowing friction to slow your vehicle. This will moderate your speed while saving you fuel. Depending on your distance, you may also need to brake to slow down to an acceptable speed when approaching heavy traffic. By slowing your speed, there is a chance that the heavy traffic will break up before you reach it. This constant, slower speed will save you fuel and create less potential for accidents. [4] X Research source"
    },
    {
      "title": "Use lower gears to improve your engine efficiency.",
      "content": "Use lower gears to improve your engine efficiency. Even in automatic cars, where you don’t normally have to shift out of drive except to park or move in reverse, there are sometimes lower gear settings. These are usually noted on your gearstick by the letter “D” followed by a number, like D2 or D3. D3 or 3 is normally used for stop and go driving. D2, 2, or S (which stands for ‘slow’) locks your car into second gear, which can be useful if you are driving up or down a steep hill. Lower gears will also brake more quickly due to naturally occurring \"engine braking.\" [5] X Research source"
    },
    {
      "title": "Allow a two second distance between you and traffic in front of you.",
      "content": "Allow a two second distance between you and traffic in front of you. You should gauge how many seconds of distance is between you and the next car ahead. Do this by picking a feature, like a road sign, and saying the phrase “only a fool breaks the two second rule” as the vehicle in front passes the sign. When your car is even with the sign stop counting. The number you have stopped counting on represents how many seconds of distance is between you and the car in front of you. Adjust your speed accordingly. More time between you and the car in front will mean more reaction time in the event of sudden braking or some other emergency. [6] X Research source"
    },
    {
      "title": "Drive at or 5 mph (8.0 km/h) below the speed limit, even on a highway.",
      "content": "Drive at or 5 mph (8.0 km/h) below the speed limit, even on a highway. It’s important that you feel safe when driving, and this might mean you need to drive a little slower than the flow of traffic. However, driving too slow can make other drivers around you impatient, leading to dangerous driving situations. [7] X Research source [8] X Research source The speed of stop-and-go traffic will be greatly reduced, meaning that if you or another car do actually collide, the damage will likely be minimal and not physically serious."
    },
    {
      "title": "Prepare yourself for emergency manoeuvres.",
      "content": "Prepare yourself for emergency manoeuvres. Impatient drivers can make poor decisions that might require you to take drastic action to prevent an accident from occurring. In some cases, you may have to merge out of your lane and onto a shoulder. Keep your eyes scanning traffic, the shoulder of the road, and potential places you might direct your car in the event that you have to make emergency manoeuvres."
    },
    {
      "title": "Leave the freeway if you feel too uncomfortable.",
      "content": "Leave the freeway if you feel too uncomfortable. Your emotional state has an effect on your driving ability, and extreme anxiety can negatively impact your ability to handle heavy traffic. If you ever feel too overwhelmed by a driving situation, you should: [9] X Research source Exit the freeway and take a break at a rest stop until you’ve calmed down or the roads are quieter. Turn on your emergency lights and pull well over to the side of the shoulder of the road. Relax a little bit and listen to some music until you are more comfortable with the flow of traffic."
    },
    {
      "title": "Give yourself extra space between you and the car ahead.",
      "content": "Give yourself extra space between you and the car ahead. You'll want to allow a little more room than you would normally when driving an automatic car. This will give you time to crawl forward in a lower gear while traffic starts to move forward again. This way you don’t have to spend time, effort, and wear-and-tear on your gear shifting, and you won't have to ride your clutch while you wait for traffic to resume. Stop-and-go traffic will likely be best navigated in first or second gear depending on your engine and how these gears handle in your manual car. Beware impatient drivers cutting you off and merging into the extra space in front of you."
    },
    {
      "title": "Slow your vehicle with engine braking.",
      "content": "Slow your vehicle with engine braking. Manual cars can exert a braking force called “engine braking” or “shift braking” by releasing the accelerator and shifting safely into a lower gear. You’ll have to wait until the RPMs of your car are at an acceptable level for you to shift down, but when you do, your car will experience a gentle braking effect. When you release the accelerator, the throttle in your engine closes, creating a partial vacuum that creates engine resistance and slows the speed of your vehicle. Generally, lower gears will exert a greater braking force on your vehicle. [10] X Research source"
    },
    {
      "title": "Remain calm when cars tailgate.",
      "content": "Remain calm when cars tailgate. Depending on your region or country, there may be slight differences in driving laws, but generally, drivers are expected to allow cushion distance between the car you're driving and vehicles in front. This is to protect drivers of manual cars, as they sometimes roll back slightly when shifting into first gear. When shifting into first gear with little space behind you, or if you are on a hill; give your car a little more gas as you shift into first gear and slowly let out the clutch. [11] X Research source"
    },
    {
      "title": "Maintain a constant speed that is slightly slower than traffic.",
      "content": "Maintain a constant speed that is slightly slower than traffic. Impatient drivers in stop-and-go traffic will often accelerate faster than necessary to traverse the distance between them and the stopped car in front of them. This is highly inefficient, as the unnecessary higher speeds will cost you more in fuel and not get you to your destination any sooner. For a manual car, this is even worse because you’ll have to use your clutch to shift down or come to a stop. A better strategy is to: Accelerate at a steady speed that is slightly below the flow of traffic. This way you can coast forward in your chosen gear without having to shift down or come to a stop. This slow-but-steady method will also create a solid buffer between you and the car in front of you. You should, however, be ready to shift down if impatient drivers merge into this buffer space."
    }
  ]
}