{
  "url": "https://www.wikihow.com/Get-Darkrai-in-Pok%C3%A9mon-Platinum",
  "title": "How to Get Darkrai in Pokémon Platinum",
  "steps": [
    {
      "title": "Get the National Pokédex from Professor Oak.",
      "content": "Get the National Pokédex from Professor Oak. You can do this after beating the Elite Four. He can be found at Professor Rowan's lab in Sandgem Town. [1] X Research source"
    },
    {
      "title": "Awaken Sailor Edrith's son.",
      "content": "Awaken Sailor Edrith's son. He is in Canalave City. In order to cure him of his nightmares, you will need to travel to Full Moon Island and get a Lunar Wing from Cresselia."
    },
    {
      "title": "Save your game and turn it off.",
      "content": "Save your game and turn it off. [2] X Research source You will need to use an Action Replay to get the Member Card."
    },
    {
      "title": "Purchase an Action Replay.",
      "content": "Purchase an Action Replay. Action Replay is an accessory that allows you to enter cheat codes for a variety of different games. [3] X Research source You purchase one online or from a game store. Make sure you purchase one that is compatible with your game system (i.e. Action Replay for DS, DS Lite, DSi, 3DS, etc.)."
    },
    {
      "title": "Add the Darkrai Event Codes to your Action Replay",
      "content": "Add the Darkrai Event Codes to your Action Replay . You can add Action Replay by connecting your Action Replay to your computer using a USB cable and entering the codes using the Code Manager program. Use only one code at a time. Enter the code as it appears with capitalization. The codes are as follows:. [4] X Research source 94000130 FCFF0000 62101D40 00000000 B2101D40 00000000 0000B5D4 00000008 0000B5D8 00000000 D2000000 00000000"
    },
    {
      "title": "Start Pokémon Platinum with the Action Replay.",
      "content": "Start Pokémon Platinum with the Action Replay. Place the came card in the Action Replay and then place the Action Replay in the game slot. The game card should be facing you."
    },
    {
      "title": "Press and hold R+L while entering a Poké Mart.",
      "content": "Press and hold R + L while entering a Poké Mart. This activates the code."
    },
    {
      "title": "Talk to the man in green.",
      "content": "Talk to the man in green. The Member's Card will become available by speaking to a man in green at any of the Poké Marts."
    },
    {
      "title": "Go to the Harbor Inn.",
      "content": "Go to the Harbor Inn. It's the small house to the north of the Pokémon Center in Canalave City."
    },
    {
      "title": "Talk to the man.",
      "content": "Talk to the man. He will have you lay down in a bed. You will travel to an island in a dream."
    },
    {
      "title": "Go into the forest.",
      "content": "Go into the forest. It's to the north when you reach the island. Go up the stairs and follow the path until you see the opening in front of the forest trees. [5] X Research source Once you get to the island, it's a good idea to save your game."
    },
    {
      "title": "Talk to Darkrai.",
      "content": "Talk to Darkrai. You will see Darkrai floating on the lake. You will enter a battle with it."
    },
    {
      "title": "Catch Darkrai.",
      "content": "Catch Darkrai. It is at Level 50. It will not be easy to capture; make sure you have a lot of Ultra Balls, Dusk Balls (if you plan to capture it at night) and Timer Balls.and. For the best chance of successfully catching Darkrai, use a master ball. If you already used your master ball, quick balls, timer balls, and ultra balls are your best bets."
    }
  ]
}