{
  "url": "https://www.wikihow.com/Fold-a-Thong",
  "title": "How to Fold a Thong",
  "steps": [
    {
      "title": "Lay the thong with the string side up on a table or flat surface.",
      "content": "Lay the thong with the string side up on a table or flat surface. In other words, lay the thong with the butt side up. Line up the strings to the right and left and flatten out the crotch of the thong down below. [1] X Research source"
    },
    {
      "title": "Fold the strings into the center.",
      "content": "Fold the strings into the center. Start with the right side. Fold the string over itself towards the center. You may need to fold it in thirds if the straps are long. The goal is to fold it enough so it doesn't hang over the other edge of the thong when it's folded. [2] X Research source Do the same with the other strap."
    },
    {
      "title": "Bring the crotch up from the bottom.",
      "content": "Bring the crotch up from the bottom. Lift the crotch up towards the main part of the thong and fold it in half as you do. If you'd like to, fold it in thirds to create a smaller bundle, which will make it easier to stack. [3] X Research source At this point, you should have a small, folded bundle that you can line up in a drawer with other thongs."
    },
    {
      "title": "Place the thong flat on a table or other surface with the string up.",
      "content": "Place the thong flat on a table or other surface with the string up. Make sure the strings are laid out flat to the sides and the crotch is smoothed out below the thong. The crotch should be turned towards you. [4] X Research source"
    },
    {
      "title": "Bring the straps in towards the middle.",
      "content": "Bring the straps in towards the middle. Fold the straps so they're mostly parallel with the sides of the thong's front triangle. You should now have a triangle-shaped thong with the straps in the middle of the thong. [5] X Research source"
    },
    {
      "title": "Fold the sides into thong to create a strip of fabric.",
      "content": "Fold the sides into thong to create a strip of fabric. From the top of the thong, fold the right side of the triangle into the middle of the thong. Make the fold about a third of the way in. Do the same with the left side of the triangle, folding it over the fabric you just brought to the middle. [6] X Research source You should have a long strip of fabric stretched perpendicular to your body."
    },
    {
      "title": "Draw the crotch from the bottom.",
      "content": "Draw the crotch from the bottom. Fold the strip up two-thirds of the way, starting with the crotch. Let the other third of the thong hang over the band at the top for the moment. Don't try to fold it into the thong. [7] X Research source"
    },
    {
      "title": "Tuck the crotch and bottom of the thong into the band at the top.",
      "content": "Tuck the crotch and bottom of the thong into the band at the top. When you folded the sides over the middle of the thong, you created a small tube. Press the bottom of the thong into that tube, using your fingers to keep the tension on the sides of the tube as you do. [8] X Research source You now have a small, bundled thong to place in a drawer."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}