{
  "url": "https://www.wikihow.com/Find-Clothes-from-a-Picture",
  "title": "How to Find Clothes from a Picture with Apps or Search",
  "steps": [
    {
      "title": "Google Photos",
      "content": "Google Photos Download and open the Google Photos app. Upload the image of the clothes to your photo library. Select the photo and tap “Lens” (a camera icon) to search for exact matches of the clothes in the picture or similar products. [1] X Research source Before buying an item, make sure you’re purchasing from a legitimate retailer or a trusted re-seller. Clothes from older pictures may be out of stock."
    },
    {
      "title": "Snapchat",
      "content": "Snapchat Install the Snapchat app . Open the in-app camera. Swipe up to your Memories and navigate to the Screenshots section. When ‘Shop Your Screenshots’ pops up, you can tap ‘Try It Now.’ Tap any screenshot in that section to see related products. [2] X Research source"
    },
    {
      "title": "Pinterest",
      "content": "Pinterest Download the Pinterest app and open it. Tap the search icon at the bottom of the screen. Press the camera icon to the right of the search toolbar. Tap the camera roll icon in the lower left corner to view your saved images. Tap the image with the clothes and press “Shop” to see suggested matches or dupes with prices. [3] X Research source You can also tap the search icon on the right above the “Explore” and “Shop” options to crop your search so it only returns results for one item in the picture. Or, tap the white circles that appear in the picture to shop specific items."
    },
    {
      "title": "Google Lens",
      "content": "Google Lens Install the Google app and open it. Use Lens to snap a photo of clothes that someone is wearing, clothes at a store, or clothes on a TV show or magazine that’s in front of you. Below the picture, tap “Search” and swipe up to see exact matches or similar garments. [4] X Research source On select Android phones like the Pixel 8, you can circle to search without the Google app. When you see clothes in a picture you want to identify, long press the home button or navigation bar. Then, use your finger to circle an item and see matches. [5] X Research source"
    },
    {
      "title": "Google Reverse Image Search",
      "content": "Google Reverse Image Search Go to the Google Images website . Click the camera icon on the right side of the search bar to open Google Lens . Drag an image from the web, upload one from your computer, or paste an image URL to search for clothes in the image. [6] X Research source"
    },
    {
      "title": "StyleHint",
      "content": "StyleHint Install the StyleHint app and open it. Upload a picture of an outfit or clothing item. The app will show you similar items available from UNIQLO and GU. StyleHint is like a social media platform. You can follow creators and show them your outfits so they can find the clothes in your picture, too."
    },
    {
      "title": "Lykdat",
      "content": "Lykdat Navigate to the Lykdat website on a computer or phone. Click the “Image Search” button on the homepage. Select the saved picture with the clothes you want to find. The results will show you where to find exact or similar items. Beware of counterfeit products which show up in Lykdat’s results. If you haven’t heard of a store before, research it before purchasing any clothing. A similar website is findclothesbypicture.com , although the results can link to fake storefronts as well as real ones. Use your judgment before making a purchase."
    },
    {
      "title": "Search online using a description of the item with keywords.",
      "content": "Search online using a description of the item with keywords. Be as specific as possible when you're doing the search because the website that sells the item will likely be using keywords to appear in search results. Include the item name, color, fabric, and any special features that it has. [7] X Research source For example, if you see a picture of a unique pair of jeans in a magazine, you can search for “acid wash ripped jeans flower embroidery pockets” to try to pull up the item or items like it. You might also want to search the name of the person who posted the image or the magazine where you saw the picture for more specific results."
    },
    {
      "title": "On social media, tap on the picture to see tagged designers or products.",
      "content": "On social media, tap on the picture to see tagged designers or products. Most Instagram and social media influencers are required by law to tag the designer or brand if they provided the outfit. Simply tap your finger on the image quickly to see if there are any people or designers tagged in the photo. [8] X Research source Some fashion bloggers and influencers will place the tags directly over the item to show where it came from. For example, if their shirt is from Fendi, they might tag Fendi on the shirt in the picture. Businesses and brands on Instagram can also post pictures that have links to buy products online. Tap on the image and look for the white rectangles that display the name of the item in the price. Then, you can tap on the rectangle to go to the brand's website. Be sure to check the caption and comments of the picture. Sometimes, bloggers will tag brands there as well. Or, they’ll have an LTK link in their bio where they put links to products they post. [9] X Research source"
    },
    {
      "title": "Contact the person who posted the picture if you found it online.",
      "content": "Contact the person who posted the picture if you found it online. Most bloggers and social media influencers are happy to answer questions from followers and fans. Go to their social media page and send a picture of the outfit that you're interested in. Be straightforward and ask them about the specific item that you're looking for. [10] X Research source For example, you could say, “I love your shoes in your latest post! Where did you get them from?”"
    },
    {
      "title": "Check a celebrity outfit account if the item belongs to a famous person.",
      "content": "Check a celebrity outfit account if the item belongs to a famous person. There are many Instagram accounts that post pictures of celebrity outfits with links to buy the items. Go to the celebrity's tagged photos on Instagram and search through the pictures for one that has designers or brands tagged. Normally, these users post links or details about the designers in the caption of the image. [11] X Research source For instance, “@SelenasCloset” on Instagram posts pictures of clothes that Selena Gomez has worn, along with prices and links to buy the items. Similarly, “@HausOfRihanna” posts pictures of Rihanna's outfits, and you can find clothes that Kendall Jenner wears from “@KendallJennerCloset”. These accounts also post links to items that aren't shown on the celebrity's social media. They frequently post outfits that come from paparazzi pictures or magazine features. Magazines also publish articles on celebrity outfits, sometimes naming the products they’re wearing or linking to dupes. Search for the celebrity and which of their outfits you’re looking for to find these articles."
    },
    {
      "title": "Use general keywords if you want to search for items of the same style.",
      "content": "Use general keywords if you want to search for items of the same style. To look for items like an item that you saw in a picture, search for general keywords that describe the item. Personal stylist Alena Le Blanc says to use the color, item type, and fabric in the search. Try not to include any brand names so you get a variety of results. For example, if you saw a celebrity post a picture with a cute red dress on, you can search for “red short-sleeve skater dress with buttons” to find one that's similar."
    },
    {
      "title": "Search for “dupes” of the item if you want an inexpensive option.",
      "content": "Search for “dupes” of the item if you want an inexpensive option. If you locate an item that's more expensive than you can afford, it's easy to find items online that are similar. Search for the brand and item name, and include the word “dupe” to see if anyone has posted links to items similar to the one that you found. [12] X Research source For example, if you're looking for tennis shoes that look like Adidas Originals, you could search for “Adidas Originals dupe” or “shoes like Adidas Originals” to see lists of dupes. Be aware that some “dupes” are actually knock-offs, which are illegal copies of products. If an item is labeled as authentic but isn't sold through the official brand website, ask for proof of authenticity, such as a receipt or manufacturer's mark on the item."
    },
    {
      "title": "Adjust the price, size, and brand filters to refine your search results.",
      "content": "Adjust the price, size, and brand filters to refine your search results. If your initial search for a similar item yields a lot of results, try narrowing the results to fit your needs. Add your size to the search, and include specific brands that you're interested in buying from. If you're looking for cheaper alternatives, try including “inexpensive” or “sale” in your search. [13] X Research source For example, if you're looking for a denim shirt, you could search “long sleeve women's denim shirt size large inexpensive.”"
    }
  ]
}