{
  "url": "https://www.wikihow.com/Diffuse-Light",
  "title": "How to Diffuse Light",
  "steps": [
    {
      "title": "Get an on-camera flash diffuser.",
      "content": "Get an on-camera flash diffuser. These are great to use on location when you know you’ll be taking flash shots. On-camera diffusers simply attach to your camera, covering the flash with some kind of material to soften the light. There are many different models and types, each providing a slightly different approach to diffusing the light. [1] X Research source For example, some work by bouncing light off the ceiling and directing the rest straight toward the subject through the fabric. Others reflect the flash off a panel in the on-camera diffuser before directing it through the fabric at the subject."
    },
    {
      "title": "Try a variety of softboxes for different effects.",
      "content": "Try a variety of softboxes for different effects. Softboxes, also called lightbanks, are rectangular enclosures that you place over the light source (usually your flash) to soften it. These versatile tools create diffused, directional light, such as the kind that would stream in through a window. Soft boxes come in many different sizes. In general, the larger the softbox, the softer and more diffused the light will be. [2] X Research source Most softboxes work by using a reflective material lining that bounces the light through the sheer fabric. If you use a softbox, make sure that it can handle the wattage of light you’re using. Using the wrong softbox can create a fire hazard."
    },
    {
      "title": "Use an umbrella to produce broad and diffused lighting.",
      "content": "Use an umbrella to produce broad and diffused lighting. Photography umbrellas are easy-to-use tools that diffuse light two different ways – by bouncing the light off its surface or by diffusing the light through it. Similar to a softbox, an umbrella is attached to the light source. They are typically made of white cloth or a metallic silver material. Both types diffuse light effectively and are very affordable (some cost less than twelve dollars). [3] X Research source To diffuse light by bouncing it, aim the light source at a silver or white umbrella, which should target the light away from the subject. To diffuse the light through an umbrella, use one made from sheer material. Aim the light source toward the subject, placing the umbrella in front of the light source."
    },
    {
      "title": "Soften light subtly with diffusion paper.",
      "content": "Soften light subtly with diffusion paper. Diffusion paper is clamped onto the “barn doors” of the light you’re using. These papers create an even field of soft light and they are best used to slightly soften up the overall look of a shot. They are sold with different finishes to create different lighting effects and look a lot like tracing paper. These light diffusing materials are quite affordable, but if you’re forced to improvise, try using wax paper instead. A similar effect can be achieved. [4] X Research source Wax paper should only be used to diffuse LED lighting. Avoid using wax paper with tungsten lights, since the paper could possibly catch on fire."
    },
    {
      "title": "Hang a professional silk between the light source and your subject.",
      "content": "Hang a professional silk between the light source and your subject. Professional silks come in many different sizes and are usually hung on a metal frame. When placed between the light source and your subject, a silk can very effectively diffuse light. If you’re on a budget, a similar effect can be achieved by using a sheer piece of fabric you already have around, like a white bed sheet or clear shower curtain liner. [5] X Research source Though this approach won’t give you the same results that a more professional diffuser will, it does serve to soften the light and to reduce harsh transitions and shadows. You can use any type of light-colored sheer fabric as a diffuser. In a pinch, you can even use a tissue as a diffuser."
    },
    {
      "title": "Experiment with Chinese paper lanterns.",
      "content": "Experiment with Chinese paper lanterns. Chinese paper lanterns, sometimes referred to as China balls, cost very little and can create very even, soft lighting. They are able to diffuse light in almost every direction simultaneously, making them very versatile. [6] X Research source Chinese lanterns come in many different sizes and colors. The all-white ones are best for diffusing light in a typical way. Experiment with colored lanterns if you are trying to create unusual lighting effects. You can buy China balls online, at most home décor shops and at Asian markets. To get an idea of how China balls can be used – you could hang several of them from the ceiling to softly brighten up a scene, or you could use a single lantern to light a more intimate shot, such as a dinner conversation in a restaurant."
    },
    {
      "title": "Put bubble wrap around your flash.",
      "content": "Put bubble wrap around your flash. Bubble wrap is a plastic packing material that creates a cushion with lots of tiny, air-filled “bubbles.” You can diffuse light with bubble wrap by cutting a two foot long strip of it and wrapping it around the flash on your camera. Attach it to the flash with hook-and-loop fastener, gaffer’s tape or a rubber band. After wrapping the bubble material around the flash, be sure to leave plenty of room over the top. You can create an even softer lighting effect by using two layers of bubble wrap. [7] X Research source"
    },
    {
      "title": "Bounce light using any semi-reflective white surface.",
      "content": "Bounce light using any semi-reflective white surface. White poster board, whiteboards, and even white walls/ceilings can be effectively used to bounce off soft light. To diffuse light by bouncing it, aim your light source at the semi-reflective white surface of your choice. The light reflects, or bounces, off that surface and creates a secondary source of light, which will illuminate your subject with diffused light. [8] X Research source Make sure you target the light source away from the subject so that only the bounced light – not direct light – is being used."
    },
    {
      "title": "Experiment with different fabrics and materials to create DIY silks.",
      "content": "Experiment with different fabrics and materials to create DIY silks. Professional silks are fabrics placed between the light source and subject to diffuse light. White bed sheets and clear shower curtain liners can be used quite effectively, but in a pinch you can get even more creative and still achieve some nice, soft light. Experiment with a variety of different materials and objects to get a feel for the diffusion possibilities. Try using things like bath towels, visqueen, paper towels, white t-shirts or dress shirts, printer paper and even opaque Tupperware. [9] X Research source"
    }
  ]
}