{
  "url": "https://www.wikihow.com/Decorate-Salad-for-a-Competition",
  "title": "How to Decorate Salad for a Competition",
  "steps": [
    {
      "title": "Arrange the food in a striped pattern for an easy decoration.",
      "content": "Arrange the food in a striped pattern for an easy decoration. Chop up any fruits or veggies you’d like so that each type of food is cut up the same way using the same thickness. Separate the plate into equal sections of stripes and fill each stripe in with a different food, like strawberries, shredded carrots, blueberries, or tomatoes. [1] X Research source Avoid putting foods that are the same color next to one another in the stripes, like cucumbers and lettuce. You might create stripes out of only two foods, like strawberries and blueberries, or have each stripe be a different type of food for more diversity. Make the stripe pattern more complex by turning it into a zig-zag pattern instead, if desired."
    },
    {
      "title": "Place fruits or veggies on a round plate for a circular presentation.",
      "content": "Place fruits or veggies on a round plate for a circular presentation. Create a bulls-eye effect by arranging the sliced foods in circles on the plate. Choose one type of food to start with and line the edges of the plate with the food, creating a full circle. Continue creating circles with different foods, starting at the outer edges and working your way into the center. [2] X Research source For example, you might create a large outer ring of cucumbers, the next ring of carrots, the next ring of hard-boiled eggs, and so on until you fill in the whole plate. You could also create a spiral design using one type of food and fill in the spare areas with other kinds."
    },
    {
      "title": "Form a heart shape with chopped foods for a love-themed salad.",
      "content": "Form a heart shape with chopped foods for a love-themed salad. Cut up different fruits, veggies, or other foods into slices and arrange them in a large heart shape. Fill in the heart with the cut up foods so that it’s completely full and colorful. [3] X Research source You might create the outline of the heart with blueberries and then fill it in with strawberries, apples, pineapple, and oranges. Form lots of hearts within the large heart for a more complex design."
    },
    {
      "title": "Put the fruits or veggies on a square platter for a geometric look.",
      "content": "Put the fruits or veggies on a square platter for a geometric look. Chop up your foods so that they’re equal sizes and choose one food type to place around the edge of your square platter. Once it’s outlined, fill in another square using a different food, overlapping the first food slightly. Keep creating smaller and smaller squares until you’ve filled in the whole platter with different foods. [4] X Research source Place carrots around the edge of the square with additional squares made of cauliflower, cucumbers, tomatoes, and cheese."
    },
    {
      "title": "Create a salad rainbow by arranging the foods by color.",
      "content": "Create a salad rainbow by arranging the foods by color. Prepare a food for each color of the rainbow, such as strawberries, oranges, pineapples, green melon, and blueberries. Arrange the foods in an upside-down 'U' shape, starting with an outer layer of red and then moving all the way in until you've finished the rainbow. [5] X Research source Other colorful foods you might use include tomatoes, cheese, broccoli, purple onion, peppers, kiwis, or grapes."
    },
    {
      "title": "Cut cherry tomatoes to look like tulips.",
      "content": "Cut cherry tomatoes to look like tulips. Chop the cherry tomatoes in half lengthwise and then in half crosswise so you’re left with a short ‘U’ shape. Cut 3-4 small ‘V’ shapes into the top of the tomatoes to form petals, making the cuts right where you sliced each one in half. [6] X Research source Keep the rounded part of the tomatoes whole to act as the bottom of the flower. You might even add a stem and petals made out of a cucumber to finish off the look."
    },
    {
      "title": "Create a simple flower by arranging food in a small circle.",
      "content": "Create a simple flower by arranging food in a small circle. Cut round or oval foods like cucumbers, cherry tomatoes, radishes, or grapes into slices. Make a circle shape with the slices to mimic a simple flower, slightly overlapping each slice if desired. [7] X Research source While it’s not necessary to overlap the slices if you want the flower to have large petals, overlapping them will make your flower look more three-dimensional."
    },
    {
      "title": "Make delicate flowers by cutting up cucumbers or radishes.",
      "content": "Make delicate flowers by cutting up cucumbers or radishes. Chop up a red radish using lengthwise cuts to create lots of thin slices (at least 10 per radish). Using another radish, make cuts into the side of it as if you were cutting off the skin going all the way around the radish. Once you’ve made about 6 outer cuts, start working your way in towards the center, creating cuts for the petals. Wedge each slice of radish into a slit in the whole radish to create a flower. [8] X Research source Follow the same steps to create a flower out of a cucumber, except you’ll use the end of a cucumber as the base with the slits. Make sure you don’t make your slits so deep that they are cut off of the radish completely—you just want them to be able to hold the other radish’s slices."
    },
    {
      "title": "Bend pieces of a cucumber to make a three-dimensional flower.",
      "content": "Bend pieces of a cucumber to make a three-dimensional flower. Chop up a cucumber into circular slices so that each slice is roughly 1 cm (0.39 in) thick. Cut each of these slices in half so you’re left with half-circles. Stand a slice up on its side so the skin is facing you and make a slit going down the entire length, right along the middle. Bend each side out and away from the center to create the petals and arrange them in a circle to form a flower. [9] X Research source You might use the very end of a cucumber as the center of the flower, arranging all of the petals around this. Create a slit that’s deep enough so the edges fold out, but not so deep that you cut the cucumber slice entirely in half."
    },
    {
      "title": "Turn a dragon fruit into a large flower for a focal point.",
      "content": "Turn a dragon fruit into a large flower for a focal point. Cut a dragon fruit in half crosswise and position it on a cutting board so the flesh is facing you. With a sharp knife, create slits in the dragon fruit’s skin that are parallel to the sides to form petals. Start from the outer edges and work your way in towards the center of the fruit as you cut. Once you reach the center, bend the petals out slightly to create the look of a flower. [10] X Research source As you’re making the slits, avoid cutting all the way through them to keep each petal fully intact."
    },
    {
      "title": "Cut cucumbers or watermelon to make birds.",
      "content": "Cut cucumbers or watermelon to make birds. Cut off the end of a cucumber so that it’s about 4 in (10 cm) long. Make several lengthwise cuts so you have thin pieces of cucumber that are long and skinny. Place one piece flat on a cutting board and use a knife to form the bird’s beak and neck. Create a little hole near the tip of the cucumber for the eye, and you’ve made a simple swan. [11] X Research source Cut a 'V' shape into the cucumber at an angle to form the bird's neck and beak. If you’re using a watermelon, cut a thin slice of the watermelon and then use a small knife to cut out the shape of the bird (or any other animal you’d like!). Cut the rest of the slices you made into swans too, if desired."
    },
    {
      "title": "Create people out of things like lettuce and hard-boiled eggs.",
      "content": "Create people out of things like lettuce and hard-boiled eggs. Use a piece of lettuce as a skirt by cutting it into a triangle, cut-up celery into skinny slices to be arms, and hard-boiled eggs to act as the head. Get creative and use lots of different foods to form the people so there are several different colors and layers to them. [12] X Research source You might use shredded cheese or peas for hair, or cut a bell pepper into the shape of a shirt."
    },
    {
      "title": "Use whole hard-boiled eggs to create mice or bunnies.",
      "content": "Use whole hard-boiled eggs to create mice or bunnies. Take the shell off of each hard-boiled egg and slice off a thin piece of the egg's side so it doesn't roll around when you put it on a plate. Cut long 'U' shapes out of ham to create ears and cut small circles out of olives to make the eyes. You can even create a tail by cutting a carrot or cucumber into a long, skinny shape. [13] X Research source Pears make great mice too. Use a small piece of cauliflower for the bunny tail."
    },
    {
      "title": "Arrange fruit or veggies in a fan shape to form a turkey.",
      "content": "Arrange fruit or veggies in a fan shape to form a turkey. Cut a pear in half lengthwise and place half of it on a circular plate with the skin side showing. Choose foods to make the feathers out of, placing them around the pear in an upside-down ‘U’ shape so that you eventually fill most of the plate. The turkey’s feathers will look like a rainbow once you’re finished filling them in. [14] X Research source For example, you might place a layer of blueberries around the pear first, then a strand of grapes, then strawberries, and finally orange slices to fill out the edges of the plate."
    },
    {
      "title": "Turn strawberries into a fish for a unique look.",
      "content": "Turn strawberries into a fish for a unique look. Cut two strawberries in half lengthwise, and place one of the halves on the plate skin side up. Make lengthwise cuts into the other three halves, slicing them up so that the knife goes through most of the strawberry but leaves the ends connected. Place each of these halves around the first half to form the fins and tail of the fish, and fan them out slightly so it looks like the fish is swimming. [15] X Research source The strawberry halves that are cut up should have about 4 lengthwise cuts each in them. The fish’s body (the strawberry half that wasn’t cut) should be oriented so the wider end is the head and the skinnier end is connected to the tail."
    },
    {
      "title": "Make a boat out of cucumber pieces for a nautical look.",
      "content": "Make a boat out of cucumber pieces for a nautical look. Cut a cucumber in half lengthwise and hollow out one half to create the base of the boat. With the other half of the cucumber, cut a thin lengthwise slice to form the boat’s sail. Stick a toothpick through both ends of the thin slice so that it’s in a ‘C’ shape, and then stick the toothpick into the boat’s base as well. [16] X Research source Use a spoon to hollow out the cucumber half. Fill the boat with other foods too if you’d like, such as cherry tomatoes, pepper slices, or watermelon."
    },
    {
      "title": "Hollow out bell peppers to turn them into cars or trains.",
      "content": "Hollow out bell peppers to turn them into cars or trains. Cut a bell pepper in half lengthwise and hollow it out with a knife or spoon. Attach cucumber slices to the bell pepper with toothpicks, placing two slices on each side to create the wheels. Fill the bell pepper with other foods for a cute display, like carrot sticks, broccoli, green beans, or other sliced colored peppers. [17] X Research source To create a train, hollow out 4-5 bell peppers and arrange them in a line together. Use different colored bell peppers for a colorful display."
    },
    {
      "title": "Turn a cucumber into a turtle for a cute decoration.",
      "content": "Turn a cucumber into a turtle for a cute decoration. The turtle has three parts: the shell, the body, and the head. Cut off about 2–3 in (5.1–7.6 cm) of the end of a cucumber to make the shell, creating a hexagonal turtle shell pattern with a knife if you’d like. Cut a crosswise slice of the cucumber and make little cuts around the entire edge. Cut a 2 in (5.1 cm) skinny rectangle to be the neck and head, cutting a little slit for the turtle’s mouth near the top too. [18] X Research source Put the turtle together by placing the shell on top of the cucumber slice. Situate the turtle’s neck so it’s vertically against the shell and use a toothpick to keep it in place. Give the turtle eyes with black food gel, if you’d like."
    },
    {
      "title": "Create a baby chick by using a hard-boiled egg.",
      "content": "Create a baby chick by using a hard-boiled egg. Once the egg is hard boiled, make a cut one-third of the way across the egg, cutting off the top. Carve two little chick feet out of a piece of carrot using a knife and place the bottom portion of the egg on the two feet to form the body. Arrange the yellow yolk so it's sticking out of the body in a round lump and place the top of the egg on top so it looks like a chick is popping out. [19] X Research source For simple chick feet, cut carrots into flat triangles. Make a beak out of the carrot and place it in the yellow yolk. Create eyes using black food gel."
    },
    {
      "title": "Use a green pepper and a carrot to create a 3-D tree.",
      "content": "Use a green pepper and a carrot to create a 3-D tree. Use a sharp knife to cut a zig-zag pattern at the top of a green pepper, cutting off the stem. Hollow out the green pepper and place it carefully on top of a long, raw carrot so it looks just like a palm tree. You can even add broccoli to your arrangement to look like bushes or greenery too. [20] X Research source Cut off the end of the carrot to create a flat platform for it to stand correctly. Flip the pepper over so its bottom is facing upwards to balance it on the carrot."
    }
  ]
}