{
  "url": "https://www.wikihow.com/Freeze-Lemons",
  "title": "How to Freeze Lemons",
  "steps": [
    {
      "title": "Place lemons in a zip lock bag.",
      "content": "Place lemons in a zip lock bag. Put your lemons into a zip lock bag. Zip the bag 3/4 of the way and force all excess air out of the bag. Once there's no air in the bag, zip it all the way. Forcing out the air will help keep your lemons fresh and free up space in your freezer. [2] X Research source"
    },
    {
      "title": "Put the bag of lemons in the freezer.",
      "content": "Put the bag of lemons in the freezer. Let your bag of lemons sit in the freezer until they are fully frozen. Depending on the temperature of your freezer, this could take anywhere from 2 hours to overnight. Use fresh lemons for meals that you are making later in the week, and freeze the other lemons well in advance of when you need to use them."
    },
    {
      "title": "Submerge lemons in cold water for 10 minutes to defrost them.",
      "content": "Submerge lemons in cold water for 10 minutes to defrost them. Whole lemons that are defrosted will often be mushy, and you'll be unable to slice them. This softness makes them unsuitable as a garnish. However, you will still be able to use the zest or juice of the lemon. [3] X Research source Lemons will stay good for three to four months in the freezer. [4] X Research source"
    },
    {
      "title": "Cut your lemon into slices or wedges.",
      "content": "Cut your lemon into slices or wedges. Cutting your lemon into pieces before you freeze them will circumvent the soft consistency of the lemon so that you can use it in things like cocktails and garnishes. Cut the lemon on a cutting board width-wise about a 1/4 of an inch (6.35 millimeters) to create lemon slices. To cut the lemon in wedges, make one cut lengthwise and one cut width wise. This will create four same-sized lemon wedges. [5] X Research source You can also cut lemon slices in half to create crescent-shaped lemon slices."
    },
    {
      "title": "Lay your lemon slices on a cookie sheet and place in freezer.",
      "content": "Lay your lemon slices on a cookie sheet and place in freezer. Ensure that the lemon slices have free space in between them. Putting your lemon slices on a cookie sheet will allow them to freeze individually. If you skip this step, your lemon slices or wedges will freeze together in one block. Keep the slices of lemon the freezer for 2-3 hours, or until the lemons are frozen completely. You will know when your lemons are frozen when they are hard, and the pulp no longer creates juice when you press down on it."
    },
    {
      "title": "Transfer the lemons to a zip lock bag.",
      "content": "Transfer the lemons to a zip lock bag. After your lemons are completely frozen, you can transfer them to a ziplock bag to free up space in your freezer. Place the zip lock bag back into the freezer and take out slices as you need them."
    },
    {
      "title": "Use a grater, zester, or microplane to zest lemons.",
      "content": "Use a grater, zester, or microplane to zest lemons . The zest of a lemon is the skin and includes the natural oils that occur in the lemon. To extract the lemon's zest, use a kitchen tool to get the yellow peel off of the surface of the lemon. [6] X Research source You can also remove the zest from the peel of the lemon after you freeze whole lemons."
    },
    {
      "title": "Place the zest in a zip lock bag.",
      "content": "Place the zest in a zip lock bag. Once you're done zesting your lemons, transfer the zest to a zip lock or freezer bag. You can use the rest of the lemons in recipes that you make during the week, or you can slice them and freeze as well."
    },
    {
      "title": "Place the bag inside of a freezer.",
      "content": "Place the bag inside of a freezer. Allow the zest to sit in the freezer for a couple of hours or overnight until it all freezes. When you are ready to use it, you can take out what you need and place the rest back into the freezer. Zesting lemons after they are frozen will help keep the rind oils from spraying onto your cutting board. [7] X Research source"
    },
    {
      "title": "Juice your lemons",
      "content": "Juice your lemons . Juice your lemons using a reamer or juicer that you can pick up at many department stores. If you don't have a reamer or juicer, you can quarter the lemons and push down on the pulp with a fork to extract some of the juice. [8] X Research source The goal is to squish the pulp and extract the liquid that is in the fruit."
    },
    {
      "title": "Measure 1 cup (236.5 milliliters) of lemon juice.",
      "content": "Measure 1 cup (236.5 milliliters) of lemon juice. Pour your lemon juice into a measuring cup carefully over a sink. Measuring out your lemon juice will allow you to keep more precise measurements for recipes. [9] X Research source Make sure to remove any seeds that may have come loose when you juiced your lemon."
    },
    {
      "title": "Pour the lemon juice into ice cube trays.",
      "content": "Pour the lemon juice into ice cube trays. As you pour your lemon juice into the ice cube trays, make sure to take note of how many ice cubes constitute a full cup. This will enable you to make more accurate measurements when you have to use the lemon juice in particular recipes. These lemon juice ice cubes can also flavor water. [10] X Research source"
    },
    {
      "title": "Place ice cubes in the freezer and allow them to freeze.",
      "content": "Place ice cubes in the freezer and allow them to freeze. Allow your ice cubes to sit in the freezer until they fully freeze. If you don't freeze freshly squeezed lemon juice, it can go bad in two to four days. [11] X Research source Keeping your lemon juice frozen in ice cubes will allow you to keep the lemon juice fresh for a longer period. If you need to use your ice trays, you can transfer the lemon juice cubes to a zip lock bag."
    },
    {
      "title": "Wash your hands",
      "content": "Wash your hands before handling food. Use a hand soap and warm water and scrub your hands clean. Unwashed hands could introduce toxins and bacteria to the peel of the fruit. You can also use gloves to avoid introducing things to the lemons. [12] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source"
    },
    {
      "title": "Scrub the lemons with a brush.",
      "content": "Scrub the lemons with a brush. Use a toothbrush, nail brush, or vegetable brush to scrub the surface of the lemon. Make sure to designate this tool to solely cleaning vegetables or fruit from now on. This will get off all the dirt and potential chemicals off the surface of the fruit."
    },
    {
      "title": "Wash your lemons.",
      "content": "Wash your lemons. Before you freeze your lemons, you want to run them under cold water to remove pesticides from them. You can also use a vegetable cleaner or wash to clean off your vegetables. [13] X Research source Once your lemons are clean, dry them off with a rag or paper towel."
    },
    {
      "title": "Use a vinegar solution to remove pesticides from your lemons.",
      "content": "Use a vinegar solution to remove pesticides from your lemons. Lemons and other fruit can contain harmful chemicals like pesticides on the surface of the lemon. Remove the chemicals by soaking them in a solution of 10% vinegar to 90% water for 15 to 20 minutes. Once they are done soaking, rinse them under cold water and dry them with a rag. [14] X Research source"
    }
  ]
}