{
  "url": "https://www.wikihow.com/Develop-a-%22Radio-Voice%22",
  "title": "How to Develop a \"Radio Voice\"",
  "steps": [
    {
      "title": "Exercise your vocal cords.",
      "content": "Exercise your vocal cords . Develop a powerful voice by practicing strength training for your voice. Choose words with specific sounds, and repeat them going up and down the octaves of your vocal range. Repeat them again at a louder volume. [1] X Research source Try repeating, “Mm-mmm. Mmm-hmm.” Try repeating, “Nay, nay, nay” ten times. Try making a siren sound using vowels up and down your vocal range. Broadcasters use their vocal cords quickly and with well-controlled tension. [2] X Research source"
    },
    {
      "title": "Enunciate your words.",
      "content": "Enunciate your words. Look in the mirror and practice saying each word slowly and properly. Don’t mumble. [3] X Research source Practice saying tongue-twisters at a rapid pace. Improve your speech quality and it will be easier for you to enunciate live at a faster pace. Try repeating, “Betty Botter bought a bit of butter” six times. Try repeating, “The ragged rascal ran around the ragged rocks” several times."
    },
    {
      "title": "Listen to your recorded voice.",
      "content": "Listen to your recorded voice. Get to know the qualities of your voice. Evaluate how you handle mistakes and where you can make improvements. Make sure that you aren’t dwelling on your mistakes, which will just draw attention to them. For example, if you mispronounce a word, just correct it – if that’s necessary for the audience to understand what you meant – and keep going."
    },
    {
      "title": "Hydrate.",
      "content": "Hydrate. Drink warm water or tea with a slice of lemon when you get up in the morning and throughout the day. Don’t drink a lot of sugar or caffeine, which can have a drying effect on your voice. Avoid milk and dairy products, which encourage mucus production. [4] X Research source Warm drinks are best, rather than very hot or cold drinks. Green apples contain pectin, which can combat phlegm. Try drinking green apple juice or eating a green apple."
    },
    {
      "title": "Relax your posture.",
      "content": "Relax your posture. Relax your shoulders, but don’t stoop them or slouch. Keep your body erect but relaxed. Do posture exercises if it’s hard for you not to slouch. [5] X Research source Good posture gives you the best use of your abdominal-diaphragmatic breathing. Slouching pressures the rib cage which makes it harder for you to inhale."
    },
    {
      "title": "Control your breathing.",
      "content": "Control your breathing. Open a window, if possible, to make the air you’re breathing fresher. Breathe deeply into your lungs without raising your shoulders. Take breath into your nose for the count of three, pause, and then exhale in one big breath for a count of eight. [6] X Research source"
    },
    {
      "title": "Lubricate your voice with steam.",
      "content": "Lubricate your voice with steam. Maintain a humidity level of at least 30% in your work environment. Run a humidifier, if needed. Breathe in steam from a personal steamer (available at drugstores) or a hot shower. Alternately, pour boiling water into a sink basin and inhale the steam. Inhaling steam moistens your voice box and can relieve irritation of the vocal folds. Don’t inhale steam from directly over a pot of boiling water or a stove. Try wetting a washcloth in hot water, wringing it out, and breathing through it with your mouth and/or nose."
    },
    {
      "title": "Relax your jaws.",
      "content": "Relax your jaws. Put the heels of your hands under your cheek bones. Rub the muscles of your face by pressing inwards and down. Let your jaw open itself as you massage your face. [7] X Research source Do this a few times to warm up your mouth and lessen tension in your jaw. You can also use circular motions to massage your facial muscles."
    },
    {
      "title": "Hum and buzz your lips.",
      "content": "Hum and buzz your lips. To hum, exhale with a light “hmmmm” sound at a low octave that’s comfortable for you. Do this again, adding an “ahhh” sound for the second half of the exhale. To buzz your lips, purse them somewhat and vibrate your lips as you breathe out, with your tongue relaxed. Inhale, then trill with your lips again on the exhale. [8] X Research source You can try these exercises at escalating and deescalating pitches."
    },
    {
      "title": "Trill your tongue.",
      "content": "Trill your tongue. Hold your tongue behind your top teeth. Breath out, vibrating your tongue in the sound of an “r.” Maintain the sound. Do this at various pitches, without going past your comfort level. [9] X Research source This exercise helps your tongue to relax, while stimulating your voice and breath."
    },
    {
      "title": "Go up and down octaves.",
      "content": "Go up and down octaves. Stretch your voice by starting in a low octave and moving upwards using the sound of “me.” Don’t force your range. Instead, use gentleness to broaden your range with each repetition. [10] X Research source Also try this exercise with the sounds “e” and “oo.”"
    },
    {
      "title": "Keep your voice natural.",
      "content": "Keep your voice natural. Maintain the organic tone of a conversation. Read written words in a relaxed manner to appeal to the listener. Avoid overly formal speech. Imagine that you are reading aloud to yourself or talking to someone one-on-one. Bring the words to life like you’re telling a story. [11] X Research source Casey Kasem gave the advice to imagine your microphone is an elegant violin that you wish to play with as much feeling as you can."
    },
    {
      "title": "Don’t drop off at the end of a sentence or thought.",
      "content": "Don’t drop off at the end of a sentence or thought. Express your ideas and statements strongly throughout. Don’t trail off, leaving an idea unfinished. Keep a consistent focus and volume. For instance, don’t use all of your air until it’s necessary for you to take a breath. Pause your sentence to quickly inhale, then continue speaking."
    },
    {
      "title": "Be authentic.",
      "content": "Be authentic. Focus on sounding like you. Don’t try to pigeonhole yourself to satisfy a stereotype, such as by intentionally enhancing your dialect to match a region, age, race or religion. Be sincere and people will want to listen to you, more than if you presented them with a purposefully inauthentic version of you. [12] X Research source You may have broadcasters you admire, but don’t try to sound like someone else. Your uniqueness is what can set you apart. Use the voice you hear in your head when you’re reading a story to yourself."
    },
    {
      "title": "Connect with your audience.",
      "content": "Connect with your audience. Research news and current topics of interest. Prepare talking points and notes. Talk about what you think your audience would want to discuss, more than what you want to talk about. You can find hot topics by looking online at trending information, and observing what listeners call and write in about."
    }
  ]
}