{
  "url": "https://www.wikihow.com/Delete-Temporary-Files-in-Windows-7",
  "title": "How to Find and Delete Temporary Files in Windows 7",
  "steps": [
    {
      "title": "Close every open program that you can.",
      "content": "Close every open program that you can. Before you can clear temporary files from Windows 7, you'll first need to enable hidden files and folders. First, you'll need to close open programs, as you won't be able to delete some temporary files if they're being used by programs."
    },
    {
      "title": "Open the Start menu and click the text box .",
      "content": "Open the Start menu and click the text box . Click the multicolored Windows logo in the bottom-left corner of the screen, then click the text box at the bottom of the window."
    },
    {
      "title": "Type in windows explorer.",
      "content": "Type in windows explorer . Doing so will search your computer for the Windows Explorer app."
    },
    {
      "title": "Click Windows Explorer.",
      "content": "Click Windows Explorer. It's the folder-shaped option at the top of the Start window."
    },
    {
      "title": "Click Organize.",
      "content": "Click Organize . You'll find this tab in the top-left side of the window. A drop-down menu will appear."
    },
    {
      "title": "Click Folder and search options.",
      "content": "Click Folder and search options . It's near the middle of the drop-down menu. This prompts a new window to appear."
    },
    {
      "title": "Click the View tab.",
      "content": "Click the View tab. This option is at the top of the window."
    },
    {
      "title": "Check the \"Show hidden files, folders, and drives\" circle.",
      "content": "Check the \"Show hidden files, folders, and drives\" circle. It's in the middle of the page. If this option is already checked, your computer is displaying hidden files."
    },
    {
      "title": "Click Apply, then click OK.",
      "content": "Click Apply , then click OK . Doing so ensures that you can access and open the Temp folder for your apps and Windows itself."
    },
    {
      "title": "Click My Computer.",
      "content": "Click My Computer . It's in the column of options on the left side of the File Explorer."
    },
    {
      "title": "Double-click your computer's hard drive.",
      "content": "Double-click your computer's hard drive. This hard drive-shaped icon is under the \"Devices and drives\" heading. Your hard drive is usually the drive labeled \"C\" here."
    },
    {
      "title": "Double-click the Users folder.",
      "content": "Double-click the Users folder. You'll find it near the top of the window."
    },
    {
      "title": "Double-click your user folder.",
      "content": "Double-click your user folder. This is the folder with the first few letters of your name (or username if you signed into your computer using an email address)."
    },
    {
      "title": "Double-click the AppData folder.",
      "content": "Double-click the AppData folder. It's near the top of the window."
    },
    {
      "title": "Double-click the Local folder.",
      "content": "Double-click the Local folder. This folder is at the top of the window."
    },
    {
      "title": "Select the Temp folder.",
      "content": "Select the Temp folder. Click the Temp folder, which is near the bottom of the window, to select it."
    },
    {
      "title": "Click Organize.",
      "content": "Click Organize . This tab is in the upper-left corner of the window. A drop-down menu will appear."
    },
    {
      "title": "Click Properties.",
      "content": "Click Properties . It's at the bottom of the drop-down menu. Clicking it prompts a new window to open."
    },
    {
      "title": "Uncheck the \"Read-only\" box and click Apply.",
      "content": "Uncheck the \"Read-only\" box and click Apply ."
    },
    {
      "title": "Click OK when prompted.",
      "content": "Click OK when prompted. This will ensure that everything in the Temp folder is affected by the removal of the \"Read-only\" protection. You may have to click Continue or Skip , or otherwise verify that you want to remove read-only protection from this folder, before continuing."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . It's at the bottom of the window. You can now proceed with deleting the Temp folder's contents."
    },
    {
      "title": "Open the Temp folder.",
      "content": "Open the Temp folder. Double-click the Temp folder to open it in Windows Explorer."
    },
    {
      "title": "Select all the folder's files.",
      "content": "Select all the folder's files. Click Organize again and then click Select all , or press the Ctrl and A keys at the same time."
    },
    {
      "title": "Delete the files.",
      "content": "Delete the files. Press your computer's Del key, or click Organize and then click Delete in the drop-down menu. Doing so will move the Temp folder's contents into the Recycle Bin. You'll need to empty the Recycle Bin in order to permanently remove these files from your computer. There may be a couple of system files in the Temp folder. If so, you won't be able to delete these. They'll only take up a few kilobytes of space."
    },
    {
      "title": "Click the My Computer tab again.",
      "content": "Click the My Computer tab again. It's on the left side of the Windows Explorer window."
    },
    {
      "title": "Double-click your hard drive.",
      "content": "Double-click your hard drive. This will re-open your hard drive's folder."
    },
    {
      "title": "Double-click the Windows folder.",
      "content": "Double-click the Windows folder. It's usually near the middle of this window."
    },
    {
      "title": "Scroll down and select the Temp folder.",
      "content": "Scroll down and select the Temp folder. You'll find this near the bottom of the window."
    },
    {
      "title": "Remove the Temp folder's read protection.",
      "content": "Remove the Temp folder's read protection. To do so: Click Organize Click Properties Uncheck the \"Read-only\" box. Click Apply Click OK when prompted. Click OK"
    },
    {
      "title": "Open the Temp folder.",
      "content": "Open the Temp folder. Double-click the folder to do so."
    },
    {
      "title": "Select all the folder's files.",
      "content": "Select all the folder's files. Click Organize again and then click Select all , or press the Ctrl and A keys at the same time."
    },
    {
      "title": "Delete the files.",
      "content": "Delete the files. Press your computer's Del key, or click Organize and then click Delete in the drop-down menu. Doing so will move the Temp folder's contents into the Recycle Bin. You'll need to empty the Recycle Bin in order to permanently remove these files from your computer."
    },
    {
      "title": "Open Start and click the text box.",
      "content": "Open Start and click the text box. Click the Windows logo in the bottom-left corner of the screen, then click the search field at the bottom of the Start menu."
    },
    {
      "title": "Type in internet options.",
      "content": "Type in internet options . Doing so will search your computer for the Internet Options program."
    },
    {
      "title": "Click Internet Options.",
      "content": "Click Internet Options . It's the globe-shaped icon at the top of the Start window."
    },
    {
      "title": "Click Settings on the \"General\" tab.",
      "content": "Click Settings on the \"General\" tab. It's in the lower-right corner of the \"Browsing history\" section of the window. Internet Options should open to the General tab by default. If it doesn't, click General at the top first. If you only want to delete your browsing history and not all temporary internet files, you can click Delete under \"Browsing history\" instead. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click View files.",
      "content": "Click View files . This option is near the bottom-right corner of the window."
    },
    {
      "title": "Select the files.",
      "content": "Select the files. Click Organize again and then click Select all , or press the Ctrl and A keys at the same time."
    },
    {
      "title": "Delete the files.",
      "content": "Delete the files. Press your computer's Del key, or click Organize and then click Delete in the drop-down menu. Doing so will send the Internet cache folder's files to the Recycle Bin. You'll need to empty the Recycle Bin in order to permanently remove these files from your computer."
    }
  ]
}