{
  "url": "https://www.wikihow.com/Deal-With-a-Hippo-Encounter",
  "title": "How to Deal With a Hippo Encounter",
  "steps": [
    {
      "title": "Steer clear of hippos.",
      "content": "Steer clear of hippos. Hippos are territorial and become aggressive when they feel threatened, so respect their space. Keep on their good side by giving them a wide berth when you spot them in the water. Do not attempt to travel down waterways that are choked with numerous hippos. A hippo’s “yawn” is actually a warning sign that you are approaching too near. [1] X Research source"
    },
    {
      "title": "Avoid hippos in shallow water.",
      "content": "Avoid hippos in shallow water. As a defensive tactic, hippos prefer to stick to areas where the water is deep enough for them to fully submerge. If a hippo is forced to occupy shallow water due to drought or territorial disputes with other hippos, it will feel vulnerable and lash out with little provocation. Consider these hippos to be the most dangerous in the water, and give them an even wider berth accordingly. [2] X Research source In ideal waters, a hippo will keep as much of its body underwater as possible during the day to prevent overheating. Only the top of its head and back will break the surface so it can breathe. [3] X Research source"
    },
    {
      "title": "Alert them to your presence.",
      "content": "Alert them to your presence. Hippos are herbivores and do not regard humans as prey. [4] X Research source However, they become belligerent when startled. [5] X Research source Do not attempt to slip by them unnoticed. When you spot a hippo, announce your presence while you are still well away from it. Beat the side of your boat with your hand or strike the water’s surface a few times with a paddle. Continue slapping your boat or the water when you see a hippo go underwater. Allow it to track the sound of your progress so it knows where not to surface. Expect it to remain underwater for as long as six minutes. [6] X Research source Use a paddle or a similar long object to strike the water, since crocodiles often occupy the same waterways as hippos."
    },
    {
      "title": "Retreat.",
      "content": "Retreat. If a hippo opens its mouth in a “yawn” as you approach, reverse course immediately. Recognize that the hippo is showing off its teeth to scare you off. Back your boat away and put as much distance between the two of you as possible. Maximize the distance that it has to cover in order to reach you since hippos’ charges are very brief while in the water. [7] X Research source Should the worst happen and the hippo strikes your boat, remember that the issue is territory. Flee the area in any direction except for where you first saw the hippo, and it should lose interest in you."
    },
    {
      "title": "Stick to open areas.",
      "content": "Stick to open areas. Allow yourself a wide range of vision so that you can spot any hippos in the area long before you can reach it. Give the hippos the same opportunity to spot you from a safe distance. Remember that hippos are easily startled, but will show little interest in you if they see that you are maintaining a respectful distance. [8] X Research source Definitely steer clear of dense vegetation along the edge of waterways. If space within the waterway is limited, those hippos that have lost territorial disputes may congregate here. They will feel especially vulnerable and that much quicker to attack out of fear."
    },
    {
      "title": "Stay to the inland-side of hippos.",
      "content": "Stay to the inland-side of hippos. Remain aware of the direction of the nearest body of water. When you encounter a hippo on land, always allow it a clear path to the water. Even if you maintain a respectful distance without posing a threat to the hippo, anticipate that some other factor may startle it at any time. Expect it to flee for the safety of the water. Keep well out of its path. [9] X Research source Should you find yourself in front of a hippo running for the water, flee to either side. The hippo has no interest in you, but it may outrun you or see you as a threat if you run for the water as well."
    },
    {
      "title": "Keep your eyes peeled for dung signs.",
      "content": "Keep your eyes peeled for dung signs. Hippos use their feces to mark paths between waterways and food sources inland. Expect these paths to be traveled continuously, especially at night. [10] X Research source Look for dung that has been sprayed over a wide area, rather than a neat pile, since hippos use their tails to spread their poop around as they excrete. If possible, do not strike camp near a dung trail, because hippos are nocturnal and will use the path at night. If you are forced to camp near one, do not start a fire or use any other lights, since these will spark their interest. [11] X Research source"
    },
    {
      "title": "Run for cover.",
      "content": "Run for cover. If a hippo charges you, be aware that hippos can reach speeds of 30 miles per hour (45 kph). [12] X Research source Do not try to outrun a hippo in a straight sprint. Seek cover immediately. If no buildings or vehicles are in sight, use natural cover and obstacles like trees, rocks, hills, and termite mounds to slow the hippo’s momentum. If a hippo charges you, remember that it is because you have intruded on its territory. Once you have gained enough distance from there, it should give up the chase."
    },
    {
      "title": "Beware of hippos in the mating season.",
      "content": "Beware of hippos in the mating season. Regard the males as especially dangerous at this time of the year. Expect them to already be keyed up and aggressive due to fierce competition between themselves for mates. [13] X Research source Hippos typically mate at the start of the rainy season, but may do so at other times of the year as well. [14] X Research source Always be on the lookout for males fighting each other to the death, which is a contest for breeding rights to a female. West Africa's rainy season lasts from June until September. South Africa experiences theirs between October and April. East Africa sees two rainy seasons per year, with one lasting from March until May, followed by a second that lasts from October through December. [15] X Research source"
    },
    {
      "title": "Avoid boating in the dry season.",
      "content": "Avoid boating in the dry season. Expect hippos to act even more territorial as waterways shrink in size. Look for hippos crowding closer toward the middle of the waterway to remain submerged. Anticipate the added danger of having less and less maneuvering room for yourself. Also be aware that their food sources have most likely dried up as well at this time of the year, which will further agitate them. The later in the dry season, the more dangerous hippos will be. In West Africa, the dry season extends from November until April. Southern Africa sees its dry season from November until March. East Africa experiences two dry seasons, one lasting from December until February and a second between June and September."
    },
    {
      "title": "Expect them on land at night.",
      "content": "Expect them on land at night. Hippos are nocturnal. During the day, expect to see them resting in the water to stay cool. At night, travel carefully, because hippos will leave the water to seek out food. Minimize the risk of startling them in the dark. Stick to open areas to increase both of your chances of spotting each other from a distance. Travel slowly to avoid stumbling upon them with no warning. [16] X Research source Hippos may travel as far as 3 miles (5 km) from their waterways in the search for food. They may also resettle in smaller bodies of water farther inland. [17] X Research source"
    },
    {
      "title": "Leave calves alone.",
      "content": "Leave calves alone. You should never interact with a young hippo no matter how they may look or how tempting it may be. Mother Hippos are ferociously protective of their young and will readily come to their defense if they feel that their young are threatened in any way. [18] X Research source Recognize a fully grown hippo as standing at roughly 5 feet tall (1.5 m). [19] X Research source Consider anything shorter than that as a calf, since calves will remain with their mother until they have fully grown. [20] X Research source Remember that just because you only see the calf doesn't mean the mother isn't somewhere nearby."
    }
  ]
}