{
  "url": "https://www.wikihow.com/Do-70s-Hair",
  "title": "How to Do 70s Hair",
  "steps": [
    {
      "title": "Brush your hair into a side part.",
      "content": "Brush your hair into a side part. To make a pageboy cut, you will do a lot of molding and styling. It's important to start out with smooth, flat hair. To start, take a brush and run it through your hair. Brush your hair so it's neat and tangle free to start. Then, do a side part. You can part your hair to whichever side is most flattering for you. Since your hair needs to be flat, this style will only work on curly or textured hair if it's first blown out and straightened."
    },
    {
      "title": "Section off your hair.",
      "content": "Section off your hair. On the side of your hair with more head, section off the front half of your hair. Use a brush to gather that hair together and secure it with a clip or hair ties."
    },
    {
      "title": "Back comb the back section of your hair.",
      "content": "Back comb the back section of your hair. Take a comb and tease the hair in the back of your head. Back comb your hair to create a slight amount of volume. Use quick backwards brush strokes to back comb your hair. Do not back comb extensively, but do it just enough to lift your hair slightly."
    },
    {
      "title": "Back comb the top section.",
      "content": "Back comb the top section. When you're done backcombing the back of your hair, back comb the front portions of your hair not secured in clips. Use the same quick motions and remember to back comb just enough to create slight volume."
    },
    {
      "title": "Smooth out your hair with a brush.",
      "content": "Smooth out your hair with a brush. After back combing both sections of your hair, take your brush again. Use your brush to smooth over the hair you just backcombed. Tuck the brush under your hair and pull it through each strand of hair. Comb out your hair until the surface looks smooth, but your hair has a slight amount of volume due to the previous backcombing."
    },
    {
      "title": "Clip your hair.",
      "content": "Clip your hair. After your hair is smoothed out slightly, put hair clips near the bottom of your hair surrounding your head. Feel where the hair naturally bumps slightly near the ends of your locks. Secure clips here, using enough clips that a circle of hair clips flattens your hair and draws out the natural bump at the end of each lock. The amount of clips you need depends on the thickness of your hair. Thicker hair will need more clips. Bobby pins may be used as an alternative to clips."
    },
    {
      "title": "Release your clipped hair.",
      "content": "Release your clipped hair. Release the hair you originally clipped when making your side part. Run the brush under this portion of your hair, working it into a curve. Keep brushing until the clipped portion of your hair falls slightly over your forehead in a neat, single curl."
    },
    {
      "title": "Smooth out and mold your hair.",
      "content": "Smooth out and mold your hair. You should now have the rough position of a pageboy cut. From there, use your fingers to gently mold your hair into the right shape. Build up the bumps near the ends of your locks and flatten your large curl near your forehead. When your hair is in your desired shape, use some hairspray to set the look."
    },
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. To create 70s waves, you should start with clean hair. Wash and shampoo your hair using a clarifying shampoo. Avoid any heavy shampoos or products, as these can weigh down your hair and interfere with the waves."
    },
    {
      "title": "Blow dry your hair.",
      "content": "Blow dry your hair. Tilt the blow dryer away from your face. Blow dry your hair in upwards motion so the hair is being blown away from your face. Fully dry your hair. Make sure to blow dry your hair in the direction of the hair shaft to prevent frizz. For example, if the hair naturally falls at a zero degree angle, the blow dryer should be facing down the hair shaft to prevent frizz. You can part your hair in the middle or off to the side slightly, but avoid a deep side part for this look."
    },
    {
      "title": "Curl your hair away from your face.",
      "content": "Curl your hair away from your face. After your hair is mostly dry, use a curling iron. Separate your hair into one to two sections and curl each section one strand at a time. Make sure the curls all point away from your face. This helps with the 70s look. If you have bangs, curl them as well. You should always apply a heat protectant product before curling your hair, if it wasn't applied prior to blow drying. Your hair should be fully dried before you curl it or the heat will cause damage and breakage."
    },
    {
      "title": "Tease your hair.",
      "content": "Tease your hair. Once your curls are done, take a brush and run it through the curls. Starting at the roots, comb through the curls and tease your hair slightly. This will create volume. Use your fingers to flip your hair back further, creating a feathered look."
    },
    {
      "title": "Set your hair with hairspray.",
      "content": "Set your hair with hairspray. Once your hair is curled to your liking, take some hairspray. Spritz on a light layer to set your curls and keep your hair shape in tact. If you dislike hairspray, you can use mousse or hair gel instead."
    },
    {
      "title": "Leave your hair slightly damp.",
      "content": "Leave your hair slightly damp. Wash your hair as you normally would and let it dry until it's slightly damp. If you blow dry your hair, only blow dry it until it's slightly damp."
    },
    {
      "title": "Apply hair rollers to the top of your hair.",
      "content": "Apply hair rollers to the top of your hair. Take large hair curlers and use your fingers to section off a small section near the front of your head. Strand by strand, secure the front of your hair with the curlers. Use your fingers to work the hair around the curlers and leave them in place as you proceed."
    },
    {
      "title": "Place rollers in the rest of your hair.",
      "content": "Place rollers in the rest of your hair. Once your hair in front is sectioned off, roll the remainder of your hair in the rollers. Use your fingers to roll your into the curlers strand by strand. When you're done, all of your hair should be secured in curlers."
    },
    {
      "title": "Leave the rollers in for at least an hour.",
      "content": "Leave the rollers in for at least an hour. The longer you leave the rollers in, the larger your curls will be. Most hair will set in about an hour, but leave your curlers in longer if you want bigger, more dramatic hair. If your hair is thick, it may not fully dry after just an hour. You may need to leave them in longer."
    },
    {
      "title": "Remove each roller.",
      "content": "Remove each roller. After letting your rollers sit, slowly remove each roller. Use your fingers to twist the rollers out of each strand of hair."
    },
    {
      "title": "Tease your hair with your fingers.",
      "content": "Tease your hair with your fingers. After the rollers are removed, tease your hair. Work your fingers through each strand of hair to straighten your hair, reduce frizz, and create slightly more volume. When done, you should have a feathered 70s style. If you want, you can set the look with a spritz of hairspray."
    }
  ]
}