{
  "url": "https://www.wikihow.com/Find-Saturn",
  "title": "How to Find Saturn",
  "steps": [
    {
      "title": "Learn Saturn's relation to Earth's rotation.",
      "content": "Learn Saturn's relation to Earth's rotation. Earth rotates around the sun once a year, while it takes Saturn about twenty nine and a half years to make the same rotation. Saturn is visible for at least part of every year when Earth passes between Saturn and the Sun. [1] X Research source Depending on the time of year and the relation of our planets, Saturn may be easier or more difficult to locate in the night sky."
    },
    {
      "title": "Locate Saturn's future path of travel.",
      "content": "Locate Saturn's future path of travel. If you want to locate Saturn, it would be difficult to just point your telescope into the sky and start blindly sweeping around. You have to know where to look, as well as what to look for. Consult a star chart that displays the path of Saturn and pick a time that it will be nearest a recognizable constellation. [2] X Research source Starting in 2014, Saturn can be seen close to the constellation Libra, moving on later that year to Scorpius. In may of 2015, Saturn will retrograde, meaning it will move from East to West, back toward Libra. This would be a prime viewing opportunity to find Saturn. Over the next ten years, Saturn will move steadily East in the sky of the Northern hemisphere, toward Capricornus. During a period of 2017, Saturn will become invisible to stargazers from Earth, as it will be too close to the Sun for us to see it."
    },
    {
      "title": "Pick a date when Saturn is \"opposed\" to the Sun.",
      "content": "Pick a date when Saturn is \"opposed\" to the Sun. The opposition refers to the projected point at which Saturn will be closest to the Earth and brightest in the sky. This occurs roughly once every 378 days. During its oppositional period, Saturn will be due South in the Northern hemisphere and due North in the Southern hemisphere, most visible around midnight, local time. Oppositional dates from 2014-2022 are: May 10, 2014 May 23, 2015 June 3, 2016 June 15, 2017 June 27, 2018 July 9, 2019 July 20, 2020 August 2, 2021 August 14, 2022"
    },
    {
      "title": "Locate the constellation",
      "content": "Locate the constellation nearest Saturn's current position to use as a guide. When you've gotten a sense of Saturn's path, you'll first need to locate a constellation to use as a focal point to start scanning from. Basically, you want to familiarize yourself with the constellation its closest to and then use a chart of Saturn's position to find out exactly where to look in relation to that star. [3] X Research source In 2014, that constellation will be Libra, while in January of 2016, it will be directly North of the Antares star in the constellation Scorpius. You can look at Saturn's path here: http://www.nakedeyeplanets.com/saturn.htm If you're viewing on an oppositional date, aim your telescope due South."
    },
    {
      "title": "Look for a golden color shining steadily.",
      "content": "Look for a golden color shining steadily. Typically, Saturn will appear to have a yellowish-golden hue and won't twinkle like stars do. Because Saturn is a planet, it may not be as bright or instantly noticeable as some stars, because it doesn't shimmer. Use your constellation as a point of reference and look for a color difference."
    },
    {
      "title": "Use a telescope.",
      "content": "Use a telescope. While Saturn itself is visible with the naked eye, it's a shame to try to find it and not be able to enjoy its distinctive rings, which are visible with a basic telescope. Using a telescope will make the job much easier, as Saturn will appear to be a distinctly different shape than other bodies in the sky. If you've got a powerful telescope with a yellow filter, that can help isolate the particular light in Saturn's spectrum, making it easier and more pleasurable to see."
    },
    {
      "title": "Look for the dark edges.",
      "content": "Look for the dark edges. The planet will be darkened with shadow from the rings, giving an almost 3-dimensional appearance and an oblong quality when seen through a telescope. [4] X Research source"
    },
    {
      "title": "Check out the rings.",
      "content": "Check out the rings. If you've got a good enough telescope to see the rings, you'll notice that they'll look flat, but create a more rounded and marble-like quality to the planet itself. You should also be able to distinguish between the A (outside) and B (inside) ring belts on the planet, which are pretty much the coolest thing in the sky. [5] X Research source"
    },
    {
      "title": "Check out the moons.",
      "content": "Check out the moons. Aside from its famous rings, Saturn is also notable for the presences of its many moons, which are often visible in the foreground of the planet if the viewing conditions are right and you've got a powerful enough telescope. There's even an app for that. [6] X Research source"
    },
    {
      "title": "Get familiar with basic stargazing.",
      "content": "Get familiar with basic stargazing . You don't have to be looking for anything in particular to get started, but it helps to develop some familiarity with basic constellations and star charts."
    },
    {
      "title": "Get away from the city.",
      "content": "Get away from the city. If you live in an urban environment, it's important to get away from light pollution that keeps much of the night sky invisible to even halfway decent telescopes or binoculars. Find a good viewing location or join other amateur astronomers in your town to get tips about trips or clubs you might hook up with. [7] X Research source"
    },
    {
      "title": "Go stargazing on good viewing nights.",
      "content": "Go stargazing on good viewing nights. There's nothing more frustrating than getting your gear together, checking over all your charts, packing the hot cocoa and then--poof--the clouds roll in. Make sure you've picked a night with good weather and a relatively clear sky. Keep abreast of the weather patterns during the time of year you hope to find constellations or planets. [8] X Research source"
    },
    {
      "title": "Start with binoculars.",
      "content": "Start with binoculars. Binoculars are an easy way to get started as an amateur astronomer. If you don't have access to a telescope, use any old pair of binoculars. They're user-friendly and often just as good as cheaper telescopes. [9] X Research source Once you've gotten comfortable finding things in the night sky and you want to up the ante a bit, consider investing in a good quality telescope for viewing. Consider splitting the cost of a good one with some other astronomers and sharing the use of it. To view Saturn, a basic telescope would be more than sufficient for the beginner. If you want to get fancy, though, NexStar features telescope in the $800 range that locate objects in the sky for you by programming them in, while a professional 11-inch Schmidt Cassegrain runs in the neighborhood of $1,200. Get something to match your budget and commitment."
    },
    {
      "title": "Visit an observatory in your area.",
      "content": "Visit an observatory in your area. Astronomers are an enthusiastic bunch, usually excited to share their knowledge. There's no substitute for learning from the experts, especially if you're interested in finding an object in the sky with as many variables as Saturn. Look at their calendar and plan on making a visit during a particularly ripe viewing period for whatever you're interested in seeing, then use the techniques and advice they offer in your future stargazing sessions. If you want to make a pilgrimage, Griffith Observatory in Los Angeles is probably the most famous observatory in America, while the Yerkes Observatory in Wisconsin and the McDonald Observatory in West Texas also offer equally stunning options in other regions of the country."
    }
  ]
}