{
  "url": "https://www.wikihow.com/Create-a-.Com-Email-Address",
  "title": "How to Create a .Com Email Address",
  "steps": [
    {
      "title": "Open the GoDaddy package selection page.",
      "content": "Open the GoDaddy package selection page. Go to https://www.godaddy.com/hosting/web-hosting/ in your computer's web browser. If you don't have an account with GoDaddy, you can create one by clicking Sign In in the top-right corner of the page, clicking the Create an account link at the bottom of the page, and following the prompts."
    },
    {
      "title": "Sign up for the basic package.",
      "content": "Sign up for the basic package. To do so: Scroll down and click Add to Cart under the \"Economy\" heading. Select additional plan options if desired. Scroll down and click Continue With These Options Add a domain if you like, or click No thanks to pass. Sign into GoDaddy if you aren't already signed in. Enter your billing and payment information, then check out."
    },
    {
      "title": "Open your GoDaddy account.",
      "content": "Open your GoDaddy account. Go to https://www.godaddy.com/ and click the person-shaped logo in the top-right corner of the page, then click Account Settings in the resulting drop-down menu."
    },
    {
      "title": "Click My Products.",
      "content": "Click My Products . It's a tab in the upper-left side of the page."
    },
    {
      "title": "Scroll down to the \"Workspace Email\" heading.",
      "content": "Scroll down to the \"Workspace Email\" heading. This option is near the middle of the page."
    },
    {
      "title": "Click Manage All.",
      "content": "Click Manage All . It's to the right of the \"Workspace Email\" heading. Doing so will open a new page from which you can create your .com email address."
    },
    {
      "title": "Enter your preferred email address.",
      "content": "Enter your preferred email address. In the \"Email address\" text box, type in the email address that you want to create, making sure to use your preferred domain name."
    },
    {
      "title": "Enter a password for the email address.",
      "content": "Enter a password for the email address. Type your preferred password into the \"Password\" and \"Confirm password\" text fields."
    },
    {
      "title": "Click Create.",
      "content": "Click Create . This option is at the bottom of the page. Doing so will create your email address, though it will take a few minutes to be ready for use."
    },
    {
      "title": "Open the Zoho Mail site.",
      "content": "Open the Zoho Mail site. Go to https://www.zoho.com/mail/ in your browser. Zoho Mail is a site that offers free hosting for one email address, allowing you to create one \".com\" email for yourself."
    },
    {
      "title": "Click SIGN UP NOW.",
      "content": "Click SIGN UP NOW . It's a red button on the right side of the page."
    },
    {
      "title": "Scroll down to the \"FREE PLAN\" heading.",
      "content": "Scroll down to the \"FREE PLAN\" heading. You'll find this option near the bottom of the page."
    },
    {
      "title": "Click GET STARTED.",
      "content": "Click GET STARTED . It's in the \"FREE PLAN\" section. Doing so will take you to the beginning of the setup process."
    },
    {
      "title": "Enter your website's address.",
      "content": "Enter your website's address. Type your website's domain address into the text field in the middle of the page."
    },
    {
      "title": "Click Add.",
      "content": "Click Add . It's to the right of the text field."
    },
    {
      "title": "Enter your account details.",
      "content": "Enter your account details. Fill out each of the boxes on this page, making sure to use a working phone number at which you can receive text messages."
    },
    {
      "title": "Check the \"I agree\" box.",
      "content": "Check the \"I agree\" box. It's near the bottom of the page."
    },
    {
      "title": "Click Sign Up.",
      "content": "Click Sign Up . This option is at the bottom of the page. Doing so will prompt Zoho to send a verification text message to your phone number."
    },
    {
      "title": "Verify your account.",
      "content": "Verify your account. To do so: Open your phone's Messages app. Open the text from Zoho. Note the verification code in the text. Enter the verification code into the text box in the middle of the setup page. Click VERIFY MY MOBILE"
    },
    {
      "title": "Click the CNAME Method tab.",
      "content": "Click the CNAME Method tab. It's at the top of the page. This is the easiest method of website verification."
    },
    {
      "title": "Select a website host.",
      "content": "Select a website host. Click the drop-down box near the top of the page, then click your domain host's name (e.g., GoDaddy ) in the resulting drop-down menu."
    },
    {
      "title": "Verify that you own your domain.",
      "content": "Verify that you own your domain. While this process will vary slightly depending on your selected domain host, you'll generally follow these steps: Copy the \"Name / Host / Value / CNAME\" code by selecting it and pressing Ctrl + C (Windows) or ⌘ Command + C (Mac). Open your website's domain settings page (or DNS Management, etc.). Click ADD or NEW , then select CNAME . Set the \"Type\" value to CNAME Paste the copied code into the \"Name\", \"Host\", \"Value\", or \"CNAME\" text box by pressing Ctrl + V (or ⌘ Command + V ). Copy the \"Value / Points to / Destination\" code. Paste this code into the similarly titled text box in the settings page. Save your changes. Click Proceed to CNAME Verification , then click Verify Now when prompted. If you don't see this prompt, wait for a few minutes before trying again."
    },
    {
      "title": "Enter a username.",
      "content": "Enter a username. In the text box at the top of the page, enter the name that you want to use with your customized email address."
    },
    {
      "title": "Click Create Account.",
      "content": "Click Create Account . It's a grey button below the text box."
    },
    {
      "title": "Skip to the \"Configure Email Delivery\" page.",
      "content": "Skip to the \"Configure Email Delivery\" page. Click Skip in the lower-right side of the page twice."
    },
    {
      "title": "Set up your domain service to send email to Zoho.",
      "content": "Set up your domain service to send email to Zoho. This is what will guide incoming email into your inbox. To do so: [1] X Research source Open the domain service's settings page. Click ADD or NEW , then select MX or MX Record Type @ into the \"Host\" field. Type mx.zoho.com into the \"Points to\" field. Type 10 into the \"Priority\" field. Save this record by clicking Save or OK Repeat this process with the @ symbol, the \"Points to\" value mx2.zoho.com , and the priority level 20 ."
    },
    {
      "title": "Follow any instructions on the \"Email Migration\" page if necessary.",
      "content": "Follow any instructions on the \"Email Migration\" page if necessary. If you want to move your existing inbox's contents over to Zoho, you'll have to follow the instructions on the \"Email Migration\" page to complete the process. You can also just click Skip in the bottom-right side of the page to skip this step. You can find specific instructions on using Zoho with your selected email platform on the \"Mail Client Configuration\" page as well."
    },
    {
      "title": "Access your Zoho inbox.",
      "content": "Access your Zoho inbox. You can go to https://workplace.zoho.com/ and click Mail to view your Zoho inbox, which functions like any other email service. There's also a free Zoho Email app that you can download and sign into on iPhone and Android."
    },
    {
      "title": "Find a paid domain hosting service.",
      "content": "Find a paid domain hosting service. If you haven't yet registered your domain with a hosting service, you'll need to find a hosting service such as GoDaddy or FastComet. If you already have your domain hosted on a service, you can usually set up a domain email address from within the service's email settings page."
    },
    {
      "title": "Select a paid package.",
      "content": "Select a paid package. Most email hosting services have various packages which include different perks, such as increased storage space or access to online tools. Pick the package that works best for your needs."
    },
    {
      "title": "Enter your account details.",
      "content": "Enter your account details. This will generally include the following information: Basic information (e.g., your name, phone number, preferred username, etc.) Domain information (your website's address, login credentials, etc.) Payment information (your credit or debit card number and billing address)"
    },
    {
      "title": "Purchase the package.",
      "content": "Purchase the package. Completing the purchase will allow you to begin using your hosted email address."
    },
    {
      "title": "Follow any setup instructions.",
      "content": "Follow any setup instructions. Most hosting services will either send an email or display a page with setup instructions regarding moving your current email's contents over, setting up your email inbox with your website, and so on. [2] X Research source You may also have to pick a username and/or a style of inbox (e.g., Microsoft Outlook) here."
    },
    {
      "title": "Use your selected service's email app.",
      "content": "Use your selected service's email app. If your selected email service comes with its own built-in email inbox or email app, you can view and manage your emails using this service rather than setting up another inbox to use your service's settings."
    }
  ]
}