{
  "url": "https://www.wikihow.com/Get-Smaller-Butt-and-Thighs-Without-Exercising",
  "title": "How to Get Smaller Butt and Thighs Without Exercising",
  "steps": [
    {
      "title": "Choose healthy foods.",
      "content": "Choose healthy foods. There are many choices about what to drink and eat. One of them, junk food, for instance, usually has added salt and sugar and is high in saturated fat. Probably one of the biggest issues with it, though, is that it often tastes better than healthy food. It’s okay to have junk food sometimes but the rest of the time, it’s best to eat more nutritious food. Some of the ways to make better choices include reading food labels and swapping junk food from the five food groups. [1] X Research source These five groups consist of: legumes/beans and vegetables; whole grain foods; poultry and lean meats, fish, eggs, tofu, nuts and seeds; and milk and yogurt cheese. Most people don't really know what they eat on a daily basis. Log your food for a week or so and then come up with a plan of action for the week moving forward. It doesn't need to be rigid, but it is going to make you be a little bit more intentional and healthy about your meals."
    },
    {
      "title": "Master the art of portion control.",
      "content": "Master the art of portion control. If you’re not into exercising, portion control is important. If you discipline yourself to do this, you can try a little of everything. It’s a way to eat better, yet you don’t feel that you’re sacrificing so much that it’s cramping your lifestyle. [2] X Research source"
    },
    {
      "title": "Make gradual improvements to your diet.",
      "content": "Make gradual improvements to your diet. It’s well-known that diet plays a huge role in a physically fit body. Don’t try and change your food choices overnight, though. Take small steps, and you’ll get there. Start eating more vegetables at first, for instance. Then cut out sugary sodas. [3] X Research source After that, choose fruit over fattening desserts. Next, start eating whole wheat bread instead of white bread. Then, cut out eating candy at work. Overtime, these small actions turn into good habits. If you can't see yourself following a diet long term, it's probably not the best starting point for you."
    },
    {
      "title": "Allow yourself a cheat meal every once in a while.",
      "content": "Allow yourself a cheat meal every once in a while. Most people who have a low percentage of body fat still indulge in their favorite foods from time to time. Eating what you want every once in a while ensures that you don’t get bitter about having a healthy diet. It also means that you won’t end up binging on the foods you feel you’re missing out on. So enjoy that cookie or piece of chocolate from time to time. Just don’t let it become so frequent that you can no longer say to yourself that you have a healthy diet. [4] X Research source If you’re eating the right amount of food for your body type and the right type of food, it’s only natural that the different parts of your body, like your butt and thighs, will eventually be in proportion to one another. The idea is not to diet but to make healthy eating a part of having a fit lifestyle. [5] X Research source"
    },
    {
      "title": "Look for more action-oriented ways to do your chores.",
      "content": "Look for more action-oriented ways to do your chores. Use a push lawnmower instead of a riding lawnmower. If you are accustomed to using a riding lawnmower because of the size of your lawn, divide your lawn into sections and mow each section on separate days. Use a shovel instead of a snow blower. Use a rake instead of a leaf blower. Wash your car yourself versus taking it through the car wash."
    },
    {
      "title": "Do your housework to energetic songs that you love.",
      "content": "Do your housework to energetic songs that you love. You can’t help but dance to it. Slow dancing burns approximately 3 to 4 calories a minute, and fast dancing burns about 8 calories a minute. If you dance while doing the housework, you’ll be in the mid-range of about 5 calories a minute. So dance your way to a smaller butt and thighs while getting your housework done more quickly. [6] X Research source Reader Poll: We asked 157 wikiHow readers if they found cardio effective for losing weight, and 73% of them said yes. [Take Poll] Dancing around your house while you clean totally counts!"
    },
    {
      "title": "Be that person that doesn’t try to stay in shape.",
      "content": "Be that person that doesn’t try to stay in shape. You do this is by building up a set of habits over the years that help you stay fit without putting in a ton of effort. This happens overtime by making good lifestyle choices. Pick weekend activities that keep you moving like hiking and bicycling. Don’t be a couch potato. Overall, sitting for too long is not good. Basically this means that whenever you can, get up and move. [7] X Research source"
    },
    {
      "title": "Replace your office chair with a stability ball.",
      "content": "Replace your office chair with a stability ball. All the way around, sitting on a ball is much better for you. It requires good posture, and unlike sitting in an office chair, you can’t slouch. Also sitting on a ball activates the core muscles of your back, hips and abdomen. When one part of your body gets in shape, it means that the other parts of your body, like your butt and thighs, receive benefit, too. [8] X Research source"
    },
    {
      "title": "Wear a weighted vest around your torso.",
      "content": "Wear a weighted vest around your torso. This is a perfect investment if you don’t like to exercise. You can wear it when you’re cleaning the house or washing the car. A vest gives you an additional 20 pounds of weight to hold. You can even just walk around wearing it for 30 minutes a day. It will help you build muscle and burn calories, all without exercising. [9] X Research source"
    },
    {
      "title": "Stand, instead of sitting.",
      "content": "Stand, instead of sitting. Your metabolism and fat-burning enzymes are more active when you stand, and you’ll burn up a couple hundred extra calories, too. So the next time you’re waiting at the doctor or dentist’s office, waiting to get on the bus, talking on the phone, or waiting in line to renew your driver’s license, stand instead of sit and visualize your thighs and butt getting slimmer as you do so."
    },
    {
      "title": "Take the stairs instead of the elevator or escalator whenever possible.",
      "content": "Take the stairs instead of the elevator or escalator whenever possible. Climbing the stairs is an easily accessible activity that fires and firms your glutes. For every 20 minutes of stair climbing, depending on your weight, you burn anywhere from 130 to 170 calories. The more calories you burn, the less fat your body stores, especially in fatty areas, like your butt and thighs."
    },
    {
      "title": "Ride your bicycle instead of driving your car whenever possible.",
      "content": "Ride your bicycle instead of driving your car whenever possible. Because you are using the lower part of your body to pedal, it’s highly beneficial to both your legs and buttocks. Bicycling is also not hard on the body because it’s low impact. Most people who ride a bike on a regular basis say that there glutes are much tighter than they were before they started riding. The reason this area gets toned is because your butt muscles are engaged when you cycle."
    },
    {
      "title": "Park far away.",
      "content": "Park far away. Many people when they can’t find a parking spot get really bent out of shape. Well next time, use this to your advantage by parking blocks away, and happily walk to where you need to go. You’ll not only be moving your butt, thighs and the rest of you, but you’ll be burning calories, too. Also it’s even more advantageous if you just ate because you store less fat after a meal if you walk afterwards."
    },
    {
      "title": "Use a pedometer.",
      "content": "Use a pedometer. Studies show that just by wearing a pedometer that you walk 27 percent more than usual. It usually ends up being at least 1 extra mile a day. Even if you’re not into exercising, it will just happen naturally that you’ll choose to walk more. Walking 1 mile a day takes about 15-20 minutes to complete, which adds up to burning about 8 pounds per year. [10] X Research source"
    }
  ]
}