{
  "url": "https://www.wikihow.com/Dopamine-Dressing",
  "title": "How to Start Dopamine Dressing (And Why It Can Make You Happier)",
  "steps": [
    {
      "title": "Dopamine dressing is wearing bright colors that boost your mood.",
      "content": "Dopamine dressing is wearing bright colors that boost your mood. “It’s all about wearing fun colors that make you feel good, which increases the dopamine your body releases,” Le Blanc tells us. The idea is that the clothes you wear affect your vibes and confidence, so “even if you’re not having a great day, wearing something that makes you feel good can instantly boost your mood.”"
    },
    {
      "title": "Dopamine dressing is personal and subjective.",
      "content": "Dopamine dressing is personal and subjective. Everyone’s got different tastes! While colors and patterns are often a big part of dopamine dressing, Le Blanc tells us that ultimately it’s about “dressing to uplift your mood. Wearing things that make you feel happy.” If that means wearing all black, then that’s your version of dopamine dressing! As long as you feel good, you’re doing it right."
    },
    {
      "title": "Choose a few fun colors that you love to add to your wardrobe.",
      "content": "Choose a few fun colors that you love to add to your wardrobe. Burns says to choose a base palette and then “build your wardrobe around it.” Once you’ve found a color that you enjoy, start wearing it and see how you feel. If you feel good, make that color the cornerstone of your wardrobe. Start with tops in that color, then choose bottoms that complement it. Once you have the basics down, experiment with combining new colors into your wardrobe. There’s some trial and error here, but the only “wrong” colors are the ones that make you feel off or uncomfortable, so don’t sweat it too much. Tops are usually the best and easiest items to incorporate color into, but don’t hesitate to wear fun-colored pants, shorts, shoes, or anything else!"
    },
    {
      "title": "Coordinate your colors with your hair and skin tones.",
      "content": "Coordinate your colors with your hair and skin tones. When in doubt, fall back on color seasons and color theory. According to Burns, color seasons are groups of colors that match your skin tone and naturally flatter you. Generally, if you have warm-toned skin, like yellow or gold hues, warmer colors will look better on you. And if you have cool-toned skin, cool-toned colors like blues or greens will be more flattering. Like most aspects of fashion, it’s all subjective, but it’s a helpful guide for finding out where to start!"
    },
    {
      "title": "Dress for the kind of person you want to be.",
      "content": "Dress for the kind of person you want to be. Burns offers “the jacket example”: “When you put on [a nice jacket], you become more empowered.... You take on that persona.” Think about the person you want to be and how you want to feel. Ask yourself how that person dresses, then use that as your compass for how you want to dress. Before you know it, you’ll become that person! For example, if you want to be someone who’s edgy and alternative, you might choose a black-dominant wardrobe and accessorize with silver, spiky jewelry. When you put on the outfit, you’ll feel edgier and more adventurous."
    },
    {
      "title": "Find your staples, then get adventurous.",
      "content": "Find your staples, then get adventurous. Once you’ve nailed your basics, Le Blanc encourages you to “be open to trying things you wouldn’t typically gravitate to.” This is where you really start to find your personal style and signature flair. Having that foundation lets you take risks, while still having some solid outfits to return to if those risks don’t make you totally happy. For example, maybe you’ve assembled a fun, bubbly yellow-dominant wardrobe, but want more serious options. You might play with combining yellow and black, or pushing your yellows more into brown territory."
    },
    {
      "title": "Wear a neutral color to balance and ground louder colors.",
      "content": "Wear a neutral color to balance and ground louder colors. Burns says that one way to make bright colors “pop” while balancing them out is to coordinate them with neutral colors like black, navy, brown, or dark gray, which are versatile and work with many different colors. If you wear a bright yellow top, for example, you might balance it with dark grey pants. A lavender top goes well with navy bottoms, and so on. Mixing and matching neutrals and bold colors takes a little practice, but it’s all about what looks good to your own eye and what makes you feel most confident."
    },
    {
      "title": "Go wild, and make it your own!",
      "content": "Go wild, and make it your own! “Play with bold patterns and accessories,” Le Blanc says. Or, keep it monochromatic. Take inspiration from your style icons and celebs you admire. There aren’t any rules in fashion, especially when it comes to dopamine dressing. The only rule is that your clothing makes you feel good, so don’t be afraid to put your own spin on it."
    },
    {
      "title": "Dopamine dressing became popular online during the COVID-19 pandemic.",
      "content": "Dopamine dressing became popular online during the COVID-19 pandemic. Around 2020-2021, as people got tired of being in lockdown, they turned to clothing to help salvage their moods and outlook. Influencers began showing off their dopamine fits online, spreading the trend. Big fashion brands like Loewe, Molly Goddard, and Maximilian got in on it, too, showing bold colors and flashy patterns on the 2021 runways. [1] X Research source It also took off in part because people wanted to look good for their Zoom calls (which were often their only social functions during the pandemic), looking to impress others even while on a drab video call. There are also strong historical trends that suggest that, after periods of hardship, people seek out more cheerful designs. For example, kitchen goods became more aesthetically appealing after the Great Depression. [2] X Research source That said, the idea that clothing alters your confidence isn’t anything new. Fashion designers and savvy self-stylers have known this for decades—probably even since fashion was a thing."
    },
    {
      "title": "Yes, research shows that colors influence your mood.",
      "content": "Yes, research shows that colors influence your mood. Color and psychology are closely linked. One study, published in 2011, shows a strong correlation between colors and people’s moods when it comes to interior design. Warm, bright colors (like orange or yellow) were found to be exciting and stimulating, while cooler colors (like blue or green) were more subdued—and so were the moods of the people staying in those spaces. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Why is this? It has a lot to do with the culture you're from—different cultures have different associations with different colors. [4] X Research source As a person living in that culture, you absorb these ideas yourself, like the idea that green signifies luck. While every culture is different, some ideas remain the same across many cultures, like “warm” colors being invigorating and cool colors being soothing. That said, color is also super personal! You might find blue to be calming and cheerful, but another person might find it icy and sad."
    },
    {
      "title": "Research also shows that clothing affects confidence.",
      "content": "Research also shows that clothing affects confidence. If you like fashion, this probably isn’t much of a surprise. And we have the research to back it up! One study found that the clothes you wear influence the way you think about yourself. This is sometimes called “enclothed cognition.” For example, if you dress in a suave suit or an elegant dress, you’ll think of yourself as suave and elegant. If you dress in worn-out sweatpants and a raggedy T-shirt, though, you probably won’t feel the same way. [5] X Trustworthy Source Association for Psychological Science Nonprofit organization devoted promoting trustworthy research and education in the psychological sciences Go to source Knowing that, it makes sense that combining clothing and colors is a powerful way to alter your own mood and frame of mind. Dopamine dressing can increase your own self-esteem , but it’s not a one-stop shop for things like healing emotional wounds or even therapy. It’s just one mental health tool you can use to make your life brighter."
    },
    {
      "title": "Check out Toad&Co for sustainable basics.",
      "content": "Check out Toad&Co for sustainable basics. Toad&Co started in Telluride, Colorado, in 1995 and focuses on using sustainable, eco-friendly materials and production methods, so you can feel even better about wearing your daily fit. They’re a great option to grab some staple starters like dresses, pants, skirts, and tops. They even have a \"pre-loved\" section on their site for used clothing."
    },
    {
      "title": "Poke around Depop for fashionable hand-me-downs.",
      "content": "Poke around Depop for fashionable hand-me-downs. You know what really boosts your dopamine? Buying second-hand instead of fast fashion. Depop is the preferred platform for cyber-savvy dressers. You can browse by size, item type, condition, and even vibe. And why not list some of your old clothing that doesn’t make you happy anymore so you can get paid to let someone else love it?"
    },
    {
      "title": "Hit up Warp + Weft for inclusive denim.",
      "content": "Hit up Warp + Weft for inclusive denim. Warp + Weft is a size-inclusive denim brand that’s also budget-conscious. Jeans are a major staple in dopamine dressing, providing a pop of color in clothing items that’ll last you years. But, they can be tricky to size right. Warp + Weft is here to spread the joy of denim to everyone, no matter your body type."
    },
    {
      "title": "Shop Colorful Standard for a burst of color.",
      "content": "Shop Colorful Standard for a burst of color. Colorful Standard is all about delivering every hue to your wardrobe, which is essential to dopamine dressing. Their clothing is made with recycled materials and eco-friendly packaging, so you can do right by nature while also treating yourself."
    }
  ]
}