{
  "url": "https://www.wikihow.com/Delete-a-Tweet",
  "title": "How to Delete a Tweet on Twitter: Desktop & Mobile Guide",
  "steps": [
    {
      "title": "Open the X app and tap your profile image.",
      "content": "Open the X app and tap your profile image. It's a circular icon in the top-left corner of the screen. A pop-out menu will appear. If you aren't logged into your X account, enter your email address (or username) and password before proceeding."
    },
    {
      "title": "Tap Profile.",
      "content": "Tap Profile . This option is at the top of the pop-out menu."
    },
    {
      "title": "Select the tweet you want to delete.",
      "content": "Select the tweet you want to delete. Scroll down to find the tweet you want to remove, then tap the tweet to open it. If the tweet you want to remove is a retweet rather than a tweet you posted, skip ahead to the \"Remove a retweet from your profile\" step at the end of this section."
    },
    {
      "title": "Tap the three dots.",
      "content": "Tap the three dots. It's in the upper-right corner of the tweet. Doing so prompts a pop-up menu to appear at the bottom of the screen. On Android, you'll instead see a pop-up window in the middle of the screen. If you want to delete a response that you posted to the tweet, first scroll down to the response."
    },
    {
      "title": "Tap Delete post.",
      "content": "Tap Delete post . This is the red-text option in the pop-up menu. On Android, this option is at the bottom of the pop-up window."
    },
    {
      "title": "Tap Delete when prompted.",
      "content": "Tap Delete when prompted. Doing so will remove the tweet from your profile. On Android, you'll instead tap YES when prompted. [1] X Research source"
    },
    {
      "title": "Remove a retweet from your profile.",
      "content": "Remove a retweet from your profile. If you retweeted someone else's content, you can remove it from your profile by tapping the green \"Retweet\" icon below the tweet and then tapping Undo Retweet when prompted. You may first have to scroll down a bit to see the \"Retweet\" option. You can't use the menu that you use to delete original tweets to delete a retweet."
    },
    {
      "title": "Click your profile icon on the X website.",
      "content": "Click your profile icon on the X website. You can find this at the top of the page, in the new post field. You can also find it at the bottom-left corner of the page. A drop-down menu will appear. If you aren't logged in, enter your email address (or username) and password before proceeding."
    },
    {
      "title": "Select Profile.",
      "content": "Select Profile . Your profile will open."
    },
    {
      "title": "Select a tweet.",
      "content": "Select a tweet. Scroll down to the tweet you want to delete, then click it to open it in a pop-up window. You can filter your posts by clicking the Posts , Replies , Highlights , Articles , or Media tabs. If the tweet you want to remove is a retweet rather than a tweet you posted, skip ahead to the \"Remove a retweet from your profile\" step at the end of this section."
    },
    {
      "title": "Click the three dots.",
      "content": "Click the three dots. It's in the upper-right corner of the tweet's pop-up window. This prompts a drop-down menu to appear. If you want to delete a response that you posted to the tweet, first scroll down to the response."
    },
    {
      "title": "Click Delete.",
      "content": "Click Delete . This is in the drop-down menu."
    },
    {
      "title": "Click Delete when prompted.",
      "content": "Click Delete when prompted. Doing so will remove the tweet from your profile."
    },
    {
      "title": "Remove a retweet from your profile.",
      "content": "Remove a retweet from your profile. If you retweeted someone else's content, you can remove it from your profile by clicking the green \"Retweet\" icon below the tweet. You may have to scroll down to see the \"Retweet\" icon."
    },
    {
      "title": "Can I delete more than one tweet at a time?",
      "content": "Can I delete more than one tweet at a time? X doesn't have a built-in feature to mass delete all your posts at once. However, there are third-party services such as TweetDelete and TweetDeleter that may be able to do so. Most of these services let you delete a certain number of tweets for free but require payment to mass delete tweets . Keep in mind that you must enter your login information for these services to mass delete your tweets, and this poses a security risk for your account."
    },
    {
      "title": "How do I hide my tweets quickly?",
      "content": "How do I hide my tweets quickly? If you don't have time to delete a bunch of tweets, you can make your X profile private . [2] X Research source This feature, also known as \"protecting your posts,\" prevents just anyone from seeing your posts unless you approve them to follow you. However, keep in mind that your existing followers will still be able to see your tweets. If you want to hide tweets from existing followers, you will need to remove the followers so they can no longer see your profile. To make your Twitter/X profile private, open the menu, navigate to Settings and privacy , and select Privacy and safety . From there, select Audience and tagging and toggle on Protect your posts . Once your account is private, your tweets will remain hidden from non-followers until you make it public again."
    }
  ]
}