{
  "url": "https://www.wikihow.com/Drink-Noni-Juice",
  "title": "How to Drink Noni Juice",
  "steps": [
    {
      "title": "Let unripened fruit rest for a few days.",
      "content": "Let unripened fruit rest for a few days. Unripened noni feels hard to the touch. Set the unripened fruit on a counter. After a few days, you’ll notice the skin turning clear. When the fruit feels soft, it’s ready for use. [1] X Research source Noni juice is also sold bottled, as dried fruit, as a powder, or as a capsule. These can all be consumed immediately and may help you avoid noni juice’s nasty smell and taste."
    },
    {
      "title": "Blend the fruit in water.",
      "content": "Blend the fruit in water. Rinse the fruit off and place it in your blender. Your blender may need some water to operate. If this is the case, add a half a cup (120 mL) of cold water and add more as needed. Blend the fruit until you end up with a thick, applesauce-like juice. [2] X Research source You can slice the fruit into smaller portions if it doesn’t all fit in your blender. Since a ripened noni is soft, you can also crush it with your hands."
    },
    {
      "title": "Strain the juice to remove the seeds.",
      "content": "Strain the juice to remove the seeds. Get out a strainer or sieve. Hold it over an empty bowl or funnel placed in a serving glass. Pour your juice into the strainer and use a spatula to stir the juice so it drains. Use your spatula to scrape out any juice left in the blender. The strainer will catch the fruit’s seeds. [3] X Research source"
    },
    {
      "title": "Mix the noni juice with water.",
      "content": "Mix the noni juice with water. The blended noni juice is still thick. Add some water to thin it out and make it easier to drink. You can add as much as you need into the bowl or serving glass. [4] X Research source You only need about one fourth of a cup (60 mL) of noni juice a day. A single fruit provides enough juice for two people, so don’t hesitate to thin the juice with water."
    },
    {
      "title": "Flavor the noni juice with fruit.",
      "content": "Flavor the noni juice with fruit. Noni juice has a strong, unappealing taste. You can reduce this by turning the noni juice into a smoothie. For example, try blending five oz (.14 kg) carrots, a peeled orange, two tablespoons of coconut milk, a cup of (240 mL) coconut water, four oz (.11 kg) pineapple, two tablespoons of shredded coconut, and a cup of ice with a teaspoon of your strained noni juice. You may also simply pour a little bit of fruit juice or honey into a glass with the noni juice. It won’t completely hide the noni flavor, but you’ll get used to it over time."
    },
    {
      "title": "See a doctor before drinking the juice.",
      "content": "See a doctor before drinking the juice. Noni juice is a herbal supplement. It’s always a good idea to check with your doctor to make sure it’s safe for you to drink. Noni juice is said to have many wonderful health benefits, but these are unproven and can come with side effects. Stay in contact with your doctor in case you experience a negative reaction to the juice."
    },
    {
      "title": "Start with small quantities of noni juice.",
      "content": "Start with small quantities of noni juice. A tenth of a cup (about 30 mL) is a common starting dosage. You only need a shot of the juice per serving. As you get used to the juice, you can increase the dosage or have a second dose later in the day. Take no more than three cups (750 mL) a day. [5] X Research source For noni extract in capsule form, limit yourself to 500 mg a day. Read the label to find out how much extract is in each pill."
    },
    {
      "title": "Avoid noni juice if you are pregnant or breastfeeding.",
      "content": "Avoid noni juice if you are pregnant or breastfeeding. Noni juice has been used in the past for abortions. Although there’s no conclusive evidence proving that noni will harm fetuses or babies, it’s best to play it safe. Cut noni out of your diet for the time being."
    },
    {
      "title": "Stop drinking noni juice if you experience liver or kidney problems.",
      "content": "Stop drinking noni juice if you experience liver or kidney problems. Anyone with liver or kidney diseases should stay away from noni. Potassium and other components of noni juice will make these problems worse. Speak to your doctor to find alternative options. [6] X Research source Unexplained weight loss, fatigue, and nausea are common symptoms of these diseases. You may see skin yellowing with liver disease. Kidney disease may come with swelling in the face, hands, and feet."
    },
    {
      "title": "Avoid noni juice if you have a high potassium level.",
      "content": "Avoid noni juice if you have a high potassium level. Noni gives your body a high dose of potassium. High potassium, or hyperkalemia, affects your heartbeat and muscle operation. If your potassium level changes or you start experiencing problems, stop drinking noni juice. [7] X Research source Symptoms of high potassium include fatigue, numbness, nausea, chest pain, and heart palpitations."
    }
  ]
}