{
  "url": "https://www.wikihow.com/Get-Rid-of-Crickets",
  "title": "The Best Ways to Get Rid of Crickets Inside and Outside Your Home",
  "steps": [
    {
      "title": "Make homemade molasses traps to attract and catch crickets.",
      "content": "Make homemade molasses traps to attract and catch crickets. Fill a shallow bowl or jar with 1 part molasses and 10 parts water and thoroughly mix it together. Leave the bowl of molasses bait where you’ve seen or heard crickets in your home, or near cracks and crevices in your floorboards. The crickets will be attracted to the sweet smell of the molasses and hop inside, but they won’t be able to get back out. [1] X Research source Crickets prefer living in warm, moist areas of your home, so try placing the molasses traps in your basement, bathroom, laundry room, or attic. Empty and change the traps once or twice a week until you don’t see any more crickets inside."
    },
    {
      "title": "Sweep and vacuum to remove crickets and eggs.",
      "content": "Sweep and vacuum to remove crickets and eggs. Use a broom on hard floors to sweep up any debris, dead crickets, or eggs that have gotten inside. Then, go over any carpeted areas with a vacuum cleaner that has a high-efficiency particulate air (HEPA) filter. The suction will pull out the eggs and crickets deep in the carpet fibers. When you’re finished, empty the vacuum and dustpan into a plastic bag, and seal it shut. [2] X Research source While crickets normally prefer to lay eggs outside in the soil, they may still try to nest in warm, moist areas of your home, like in the basement or laundry room. Cricket eggs look like small grains of rice that are only a few millimeters long."
    },
    {
      "title": "Swat or smash any crickets you find.",
      "content": "Swat or smash any crickets you find. If you’re able to see the cricket, grab a flyswatter or heavy shoe and squash the bug . Use some paper towel to wipe up any remnants of the cricket that are stuck to the swatter or the floor. [3] X Research source After you kill a cricket, spray an all-purpose cleaner and disinfectant on the surface and wipe it up to get rid of any bacteria."
    },
    {
      "title": "Set adhesive traps near your home’s baseboards.",
      "content": "Set adhesive traps near your home’s baseboards. Set sticky traps along problem areas where you’ve seen crickets, like near walls, windows, and doorways. As the crickets pass over the traps, they’ll get caught in the adhesive and starve. [4] X Research source Sticky traps are non-toxic, so they’re great pest control options if you have pets or children. [5] X Expert Source Samuel Ramsey, PhD Entomologist Expert Interview. 20 January 2021. Check your sticky traps about once a week, and replace any that are full of crickets."
    },
    {
      "title": "Dust diatomaceous earth into gaps and crevices.",
      "content": "Dust diatomaceous earth into gaps and crevices. Diatomaceous earth is a fine powder that slices through the cricket’s exoskeleton to dehydrate them. Put on a dust mask before you start so you don’t inhale any of the diatomaceous earth. Apply the dust along cracks, crevices, and floorboards where you’ve seen crickets. [6] X Research source Reapply diatomaceous earth every 1–2 weeks. Avoid applying diatomaceous earth wherever pets or children can access it because it could lead to irritation. [7] X Trustworthy Source National Pesticide Information Center Organization run by Oregon State University providing objective, science-based information about pests and pesticides Go to source"
    },
    {
      "title": "Apply a spray insecticide to kill larger infestations.",
      "content": "Apply a spray insecticide to kill larger infestations. Look for an insecticide that’s specifically labeled to kill crickets. Spray the insecticide onto window sills, entryways, baseboards, and corners of the room. Let the spray dry completely. As crickets move through the treated areas in your home, they’ll quickly die out. [8] X Research source Follow all the instructions on your package of insecticides to ensure you apply it safely and properly. Standard spray insecticides with pyrethrin have to dry completely before they're safe around children and pets."
    },
    {
      "title": "Trim your lawn and overgrown vegetation.",
      "content": "Trim your lawn and overgrown vegetation. Start by mowing your lawn regularly and keeping the grass short so you don’t have hiding places for crickets to build their nests. Get rid of any weeds in your yard and trim back any bushes or tree branches that are touching the exterior walls of your home. Keep your plants trimmed back and your lawn mowed so they won't have a place to nest. [9] X Research source Get rid of climbing ivy growing on your home because crickets could climb up it and find a way to easily get inside."
    },
    {
      "title": "Clean up debris piles to remove potential nesting sites.",
      "content": "Clean up debris piles to remove potential nesting sites. Get rid of any woodpiles, grass clippings, trash, or compost that you’re storing right outside your home because they’ll attract more crickets. If you do keep any compost piles or stacks of wood in your yard, place them about 20 feet (6.1 m) away from your home to prevent crickets from getting closer. [10] X Research source Check your drains and roof gutters for leaves and other plant debris that might have piled up. Clean your gutters when they’re dirty to prevent crickets from nesting there. Keep a lid on your trash can and set it on top of wood blocks to keep crickets away from it. [11] X Research source"
    },
    {
      "title": "Sprinkle granular bait around your home’s perimeter.",
      "content": "Sprinkle granular bait around your home’s perimeter. Wait until the ground is dry and there isn’t any rain in the forecast to apply the bait trap. Open the container of bait trap and lightly spread it around the outside of your home. Apply the bait so it extends 2 feet (61 cm) out from the walls. Rather than going inside your home, crickets eat the bait on the ground and the chemicals kill the insects. [12] X Research source Typically, 2 pounds (0.91 kg) of granular bait will cover 1,000 square feet (93 m 2 ), but double-check the application instructions on the package. As an added benefit, granular bait traps are also really effective for getting rid of cockroaches. Note that granular bait contains chemicals that can be harmful to children or pets."
    },
    {
      "title": "Spray an insecticidal barrier around your home’s foundation.",
      "content": "Spray an insecticidal barrier around your home’s foundation. Look for a chemical insecticide specifically labeled to kill crickets. Use the spray wand on the insecticide to apply the chemicals so they extend 1 foot (30 cm) out from the wall and 1 foot (30 cm) up the foundation. Be sure to spray into window wells, crawl space vents, and weep holes in bricks as well. [13] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Pesticide barriers usually last for 2–3 weeks, but follow the specific reapplication instructions to keep crickets away. Insecticidal barriers aren’t as effective on bare concrete, so use granular bait traps instead. Keep pets and children away from insecticidal barriers until they’re dry since they could cause irritation."
    },
    {
      "title": "Spread an insecticide over your lawn to treat mole crickets.",
      "content": "Spread an insecticide over your lawn to treat mole crickets. Mole crickets have large bulky heads and claw-shaped front legs to dig through the soil. If you have patches of dead grass caused by mole crickets, water your lawn heavily and then wait until the evening of the next day. Spread an insecticide with neonicotinoids, organophosphates, or pyrethroids in the early summer. Water your lawn after applying the insecticide treatment so it soaks into the soil. [14] X Research source Wait for your yard to dry completely before letting pets or children out because the wet chemicals could cause irritation."
    },
    {
      "title": "Clean and declutter your home regularly.",
      "content": "Clean and declutter your home regularly. Crickets thrive in areas with clutter or debris so they have places to build their nests. Sweep and vacuum your home at least once a week to get rid of any food scraps. Be sure to throw away cardboard boxes and paper products as well because crickets will eat them or use them as nesting materials. [15] X Expert Source Samuel Ramsey, PhD Entomologist Expert Interview. 20 January 2021. Regularly clean and wipe countertops with a multi-purpose cleaner and disinfectant to kill any bacteria left from cricket droppings. Take some time to clean areas where crickets may hide, like underneath appliances and furniture."
    },
    {
      "title": "Seal cracks and openings in your home.",
      "content": "Seal cracks and openings in your home. If you notice any cracks, crevices, or gaps along the floorboards of your home, apply caulk to fill in the space and prevent crickets from getting in. [16] X Expert Source Samuel Ramsey, PhD Entomologist Expert Interview. 20 January 2021. Apply weatherstripping to doors and windows to help fill in gaps while they’re closed. Then, check your doors, windows, and any exterior vents to see if they have screens. If you notice any damage, fix the screens or replace them . [17] X Research source"
    },
    {
      "title": "Turn off bright exterior lights at night.",
      "content": "Turn off bright exterior lights at night. White, neon, or mercury vapor lights outside of your home are more likely to draw in crickets, so turn them off at night when the insects are active. Avoid turning on the lights until you’re able to replace them with yellow lights that are less attractive to crickets. [18] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source If you light your yard at night, place the lights well away from your house or use motion-activated lights so they don’t turn on as frequently. Close your blinds and shades at night so the bright glow from your home won't attract crickets."
    },
    {
      "title": "Run a dehumidifier when it’s humid.",
      "content": "Run a dehumidifier when it’s humid. Crickets thrive in warm, moist environments, so areas with high humidity, like the basement, laundry room, or bathroom are all places crickets may hide. Run your dehumidifier to draw the moisture out of the air so crickets are less likely to stick around. [19] X Research source"
    },
    {
      "title": "Spray a chili powder repellent around your home to deter crickets.",
      "content": "Spray a chili powder repellent around your home to deter crickets. Pour 2 cups (470 ml) of water into a spray bottle and add in a spoonful of chili powder . Put in a few drops of dish soap and mix the solution together. Lightly spritz baseboards, plants, and entry points with your repellent since crickets are driven away by the spicy capsaicin. [20] X Research source Add a clove of minced garlic to the solution for added power against larger cricket infestations. Reapply the spray once every 1–2 weeks to keep your home protected."
    },
    {
      "title": "Attract natural predators to your yard.",
      "content": "Attract natural predators to your yard. Lizards, spiders, and birds are natural cricket predators, so if you allow them to live on your property, they will naturally control your cricket population. Put out a bird feeder and use native plants in your landscaping to attract birds and other beneficial predators. When you see spiders or lizards in your yard, leave them alone and let them thrive so they can keep hunting crickets. [21] X Research source Spraying your property with insecticides can also get rid of a cricket’s natural predators. Limit or avoid using them outdoors if you’re able to. Pet cats will hunt crickets that get inside your home. If you have crickets tunneling in your lawn causing dead grass, spread beneficial nematodes over your yard. Nematodes infect the crickets with a bacteria that kills them. [22] X Research source"
    },
    {
      "title": "Look for light brown or black insects with long back legs.",
      "content": "Look for light brown or black insects with long back legs. The most common types of crickets you’ll deal with are house crickets and field crickets. While both kinds can grow up to around 1 inch (2.5 cm) long, house crickets have a light tan body while field crickets are usually dark brown or black. Both types of crickets have long antennae and long back legs like a grasshopper. Typically, crickets live outside, but they may find their way inside during colder weather. [23] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Crickets are harmless to humans, but their droppings may contain bacteria that could contaminate surfaces in your home. If you see crickets with a large bulky head and claw-shaped front legs in your yard, then you may have mole crickets that burrow underground and rarely get into homes. [24] X Research source"
    },
    {
      "title": "Listen for loud chirping noises.",
      "content": "Listen for loud chirping noises. When crickets are trying to attract a mate, they rub their wings together to make a loud chirping sound. If you hear a high-pitched chirping noise inside or outside that goes away as you get closer, then you may be dealing with crickets. [25] X Research source"
    },
    {
      "title": "Check for damage on clothes, upholstery, and plants.",
      "content": "Check for damage on clothes, upholstery, and plants. Crickets may chew on synthetic and natural fabrics, carpets, and garden plants when they’re hungry, so keep your eyes out for new damage. If you see frayed edges or holes on fabric, then you may be dealing with crickets that got inside your home. [26] X Research source"
    }
  ]
}