{
  "url": "https://www.wikihow.com/Dominate-a-Capuchin-Monkey",
  "title": "How to Dominate a Capuchin Monkey",
  "steps": [
    {
      "title": "Learn your Capuchin's body language.",
      "content": "Learn your Capuchin's body language. Although Capuchins do make some vocalizations, they communicate largely through their body language. Learning their body language can be a great way to understand what your monkey is saying, allowing you to work with them to meet their needs. Looking for signs of distress can help avoid any serious issues such as an attack or aggression. Smiling is not a sign of happiness. Monkeys smile or show their teeth when they are scared. Jumping up and down or banging objects together can be a show of strength and intimidation. Your monkey will likely have its own methods of expressing itself using body language. You will need to pay careful attention and learn what your monkey is trying to tell you."
    },
    {
      "title": "Learn what your Capuchin's vocalizations mean.",
      "content": "Learn what your Capuchin's vocalizations mean. While body language is the main method that your Capuchin will use to communicate, your monkey will also use vocalizations. Learning what these vocalizations mean can help you to understand and work with your monkey to keep them happy and manage their behavior. [1] X Research source [2] X Research source Loud screams can indicate a bad mood. A kind of purring is used when Capuchins meet and are comfortable with each other. Your monkey may seek to make contact with you if you are out of sight with a “ik” or “fueh” sound. If your monkey feels alarmed they may make an \"ik-a\" or \"i-tsch-g-k\" sound. A sharp whistling can also indicate your monkey feels threatened. Your monkey may make sounds that are unique. You will need to pay careful attention to what your monkey might be trying to say when making noises."
    },
    {
      "title": "Discover what upsets your Capuchin.",
      "content": "Discover what upsets your Capuchin. Although Capuchins are highly intelligent they lack impulse control and can also become upset or scared easily. Learning the common causes of inappropriate behavior in your Capuchin can help you and your monkey avoid these situations and improve your relationship. Review some of the most common triggers for poor or dangerous behavior when working with a Capuchin monkey: Social status. Your monkey may feel insecure in their social standing or try to challenge your rank as “alpha”. Territory. Capuchin's may claim items or spaces as their own and will defend them. Fear. Monkeys can easily become frightened by loud noises or fast movements. Unfulfilled life. Monkeys need a large amount of space and lots of social interaction to be happy."
    },
    {
      "title": "Understand that your monkey may never “behave”.",
      "content": "Understand that your monkey may never “behave”. Although you may offer your monkey a good home, excellent care, and training they may still never behave as you want them to. Each monkey will have its own personality and it is impossible to predict or fully control the behavior of your monkey. You may need to build a permanent large shelter or cage for a monkey that is unsafe to be around. As monkeys age their behavior will also change. This is most obvious during puberty. While you can provide a great environment and care for your monkey, this is no guarantee that they will be safe to be around."
    },
    {
      "title": "Don't show fear.",
      "content": "Don't show fear. If you monkey is acting aggressive or fearful you should not demonstrate any fear yourself. If you show fear to your monkey it may cause them to get even more aggressive and agitated. Remain calm and resist any feelings of fear or discomfort that can result from your Capuchin's behavior. Always move slowly and confidently. If bitten or scratched, try to remain calm. Never react with quick or jerky movements even if your monkey is acting aggressively towards you."
    },
    {
      "title": "Issue stern commands.",
      "content": "Issue stern commands. If your monkey is behaving in a way that is dangerous or unacceptable you must work quickly to let them know that you don't approve of that behavior. The best way to let your monkey know that you are in charge is to issue a stern command that they stop any aggressive behavior. Issuing a simple command such as “No” or “Stop” is enough. Say your command quickly and clearly, speaking loudly without screaming the command."
    },
    {
      "title": "Give your monkey time out.",
      "content": "Give your monkey time out. If you monkey is unable to calm down or is not responding to your verbal commands it's time to put them in a time out. Placing them in their cage will keep both of you safe and can also help send a message that their behavior was unacceptable. Give your monkey a time out to manage poor or dangerous behavior. Place your monkey back in their cage if they are misbehaving. A time out will allow your monkey time to calm down or escape whatever was making them nervous or aggressive. A cage for your monkey should be around 7'x7'x4' to provide plenty of space for them."
    },
    {
      "title": "Do not hit your monkey.",
      "content": "Do not hit your monkey. Hitting or violently handling your Capuchin in an effort to get them to stop aggressive behavior will only destroy trust between you both. Your monkey will come to view you as a threat instead of a friend and may still continue to act in a dangerous fashion regardless. Use only verbal commands or temporary separation to train your monkey and maintain trust. [3] X Research source Other options such as surgically removing the finger tips or canine teeth will not calm your monkey down or build trust. Hitting your monkey will only cause it to become more aggressive or fearful. Shock collars, confinement in a small cage, or other restraint won't help with behavioral issues."
    },
    {
      "title": "Prepare for a commitment.",
      "content": "Prepare for a commitment. With proper care and a good home your Capuchin monkey can live for up to 45 years. During this time your monkey will require constant care and attention. While a Capuchin monkey can be a great pet and companion you will need to be fully committed to caring for it over the course of its long life. [4] X Research source Many Capuchin monkeys live for around thirty years. Your monkey will require a great deal of care and attention. Getting a Capuchin monkey as a pet will be a long term commitment."
    },
    {
      "title": "Provide plenty of attention.",
      "content": "Provide plenty of attention. Capuchin monkeys are social and intelligent animals. In the wild they normally live with a group of other monkeys and enjoy a complex social life. You will need to provide as much social interaction as possible for your monkey in order to give them a happy and fulfilling life in your care. Young monkeys will need almost constant contact with you. As monkeys age they will require less contact. However, you will still not be able to leave them alone for more than eight hours a day."
    },
    {
      "title": "Feed your Capuchin a proper diet.",
      "content": "Feed your Capuchin a proper diet. It was once thought that pet monkeys needed to be given a simple \"pellet\" based diet. Today it is understood that monkey's diets should be as varied and nutritious as our own. Try to feed you monkey a balanced and nutritious diet to keep them happy and healthy. [5] X Research source Fruits such as mangos, pineapples, apples, pears, and grapes can be great parts of your monkey's diet. Carrots, cucumbers, and sweet corn are examples of some vegetables you can include in your monkey's diet. Boiled poultry and fish can be good sources of protein for your monkey. Trying to recreate the natural act of food scavenging can be a good way to make your monkey feel at home and get some activity. Hide some treats or put them in simple puzzles for your Capuchin to solve."
    }
  ]
}