{
  "url": "https://www.wikihow.com/Download-YouTube-Videos-in-Chrome",
  "title": "Extensions and Sites for Downloading YouTube Videos in Chrome",
  "steps": [
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. Click or double-click the Chrome app icon, which resembles a red, yellow, green, and blue sphere."
    },
    {
      "title": "Search for Crosspilot in the Google Chrome Webstore.",
      "content": "Search for Crosspilot in the Google Chrome Webstore. Go to https://chrome.google.com/webstore/search/Crosspilot to find Crosspilot in the Google Chrome Webstore."
    },
    {
      "title": "Click Crosspilot.",
      "content": "Click Crosspilot . It's the banner at the top of the search page. Crosspilot has an icon that resembles a blue cube with a \"C\" in it. Crosspilot is an extension that is primarily used to install Opera extensions on Google Chrome, but it also has a feature that allows you to download YouTube videos."
    },
    {
      "title": "Click Add to Chrome.",
      "content": "Click Add to Chrome . It's the blue button on the right side of the page at the top. This opens a pop-up alert."
    },
    {
      "title": "Click Add Extension.",
      "content": "Click Add Extension . It's in the pop-up that appears when you click the blue \"Add to Chrome\" button. This adds the extension to your Chrome browser and opens the options menu in a separate tab that requires you to grant permissions to the extension."
    },
    {
      "title": "Go to https://addoncrop.com/v27/youtube-downloader/.",
      "content": "Go to https://addoncrop.com/v27/youtube-downloader/ . Do this in your Chrome web browser."
    },
    {
      "title": "Select the browser as “Chrome” under the dropdown list.",
      "content": "Select the browser as “Chrome” under the dropdown list. Click on the button “Install Via Crosspilot”."
    },
    {
      "title": "Click Grant Permissions.",
      "content": "Click Grant Permissions . It's the green text at the bottom of the Options tab that opens when you add the Crosspilot extension. Click Allow if asked for permissions."
    },
    {
      "title": "Go to https://www.youtube.com/ in Google Chrome.",
      "content": "Go to https://www.youtube.com/ in Google Chrome. This opens the YouTube home page."
    },
    {
      "title": "Search for a video to download.",
      "content": "Search for a video to download. Search for a video by entering its name into the search bar and pressing Enter . [1] X Research source You can also browse recommended videos on the home page, or browse for videos by channels you are subscribed to in the list to the left."
    },
    {
      "title": "Click a video to open it.",
      "content": "Click a video to open it. When you find a video you want to open it, click the title or thumbnail image to open the video and play it."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . The first time you open a YouTube video, a pop-up alert will appear below the video informing you of a new option below the video."
    },
    {
      "title": "Click .",
      "content": "Click . Click the downward-facing arrow below the video to do so. This will prompt the highest available quality version of the video (excluding 1080p) to begin downloading onto your computer. By default, you can find your downloaded videos in your Downloads folder . Alternatively, you can click the icon with three dots ( ⋯ ) to the right of the video and then select a different quality. This will run the video through a third-party conversion website before downloading it, so do this at your own risk. Depending on your browser's settings , you may first have to select a save location or confirm the download before the video will actually download."
    },
    {
      "title": "Go to https://www.youtube.com/ in Google Chrome.",
      "content": "Go to https://www.youtube.com/ in Google Chrome. This opens the YouTube home page."
    },
    {
      "title": "Search for a video to download.",
      "content": "Search for a video to download. Search for a video by entering its name into the search bar and pressing Enter . [2] X Research source You can also browse recommended videos on the home page, or browse for videos by channels you are subscribed to in the list to the left."
    },
    {
      "title": "Click a video to open it.",
      "content": "Click a video to open it. When you find a video you want to open it, click the title or thumbnail image to open the video and play it."
    },
    {
      "title": "Click Share.",
      "content": "Click Share . It's the icon next to an icon that resembles a curved arrow. It's below the video playback and to the right. This opens a window that has opens for sharing the video."
    },
    {
      "title": "Click Copy.",
      "content": "Click Copy . This copies the video URL . You can also right-click the video URL in the address bar at the top of Google Chrome and click Copy ."
    },
    {
      "title": "Go to https://keepv.id/ in a new tab.",
      "content": "Go to https://keepv.id/ in a new tab. This is a website that allows you to download YouTube videos. Right-click the URL and click Open link in new tab to open the website in a new tab."
    },
    {
      "title": "Paste the YouTube video in the white bar.",
      "content": "Paste the YouTube video in the white bar. Right-click the white bar that says \"Insert video link & hit Go\", and click Paste . Alternatively, you can use the white bar to search for a YouTube video by name."
    },
    {
      "title": "Click Go.",
      "content": "Click Go . It's the red button to the side of the white bar. This opens a page that has options for downloading the video. This may also open a separate tab with an advertisement. Simply close the tab and click back over to the Keepvid tap. Be careful. Some of the ad pages contain false download links that may contain viruses or malware."
    },
    {
      "title": "Click Download Video.",
      "content": "Click Download Video . It's the pink button at the top of the page. This downloads the video to your Downloads folder. Alternatively, you can scroll down and click Download next to a video that contains a different resolution or format. The resolution for each download is listed below \"Quality\". You can also download audio-only formats. The video format (i.e. mp4, webm, mp3) is listed below \"Format\"."
    }
  ]
}