{
  "url": "https://www.wikihow.com/Find-the-Area-and-Perimeter-of-a-Rectangle",
  "title": "How to Find the Area and Perimeter of a Rectangle",
  "steps": [
    {
      "title": "Ensure you are working with a true rectangle.",
      "content": "Ensure you are working with a true rectangle. The picture above shows a rectangle where the top and bottom lines are equal in length and the sides are equal in length. The top and bottom are parallel to each other, while the sides are also parallel to each other. In addition, the sides are perpendicular (exactly 90°) to the top and bottom lengths. [4] X Research source If all four sides of the object are identical, then you have a square. Squares are a type of rectangle. If the object you are looking at does not meet these conditions, then it is not a rectangle."
    },
    {
      "title": "Write down the formula for the area of a rectangle, A = l x w.",
      "content": "Write down the formula for the area of a rectangle, A = l x w . In the formula for area (A), l is the length and w is the width of the rectangle. The units for area can be any unit for the measure of length squared: feet squared, meters squared, centimeters squared, etc. [5] X Research source You will see the units written as ft 2 , m 2 , cm 2 , etc."
    },
    {
      "title": "Identify the length and the width of the rectangle.",
      "content": "Identify the length and the width of the rectangle. The length of the rectangle is equal to the top or bottom of the rectangle. The width is equal to the side of the rectangle. Using a ruler, measure each side of the rectangle to determine the length and the width. [6] X Research source In the above example, the length is 5 cm and the width is 2 cm."
    },
    {
      "title": "Plug in the variables and solve the equation.",
      "content": "Plug in the variables and solve the equation. Using the length and width you just measured, plug them into the formula to solve for the area. Multiply the length times the width to calculate area. [7] X Research source For example, A = l x w = 5 x 2 = 10 cm 2 ."
    },
    {
      "title": "Ensure you are working with a true rectangle.",
      "content": "Ensure you are working with a true rectangle. The picture above shows a rectangle where the top and bottom lines are equal in length and the sides are equal in length. The top and bottom are parallel to each other, while the sides are also parallel to each other. In addition, the sides are perpendicular (exactly 90°) to the top and bottom lengths. [8] X Research source If all four sides of the object are identical, then you have a square. Squares are a type of rectangle. If the object you are looking at does not meet these conditions, then it is not a rectangle."
    },
    {
      "title": "Write down the formula for the perimeter of a rectangle, P = 2(l + w).",
      "content": "Write down the formula for the perimeter of a rectangle, P = 2(l + w) . [9] X Research source In the formula for the perimeter (P) of a rectangle, l is the length and w is the width. You might also see the formula written as P = 2l + 2w . This is the same formula written in a slightly different way. The units for perimeter can be any unit for the measure of length: feet, miles, meters, centimeters, etc."
    },
    {
      "title": "Identify the length and the width of the rectangle.",
      "content": "Identify the length and the width of the rectangle. The length of the rectangle is equal to the top or bottom of the rectangle. The width is equal to the side of the rectangle. Using a ruler, measure each side of the rectangle to determine the length and the width. [10] X Research source In the above example, the length is 5 cm and the width is 2 cm."
    },
    {
      "title": "Plug in the variables and solve the equation.",
      "content": "Plug in the variables and solve the equation. Using the length and width you just measured, plug them into the formula to solve for the perimeter. There are two ways to solve the equation depending on which formula you have used. For P = 2(l +w) , add the length and the width together and multiply by 2. For P = 2l + 2w , multiply the length by 2 and the width by 2, then add these products together. [11] X Research source For example, P = 2(l + w) = 2(2 + 5) = 2(7) = 14 cm. For example, P = 2l + 2w = (2 x 2) + (2 x 5) = 4 + 10 = 14 cm."
    }
  ]
}