{
  "url": "https://www.wikihow.com/Enable-Flash-Player-on-Mac",
  "title": "How to Enable Flash Player on Mac",
  "steps": [
    {
      "title": "Install Adobe Flash Player from Adobe's website.",
      "content": "Install Adobe Flash Player from Adobe's website. Installing Adobe Flash Player on your Mac is needed because Flash is not built into Safari. Make sure you've installed the app before moving forward with this method."
    },
    {
      "title": "Open Safari.",
      "content": "Open Safari. It's the compass icon on the Dock, which is usually at the bottom of the screen."
    },
    {
      "title": "Click the Safari menu.",
      "content": "Click the Safari menu. It's at the top of the screen to the right of the Apple menu."
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . It's near the top of the menu."
    },
    {
      "title": "Click the Websites tab.",
      "content": "Click the Websites tab. It's the tab with a globe icon at the top of the window."
    },
    {
      "title": "Check the box next to \"Adobe Flash Player.\"",
      "content": "Check the box next to \"Adobe Flash Player.\" It's at the bottom of the left panel under \"Plug-ins.\" This will enable Adobe Flash Player in your Safari Browser."
    },
    {
      "title": "Select On from the “When visiting other websites” menu.",
      "content": "Select On from the “When visiting other websites” menu. It's at the bottom-right corner of the window. This tells Adobe Flash Player to run whenever you visit different websites. This way you won’t have to continuously approve Flash Player whenever you load a new page. If you don't want Flash to run automatically, select Ask instead. You'll be prompted to approve Flash any time a website tries to display it. Click the red circle at the top-left corner to exit Preferences when you are done."
    },
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. You'll usually find it in the Applications folder or on the Launchpad. Since Flash comes with Google Chrome, you won't need to download any extra apps."
    },
    {
      "title": "Click the ⁝ menu in the top right corner.",
      "content": "Click the ⁝ menu in the top right corner."
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . It should be near the bottom."
    },
    {
      "title": "Click Advanced.",
      "content": "Click Advanced . It should be near the bottom when you scroll down."
    },
    {
      "title": "Select Content Settings.",
      "content": "Select Content Settings . It will also be near the bottom after scrolling."
    },
    {
      "title": "Click Flash in the menu.",
      "content": "Click Flash in the menu."
    },
    {
      "title": "Slide the switch to the On position.",
      "content": "Slide the switch to the On position. It will be blue when it's on. If the switch is already blue then Flash is enabled and you won't need to change anything."
    },
    {
      "title": "Visit a site that uses Flash Player.",
      "content": "Visit a site that uses Flash Player. Websites with video or embedded games typically use Flash Player."
    },
    {
      "title": "Click Click to Enable Adobe Flash Player when it appears.",
      "content": "Click Click to Enable Adobe Flash Player when it appears. It will come up with an image of a puzzle piece."
    },
    {
      "title": "Click Allow to enable Flash Player for that site.",
      "content": "Click Allow to enable Flash Player for that site. You'll need to do this every time you open Chrome as it will reset the settings when you exit."
    }
  ]
}