{
  "url": "https://www.wikihow.com/Edit-Your-Profile-on-WhatsApp",
  "title": "2 Quick Ways to Customize Your Profile on WhatsApp",
  "steps": [
    {
      "title": "Open WhatsApp Messenger.",
      "content": "Open WhatsApp Messenger. The WhatsApp icon looks like a green box with a white speech balloon and a telephone in it. [1] X Research source"
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . On iPhone, this is at the bottom-right corner. On Android, tap ⋮ in the top-right corner first."
    },
    {
      "title": "Tap your profile photo.",
      "content": "Tap your profile photo. This is at the top of the page. You'll open the edit page for your profile."
    },
    {
      "title": "Change your profile picture.",
      "content": "Change your profile picture. Tap your current profile picture at the top to open the menu. Then, do the following: Select Camera Roll or Gallery . Select a new photo. Zoom in or out if necessary. Tap Done ."
    },
    {
      "title": "Change your profile name.",
      "content": "Change your profile name. Tap the pencil icon next to your current display name. Delete the current name, and then enter a new one. Tap Done when finished."
    },
    {
      "title": "Change your information.",
      "content": "Change your information. Tap the pencil icon next to your current information. You can choose to select a prefilled option or enter a custom biography. You can use up to 139 characters. Tap Done when finished."
    },
    {
      "title": "Open the WhatsApp desktop app.",
      "content": "Open the WhatsApp desktop app. You can also use WhatsApp in a browser at https://web.whatsapp.com/ . If you aren't already logged in, do so now."
    },
    {
      "title": "Click your profile photo icon.",
      "content": "Click your profile photo icon. This is at the top of the screen. [2] X Research source Alternatively, you can click ⋮ > Settings > your profile photo."
    },
    {
      "title": "Change your profile picture.",
      "content": "Change your profile picture. If you have an existing photo, hover over the photo and click Change profile photo . Select Take photo or Upload photo . Take or select a new photo from your computer. Zoom in or out if necessary. Click the checkmark when finished."
    },
    {
      "title": "Change your profile name.",
      "content": "Change your profile name. Click the pencil icon next to your current display name. Delete the current name, and then enter a new one. Click Done when finished."
    },
    {
      "title": "Change your information.",
      "content": "Change your information. Click the pencil icon next to your current information. You can choose to select a prefilled option or enter a custom biography. You can use up to 139 characters. Click the checkmark when finished."
    }
  ]
}