{
  "url": "https://www.wikihow.com/Eat-a-Raw-Chestnut",
  "title": "How to Eat a Raw Chestnut",
  "steps": [
    {
      "title": "Shop for chestnuts.",
      "content": "Shop for chestnuts. Chestnut season generally starts in December, right before the holidays. While you can buy chestnuts by the scoop, it is recommended that you choose each chestnut individually, as there are always a few duds in the bunch. When picking out your chestnut, make sure to pick a nut that is round, with no holes and no black areas. Holes can be attributed to bugs and black areas usually imply mold, so examine your chestnut carefully before purchasing. [1] X Research source A good chestnut should be heavy for its size, with shiny skin that is stretched tightly. The chestnut should also be a rich, brown color. [2] X Research source"
    },
    {
      "title": "Give your chestnut a chance to ripen.",
      "content": "Give your chestnut a chance to ripen. Chestnuts taste best when they are completely dry and ripe. After purchasing your chestnuts, leave them out on your counter for between one to three days. During this time, the carbohydrates in your chestnuts will turn to sugars so your nuts will taste perfectly sweet. To test if your chestnut is ripe, try giving it a good shake. If it rattles, that means the chestnut is old and should be thrown out."
    },
    {
      "title": "Store your chestnuts.",
      "content": "Store your chestnuts. If you pick your chestnuts in a forest, store them for 7 – 10 days before peeling and eating. This will help reduce tannins and make your raw chestnuts more digestible. [3] X Research source Chestnuts have a shelf life of two – three weeks. [4] X Research source Never allow raw chestnuts to freeze and thaw. Store your chestnuts in a covered container in the coldest part of your fridge."
    },
    {
      "title": "Peel your chestnut with a chestnut knife.",
      "content": "Peel your chestnut with a chestnut knife. Raw chestnuts are very difficult to peel and are traditionally peeled by boiling or roasting the chestnut. To peel the chestnut without applying heat, use a chestnut knife. Make an incision at the bottom of your chestnut. Using your chestnut knife, chisel your chestnut until all the skin is gone and only the nut remains. [5] X Research source Chestnut knives can be purchased on Amazon for approximately $10.00 Peel your chestnut very slowly and carefully. The knife is very sharp and often gets stuck inside the skin, so proceed with caution."
    },
    {
      "title": "Eat your raw chestnut.",
      "content": "Eat your raw chestnut. Depending on where your chestnut originated, it may or may not be safe to eat raw. American chestnuts have high concentrations of tannic acid and will make you ill if you eat them raw. [6] X Research source European chestnuts may or may not be eaten raw, depending on the chestnut. Asian chestnuts are generally approved to eat raw, but there is no guarantee that eating a raw chestnut will not make you ill. Before purchasing your chestnuts, ask their country of origin and double-check that they are safe to eat raw. Because of the dangers of eating raw chestnuts, they are rarely used in recipes without first being cooked. Conkers, which are a variety of chestnut grown in Europe, should be kept away from animals, as they may prove mildly poisonous. [7] X Research source"
    },
    {
      "title": "Cut your chestnut.",
      "content": "Cut your chestnut. Place the chestnut flat side down on a cutting board and using a sharp knife, make an incision horizontally across the chestnut. This incision is important because it will keep your chestnut from exploding in the microwave. [8] X Research source You can also try scoring the bottom of your chestnut. To do this, take a knife and draw an X on the bottom of your chestnut. Be careful not to cut into the meat of the chestnut."
    },
    {
      "title": "Wash and microwave your chestnut.",
      "content": "Wash and microwave your chestnut. Place your chestnut in a bowl and gently wash it in the sink using cold water. [9] X Research source Drain the water from the bowl before placing the bowl in the microwave. Microwave the chestnut for one minute. Do not heat more than eight chestnuts together at once. If you heat more than eight at the same time, the heat will not reach the bottom chestnuts. [10] X Research source Make sure to keep an eye on your chestnuts while they are in the microwave, as chestnuts tend to explode when left unattended. To prevent your chestnuts from exploding in the microwave, make your incisions longer and deeper. If you prefer not to microwave your chestnuts, you can also try boiling them in hot water for 30 minutes. Make sure to let them cool off before touching them again. [11] X Research source"
    },
    {
      "title": "Peel your chestnut.",
      "content": "Peel your chestnut. Holding your chestnut in your dominant hand, squeeze the chestnut until the skin begins to peel away from the incision site. You should now be able to easily peel the skin off your chestnut. [12] X Research source Peel your chestnut while it’s still hot. Peeling a cold chestnut is nearly impossible."
    },
    {
      "title": "Eat your chestnut.",
      "content": "Eat your chestnut. Do not eat your chestnut if any of the brown skin remains, as this skin is very bitter tasting. If you encounter any of the remaining skin, cut or peel it off before enjoying the rest of your nut. [13] X Research source"
    },
    {
      "title": "Roast your chestnuts in your oven.",
      "content": "Roast your chestnuts in your oven. Preheat your oven to 425 F. Cut and wash your chestnuts as you would if you were microwaving them. Place your chestnuts in a baking pan, with the incision side facing up. Cook for twenty-five minutes before taking your chestnuts out to cool and peel. Check on your chestnuts frequently. It is very easy to over or undercook them, so don’t leave them in for too long. [14] X Research source"
    },
    {
      "title": "Roast your chestnuts on an open fire.",
      "content": "Roast your chestnuts on an open fire. If you really want to get into the holiday spirit, try using a cast-iron skillet or a long-handed roaster to roast your chestnuts. Cut and wash your chestnuts as mentioned earlier and then place them into your roaster or skillet. Hold the chestnuts over the fire for 25 minutes. Every five minutes, give the chestnuts a small shake to resettle them. [15] X Research source Chestnuts will be fully cooked when the skin begins to peel away from the incision site. Allow chestnuts to cool off for ten minutes before peeling and eating."
    },
    {
      "title": "Roast your chestnuts on a charcoal grill.",
      "content": "Roast your chestnuts on a charcoal grill. Heat your grill to Medium/High. Cut and wash your chestnuts before placing them on the grates of your grill and setting the cover down. Roast the chestnuts for twenty minutes before cooling and peeling. [16] X Research source Stay close to your grill as some chestnuts will roast faster than others. Continue to check on your chestnuts frequently."
    }
  ]
}