{
  "url": "https://www.wikihow.com/Eat-Gouda-Cheese",
  "title": "How to Eat Gouda Cheese",
  "steps": [
    {
      "title": "Take off the plastic wrapping around the wheel of cheese.",
      "content": "Take off the plastic wrapping around the wheel of cheese. Tear the plastic using your fingers or the tip of a knife. Then, pull the plastic away from the cheese until the entire outer wrapping has been removed. Discard the plastic. [1] X Research source"
    },
    {
      "title": "Cut the gouda into wedges using a sharp knife.",
      "content": "Cut the gouda into wedges using a sharp knife. Place the tip of the knife at the center of the wheel. Make a straight cut from the center to the outside edge of the cheese wheel. Then, place the tip of the knife back in the center and move the blade so it’s at about a 45-degree angle from the first cut you made. Slice down into the cheese wheel and make another cut. Remove the wedge from the cheese wheel. [2] X Research source Wrap the rest of the gouda in plastic wrap or aluminum foil and store in the fridge for up to 3 weeks. [3] X Research source"
    },
    {
      "title": "Take off the wax coating if there is one.",
      "content": "Take off the wax coating if there is one. Some wheels of gouda come with a red or black wax coating that needs to removed before the cheese can be eaten. If your wheel of gouda has one, peel the wax on each wedge back with your fingers or a knife. Discard the wax pieces after you remove them. [4] X Research source"
    },
    {
      "title": "Slice the wedges of gouda horizontally for platters or sandwiches.",
      "content": "Slice the wedges of gouda horizontally for platters or sandwiches. Divide each wedge up into 4 or 5 even horizontal slices. Take the end piece near the rind (the hardened outer part of the cheese) and cut it in half crosswise to make 2 pieces. The rind on the cheese is edible, so leave it on when you're cutting up the cheese. If you don't want to eat the rind, eat around it and discard it when you're finished. [5] X Research source"
    },
    {
      "title": "Grate the gouda cheese to add to the top of recipes.",
      "content": "Grate the gouda cheese to add to the top of recipes. Place a grater over a plate or bowl. Hold the wedge of gouda in your hand and gently rub it down the sharp perforated side of the grater. Once you reach the bottom, lift the wedge of cheese off the grater, bring it back to the top, and rub it down the side of the grater again. Repeat until the whole wedge has been grated. [6] X Research source Keep your fingers away from the grater while you're grating the cheese."
    },
    {
      "title": "Pair gouda with a light, fruity wine.",
      "content": "Pair gouda with a light, fruity wine. If you prefer white wines, choose a Chardonnay or white Burgundy to enjoy with your gouda. If you’re a red wine drinker, pair your gouda with a Cabernet Sauvignon, Shiraz, Merlot, or Zinfandel to highlight the cheese's flavors. [7] X Research source"
    },
    {
      "title": "Pair gouda with a beer that has rich caramel flavors.",
      "content": "Pair gouda with a beer that has rich caramel flavors. The caramel flavor in the beer complements the sweet taste of the cheese. Amber ales, brown ales, and brown porters all go well with gouda. For aged goudas, a sweet stout is also a good choice. [8] X Research source"
    },
    {
      "title": "Pair gouda with sweet fruits.",
      "content": "Pair gouda with sweet fruits. Make a cheese platter with sliced gouda and peaches. Gouda also pairs nicely with d’Anjou pears because of the pears’ sweet, citrus flavors. [9] X Research source"
    },
    {
      "title": "Eat sliced gouda with whole grain bread.",
      "content": "Eat sliced gouda with whole grain bread. Make a grilled cheese using whole grain bread and slices of gouda cheese, or add slices of gouda to a cold sandwich. You can also serve whole grain bread on a cheese platter with slices of gouda. The heaviness of whole grain bread pairs nicely with gouda cheese. [10] X Research source"
    },
    {
      "title": "Add grated gouda to your favorite vegetable dishes.",
      "content": "Add grated gouda to your favorite vegetable dishes. Hold a cheese grater over a large bowl and grate some gouda into it. Then, when your vegetable dish is finished, sprinkle the grated gouda over the top of it. [11] X Research source Stir the grated gouda into warm vegetable dishes to help it melt."
    },
    {
      "title": "Preheat your oven to 375 °F (191 °C) and prepare a casserole dish.",
      "content": "Preheat your oven to 375 °F (191 °C) and prepare a casserole dish. Grease the casserole dish by spraying the inside of it with a cooking oil spray. If you don't have a cooking oil spray, wipe the inside of the dish down with cooking oil or butter using a paper towel. [12] X Research source"
    },
    {
      "title": "Boil 16 ounces (450 g) of macaroni for 10 minutes on a stove top.",
      "content": "Boil 16 ounces (450 g) of macaroni for 10 minutes on a stove top. Add a pinch of salt to the boiling water before you add the macaroni. While the macaroni is boiling, start preparing the cheese sauce. [13] X Research source If you don't have macaroni, use shells or another small pasta instead."
    },
    {
      "title": "Prepare the cheese sauce in a saucepan over medium heat.",
      "content": "Prepare the cheese sauce in a saucepan over medium heat. Combine 2.5 tablespoons (37 mL) of melted butter, 2 tablespoons (30 mL) of flour, 2.5 cups (590 mL) of milk, and .5 teaspoons (2.5 mL) of both salt and pepper to the sauce pan. Stir the sauce until it's smooth. [14] X Research source"
    },
    {
      "title": "Turn off the stovetop and add 4 ounces (110 g) of gouda to the sauce pan.",
      "content": "Turn off the stovetop and add 4 ounces (110 g) of gouda to the sauce pan. Stir the cheese into the sauce until it melts. [15] X Research source"
    },
    {
      "title": "Combine the pasta and sauce in the casserole dish and bake it for 15 minutes.",
      "content": "Combine the pasta and sauce in the casserole dish and bake it for 15 minutes. After 15 minutes, remove the pasta and check if it's heated all the way through. If it is, the mac and cheese is finished. If not, pop it back in the oven for a few more minutes, or until it's heated through. [16] X Research source"
    }
  ]
}