{
  "url": "https://www.wikihow.com/Find-a-Hidden-Tracker-on-a-Car",
  "title": "How to Find a Hidden GPS Tracker on a Car: Detection & Removal",
  "steps": [
    {
      "title": "Look for a small box or puck-shaped object.",
      "content": "Look for a small box or puck-shaped object. GPS trackers come in a variety of different styles, but they’re rarely bigger than a closed fist. Some are magnetic. Older trackers may have an antenna on them. Keep your vehicle manual handy to help you identify things that don’t belong on your car as you search. [1] X Research source Bring a flashlight and a mirror to help you look around corners and dark edges. Despite what you may have seen on TV, GPS trackers never look like spare or loose wires. A random wire under your hood or in the glove box may be a sign that someone did some shoddy work on your vehicle at one point, but it’s not a bug. If you do end up finding a tracker, don’t assume you’re in danger. The odds are much higher that your parents are just worried about where you’re going or your partner is scared you’re cheating."
    },
    {
      "title": "Slide under the vehicle and check the undercarriage.",
      "content": "Slide under the vehicle and check the undercarriage. Get on your back and shine your flashlight along the underside of the car. Focus on the perimeter of the underside, looking for suspicious boxes, taped-on objects, or antennas. Anything that isn’t permanently attached to your vehicle may be a tracker. If you can, get the vehicle up on jack stands . You’ll have an easier time inspecting the underside of your vehicle. If you see something odd, give it a light tug. Most tracking devices are magnetic and will detach easily. Check the gas tank first. Its large metal surface makes it an easy spot to attach a magnetic device."
    },
    {
      "title": "Inspect the wheel wells.",
      "content": "Inspect the wheel wells. Check under the plastic or metal guard that surrounds the top half of the wheel. Any tracker should be obvious here—no vehicle manufacturer puts weird boxes or metal objects in this part of the vehicle. Do you have hubcaps? Pry them off with a flathead screwdriver and check to see if anyone has placed a tracker there. You do not need to remove the wheels to search your wheel wells, but you can if you want to be super thorough."
    },
    {
      "title": "Check inside the bumpers with a mirror and by hand.",
      "content": "Check inside the bumpers with a mirror and by hand. The front and rear bumpers are a common exterior location for trackers. Bumpers are normally hollow, so pop your head underneath and use a mirror to peer inside. Run your fingers slowly along the inside rim of each bumper. If you find anything, pull it out. [2] X Research source In fringe cases, a device under the front bumper may be wired to the car's electrical system. Always compare the wiring to the manual before you remove anything."
    },
    {
      "title": "Inspect the roof if you’ve got a taller vehicle.",
      "content": "Inspect the roof if you’ve got a taller vehicle. If you’ve got an SUV, truck, or van, a lazy snoop might have thrown a tracker on the roof. Hop up on a ladder and look at the roof from multiple angles to spot anything that doesn’t belong. [3] X Research source"
    },
    {
      "title": "Pop the hood and compare what you see to models online.",
      "content": "Pop the hood and compare what you see to models online. Open the hood and check the underside of the hood’s panel for GPS trackers. Then, pull up a photo online of your make and model’s engine bay. Compare what you see online to what you’re looking at in your vehicle to identify any potential bugs. [4] X Research source Don’t start ripping things out all willy-nilly. Take your time and only pull gently on any potential trackers. The front of a car is a hot, solid metal box that is regularly inspected. This makes it a terrible spot for a tracker, so you’re unlikely to find a tracker here. If you haven’t found a tracker by now, the odds are very high that you’re in the clear here."
    },
    {
      "title": "Inspect the OBD port to see if the tracker is plugged in.",
      "content": "Inspect the OBD port to see if the tracker is plugged in. The most common location for a GPS tracker in the interior of a vehicle is the OBD port, since the tracker can power itself using your vehicle. These trackers also tend to be very accurate, since they get access to OBD data. Refer to your manual to find the OBD port—it’s typically under a panel underneath your steering wheel. [5] X Research source There should be nothing plugged into your OBD port. You should see 16 open ports with a wide opening in the middle, sort of like a VGA port. Unless you suspect you’re being tracked by someone who has access to your car, it’s extremely unlikely that there’s a bug inside of your vehicle. Someone planting a tracker would want to be able to access it easily."
    },
    {
      "title": "Check every pouch, holster, and storage compartment.",
      "content": "Check every pouch, holster, and storage compartment. Open your glovebox and the compartment in the armrest. Inspect any storage pockets on the insides of your doors. Check the pockets on the backside of each seat. You may find a tracker in one of these areas if the person who placed it was trying to slyly hide a tracker while you gave them a ride. [6] X Research source If your glovebox is packed to the brim, now is a super good time to organize it. Even if you don’t find the tracker, at least you’ll get something productive out of this whole thing."
    },
    {
      "title": "Look inside upholstery if you can access it.",
      "content": "Look inside upholstery if you can access it. Unzip seat cushions and headrests. Look under any removable parts. If you have any seat covers on the interior of the vehicle, pull them up to see if the tracker has been tucked underneath. [7] X Research source"
    },
    {
      "title": "Check underneath the seats and the floor mats.",
      "content": "Check underneath the seats and the floor mats. Shine the flashlight underneath each of the seats and run your hands along the bottom to feel for any potential trackers. If you’re unsure of whether you’ve found a tracker, compare the appearance of the two front seats to find any potential anomalies. [8] X Research source"
    },
    {
      "title": "Look inside the trunk and the spare wheel well.",
      "content": "Look inside the trunk and the spare wheel well. Pop the trunk and focus on the small crevices directly underneath the rear window before checking the rest of the trunk. Remove the spare tire and check the well thoroughly. [9] X Research source"
    },
    {
      "title": "Ask your mechanic to look for the tracker.",
      "content": "Ask your mechanic to look for the tracker. If you still haven't found a tracker, chances are good there isn't one. However, any mechanic will be ecstatic to break the monotony of their day up with a little treasure hunt for a GPS tracker. Ask your mechanic to sweep the vehicle; they’ll find the tracker if there is one. [10] X Research source Mechanics know vehicles inside and out. Unless the tracker has been magically installed inside of a door panel, they’ll spot anything that doesn’t belong. If you don’t trust your mechanic’s findings, ask a car alarm installer or a private investigator to search your vehicle."
    },
    {
      "title": "Note any Apple AirTag alerts you get on your phone.",
      "content": "Note any Apple AirTag alerts you get on your phone. If you have an iPhone and you keep picking up alerts from an Apple AirTag when you drive, it’s a huge sign that someone has placed an Apple AirTag inside of your vehicle. Open the Find My Phone app. Tap the alert and select “continue” followed by “play sound.” The tag will continue beeping until you can find it. If you do not have an iPhone, you can search for AirTags using your Android device by downloading the Tracker Detect app. Hit the scan button to search your vehicle for any AirTags."
    },
    {
      "title": "Sweep the car electronically with a bug detector.",
      "content": "Sweep the car electronically with a bug detector . Devices that actively transmit your location can be pinpointed with handheld detectors that look for radio frequencies (RF). Swing by a local surveillance/spy shop or hop online and buy an RF bug detector. Follow the instructions to sweep your vehicle for bugs. [11] X Research source The tracker may only transmit occasionally and/or when the car is running, so you may want to run a test with the ignition on. If you still can’t find a bug by this point, rest assured that there are no GPS trackers in your vehicle."
    }
  ]
}