{
  "url": "https://www.wikihow.com/Decorate-a-Diya",
  "title": "How to Decorate a Diya",
  "steps": [
    {
      "title": "Gather your diya and supplies.",
      "content": "Gather your diya and supplies. If you have multiple diya that you wish to decorate, you should gather the lamps together so you can paint these in sequence, and by having all your tools and supplies handy, you can save yourself time and effort. For this project you'll need: Acrylic paints (assorted colors) Bucket or tub Diya(s) Clear epoxy/shellac (optional; non-flammable) Glitter (optional) Glue (non-flammable) Paintbrushes Plastic plate or palette Stiff bristle brush"
    },
    {
      "title": "Clean your diya.",
      "content": "Clean your diya. If your diya is not fully cleaned, your paint might darken or your brush might gunk up, giving you an effect you hadn't intended or wanted! To clean your diya, soak it in a bucket or tub filled with warm water for about an hour, and then scrub it with your stiff bristle brush. [2] X Research source Before adding any paint to your diya, you should allow it to dry completely."
    },
    {
      "title": "Array your paint for application.",
      "content": "Array your paint for application. Pour a moderate amount of the colors you are planning to use to paint your diya onto your plastic plate or palette. From among those colors, choose one to be your base coat. Once you have decided on your base coat, you may want to add a little extra paint, as this will be spread over the entire surface of your diya lamp."
    },
    {
      "title": "Apply your base coat.",
      "content": "Apply your base coat. Now that you have your colors at the ready and your lamp is clean and dry, you can begin painting. Take your brush and dip it into your base coat color and spread this color over the entire surface of your diya. The clay of your diya lamp will likely absorb much of the paint you apply, so you may have to wait for your base coat to dry and then add another layer to your base. [3] X Research source While waiting for your base coat to dry, you might consider starting the base coat for another diya. Using a light color as the base coat may give more contrast to your later designs, causing these to pop."
    },
    {
      "title": "Add design to your backdrop.",
      "content": "Add design to your backdrop. Diwali is a popular religious festival that incorporate the use of the Diya in celebration of light's triumph over darkness. [4] X Research source [5] X Research source In this spirit, you may want to incorporate symbolic representations of light and dark, like sun and moon, or the stars shining brightly on a field of dark blue. The use of metallic colors, such as silver, gold, and copper, will give your diya a richer, more sophisticated appearance."
    },
    {
      "title": "Include finishing touches.",
      "content": "Include finishing touches. It is likely that your diya lamp will be lit at some point, so you may want to think about adding light reflective effects to it. Glitter and sequins might catch the gentle light of this small lamp and glitter softly, adding extra appeal to your decorative paint. [6] X Research source Use your glue in small amounts to adhere your reflective materials. If you are working with fine material, like glitter, you may want to use a clear epoxy/varnish, like shellac. Apply a thin layer of your clear epoxy with a brush, then sprinkle or blow your glitter onto it. Paint your epoxy in patters and then apply your glitter to create specific effects, like swirls and shapes. Use glitter to give celestial designs the appearance of twinkling."
    },
    {
      "title": "Give the contours of your diya definition.",
      "content": "Give the contours of your diya definition. Painting the edges of your lamp a darker color, like black or dark brown, will give its natural shape more definition. Applied delicately, this can give your diya an elegant aesthetic. [7] X Research source"
    },
    {
      "title": "Accumulate your bricolage tools.",
      "content": "Accumulate your bricolage tools. This includes any other diya that you may have lying around itching for eye catching design. Bricolage is art that is constructed from a wide range of available material, and can set your diya apart from the rest. [8] X Research source [9] X Research source For this decorative endeavor, you will want to have: Acrylic paints (assorted colors) Bucket or tub Diya(s) Clear epoxy/shellac (non-flammable) Glass beads (optional) Glitter (optional) Glue (non-flammable) Paintbrushes Small knick-knacks and bric-a-brac Small pebbles and stones Stiff bristle brush"
    },
    {
      "title": "Prepare your vessel.",
      "content": "Prepare your vessel. Dirtiness can ruin the bond made by your epoxy and make your bricolage design loose or delicate. You should clean your diya by soaking it in a bucket or tub filled with warm water. Do this for about an hour, and then scrub it with your stiff bristle brush. [10] X Research source Before adding any paint to your diya, you should allow it to dry completely."
    },
    {
      "title": "Prime your diya.",
      "content": "Prime your diya. You can do so by painting a base of paint over all surfaces of your diya. This will give a uniform base color and an even surface for your paint to bond with. Choosing a strong base color, like red or gold, can also give the items you glue to your lamp appeal. Allow your priming layer of paint to dry completely before moving on. If your priming layer does not look consistent, you may want to paint another layer to give it a uniform look."
    },
    {
      "title": "Apply your epoxy.",
      "content": "Apply your epoxy. Using a brush, apply your epoxy to a small section of your diya. You don't want to paint on too much adhesive; doing so will waste it, as it is likely to dry before you can attach your knick-knacks to your lamp."
    },
    {
      "title": "Attach your bric-a-brac to your diya.",
      "content": "Attach your bric-a-brac to your diya. Colored stones, glass beads, and other like material can be stuck to the area you have painted with glue in interesting shapes and designs. Be prepared to move quick, as the glue will begin drying as soon as it's applied."
    },
    {
      "title": "Highlight features with glitter.",
      "content": "Highlight features with glitter. When your bricolage design is finished and dry, you may want to consider adding depth to your artistic diya with some glitter. Aim for parts of your design that have natural prominence and further bring these out with an application of glitter. [11] X Research source"
    },
    {
      "title": "Include your identifying mark.",
      "content": "Include your identifying mark. You might want to inscribe your name inside the reservoir of your diya. Using a gold or silver paint will give your name a glittering effect under the glow of your lit lamp! If you have some other kind of mark or symbol that you identify with, this would be a distinguishing addition to your diya."
    },
    {
      "title": "Paint the symbols of Shubh Labh and Swastika on your diya.",
      "content": "Paint the symbols of Shubh Labh and Swastika on your diya. Ganesha is a divine being in the Hindu religious pantheon who is revered during Diwali. So you may want to paint his symbol, the swastika, on your diya. By putting doubled lines on the outer sides of your swastika, you can add the Shubh Labh symbol, which represents good and profit."
    },
    {
      "title": "Draw an eight-petal lotus.",
      "content": "Draw an eight-petal lotus. This symbol is representative of beauty, growth, and the formation of the universe, which makes it a fitting symbol for Diwali. You might want to draw your eight-petal lotus in its traditional form, or you could try to use geometric designs based in this traditional pattern."
    },
    {
      "title": "Incorporate rangoli into your diya designs.",
      "content": "Incorporate rangoli into your diya designs. Rangoli is a kind of folk art commonly made during Diwali. This type of art intended to bring good luck, and also is symbolic of many traditional stories. You can even use your rangoli decorated diya as part of a larger rangoli design."
    },
    {
      "title": "Paint the portrait of Lakshmi.",
      "content": "Paint the portrait of Lakshmi. This goddess in the Hindu pantheon is the symbol of wealth and prosperity. She is a common symbol during Diwali, and is a great way to personalize your diya lamp."
    },
    {
      "title": "Try to create a vermilion color for your diya.",
      "content": "Try to create a vermilion color for your diya. Vermilion might be a difficult color for you to replicate, but this opaque orange is very common during Diwali. By painting your diya this hue, you'll convey the classic feelings associated with this color to all who see it!"
    }
  ]
}