{
  "url": "https://www.wikihow.com/Fix-Hair-That-No-Longer-Holds-Color",
  "title": "Why Won’t My Hair Take Color Anymore? 7 Reasons & How to Fix It",
  "steps": [
    {
      "title": "You have porous hair.",
      "content": "You have porous hair. Hair’s porosity determines how hair absorbs and retains moisture. There are three levels of porosity: low, medium, and high. If you have medium or high porous hair, your hair has trouble keeping moisture which, in turn, causes hair color to fade faster. It can’t lock-in the dye. If your hair always feels dry, it may be because it’s porous. Try adding more hair oils , creams, and conditioning treatments to your hair care routine."
    },
    {
      "title": "Your hair is damaged.",
      "content": "Your hair is damaged. Brittle, split, and dry hair won’t take hair dye the same way healthy hair does. If your hair is damaged, the dye's chemicals will penetrate the hair cuticles differently, and you may end up with patchy or faded color. Prep your hair before you color to make sure all your strands are as healthy as they can be! Do a hair mask the night before your color treatment, or add a deep conditioner to your daily hair care routine. Check to see if your hair is too damaged to color by smoothing a section of hair tautly between your fingers. Add a drop of water to the hair, counting how long it takes to disappear. If your hair absorbs the water in less than 10 seconds, your hair needs a little extra love before dyeing. [1] X Research source"
    },
    {
      "title": "Your natural hair is too dark.",
      "content": "Your natural hair is too dark. Some colors just won’t show up on brown or black hair. If you try to dye your natural dark locks blond or a pretty pastel pink without bleach, you may be out of luck. The darker your starting color, the more work it takes to dye. [2] X Research source Stay away from yellow, pink, and orange when dyeing darker colored hair. These colors may seem vibrant on the box, but they’ll completely disappear in your hair or leave you with a brassy result. When in doubt, go to the salon! A professional hairdresser will be able to help you get a color and tone that’s just right."
    },
    {
      "title": "You didn’t leave the dye in long enough.",
      "content": "You didn’t leave the dye in long enough. The chemicals in the dye have to activate to work. If you’re dyeing your hair at home, make sure you follow the product’s instructions carefully. Try setting a timer so you can give the dye enough time to penetrate your hair cuticles but not fry your hair. [3] X Research source For a permanent color , you’re typically going to leave the dye in for 30 to 35 minutes. For bleach , be extra careful! A light dye on virgin hair will usually take between 40 and 45 minutes. Do a strand test before dyeing large sections of your hair. This will show you what the color will look like and give you an approximate dye time. [4] X Research source"
    },
    {
      "title": "You didn’t use enough dye.",
      "content": "You didn’t use enough dye. When dyeing your hair with permanent color, you want to make sure to saturate each and every strand. Not using enough dye can lead to a patchy or faded color. So, don’t be afraid to pack that color on! The last thing you want to do is go through the whole process again when the color doesn’t come out the way you’d like. [5] X Research source If you’re using permanent color , try combing or brushing the dye through your hair. This will help make sure each and every strand is covered. [6] X Research source If you’re bleaching your hair , start with the ends and work your way up, applying thin coats that cover each strand completely. [7] X Research source"
    },
    {
      "title": "You're washing your hair too often.",
      "content": "You're washing your hair too often. Whether you're using semi-permanent or permanent dye, each scrub in the shower can lead to fading. When you color your hair, you’re essentially dyeing the hair’s cuticle or keratin cells. Although permanent dyes deeply penetrate the cuticle, the cells still wear down with time and cause your fresh color to fade. [8] X Research source If you want that color to last as long as possible, try washing your hair less."
    },
    {
      "title": "You used the wrong developer.",
      "content": "You used the wrong developer. When you dye your hair, you need to mix the dye with a developer to help the color latch on to your hair. Developer is essentially hydrogen peroxide combined with a chemical solution. Basically, these chemicals react with your hair to open up your hair cuticle—more specifically, your hair’s keratin cells. If you don’t use the right developer for your hair type and color, the dye won’t work. [9] X Research source Check out these developer and hair pairings to see if you used the correct volume of developer: [10] X Research source Fine hair: Lower volume developer Normal hair: Use the recommended amount of volume developer on dye Thick hair: Higher volume developer Developer is commonly weighed in volume. The higher the volume number, the stronger the developer."
    },
    {
      "title": "Wash your hair every so often.",
      "content": "Wash your hair every so often. Spacing out when you scrub your gorgeous locks can help your color last longer. Washing your hair every day can strip it of your natural oils and color, which, in turn, strips away all the hard work of dyeing it. See how long you can go in-between washes. Start by washing every other day, and then gradually start spacing out more time between washes. [11] X Research source Your hair may get oily quickly during the first weeks of your hair washing detox, but don’t worry! A few spritzes of dry shampoo can go a long way—not to mention the power of braids or a cute headband."
    },
    {
      "title": "Wash your hair with cool water.",
      "content": "Wash your hair with cool water. Hot water can be as harmful to your dyed hair as using heat tools. When you wash your hair with hot water, your hair cuticles open and cause the color to fade. Gradually ease your way to cooler water by washing with warm water and then rinsing with cool water. Soon you’ll be able to wash your hair in colder temperatures to keep that dye fresh! [12] X Research source"
    },
    {
      "title": "Consider switching up your hair products.",
      "content": "Consider switching up your hair products. You want to use products that aid your colored hair, not damage it more. Clarifying shampoos and alcohol-based products can dry your hair out and cause your color to fade. [13] X Research source Instead, use natural products with minimal ingredients that will nourish your hair type and bring your new color to life. Look for products that are sulfate- and alcohol-free. Investing in a product that suits your colored hair needs will be a splurge you’ll appreciate in the long run."
    },
    {
      "title": "Use heat as little as possible.",
      "content": "Use heat as little as possible. Heating tools can break, damage, and fade your hair. Nowadays, there are hundreds of cute ways to style your hair without heat, so why not experiment for the health of your locks? Taking a break from heat can help repair your hair and make your color last. Try French braiding your hair, accessorizing with a headband , or tying your hair back with a fun twist . If you do need to use a heating tool, make sure to use a heat protectant and the lowest heat setting. [14] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Air-dry your hair whenever possible.",
      "content": "Air-dry your hair whenever possible. The less time with heat, the better! An easy way to reduce your use of artificial heat is by letting your hair dry naturally. Start with letting your hair air-dry every couple of days, or use heatless styling hacks that air-dry your hair while adding a bit of curl. [15] X Research source Try a method for heatless curls after you shower so you can dry and style with no heat. If you need a blow dryer, use the lowest heat setting. [16] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Protect your hair from the sun.",
      "content": "Protect your hair from the sun. Did you know that your hair can burn in the sun just like your skin? UVA and UVB rays can damage your hair cuticles and make your hair feel dry and brittle. So, the next time you go to the beach or sit outside on a sunny day, wrap a scarf around your head, wear a hat, or cover yourself with an umbrella. This will help your hair color last and keep your hair healthy. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try out an SPF hair and scalp spray if you know you’ll be in the sun for long periods of time without a scarf, hat, or umbrella."
    },
    {
      "title": "Keep your hair dry when swimming in chlorinated pools.",
      "content": "Keep your hair dry when swimming in chlorinated pools. Chlorine is a harsh chemical that can strip your hair’s color and cause more damage. Your hair is very absorbent and will suck up the chemical the moment you dive in. Staying away from chlorinated pools after dyeing your hair can help your color last longer and remain vibrant. [18] X Research source Try soaking your hair with clean water before diving in. A soaked sponge soaks up less than a dry sponge! If you do swim in a chlorinated pool, tie your hair up in a bun to keep it dry, wear a swim cap, or immediately rinse it with clean water when you get out of the pool. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use hair masks twice a week.",
      "content": "Use hair masks twice a week. This is a treat for you and your hair because a little TLC can go a long way. Hair masks are a great way to soften, smooth, and repair damaged hair. If you’re struggling with dryness and split ends, using a hair mask can help bring moisture and shine back into your beautiful locks—not to mention that the 10 minutes it takes to set are perfect for your daily dose of “me time.” [20] X Research source Leave the hair mask on for about 10 minutes, rinse with cold water, and voila! You have newly revived, nourished hair."
    },
    {
      "title": "Deep condition your hair before and after dyeing.",
      "content": "Deep condition your hair before and after dyeing. If you dye your hair regularly, you may want to start caring for your hair before and after a color treatment. Deep conditioning your hair before dyeing locks in your hair’s natural moisture, helping the color latch onto your hair. A deep condition a few days after dyeing can bring life and volume back into your hair and enrich its color. [21] X Research source"
    },
    {
      "title": "Use moisture-rich hair dye.",
      "content": "Use moisture-rich hair dye. If you’re dyeing your hair at home, picking a dye that’s rich with healthy nutrients can help repair hair while it colors. This is a great option if you color your hair regularly and want to lessen the possibility of further damage. [22] X Research source"
    },
    {
      "title": "Only brush your hair when it’s dry.",
      "content": "Only brush your hair when it’s dry. Your hair is the most vulnerable when it’s wet. Brushing wet hair can lead to split ends and breakage, so stick to using a comb when you get out of the shower. This will keep your locks happy and healthy. [23] X Research source"
    },
    {
      "title": "Invest in a good brush.",
      "content": "Invest in a good brush. Breakage is one of the more severe kinds of hair damage. There’s no way to repair broken hair strands, but there is a way to prevent them. Choose a brush with soft, smooth, and spaced-out bristles. Your hair will thank you! [24] X Research source Stay away from brushes that have plastic balls on the ends of their bristles."
    },
    {
      "title": "Try not to brush your hair too much.",
      "content": "Try not to brush your hair too much. Over brushing can cause more fallout and damage. The less you touch your hair, the better! If you have damaged or colored hair, letting it be is the best thing you can do to help it heal. So, think twice before absentmindedly reaching for your brush or running your fingers through your hair. [25] X Research source When you do brush your hair, start at the bottom and move upwards."
    },
    {
      "title": "Always use a heat protectant.",
      "content": "Always use a heat protectant. There’s no ifs, ands, or buts about it! When using heat, always use a heat protectant spray or oil to lock moisture in and shield against damage. Now, damage and heat come hand in hand. There’s no way to avoid damage altogether when it comes to heat tools, but you can help lessen the damage with heat protectants and serums. [26] X Research source There’s no better time to start using a protectant than today! The sooner you start, the less hair you’ll fry. Try to use heat only when you need to. The less you use, the less damage you’ll cause, and the more time your hair will have to heal and grow."
    },
    {
      "title": "Replace your old heat tools.",
      "content": "Replace your old heat tools. If you’ve had a heat tool for more than five years, it may be time to throw it out. The older the heat tool, the more likely its temperature gauge is out-of-whack. Ask yourself what tools you really need, and invest in a product that accommodates your colored hair needs. [27] X Research source"
    }
  ]
}