{
  "url": "https://www.wikihow.com/Crochet-a-Skirt",
  "title": "How to Crochet a Skirt",
  "steps": [
    {
      "title": "Measure your waist",
      "content": "Measure your waist . If you don't already know the waist size of the intended wearer, measure it now. Adjust the pattern as needed to fit that waist size. To measure waist size, wrap a soft measuring tape around the narrowest part of your torso, which is usually located in between the rib cage and navel. Keep the measuring tape taut but not tight, and make sure that it remains parallel to the ground. The default instructions are for a small waist measuring 32 inches (81 cm), but necessary changes for medium/34-inch (86 cm), large/37-inch (94 cm), and extra-large/39-inch (99 cm) sizes are noted, where applicable, in the substeps."
    },
    {
      "title": "Check the gauge",
      "content": "Check the gauge . Double crocheting 13 stitches should produce 4 inches (10 cm) of length, and eight rows of double crochet should create 4 inches (10 cm) of width. For best results, use a worsted weight or light worsted weight yarn. Try a G-6 (4 mm) crochet hook. If the gauge is too large, switch to a smaller hook and test it again. If the gauge is too small, switch to a larger hook and check it again. Use the same yarn and hook for all three skirt parts (waistband, skirt body, and edging)."
    },
    {
      "title": "Create a foundation chain.",
      "content": "Create a foundation chain. Attach the yarn to your crochet hook using a slip knot, then work a foundation of seven chain stitches ."
    },
    {
      "title": "Single crochet across the chain.",
      "content": "Single crochet across the chain. Single crochet once into the second chain from the hook, then work one single crochet into each remaining chain of your foundation. At the end of the row, chain one. Turn the work over."
    },
    {
      "title": "Single crochet into each stitch.",
      "content": "Single crochet into each stitch. For the second row, work one single crochet into each single crochet of the previous row. At the end of the row, chain one and turn the work."
    },
    {
      "title": "Repeat to desired length.",
      "content": "Repeat to desired length. Continue to work rows of single crochet until you reach a length that matches your measured waist size. You should use a measuring tape to check the length of your waistband, but as a general guideline, make 140 rows for a small, 148 rows for a medium, 156 rows for a large, or 164 rows for an extra-large. Note that you will need to make button holes on every sixth and eighth row. See the next step for more details."
    },
    {
      "title": "Work button holes into the band.",
      "content": "Work button holes into the band. Create a button hole on every sixth and eighth row across the waistband. To work a button hole: Single crochet once into the first two stitches. Chain two. Skip two stitches. Single crochet once into each of the last two stitches. Chain one and turn as usual. For each row following a button hole row, work one single crochet into each single crochet and two single crochet into the chain-two space."
    },
    {
      "title": "Slip stitch the edges together.",
      "content": "Slip stitch the edges together. After your final row of single crochet, match the first and last edges, then slip stitch each pair of stitches together. The stitches of both ends must line up evenly when you slip stitch them together. Completing this step should form a loop. Turn the band so that the slip stitch faces the inside. From now on, keep in mind that the slip stitch should face the “wrong” side of the skirt."
    },
    {
      "title": "Single crochet around the loop.",
      "content": "Single crochet around the loop. Turn the work so that the long edge faces you. Chain one, then single crochet once into each stitch along the side. The total number of single crochet in this step should match the total number of rows previously worked for the length of the waistband. After you complete this step, the waistband is complete. Do not fasten off the yarn, however."
    },
    {
      "title": "Double crochet across the round.",
      "content": "Double crochet across the round. Chain three, then work one double crochet into each single crochet around the length of your waistband. At the end of the round, join the last double crochet to the chain-three using a slip stitch. Note that the chain-three at the start of the row counts as your first double crochet stitch and should be treated as such. The same is also true of all other chain-three stitches that occur at the beginning of a round."
    },
    {
      "title": "Double crochet across the second round.",
      "content": "Double crochet across the second round. Chain three, then double crochet once into each double crochet of the previous row. Join the first and last stitches together with a slip stitch. After completing the second round, place six stitch markers evenly around the round. This will be approximately every 23 stitches for a small, 25 stitches for a medium, 26 stitches for a large, and 27 stitches for an extra-large"
    },
    {
      "title": "Work a decrease round.",
      "content": "Work a decrease round. Chain three. Double crochet once into each stitch until you reach the first stitch marker, then work one double crochet decrease. Repeat the same pattern across the entire round. Work one double crochet into each unmarked stitch and one double crochet decrease into each marked stitch (and the one that follows it). By the time you reach the end of the round, your stitch count should decrease by six. At the end of the round, slip stitch the first and last stitches together. To make a double crochet decrease: [2] X Research source Yarn over the hook and insert the hook into the marked stitch. Yarn over the hook and pull a loop back through to the front. Yarn over again and pull the yarn through two loops on your hook. Yarn over, then insert the hook into the next stitch. Yarn over again and draw another loop back through to the front. Yarn over and pull through two loops on the hook again. Yarn over one last time and pull through all remaining loops on your hook"
    },
    {
      "title": "Double crochet across the fourth round.",
      "content": "Double crochet across the fourth round. Chain three, then work one double crochet into each stitch of the previous round. Join the first and last stitches of the round with another slip stitch."
    },
    {
      "title": "Repeat for rounds five through nine.",
      "content": "Repeat for rounds five through nine. For the next five rounds, double crochet once into each stitch of the row immediately before the current round. Chain three at the start of each row and slip stitch the first and last stitches of each row together. At the end of the ninth round, place six stitch markers evenly around the round. This will be approximately every 22 stitches for a small, every 24 stitches for a medium, every 25 stitches for a large, and every 26 stitches for an extra-large."
    },
    {
      "title": "Work another decrease round.",
      "content": "Work another decrease round. Repeat the third round of the skirt body. At the end of the round, your total stitch count should decrease by six. Chain three at the beginning of the round and slip stitch the last and first stitches together once you reach the end of the round. Double crochet decrease into each marked stitch and the stitch that follows it. Double crochet once into each of the other stitches across the round."
    },
    {
      "title": "Double crochet across the following round.",
      "content": "Double crochet across the following round. Chain three, then double crochet once into each stitch of the previous round. Join the last stitch of the round to the first using a slip stitch. Your stitch count should not decrease in this round or in any round that follows."
    },
    {
      "title": "Repeat until you reach your desired length.",
      "content": "Repeat until you reach your desired length. Work rounds of double crochet until you reach your desired length. Chain three at the beginning of each round and slip stitch each round closed. Work one double crochet into each stitch of the round immediately before your current round. Do not fasten off the yarn at the end of the skirt body unless you do not plan to add the decorative edging. If you do wish to include the edging, keep the yarn intact."
    },
    {
      "title": "Single crochet across.",
      "content": "Single crochet across. Chain one, then work one single crochet into each stitch of the last skirt body round. At the end of the round, slip stitch the last stitch of this round to the chain-one. Note that these instructions use the same yarn for both the skirt and the edging. For an easy variation, you could fasten off the yarn at the end of the skirt body and join a second color using a slip stitch. After joining the new color, follow this steps and all the others as instructed."
    },
    {
      "title": "Chain and single crochet once at the start of the next round.",
      "content": "Chain and single crochet once at the start of the next round. Chain one, then single crochet once into the first stitch of the previous round."
    },
    {
      "title": "Work one picot.",
      "content": "Work one picot. Work four chain stitches. After the fourth chain, work one slip stitch into the first chain. This creates one bump or picot. For a smaller picot, only work three chains. For a larger picot, work five chains."
    },
    {
      "title": "Single crochet across the next four stitches.",
      "content": "Single crochet across the next four stitches. Work one single crochet into each of the next four stitches. Assuming you had 128 (small), 136 (medium), 144 (large), or 152 (extra-large) stitches at the end of your skirt body, you'll need to work one picot into every four stitches. If your final skirt body stitch count varied, change the edging pattern so that the picots will be spaced evenly apart around the bottom of the skirt."
    },
    {
      "title": "Work another picot.",
      "content": "Work another picot. As before, work four chain stitches, then slip stitch into the first of these chains. If you used a different number of chains in your first picot, continue using that same number for this picot and each one that follows."
    },
    {
      "title": "Repeat all the way around.",
      "content": "Repeat all the way around. Single crochet once into each stitch. Work one picot into every four stitch. Continue this pattern until you reach the end of the round. At the end of the round, slip stitch the last single crochet together with the first."
    },
    {
      "title": "Fasten off.",
      "content": "Fasten off. Cut the yarn, leaving a 4-inch (10-cm) tail. Pull this tail through the loop on your hook to tie off the yarn. Weave the remaining excess into the underside of the skirt."
    },
    {
      "title": "Weave a ribbon through the button holes.",
      "content": "Weave a ribbon through the button holes. Slide a ribbon through the button holes in the waistband of the skirt. Use this ribbon to tie the skirt on when worn. To prevent the ribbon from fraying, clip the ends into a \"v\" shape and/or apply seam sealant to the ends. Alternatively, slide a belt through the button holes instead of the ribbon. Completing this step completes the project."
    }
  ]
}