{
  "url": "https://www.wikihow.com/Get-Candies-in-Pok%C3%A9mon-GO",
  "title": "How to Get Candies in Pokémon GO",
  "steps": [
    {
      "title": "Locate Pokémon",
      "content": "Locate Pokémon in your area. Keep an eye on your \"nearby\" Pokémon tracking, and watch out for rustling grass near you."
    },
    {
      "title": "Catch any Pokémon you find.",
      "content": "Catch any Pokémon you find. There is a full guide to the best capturing techniques here . It'll take some practice, but with the right technique and suitable Poké Balls, you will have a good chance of catching them. Catching evolved forms of Pokémon in the wild will give you more candy than a normal catch. First evolution Pokémon give 5 candies, and second evolution Pokémon give 10 candies."
    },
    {
      "title": "Reap the rewards.",
      "content": "Reap the rewards. Each Pokémon you catch will earn you some candy. [1] X Research source"
    },
    {
      "title": "Tap the Poké Ball icon.",
      "content": "Tap the Poké Ball icon."
    },
    {
      "title": "Tap on the Pokémon Box icon.",
      "content": "Tap on the Pokémon Box icon."
    },
    {
      "title": "Select the Pokémon you would like to transfer (e.g- Drowzee) and scroll down to the 'Transfer' button.",
      "content": "Select the Pokémon you would like to transfer (e.g- Drowzee) and scroll down to the 'Transfer' button. Click it."
    },
    {
      "title": "Choose 'Yes' to transfer that Pokémon.",
      "content": "Choose 'Yes' to transfer that Pokémon. You will get candies associated with the kind of Pokémon you gave him. [2] X Research source"
    },
    {
      "title": "Acquire an egg from a PokéStop or Gym.",
      "content": "Acquire an egg from a PokéStop or Gym."
    },
    {
      "title": "Tap on the Poké Ball icon and select the Pokémon Box icon.",
      "content": "Tap on the Poké Ball icon and select the Pokémon Box icon."
    },
    {
      "title": "Drag your finger to the left or tap the 'Eggs' label in the top right corner to go to the Eggs menu.",
      "content": "Drag your finger to the left or tap the 'Eggs' label in the top right corner to go to the Eggs menu."
    },
    {
      "title": "Tap on the Egg and select the 'Start Incubation' button.",
      "content": "Tap on the Egg and select the 'Start Incubation' button. Select an incubator and then walk the distance it says to hatch your egg. When your egg hatches, you'll receive your Pokémon and some candies. [3] X Research source Better eggs give more candies. 10km eggs (purple dots on egg shell) give the most candy."
    },
    {
      "title": "Tap on a friendly gym.",
      "content": "Tap on a friendly gym. A friendly gym is a gym that is owned by your team. You don't have to add a Pokémon to the gym to feed berries to Pokémon. If you are defending a gym, you can remotely feed berries to the Pokémon in the gym. This will work the exact same as if you were actually at the gym, except that it doesn't fill the Pokémon's motivation as much."
    },
    {
      "title": "Tap on a Pokémon.",
      "content": "Tap on a Pokémon. It can be any Pokémon in the gym, as long as it is not satisfied. Satisfied Pokémon have been fed 10 berries and cannot be fed any more berries for 10 minutes."
    },
    {
      "title": "Feed the Pokémon berries.",
      "content": "Feed the Pokémon berries. Pokémon have a small chance of giving out candy when you do this."
    }
  ]
}