{
  "url": "https://www.wikihow.com/Dye-Mesh-Fabric",
  "title": "How to Dye Mesh Fabric",
  "steps": [
    {
      "title": "Start with white mesh fabric for best results.",
      "content": "Start with white mesh fabric for best results. Fabric dye is translucent, which means that it will only add to the color that is already there. In order to get the same color as the label on your bottle of dye, you must start with white fabric. If the fabric is colored, you will get a completely different color instead. [1] X Research source For example, if you try to dye yellow fabric blue, you might get green. Don't bleach your fabric to make it white; bleach can destroy most types of mesh fabric."
    },
    {
      "title": "Wash and dry the fabric to remove any surface coatings.",
      "content": "Wash and dry the fabric to remove any surface coatings. Wash the fabric in warm, soapy water. Rinse it with fresh water, then squeeze out the excess water. Don't let the fabric dry. It needs to be damp for the dye to adhere. You can try washing the fabric in a washing machine, but hand washing would be much safer. Mesh fabric is delicate."
    },
    {
      "title": "Get a bottle of fabric dye for polyester or nylon fabrics.",
      "content": "Get a bottle of fabric dye for polyester or nylon fabrics. Fabric mesh is usually made from nylon or polyester. This means that it won't take regular fabric dye. [2] X Research source You will need to use a special kind of fabric dye made for polyester fabrics. Look for labels such as: DyeMore, DyeAll, or Polyester Dye. You can find this dye in most fabric stores and craft stores. Many online stores sell it too."
    },
    {
      "title": "Bring a large steel pot of water to a simmer.",
      "content": "Bring a large steel pot of water to a simmer. Get a large, cheap, steel pot from a garage sale or thrift store, and set it on the stove. Fill it with enough water to completely submerge the fabric. Bring the water to a simmer over medium to high heat. [3] X Research source Plan on using 3 gallons (11.4 L) of water for every 1 pound (450 g) of fabric. Keep the temperature consistent. About 180 °F (82 °C) would be ideal. Do not re-use this pot for cooking. Fabric dye is toxic. Do not use an aluminum pot; it will react with the dye."
    },
    {
      "title": "Stir the dye into the water.",
      "content": "Stir the dye into the water. Shake the bottle first to mix the dye, then pour the dye into the water. How much dye you use depends on the brand, how much water you are using, and what color you want. In most cases, you'll need 1/2 bottle per 1 pound (450 g) of fabric, but double-check the instructions on the label. [4] X Research source Some packets of dye include a color intensifier. If yours contains it, you should add it in. Add a squirt of dish soap into the water and give it a stir. This will help the dye adhere better! Consider testing the color on a piece of paper towel or scrap fabric."
    },
    {
      "title": "Add the fabric to the pot and wait up to 30 minutes, stirring often.",
      "content": "Add the fabric to the pot and wait up to 30 minutes, stirring often. Place the damp fabric into the dye and press down on it with a spoon to ensure that it is completely submerged. Let the fabric sit in the water for up to 30 minutes. Stir it often to keep the fabric moving; this will help keep the color consistent. [5] X Research source Nylon-based mesh will dye much faster than polyester-based mesh. How long you leave the fabric in the pot depends on how deep you want the color to be; the longer you leave it, the darker it will turn out. As with the pot, don't use a cooking utensil to stir the fabric. Use an old spoon instead."
    },
    {
      "title": "Rinse the fabric until the water runs clear.",
      "content": "Rinse the fabric until the water runs clear. Use a pair of tongs to lift the fabric out of the pot. Squeeze out the excess dye, then rinse the fabric with warm water. Gradually lower the temperature until the water is cool. Continue rinsing until the water runs clear. [6] X Research source As with the other tools, don't use tongs that you'll be cooking with later. You can try squeezing the excess water out with the tongs, but you can do it with your hands too. Be sure to put on a pair of rubber gloves first, however. Be sure to wear gloves during this step so that you don't stain your skin."
    },
    {
      "title": "Wash, rinse, and dry the fabric.",
      "content": "Wash, rinse, and dry the fabric. Wash the fabric just like you did in the beginning with warm, soapy water. Rinse it in clear water, then hang it up to dry. Wear a pair of rubber gloves during this step so that you don't stain your hands. Be aware that the dye may stain them! If you want to, you can wash the fabric by itself in the washing machine. Run a cycle without anything in it afterwards to remove any excess dye from the machine."
    },
    {
      "title": "Spread your fabric on a flat surface lined with paper towels.",
      "content": "Spread your fabric on a flat surface lined with paper towels. This process can get messy, so work on top of a surface that can get stained. It would be a good idea to put something absorbent on top of your work surface, such as a paper towel, paper, or a piece of cardboard. This method works best on lacrosse mesh, but you can use it on other types of mesh fabric too, such as mesh shoes. This method can turn the fabric stiff, so it is not recommended for other types of garments (besides shoes)."
    },
    {
      "title": "Mix some fabric paint with enough water to get a cream-like consistency.",
      "content": "Mix some fabric paint with enough water to get a cream-like consistency. Most fabric paint is thick when you pour it out of the bottle, which will make your fabric stiff. To make it easier to work with, stiff a few drops of water into it, or however much is needed to achieve a thin, creamy consistency. Don't make the paint too thin, however, or it will bleed. [7] X Research source Screen printing ink is a great option, but you can use other types of fabric paint too. Do not use puffy paint or dimensional fabric paint. It is not the same thing."
    },
    {
      "title": "Apply the paint to the mesh with a synthetic, taklon paintbrush.",
      "content": "Apply the paint to the mesh with a synthetic, taklon paintbrush. Choose a paintbrush with synthetic taklon bristles. Dip it into the paint, then dab it against the fabric. Run the brush across the fabric going in 1 direction only; don't move the brush back-and-forth. Apply enough paint so that it soaks into the fabric. [8] X Research source Don't use a camelhair brush (too soft) or a boar bristle brush (too stiff). You can apply different colors, but be sure to rinse the brush between colors. You can use different colors to create gradients or patterns, such as argyle or stripes."
    },
    {
      "title": "Dab the excess paint with a paper towel, then let it dry.",
      "content": "Dab the excess paint with a paper towel, then let it dry. Use a clean paper towel to gently dab off any excess paint. If you painted your mesh multiple colors, use a clean paper towel for each color, otherwise you risk mixing them. Once you have dabbed off the paint, wait for it to dry. This should only take 20 to 30 minutes."
    },
    {
      "title": "Flip the fabric over and paint the back.",
      "content": "Flip the fabric over and paint the back. Some of the paint will likely have soaked through to the back of the fabric, but you still want to give it a full coat. Use the same technique as you did for the front. If you painted the mesh multiple colors, be sure to replicate the same pattern on the back. [9] X Research source Make sure that you flip the fabric over onto a clean paper towel. If the paper towel is covered with paint, the fabric can get stained."
    },
    {
      "title": "Let the fabric dry completely.",
      "content": "Let the fabric dry completely. Pat the excess paint off with a paper towel, then set the fabric off on a clean paper towel to dry. This should take another 20 to 30 minutes. Once the fabric is dry, read the instructions on your bottle of paint; some textile paints require you to heat-set the paint with an iron. [10] X Research source If you need to heat-set the fabric, cover it with a clean cloth first to keep your iron clean. if you need to heat-set the paint, set the iron's temperature to a polyester, nylon, or synthetic setting to avoid melting your fabric."
    },
    {
      "title": "Buy a can of fabric spray paint.",
      "content": "Buy a can of fabric spray paint. It looks just like regular spray paint, except that it is made for fabric. You can find it alongside the other fabric dyes and fabric paints in a fabric or craft store. This method works best on lacrosse mesh, but it may other on other types of mesh fabric too. This method may cause the fabric to turn stiff, so it is not recommended for garments."
    },
    {
      "title": "Lay your fabric out flat on a paper towel in a well-ventilated area.",
      "content": "Lay your fabric out flat on a paper towel in a well-ventilated area. Outside would be the best, but a large room with open windows would also work. Choose a flat surface that is easy to clean, and cover it with several sheets of paper towel. Once you have your surface covered, set your fabric on top. The paper towels will help soak up any excess paint and prevent it from pooling. You can also use cardboard or newspaper instead. Some types of fabric spray paint is translucent, just like fabric dye. White mesh fabric will help the color show up the best."
    },
    {
      "title": "Cover any areas that you don't want painted with painter's tape.",
      "content": "Cover any areas that you don't want painted with painter's tape. Like with fabric paint, you can paint your mesh multiple colors using this method too. Use painter's tape or masking tape to cover any areas that you don't want painted. Press the tape firmly against the mesh so that the paint doesn't seep under it. [11] X Research source For larger areas, cover the outlines with tape first, then cover the rest with cardboard."
    },
    {
      "title": "Shake the can, then apply a few light layers of paint.",
      "content": "Shake the can, then apply a few light layers of paint. Hold the can 6 to 8 inches (15 to 20 cm) away from the fabric, then apply a thin layer of paint. Work your way from side-to-side in overlapping rows. [12] X Research source Don't apply a thick layer of paint, or it will bleed under the masking tape. If you covered any parts with cardboard, hold the cardboard down."
    },
    {
      "title": "Let the paint dry 15 to 20 minutes, then repeat the process for the back.",
      "content": "Let the paint dry 15 to 20 minutes, then repeat the process for the back. Wait about 15 to 20 minutes for the paint to dry. Remove any cardboard, but leave the masking tape on. Flip the fabric over onto a clean sheet of cardboard, then paint the back. Use the same technique as you did for the front. [13] X Research source"
    },
    {
      "title": "Allow the paint dry another 15 to 20 minutes, then apply more colors, if desired.",
      "content": "Allow the paint dry another 15 to 20 minutes, then apply more colors, if desired. If you are painting your fabric multiple colors, now is the time to apply the next color. Use the same process for each color that you want to apply: paint the front, let it dry, then paint the back. [14] X Research source Cover any painted areas with cardboard so that they don't get re-painted. Remember to mask off any areas that you don't want painted."
    },
    {
      "title": "Wait for the paint to dry a final 15 to 20 minutes, then remove the tape.",
      "content": "Wait for the paint to dry a final 15 to 20 minutes, then remove the tape. Once the paint has dried, peel off any masking or painter's tape that you applied. [15] X Research source If the tape caused the paint to chip, you can fill it in with extra fabric paint and a thin, pointed paintbrush."
    },
    {
      "title": "Heat-set the paint with an iron.",
      "content": "Heat-set the paint with an iron. Read the instructions that came with your spray paint to find out whether or not it needs to be heat-set. If you need to heat-set the paint, cover the fabric with a thin cloth and use a nylon, polyester, or synthetic head setting. Make sure that the paint is completely dry before you heat-set it."
    }
  ]
}