{
  "url": "https://www.wikihow.com/Fullscreen-a-Game",
  "title": "How to Fullscreen a Game: Tips & Tricks for Windows 10/11 & macOS",
  "steps": [
    {
      "title": "Press Alt+↵ Enter.",
      "content": "Press Alt + ↵ Enter . Pressing those keys together should maximize your game window to fill the screen. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Alternatively, press Esc to minimize the game."
    },
    {
      "title": "Choose \"Full Screen\" from Game Settings.",
      "content": "Choose \"Full Screen\" from Game Settings. For games that don't recognize the keyboard shortcut, you need to navigate through the in-game menu for a \"Display/Graphics\" option. From there, you'll see \"Display Mode\" options listing Windowed or Full-Screen. Select Full-Screen."
    },
    {
      "title": "Press the green icon and select Enter Full Screen.",
      "content": "Press the green icon and select Enter Full Screen . It's in the top left corner of all Mac windowed screens and will cause the window to fill the screen. [2] X Research source"
    },
    {
      "title": "Try a keyboard shortcut.",
      "content": "Try a keyboard shortcut. Unfortunately, the keyboard shortcut for entering full screen mode on Mac is not standardized across all apps. However, a few common options that may work include control + command + F , Fn + F , and command + return . If none of those work, you can also open the View menu at the top of the screen and select Enter Full Screen . You will usually see the keyboard shortcut for the app you're using listed next to that option."
    },
    {
      "title": "Change the Display Scale.",
      "content": "Change the Display Scale. To do this, press Win + I then click System > Display . Click the drop-down menu under \"Scale/Scale and layout\" and select \"100%.\" For Mac, go to System Settings > Display . [3] X Research source"
    },
    {
      "title": "Disable Full-Screen optimization (PC only).",
      "content": "Disable Full-Screen optimization (PC only). While this setting sounds like it should help you, it could be bugged and prevent you from opening your game in full-screen mode. To turn this off for PC, right-click on your game's icon and select Properties > Compatibility > Disable fullscreen optimizations > Apply > OK ."
    },
    {
      "title": "Switch your main screen.",
      "content": "Switch your main screen. If you're using dual monitors, this may help! If you're not using dual monitors, skip this step. Right-click a blank spot on your desktop and select Display settings > Identify and switch the main display from the current monitor to another one. You can also use this fix for Macs. To switch your display, go to System Settings > Display ."
    },
    {
      "title": "Run the game in Compatibility Mode (PC only).",
      "content": "Run the game in Compatibility Mode (PC only). To do this, right-click the game's shortcut on your desktop and select Properties > Compatibility > Run this program in compatibility mode for and select an older version of Windows. Finally, select Apply > Ok ."
    },
    {
      "title": "Disable overlays.",
      "content": "Disable overlays. Sometimes, apps with overlays can prevent your game from opening in full-screen. This includes programs with overlays like Discord , Steam, and GeForce Experience ."
    },
    {
      "title": "Try some basic Windows fixes.",
      "content": "Try some basic Windows fixes. Last, but not least, you can try a few other things to see if you can get your game into Full-Screen Mode. Update your graphics drivers using Device Manager or right-click and select Run game as administrator ."
    }
  ]
}