{
  "url": "https://www.wikihow.com/Dice-Tomatoes",
  "title": "How to Chop Tomatoes: Regular, Roma, & Seedless Tomatoes",
  "steps": [
    {
      "title": "Wash your tomatoes.",
      "content": "Wash your tomatoes. Tomatoes should always be washed under the faucet prior to dicing. Make sure to remove any dirt and debris. Peel off any stickers as well."
    },
    {
      "title": "Remove the core.",
      "content": "Remove the core. A small spoon or a teaspoon can be used to remove the core of your tomato. Simply insert the tip of the spoon into the tomato's stem. Dig out the stem using the spoon and then discard it. [1] X Research source"
    },
    {
      "title": "Cut the tomato in half.",
      "content": "Cut the tomato in half. Hold the tomato with one hand and slice through it using a sharp knife. Start at the bottom of the tomato and cut it in two roughly even halves along the equator. [2] X Research source When cutting with a knife, cut with a sawing motion letting the blade do all the work. Do not force down the tomato."
    },
    {
      "title": "Cut each half into slices.",
      "content": "Cut each half into slices. Place each half of the tomato on a cutting board with the flat part facing downward. Make a series of vertical cuts length-wise to make a series of thin strips. Strips should be no more than about a centimeter in length and should be roughly even in size. [3] X Research source As you cut, use your fingers to hold the tomato in place. Try to cut with a sawing motion, letting the blade do all of the work. This helps prevent you from squishing the tomato down!"
    },
    {
      "title": "Cut across the strips to dice the tomato.",
      "content": "Cut across the strips to dice the tomato. Turn the strips sideways. Make vertical cuts across the strips, cutting the tomato into small, diced cubes. Strive to keep the space between cuts roughly even and use your fingers to hold the strips in place as you cut. When you're done, you will have a pile of diced tomatoes. [4] X Research source"
    },
    {
      "title": "Wash the tomato.",
      "content": "Wash the tomato. Wash each Roma tomato under the faucet, turning it as necessary to wash the full surface and remove dirt and debris. If the Roma tomato has any stickers on it, make sure to remove these prior to dicing."
    },
    {
      "title": "Remove the top.",
      "content": "Remove the top. Near the top of a Roma tomato, there is a small stem. Cut off the end of the tomato with the stem so you're left with one flat end. [5] X Research source Some people don't bother cutting off the stem, as it's so small it's largely unnoticeable. If you don't mind the tomato stem, you can skip this step."
    },
    {
      "title": "Cut the tomato in half.",
      "content": "Cut the tomato in half. Cut the tomato length-wise to cut it in half. Cut it with one hand and hold it in place with the other. Try to keep the two halves of the tomato in roughly even sizes. [6] X Research source"
    },
    {
      "title": "Cut the tomato into vertical slices.",
      "content": "Cut the tomato into vertical slices. Turn the two halves of your tomato sideways so you're cutting them length-wise. Make vertical cuts to cut the tomato into thin strips of roughly even sizes. [7] X Research source As Roma tomatoes are smaller than regular tomatoes, be careful when using your fingers to hold the tomato in place. Use only the tips of your fingers and be extra careful to keep your fingers away from the knife."
    },
    {
      "title": "Dice the tomato slices.",
      "content": "Dice the tomato slices. Turn your strips sideways and make a series of cuts running across the strips length-wise. This should cut your Roma tomatoes into small cubes. When you're finished, you'll be left with a pile of diced Roma tomatoes. [8] X Research source Strive to keep your cuts the same length so your diced tomatoes are roughly the same size."
    },
    {
      "title": "Cut your tomatoes in half.",
      "content": "Cut your tomatoes in half. Make a cut down the center of the tomato. Try to keep the two halves roughly the same size. [9] X Research source"
    },
    {
      "title": "Cut the halves into quarters.",
      "content": "Cut the halves into quarters. Make a series of three to four length-wise cuts across each half of your tomato. This should cut your tomato into quarters. Each quarter should be roughly the same size. [10] X Research source"
    },
    {
      "title": "Slice out the seeds.",
      "content": "Slice out the seeds. Place each quarter on a table or cutting board with the skin side facing downward. Slice a knife across the tomato to cut out the white, fleshy portion of the tomato. The seeds are attached to this portion, so they will be sliced out as well. [11] X Research source Sometimes, seeds linger on the tomato after you cut out of the fleshy portion. If any seeds did not come out, remove them with your fingertips."
    },
    {
      "title": "Avoid dicing Roma tomatoes.",
      "content": "Avoid dicing Roma tomatoes. Roma tomatoes are very small and delicate. They tend to have less seeds and the seeds can be difficult to remove without damaging the tomatoes. It's usually okay to leave the seeds of Roma tomatoes intact. [12] X Research source"
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}