{
  "url": "https://www.wikihow.com/Drive-Uphill",
  "title": "How to Drive Uphill",
  "steps": [
    {
      "title": "Accelerate as you approach the hill, but maintain a safe speed.",
      "content": "Accelerate as you approach the hill, but maintain a safe speed. Steadily increase speed as you approach the hill so inertia will help your vehicle ascend the incline. Gain inertia, but be sure to obey the posted speed limit. Accelerate gently and steadily instead of pressing hard on the gas pedal, especially in slippery conditions. [1] X Trustworthy Source State of Oregon Official website for the State of Oregon Go to source"
    },
    {
      "title": "Depress the clutch, then shift to a lower gear.",
      "content": "Depress the clutch, then shift to a lower gear. [2] X Expert Source Ibrahim Onerli Driving Instructor Expert Interview. 18 November 2019. Press the clutch, ease off of the gas pedal, and shift the gear stick 1 to 2 gears lower than your current one. When you ease off of the gas to downshift, the RPM (revolutions per minute, or how hard the engine is working) will decrease. The right RPM at which to downshift varies, so check your vehicle's manual. [3] X Research source Generally speaking, downshift to third at around 3000 to 4000 RPM, or around 30 to 40 mph (about 45 to 60 kph), and to second at 2000 to 3000 RPM, or around 20 to 30 mph (about 30 to 45 kph)."
    },
    {
      "title": "Release the clutch gradually as you step on the gas.",
      "content": "Release the clutch gradually as you step on the gas. After you've shifted to a lower gear, gradually ease off of the clutch as you gently depress the gas pedal. The RPM will continue to decrease when you're in the lower gear, so gradually press the gas pedal harder to balance the RPM with your road speed. [4] X Research source"
    },
    {
      "title": "Downshift to first or second before climbing a very steep hill.",
      "content": "Downshift to first or second before climbing a very steep hill. If you’re ascending a very steep slope or driving a heavy vehicle, downshift all the way to first or second gear before you approach the hill. If you stay in third and have trouble getting up the hill, your vehicle may slip backwards when you try to downshift. Downshift to first at a speed of 10 to 15 mph (about 15 to 25 kph)."
    },
    {
      "title": "Downshift promptly if you’re climbing the hill and start to lose speed.",
      "content": "Downshift promptly if you’re climbing the hill and start to lose speed. Third gear should be fine for moderately hilly terrain. However, you’ll need to downshift quickly if you lose speed or if your engine roars and whines, which means it’s struggling. To prevent stalling or overheating, depress the clutch, shift to second gear, then accelerate as you release the clutch. [5] X Research source If the engine is still unable to keep up with the incline and your road speed has fallen below 10 mph (about 15 kph), downshift to first gear and accelerate."
    },
    {
      "title": "Speed up as you approach the hill, but obey posted speed limits.",
      "content": "Speed up as you approach the hill, but obey posted speed limits. Steadily depress the gas pedal to accelerate before you start climbing the hill. While you want to gain momentum, be sure to keep your speed within the posted speed limit. Remember to drive slower in slippery conditions. Avoid pressing the accelerator hard and abruptly, especially if the road is wet or icy. [6] X Trustworthy Source State of Oregon Official website for the State of Oregon Go to source"
    },
    {
      "title": "Downshift if you’re ascending a steep hill or driving a heavy vehicle.",
      "content": "Downshift if you’re ascending a steep hill or driving a heavy vehicle. Unless the hill is steep, your vehicle is heavy, or you’re hauling a trailer, manually downshifting an automatic transmission isn’t absolutely necessary. That said, manually downshifting can give you more control over your speed and is easier on your engine. [7] X Research source For steep slopes that you can’t ascend at a speed faster than 10 mph (about 15 kph), shift to D1 or 1."
    },
    {
      "title": "Ease off of the gas pedal, then shift to D2 once your RPM decreases.",
      "content": "Ease off of the gas pedal, then shift to D2 once your RPM decreases. To downshift your automatic, reduce pressure on the gas pedal, press the gear stick’s release button, and move it to D2. If you’re driving at 4000 or 4500 RPM, wait to shift until your meter is around 3000 RPM, then press the gas pedal to resume a steady speed. [8] X Research source Most newer models automatically prevent the stick from shifting if the road speed and RPM are too high. If the gear stick is locked, trying shifting when the RPM has decreased to 3000."
    },
    {
      "title": "Downshift to the lowest gear if the hill is very steep.",
      "content": "Downshift to the lowest gear if the hill is very steep. For steeper hills, shift to D1, if it’s available, once you’ve slowed to 10 to 15 mph (15 to 25 kph). [9] X Expert Source Ibrahim Onerli Driving Instructor Expert Interview. 18 November 2019. Ease off of the gas, shift the gear stick to D1 or 1, then hit the accelerator to climb up the hill. [10] X Research source Additionally, if you have a newer vehicle, check for “Power” or “Hill Assist” buttons, which are settings that help make it easier to drive uphill."
    },
    {
      "title": "Leave 4 to 10 seconds of distance between you and vehicles ahead.",
      "content": "Leave 4 to 10 seconds of distance between you and vehicles ahead. To set your following distance, watch the vehicle ahead of you pass a landmark. Count “one-one thousand, two-one thousand” until your vehicle passes the chosen landmark. Depending on the hill’s grade and the road conditions, leave at least 4 seconds between you and any vehicles ahead of you. For steeper hills or slick conditions, allow for a following distance of at least 10 seconds. When driving uphill, you’ll need plenty of time to react to hidden obstacles or stalled or rolling car ahead of you. It’s especially important to leave a safe following distance if you’re driving behind a truck or heavy vehicle."
    },
    {
      "title": "Pass on hills or curves only if you can see at least 500 ft (150 m) ahead.",
      "content": "Pass on hills or curves only if you can see at least 500 ft (150 m) ahead. As a rule of thumb, pass other vehicles when driving uphill only when absolutely necessary. If, for instance, a vehicle is driving so slow that it’s affecting your ability to ascend, signal that you’re passing them with your turn indicator. Overtake them only if you can clearly see far enough ahead to complete the pass. Exact road rules vary by location. In some locations, passing on a hill or curve is legal only if there’s at least 500 ft (150 m) of visibility. For others, it’s advised to overtake another vehicle only if you can see 1 ⁄ 3 mi (0.54 km) ahead."
    },
    {
      "title": "Lower your speed when you reach the crest of the hill.",
      "content": "Lower your speed when you reach the crest of the hill. Slow down to prepare for the descent, your car will pick up speed when you drive downhill. Additionally, ease off the gas just in case you need to react to any hidden vehicles, cyclists, or road hazards just beyond the hill’s crest. Be especially cautious if you aren't familiar with the road’s twists and turns. If you do know that there’s a sharp curve at the top of the hill, decelerate further to prepare for the turn."
    },
    {
      "title": "Avoid running your air conditioner to prevent overheating your engine.",
      "content": "Avoid running your air conditioner to prevent overheating your engine. Driving uphill takes a toll on the engine, so overheating is a major risk. To minimize that risk, don’t run the air conditioner, especially if the slope is steep or you're driving on hilly terrain for an extended period. [11] X Research source If necessary, roll the windows down to get some fresh air."
    },
    {
      "title": "Drive downhill in a low gear instead of coasting or dragging your brakes.",
      "content": "Drive downhill in a low gear instead of coasting or dragging your brakes. Whether you drive a manual or automatic, descend a hill using the same gear you used to climb it. If you drive a manual, shifting to neutral to coast down the hill is dangerous. If you drive an automatic, engaging your brakes the entire way down the hill will wear out your brake pads and discs. When you do need to brake, do your best to engage them gently and gradually instead of slamming them."
    },
    {
      "title": "Engage the parking brake when you park on a hill.",
      "content": "Engage the parking brake when you park on a hill. [12] X Expert Source Ibrahim Onerli Driving Instructor Expert Interview. 18 November 2019. Even if the grade is slight, pull up the handbrake to prevent your car from rolling backward . You can usually find the parking brake either on the center console of your car (between the driver and front passenger seats) or next to the gas and brake pedals. The parking brake is also known as the handbrake."
    },
    {
      "title": "Turn your front wheels away from the curb if the car is facing uphill.",
      "content": "Turn your front wheels away from the curb if the car is facing uphill. Park next to the curb and turn the wheel sharply toward the roadway so the back of your curbside front wheel rests against the curb. That way, if your brakes fails, your car won’t roll backwards—the curb will block the wheels from moving any further. [13] X Trustworthy Source State of Oregon Official website for the State of Oregon Go to source If you park your car facing downhill, turn your front wheels toward the curb. That way, if your car begins to roll down the hill, the front wheels will hit the curb and stop the car before it can descend any further."
    },
    {
      "title": "Leave your vehicle in first gear when you park if it’s a manual.",
      "content": "Leave your vehicle in first gear when you park if it’s a manual. Instead of returning the stick to neutral when you park on a hill, keep it in first. If the car is in first gear and the parking brake fails, the engine should stop the wheels from turning. [14] X Research source Whether you have an automatic or manual transmission, remember to always engage your parking brake when you park on a slope."
    },
    {
      "title": "Keep the parking brake engaged and put the car in first.",
      "content": "Keep the parking brake engaged and put the car in first. If you parked, be sure to straighten your wheels, which were turned sharply. Align them in the direction you want to drive, and double that the parking brake is engaged. Then depress the clutch and shift the gear stick into 1st gear. Since you’re using the handbrake, your feet are free to operate the clutch and the gas pedals."
    },
    {
      "title": "Check that the road’s clear, then bring the engine to 1500 RPM.",
      "content": "Check that the road’s clear, then bring the engine to 1500 RPM. Turn on your indicator, check your mirrors, and look behind you to ensure there’s no oncoming traffic. If the road is clear, depress the gas pedal to reach 1500 RPM, then release the clutch slowly until you’ve reached the “biting point.” It takes a bit of practice to learn what the “biting point” or “friction point” feels like. It’s as if you’re pulling back the reigns of a horse, but the horse is ready to take off."
    },
    {
      "title": "Disengage the brake as you gently release the clutch and accelerate.",
      "content": "Disengage the brake as you gently release the clutch and accelerate. As you slowly release the brake, the car should either remain still or slowly move forward. In either case, continue to release the brake, steadily apply more gas, and gradually release the clutch. [15] X Research source If the car starts to roll backward, engage both the parking brake and the foot brake, depress the clutch, and try again. Have patience if you don’t get it right away. Managing the handbrake, clutch, and gas and finding the right rhythm can take some practice."
    },
    {
      "title": "Use the parking brake if you stop at a red light.",
      "content": "Use the parking brake if you stop at a red light. If, rather than parking, you’ve stopped at a red light, put the car in neutral and engage the parking brake. When the light turns green, use the same steps to drive forward as for leaving a parking spot. Shift to first, release the parking brake, and accelerate. If you're at a stop sign and need to wait for other vehicles to pass, use the parking brake. If you only need to pause for a moment, just use the foot brake. Use more gas if you’re starting on steep hills. The steeper the incline, the more power you will need to get the car rolling forward. Additionally, release the clutch more slowly on steep hills."
    },
    {
      "title": "Keep the parking brake engaged so you don't roll backwards.",
      "content": "Keep the parking brake engaged so you don't roll backwards. Start the car, straighten your wheels, keep the parking brake engaged, and shift to drive (or, depending on the slope of the hill, D2 or D1). [16] X Research source"
    },
    {
      "title": "Make sure that the road is clear and turn on your indicator.",
      "content": "Make sure that the road is clear and turn on your indicator. Check your mirrors and look over your shoulder for oncoming traffic. Be sure to put on your turn indicator to signal that you’re pulling out into the street. If you’re parked on a steep slope, keep both your foot and parking brakes engaged until you accelerate out of the parking spot."
    },
    {
      "title": "Step on the gas gently as you release the parking brake.",
      "content": "Step on the gas gently as you release the parking brake. Double check that the road is clear, then slowly press the gas. Aim to bring the engine’s RPM to about 200. Then lower the parking brake and immediately put more pressure on the gas pedal to merge smoothly onto the road. When traveling down a steep incline, remember to keep your car in a low gear to control your speed and take pressure off of your brakes."
    },
    {
      "title": "Use the parking brake if you're stopped on a steeper hill.",
      "content": "Use the parking brake if you're stopped on a steeper hill. Press the foot brake when you come to a red light, then engage the parking brake. When the light turns green, release the parking and foot brakes as you accelerate forward. [17] X Research source An automatic should only roll backward a bit, so engaging the parking brake at a red light or stop sign isn't absolutely necessary. However, using the parking brake when you're stopped on steeper hills puts less stress on the transmission."
    }
  ]
}