{
  "url": "https://www.wikihow.com/Copy-a-Table-from-Word",
  "title": "How to Copy a Table from Word",
  "steps": [
    {
      "title": "Open your document in Word.",
      "content": "Open your document in Word. You can open your file within Word by clicking File > Open or you can right-click the file in your file explorer and select Open with > Word . This method works for Windows and Mac versions of Word."
    },
    {
      "title": "Click View.",
      "content": "Click View . You'll see this along the top of your screen or the editing space."
    },
    {
      "title": "Click Print Layout.",
      "content": "Click Print Layout . It's still an editable document in Print Layout view, but you'll see the visual elements (including margins and page breaks) as if it were printed. This might be the default setting and could already be active. If so, you can skip this step."
    },
    {
      "title": "Navigate to the table you want to copy.",
      "content": "Navigate to the table you want to copy. Scroll up and down to navigate to the table in your document."
    },
    {
      "title": "Click the table move icon to select the table.",
      "content": "Click the table move icon to select the table. You should see the table move icon, which looks like a cross with arrows, in the top left corner of the table. You can also click Table in the editing ribbon and click Select > Table ."
    },
    {
      "title": "Press Ctrl+C (Windows) or ⌘ Cmd+C (Mac).",
      "content": "Press Ctrl + C (Windows) or ⌘ Cmd + C (Mac). This will copy the table and it's information. With this table in your clipboard, you can paste it anywhere, but the formatting may not remain if you paste it into a non-Word document like Notepad. [1] X Research source"
    },
    {
      "title": "Open Word.",
      "content": "Open Word. This app icon looks like a white \"W\" next to a shaded blue rectangle that you'll find on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Open your document.",
      "content": "Open your document. When you open the app, you'll see all your OneDrive documents. You can tap one to open it. The default view for the mobile app is Print Layout. If it is not, you'll need to change that view by tapping the mobile icon that's in the horizontal menu that runs across the top of the editing space."
    },
    {
      "title": "Tap the edit icon .",
      "content": "Tap the edit icon . You'll see this pencil icon in the menu that runs horizontally across the top of the editing space. When you tap that icon, you'll be in editing mode and zoom in on the cursor."
    },
    {
      "title": "Navigate to the table you want to copy.",
      "content": "Navigate to the table you want to copy. Scroll up and down to navigate to the table in your document that you want to copy."
    },
    {
      "title": "Tap the selection block above the table.",
      "content": "Tap the selection block above the table. This icon looks like a cross with arrows that you'll see in the upper left corner of the table if you're using an Android. If you're using an iPhone or iPad, this icon looks like a small arrowhead. When you tap that icon, a menu will drop-down."
    },
    {
      "title": "Tap Select All.",
      "content": "Tap Select All . The table will highlight in blue to indicate that it has been selected."
    },
    {
      "title": "Tap the copy icon.",
      "content": "Tap the copy icon. This icon looks like two pieces of paper that is next to the scissors icon. Now that table and its information is in your clipboard, so you'll be able to paste it anywhere. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}