{
  "url": "https://www.wikihow.com/Fly-in-Minecraft-and-Minecraft-Pocket-Edition",
  "title": "How to Fly in Minecraft and Minecraft Pocket Edition",
  "steps": [
    {
      "title": "Defeat the Ender Dragon",
      "content": "Defeat the Ender Dragon . The only way to fly in Survival Mode without cheats is to use a pair of wings called \"elytra.\" You'll need plenty of equipment and resources to find these wings, as they are only available in the End, the final zone of the game. Read this guide for instructions and advice on how to find and defeat the Ender Dragon. Elytra were added in Computer Edition official release 1.9, Pocket Edition official release 1.0, and Console Edition in the December 2016 update. If you are playing on an old Console world, select More Options from the world select menu and choose Reset End to get the new version with Elytra. [1] X Research source"
    },
    {
      "title": "Look for the gateway portal.",
      "content": "Look for the gateway portal. Defeating the Ender Dragon activates two portals. The one in the center, with a dragon's egg on top, is the end portal. Walking through it will give you an achievement and return you to the overworld. To explore the rest of the End zone, look for the other portal. This one is near the edge of the island, too small to walk through, and usually floating high in the air. [2] X Research source If you walk through the end portal, you can return to the End Zone using the same portal you used the first time."
    },
    {
      "title": "Throw an ender pearl through the gateway portal.",
      "content": "Throw an ender pearl through the gateway portal. Since the gateway is too small to walk through, you'll need an Ender Pearl to teleport through to the other side. This will take you to one of the other islands in the End Zone."
    },
    {
      "title": "Find an End City.",
      "content": "Find an End City. End Cities are tall towers or groups of towers made from yellow and purple blocks. You may need to explore the End zone for a fairly long time before you find one. [3] X Research source"
    },
    {
      "title": "Explore an End Ship.",
      "content": "Explore an End Ship. Each End City has a small chance to include an End Ship floating nearby. Walk into the cabin of the ship and defeat the shulker guarding the treasure. [4] X Research source Throwing another ender pearl is the fastest way to reach the ship. Some ships have a nearby walkway where you can stand to throw the pearl. The End City itself has treasure, but never an elytra."
    },
    {
      "title": "Take the elytra from the item frame.",
      "content": "Take the elytra from the item frame. Break the item frame behind the treasure chest, and a pair of \"elytra\" (beetle wing cases) will drop onto the floor. Pick these up and equip them to your chest slot."
    },
    {
      "title": "Jump in mid air to glide.",
      "content": "Jump in mid air to glide. With the elytra equipped, you can press the jump button in mid-air to start gliding. You will fall very slowly, and move forward as you do. You can press up to rise higher, but if you do this too sharply, you will stall and start to fall faster. [5] X Research source You can still take falling damage if you are moving too fast when you hit the ground."
    },
    {
      "title": "Enable the cheat console.",
      "content": "Enable the cheat console. If you didn't allow cheats when you created a single-player world, you can still enable them inside the world: Computer Edition: Hit Esc to open the menu. Select Open to LAN . Click Allow Cheats , then Start LAN World . This will enable cheats until you return to the main menu. Pocket Edition: Go to Settings → Game → Cheats: On . Note: On a multiplayer server, only administrators and operators have access to the console. [6] X Research source Ask one to put you in spectator mode, where you can fly but cannot interact with anything."
    },
    {
      "title": "Enter Creative Mode.",
      "content": "Enter Creative Mode. Open chat and type in /gamemode c to enter Creative Mode. (On devices with a keyboard, chat should open automatically when you hit / ). This automatically enables flying. Creative Mode also makes you immune to damage and give you an unlimited inventory."
    },
    {
      "title": "Double tap jump to fly.",
      "content": "Double tap jump to fly. This can be finicky, so try it a couple times if it doesn't work."
    },
    {
      "title": "Move up with the jump button.",
      "content": "Move up with the jump button. Once you've started flying, holding down the jump button will lift you into the air."
    },
    {
      "title": "Sink with the sneak button.",
      "content": "Sink with the sneak button. Hold down the sneak button (Left ⇧ Shift on a computer) to sink down to the ground. If you touch the ground, you will stop flying."
    },
    {
      "title": "Return to Survival Mode.",
      "content": "Return to Survival Mode. When you'd like to return to normal Survival Mode, type /gamemode s . Be careful: if you are flying, you will fall to the ground."
    },
    {
      "title": "Choose a Creative Mode world.",
      "content": "Choose a Creative Mode world. Flying is enabled by default in Creative Mode."
    },
    {
      "title": "Tap the jump button twice.",
      "content": "Tap the jump button twice. This causes you to start flying, though you may not notice it yet. If it doesn't work right away, try tapping a little faster."
    },
    {
      "title": "Hold jump to rise in the air.",
      "content": "Hold jump to rise in the air. You will continue to rise as long as you hold the jump button, or until you hit the maximum height. You can also move around with the usual controls."
    },
    {
      "title": "Hold sneak to sink back down.",
      "content": "Hold sneak to sink back down. The default sneak controls are Left ⇧ Shift on PC, R on Xbox, pressing down on the right joystick on PlayStation, and D-pad down on PS Vita. [7] X Research source"
    },
    {
      "title": "Hit the ground to stop flying.",
      "content": "Hit the ground to stop flying. If your feet touch the floor, you will stop flying. You can also turn off flying by double-tapping the jump button again."
    },
    {
      "title": "Choose a Creative Mode world.",
      "content": "Choose a Creative Mode world. You can only fly in Creative Mode. You choose the game mode when you create the world, and there is no built-in way to change it. You can search your app store for a mod that allows you to change game modes. However, most of these do not work for Minecraft PE versions 0.9 and later. [8] X Research source If you do download a mod, be aware that it is not officially supported and could cause issues with your game."
    },
    {
      "title": "Tap the jump button twice.",
      "content": "Tap the jump button twice. If you are in Creative Mode, you should start flying. On some versions, the jump symbol will change to a pair of wings. [9] X Research source"
    },
    {
      "title": "Swipe up or down from the jump button.",
      "content": "Swipe up or down from the jump button. Hold the jump button and swipe your finger up to fly higher, or down to sink lower. You can also move using the usual controls. You can also drop down by double-tapping the center jump button. [10] X Research source If you are playing on the Xperia Play gamepad, hold jump while pressing up or down. [11] X Research source"
    }
  ]
}