{
  "url": "https://www.wikihow.com/Do-a-Layup",
  "title": "How to Do a Layup",
  "steps": [
    {
      "title": "Dribble",
      "content": "Dribble close to the basket with your right hand. Since you're doing a right-handed layup, angle your approach toward the right side of the basket. You want to get close enough to have easy access to the basket, but not so close that you end up directly under it. Layups are often taken off of a running dribble. Practice approaching the basket slowly at first, and increase your speed once you've got the footwork down. You can do a right-handed layup if you're starting near the center or right side of the basket. If you're approaching the basket from the left, you'll want to do a left-handed layup."
    },
    {
      "title": "Step toward the basket with your right foot.",
      "content": "Step toward the basket with your right foot. When you're just a few feet from the basket, take a step toward it with our right foot. Use this step to gain distance and position yourself within easy shooting range. Dribble the ball one last time just outside your right foot."
    },
    {
      "title": "Jump",
      "content": "Jump off of your left foot. As soon as your left foot lands, use it to jump in the direction of the basket. Your body should be moving toward the basket, but don't lean forward. Ideally, you'll be positioned close enough to the basket that you can jump straight up to take your shot. As you jump, bring the ball out of the dribble to your chest to prepare for the shot."
    },
    {
      "title": "Shoot",
      "content": "Shoot with your right arm as you lift your right leg. As you jump, imagine a string attached to your right arm and your right leg. Move them at the same time as you shoot, as though someone were pulling upward on the string. Your right knee should be bent and pointed toward the basket while your right arm moves up to shoot the ball. Arch your arm toward the basket. Shoot with your elbow slightly bent, so that your arm looks like the neck of a swan. When you're doing a layup, the shooting technique is slightly different from that of a regular shot. Instead of using your left hand to steady the ball, you want to shoot the ball using only your right hand. This gives you more reach, and since you're so close to the basket that it's difficult to miss the shot, you don't really need your left hand to steady the ball. As you shoot, slightly rotate your wrist inward to give the ball a little bit of spin, rather than snapping your wrist forward as you would for a regular shot. The gentle spin will keep it from hammering off the rim or backboard with too much force."
    },
    {
      "title": "Aim for the sweet spot on the backboard.",
      "content": "Aim for the sweet spot on the backboard. One of the reasons a layup is such a sure bet is because you can always use the backboard to help ease the shot into the basket. When you're doing a right-handed layup, the sweet spot is slightly above the top right corner of the small square in the center of the backboard. This spot absorbs the impact of the ball and drops it right down through the net. You'll get two points no matter how you make your shot, but it's better to aim for the backboard instead of trying to just tip the ball over the rim. The backboard allows more room for error, but if you hit the rim funny the ball will bounce right out. There's nothing worse than missing a wide-open layup when you have full access to the basket, so work on hitting that sweet spot every time."
    },
    {
      "title": "Practice until your muscles remember the movement.",
      "content": "Practice until your muscles remember the movement. The layup is a fundamental basketball move that will become second nature after you practice it enough. You should get to the point where your body remembers what to do and you don't have to think about which foot to put forward and which one to jump off: you just do it. Do layups as part of every basketball practice . As you practice, you'll start to get a good sense for how fast to approach the basket and from what distance to begin your layup footwork and launch into a jump. Work on doing layups while you're being defended or off of a long pass."
    },
    {
      "title": "Dribble close to the basket with your left hand.",
      "content": "Dribble close to the basket with your left hand. Approach the left side of the basket with a dribble. Get close enough to have easy access to the basket so you can launch into your layup from a few feet away. Don't get so close that you end up directly under the basket. If you're right-handed, the left-handed layup may also be referred to as a reverse layup , since it's the reverse of your standard layup. If you're left-handed, the right-handed layup is the reverse. It's difficult to do a layup with your opposite hand, but it's completely worth the time and effort it takes to learn how to do it. If you're approaching the basket from the left side, crossing over to the right side can be hard, and will slow you down. You'll have a much better chance of scoring if you know how to sink one from the left."
    },
    {
      "title": "Step toward the basket with your left foot.",
      "content": "Step toward the basket with your left foot. When you're just a few feet from the basket, start your layup footwork by taking a step toward the basket with your left foot. Give the ball one last hard dribble just to the outside of your left foot."
    },
    {
      "title": "Jump off of your right foot.",
      "content": "Jump off of your right foot. As soon as your right foot lands, use it to jump in the direction of the basket. [1] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Your body should be moving toward the basket, but don't bend forward. Ideally, you'll be positioned close enough to the basket that you can jump straight up to take your shot. As you jump, bring the ball out of the dribble and position it close to your chest to prepare for the shot. [2] X Research source"
    },
    {
      "title": "Shoot with your left arm as you lift your left leg.",
      "content": "Shoot with your left arm as you lift your left leg. As you jump, imagine a string attached to your left arm and your left leg. Move them at the same time as you shoot, as though someone were pulling upward on the string. Your left knee should be bent and pointed toward the basket while your left arm moves up to shoot the ball. When you're doing a layup, the shooting technique is slightly different from that of a regular shot. Instead of using your right hand to steady the ball, you want to shoot the ball using only your left hand. This gives you more reach, and since you're so close to the basket that it's difficult to miss the shot, you don't really need your right hand to steady the ball. As you shoot, slightly rotate your wrist inward to give the ball a little bit of spin, rather than snapping your wrist forward as you would for a regular shot. The gentle spin will keep it from hammering off the rim or backboard with too much force."
    },
    {
      "title": "Aim for the sweet spot on the backboard.",
      "content": "Aim for the sweet spot on the backboard. For a left-handed layup, the ball should tap the backboard slightly to the left of the center of the square. When you hit that spot, you'll sink the shot every time, since the backboard absorbs the ball's impact and helps it drop right down through the net. [3] X Research source It's better to aim for the backboard instead of trying to just tip the ball over the rim. The backboard allows more room for error, but if you hit the inside or outside rim, the ball could bounce right out."
    },
    {
      "title": "Practice until your muscles remember the movement.",
      "content": "Practice until your muscles remember the movement. The layup is a fundamental basketball move that will become second nature after you practice it enough. You should get to the point where your body remembers what to do and you don't have to think about which foot to put forward and which one to jump off: you just do it. Do layups as part of every basketball practice. As you practice, you'll start to get a good sense for how fast to approach the basket and from what distance to begin your layup footwork and launch into a jump. Work on doing layups while you're being defended or off of a long pass."
    }
  ]
}