{
  "url": "https://www.wikihow.com/Create-a-Gaming-Computer",
  "title": "How to Create a Gaming Computer",
  "steps": [
    {
      "title": "Ask yourself what kind of games you are playing.",
      "content": "Ask yourself what kind of games you are playing. If you're playing competitive shooters, you won't need the highest components as long as you are willing to play on low settings (competitive settings). If you plan on playing more graphically intensive games, you may want to increase your budget to enhance your experience."
    },
    {
      "title": "Find a budget.",
      "content": "Find a budget. This will determine how much you will be able to spend at the end of the day. Just know if you increase your budget, the overall performance can increase."
    },
    {
      "title": "Determine what processor (CPU) you want to use for your system.",
      "content": "Determine what processor (CPU) you want to use for your system. [1] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. It might be more beneficial to find benchmarks and compare them with current prices. When buying, some people recommend a general rule of thumb that the second best CPU (or motherboard, video card, etc.) is often the best in cost/performance, though this isn't a hard and fast rule. For a more objective comparison, look up benchmarks for the processor, such as PassMark 's list of high-end processors, and sort by \"price-performance\". Intel is generally better at single-threaded applications (primarily gaming), but AMD is better with multithreaded applications (like working and having multiple tasks). You can either choose from Intel or AMD Ryzen. Both are great choices, but typically Intel performs better in gaming, and Ryzen is a bit cheaper in most cases and excels in production workloads. Nowadays, the newer generations of both of them are very good, and you can't really go wrong with either. On the CPU end, Intel has three different types: K (overclockable with integrated graphics), KF (overclockable without graphics), and non-K (not overclockable with integrated graphics). AMD Ryzen has three different types: X (overclockable), XT (higher frequencies with more overclocking), non-x (lower frequencies with overclocking), and G (which has integrated graphics). In most cases, you should buy overclockable CPUs if you want a bit more performance, but it really depends on your budget."
    },
    {
      "title": "Find a motherboard that supports your processor.",
      "content": "Find a motherboard that supports your processor. Take note of the processor socket (ex: LGA 1150, LGA 1151, or AM3+), the memory module type (ex: 240-pin) and the RAM frequency (ex: 1066 MHz) in choosing a motherboard. CPU sockets are only compatible with particular CPUs. Some motherboards come with features such as HDMI, so look for a motherboard with these features if desired. There are different kinds of motherboards: Mini ITX, Micro ATX, ATX. Beware of high-frequency RAM. While it may at first seem that any computer part that works harder or faster must certainly be better, this is not always the case. The benefits of high-frequency RAM are inconsistent, and it is known to have a high failure rate. [2] X Research source You should note the number of pins for your memory module only because of how it will connect to your motherboard. More pins do not equate with better performance. The same can be said of the processor socket: different types do not necessarily indicate performance. Use a site like PCPartPicker to check for compatibility errors."
    },
    {
      "title": "Get enough RAM to meet your needs.",
      "content": "Get enough RAM to meet your needs. Having more RAM, or desktop memory , will offer smoother performance and shorter loading times. [3] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. Choose memory that is within your budget from a known manufacturer like Corsair, Kingston, etc. There are many different memory manufacturers, but a select few make quality memory. You will want to choose the highest clock speed (the rating in MHz) and the lowest timings as possible (displayed in #-#-#-#) -- the performance of your memory relies greatly on them. You will want to buy enough memory to run your applications. Understand that while your games may say that 2GB is enough, what it really means is that it’s enough to run the game badly. If you want games to run smoothly, generally you should overshoot the requirement. At the same time, more RAM won't always mean better performance. It really depends on what types of programs you want to run, such as rendering programs, and how many programs you are running at once. For example, if you are just running a couple of light to programs such as Roblox, you won't need more than 4GB for it to run smoothly. But if you are playing the newest triple-A titles, try to get at least 16GB of RAM for it to run decently. 32-bit CPUs and Operating Systems can only support up to 3.5-4 GB of RAM; 64-bit CPUs and Operating Systems can support much more, up to many terabytes in theory. The practical limit to how much RAM you can install is a function of how many DRAM slots your motherboard has (most have either 2 or 4), and the maximum capacity of DRAM modules available to you. The specifications of the chipset on the motherboard may also state a limit, for example, 32 GB or 64 GB. Since big DRAM modules are expensive, the most important question to ask is, \"how much DRAM can my programs actually use?\" Very few consumer application programs can actually make use of more than 1 or 2 GB of DRAM even if you have more than that installed. A good strategy for determining your RAM usage is to start off with a smaller amount, such as 8 GB of RAM, and upgrade as needed. You can always use the task manager to see how much RAM is being used by each program. Remember that additional RAM creates a substantial amount of extra heat and will cause more power usage. If you are building a 64-bit system, check the price of the DRAM modules that your motherboard requires, in 4GB, 8GB, and 16GB sizes. If the 8GB modules are the least expensive per GBB, buy one to start with. For a gaming system, you want to research the specs on the games you will be installing, and see how much DRAM these games can actually use, then buy the next larger size. For example, if a game says it wants 4GB of DRAM, buy a single 8GB DRAM. On a 2-slot motherboard, that gives you more than enough memory for the apps you are running today, with some room for future games with higher performance. And it leaves you a second slot for future expansion if you ever need more; on a 4-slot board, that's 3 slots still open for future expansion. As of late 2015, 8GBB DDR3 RAM modules were only a couple dollars more than 4GB modules, so there was absolutely no reason to buy any DRAM smaller than 8GB."
    },
    {
      "title": "Decide what GPU platform you will be using.",
      "content": "Decide what GPU platform you will be using. You can either choose from NVIDIA, AMD, or Intel. NVIDIA is probably the best choice since they typically perform the best in all scenarios and they have ray tracing technology, which is a big bonus. AMD is still a good option, though. Intel cards are pretty new and are being developed, but are pretty weak for now. The higher the number in the series typically means the higher the performance a card is. NVIDIA usually has a few classifications of cards: normal, super (a bit more performance than normal), TI (a bit more performance than super), and TITAN (professional workload cards). For example, here's a list of NVIDIA cards increasing in performance: 2070, 2070 SUPER, 2070 TI, 2080, etc. AMD has theirs too, being non-X (baseline), X (a bit more performance than non-x), and XT (more performance than X). For example, here's a list of AMD cards increasing in performance: 6600, 6600X, 6600XT."
    },
    {
      "title": "Choose a video card.",
      "content": "Choose a video card. This may be one of the most important yet toughest decisions to make because there are so many different video cards on the market. Because there are so many, the best way to find your card is to look for reviews on cards within your budget. Use review websites such as Tom's Hardware to compare performance between video cards."
    },
    {
      "title": "Choose a graphics card that is dependent on your needs.",
      "content": "Choose a graphics card that is dependent on your needs. High-end graphics cards are commonly used for gaming systems or data processing. [4] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. There has been some confusion on the NVIDIA cards, which are recommended by gamers. A higher number in the card name does not mean it is better. The first number is the card series, while the second and sometimes third indicate performance level. If you really want to pump up the game, and you have a motherboard that can support it, get 2 identical cards from the same manufacturer and run them in SLI (Nvidia), or Crossfire (AMD) mode. This is generally a bad idea, however, unless you already have a top of the line card, because it's cheaper and more efficient to get a single better graphics card. However, in some cases, it may be cheaper to get 2 GTX 660s and run them in SLI."
    },
    {
      "title": "Choose your hard drive storage.",
      "content": "Choose your hard drive storage. Games, audio, and videos require plenty of space to store the large files associated with media such as these. Read reviews on hard drives and choose the best for the price. Faster hard drives will only affect game loading times, and even then, not by much. Focus mainly on ensuring that you have enough storage space and do not prioritize hard drive speed. SATA cards are currently the best choice because their small cables allow for better airflow and transfer speeds than older PATA cables. Look into SATA 3, SATA 6...higher is faster. Having an SSD (Solid State Drive) impacts gaming performance hugely. They have much faster read and write times, allowing for much faster launch times and performance. [5] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. However, as these storage devices are expensive, it makes sense to get both a hard drive and an SSD. Keep all your games, and if you have enough room, your OS on your SSD and everything else on your hard drive."
    },
    {
      "title": "Choose a power supply.",
      "content": "Choose a power supply. Check the power of the power supply. Power supplies come with either 20-pin or 24-pin connectors. Get the same number of pins as your motherboard has so that it will connect. Be sure that it meets all the recommended power requirements for your parts, such as the graphics card. It is important to remember that most power supplies that come with cases are of low quality. Consider replacing it with one that is more powerful and more efficient as soon as possible. 450 Watts is the minimum you should expect for modern computers. More powerful components, such as high-end video cards, may require 500 Watts or more. There are different standards. 80+ Bronze, 80+ Silver, 80+ Gold, 80+ Platinum. The difference is power efficiency and stability, platinum is more efficient than bronze."
    },
    {
      "title": "Purchase a case.",
      "content": "Purchase a case. Never overlook the importance of your case. After all, it houses all the expensive parts that run your computer. Here you will want to focus on cooling. Some cases use 80mm, others use 120mm fans, and some are built for both. Fans come in all sizes. Generally, larger fans produce less noise and push more air through your case. More powerful components will require more cooling, so be thoughtful of which case you purchase. If possible, you will want to have equal pressure in your case. Usually, you will want to have back fans blowing out, front fans sucking in, top fans blowing out, bottom fans sucking in, side fans sucking in. A mid-tower case is standard, but a full-tower case may be necessary if you have a high number of peripherals, such as CD-ROM drives and hard drives."
    },
    {
      "title": "Choose an operating system.",
      "content": "Choose an operating system. With all the above components purchased, you will want an operating system that can make use of the system you have put together. When it has been installed, check online for driver updates. Windows tends to be the best operating system for gaming, though you may initially want to choose a newer version of Windows like 10 or 8.1 since these have improved performance. Linux-based operating systems are growing and may have limited game support. Most distributions are free and lightweight and are a great option if you have a lower-end computer or the games you want to play have a Linux version available. Many Windows games are even perfectly playable using Wine (some games may have reduced performance or bugs when run under Wine)."
    },
    {
      "title": "Consider getting a stand-alone cooler.",
      "content": "Consider getting a stand-alone cooler. Generally, with high-end computers, case fans don't cut it. Generally, liquid cooling is the best."
    },
    {
      "title": "Remove the static from your hands.",
      "content": "Remove the static from your hands. This is very important. You don't want to damage your CPU. You can remove static by simply touching the outside of your computer case, or by getting things like anti-static hand pads or anti-static \"watches\" for some extra peace of mind."
    },
    {
      "title": "Make sure you put all of the parts together correctly in the case",
      "content": "Make sure you put all of the parts together correctly in the case . Putting together a computer is more complex than it sounds. Make sure you do it correctly or it will not run."
    },
    {
      "title": "Connect your computer to a monitor with a high refresh rate",
      "content": "Connect your computer to a monitor with a high refresh rate . A high-quality gaming PC will usually be more powerful than a gaming console. You may enjoy connecting your PC to your high-definition TV to get the big screen experience. However, many veteran PC gamers prefer a monitor over a TV screen. Getting a monitor that can support the large number of frames that your new PC can pump out is critical for certain kinds of gaming, like mass online multiplayer games where a single frame advantage is critical. Using TVs or monitors with lower refresh rates causes ghosting and makes the PC seem less responsive than it actually is. There are many great companies offering monitors, such as Acer's Predator Series or ASUS. A good standard resolution is 1920x1080 with a refresh rate of 144Hz. Remember to use a Display Cable (DP), as standard HDMI or VGA cables do not support high frame rates. Some monitors come in various sizes, but a 1920x1080 24 inch 144hz is pretty standard. If you decide to upgrade to a bigger monitor with a higher resolution, it will require a better graphics card to push out the same frame rate."
    },
    {
      "title": "Connect your console game controller to your computer if you prefer those controls.",
      "content": "Connect your console game controller to your computer if you prefer those controls. PC gaming controls can be hard to learn and use for people who are more familiar with console gaming. However, you can easily connect a console controller to a PC and play your game as normal."
    }
  ]
}