{
  "url": "https://www.wikihow.com/Cover-a-Sofa",
  "title": "How to Cover a Sofa",
  "steps": [
    {
      "title": "Pick a material to use for your no-sew cover.",
      "content": "Pick a material to use for your no-sew cover. Whether you want to buy something new or use something you already have at home is totally up to you. Materials that work well for this type of project are: blankets, sheets, drop-cloths, and tablecloths. For a standard 7-foot sofa (2.1 m), you’ll need about 14 yards (13 m). You’ll also need an extra 1.5 yards (1.4 m) for each additional cushion over 2."
    },
    {
      "title": "Lay the material overtop of your couch to determine where to cut it.",
      "content": "Lay the material overtop of your couch to determine where to cut it. Remove any pillows from the couch, but leave the cushions in place. Figure out which way the fabric needs to go so that the couch is fully covered on all sides. If the material you chose doesn’t seem like it will cover everything, consider buying a really large drop-cloth so that you can cut it down to size."
    },
    {
      "title": "Cut out a piece of fabric for the seat and for the back of the couch.",
      "content": "Cut out a piece of fabric for the seat and for the back of the couch. Remember that there needs to be a lot of fabric available to tuck into the crevices of the couch, so don’t be afraid to make generous cuts. The back piece of fabric should cover the back and sides of the couch, and it should reach the ground on the sides and in the back. The piece for the seat of the couch should be large enough to fully cover the seat covers and get tucked in securely all around the edges. Because the edges of the material will be hidden from sight, it doesn’t matter if they’re a little ragged or uneven."
    },
    {
      "title": "Position and secure the fabric for the back of the couch.",
      "content": "Position and secure the fabric for the back of the couch. Remove the fabric for the seat of the couch as well as the seat cushions so they don’t get in your way. Arrange the material over the back and sides of the couch and start tucking the material down into the couch’s crevices. If you want to secure the material in place even more, use a staple gun around the inside edges of the arms and back of the couch. For now, don’t worry about the outer edges of the fabric. Once you have everything in place, you’ll secure those with hook-and-loop fastener strips."
    },
    {
      "title": "Cover the seat of the couch and tuck the edges into the crevices of the sofa.",
      "content": "Cover the seat of the couch and tuck the edges into the crevices of the sofa. Replace the seat cushions and lay the second piece of material over top of them. Tuck the fabric as firmly as possible all around the sides and the back. For the front of the couch, tuck the material underneath the cushions about 6 inches (15 cm) or so, but leave enough fabric hanging down to cover the front of the couch so the original fabric isn’t visible at all. Use a staple gun to secure the fabric underneath the cushions and around the sides, too. When you’re done, take a step back to see if any of the original fabric is visible. If so, make adjustments to the slipcover to ensure that everything is completely covered."
    },
    {
      "title": "Secure the fabric edges to the bottom of the couch with hook-and-loop fastener strips.",
      "content": "Secure the fabric edges to the bottom of the couch with hook-and-loop fastener strips. Place a hook-and-loop fastener strip every 4 to 6 inches (100 to 150 mm) along the inside edges of the fabric. Place a correlating strip on the underside of the sofa, and firmly secure each section so that there is no loose fabric hanging down. You could also use fabric glue to glue down the excess fabric."
    },
    {
      "title": "Measure your sofa to make sure you’re buying the right size cover.",
      "content": "Measure your sofa to make sure you’re buying the right size cover. Use a flexible tape measure, and measure the length and width of your sofa from back to front and side to side. Mark down the highest and widest points, as that is the minimum size that you’ll need to match to properly cover your sofa. Lots of shops sell covers based mainly off of the length of the couch, but depending on how customized you want the cover to be, it’ll be helpful to have all the measurements before you start shopping."
    },
    {
      "title": "Shop for a color, fabric, and style that you like.",
      "content": "Shop for a color , fabric, and style that you like. From solid colors to patterns, canvas material to cotton, and upscale versus casual, there are so many options to choose from when you decide to buy a new slipcover. Think about the other design elements present in the room and try to pick a cover that will fit in well. Many home goods stores carry slipcovers, and there are also thousands of options to choose from online. You can buy a slipcover for anywhere from $50 to $500, just depending on where you buy it from."
    },
    {
      "title": "Order a custom-made slipcover for a more professional look.",
      "content": "Order a custom-made slipcover for a more professional look. Some companies offer to make custom slipcovers for their customers. If you’re concerned about the fit of a one-size-fits-all type of situation, or if your couch is uniquely shaped, this might be a great option for you. [1] X Research source"
    },
    {
      "title": "Wash your slipcover when you first get it to remove any irritants.",
      "content": "Wash your slipcover when you first get it to remove any irritants. Chances are your new slipcover is clean, but it probably also came into contact with some chemicals during the manufacturing process. Always check the care instructions before washing your slipcover; in general, it’s typical to wash a slipcover in cool water on the gentle cycle and to then hang it up to dry. [2] X Research source Sometimes the packaging that a slipcover comes in might have an odd smell, and washing the slipcover can help remove that scent from it."
    },
    {
      "title": "Buy enough fabric to completely cover your couch, cushions and all.",
      "content": "Buy enough fabric to completely cover your couch, cushions and all. Measure the length and width of your sofa from back to front and side to side. Use a flexible tape measure to get accurate figures. Don’t forget to measure the width and length of the sofa’s arms, as well as any removable cushions. Choose canvas, cotton duck, denim, or twill fabric for your slipcover. [3] X Research source Opt for a wider width of fabric when you buy it from the store. Anything that is 75 inches (190 cm) wider or more should work for your project. In general, you’ll need 12 yards (11 m) of fabric for a 6-foot sofa (1.8 m), 14 yards (13 m) for a 7-foot sofa (2.1 m), and an additional 1.5 yards (1.4 m) for each additional cushion over 2. If you aren’t interested in making separate covers for the cushions, modify your pattern so that the fabric will drape over the top of the cushions and connect to the armrests. In this situation, you won’t need the excess material for each cushion."
    },
    {
      "title": "Wash the fabric before you do anything else to it.",
      "content": "Wash the fabric before you do anything else to it. Use cool water on the gentle cycle with a mild detergent. Hang the fabric up to dry, or put it into the laundry machine on a low-heat setting. Washing before cutting and sewing is an essential step. If you don’t do this, the cover will shrink and no longer fit your couch after the first time you do wash it. If the fabric is especially wrinkly after it has dried, consider ironing it."
    },
    {
      "title": "Make a pattern for your slipcover with an old sheet.",
      "content": "Make a pattern for your slipcover with an old sheet. Remove the cushions from the couch first, as those will get covered separately. Drape an old sheet over the couch and pin it in place along the seams of the couch (don’t worry about putting pins into your couch—that material will be covered by the new cover anyway). Use a piece of chalk to draw the edge lines over the fabric so you know where to cut. [4] X Research source If you don’t want to use an old sheet, use butcher paper or something similar so you can make the necessary marks and cut out the pattern without the risk of it ripping easily."
    },
    {
      "title": "Cut out the pieces for your slipcover from the pattern you made.",
      "content": "Cut out the pieces for your slipcover from the pattern you made. Once you’ve made the pattern and washed the fabric, you’re ready to start cutting out the actual pieces for your slipcover. Add 1 to 1.5 inches (2.5 to 3.8 cm) of space around the edge of each piece for the seam allowance. [5] X Research source To help yourself remember which piece goes where, use a fabric marker on the underside of the material to write a label. For example, you could write “RA” for “right arm.” Additionally, put an arrow next to the label to indicate which side of the fabric should be closest to the ground."
    },
    {
      "title": "Pin the pieces of fabric together and test them on the couch.",
      "content": "Pin the pieces of fabric together and test them on the couch. Arrange the fabric so that the right sides will be pinned together, and put a pin along the seams every 1 to 2 inches (2.5 to 5.1 cm). Remember to leave that 1 to 1.5 inches (2.5 to 3.8 cm) hem so that you’ll have room to sew the pieces together later. Once a section has been pinned together (for example, the left arm), place it on the sofa to make sure the fabric fits well and is lined up right. Make whatever adjustments you need to until it looks how you want it to. [6] X Research source Take your time when putting the pins in, and don’t worry if you need to work in smaller sections to get things put together. It may seem overwhelming at first, but it’ll be done before you know it."
    },
    {
      "title": "Use a sewing machine to connect all the pieces of the slipcover.",
      "content": "Use a sewing machine to connect all the pieces of the slipcover. You can sew the slipcover in parts, which might be helpful if you’re worried about getting turned around (there are a lot of pieces to keep track of!). Or, you could sew the entire slipcover together all at once, which would alleviate some of the back-and-forth trekking to the couch to test the pieces, but it could make it harder to fix mistakes. Use a straight-stitch for a secure hold. [7] X Research source If you’re interested in creating multiple pieces rather than one large piece, that is okay to do, too! If you’re doing this, create a separate slipcover for the right arm, the left arm, and the back of the couch. Just make sure there is enough material to tuck down into the creases of the couch so that ends of the fabric won’t be visible."
    },
    {
      "title": "Sew covers for the removable pillows and install upholstery zippers.",
      "content": "Sew covers for the removable pillows and install upholstery zippers . Measure the length, width, and depth of the cushions and cut out your fabric to fit those measurements. Remember that you’ll need double the length so that the fabric will wrap around the entire cushion, and leave enough room for a 1 inch (2.5 cm) seam all around. Sew the pieces together and put in an upholstery zipper at the back of each pillow. [8] X Research source The zippers will allow you to easily remove the slipcover so you can wash it in the future."
    },
    {
      "title": "Slip the new cover onto your couch and enjoy your handiwork.",
      "content": "Slip the new cover onto your couch and enjoy your handiwork. Once your slipcover and couch cushions are finished, go ahead and put them onto your sofa. The entire look of your room will instantly change and feel refreshed. Keep in mind that you can change out the slipcover as often as you want. Different patterns for different seasons, new colors, and fun patterns are great options to use to quickly update the look of a room."
    }
  ]
}