{
  "url": "https://www.wikihow.com/Find-the-Area-of-a-Semicircle",
  "title": "How to Find the Area of a Semicircle: Formula & Calculation Tips",
  "steps": [
    {
      "title": "Find the radius of the semi-circle.",
      "content": "Find the radius of the semi-circle. You'll need the radius to find the area of the semi-circle. Let's say the radius of the semi-circle is 5 centimeter (2.0 in). If you're only given the diameter of the circle, you can divide it by two to get the radius. For example, if the diameter of the circle is 10 centimeter (3.9 in), then you can divide it by 2 (10/2) to get 5 centimeter (2.0 in) as the radius. [2] X Research source"
    },
    {
      "title": "Find the area of the full circle and divide it by two.",
      "content": "Find the area of the full circle and divide it by two. The formula for finding the area of a full circle is πr 2 , where \"r\" represents the radius of the circle. Since you're finding the area of a semi-circle, you'll be looking for half of the area of a circle, [3] X Research source which means you have to use the formula for finding the area of a semi-circle and then divide it by two. So, the formula you'll have to use to find the area of a semi-circle is πr 2 /2 . Now, just plug \"5 centimeter (2.0 in)\" into the formula to get your answer. You can either use the closest approximation for π with your calculator, substitute 3.14 for π, or you can just leave the symbol in place. Here's how you do it: Area = (πr 2 )/2 Area = (π x 5 cm x 5 cm)/2 Area = (π x 25 cm 2 )/2 Area = (3.14 x 25 cm 2 )/2 Area = 39.25 cm 2"
    },
    {
      "title": "Remember to state your answer in units squared.",
      "content": "Remember to state your answer in units squared. Since you're finding the area of a shape, you'll have to use units square d (such as cm 2 ) in your answer to indicate that you're working with a two-dimensional object. [4] X Research source If you're calculating volume, then you'll be working with cubic units (such as cm 3 )."
    }
  ]
}