{
  "url": "https://www.wikihow.com/Cook-Tempeh",
  "title": "How to Cook Tempeh",
  "steps": [
    {
      "title": "Find tempeh at a health food store.",
      "content": "Find tempeh at a health food store. Tempeh isn't always easy to find in grocery stores, but if you have a health food store or a natural foods store in your area you'll find it in the refrigerated section, close to the tofu. If you'd prefer not to buy commercially-made tempeh, you can make your own. The process is time-consuming, but you'll be able to rest assured that your tempeh contains only natural ingredients. [1] X Research source Making tempeh yourself can be done with 2 cups of hulled soybeans, 2 teaspoons of vinegar and a packet of tempeh starter. Boil the beans until they're soft, then drain them and pat dry. Mix in the vinegar and tempeh starter, then place the beans in a container with air holes to allow them to ferment. They must be kept at a temperature of 88 °F (31 °C) for 24 - 48 hours. During this time, mycelium will grow over the beans and fuse them together into a solid block. [2] X Research source"
    },
    {
      "title": "Boil or simmer the tempeh to soften it.",
      "content": "Boil or simmer the tempeh to soften it. Tempeh comes in a dense, brick-shaped block. While it can certainly be sliced and cooked up right away, many recipes call for boiling or simmering it in hot water for a few minutes to soften the tempeh before using another cooking method to finish it. Boiling or simmering the tempeh before frying, baking or sauteing it results in tempeh pieces that are pleasingly soft on the inside and crunchy on the outside. To boil or simmer tempeh. [3] X Research source Remove it from the packaging. Bring a pot of water to a boil or simmer, depending on how soft you want the tempeh to be. Hotter water will result in softer tempeh. Place the entire block of tempeh in the boiling or simmering water. Cook it for 8-10 minutes. Remove the tempeh from the water and pat it dry."
    },
    {
      "title": "Cut the tempeh into pieces.",
      "content": "Cut the tempeh into pieces. The most common ways to break up the block of tempeh are by slicing it into thin strips or chopping it into bite-sized pieces. You can also shred it or chop it finely so that it takes on texture of ground beef. Cut the tempeh to whatever side is right for the dish you want to include it in. For example: [4] X Research source If you're making barbecued tempeh, slice it into long strips. If you're making tempeh tacos, shred or crumble it. If you're adding it to soup, chop it into bite-sized pieces."
    },
    {
      "title": "Marinate the tempeh.",
      "content": "Marinate the tempeh. Tempeh has a very subtle, nutty flavor that picks up other flavors well. Marinating tempeh is a very common way to punch up its flavor before cooking. Tempeh can be marinated in any marinade you'd use for tofu, chicken, beef, or any type of meat. To marinate tempeh, follow these steps: [5] X Research source Mix up a marinade with tasty ingredients like minced garlic, lemon juice, olive oil and spices. Place the chopped or sliced tempeh in a glass baking dish and pour the marinade over the tempeh to cover it. Cover the dish and let the tempeh marinate for 20 minutes to overnight. Drain off the marinade in preparation for cooking the tempeh."
    },
    {
      "title": "Season dry tempeh.",
      "content": "Season dry tempeh. If you'd prefer not to use a marinade, you can instead season the tempeh dry with any combination of spices. Coriander, cilantro, oregano or other whole herbs can pack a punch, and powdered spices like paprika and turmeric can add good color to the tempeh, dying the slices a rich yellow-brown or reddish tone. Using plenty of herbs and spices will help with both flavor and presentation. To season tempeh: [6] X Research source Lay the tempeh pieces out on a baking sheet. Sprinkle your spice mix liberally over the tempeh. Flip the pieces and sprinkle more on the other side. Don't skimp with spices, since tempeh is a little flavorless on its own and needs plenty of spices to make it taste flavorful."
    },
    {
      "title": "Bake the tempeh.",
      "content": "Bake the tempeh. Simple baked tempeh can be made with either dry seasoned or marinated tempeh pieces. Baked tempeh is a great main dish paired with vegetables, rice, or quinoa. To make baked tempeh, do the following: [7] X Research source Preheat the oven to 350 degrees. Spray a baking sheet with nonstick cooking spray or use a paper towel to oil it, so the tempeh doesn't stick. Place the tempeh pieces in a single layer on the baking sheet. Bake the tempeh for 15 - 20 minutes, or until the edges are lightly browned and crispy."
    },
    {
      "title": "Sauté the tempeh.",
      "content": "Sauté the tempeh. Heat a drizzle of oil in a skillet over medium high heat. When the oil is hot, lay the tempeh strips or cubes in the oil. Cook them on one side for about 3 minutes, until they turn golden brown and crispy, then flip the pieces with a pair of tongs and cook them on the other side."
    },
    {
      "title": "Fry the tempeh.",
      "content": "Fry the tempeh. Heat several inches of cooking oil with a high smoke point (like peanut or vegetable oil) in a deep frying pan or dutch oven. When the oil reaches a temperature of 400 degrees, put strips or chunks of tempeh in the oil. Fry them for about 4 minutes, or until they're golden brown and crispy. [8] X Research source Remove them to a plate lined with paper towels to drain. You can bread tempeh before frying it if you want it to have a crunchy crust. Dip the tempeh in an egg or milk, then dredge it in flour, panko or breadcrumbs mixed with salt and spices. Fry the tempeh as instructed."
    },
    {
      "title": "Mix cooked pieces into dishes.",
      "content": "Mix cooked pieces into dishes. Cooked tempeh pieces taste great in any dish that calls for a protein. Decide whether the dish would taste best with baked, sauteed or fried tempeh, then top it with dressing, mix it with vegetables, add some sauce, or otherwise treat it as you would chicken, fish or tofu. Add chopped, cooked tempeh to soup or stew. For salads, just toss the blocks of tempeh with greens and other ingredients to make a nice hot salad, or let the whole thing cool for a fresh, chilled result. Put strips of tempeh into sandwiches and build a panini, club or other option for a great taste that doesn't use meat."
    },
    {
      "title": "Make tempeh burgers",
      "content": "Make tempeh burgers . Tempeh burgers have a satisfyingly meaty texture, and when you mix in savory spices like garlic powder, cayenne and black pepper, you won't miss having beef. To make tempeh burgers: Start with tempeh that has been boiled for 10 minutes, then shredded. You need about 2 cups of tempeh for 4 burgers. Mix 1/4 teaspoon salt, 1/8 teaspoon cayenne, 1/2 teaspoon garlic powder, and 1/4 teaspoon black pepper. Beat 1 egg and mix it with the tempeh. Add the spice mix and incorporate it thoroughly. Form the mixture into 4 patties. Roll the patties in panko or bread crumbs. Fry the patties on an oiled stovetop grill, cooking each side until golden brown. Serve the patties on buns or a bed of salad greens."
    },
    {
      "title": "Make tempeh sloppy joes",
      "content": "Make tempeh sloppy joes . This is a great weeknight dish to serve to a crowd. Leftovers taste even better the next day. To make tempeh sloppy joes: [9] X Research source Crumble a block of tempeh and Sauté it in oil until it's golden brown and crispy. Add 1 chopped onion and 1 chopped green bell pepper to the pan, and Sauté them until they soften. Add 1 teaspoon chili powder, 1 teaspoon garlic powder, 1/2 teaspoon cumin and 2 tablespoons (29.6 ml) soy sauce to the onion mixture. Sauté for another 2 minutes. Add 1 15 ounce can of tomato sauce. Let the mixture come to a simmer. Add salt and pepper to taste. Serve the sloppy joe mixture on hamburger buns."
    },
    {
      "title": "Make tempeh \"chicken\" salad",
      "content": "Make tempeh \"chicken\" salad . Believe it or not, tempeh is versatile enough to taste great tossed with mayonnaise, spices and sliced grapes as a delicious substitute for chicken. If you love chicken salad but don't want to eat meat, try using tempeh. To make tempeh salad: [10] X Research source Boil a block of tempeh for 8 minutes, then slice it into bite-sized cubes. Let it cool. Mix the tempeh cubes with 1/2 cup mayonnaise, a chopped stalk of celery, 1/2 chopped onion, 1/2 cup chopped green or red grapes, and salt and pepper. Add 1/2 teaspoon of curry to make curry tempeh salad. Chill the mixture for 1/2 hour. Serve the salad on a croissant or a bed of lettuce."
    }
  ]
}