{
  "url": "https://www.wikihow.com/Disable-%22No-Right-Click%22-Scripts-in-Firefox",
  "title": "Disable “No Right Click” Scripts on Any Website in Firefox",
  "steps": [
    {
      "title": "Press ⇧ Shift while right-clicking.",
      "content": "Press ⇧ Shift while right-clicking. The normal right-click menu will open even if the site would normally block it."
    },
    {
      "title": "Open the Configuration page.",
      "content": "Open the Configuration page. This option is no longer available in the Options menu. Instead, you will need to open the Firefox Configuration page. To do so, type about:config in the address bar and press Enter ."
    },
    {
      "title": "Click Accept the Risk and Continue.",
      "content": "Click Accept the Risk and Continue . You will need to confirm that you understand that changing the advanced configuration preferences could result in Firefox not working properly. Click Accept the Risk and Continue on the first page."
    },
    {
      "title": "Click Show all.",
      "content": "Click Show all . It's at the top of the page. This displays all the advanced configuration options."
    },
    {
      "title": "Find the control.",
      "content": "Find the control. To do so, type context into the search bar at the top of the page. Find the preference name listed as \"dom.event.contextmenu.enabled\" and double-click to toggle it to \"false\". This disables right-click scripts."
    },
    {
      "title": "Try right-clicking on a site that you couldn't before.",
      "content": "Try right-clicking on a site that you couldn't before. You may still receive a message about right-clicking not being allowed, but the right-click menu should appear after you close the message."
    },
    {
      "title": "Click on the Tools or Firefox menu.",
      "content": "Click on the Tools or Firefox menu. It's in the menu bar at the top. If you are using Windows, click Tools . If you are using a Mac, click Firefox ."
    },
    {
      "title": "Click Options or Preferences in the menu.",
      "content": "Click Options or Preferences in the menu. If you are using Windows, click Options . If you are using a Mac, click Preferences ."
    },
    {
      "title": "Click Content.",
      "content": "Click Content . It's at the top of the Windows that appears."
    },
    {
      "title": "Click the Advanced button.",
      "content": "Click the Advanced button. It's on the \"Enable JavaScript\" line."
    },
    {
      "title": "Uncheck \"Disable or replace context menus.\"",
      "content": "Uncheck \"Disable or replace context menus.\" It's in the Advanced window that appears. This disables right-click scripts."
    },
    {
      "title": "Search Google for \"no right-click script\" to test this.",
      "content": "Search Google for \"no right-click script\" to test this. Use Google to try to find a website that blocks right-clicking so that you can test this."
    }
  ]
}