{
  "url": "https://www.wikihow.com/Get-Rid-of-Wrinkles-Naturally",
  "title": "How to Get Rid of Wrinkles Naturally",
  "steps": [
    {
      "title": "Apply moisturizer to your skin once or twice a day.",
      "content": "Apply moisturizer to your skin once or twice a day. Splash your skin with cool water and pat it dry. Then, massage a squirt of your moisturizer onto your skin. You can do this whenever your skin feels dry and needs extra hydration. Pay attention to how your skin feels—it might be drier in the winter, for instance. When your skin is dry, you can get premature wrinkles and the wrinkles you already have might be more noticeable. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Keep it up! It usually takes a few weeks of moisturizing before you notice plump, smooth skin."
    },
    {
      "title": "Wash your skin with a gentle cleanser once or twice a day.",
      "content": "Wash your skin with a gentle cleanser once or twice a day. Keeping your skin clean gets rid of dirt, makeup, and sweat that irritates your skin. If your skin looks inflamed, your wrinkles will be more noticeable so wash your face at least once a day. Splash your skin with cool water and massage a gentle cleanser onto your skin until it's foamy. Then, rinse it off completely. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Be super gentle when you're washing—you don't want to scrub or pull on your skin which can irritate it. You can buy an anti-aging or sensitive skin cleanser that's designed to be gentle and moisturizing. Skip harsh cleansers that contain exfoliating ingredients since these can be too rough on your skin."
    },
    {
      "title": "Apply sunscreen and limit your sun exposure.",
      "content": "Apply sunscreen and limit your sun exposure. Sunlight's a great source of vitamin D, but the UV rays damage your skin. Reach for the sunscreen or a moisturizer that has a minimum 30 SPF protection before you go out. For extra protection, wear a hat and clothing that's UV-resistant. It's also a good idea to stay in shaded spots during the peak sunny hours of 10 am and 4 pm. [3] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020. UV light can make your wrinkles worse since it breaks down the supportive tissue in your skin. Remember to pop on a pair of sunglasses so you're not squinting when you're outside. This can prevent wrinkles from developing around the corners of your eyes."
    },
    {
      "title": "Use a natural moisturizer designed to fight wrinkles.",
      "content": "Use a natural moisturizer designed to fight wrinkles. Wrinkles aren't as noticeable when your skin is moisturized and plump. This is why a great moisturizer is important for anti-wrinkle skincare. Shop your local grocery store or natural market for a moisturizer that's designed for your skin type. For example, if you have eczema, you may want a moisturizer made for sensitive skin. [4] X Research source Read the label to pick a product that's non-comedogenic so it fills your wrinkles without clogging your pores. High-quality moisturizers should contain a natural oil like jojoba or argan oil."
    },
    {
      "title": "Rub vitamin serum onto your skin for anti-wrinkle treatment.",
      "content": "Rub vitamin serum onto your skin for anti-wrinkle treatment. Oil-based serums have gotten really popular in skincare. They're easy to use and they're full of vitamins and antioxidants. Buy a natural anti-wrinkle serum that has vitamin C and E. It's even better if it contains vitamin B3. These are all shown to penetrate deep into your skin to stimulate collagen production. Collagen plumps up your skin so wrinkles aren't as noticeable. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To use your serum, rub a few drops on your fingertips and rub them onto your clean, moisturized face once a day. You might make it part of your nightly skincare routine if you don't want to put makeup over it. Don’t feel like you need to include a whole slew of products in order to have a great anti-wrinkle routine. Try adding in products one at a time to figure out what works best for you! Reader Poll: We asked 799 wikiHow readers about what products make up their daily skincare routine, and 56% of them shared that they use just water and maybe one product . [Take Poll]"
    },
    {
      "title": "Try a rejuvenating egg white mask.",
      "content": "Try a rejuvenating egg white mask. Whisk up an egg white and apply it to your skin for an easy home remedy. The protein in the egg white helps moisture bond with your skin so it temporarily looks plumper. Leave the egg white mask on your face for 10 to 20 minutes before you rinse it off with cool water. Don't forget to moisturize your skin afterward to lock in the extra hydration. [6] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Don't be tempted to brightening ingredients like lemon juice or baking soda to the mask. Most dermatologists agree that these are too harsh for your skin."
    },
    {
      "title": "Do facial exercises to improve your skin's elasticity.",
      "content": "Do facial exercises to improve your skin's elasticity. Simple facial stretches might make your skin firmer so wrinkles aren't as visible. While more research is needed, it doesn't hurt to spend a few minutes a day working the muscles around your mouth. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Press your index finger and thumb against opposite corners of your mouth. Then, make the same shape with your opposite hand and place it above your first hand. Keep the fingers in place while you smile. Hold the smile for 3 seconds and repeat it 3 more times. [8] X Research source You can also try eye muscle exercises like pressing your fingers against your closed eyelids and moving your eyeballs up, although these haven't been proven to reduce wrinkles."
    },
    {
      "title": "Sleep on your back.",
      "content": "Sleep on your back. Change your sleep position if you notice your wrinkles more in the morning. If you look in the mirror first thing when you get up, do your wrinkles appear deeper or more noticeable? This might be because of how you sleep. Deeper wrinkles on your forehead can be caused by sleeping on your side while sleeping on your stomach can make wrinkles around your nose worse. To minimize the look of wrinkles, train yourself to sleep on your back. [9] X Research source You might place long body pillows to cushion your sides and prevent you from rolling over as you sleep. Want more tips for reducing forehead wrinkles? See what's worked for experts and fellow readers at the wikiHow forum post, \"How can I get rid of my forehead wrinkles?\""
    },
    {
      "title": "Quit smoking or try to cut back.",
      "content": "Quit smoking or try to cut back. Although quitting won't get rid of the wrinkles, it stops them from getting worse. Since smoking accelerates the natural aging process, when you quit, your skin has a better chance of healing itself and looking healthy. [10] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source Call your doctor if you have trouble kicking the habit. They can recommend cessation products or put you in touch with support programs."
    },
    {
      "title": "Adopt a whole-food, plant-based diet.",
      "content": "Adopt a whole-food, plant-based diet. A great anti-wrinkle diet doesn't have to be complicated! Focus on filling your plate with lots of fruits, vegetables, beans, lentils, nuts, and whole grains. The more variety you include, the more vitamins and minerals your skin gets. Fresh produce, nuts, and seeds are fantastic sources of vitamin C, E, and A, and you'll also get polyphenols that reduce the appearance of wrinkles. To get you started, add some of these foods to your diet: [11] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Citrus and fruits like oranges, pineapples, and mangoes Nuts and seeds like sunflower seeds, almonds, walnuts Vegetables like kale, spinach, broccoli, and chili peppers Berries like blueberries, raspberries, strawberries"
    },
    {
      "title": "Cut out processed foods and sweets.",
      "content": "Cut out processed foods and sweets. High-fat, processed foods can damage your skin cells so wrinkles worsen. Your body uses vitamins and minerals to repair your skin, but saturated fats cause damage. Swap out red meat, butter, dairy, and processed snacks like crackers or cookies for healthy alternatives. [12] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source For example, instead of frying hamburgers, grill a veggie burger instead. Skip the french fries and go for roasted broccoli and carrots on the side."
    }
  ]
}