{
  "url": "https://www.wikihow.com/Feed-a-Betta-Fish-Peas",
  "title": "How to Feed a Betta Fish Peas",
  "steps": [
    {
      "title": "Try peas to help with swim bladder issues.",
      "content": "Try peas to help with swim bladder issues. Since fish don’t digest food the same way we do, the fiber in peas won’t really help them with issues like constipation. However, if your fish is floating due to having too much gas in its belly or swim bladder, peas may help it “sink” again. [1] X Research source Peas may also benefit sick fish because they are rich in vitamins and, due to their low protein content, can reduce the amount of ammonia getting into the water from your fish’s waste."
    },
    {
      "title": "Offer peas as an occasional low-calorie treat.",
      "content": "Offer peas as an occasional low-calorie treat. Bettas are carnivores, so peas and other plants aren’t a great source of nutrients for them. [2] X Research source However, giving your betta peas on occasion won’t hurt it, especially if your fish is a little overweight. If you’re trying to cut back on high-calorie treats, such as freeze-dried fruits, you can safely replace them with bits of shelled green pea. [3] X Research source Your betta may be overweight if its sides bulge slightly just behind the fish’s “shoulders” (the area just behind the gills). Bettas should be torpedo-shaped, tapering smoothly from head to tail when viewed from above. In general, it’s best to offer your betta treats no more often than once every other day."
    },
    {
      "title": "Don’t make peas a major part of your betta’s diet.",
      "content": "Don’t make peas a major part of your betta’s diet. Bettas can’t live on plant-based foods. While an occasional green pea snack probably won’t hurt your fish, an imbalanced diet will cause them to become malnourished or sick. [4] X Research source Only give your betta peas occasionally, as a treat or supplement."
    },
    {
      "title": "Feed your betta mainly high-quality flakes or pellets.",
      "content": "Feed your betta mainly high-quality flakes or pellets. Look for a food specially designed for bettas in your pet store. Most betta foods come in flake or pellet form. These foods are high in protein and contain the right balance of nutrients to keep your betta healthy and happy. [5] X Research source Most betta treats should also be animal-based instead of plant-based. Appropriate treats for bettas include dried bloodworms and live or freeze-dried brine shrimp."
    },
    {
      "title": "Boil a few peas for about 1 minute.",
      "content": "Boil a few peas for about 1 minute. Before feeding peas to your betta, you’ll need to soften the peas by boiling them. Toss a few fresh or frozen peas into boiling water for about a minute, then scoop them out or strain the water to remove the peas. [6] X Research source You can also soften frozen peas by cooking them in the microwave in a dish with about 1 ⁄ 2 inch (1.3 cm) of water in the bottom. Microwave the peas for about 10 seconds at a time, or until they are completely defrosted. It doesn’t matter what type of peas you have on hand. Most common peas, such as garden peas, snow peas, and snap peas, will work. You don’t need to cook many peas. Each fish will only need to eat about ½ a pea at any given feeding. [7] X Research source"
    },
    {
      "title": "Let the peas cool completely.",
      "content": "Let the peas cool completely. Once you remove your peas from the boiling water or the microwave, either dunk them in cold water or let them cool to room temperature on your counter. This should only take a few moments. [8] X Research source You don’t want to give a betta fish a hot pea, so take the time to make sure it is cool."
    },
    {
      "title": "Remove the skins from the peas.",
      "content": "Remove the skins from the peas. You’ll need to remove the outer layer of skin from the peas before feeding them to your betta. [9] X Research source Try to peel the skin off with your fingers. [10] X Research source You can also carefully slice the skin open with a knife to make peeling it off easier. Discard the skins after you remove them from the peas."
    },
    {
      "title": "Cut each pea into small pieces.",
      "content": "Cut each pea into small pieces. Bettas have tiny mouths, so you’ll need to chop the peas up before feeding them to your fish. The peas should easily separate into 2 halves after you peel them. Then, use your hands or a sharp knife to break them into even smaller pieces. [11] X Research source Cutting the pea into 8 pieces will ensure that the pieces are small enough for the betta fish to eat easily. If you are unsure whether the pieces are small enough, just make sure that each one is no bigger than one of the betta fish’s eyeballs."
    },
    {
      "title": "Drop a piece of the pea into your betta’s tank.",
      "content": "Drop a piece of the pea into your betta’s tank. Using tweezers or your fingers, drop one piece of the pea into the water at a time. Adding them gradually will get the betta’s attention, luring it to the food. [12] X Research source The pea will likely drop to the bottom of the tank. However, in most cases your betta will be able to find it. If your betta is ignoring the pea pieces, put the tip of your finger on the surface of the water. This will draw most betta fish to the area, and then you can drop the pea in the water once you have your fish’s attention."
    },
    {
      "title": "Add all the pieces of the pea gradually.",
      "content": "Add all the pieces of the pea gradually. If your betta doesn’t eat the pea pieces right away, they’ll sink to the bottom of the tank and rot. Try not to give your fish more food than it can eat within 3-5 minutes. [13] X Research source With this in mind, keep adding pieces to the tank slowly as your betta eats them. [14] X Research source You can also keep the pieces from sinking by holding them with tweezers or placing them on the end of a toothpick."
    },
    {
      "title": "Remove any leftover pea pieces within an hour or so.",
      "content": "Remove any leftover pea pieces within an hour or so. If your betta fish has leftovers, use an aquarium net to remove them. Leftover food in the bottom of your tank will pollute the water and could make your betta sick. [15] X Research source However, make sure you take out the leftover pea very gently so that you don’t stress your betta fish out."
    },
    {
      "title": "Consult an aquatic vet if your fish looks bloated.",
      "content": "Consult an aquatic vet if your fish looks bloated. There are many reasons why a betta might have trouble pooping or appear bloated. It can be hard to identify the cause just by looking, and unfortunately, peas won’t help with most of these issues. If you think your betta might be sick, talk to an aquatic vet or a fish care specialist at your local pet store. [16] X Research source Common causes of bloating or intestinal blockage in bettas include overfeeding, tumors, and bacterial infections. A vet can tell you what’s causing your betta to look bloated and go over possible treatment options. If you live in the U.S., you can find a fish vet near you using this directory: https://fishvets.org/find-a-fish-vet/ . Depending on what’s causing your fish’s symptoms, giving your betta peas may not be an appropriate treatment. Get advice from a vet or fish care specialist before changing your betta’s diet."
    },
    {
      "title": "Feed your betta only 3-4 pellets per day.",
      "content": "Feed your betta only 3-4 pellets per day. Overfeeding is a common cause of health problems in bettas, including obesity and intestinal blockages. [17] X Research source To keep your betta healthy and prevent issues like bloating and “constipation” (which is more likely to be a severe blockage in bettas), don’t give your betta more food than it can eat within 3-5 minutes. [18] X Research source In general, it’s best to feed bettas no more than 3-4 pellets per fish at each feeding. [19] X Research source Check the directions on your fish food package to find out if it needs special preparation. For example, it’s a good idea to briefly soak some types of pellets in water to soften them before feeding them to your betta."
    },
    {
      "title": "Keep your betta in a tank that holds at least 5 gallons (19 L).",
      "content": "Keep your betta in a tank that holds at least 5 gallons (19 L). Your betta is more likely to get sick or become overfed in an undersized tank. While you may have heard that it’s okay to keep bettas in a tiny fishbowl or vase, they actually need a lot more room than that for optimal health. Keep your betta in a glass or plastic tank that’s at least 5 gallons (19 L), and preferably even larger. [20] X Research source Be careful not to overcrowd your fish’s tank with decorations and plants. Make sure it still has enough room to easily swim around and explore its environment."
    },
    {
      "title": "Heat your betta’s tank to 78–82 °F (26–28 °C).",
      "content": "Heat your betta’s tank to 78–82 °F (26–28 °C). Bettas are tropical fish that thrive in warm water. To keep your betta’s metabolism and immune system in good shape, add a heater to your tank and use a thermometer to monitor the water temperature. [21] X Research source Because cold water slows a betta’s metabolism, it’s easier to overfeed your fish in an unheated tank, leading to issues like obesity and intestinal blockages. [22] X Research source"
    },
    {
      "title": "Fit your betta’s tank with a filter.",
      "content": "Fit your betta’s tank with a filter. Your fish could get seriously sick if you don’t keep the water clean. Install a filter in your tank and change or clean it as often as recommended by the manufacturer. [23] X Research source Remember to do a partial water change in your betta’s tank at least once a week, too! Bettas can be slow and picky about eating, and other fish can easily outcompete the beta before it gets what it needs. Look for fast-moving nonaggressive tank mates, such as small tetras, like cardinals or neons. Avoid fish like tigers, barbs, and larger tetras as they can be too aggressive to the betta. The betta should be the centerpiece of the aquarium, and every other fish should be compatible with it."
    }
  ]
}