{
  "url": "https://www.wikihow.com/Fix-Dough-That-Won%27t-Rise",
  "title": "How to Fix Dough That Won't Rise",
  "steps": [
    {
      "title": "Check your yeast type and expiration date.",
      "content": "Check your yeast type and expiration date. Unopened dry yeast lasts 2 years after the date it was packaged, while opened dry yeast lasts 4-6 months in the refrigerator or 6 months in the freezer. [2] X Research source After your yeast’s lifespan is up, it will function weakly, or not at all. Some sourdough cultures are very slow rising and may need several hours to rise. If you’re following a no-knead recipe or making pizza dough , your bread will take longer to rise than if you’re using active dry or instant yeast. [3] X Research source"
    },
    {
      "title": "Check the environment.",
      "content": "Check the environment. The ideal temperature for bread baking is approx 75°F (24°C) with high humidity for a slow, steady, and flavorful rise. Move too far below that range, and your yeast will not be happy. [4] X Research source We’ll show you how to create a proof box to fix the temp and humidity in the next section."
    },
    {
      "title": "Check the flour type and your kneading technique.",
      "content": "Check the flour type and your kneading technique. Bread made with cake or all-purpose flour, has low gluten and protein contents, so your dough may rise—and then collapse. To prevent your dough from collapsing, knead it for 15 minutes until it feels stiff, and use a high-protein flour in the future. [5] X Research source Dough can also collapse if you have too high of a flour-to-water ratio. Simple bread dough often has flour-to-water ratio of 5:3 (60% water). [6] X Research source Some flours contain antifungal ingredients to prolong shelf life. As yeast is a proud member of the Fungi kingdom, this will most definitely inhibit growth. Organic, additive-free unbleached white bread flour works best for a good loaf of white bread. Heavier flours such as whole wheat, rye and other types of whole-grain flour will result in a heavy loaf that does not rise as much as fine white bread flour."
    },
    {
      "title": "Ease up on the salt.",
      "content": "Ease up on the salt. Salt is a required ingredient for developing the gluten proteins that make for a smooth elastic dough, but too much will kill the yeast. [7] X Research source Add only the required amount of salt, and add it to the flour, not the water, at the beginning."
    },
    {
      "title": "Use the proper container.",
      "content": "Use the proper container. The pan, banneton, or tray you use will make a difference. Too large, and the dough has nothing to push against when rising, so it won't rise upwards. Instead, it will spread and possibly collapse. [8] X Research source Small buns do well placed fairly close together."
    },
    {
      "title": "Make sure you’ve let the dough rest.",
      "content": "Make sure you’ve let the dough rest. Do not disturb the dough while it is rising, especially if it is a particularly wet dough. Most dough needs to rest for 1-3 hours to get a proper rise. [9] X Research source"
    },
    {
      "title": "Check your added ingredients.",
      "content": "Check your added ingredients. Some spices, such as cinnamon, are naturally antifungal. Those antifungal ingredients can kill your yeast! [10] X Research source For sweet fruit buns or cinnamon rolls, you usually want a fast rise, as the cinnamon will eventually kill the yeast off. Some dried fruits also are coated with antifungals as a preservative. Organic dried fruits are expensive but much better for baking. What many bakers do is use standard dried fruit but don't add it till the final proofing."
    },
    {
      "title": "Turn up the temperature to 80–90 °F (27–32 °C).",
      "content": "Turn up the temperature to 80–90 °F (27–32 °C). Yeast loves nothing better than a warm, moist climate so it can multiply and your dough can be proof. [11] X Research source If you want your dough to rise, up the temperature and set up the ideal humidity (75%) by creating a proof box in your oven . Fill a baking pan with boiling water, and set it on the lowest rack in your oven. Place the container of dough on the middle rack, close the oven door, and allow the dough to rise. Alternatively, you can boil a cup of water in the microwave, then place the container of dough in the microwave with the water, and close the door. (Don't microwave the dough!) Some people turn on the oven, and place the dough on top of the stove, covered with a damp towel. The oven keeps the surface of the stove warm, and the damp towel provides moisture."
    },
    {
      "title": "Add more yeast.",
      "content": "Add more yeast. If warm and moist isn't activating the yeast (you'll know in less than an hour), you can try adding more yeast. [12] X Research source Open a new package of yeast, and mix a teaspoon of yeast with 1 cup (240ml) of warm water (at about 110°F/43°C) and 1 tablespoon of sugar. Let this mixture proof for about 10 minutes, until it gets 1/2- to 1-inch of foam. If this fails, you will need to get fresh yeast and try again. While proofing this yeast mixture, gently warm the flat dough to about 75–90 °F (24–32 °C) by placing the bowl in a warm place."
    },
    {
      "title": "Blend in the starter.",
      "content": "Blend in the starter. Adding more flour as necessary: a ratio of 60% flour to 40% liquid is usually a good ratio for bread doughs so add sufficient flour needed to balance. Knead the active yeast mixture into the dough, then let it rise in a warm, moist place. This can also be an indicator to see if your yeast is not active. This method makes the yeast very active so when it is added to the dough, it should rise perfectly. If your dough still fails to rise, it will indicate the yeast is not at fault: there is another problem. You can also do this at the beginning of the recipe next time you make a different yeast dough."
    },
    {
      "title": "Knead in more flour.",
      "content": "Knead in more flour. Check whether the dough is sticky to the touch. If so, this is probably under-kneaded dough. Knead in additional flour until smooth and silky to the touch and the dough no longer sticks to your hand. Let rest and rise in a warm wet environment. Repeat if needed. You may need to let the dough rest overnight before shaping and baking. [13] X Research source"
    },
    {
      "title": "Knead the dough properly.",
      "content": "Knead the dough properly. There's an art to kneading. Too little, and you may not distribute the yeast through the dough. The dough will then be too weak to be able to rise. Too much kneading may make the dough so tough that it cannot expand. The dough should feel smooth and elastic, not tight like a rubber ball, or soft like biscuit dough. [14] X Research source"
    }
  ]
}