{
  "url": "https://www.wikihow.com/Get-Glitter-Out-of-Your-Hair",
  "title": "How to Get Glitter Out of Your Hair",
  "steps": [
    {
      "title": "Shake your hair out as thoroughly as possible while you’re outside.",
      "content": "Shake your hair out as thoroughly as possible while you’re outside. Flip your hair upside down so the glitter doesn’t get all over your clothes. If you can, run your fingers through your hair and gently shake it out. [1] X Research source Be gentle when doing this. You don’t want to accidentally rub the glitter into your scalp and risk irritating your skin."
    },
    {
      "title": "Apply a natural oil to your hair from roots to tips.",
      "content": "Apply a natural oil to your hair from roots to tips. Use either olive oil or coconut oil and work it through your dry hair until it is completely covered. As you do this, you may notice glitter starting to come off on your hands—that’s totally okay! Just keep working and ignore your hands for now. You’ll wash them later. [2] X Research source Baby oil also works well for this process. You can even use makeup remover oil. [3] X Expert Source Kana Ishii Licensed Cosmetologist Expert Interview. 22 December 2021."
    },
    {
      "title": "Massage the oil into your hair for 2 to 3 minutes.",
      "content": "Massage the oil into your hair for 2 to 3 minutes. Use your fingers to really work that oil into the parts of your hair that are most saturated with glitter. Whether it’s your scalp or the tips of your hair, gently massage the areas to loosen the glitter as much as possible. [4] X Research source Once you’re done, wash your hands with gentle soap and warm water to get the oil and glitter off of your hands."
    },
    {
      "title": "Let your hair soak in the oil for 10 to 15 minutes.",
      "content": "Let your hair soak in the oil for 10 to 15 minutes. The oil will loosen the glitter and get between it and your hair. Avoid setting your head against furniture or pillows so that the oil doesn’t stain the fabric. If you want, clip your hair up on top of your head so that it doesn’t get on your clothes. [5] X Research source Don’t brush your hair out yet. You may be tempted to work the oil through your hair with a brush, but doing so will just make the brush oily and glittery."
    },
    {
      "title": "Shampoo your hair",
      "content": "Shampoo your hair as normal to remove the glitter. After the 10 minutes are up, use your normal shampoo and warm water to wash your hair. Avoid using cold water, as it will make it harder to wash all the oil out of your hair. Make sure to really spend a few minutes massaging your scalp and thoroughly rinsing out the shampoo to make sure all the glitter is gone. [6] X Research source If it feels like your hair is still oily after the shampoo has been rinsed out, wash your hair a second time. [7] X Expert Source Kana Ishii Licensed Cosmetologist Expert Interview. 22 December 2021."
    },
    {
      "title": "Spray a paper towel with hairspray until it is saturated.",
      "content": "Spray a paper towel with hairspray until it is saturated. It doesn’t matter what kind of hairspray you use for this glitter-removing process. What matters the most is that you really saturate the power towel so that it’s damp and completely covered. [8] X Research source If you’re sensitive to the smell of hairspray, try doing this outside or in a well-ventilated space."
    },
    {
      "title": "Blot your scalp with the paper towel to remove glitter.",
      "content": "Blot your scalp with the paper towel to remove glitter. Work along your part line and focus on the sections that have the most build-up. Use an up-and-down motion rather than a back-and-forth rubbing motion. [9] X Research source Because the glitter might fall off of the paper towel at some point, try to do this while standing in the shower or over a towel so that the excess glitter doesn’t get all over your home. If the paper towel is covered with glitter and there are no more clean areas available, go ahead and prepare a new paper towel."
    },
    {
      "title": "Pat the strands of your hair with the paper towel to dislodge more glitter.",
      "content": "Pat the strands of your hair with the paper towel to dislodge more glitter. Once you’ve dislodged most of the glitter from your scalp, go ahead and start working on the rest of your hair. Take the hairspray-soaked paper towel and wrap it around sections of your hair to blot up more glitter. [10] X Research source Work in 1 to 2 in (2.5 to 5.1 cm) sections so that you do the most thorough job possible."
    },
    {
      "title": "Repeat the process until the paper towel is coming away clean.",
      "content": "Repeat the process until the paper towel is coming away clean. This may take 10 to 15 minutes, but it’ll really help to dislodge a lot of glitter and make the clean-up process that much easier. [11] X Research source"
    },
    {
      "title": "Shower to remove any glitter that remains behind.",
      "content": "Shower to remove any glitter that remains behind. Showering will remove whatever glitter is still on your hair, plus it’ll get rid of the hairspray residue. Make sure to massage the shampoo into your scalp really well and thoroughly rinse away all the suds. [12] X Research source Glitter and hairspray have the potential to really dry out your hair, so make sure to condition your locks. You could even apply a hydrating hair mask to give your hair some extra TLC."
    },
    {
      "title": "Style your hair before applying any glitter to make sure it’s visible.",
      "content": "Style your hair before applying any glitter to make sure it’s visible. Instead of putting glitter all over your hair first, get your locks into the look you prefer, whether that’s a straight down-the-middle part , beautiful braids , or space buns . If you were to put glitter all over your hair and then pull it back, most of the glitter wouldn’t be visible. This is why it’s a great idea to style your hair first, then put on glitter."
    },
    {
      "title": "Spray a light coat of hairspray to create a barrier between your hair and the glitter.",
      "content": "Spray a light coat of hairspray to create a barrier between your hair and the glitter. The hairspray will also help keep your hair in place. At the end of the day, it’ll make it a little easier to remove. All you need for this part of the process is a light dusting of hairspray. You’ll be able to add more later once the glitter is in place to really lock in your style."
    },
    {
      "title": "Apply some oil to your roots before putting on the glitter.",
      "content": "Apply some oil to your roots before putting on the glitter. Use a clean makeup brush to evenly spread a really thin layer of coconut oil or olive oil along your roots. The oil will help the glitter stick in place, plus it’ll make it easier to wash off later. [13] X Research source Avoid using oil over your entire head of hair. It could make it look greasy and ruin the look you’re going for."
    },
    {
      "title": "Shake, spread, and disperse the glitter over the oil to create your look.",
      "content": "Shake, spread, and disperse the glitter over the oil to create your look. There are tons of different kinds of glitter to choose from, from fine glitter to chunky glitter to myriads of colors. Use the glitter as a fine dusting or really pile it on for a glamorous effect. Some hair glitters come in a gel form already. If that’s the case, you don’t need to worry about putting oil on your roots."
    }
  ]
}