{
  "url": "https://www.wikihow.com/Fingerboard",
  "title": "The Essential Fingerboarding Guide for Beginners",
  "steps": [
    {
      "title": "Buy a quality fingerboard that feels comfortable to your hand size.",
      "content": "Buy a quality fingerboard that feels comfortable to your hand size. Fingerboards come in many designs and sizes, just like skateboards. Shop around for a style that looks nice to you, and test it out with your index and middle fingers placed on the front and back lip. If it doesn't feel like too much of a stretch, then the board is right for you! [1] X Research source If you really want to make sure your fingerboard is right for you, test it out by rolling it back and forth, to see how the wheels handle. Push down on the front, back, and both sides to test its handling. All you need to worry about as a beginner is that the board feels comfortable to you."
    },
    {
      "title": "Place your index finger in the middle with your middle finger on the rear end.",
      "content": "Place your index finger in the middle with your middle finger on the rear end. Finger positioning is everything in fingerboarding. Place your index finger in the middle and rest your middle finger on the back lip of the board. The index finger acts as a balance to keep control of the board, while the middle finger will press down to launch the board up and do tricks. Again, what matters most is that your fingers are comfortable in this position. [2] X Research source If you find that having three fingers on the board makes controlling the board easier, or if you find that reversing the fingers makes tricks easier for you, by all means, make some changes."
    },
    {
      "title": "Turn the board by pushing down on the back lip.",
      "content": "Turn the board by pushing down on the back lip. Move the fingerboard forward on a flat surface with your fingers and press down on the back lip with your middle finger to lift the front wheels into the air. Twist your fingers in the direction you want to turn to make the board turn with your movement. [3] X Research source Practice this a few times until you don't even have to think about it to do it. This is a basic move that will come in handy in all of your future skills!"
    },
    {
      "title": "Try a manual by lifting the front of the board while moving the board forward.",
      "content": "Try a manual by lifting the front of the board while moving the board forward. [4] X Research source Press on the rear of the fingerboard with your middle finger to lift the front, and try to keep it going forward while you keep pressing down on the rear. The board will stay angled, and you can press down with your index finger on the front to land the trick. This is essentially the same movement as turning the board, but instead of turning you continue to move the board forward."
    },
    {
      "title": "Perform an ollie by lifting the board into the air with pressure on the rear.",
      "content": "Perform an ollie by lifting the board into the air with pressure on the rear. Place your middle finger on the rear lip and your index finger on the center of the board, then press your middle finger down to lift the front wheels up. In a swift motion, press down hard on the rear to force it into the air and keep the board balanced with your central finger. The board will come down and land on all four wheels! [5] X Research source Ollies are easier to do with some momentum, but practice without moving the board first. Some people like to place their central finger closer to the nose lip of the board because it gives you more control in the air."
    },
    {
      "title": "Do a kickflip by doing an ollie then sliding your index finger off of the side in the air.",
      "content": "Do a kickflip by doing an ollie then sliding your index finger off of the side in the air. You will follow the same motion you did to perform an ollie, but while it is in the air, slide your index finger off of one side of the board quickly. [6] X Research source The board will rotate once in the air and come to be right-side-up by the time it lands. Use two fingers to press down on the top when the board comes down to land it successfully."
    },
    {
      "title": "Perform a heelflip by angling your middle finger and curling your index finger slightly.",
      "content": "Perform a heelflip by angling your middle finger and curling your index finger slightly. With your middle finger on the rear lip and your index finger just behind the bend at the front lip, launch the board into the air. Curl your index finger slightly to flick the nose away from you. Your board will rotate sideways away from you once, then catch and land it. [7] X Research source You may find this easier to do if your board is angled towards you before you launch it into the air, as this allows for your index finger to more easily curl towards you."
    },
    {
      "title": "Do a basic 50-50 grind on a rail with your fingers keeping the board balanced.",
      "content": "Do a basic 50-50 grind on a rail with your fingers keeping the board balanced. Perform an ollie, then catch and land the board directly onto a rail. You can use a custom-made fingerboarding rail, or the edge of a table or piece of wood. [8] X Research source Use slight pressure from both fingers on each side of the board to keep it balanced, and move it forward to the end of the rail. You may find it easier to keep balanced if your hand and fingers are flat, parallel to the top of the board. Feel free to find your balance before attempting to ollie onto a rail by placing your board directly onto the rail."
    },
    {
      "title": "Perform a 5-0 by doing an ollie onto a rail, then manual the rail.",
      "content": "Perform a 5-0 by doing an ollie onto a rail, then manual the rail. This is a bit of a trickier grind, as it combines three tricks into one. Ollie your board up, and instead of using both fingers to land the board onto the rail, just use your rear finger to apply pressure downwards. [9] X Research source Your board will land at an angle on the rail — keep the manual going by using a continuous slight amount of pressure on the rear, and then land the trick by bringing your front finger back down on the front lip. Practice this trick by placing the board onto the rail without an ollie, and then try to do a manual. It is trickier than performing a manual on a flat surface because only the center of the board itself will give you stability rather than both rear wheels. [10] X Research source"
    },
    {
      "title": "Do a nose grind by performing the manual backward by pressing on the front.",
      "content": "Do a nose grind by performing the manual backward by pressing on the front. Ollie your board into the air, but instead of applying pressure on the rear as you would with a 5-0 grind, instead bring your index finger to the nose and press down to lift the rear up. [11] X Research source Your board will be angled at the rear, instead of at the front, and you can ride it to the end of the rail where you will put pressure back on the rear to land the board. This is essentially a reverse 5-0, or a front-side manual performed on a rail instead of on a flat surface. It can take a few minutes to get used to the reversed finger motions, so don't lose patience and keep trying until you nail it!"
    }
  ]
}