{
  "url": "https://www.wikihow.com/Cook-Sausages",
  "title": "How to Cook Sausages on the Stovetop, Frying Pan, Grill, & More",
  "steps": [
    {
      "title": "Heat 1 tablespoon (15 ml) of olive oil in a skillet over medium heat.",
      "content": "Heat 1 tablespoon (15 ml) of olive oil in a skillet over medium heat. Use a heavy-bottomed pan like a cast-iron skillet since they conduct heat really well. Give the oil a few minutes to heat up in the pan before you add the sausages. [2] X Research source If you don't have olive oil, it's fine to use butter or vegetable oil."
    },
    {
      "title": "Cut the sausages in half lengthwise if they're large.",
      "content": "Cut the sausages in half lengthwise if they're large. Narrow or small sausages cook quickly in a skillet, but big sausages like andouille take a lot longer to cook. To cut back on cooking time and give your sausages more flavor, slice them in half. [3] X Research source Feel free to cut the sausages into even smaller pieces. Cutting the sausages increases their surface area so more of the sausage caramelizes in the skillet. This translates to amazing flavor!"
    },
    {
      "title": "Add the sausages to the skillet and cook them for 5 minutes.",
      "content": "Add the sausages to the skillet and cook them for 5 minutes. If you cut the sausages, place them flat-side down in the skillet. If they're whole, just lay them in the skillet so there's a little space between each one. Then, cook the sausages, turning them occasionally with tongs , until they're browned. If the sausages don't sizzle when they hit the skillet, turn up the heat to medium-high. If you'd like to cook a lot of sausages, use a large skillet or cook them in batches."
    },
    {
      "title": "Add 1⁄2 c (120 ml) of water and cook them for another 7 to 15 minutes.",
      "content": "Add 1 ⁄ 2 c (120 ml) of water and cook them for another 7 to 15 minutes. Cover the skillet as soon as you add the water so you trap the steam. Then, cook the sausages until they're completely done in the center. This method ensures that the centers of the sausages cook completely, but you still get that rich, dark exterior. To check if the sausages are done, insert an instant-read meat thermometer into the center of the thickest sausage to see if it has reached 160 °F (71 °C). [4] X Research source Keep in mind that if you're cooking small sausages, like breakfast sausages, they may only need 5 to 10 minutes to finish cooking. Remove the lid carefully so steam doesn't rush into your face. Rest the sausages for a few minutes before you serve them. Resting helps redistribute juices within the meat so it won't spill out when you cut the sausages."
    },
    {
      "title": "Preheat the oven to 350 °F (177 °C) and line a sheet with foil.",
      "content": "Preheat the oven to 350 °F (177 °C) and line a sheet with foil. The foil prevents the sausages from sticking to the baking sheet and it makes cleanup easier. However, if you don't want the sausages to cook in their juices, which can be fatty, set a metal rack on the foil-lined sheet so the juices drip down as the sausages cook. [5] X Research source"
    },
    {
      "title": "Place the sausages on the pan.",
      "content": "Place the sausages on the pan. Set them directly on the foil or the metal rack on the sheet. Leave at least 1 ⁄ 2 inch (1.3 cm) of space between each sausage so heat can circulate evenly. [6] X Research source Don't prick the sausages before you cook them since this causes the juices to run out faster, making the sausages dry. For an easy sheet-pan dinner, spread chopped root vegetables like onions, potatoes, and peppers alongside the sausages. Drizzle the vegetables with a little olive oil and season them with salt and pepper."
    },
    {
      "title": "Bake the sausages for 15 to 20 minutes, turning them at the halfway mark.",
      "content": "Bake the sausages for 15 to 20 minutes, turning them at the halfway mark. Place the tray in the hot oven and cook the sausages until they're browned on the outside—use tongs to turn them halfway through the cooking time so they brown evenly. Keep in mind that if you're cooking large sausages, you may need a few more minutes, so check them every 5 minutes until they look done. [7] X Research source Smaller or narrow sausages take less time to cook, so check them earlier."
    },
    {
      "title": "Remove the sausages once they reach 160 °F (71 °C).",
      "content": "Remove the sausages once they reach 160 °F (71 °C). To test if the sausages are done cooking, carefully insert an instant-read meat thermometer into the center of the thickest sausage to see if it has reached 160 °F (71 °C). Then, set the tray of sausages aside to rest for a few minutes before you serve them. [8] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source Resting the sausages for a few minutes helps them reabsorb juices. This way, they won't leak all over your serving platter when you cut into them."
    },
    {
      "title": "Place your sausages in a pan and pour in water.",
      "content": "Place your sausages in a pan and pour in water. Add enough water so that it comes 1/3 of the way up the sides of the sausages. There's no need to bring the water to a boil first—if you add sausages to boiling water, they're likely to split open or splash you when you add them to the pan. [9] X Research source For an easy way to add flavor, replace the water with broth, stock, beer, wine, or tomato sauce. Simmering is a great way to gently cook sausages like brats, hot dogs, or knockwurst because it's really hard to dry them out. If you tend to overcook sausages, try simmering them."
    },
    {
      "title": "Turn the heat to high and simmer the sausages.",
      "content": "Turn the heat to high and simmer the sausages. Keep the lid off of the pot so water can evaporate as the sausages cook. Use tongs to turn them halfway through the cooking time—you'll see that they look opaque once they're cooked on 1 side. [10] X Research source If the water is boiling too vigorously, turn the heat down a little so the water bubbles gently. Don't use forks to turn the sausages, or you might accidentally prick them and release all their flavorful juices."
    },
    {
      "title": "Cook the sausages for 20 minutes or until they reach 160 °F (71 °C).",
      "content": "Cook the sausages for 20 minutes or until they reach 160 °F (71 °C). Keep simmering the sausages until they look thoroughly cooked and most of the water evaporates. [11] X Research source Keep in mind that you can't tell if they're actually done by sight alone, so insert an instant-read meat thermometer into a sausage to check that it's reached 160 °F (71 °C)."
    },
    {
      "title": "Sear the sausages in a skillet if you want to give them extra color.",
      "content": "Sear the sausages in a skillet if you want to give them extra color. While simmering the sausage is a simple way to cook them, they won't have the distinctive brown color that most sausages get. To fix that, heat a spoonful of oil in a skillet over medium-high heat and add the cooked sausages. Use tongs to turn the sausages frequently while you sear them for a few minutes. Remove the sausages once they're as brown as you like. [12] X Research source If you've got your grill going, sear the sausages on the grill instead of in a skillet. You'll add wonderful smoky flavor to the meat."
    },
    {
      "title": "Remove the sausages and rest them for a few minutes before serving.",
      "content": "Remove the sausages and rest them for a few minutes before serving. Turn off the burner and use tongs to move the sausages to a platter. Cover them loosely with foil for a few minutes to rest the meat. Then, slice them and serve them or stick them in a bun for a great sandwich. [13] X Research source"
    },
    {
      "title": "Heat a gas or charcoal grill to medium heat.",
      "content": "Heat a gas or charcoal grill to medium heat. If you're lighting a charcoal grill , fill a chimney starter with briquettes and light them. Once the coals are hot and lightly covered with ash, dump them on 1 side of the grill grate. If you're using a double-knob gas grill, turn 1 to high heat and the other to low heat. This creates a 2-zone fire, which gives you a lot of control when grilling the sausages."
    },
    {
      "title": "Oil the grill grates and lay the sausages on the grill.",
      "content": "Oil the grill grates and lay the sausages on the grill. Scrunch up a piece of cotton fabric or a paper towel and grip it with a pair of tongs . Dip the cotton or paper towel into vegetable or canola oil and wipe it onto the grill grate. [14] X Research source Then, place your sausages on the hot side of the grill—the side with the high heat or briquettes. Oiling the grates prevents the sausages from sticking so it's really easy to turn them. Leave space between each sausage so they grill evenly. If your sausages are connected by casing, separate them before you toss the sausages on the grill."
    },
    {
      "title": "Cover the grill, but turn the sausages every few minutes.",
      "content": "Cover the grill, but turn the sausages every few minutes. Carefully lift the lid and use the tongs to turn each sausage over so they don't get too dark on 1 side. If it looks like the grill is too hot and you're worried that the sausages are going to burn before the center cooks, move them to the cool side of the grill. The sausages are less likely to burn when you cook them over indirect heat—the side that's turned to low or doesn't have briquettes."
    },
    {
      "title": "Grill the sausages",
      "content": "Grill the sausages for 8 to 10 minutes or until they reach 160 °F (71 °C). The sausages will look browned on the outside, but it's important to cook them until the centers are safe to eat. To check, insert an instant-read meat thermometer into the center of a sausage. Pull them off the grill once they're at 160 °F (71 °C). [15] X Trustworthy Source FoodSafety.gov Online portal combining food safety information from the U.S. Food and Drug Administration, the Food Safety and Inspection Service, and the Centers for Disease Control and Prevention Go to source Serve the sausages right away or loosely cover them with a piece of aluminum foil to keep warm until you're ready to eat."
    }
  ]
}