{
  "url": "https://www.wikihow.com/Corrupt-a-File-on-Purpose-Using-Corrupt-a-File.Net",
  "title": "How to Corrupt a File on Purpose Using Corrupt a File.Net",
  "steps": [
    {
      "title": "Make sure your file is believable.",
      "content": "Make sure your file is believable. If you're corrupting the file in order to send it to someone for the purpose of buying more time to work on the file, you'll want to make sure that the file is the correct size, length, and/or format. For example, if your document is supposed to be a 10-page Word document, you should type 10 pages' worth of text (e.g., gibberish or copied text from elsewhere) into a Word document to show that the document is actually 10 pages long."
    },
    {
      "title": "Consider backing up the original file.",
      "content": "Consider backing up the original file. While you won't be corrupting the original file, there's always a chance that you'll accidentally delete the original file instead of the corrupted file when you're through using it. To avoid this, it's best to create a copy of the file you want to corrupt. To back up a file, click the file in question, press either Ctrl + C (Windows) or ⌘ Command + C (Mac) to copy it, go to a safe location on your computer, and paste the file there by pressing either Ctrl + V or ⌘ Command + V ."
    },
    {
      "title": "Open Corrupt-a-File.",
      "content": "Open Corrupt-a-File. Go to https://corrupt-a-file.net/ in your computer's web browser. This website can corrupt most common file types such as MP3s, Word documents, Excel sheets, and more."
    },
    {
      "title": "Click FROM YOUR COMPUTER.",
      "content": "Click FROM YOUR COMPUTER . It's a yellow button near the middle of the page. Doing so prompts a File Explorer (Windows) or Finder (Mac) window to appear."
    },
    {
      "title": "Select your file.",
      "content": "Select your file. Go to the location of the file that you want to corrupt, then click the file once to select it."
    },
    {
      "title": "Click Open.",
      "content": "Click Open . It's in the bottom-right corner of the window. This will upload your file to the Corrupt-a-File website."
    },
    {
      "title": "Scroll down and click CORRUPT FILE.",
      "content": "Scroll down and click CORRUPT FILE . This button is near the bottom of the page. Corrupt-a-File will begin corrupting your file. This can take anywhere from a few seconds to a few minutes depending on your file's size."
    },
    {
      "title": "Click DOWNLOAD YOUR CORRUPTED FILE when prompted.",
      "content": "Click DOWNLOAD YOUR CORRUPTED FILE when prompted. This will download the corrupted file onto your computer. Depending on your browser's settings, you may have to click Save or select a save location to confirm the download."
    }
  ]
}