{
  "url": "https://www.wikihow.com/Fix-Engine-Oil-Blow%E2%80%90By",
  "title": "How to Fix Engine Oil Blow‐By",
  "steps": [
    {
      "title": "Find a high-quality vehicle-specific catch can kit.",
      "content": "Find a high-quality vehicle-specific catch can kit. While there are universal catch cans on the market, installing them requires some custom fabrication that may be beyond the scope of a hobby mechanic. Instead, provide the year, make, model and engine trim of your vehicle to the clerk at your local auto parts store to get a kit designed specifically for your application. [1] X Research source Lower quality catch can kits won’t have any filtration within the catch can, and therefore will do little to prevent oil blow-by. Look for catch can kits that say they have a “filter” or “baffling” system to get a high-quality one."
    },
    {
      "title": "Disconnect the negative terminal on the battery.",
      "content": "Disconnect the negative terminal on the battery. Locate the battery in either the engine bay or the trunk. It will look like a rectangular box with a positive (+) and a negative (-) post sticking out of the top of it. Use the appropriate sized wrench to loosen the cable on the negative (-) terminal and then slide it off. [2] X Research source This step is not only important for safety (to ensure the vehicle can’t be started while you work) but it also helps prevent blown fuses and shocks while you work. If you can’t locate your battery, refer to the vehicle owner’s manual or manufacturer’s website to guide to you."
    },
    {
      "title": "Install the bracket based on the kit’s instructions.",
      "content": "Install the bracket based on the kit’s instructions. The bracket’s location will vary widely depending on the vehicle, engine, and catch can manufacturer. Some are designed to be mounted on the side of the strut or shock towers while others may secure to the mounting bolts for an accessory like the alternator or power steering pump. Read the instructions provided with the catch can carefully to find exactly where your catch can bracket is supposed to be mounted. [3] X Research source You will likely need to use the right sized wrench to remove one or two bolts or nuts from your vehicle. Slide the bracket into place per the instructions that came with it, then re-secure the bolts or nuts you removed to secure the bracket in place as well."
    },
    {
      "title": "Disconnect the pipe running from the intake to the PCV valve.",
      "content": "Disconnect the pipe running from the intake to the PCV valve. Air pressure, along with fuel and oil, is transferred back into the vehicle’s intake via the pipe that runs from the PCV valve to either the intake manifold itself or the intake pipe that leads into it. The easiest way to locate this pipe is to look for plastic pipes or rubber hoses running into the intake pipe or intake manifold that are about .5 inches (1.3 cm) in diameter. Once you find it, disconnect it from both ends by releasing the hose clamps that hold it in place. [4] X Research source Refer to a vehicle specific repair manual to help you find the pipe if you aren’t able to locate it. Most hose clamps are released by unscrewing them with a screwdriver or squeezing them with pliers, however, some vehicles just use tension to hold the line in place, allowing you to easily remove it by hand."
    },
    {
      "title": "Run one of the new lines from the PCV valve to the catch can.",
      "content": "Run one of the new lines from the PCV valve to the catch can. The catch can kit should come with two new rubber hoses or lines. The first one should be secured to the PCV valve where you disconnected the last pipe. Run that hose from the PCV valve to the inlet on the oil catch can. Most good quality catch cans will specify which port is meant as an “in” and which is meant as an “out.” [5] X Research source Use the supplied hose clamps to secure the hose at both the PCV valve and on the catch can itself. Be careful not to over-tighten hose clamps that you can tighten with a socket or screwdriver. Many PCV valves outlets are made of plastic and may crack if you put them under too much pressure."
    },
    {
      "title": "Run the other pipe from the catch can to the intake inlet.",
      "content": "Run the other pipe from the catch can to the intake inlet. Connect the second hose to the catch can kit’s “out” port. Then run it to the inlet on the intake pipe or manifold that you previously disconnected the original pipe from. [6] X Research source Use the supplied hose clamps to secure the hose on each end. Both ports you removed the original pipe from should not be sealed with new hoses going to and from the catch can."
    },
    {
      "title": "Secure the catch can in the bracket.",
      "content": "Secure the catch can in the bracket. With the hoses run correctly, slide the catch can into its bracket and tighten the hardware it came with onto the can. In many cases, this will mean inserting a bolt through the bracket and into the catch can, then tightening it until it is snug. [7] X Research source Some kits are difficult to mount than others, so be sure to follow the instructions provided closely."
    },
    {
      "title": "Empty the catch can with each oil change.",
      "content": "Empty the catch can with each oil change. As oil and fuel vapor pass through a good quality catch can, it will start to collect thanks to the filter or baffle system. This means you’ll need to drain the catch can regularly to prevent it from overflowing back into the system. How often your catch can needs to be emptied will vary based on its size, your vehicle, and how you drive, but doing so every 3,000 miles or so is usually sufficient. [8] X Research source Remove the bolts or straps holding the catch can in place, then open the cap on the can and pour it into a container suitable for storing waste oil. Re-secure the catch can in place before starting the engine again."
    },
    {
      "title": "Pull the PCV valve out to test it.",
      "content": "Pull the PCV valve out to test it. A bad PCV valve can stick open and allow greater oil blow-by than the engine is designed for. Locate it in your specific vehicle by referring to its service or repair manual. Remove the hose going into the PCV valve, then grip the PCV valve with a pair of pliers and twist it as you pull it backwards out of the engine. [9] X Research source The PCV valve will come out in one piece that looks sort of like a cylinder that’s fatter in the middle that on its two ends. Be careful not to crush the PCV valve inlet with your pliers as you pull it out."
    },
    {
      "title": "Connect the PCV valve to its hose and start the engine.",
      "content": "Connect the PCV valve to its hose and start the engine. Insert the nozzle of the PCV valve back into the hose you removed it from, but don’t put the valve itself back in the engine. With it open to air, start the motor and take note of the RPMs the engine is running at. [10] X Research source The PCV valve should be sticking out of the pipe and not connected to anything. Give the engine a minute or two to settle before noting the RPMs as many engines will idle high at first."
    },
    {
      "title": "Block the PCV valve with your finger and see if the RPMs drop.",
      "content": "Block the PCV valve with your finger and see if the RPMs drop. With the engine running, place your thumb over the PCV valve that’s hanging out of the pipe. If the RPMs of the engine drop suddenly as you block the valve, it means it’s been stuck open and needs to be replaced. [11] X Research source If the PCV valve has been stuck open, it will have allowed a lot of oil to blow-by into your intake."
    },
    {
      "title": "Replace the PCV valve if the test reveals a problem.",
      "content": "Replace the PCV valve if the test reveals a problem. Simply pull the PCV valve back off of the hose it was on for testing. Get a replacement one from your local auto parts store and insert it back into the engine, then connect the hose to it just as it had been with the old valve. [12] X Research source If the old PCV valve was stuck open, replacing it will resolve the oil blow-by issue. Tighten the hose clamps on the hose and PCV valve if they were present before."
    },
    {
      "title": "Use the dipstick to see if there’s too much oil in the engine.",
      "content": "Use the dipstick to see if there’s too much oil in the engine. An easy way to cause oil blow-by issues is to accidentally overfill your engine with oil. Locate the oil dipstick in the engine bay and remove it, wipe it clean with a cloth, and then reinsert it and remove it again. Now look at the level the oil reaches. There will be two small notches on the stick: a lower one for the engine’s “low limit” and a higher one for its maximum capacity. If the oil reaches higher than that high mark, it has been overfilled. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The oil should reach somewhere between the low mark and high mark on the dipstick. If the oil does not reach the low mark or looks especially dirty, your vehicle needs an oil change."
    },
    {
      "title": "Drain the oil and refill the engine correctly if overfilled.",
      "content": "Drain the oil and refill the engine correctly if overfilled. Slide a container beneath the vehicle's oil pan. Remove the oil drain plug from the bottom of the oil pan (it will be the only bolt on the pan) and allow the oil to drain into the container. Reinsert the drain plug, then fill the engine with exactly the right amount of oil. [14] X Research source Your owner’s manual will also indicate exactly how much oil you need, as well as what type and weight of oil you should be using. If your engine was overfilled, this should resolve the oil blow-by problem."
    },
    {
      "title": "Remove your oil pan to install a larger one if blow-by continues.",
      "content": "Remove your oil pan to install a larger one if blow-by continues. A larger oil pan will keep more of the oil away from the rotating crankshaft, reducing the total pressure of the vapor being transferred into the intake. First drain all the oil by removing the oil drain plug and letting it pour into a container. Then remove all of the bolts holding the oil pan in place and drop the pan from the vehicle. [15] X Research source Set the bolts aside somewhere safe for use with the new oil pan. Do not reuse the oil you drain from the engine."
    },
    {
      "title": "Remove any old gasket material clinging to the engine with a razer blade.",
      "content": "Remove any old gasket material clinging to the engine with a razer blade. If old gasket material is left on the engine block, it could prevent the new pan from sealing properly. Place the edge of a razor blade against the bottom of the engine where the oil pan meets it and scrape off old gasket material by pushing the blade into the material repeatedly at a 45-degree angle. [16] X Research source All of the gasket material must be removed before you can go to the next step. Keep scraping until the entire area where the pan meets the engine is bare metal."
    },
    {
      "title": "Install the new oil pan.",
      "content": "Install the new oil pan. Place a new gasket on the new oil pan, and then bolt it into place using the bolts you previously removed. It should bolt directly into place using the same number and location of bolts. [17] X Research source Be sure to only use an aftermarket oil pan designed specifically for your vehicle by providing the exact year, make, and model to the clerk at the auto parts store. A bigger oil pan will mean an increased oil capacity, so be sure to note how many quarts of oil the engine now needs by reading the instructions that come with the new oil pan."
    }
  ]
}