{
  "url": "https://www.wikihow.com/Get-Glitter-Eye-Shadow-to-Stick",
  "title": "How to Get Glitter Eye Shadow to Stick",
  "steps": [
    {
      "title": "Purchase an eyeshadow primer at your local department store.",
      "content": "Purchase an eyeshadow primer at your local department store. Look specifically for glitter primer. You can use a regular pigment primer, but glitter primer works the best because it is specially formulated for getting glitter to stick and stay. [1] X Research source There are a wide range of products that are priced to fit any budget. Glitter primers typically range from about $7.00 - $20.00, and can be purchased at the cosmetic counter at your local department store or at a drugstore. If you don't have eyelid primer, you can use another type of base, like an eye cream, concealer, or cream eyeshadow. [2] X Expert Source Frankie Sanderson Makeup Artist & Stylist Expert Interview. April 14, 2020."
    },
    {
      "title": "Brush some primer onto your eyelid after applying your regular makeup.",
      "content": "Brush some primer onto your eyelid after applying your regular makeup. The primer can be put on top of existing pigment, so don’t worry about messing up your eyeshadow color. After you have applied your eyeshadow , use a flat shader brush to gently smooth the glitter primer onto your eyelid. [3] X Research source The glitter will adhere everywhere the primer is applied, so make sure you only put the primer where you want the glitter to be. If the primer is for use with regular eyeshadow, then put it on before you apply your other eye makeup."
    },
    {
      "title": "Sprinkle some glitter onto the lid of its container or another flat surface.",
      "content": "Sprinkle some glitter onto the lid of its container or another flat surface. Sprinkle just enough glitter for what you need. It’s better to start off with less and sprinkle more out if you need to. This helps you avoid wasting glitter or having to deal with trying to dump it back into the container. [4] X Research source Sprinkling the glitter onto another surface allows you to mix glitter colors together to create custom shades, and also gives you better control so you don’t get too much glitter on your brush."
    },
    {
      "title": "Dab some glitter onto a flat shader brush and apply it to your eyelid.",
      "content": "Dab some glitter onto a flat shader brush and apply it to your eyelid. Softly pat the glitter onto your eyelid. Pressing too hard or brushing it across your eyelid can smear the rest of your makeup and make the glitter too thin. [5] X Research source Dab on extra layers until you reach the desired look."
    },
    {
      "title": "Remove glitter fallout by gently pressing tape on the glitter specs.",
      "content": "Remove glitter fallout by gently pressing tape on the glitter specs. Take a small strip of transparent tape and gently press it against your face where the excess glitter has fallen. If you make sure to press lightly, the tape will remove the specs of glitter without ruining your makeup. [6] X Research source You can use other types of tape or sticky items like labels to remove the glitter fallout, but be careful not to use anything too tacky (like duct tape) because it can ruin your makeup and even damage your skin. If you only have super sticky tape, press the strip of tape against your hand a few times to remove some of the tackiness before using it on your face. [7] X Research source If you don’t have any tape, then just apply a heavy layer of loose powder to your undereye area before you apply your eye makeup, and then use a fluffy brush to sweep away any glitter that falls onto this area."
    },
    {
      "title": "Use lip balm or petroleum jelly if you are applying glitter only.",
      "content": "Use lip balm or petroleum jelly if you are applying glitter only. Lip balm and petroleum jelly are just sticky enough for the glitter to adhere. Use a cotton swab to spread a thin layer of the product where you want the glitter to be on your eyelid. [8] X Research source Do not apply these products on top of eyeshadow because it will smear. Use them when you are applying glitter only. Make sure that you check the ingredients of any lip balm you decide to use on your eye area. Some of them contain salicylic acid, which is an eye irritant. Don’t apply this type of lip balm to your eyelids."
    },
    {
      "title": "Use eyelash glue if you want to wear glitter on top of your eyeshadow.",
      "content": "Use eyelash glue if you want to wear glitter on top of your eyeshadow. After you have applied your eyeshadow, use a small brush or cotton swab to gently spread a thin layer of eyelash glue over your eyelids. Only apply the glue where you want the glitter to stick. [9] X Research source Wait about 30 seconds to allow the glue to become tacky before dabbing on the glitter. If the glue is too wet, it can get messy; once the glue dries a little, it is much easier to work with. [10] X Research source"
    },
    {
      "title": "Try eyeshadow cream if you want to color coordinate and adhere glitter.",
      "content": "Try eyeshadow cream if you want to color coordinate and adhere glitter. Choose an eyeshadow cream that matches the color of glitter you are using. Gold glitter on gold cream, and silver glitter on grey cream, are popular choices. Apply the eyeshadow cream as usual, then use a flat shader brush to dab the glitter on top. [11] X Research source Because eyeshadow cream isn’t super sticky, start with a thin layer of glitter and add more layers until you get the desired look. [12] X Research source For a more blended look, dab a small amount of eye cream onto a cotton swab, then dip the cotton swab in the glitter and apply it to your eyelid. [13] X Research source"
    }
  ]
}