{
  "url": "https://www.wikihow.com/Dumbbell-Press",
  "title": "How to Dumbbell Press",
  "steps": [
    {
      "title": "Lie on a flat bench.",
      "content": "Lie on a flat bench. Lie on your back on a flat weight bench with your legs at either side. Your knees should be at right angles with your feet flat on the floor. Adjust your lower back so that your spine is neutral, your shoulder blades pressed down on either side of your spine. Hold the dumbbells on your thighs to start. If this is your first time doing this exercise, use fairly light weights to start. As you move to heavier weights, get a friend to spot you. Instead of resting the weights on your thighs to start, have your friend hand you the weights once you get into position."
    },
    {
      "title": "Raise the dumbbells to your sides.",
      "content": "Raise the dumbbells to your sides. Lift the dumbbells one at a time and hold them in front of your body at shoulder-width, just to the sides of your chest. Your elbows should be at right angles with your forearms perpendicular to your body. This is the starting position for the exercise. [1] X Research source Maintain control of the weight. If the dumbbell is shaky or wobbly and you have difficulty controlling it, go with a lighter weight."
    },
    {
      "title": "Press the dumbbells up as you exhale.",
      "content": "Press the dumbbells up as you exhale. Extend your arms and press the dumbbells straight up, using your chest muscles. When your arms are fully extended, straighten your elbows and squeeze your chest muscles so that the ends of the dumbbells are touching each other. [2] X Research source Squeeze and hold at the top of the press for a second before lowering the weights back down."
    },
    {
      "title": "Lower the dumbbells slowly on an inhale.",
      "content": "Lower the dumbbells slowly on an inhale. Lower the weights back to the starting position, so that your elbows are at a 90-degree angle. Move slowly, taking about twice as long to lower the weights as you did to press them. With proper form, you should feel your chest muscles doing most of the work. If you feel strain in your shoulders, stop and check your form. Make sure your shoulder blades are tucked in along the length of your spine and your shoulders are flat, not crunched. Be particularly careful not to lower the weights too far. This can cause shoulder injuries, including torn tendons and ligaments."
    },
    {
      "title": "Repeat as necessary for your training goals.",
      "content": "Repeat as necessary for your training goals. The number of dumbbell presses you do will depend on whether you're training for muscle growth, strength, or endurance. Generally, do higher reps with lighter weights for endurance. Do lower reps with heavier weights for strength. [3] X Research source For example, if you're training for increased muscle strength, you might do 1 to 5 reps of the largest weight you can press for that number of reps. If you're training for overall toning and fitness, use a lighter weight and do 10-15 reps."
    },
    {
      "title": "Start in a standing position.",
      "content": "Start in a standing position. For the standing dumbbell press, start with your back neutral and your feet about shoulder-width apart. You can lock your knees, or keep them slightly bent. Activate your glutes and core. [4] X Research source Check that your back is neutral and that you aren't hunching over or leaning back. Open your shoulders so that your shoulder blades are tucked in, falling on either side of your spine."
    },
    {
      "title": "Hold the dumbbells at your shoulders.",
      "content": "Hold the dumbbells at your shoulders. Use an overhand grip, so that your knuckles are facing up and your palms are towards your body. Your elbows should be pressed along your sides so that the dumbbells are directly in front of your shoulders. [5] X Research source From the starting position, take a deep breath. Draw your awareness to your body, making sure your back is straight and you're not leaning back or hunching over."
    },
    {
      "title": "Raise the dumbbells overhead on an exhale.",
      "content": "Raise the dumbbells overhead on an exhale. Allow your movement to follow your breath, keeping your lift slow and controlled. Avoid jerking the weight upward, which can strain your elbows. Rotate your arms as you lift, so that at the top of the lift your palms will be facing forward, away from you. [6] X Research source Gently straighten your elbows at the top of the lift. Pause and press upward. Make sure you have control over the weight. Go with a lighter weight if your wrists are wobbly."
    },
    {
      "title": "Lower the dumbbells as you inhale.",
      "content": "Lower the dumbbells as you inhale. Return the dumbbells to your starting position in a slow, controlled movement. Keep your arms close to your body. Avoid flaring out your elbows, which can put too much strain on your wrists. [7] X Research source Rotate your arms as you lower the dumbbells, so that you return to your starting position with your palms facing your body."
    },
    {
      "title": "Complete your desired number of repetitions.",
      "content": "Complete your desired number of repetitions. Do more reps with lighter weights if you're training for muscle endurance, and fewer reps with heavier weights if you're training for muscle growth and strength. [8] X Research source Make sure you're not using a heavier weight than you can control. If your arms or wrists are shaking, or if the weight is wobbly, decrease the weight. If you're using heavier dumbbells, always have a spotter when lifting overhead. You don't want to risk dropping the weight on your head or shoulder."
    },
    {
      "title": "Do the overhead press while seated for extra support.",
      "content": "Do the overhead press while seated for extra support. Sit on the end of a weight bench with your feet on either side of the bench. Your feet should be flat on the floor with your knees at right angles. Do the overhead press as usual. [9] X Research source This variation is a good option if you have a recent back injury or chronic back problems. It can also help you perfect your form if you are just getting started with weight training."
    },
    {
      "title": "Maximize pectoral growth with the squeeze press.",
      "content": "Maximize pectoral growth with the squeeze press. Lie on your back and extend your arms as you would doing a dumbbell bench press, holding the dumbbells together with your palms facing each other. Instead of lowering the weights, keep the weights together and press them together as hard as you can, squeezing your chest muscles. [10] X Research source This exercise may look strange, but it activates your chest, forcing your pectoral muscles to do all the work. If you're interested in growing or strengthening your pecs, add this variation to your routine. For this exercise to work, squeeze the dumbbells together as hard as you can. It's best to use hexagon-shaped dumbbells, which will be easier on your wrists."
    },
    {
      "title": "Alternate arms for better control.",
      "content": "Alternate arms for better control. Alternating arms allows you to build strength and flexibility in your shoulders. As you lift one weight, keep the other at starting position. When you bring the weight down on one side, lift the other up. [11] X Research source If you're alternating arms, resist the urge to use heavier weights. You run the risk of straining your muscles."
    },
    {
      "title": "Raise the bench 45 degrees to target your upper chest muscles.",
      "content": "Raise the bench 45 degrees to target your upper chest muscles. Complete the same motion as you would for a regular dumbbell bench press, but raise the bench instead of leaving it flat. The angle forces your upper chest muscles to adapt and work harder. [12] X Research source You can also lower the bench to a 45-degree decline to target your lower chest muscles just as you targeted your upper chest muscles with the incline dumbbell bench press. If you've been doing dumbbell bench presses and want to add this variation, start with a lighter weight than you normally use for a flat dumbbell bench press. You're using different muscles in different ways, so you need to build them up first."
    }
  ]
}