{
  "url": "https://www.wikihow.com/Dua-for-Protection",
  "title": "16 Powerful Duas for Protection, Safety, & Well-Being",
  "steps": [
    {
      "title": "",
      "content": "(أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق (ثلاث مرات إِذا أمسى [1] X Research source “A`ūdhu bikalimāti-llāhit-tāmmāti min sharri mā khalaq.” “I seek refuge in the Perfect Words of Allah from the evil of what He has created. (Recite three times in Arabic in the evening.)”"
    },
    {
      "title": "",
      "content": "أَعُوذُ بِكلِمَاتِ الله التّامّاتِ مِن شَرّ مَا خَلَقَ [2] X Research source “A'udhu bi kalimaa ti-llaahi taam-maati min sharri ma khalaq.” \"I seek protection in the perfect words of Allah from every evil that has been created.\""
    },
    {
      "title": "",
      "content": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ “Bismillahil-lazi la yadhurru ma’asmiHi syai’un fil ardhi wa la fis-sama’i wa Huwas-Sami’ul 'Aleem.” “In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in heaven, and He is All-Hearing and All-Knowing.” (Sunan Abi Dawud)"
    },
    {
      "title": "",
      "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الأَسْقَامِ [3] X Research source “Allah humma inni a'udhu bika minal-barasi, wal-jununi, wal-judhaami, wa min sayyi'il-asqaami.” \"O Allah, I seek refuge in You from leprosy, insanity, elephantiasis, and the worst of diseases.\" (Abu Dawud)"
    },
    {
      "title": "",
      "content": "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ ١ مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٣ وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلْعُقَدِ ٤ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ٥ [4] X Research source “Bismillah hir rahman nir raheem qul a’oozu bi rabbil-falaq min sharri maa khalaq wa min sharri ghaasiqin izaa waqab wa min sharrin-naffaa-saati fil ‘uqad wa min sharri haasidin izaa hasad.” [5] X Research source “Say, O Prophet, ‘I seek refuge in the Lord of the daybreak from the evil of whatever He has created, and from the evil of the night when it grows dark, and from the evil of those witches casting spells by blowing onto knots, and from the evil of an envier when they envy.’” (Sūrah al-Falaq)"
    },
    {
      "title": "",
      "content": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ [6] X Research source “Rabbi a’oozu bika min hamazaatish Shayaateen Wa a’oozu bika Rabbi ai-yahduroon.” “My Lord, I seek refuge in You from the incitements of the devils, And I seek refuge in You, my Lord, lest they be present with me.” (Surah Muminun 97-98)"
    },
    {
      "title": "",
      "content": "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ ١ مَلِكِ ٱلنَّاسِ ٢ إِلَـٰهِ ٱلنَّاسِ ٣ مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ ٤ ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ ٥ مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ ٦ “Bismillah hir rahman nir raheem qul a’oozu birabbin naas malikin naas ilaahin naas min sharril waswaasil khannaas allazee yuwaswisu fee sudoorin naas minal jinnati wannaas.” [7] X Research source “Say, O Prophet, ‘I seek refuge in the Lord of humankind, the Master of humankind, the God of humankind, from the evil of the lurking whisperer—who whispers into the hearts of humankind—from among jinn and humankind.’” (Surah An-Nas) [8] X Research source"
    },
    {
      "title": "",
      "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَاىَ وَأَهْلِي وَمَالِي اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَىَّ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي [9] X Research source “Allāhumma innī asʾaluka al-ʿāfiyah fī al-dunyá wa-al-ākhirah allāhumma innī asʾaluka al-ʿafwah wa-al-ʿāfiyah fī dīnī wa-dunyāya wa-ahlī wa-mālī. Allāhumma ustur ʿawrātī wa-āmin rawʿātī allāhumma iḥfaẓnī min bayni yadayya wa-min khalfī wa-ʿan yamīnī wa-ʿan shimālī wa-min fawqī wa-aʿūdhu bi-ʿaẓamatika an ughtāla min taḥtī.” O Allah, I ask You for well-being in this world and the Hereafter. O Allah, I ask You for pardon and well-being in my religion, my worldly affairs, my family and my property. O Allah, conceal my faults and keep me safe from what I fear. O Allah, guard me from in front of me and behind me, on my right and on my left, and from above me. And I seek refuge in Your Magnificence from being swallowed up from beneath me.” (Abū Dāwud and Ibn Mājah)"
    },
    {
      "title": "",
      "content": "حَدَّثَنَا صَدَقَةُ، قَالَ‏:‏ أَخْبَرَنَا سُلَيْمَانُ هُوَ ابْنُ حَيَّانَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ قَالَ‏:‏ كَانَ مِنْ دُعَاءِ النَّبِيِّ صلى الله عليه وسلم‏:‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ الْمُقَامِ، فَإِنَّ جَارَ الدُّنْيَا يَتَحَوَّلُ‏.‏ [10] X Research source “Abu Hurayra said, “One of the supplications of the prophet was, ‘Allahumma Inni ‘Auzubika Min Jaaris-sooyi fi Daaril Maqamah.’” [11] X Research source “Abu Hurayra said, ‘Part of the supplication of the Prophet, may Allah bless him and grant him peace, was, ‘Oh Allah, I seek refuge with you from an evil neighbor in the Eternal World. A neighbor in this world can be changed.’” (Adabul Mufrad: 117)"
    },
    {
      "title": "",
      "content": "اللَّهُمَّ مُنْزِلَ الْكِتَاب سَرِيعَ الْحِسَاب اهْزِم الأَحْزَاب اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُم [12] X Research source “Allāhumma munzila ‘l-kitāb. sarī`a ‘l-ḥisāb. ihzimi ‘l-aḥzāb. Allāhumma-hzimhum wa zalzilhum.” O Allah, Revealer of the Book, Swift to account, defeat the groups (of disbelievers). O Allah, defeat them and shake them.” (Hisnul Muslim)"
    },
    {
      "title": "",
      "content": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ [13] X Research source “Bismillah, tawakkaltu ‘alallah, wa la hawla wa la quwwata illa billah.” [14] X Research source ““I begin with the Name of Allah; I trust in Allah; there is no altering of conditions but by the Power of Allah.”"
    },
    {
      "title": "",
      "content": "بِسْمِ اللّٰهِ، تَوَكَّلْتُ عَلَى اللّٰهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ [15] X Research source “Bismillaahi, tawakkaltu 'alallaahi, wa laa hawla wa laa quwwata illaa billaah.” “In the Name of Allah, I have placed my trust in Allah; there is no might and no power except by Allah. it will be said to him: ‘You are guided, defended and protected.’ The devil will go far away from him.” (Abu Dawud)"
    },
    {
      "title": "",
      "content": "اللّهُـمَّ إِنّـي أَعـوذُبِكَ أَنْ أُشْـرِكَ بِكَ وَأَنا أَعْـلَمْ، وَأَسْتَـغْفِرُكَ لِما لا أَعْـلَم [16] X Research source “Allāhumma innī a`ūdhu bika an ushrika bika wa anā a`lam, wa astaghfiruka limā lā a`lam.” “O Allah, I seek refuge in You lest I associate anything with You knowingly, and I seek Your forgiveness for what I know not.”"
    },
    {
      "title": "",
      "content": "اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ, وَمِنْ خَلْفِي, وَعَنْ يَمِينِي, وَعَنْ شِمَالِي وَمِنْ فَوْقِي, وَأَعُوذُ بِعَظَمَتِكَ أَن أُْغْتَالَ مِنْ تَحْتِي [17] X Research source “Allah humma‘h fathny min bayne yaday wa min khalfi, wa‘an yameeny wa ‘an shimaly, wa min fawqi, wa a’uthu bi ‘athamatika an ughtala min tahty.” “O Allah protect me from my front, behind me, from my right and my left, and from above me, and I seek refuge in Your Magnificence from being taken unaware from beneath me.” (Ibn Majah)"
    },
    {
      "title": "",
      "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْبُخْلِ وَالْجُبْنِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ [18] X Research source “Allāhumma innī aʿūdhu bika min al-hammi wa-al-ḥazani wa-al-ʿajzi wa-al-kasali wa-al-bukhli wa-al-jubni wa-ḍalaʿi al-dayni wa-ghalabati al-rijāl.” “O Allah, I seek refuge in You from anxiety and grief; from inability and laziness; from stinginess and cowardice; and from the burden of debt and oppression of men.” (Bukhārī)"
    },
    {
      "title": "",
      "content": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [19] X Research source “Aʿūdhu bi-kalimāti Allāhi al-tāmmāti min sharri mā khalaq.” “I seek refuge in the Perfect Words of Allah from the evil of what He has created.”"
    }
  ]
}