{
  "url": "https://www.wikihow.com/Get-Freckles",
  "title": "How to Give Yourself Totally Cute Freckles Safely",
  "steps": [
    {
      "title": "Determine if you might have the right genes.",
      "content": "Determine if you might have the right genes. If there are no freckles in your genetic line, you won’t be able to develop natural freckles. The people most likely to develop freckles are those with pale skin, light-colored eyes, and light hair, especially children. Dark-haired folks are less likely to have freckles, though it's possible for anybody to have them. [1] X Research source To determine if freckles are in your family line, look at your family. Siblings, parents, grandparents, and others who you are directly descended from are your best sources to consider, but extended family whom you are not directly descended from still share some genetic traits with you."
    },
    {
      "title": "Learn what causes freckles.",
      "content": "Learn what causes freckles. Freckles are a hereditary trait caused by an uneven distribution of skin pigmentation. A freckle occurs when there is a large concentration of the melanin pigment underneath one spot on your skin. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Most natural freckles are small and essentially harmless. They tend to show up on areas exposed to sunlight, like your face, and these are probably the type you're longing for. They also range in color and may be tan, brown, black, yellow, or red. Sometimes freckles form as the result of sunburn. These are larger and often have irregular borders. While regular freckles usually fade after sunlight exposure decreases, sunburn freckles stay put."
    },
    {
      "title": "Spend a little time in the sun.",
      "content": "Spend a little time in the sun. Freckles are drawn out with exposure to UV light. If you have natural freckles, spending a little time in bright sunlight might bring them out of hiding. Be careful, though: never stay out long enough to get a burn. Wearing sunscreen that's 20 to 30 SPF will still allow your skin to tan while protecting you from getting burned. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When UV rays hit the epidermis (the outermost layer of skin), it thickens slightly, causing the cells in your body to produce more pigment. As a result, the pigmentation of your freckles darkens, making them visible. If you would rather skip the sunbathing, consider exposing yourself to UV rays at a tanning salon . Follow the salon's recommendations concerning the amount of time to spend tanning, since tanning too much in a salon can lead to cancer."
    },
    {
      "title": "Limit your exposure to UV rays.",
      "content": "Limit your exposure to UV rays. Tanning can bring out your freckles, but too much exposure to UV rays can be a major risk factor for skin cancer. Even though UV rays can seem like your best friend if you want freckles to form, they can have some very nasty side effects. As such, it is strongly recommended that you limit the amount of time you spend in the sun without sunblock or protective clothing. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid midday sun exposure. Between about 1 and 4 p.m. is when the sunlight is most intense."
    },
    {
      "title": "Choose 2 brown eyeliner pencils of different hues.",
      "content": "Choose 2 brown eyeliner pencils of different hues. Start with a brown shade that complements your skin tone . For instance, if you are cool-skinned and have undertones of yellow, a tan would work better. If you are warm toned and have undertones of red, a richer hue of brown with burgundy undertones might be a better choice. You’ll need a light ash tone and another tone that is one shade or so darker. [5] X Research source An ash brown is a safe bet for most skin tones. If you are not sure which eyeliner to choose to look natural, compare the shades to the color of your eyebrows. Make sure the light shade is about 2 shades darker and the darker shade is another shade darker than that."
    },
    {
      "title": "Draw small freckles",
      "content": "Draw small freckles on your skin with the lighter color. Use the pencil to sprinkle small, uneven dots across the bridge of your nose and tops of your cheeks. Stop before you go overboard, since the freckles won't look as natural if you have too many. [6] X Research source Draw different-sized dots, and scatter them unevenly. This will make them seem more natural."
    },
    {
      "title": "Add a second layer of dots using the darker eyeliner.",
      "content": "Add a second layer of dots using the darker eyeliner. Use the darker shade to draw a few more freckles here and there. People with natural freckles usually have them in more than one tone, since freckles darken with age. [7] X Research source Look in the mirror to make sure that none of the dots overlap. Give yourself about half the amount of freckles you drew with the lighter color."
    },
    {
      "title": "Blend the freckles into your skin slightly with a cotton ball.",
      "content": "Blend the freckles into your skin slightly with a cotton ball. If you need to soften the freckles a bit in order to maintain a natural look, carefully and gently pat the area with your fingertips or a small piece of cotton. You could also use a clean eyeshadow blending brush to lightly buff over each spot."
    },
    {
      "title": "Apply a setting spray or powder.",
      "content": "Apply a setting spray or powder. This is completely optional, but a quick sweep of either option will help hold your makeup in place for more time. A setting spray or powder will also make your skin appear glossier and healthier. [8] X Research source"
    },
    {
      "title": "Apply bronzer",
      "content": "Apply bronzer to your nose and cheeks. Use a large makeup brush to sweep a little bronzer along the bridge of your nose and across the top of your cheeks, along the cheekbone. Avoid sweeping bronzer across your entire face. Doing so can make your overall skin tone look unnaturally dark. Bronzer provides your skin with a slightly darker base for applying the fake freckles. Since real freckles are brought about by sun exposure, it makes sense to have slightly tanned skin beneath those freckles. Use a matte bronzer instead of a shimmery one for a more natural appearance."
    },
    {
      "title": "Use an eyebrow pencil to draw a few small, scattered freckles.",
      "content": "Use an eyebrow pencil to draw a few small, scattered freckles. As a general rule, go for an eyebrow pencil that is 2 shades lighter than one you might use for your actual eyebrows. Make sure that the pencil point is sharp before you start. Use the pencil to create small, light dots across the bridge of your nose and the tops of your cheeks, where you applied the bronzer. Avoid liquid or gel liner: since pencils are a bit drier, the freckles they make won't change color as they dry. Keep the freckles tight around the tops of the nose and directly under your eyes. Spread them out a little more as they go further down. Make the freckles small, but not completely equal in size. Make sure they vary slightly, with some being a little bigger than others, and that they aren’t obviously patterned or symmetrical. Go over any freckles you already have with the pencil to accentuate your natural features."
    },
    {
      "title": "Assess your face in the mirror, and add more freckles as needed.",
      "content": "Assess your face in the mirror, and add more freckles as needed. Pause to assess the way your freckles look in the mirror. Take the opportunity to add more dots, where necessary, to fill in any unnatural gaps. If needed, pat the freckles with your fingertips or a small piece of cotton to soften them slightly."
    },
    {
      "title": "Apply a light sweep of foundation",
      "content": "Apply a light sweep of foundation , if desired. For dramatic freckles, do not use foundation. If the pencil you used was too dark, however, or you want to make your freckles look more subtle, lightly brush a powder foundation on top. Do not use a liquid foundation since it will cause your faux freckles to smear and rub away."
    },
    {
      "title": "Learn about how cosmetic tattooing works.",
      "content": "Learn about how cosmetic tattooing works. Cosmetic tattooing is done with an electric needle that rapidly deposits ink pigments into the dermis layer of skin. Cosmetic tattooing is also known as permanent makeup. These procedures are often used to create the appearance of fuller eyebrows, permanent eyeliner, or permanent lipstick, but using it to create freckles has become more popular in recent years. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source A hollow, vibrating needle will pierce through the top layer of skin and release a droplet of pigment. While cosmetic tattooing is possible to remove, it is very difficult to do so, and your skin may never look the same again."
    },
    {
      "title": "Consult a professional cosmetic tattoo artist.",
      "content": "Consult a professional cosmetic tattoo artist. To reduce the risk of negative side effects, like infection, make sure that the professional you hire knows what they're really doing. [10] X Research source Speak to the tattoo artist yourself to ensure they implement best practices, and read reviews online to learn about previous clients’ experiences. Check each tattoo artist's credentials. Make sure that they are a properly trained and licensed aesthetician. If possible, go to a tattoo artist recommended by your current doctor or a trusted friend."
    },
    {
      "title": "Tell artist exactly what you want your tattoo to look like.",
      "content": "Tell artist exactly what you want your tattoo to look like. The tattoo artist may have valuable suggestions, but in order to get the look you really want, you need to have an active voice in the matter. If possible, supply a few photographs to determine which freckled look is right for you: it’s important to be on the same page with your tattoo artist prior to beginning the tattooing process. [11] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source The tattoo artist will help you determine the best hue and shade of color for your freckles. Be sure to also discuss the placement of your freckles."
    },
    {
      "title": "Schedule an appointment and get your tattoo.",
      "content": "Schedule an appointment and get your tattoo. Once you find a professional who’s a good fit, make an appointment and get your freckles tattooed on. Before the procedure, the technician will sketch out the area that will be tattooed using a sterile surgical pen. Anesthetic gel will then be placed on the area to numb it. During the procedure, you can expect to feel a little stinging sensation. The whole process may take from 30 minutes to an hour, from prep to the end of the procedure. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure that the aesthetician uses sterile gloves and sterilized equipment during the procedure."
    },
    {
      "title": "Take care of your tattoo afterward.",
      "content": "Take care of your tattoo afterward. You may experience swelling at the tattoo site in the days after the procedure. Reduce swelling with a cold compress and apply an antibiotic ointment to minimize the risk of infection. Follow the tattoo artist's instructions about how to take proper care of the area while it heals. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Note that immediately after the freckle tattoo is applied, the color will look dark. This is likely not a cause for concern, though. The color will fade to its final shade after about three weeks. If the area seems unusually swollen, painful, or red after the first few days, however, there is some chance that an infection or allergic reaction may have been triggered. Reach out to your tattoo artist and your dermatologist for support."
    }
  ]
}