{
  "url": "https://www.wikihow.com/Funny-Dares",
  "title": "The Ultimate List of Funny, Spicy & Embarrassing Dares",
  "steps": [
    {
      "title": "Try these classic funny dares in any social situation.",
      "content": "Try these classic funny dares in any social situation. A silly and funny day is perfect for any party, sleepover, or even a one-on-one hangout. These dares are not too serious and not too difficult, as it’s important to “remember that the goal of the game is to have fun…[and] to keep it light-hearted and enjoyable for [everyone],” asserts Bilotta. With that in mind, here are favorite funny dares for anyone : Lick the wall. Pick your friend’s nose. Pluck a single nose hair. Sing a song in a funny voice. Pretend to be a dog for 5 minutes. Sing the “I Love You” Barney song. Talk in rhyme for the next three turns. Go outside and try to summon the rain. Call a 7-Eleven and ask if they’re open. Draw a tattoo with a marker on your bicep. Sniff another player’s armpit for 10 seconds. Speak in an accent for the next three rounds. Spin around 10 times and try to walk straight. Balance a spoon on your nose for 10 seconds. Write your name on the floor with your tongue. Try to juggle any three items found in this room. Act (and talk) like a chicken until your next turn. Do your best impression of someone in this room. Call a random number and sing \"Happy Birthday.\" Wear socks on your hands for the next 10 minutes. Sing the \"Star-Spangled Banner\" in a British accent. Put your shoes on the wrong feet and keep them there. Let the other players go through your phone for a minute. Sing instead of speaking for the next two rounds of the game. Let the group choose an item for you to brush your teeth with. Until the next round, talk super loud like nobody can hear you. One by one, make up a title for each player's movie about their life. Sniff everyone’s feet and rank them in order of freshest to stinkiest. When anyone in the group laughs, quack like a duck as loud as you can. Dip your sock-covered feet in the toilet, and don't dry them off for the rest of the game. Call a NY-style pizza place and ask them what the difference is between NY pizza and “real” pizza. Lift up the couch cushions, and if there is anything under them, put it in your mouth for 10 seconds."
    },
    {
      "title": "Turn everyone’s cheeks red with these mortifying (but funny) dares.",
      "content": "Turn everyone’s cheeks red with these mortifying (but funny) dares. Sometimes, the funniest dares bring some light embarrassment to the person doing them. It is a dare, after all! However, Bilotta emphasizes the importance of still keeping the dares light to avoid any true humiliation or meanness. “Focus on fun and playful dares rather than…risky ones,” says Bilotta. “You can dare [someone] to do something silly or make a funny face instead of asking them to reveal their darkest secrets.” To get you started, here are some (minorly) embarrassing dares : Burp the alphabet. Attempt to breakdance. Sing like an opera singer. Talk to a pillow like it’s your crush. Run around outside yelling, “I have lice!” Rub your armpits and then smell your fingers. Call McDonald's and ask if they sell Whoppers. Color one of your front teeth black with eyeliner. Have a full conversation with yourself in a mirror. Open your front door and loudly sing “Hallelujah!” Do as many squats as you can on the front lawn. For the next 15 minutes, only speak in baby talk. Let the person across from you give you a wedgie. Open your front door and howl like a wolf for 30 seconds. Go outside in the driveway and do the disco without music. Squirt your face with a squirt gun continuously while talking. Wear your underwear over your pants for the rest of the game. Go next door with a measuring cup and ask for a cup of sugar. Let your friends pose you and stay like that until the next round. Go outside and pretend you're cutting the grass with an invisible mower. Sing a song chosen by the group while eating spoonfuls of peanut butter. Have the person to your right do 10 squats while you lie underneath them. Let a person in the group put a leash on you and walk you down the street. Empty your purse, backpack, or wallet, and let everyone see what you have. Call your mom and tell her you can't find a girlfriend in a very panicked voice. Stand in the backyard and yell at the top of your lungs, “Nooooo! I was adopted!” Stop a car that is going down the street and tell them that their wheels are turning. Call the library and ask if they carry a dictionary that translates British to American. Give your phone to another player to send a text message to their contact of choice. Go to the bathroom. The person to your left has to be in there with you the whole time. Call a random number, and when someone picks up, immediately start singing the national anthem. Go into an elevator and stand in the corner facing the wall. Keep doing it until three people have gotten on."
    },
    {
      "title": "Amp up the heat with some silly, spicy, and sexy dares.",
      "content": "Amp up the heat with some silly, spicy, and sexy dares. If you’re playing Truth or Dare with a crush, romantic partner, or even a group of partygoers looking to push the envelope, then you might want to opt for dares that are equally dirty and diabolically funny. Just remember to establish boundaries with your players. As Bilotta advises, “discuss which topics are off-limits or uncomfortable. This can include things like past relationships or personal traumas.” Once that’s out of the way, you can choose from this list of spicy dares : Do your best sexy crawl. Make out with your hand. Make out with the closest wall. Call your ex and tell them you miss them. Whisper your favorite dirty talk line in another player’s ear. Pour syrup on someone’s chest and lick it off. Imitate what you sound like when you “finish.” Trade clothes with someone for the rest of the game. Sing a romantic song to the person on your left. Take off your pants and give your best twerk. Put an ice cube in your underwear for one minute. Eat a strawberry in the most sensual way possible. Go into the bathroom or bedroom and send someone a sexy selfie. Blindfold another player and write something sexy on their body in lipstick. Call a random number and try to flirt with the person who picks up. Take off all your clothes and continue the game in your underwear. Pick someone in the group, put whip cream on their face, and lick it off. Eat a single spaghetti like in Lady and the Tramp with the person to your left. Put on \"Pony\" by Ginuwine and vacuum seductively for the length of the song. Pole dance with an imaginary pole for the length of an entire song of another player’s choice. Pick up a random book and read it in the most seductive voice you can manage. Take out your wallet and pretend to be a patron at a strip club while another player dances for you. Put on a timer and act out as many sexual positions as you can with your clothes on. Let the person to your right put duct tape on any part of your body they choose and rip it off. Keep your hand on the very inner thigh of the person next to you for the next round. Call another player by a nickname for the rest of the game. They get to spank you every time you use their real name. Try to lick yourself from your head to your toes. You can use three “phone a friends” for help reaching certain areas. Someone has to lick peanut butter, chocolate sauce, or whipped cream off your finger, cheek, or somewhere of their choice. With your eyes closed and the other person or people standing across from you in the room, walk with your hands out. You have to kiss the first person you touch, wherever you touch them."
    },
    {
      "title": "Torture your tastebuds with some edible (or inedible) dares.",
      "content": "Torture your tastebuds with some edible (or inedible) dares. We know your parents told you not to play with your food…but it sure does make for a funny dare! Whether you’re challenging someone to eat a disgusting concoction or a shot of something spine-tingling, bringing food into Truth or Dare can add a really exciting and hilarious element. If the idea of unappealing food appeals to you, then try one of our funny food-related dares : [1] X Research source Eat a handful of grass. Take a shot of hot sauce. Take a shot of soy sauce. Eat a spoonful of olive oil. Take a shot of pickle juice. Eat a spoonful of pet food. Take a shot of lemon juice. Eat a bowl of mayonnaise. Eat an onion like an apple. Eat a spoonful of mustard. Use three items in the fridge as lotion. Mix orange juice and milk and drink it. Put hot sauce on ice cream and eat it. Eat a banana without using your hands. Eat 10 Oreo cookies that are filled with mayo. Stuff your mouth with crackers and try to whistle. See how many grapes you can stuff in your mouth. Put a bunch of honey on your nose and coat it with flour. Let each person in the group crack an egg on your head. Let someone in the group throw one piece of food at you. See how many marshmallows you can stuff in your mouth. Stick a Hot Cheeto in your nose, and leave it there for five minutes. Rub mayonnaise in your hair and leave it on for the rest of the game. Pretend you’re a bird and eat cereal off the floor using only your mouth. Chew a piece of gum that’s already been chewed on by another player. Make a sandwich out of applesauce and olives (or another gross food pairing) and take a huge bite. Let the group choose three random things from the refrigerator and mix them together. Then eat the mixture."
    },
    {
      "title": "Bring your game to the worldwide web with some FB and Insta dares.",
      "content": "Bring your game to the worldwide web with some FB and Insta dares. It’s one thing to do embarrassing things in front of your friends and loved ones, but to do them on social media? That’s a whole ‘nother story! You can really up the ante in your run-of-the-mill Truth or Dare game by including Instagram, Facebook, TikTok, or Snapchat in your dare. For instance, you can try one of these mildly embarrassing and extremely funny social media-related dares : Do an Instagram live of you dancing. Write a status on Facebook praising another player. Post an old selfie on your Instagram story. Take a selfie with the toilet and post it online. Go live on Instagram and sing to your followers. Change your Facebook status to “Feeling lonely.” Like every post on a random person’s Instagram page. Do a TikTok dance from your FYP and post it on TikTok. Go on Facebook Live and read the back of a shampoo bottle. Take an embarrassing selfie and post it as your profile picture. Take a selfie blindfolded and post it on your Facebook timeline. Change your Facebook Relationship Status to “Getting Married.” Change your relationship status on Facebook to \"it's complicated.\" Post the last picture on your camera roll to your Instagram stories. Send another player a screenshot of your current Facebook or Instagram inbox. Tweet or update your Facebook status to \"I think eggplants are sexy.\" Create a very descriptive posting for the ugliest shirt you own on eBay. Dump a bucket of ice water on yourself and post a video of you doing it. Go on Facebook and write \"How do you spell \"facebook\"?\" as your status. Post a really long and serious Facebook status confessing your love for chocolate. Do your best Euphoria makeup imitation on yourself and post a selfie to Instagram. Go on Facebook and change your relationship status every hour, for the entire day. Write ‘I love you’ on your forehead then post the picture on Instagram, sans caption. Take a picture of your weirdest pose and post it to one of your social media accounts. Post a Story of a random item in your house, tagging and thanking the brand like an influencer. Let each player choose one word, then attempt to form a sentence with them and post it to Facebook. Let the group dress you in whatever they want, take a picture, and post it to one of your social media accounts. Open Facebook, go to the account of the first person you see, and Like every post on their wall going back a full year. Send a selfie to someone you haven’t talked to in at least a year on Facebook or Instagram. Take a screenshot of their reply and send it to the group. Change your Instagram bio to something ridiculous like, “I’m a Grammy-winning singer with her own cooking show” and leave it like that for 24 hours."
    },
    {
      "title": "Level up with some extra-difficult (and embarrassing) double-dog dares.",
      "content": "Level up with some extra-difficult (and embarrassing) double-dog dares. We’ve been going easy on you so far, but these extreme-level dares are as challenging as they are hysterical. From truly technically difficult dares like “give yourself a 10-second manicure” to physically taxing dares like “let someone wax your back,” we’ve got all of the hard (but funny) dares that you’ll need: Suck your big toe. Kneel for 20 minutes. Jump into a dumpster. Twerk to an NSYNC song. Eat a whole piece of paper. Eat a mouthful of raw pasta. Let someone wax your back. Make up a rap about koalas. Lick the bottom of your shoe. Cry like a baby for one full minute. Call a stranger and tell them a secret. For the rest of the game, do not say \"I.\" Be blindfolded for the rest of the game. Walk down the street in your underwear. Trade clothes with the person next to you. Only speak in rhymes for the rest of the game. Allow someone to pour ice down your shirt and pants. Tie your hands to your ankles for the rest of the game. Make a silly face and keep it that way until the next round. Make your ear touch your shoulder for the rest of the game. Drink water straight from a running faucet for a whole minute. Give yourself a 10-second manicure. Every nail must be painted. Go outside and pick exactly 40 blades of grass with a pair of tweezers. Let each person in the group slap you as hard as they can on your butt. Soak a shirt in water, put it in the fridge for 20 minutes, and then wear it. Go outside and hug a mailbox until at least three passersby have seen you. Dump a bunch of LEGOs on the floor and walk over them with your bare feet. Write a letter to your doctor describing an embarrassing rash you have, and post it on Facebook. Make a hand puppet by drawing a face on your hand, and use your hand to say what you want to say. Fill your mouth with water, and each person in the group must tell the funniest joke they know. If you spit up the water, you have to eat a spoonful of dirt."
    },
    {
      "title": "Text a dare to a friend or loved one to keep the laughs rolling at all hours.",
      "content": "Text a dare to a friend or loved one to keep the laughs rolling at all hours. You can let the Truth or Dare game run longggg past the time that you’re back home and (physically) alone. If you’re texting with a friend, group of friends, crush, family member, etc., all of these virtual dares will keep the LOLs coming. If you’re game enough, try sending one of these funny dares over text : [2] X Research source Send your crush, ‘What’s up?’ Show the group the last text you sent. Call your dad and say you got engaged. Call your number neighbor and say hey! Make out with your pillow for 10 seconds. Send someone a video of you waxing your arm. Text someone a page out of your childhood diary. Record yourself doing your makeup blindfolded. Send a voice note doing your best impression of another player. Text an emoji to the first 20 people on your contact list. Get in the shower with all your clothes on and record it. Send an emoji to the fourth person on your contact list. Send someone a video of you hosting your own cooking show. Send someone a video of you singing (insert YouTube video link) . Eat a spoonful of vanilla extract and record yourself doing it. Call your neighbor and ask them for directions to McDonald’s. Eat a super weird food concoction and record yourself doing it. Send a screenshot of your search history from the last 24 hours. Send a player a video of you doing your best Harry Potter impression. Send your crush a steamy playlist and say it makes you think of them. Send a player a voice recording of you reenacting your favorite movie scene. Text the crush from high school that you never admitted your feelings for. Text your family and tell them you’re moving to the other side of the planet. Text someone you’ve been into in the past, ‘I see you,’ with no explanation. Record yourself chugging a can of seltzer and see how loudly you can burp. Text your mom that you peed yourself and need a new change of clothes ASAP. Call your dad and ask if it’s normal to be charged $500 for ‘premium air’ in your tires. Send a video of you singing your favorite Taylor Swift song to your sibling with no explanation. Text someone “hey.” Every time they respond, say “hey.” Do this 10 times. For the 11th time, reply with “hi.” Call a random number and ask if their refrigerator is running. When they say yes, say “Well, you better go catch it!”"
    },
    {
      "title": "Bring the giggles with these kid-friendly funny dares.",
      "content": "Bring the giggles with these kid-friendly funny dares. Truth or Dare is for kids of all ages, and no one’s better at being silly than the under-12 crowd. So, it’s only natural that the funniest of all dares would be child-friendly and appropriately comical! These funny dares for kids will make Bluey look like a 3-hour long history documentary (but no shade, we love Bluey) : [3] X Research source Hug a tree. Sing a silly song. Prank call a friend. Laugh like a piggy. Attempt a cartwheel. Do a disco robot dance. Talk in a squeaky voice. Pretend to be a dinosaur. Pretend to be an alligator. Count backwards from 45. Pretend to be an astronaut. Draw yourself as a silly dog. Sing an opera song in Italian. Wear your pants on your head. Recite the alphabet backwards. Run outside and yell, “Woohoo!” Give someone a piggyback ride. Do a Mickey Mouse impression. Play fetch with an imaginary dog. Act like a monkey for 30 seconds. Take a bite out of a stick of butter. Make a silly face in front of a friend. Eat a pudding cup without a spoon. Pretend you’re a ghost for 2 minutes. Hop in a circle around the entire room. Wear a lampshade on your head as a hat. Keep your eyes completely closed for 2 minutes. Tape a cup to your forehead and act like a unicorn. Tell the next person you see that you pick your nose. Talk with your tongue sticking out until your next turn."
    },
    {
      "title": "Mix up your funny dares with some equally embarrassing truth questions.",
      "content": "Mix up your funny dares with some equally embarrassing truth questions. There’s a reason that the game is called Truth or Dare, so you’ll certainly need some funny Truths to pair with your hilarious Dares! Just remember that you can always “use the ‘skip’ option,” reminds Bilotta. “If a truth question is too personal or uncomfortable, use the ‘skip’ option and move on to the next question.” Here are our favorite funny truth questions , ranging from wacky and silly to spicy and saucy: What is your worst habit? Have you ever stolen anything? Do you cheat when playing games? What is the biggest lie you ever told? Have you ever picked your nose and eaten it? When you fart, do you sit there or try to move away from it? What crime would you commit if there were no consequences? What is the longest you have worn the same pair of underwear? What is one thing that you would want to change about yourself? What is one thing that you never want your parents to know about? How many people have you kissed? Have you ever had a crush on a teacher? What's the sexiest song you've ever heard? What’s a fantasy you’ve never told anyone about? What's a seemingly nonsexual thing that turns you on? Have you ever accidentally sent a sext to the wrong person? If you could hook up with one of your friends, who would it be? Who is your biggest secret crush that you would never pursue? Have you ever hooked up with a stranger or had a one-night stand? What's the most embarrassing thing that’s happened to you during sex?"
    },
    {
      "title": "",
      "content": "Still not done with your hilarious game of truth or dare? Fortunately, we’re here to make sure that you never run out of knee-slapping truths or dares for your friends, family members, or significant others. Check out this comprehensive list of the very best truth or dare questions: Truth or Dare Questions for Kids Truth or Dare Questions for Adults Truth or Dare Questions for Teens Truth or Dare Questions for Couples Truth or Dare Questions for Your Girlfriend Truth or Dare Questions for Your Boyfriend Truth or Dare Questions to Ask Over Text Juicy Truth Questions Dares for Kids"
    }
  ]
}