{
  "url": "https://www.wikihow.com/Dye-African-American-Hair",
  "title": "How to Dye African Hair",
  "steps": [
    {
      "title": "Select the color you want for your hair.",
      "content": "Select the color you want for your hair. Go for a color that complements your skin tone and personality, and stay away from anything too brash to avoid disappointment. If you are dyeing your hair at home, it is better to stay with a darker shade. A blonde or dramatically different shade can be difficult to achieve without the help of a stylist, and dyeing it improperly can leave hair very damaged. If your hair has been relaxed, then it is best to go to a professional. [1] X Research source If you don't want to go to a professional, it's best to stick to temporary dyes. Choose a color that is within two to four shades of your natural hair color. Choosing blonde when your hair is naturally dark can result in a shade of orange."
    },
    {
      "title": "Choose a permanent or semi-permanent dye.",
      "content": "Choose a permanent or semi-permanent dye. You have the option of choosing a permanent, semi-permanent, or temporary dye. A semi-permanent dye is probably the better option because it isn’t as harsh and doesn’t last as long. A temporary dye doesn’t penetrate the strands, and it will wash out within a few washes. Choosing a semi-permanent dye can also be healthier for your hair because natural hair coloring options, like henna, are available with semi-permanent hair color. The longer your hair, the more boxes you'll need. If your hair is long, it's best to buy at least two boxes of color to be sure that you will have enough dye. If you have short hair, you should need just one box. Henna is a great choice for natural, virgin hair. But, if you’re hair has already been chemically treated, then henna can damage your hair. [2] X Research source It is possible to apply dye to locs."
    },
    {
      "title": "Deep condition two days before dyeing.",
      "content": "Deep condition two days before dyeing. Applying a deep conditioner will strengthen your hair before exposing it to the dye. Using a deep conditioner will also provide your hair with more moisture, which will allow the color to soak in better. Apply the conditioner for five to thirty minutes, depending on the instructions, and then rinse thoroughly. [3] X Research source"
    },
    {
      "title": "Avoid shampooing your hair before dyeing.",
      "content": "Avoid shampooing your hair before dyeing. Clean hair can be too slippery for the hair color to attach to. Although it might not feel right, it is better for your hair to be slightly dirty when you apply color. The natural oils give the color something to hold on to, and the oils act as a buffer between your scalp and the hair dye. [4] X Research source"
    },
    {
      "title": "Prepare your hair.",
      "content": "Prepare your hair. Comb through your hair gently in order to relieve any tangles. Doing this will ensure that there are no obvious “patches” in your hair after it is dyed. Then, part your hair into four sections and clip the sections down and away from each other. You will apply the dye to one section at a time to ensure that every strand is coated with color. [5] X Research source"
    },
    {
      "title": "Read the instructions.",
      "content": "Read the instructions. Carefully review the instructions specific to the product you’ve chosen before preparing the dye. There is generally an activator along with the color and an applicator to apply the mixture to your hair. Typically, you will need to mix the applicator and color into one bottle, shake it, and then you are ready to apply the color to your hair. [6] X Research source If an applicator is not supplied, you can use an applicator brush. You will also need a mixing bowl so that you can use the brush. Every hair dye kit is different. Don’t assume you know how to prepare the dye because you’ve used a hair dye kit in the past."
    },
    {
      "title": "Put on the gloves.",
      "content": "Put on the gloves. Gloves should be supplied in the kit. If not, you can buy a plastic or rubber pair from a beauty supply store, like Sally’s Beauty Supply. Gloves are important to wear during the dyeing process because skin exposed to dye can be burned by the chemicals used in the dye. [7] X Research source You should also use gloves to avoid staining your hands and fingernails."
    },
    {
      "title": "Do a strand test.",
      "content": "Do a strand test. Take a small amount of color and apply it to a strand of your hair. You should do this to test the color and make sure it is what you want before committing to it. Your hair texture also determines the amount of time the color needs to sit, so a strand test helps you decide how long you will need to set the timer for when you apply the color to all of your hair. [8] X Research source If the color does not turn out as expected, it is best to wait for professional guidance or buy another kit."
    },
    {
      "title": "Protect your clothing.",
      "content": "Protect your clothing. Hair dye may drop during the application process. Wear an old T-shirt or robe you don’t care about staining while dyeing your hair. Make sure to wear something that can be easily removed and will not rub against the hair dye when you remove your clothing for a shower. An old button-up shirt or robe is ideal because you don’t have to remove it over you head."
    },
    {
      "title": "Protect your skin.",
      "content": "Protect your skin. It’s normal for some hair dye to get on the forehead and neck during application. Apply petroleum jelly to the forehead around your hairline and any area that may be exposed to dye to avoid the dye staining your skin. If dye does stain your skin, you can remove it with products like makeup remover and nail polish remover with a washcloth. [9] X Research source Be sure to rinse the remover as soon as the dye is removed. Nail polish remover can cause irritation to skin."
    },
    {
      "title": "Divide your hair into four sections.",
      "content": "Divide your hair into four sections. First, divide your hair down the middle to create two big sections. Then separate those sections into four by dividing your hair from ear-to-ear. Clip each section in place. This will make it easier to dye your hair, as you can apply the dye to one section at a time."
    },
    {
      "title": "Apply the dye one section at a time.",
      "content": "Apply the dye one section at a time. Going by one section at a time, apply the dye mixture using the applicator. Untie or unclip the section you are dyeing, but leave the other sections up until you are ready to dye them. Smooth the dye into the hair with your fingers gently moving from root to tip. Take your time as you apply. Going too fast could affect your curl pattern. Make sure every strand is covered. [10] X Research source Once you think all of the hair has been covered in dye, go back through one more time and make sure there are no strands left to color."
    },
    {
      "title": "Wait for the hair color to take.",
      "content": "Wait for the hair color to take. Read the instructions to check how long the color should stay on for. You can also judge the amount of time according to the strand test you did before coloring all of your hair. Set a timer to make sure the color sits for the length of time required. [11] X Research source Some dyes are made to stop processing when the amount of time is up. Keeping the color on longer will likely not impact the color, but not keeping the color on long enough can change the results. To limit your risk of drips and stains, wear a plastic shower cap over your hair while the dye is processing."
    },
    {
      "title": "Rinse thoroughly.",
      "content": "Rinse thoroughly. Once the dye has been in your hair for the required time as per instructions, rinse your hair thoroughly with cool to warm water until there are no traces of dye left. You can use a shampoo for color-treated hair during this time to clean the hair. There should not be any dye visible in the water when you are finished rinsing your hair. [12] X Research source"
    },
    {
      "title": "Use a deep conditioner.",
      "content": "Use a deep conditioner. Many dye kits will come with a deep conditioner to use directly after the dyeing process. If not, use a deep conditioner of your home. It’s important to deep condition your hair after dyeing to strengthen the hair and add shine. Apply the conditioner and gently run your fingers through your hair to make sure it is coated. Then, wrap your hair in a warm towel, or cover with a shower cap and scarf for approximately fifteen minutes to lock in the moisture. Rinse thoroughly with cool water once the amount of time is up. [13] X Research source Look for a deep conditioner that contains shea butter, honey, or avocado to add moisture back to your tresses. If you have one, sit under a dyer or steamer for 10-15 minutes to let your deep conditioner penetrate the hair shaft."
    },
    {
      "title": "Dry and style as you wish.",
      "content": "Dry and style as you wish. Avoid using a hair dryer if possible. Instead, allow it to dry naturally. During this time, you can use a styling product, like mousse or oil, to aid in the styling process and add extra shine. Make sure to use a heat-protectant product whenever you use heat-styling tools."
    },
    {
      "title": "Invest in a shampoo and conditioner for dyed hair.",
      "content": "Invest in a shampoo and conditioner for dyed hair. Use a shampoo and conditioner made for dyed hair to provide extra moisture and extend the life of your hair. Shampoos and conditioners made for dyed hair should not contain sulfates, which will strip the hair. [14] X Research source Avoid washing your hair in hot and hard water, which will strip your hair of its color. You can also buy products made to make color last. A color protectant product may come in the form of a shampoo, spray, or cream."
    }
  ]
}