{
  "url": "https://www.wikihow.com/Copy-Music-from-CD-to-USB",
  "title": "How to Rip Music from a CD to a USB Drive: Windows & Mac",
  "steps": [
    {
      "title": "Insert the CD.",
      "content": "Insert the CD. Place the CD into the disc drive slot. You may need to touch a button on the side to open the drive. If your computer is newer, it likely doesn't have a built-in CD or DVD drive. You can still copy music from a CD using an external drive that plugs into an available USB port. They are affordable, and you can pick them up in most electronics and big-box stores. If your USB drive is not already connected to your PC, connect it now."
    },
    {
      "title": "Open Windows Media Player.",
      "content": "Open Windows Media Player. If you're using Windows 10 or earlier, you can just click Windows Media Player in the Start menu, or type media player into the search bar and click Windows Media Player . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you're using Windows 11, Windows Media Player is not installed by default, but you can get it by making a quick change to your settings. Here's how: Open the Start menu and click Settings . Go to System > Optional features > View features . Check the box next to \"Windows Media Player,\" click Next , and follow the on-screen installation instructions."
    },
    {
      "title": "Click Rip settings and select More options....",
      "content": "Click Rip settings and select More options... . This is in the top right corner of the window. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you don't \"Rip settings,\" click the Organize menu and select Options… instead."
    },
    {
      "title": "Click the Rip Music tab.",
      "content": "Click the Rip Music tab. This displays your settings for copying audio files from a CD."
    },
    {
      "title": "Specify a folder to copy the music to.",
      "content": "Specify a folder to copy the music to. Click Change and choose a folder on your computer. You'll be able to copy or move the files to your flash drive easily once you've finished ripping the CD. If you want to copy the music files straight to the USB drive without first copying them to your computer, select your USB drive as the location."
    },
    {
      "title": "Select a format.",
      "content": "Select a format. In most cases, you'll want to copy the music as MP3 , as these offer the best quality-to-size ratio and are compatible with nearly all audio players. If you prefer one of the other formats (including high-quality lossless formats like WAV, ALAC, and FLAC ), select it from the menu."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This saves the settings."
    },
    {
      "title": "Click Rip CD.",
      "content": "Click Rip CD . The music will start ripping to the folder you specified. If you copied the music directly to the USB drive, you'll be done as soon as the ripping process is complete! If you selected a folder on your built-in drive instead, continue with this method."
    },
    {
      "title": "Open File Explorer",
      "content": "Open File Explorer . If you copied the CD to your computer and not directly to your flash drive, you'll need to use File Explorer to copy the files to the drive. Hold ⊞ Win + E to open File Explorer, or look for the folder icon on your taskbar."
    },
    {
      "title": "Locate the folder that contains the music files.",
      "content": "Locate the folder that contains the music files. You should see a new folder inside the folder you selected earlier, typically with the artist or album's name (or \"Unknown Artist\"). Use the search bar at the top to find the folder if you cannot remember where it is. Music from CDs is automatically imported to your Music folder by default. If you didn't specify a folder, that's where you'll find them."
    },
    {
      "title": "Select the music files you want to copy.",
      "content": "Select the music files you want to copy. To do this, click the name of the folder that contains the music files, then press Ctrl + C to copy it."
    },
    {
      "title": "Open your USB drive in File Explorer.",
      "content": "Open your USB drive in File Explorer. You may need to click This PC in the left panel to find it."
    },
    {
      "title": "Press Ctrl+V to paste the copied music.",
      "content": "Press Ctrl + V to paste the copied music. Alternatively, you can right-click the drive icon and select Paste . This copies the music onto the USB drive. If you want to copy the music to a certain folder, open the folder first by double-clicking it, then paste the files. If you don't want to keep the music files on your main drive, you can safely delete them."
    },
    {
      "title": "Insert the CD.",
      "content": "Insert the CD. Place the CD into the disc drive slot. When your Mac reads the CD, it will automatically open the Music app to display a list of its songs. If you're using a MacBook or another Mac model that doesn't have a built-in optical drive, you can use an external optical drive. They are widely available and can easily be connected to an available USB port. If you haven't yet connected the USB drive to your Mac, you should do so now."
    },
    {
      "title": "Click Import CD.",
      "content": "Click Import CD . It's near the top-right corner of the Music app. This opens the Import Settings window, where you can choose some preferences."
    },
    {
      "title": "Select your preferences.",
      "content": "Select your preferences. Music files are copied to your Mac as AAC files by default. [3] X Research source If you prefer MP3s because they're more widely supported, or want a higher-quality format like AIFF, Apple Lossless (ALAC), or WAV, you can your preference from the \"Import Using\" menu instead. [4] X Research source"
    },
    {
      "title": "Click OK to copy the CD to your Mac.",
      "content": "Click OK to copy the CD to your Mac. This rips the music files from the audio CD to your Music folder."
    },
    {
      "title": "Open the Music folder in Finder.",
      "content": "Open the Music folder in Finder. You should see a new folder containing the music files you ripped from the CD."
    },
    {
      "title": "Select the folder and press ⌘ Cmd+C.",
      "content": "Select the folder and press ⌘ Cmd + C . This copies the folder. To select multiple files or folders, hold ⌘ Command while clicking each file or folder. Alternatively, you can click Edit when a file or folder is highlighted select Copy ."
    },
    {
      "title": "Double-click the USB drive icon on your desktop.",
      "content": "Double-click the USB drive icon on your desktop. This opens the contents of your USB drive."
    },
    {
      "title": "Press ⌘ Command+V to paste the copied music.",
      "content": "Press ⌘ Command + V to paste the copied music. This copies the ripped songs over to your USB drive. Alternatively, click Edit then select Paste . If you want to conserve space on your Mac's built-in hard drive or SSD, you can delete the files from your Music folder once they're copied to your flash drive."
    }
  ]
}