{
  "url": "https://www.wikihow.com/Deal-With-a-Proud-Person",
  "title": "How to Deal With a Proud Person",
  "steps": [
    {
      "title": "Set clear boundaries.",
      "content": "Set clear boundaries. Before you interact with the proud person, reach out and set the scope of the conversation. Be clear and specific about what you want to talk about then stick to it. [1] X Research source [2] X Expert Source Tala Johartchi, PsyD Clinical Psychologist Expert Interview. 16 July 2021. For example, “I want to talk to you about the performance reviews and our raise policy.” Be forceful about maintaining the boundaries. It's okay to say things like, “I know you're excited about your work at City Hall, but that's not what we agreed to discuss. Let's keep focused on the community garden project I'm running.” If the person doesn't respect your boundaries, it may be time to re-evaluate the relationship. [3] X Expert Source Tala Johartchi, PsyD Clinical Psychologist Expert Interview. 16 July 2021."
    },
    {
      "title": "Have responses in mind.",
      "content": "Have responses in mind. If you know what you're going to talk about, and you think you can predict what the proud person will say, plan how you'll respond. [4] X Research source It won't be so easy to frustrate you if you're expecting to be frustrated. If confrontation makes you nervous, try writing a script of how you want the conversation to go and practice your part. If they say, \"Did you see the memo I sent out? I really set the record straight with that one!\" You can respond with, \"I did see it; I actually wanted to talk about some of the language you used in it.\""
    },
    {
      "title": "Use word associations to steer the conversation.",
      "content": "Use word associations to steer the conversation. If you feel stuck on a single topic, try to nudge the conversation away from it in small increments. Don't be too abrupt; when you make a change to the conversation, let the conversation develop a little before giving it another nudge. For instance, if the proud person wants to talk about how the committee should have voted in their favor you can change the subject to a discussion of the limitations of democracy."
    },
    {
      "title": "Use an agreement to segue to a new topic.",
      "content": "Use an agreement to segue to a new topic. Sometimes the best way to deal with a proud person is to have them think you are agreeing with them. [5] X Research source Use the 'yes, but' method to introduce something you'd like to talk about. For example: “I agree that we can be more productive, but it would help if the databases were less clunky.” “Yes, I think that could work. But the consequences would be devastating.” “Yes, I will finish the account, but my first priority is the presentation I'm giving this afternoon.”"
    },
    {
      "title": "Stand your ground.",
      "content": "Stand your ground. Bending to the will of the proud person will just lower your standing with them and make them less receptive to you in the future. [6] X Research source If they're not responsive to your position, change the subject. For example, “We're just going back and forth on this. It'll be more productive to revisit this after we've talked about the accounts.” Remember to be firm and use phrases like, “This will help…” or “I know…” Try to avoid phrases like, “I think…” or “I believe…”"
    },
    {
      "title": "Recognize and avoid negative triggers.",
      "content": "Recognize and avoid negative triggers. Proud people will become stubborn when confronted with facts or truths that don't cohere with their world view. [7] X Research source Pay attention to any words, phrases, or topics which trigger the proud person's stubbornness. Make a note of this and avoid bringing them up in your future conversations."
    },
    {
      "title": "Ask for their help.",
      "content": "Ask for their help. Proud people like to take control and maintain their autonomy. You can flatter a proud person by asking for their opinion. Engage their voice as a sign of respect. Everyone responds well to that! Asking for a proud person's help can also be a way of helping them work through their pride."
    },
    {
      "title": "Resist taking this behavior personally.",
      "content": "Resist taking this behavior personally. You are not the cause of this negative behavior. If you feel like you're not being listened to, it's not because you don't have something valuable to contribute. Proud people find it difficult to take advice because they think of it as criticism. Remember: at the end of the day, you can't control this person's behavior. [8] X Expert Source Tala Johartchi, PsyD Clinical Psychologist Expert Interview. 16 July 2021."
    },
    {
      "title": "Rely on your own sense of accomplishment.",
      "content": "Rely on your own sense of accomplishment. It is unlikely that you'll receive validation from a proud person. Proud people will often not acknowledge the things you achieve because they're so focused on themselves. Give yourself a pat on the back for accomplishing a difficult task or achieving a goal. [9] X Research source"
    },
    {
      "title": "Breathe and remain calm.",
      "content": "Breathe and remain calm. Talking to a proud person can sometimes feel like the emotional equivalent of repeatedly running into a brick wall. [10] X Expert Source Tala Johartchi, PsyD Clinical Psychologist Expert Interview. 16 July 2021. Knowing what you're up against only gets you so far. Sometimes you'll need to relax and breathe to let the frustration flow away. This will take some practice and patience . When you breathe deeply , be careful not to sound like you're sighing. You don't want to give away that you're feeling frustrated. That will just derail the interaction."
    },
    {
      "title": "Step away.",
      "content": "Step away. Sometimes the best thing you can do for yourself is give yourself some space. You may feel like you're pouring too much time and energy into maintaining a toxic relationship. This can be mentally draining, and can make you feel really bad about yourself. Make a clean break from the person who is causing this stress. This doesn't have to be a permanent separation. You may wish to revisit the relationship at some point, but make it clear to the proud person that you will only do so on your own terms. Tell them that you need space to think, and you'll reach out to them when you're ready."
    }
  ]
}