{
  "url": "https://www.wikihow.com/Get-Someone-Fired",
  "title": "Want To Get Your Toxic Coworker Fired? How to Tell if You Should & How to Do It",
  "steps": [
    {
      "title": "Make sure you have a legitimate reason to get a person fired.",
      "content": "Make sure you have a legitimate reason to get a person fired. Even if you and your co-worker don't get along, this job may be how they provide for their family. If they lose their job, they may not be able to continue doing so. Consider this before you go through with your plan to get them fired. You have a good case if your coworker is: [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Interfering with your ability to work. Interfering with someone else's ability to work. Stealing company time by being habitually late, lazy, or uncooperative. Creating a hostile or counterproductive work environment. Has sexually, physically, or verbally harassed you or another worker."
    },
    {
      "title": "Get some back-up.",
      "content": "Get some back-up. Your argument will seem way more valid if you have the support of your other co-workers. Ask around to see if anybody else at work feels the same way that you do about this employee. Go about this in a diplomatic way. Avoid spreading rumors or trying to convince people to start hating the co-worker in question. Ask questions like, \"So, what do you think of the new clerk?\" or \"Did you happen to notice what time John got to work?\" If you find that one or more co-workers agree with your complaints, then ask whether they would be willing to join you in making a formal complaint."
    },
    {
      "title": "Keep tabs on this person.",
      "content": "Keep tabs on this person. Pay attention to your co-worker's behavior at work so that you can have substantial evidence when you go to make a complaint, and keep a document of incidents. Pay attention to significant indiscretions and log them. Keep a log of the times, dates, and detailed descriptions of these incidents so that your argument appears more valid and to give your manager something to work off of. This will be easiest if you work the same shifts as your co-worker, and work in the same general vicinity. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Try to distinguish between serious indiscretions that affect the work environment and more minor infractions. Failing to clean up the coffee station isn't as big a deal as showing up to work drunk."
    },
    {
      "title": "Schedule a meeting with your manager or supervisor.",
      "content": "Schedule a meeting with your manager or supervisor. Use your best judgment to determine who the most appropriate person is for you to meet with regarding this matter. Plan on meeting in person, if possible. Bring your written notes with you when you go to the meeting, as well as any other coworkers who also wish to complain. Request that your complaint remain anonymous. This way, you will avoid making enemies with the co-worker in question. [3] X Research source Avoid making complaints via email, which are both easier to ignore and less formal than in-person meetings. That also leaves a paper trail of your complaint, which you may prefer to distance yourself from."
    },
    {
      "title": "Plan what you'll say.",
      "content": "Plan what you'll say. Think through the points you'd like to make and practice reciting them in a calm tone of voice. If you're frustrated with the person, your boss might be more likely to assume this is a personal matter you're blowing out of proportion, rather than a serious complaint you're making for the good of the company. Point out some of the person's good points: \"I like John, really. He's funny and I think he's a good guy and I hope he turns around, but I'm worried about him.\" Don't ask directly for the boss to fire the person. If your manager asks, \"What do you think I should do?\" feel free to make your preference known, but it's not your decision to make."
    },
    {
      "title": "Let your manager deal with the situation.",
      "content": "Let your manager deal with the situation. Once you have made a formal complaint, it is no longer your responsibility to continue keeping tabs on this person or trying to get them fired. Go back to focusing on your own life both in and outside of work, and just try to stay away from the co-worker in question if they bother you."
    },
    {
      "title": "Create situations that make it difficult for your coworker to continue.",
      "content": "Create situations that make it difficult for your coworker to continue. Before resorting to blatant sabotage, help an incompetent co-worker sabotage themselves. If this person is consistently late to work, extend an invitation to a late night outing on a work night. Separately arrange a meeting for early the next morning with your supervisor, telling them that your coworker will be there. Show up bright-eyed and ready to work, acting confused as to why your coworker wouldn't show up for the meeting. If your coworker has an issue with cursing in front of customers, invite your religious grandfather to bring a group of his church friends past when your coworker is working. Let them complain to the manager instead."
    },
    {
      "title": "Consider creative alternatives.",
      "content": "Consider creative alternatives. Sometimes you just want to get rid of somebody. Time to channel your inner Jim Halpert and bring out the nukes. Be extremely careful if you attempt to manipulate things to try to get someone fired, or you could be the one who ends up getting sacked. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Order adult products to your coworker's work address, but leave off the suite number so that the delivery person has to make a big deal of searching for it. Hop on your coworker's computer and send mean, but believable emails to your boss. Change their computer desktop to video games while they're away. Tell your boss you want to meet with them at your coworker's desk right at the beginning of the day, before they've gotten the chance to notice it."
    },
    {
      "title": "Help them.",
      "content": "Help them. While it may be your first reaction to want to get your coworker straight-up canned, any scenario in which they leave the job is good for you. Maybe that means recommending them for a new job you think they'll be attracted to, or continually talking to them about how bad the job is, convincing them to quit. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If they think they're acting in their own best interest, you're doing everyone a favor. To fire an employee professionally and compassionately, Simmons says the company should have an assessment of their performance. Then inform the employee that they are not meeting certain standards and try to find out why they are not doing it. Simmons suggests putting the employee on a development plan and seeing if they can improve. If they prove unfit even after that, Simmons says the company can assess their skills and help them get a job in another company."
    }
  ]
}