{
  "url": "https://www.wikihow.com/Curl-Wet-Hair",
  "title": "How to Curl Wet Hair",
  "steps": [
    {
      "title": "Use a wide-toothed comb to detangle your hair.",
      "content": "Use a wide-toothed comb to detangle your hair. Detangling your hair makes it easier to braid and will get you neater results. Be gentle with the comb, as wet hair can be breakable."
    },
    {
      "title": "Tie your hair into ponytails.",
      "content": "Tie your hair into ponytails. Part your hair down the middle and tie a ponytail on each side. Use an elastic band to hold each ponytail in place. For tighter curls, make four or even six ponytails. For loose curls, you can make a single ponytail."
    },
    {
      "title": "Braid your ponytails.",
      "content": "Braid your ponytails. To make a ponytail into a braid , start by separating it into three sections. Keep a firm hold on each section and work outward, beginning near the head. Alternately cross the right section over the middle section, and then the left over the middle, and so on until you reach the end. Tie the end of each braid with an elastic band. You can also wind the ponytails into buns instead of braids. As with the braids, tie your hair into more buns for tighter curls."
    },
    {
      "title": "Let your braids set for at least 4-5 hours.",
      "content": "Let your braids set for at least 4-5 hours. Wear your braids out and about, or let them dry overnight. Once your hair is dry, untie the elastic bands, gently loosen your braids and shake out your curls. How long you wait for your braids to set will depend on your hair's density. If your hair is thicker, for example, you'll likely have to wait longer than if your hair is on the thinner side."
    },
    {
      "title": "Comb your damp hair with a wide-toothed comb.",
      "content": "Comb your damp hair with a wide-toothed comb. Gently pull the comb through your hair to remove any tangles. Detangling your hair before curling will leave you with neater curls. Since wet hair can break if you comb it too roughly, be sure to work slowly and smoothly."
    },
    {
      "title": "Slide an elastic headband over your hair.",
      "content": "Slide an elastic headband over your hair. The headband should go all the way around your head and across your forehead. Place the headband however high you want your curls to start."
    },
    {
      "title": "Loop a section of hair through the headband.",
      "content": "Loop a section of hair through the headband. Starting on one side of your face, take a section of hair as wide as you want the curl to be. Loop the hair up and over the headband, pull it through, and continue until you reach the end of the hair. Tuck the end into the headband or pin it in place."
    },
    {
      "title": "Continue looping your hair around the headband.",
      "content": "Continue looping your hair around the headband. Keep taking sections of the same size and looping them around the headband. Once you reach the back of your head, start again from the other side of your face to ensure you get a symmetrical look. [1] X Research source"
    },
    {
      "title": "Let your hair dry for at least 4-5 hours.",
      "content": "Let your hair dry for at least 4-5 hours. You can also sleep with the headband on to let your curls set overnight. The longer you let your hair dry, the stronger the curls will set. Once your hair is dry, simply remove any bobby pins, gently unwind your hair, and save the headband for next time."
    },
    {
      "title": "Get a set of wet-set hair rollers.",
      "content": "Get a set of wet-set hair rollers. While hair rollers can be a trickier option, they are a reliable and time-tested method for hair curling. Make sure you get wet-set rollers, as some rollers aren't made for wet hair. Rollers come in many different shapes and sizes -- for different shapes and sizes of curls -- so you may want to try a few varieties until you find your preference. [2] X Research source Just check the packaging to make sure they're appropriate for damp hair. For a DIY alternative, take an old t-shirt or pillowcase and cut it into strips. The strips should be about as wide as you want your curls, and a little longer than your hair. Use the strips as curlers and secure them by tying the ends. Another simple alternative is to curl the hair with your fingers and secure the curls with bobby pins or hair clips. [3] X Research source"
    },
    {
      "title": "Choose soft rollers if you plan to leave them in overnight.",
      "content": "Choose soft rollers if you plan to leave them in overnight. Letting your curls set while you sleep is a fine alternative to wearing rollers as you go about your daily business. In order to sleep comfortably in a natural position, however, choose rollers made from a soft material like foam or silicone."
    },
    {
      "title": "Detangle your hair with a wide-toothed comb.",
      "content": "Detangle your hair with a wide-toothed comb. Gently pull a wide-toothed comb through your hair to detangle your hair for neater curls. Your hair should be damp but not soaking wet, especially if you are using foam rollers."
    },
    {
      "title": "Use the rollers to curl one section of hair at a time.",
      "content": "Use the rollers to curl one section of hair at a time. Take a lock of hair, about the width of your roller, from above your forehead. Hold this hair out in front of you and lay the roller horizontally at the end of the hair. Roll your hair all the way up to your scalp, or just as far as you want your curls to go, and secure the roller. Repeat this across the top of your head, and then proceed with the sides and back. For the sides of your hair, try rolling over for bouncy curls, or under for volume. You can roll the back horizontally like the other sections or roll it vertically for a corkscrew effect."
    },
    {
      "title": "Let your curls set overnight or for at least 4-5 hours.",
      "content": "Let your curls set overnight or for at least 4-5 hours. Sleeping with your hair rollers in is a great option, especially if you would feel silly wearing them throughout the day. Softer rollers, such as those made of silicone or foam, will make for a more comfortable night's sleep."
    },
    {
      "title": "Remove the rollers.",
      "content": "Remove the rollers. Once your hair is dry, unfasten the rollers and gently take them out. For a finishing touch, use your fingers to fan or fluff out your curls. Don't use a hairbrush, or you could lose your curls. [4] X Research source"
    }
  ]
}