{
  "url": "https://www.wikihow.com/Do-Headband-Curls",
  "title": "How to Do Headband Curls",
  "steps": [
    {
      "title": "Brush your hair.",
      "content": "Brush your hair. Before you dive into making your headband curls, brush or comb your hair to remove knots. Brush or comb the tips of your hair, then hold the brush an inch or so higher and brush down through your hair. Keep working your way up your head, brushing in downward motions, until you reach the top of your head. Having knotted hair will make doing this hairstyle harder, and it will make your curls less defined. Always brush your hair from the bottom up. This will prevent your hair from breaking. If you encounter a knot, don’t yank your brush or comb through it. Instead, gently brush the knot in short, soft motions until it is untangled."
    },
    {
      "title": "Dampen your hair.",
      "content": "Dampen your hair. Headband curls are the most effective on slightly damp hair because your hair will dry into the shape of the curls. If your hair is dry, dampen your hair by holding your hair under the faucet for a few seconds. You can also spray your hair with a spray bottle of water. If you are trying this hairstyle after a shower, wait until your hair is mostly dry. Don’t soak your hair; aim to make it damp as opposed to wet. [1] X Research source"
    },
    {
      "title": "Add product to your hair.",
      "content": "Add product to your hair. Adding curling cream or mousse to your hair makes it slightly damper and also gives it more texture. This texture allows the curl pattern to hold better and last longer. If you already have thick, textured hair then you may not need to add product. If you have smooth, somewhat slippery hair, adding product can improve the look of your curls. [2] X Research source To apply product, place about a dime-sized amount in your palm and work it through your hair, starting at the ends and applying it up through your hair."
    },
    {
      "title": "Put on the headband.",
      "content": "Put on the headband. Once you have dampened your hair and applied product, it’s time to put on the headband and start making the curls. Take an elastic hairband and place it “hippy style” on your head, wearing the headband over your hair like a crown so that the band runs diagonally over your forehead. [3] X Research source Use a comfortable, circular headband. It should wrap all the way around your head. Don't use one that is too tight, since you’ll be wearing this for an hour at least and possibly all night. Try to use an elastic headband that is around the width of two fingers."
    },
    {
      "title": "Loop a small section of hair through the headband.",
      "content": "Loop a small section of hair through the headband. Once you have put on the headband, it’s time to start looping your hair! Begin by taking a small strand of hair that is framing your face, either from the left- or right-hand side of your face. The strand should about the width of two fingers. Lift the strand up so that it is pulled over the headband, then loop the strand under the headband to make one complete loop. [4] X Research source"
    },
    {
      "title": "Add hair to the strand.",
      "content": "Add hair to the strand. Once you create the first loop over and under the headband, take another small piece of hair right next to the one you just looped and combine the two strands into one. [5] X Research source"
    },
    {
      "title": "Do another loop with the combined strands.",
      "content": "Do another loop with the combined strands. Once you have combined the strands, use the section of hair to make another loop over and under the headband next to the first loop. [6] X Research source"
    },
    {
      "title": "Loop your hair until you reach the back of your head.",
      "content": "Loop your hair until you reach the back of your head. Keep adding and looping to the section of hair you are using until you get near the back of your head, behind your ear. [7] X Research source"
    },
    {
      "title": "Repeat the process of making loops on the other side.",
      "content": "Repeat the process of making loops on the other side. Repeat the process of looping your hair, this time starting on the opposite side and working back to create loops. Stop when you reach the back of your head. [8] X Research source Your hair should now be rolled around the headband on both sides of your head, with a small portion of hair hanging down in the back."
    },
    {
      "title": "Take the back section and loop it around the headband.",
      "content": "Take the back section and loop it around the headband. Take the entire section of hair that is hanging down at the back of your head and loop it under the headband as you did with the other hair. Because there is no other hair to combine it with, simply keep looping the hair around the headband until your reach the tips of the hair, then tuck the tips under the headband. [9] X Research source"
    },
    {
      "title": "Pin your hair to secure it.",
      "content": "Pin your hair to secure it. If you are going to sleep with your headband curls, it’s a good idea to secure your hair with pins. Place a few bobby pins or hair clips to pin the loops to the part of your hair above the crown of loops. For extra protection at night, wrap a scarf around your hair so that your curls are completely covered."
    },
    {
      "title": "Spray your head with hairspray.",
      "content": "Spray your head with hairspray. Once you have added clips, give your hair a quick spritz all over with hairspray. Using hairspray will help your hair hold the curl pattern once you take it down. [10] X Research source"
    },
    {
      "title": "Keep your hair looped for at least one hour.",
      "content": "Keep your hair looped for at least one hour. Once you spray your hair with hairspray, most of your work to create this hairstyle is complete! Wait anywhere from one hour to overnight to take down your curls. The longer you wait, the tighter the curls will be, and the longer the staying power they will have. [11] X Research source"
    },
    {
      "title": "Remove the headband.",
      "content": "Remove the headband. Whenever you are ready to complete the hairstyle, slowly begin to take the pins from your hair, unloop the strands of hair from the headband and pull the headband away. Your hair should be curly and voluminous! [12] X Research source"
    },
    {
      "title": "Shake out and style your curls.",
      "content": "Shake out and style your curls. Once you remove the headband, it may take a little bit more work to get your hair exactly as you want it. Shake out your hair and use your hands fluff it up a little bit and let it fall naturally. If you feel like you want more relaxed curls, rake your fingers through your hair to loosen them. Keep your hair down, clip part of it up, or style it as you please! [13] X Research source When you are satisfied with your hair, give your head another spritz of hairspray and enjoy your beautiful curls!"
    }
  ]
}