{
  "url": "https://www.wikihow.com/Define-Muscles",
  "title": "How to Define Muscles",
  "steps": [
    {
      "title": "Use high-intensity interval training (HIIT) for the best fat-burning results.",
      "content": "Use high-intensity interval training (HIIT) for the best fat-burning results. With Tabata training, aerobics, or a fitness boot camp, you push your body to maximum speed for 1 to 4 minutes and then rest for 1 to 4 minutes. HIIT workouts increase your metabolic rate, which will cause your body to burn fat more quickly. [2] X Research source [3] X Research source If you have limited time to work out, Tabata may give you the best bang for your buck. These high-intensity workouts can vastly improve your cardiovascular strength and maintain overall fitness in as little as 10 minutes a day. However, these are advanced workouts that you shouldn't attempt if you are a beginner, and they may not do much in terms of specifically increasing your muscle tone and definition. Boot camp workouts use simple moves and often are designed for beginner- and intermediate-level exercisers. You typically can find boot camps or other HIIT training programs at your local gym or fitness center."
    },
    {
      "title": "Work out for at least 30 minutes.",
      "content": "Work out for at least 30 minutes. [4] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. Most bodies use carbohydrate stores exclusively for the first 15 to 20 minutes of moderate-intensity exercise. If you keep going after that point, your body will start burning fat. [5] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Aerobic activity for at least 40 minutes at moderate to vigorous intensity has the added benefit of lowering your blood pressure and cholesterol, in addition to overall cardiovascular health benefits. Not only will you have lower body fat and more defined muscles, but you'll also be at lesser risk for heart attack or stroke. Good fat-burning cardio exercise can be as simple as jogging on the treadmill (or outside, if the weather's nice). If you need more variety, check out aerobics classes at your local gym or fitness center."
    },
    {
      "title": "Do cardio exercises 5 to 6 days each week.",
      "content": "Do cardio exercises 5 to 6 days each week. While strength training builds muscle, cardio sessions focus on burning fat. Using cardio and strength training together is the best way to achieve maximum muscle tone and definition. [6] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source How you combine your cardio and strength training will depend on your needs and your schedule. For example, it might be easier for you to get your cardio in by going for a run early in the morning, and then doing your strength training after work. Another option is to plan your training sessions for an hour, and alternate between cardio and strength training in 15-minute intervals."
    },
    {
      "title": "Extend cardio sessions on days you aren't strength training.",
      "content": "Extend cardio sessions on days you aren't strength training. Consider doing 45 to 60 minutes instead of 30 minutes to lose more fat and define your muscles; however, overtraining can be very hard on your body, so take 1 to 2 days of rest each week. [7] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Doubling up on your cardio ensures that you're still exercising for the same amount of time and at the same hours each day. You might also consider doing yoga on your off days to replace your regular weight training. While yoga will work your muscles, it's generally not considered as intense as weight training, so a light routine would be appropriate for your rest days."
    },
    {
      "title": "Strength train for at least 30 minutes 3 or 4 days each week.",
      "content": "Strength train for at least 30 minutes 3 or 4 days each week. You won't build muscle definition if you only strength train for 15 or 20 minutes once or twice a week. To get the tone you want, you must make a commitment to hit the gym on a more frequent basis. [8] X Research source Build a strength-training routine of moderate- to vigorous-intensity, depending on your level of experience. You can do the research and set up a routine on your own, but the easiest way to create your routine is to schedule a session with a certified personal trainer. They can not only advise you on exercises to do that will meet your goals, but also critique your form and technique. Typically, you'll get best results by focusing on your upper body the first day, your lower body the second day, and your core the third day. If you're strength training on a four day rotation, split your core over each of the 4 days and do 2 upper-body days and 2 lower-body days."
    },
    {
      "title": "Take 36 to 48 hours of rest between strength-training sessions.",
      "content": "Take 36 to 48 hours of rest between strength-training sessions. If you are doing your exercises correctly, you will tear a lot of muscle fibers. Your body needs time to repair your muscles and rebuild them so they are stronger. [9] X Research source Allow enough time for rest by rotating the muscle groups you work each day. For example, you might do upper body 1 day, lower body the next day, You typically can do core strengthening exercises with only 24 hours of rest before the next strength-training session. Adequate rest also means getting adequate sleep . Your body is rebuilding muscle while you sleep, so make sure you get between 7 and 9 hours of restful sleep each night."
    },
    {
      "title": "Choose the right weight amount.",
      "content": "Choose the right weight amount. You should be strength training with a weight heavy enough that you can only complete an exercise with correct form for 12 to 15 repetitions. The argument used to be that you used heavier weights to gain mass and did higher repetitions with lighter weights for tone and definition; however, modern training suggests there is a happy medium. [10] X Research source This plan can work well if you only have fewer days per week that you can devote to strength training. Combining bulk or power training with high-rep strength training also can work well to get you the definition you want. For example, you might do a heavy, power upper-body strength training session on day one. The next day, do a similarly heavy lower-body strength training session. Take a day off, then do an upper-body strength training session with lower weights at higher repetitions. Follow up the next day with a similar lower-body session."
    },
    {
      "title": "Focus on good form and technique.",
      "content": "Focus on good form and technique. Move slowly through the pushing and pulling motions, emphasizing quality over quantity. Especially if you're just starting, don't worry about how many reps you can do. Instead, make sure you have solid, consistent technique. [11] X Research source To control your movement correctly, you should lower or release the weight on each repetition at roughly the same speed you raised it. Think in terms of actively lowering (or pulling back) the weight, not simply dropping it. Get a personal trainer or an experienced weight lifter to check and critique your form. Keep in mind that poor technique and sloppy form doesn't just mean your training is less effective, it also puts you at risk for injury."
    },
    {
      "title": "Do supersets, alternating between push and pull motions.",
      "content": "Do supersets, alternating between push and pull motions. Organize your strength-training routine so that you're doing 3 or 4 sets of 12 to 15 repetitions of each exercise. Rest for 30 seconds to 1 minute between each superset. [12] X Research source For example, you might do presses and then follow up with lifts. When you alternate between pushing and pulling motions, you work different parts of the muscle. This gives the portion of the muscle you previously worked a little extra time to recover, so you can take a shorter rest break between sets."
    },
    {
      "title": "Bring your muscles to fatigue.",
      "content": "Bring your muscles to fatigue. When you push your muscles to the max you stimulate hypertrophy, which increases the volume of your muscles. This not only builds muscle mass, but also will improve their definition. [13] X Research source For example, 3 sets of bicep curls, flies and push ups should leave your arms shaking. If they don't, you need to add more weight. Make sure you're doing simple exercises, such as pushups or dumbbell presses, that you can control and complete in good form even when your muscles are exhausted."
    },
    {
      "title": "Work as many muscles together as possible.",
      "content": "Work as many muscles together as possible. Don't work your biceps without working your triceps, shoulders, back, and chest. You won't achieve good resting definition unless your whole body is being worked hard. Ignoring surrounding muscles in favor of the major ones, such as biceps, can lead to muscle imbalances that will significantly increase your risk for injury. Aim to work an entire muscle group with each exercise. If you don't know a lot of different exercises, sign up for a few sessions with a personal trainer. They can help you create a well-rounded workout. Don't just work the muscles you see in the mirror. You may not think about working out your back because you can't see it, but remember that everyone else can! For example, squats are a compound exercise that target several muscles in the lower body and core, including your quads, glutes, and core. You can even add light weights to your squat to further work these muscle groups. Reader Poll: We asked 165 wikiHow readers and 62% of them agreed that the best exercise for defining your muscles is doing squats with added weight . [Take Poll]"
    },
    {
      "title": "Make diet a priority.",
      "content": "Make diet a priority. Trainers often say “abs are made in the kitchen.” Muscle definition requires a body fat percentage below 10 percent, which is almost entirely based on what you eat. Generally, you should eat more protein and lay off foods that are high in fat and simple carbohydrates. [14] X Research source [15] X Research source If you're already a relatively skinny person, you still need to limit your carbs while working on a strength-training program that emphasizes building bulk muscle mass. Instead of eating 3 big meals a day, try to eat 5 or 6 smaller meals, so that you're eating once every 2 to 3 hours. Plan your meals so that 40 percent of your calories are coming from protein, while you limit fats and carbohydrates to 30 percent each. [16] X Expert Source Pete Cerqua Certified Personal Trainer & Nutritionist Expert Interview. 14 May 2020. At least 85 percent of the carbohydrates you eat should come from vegetables, with the rest coming from complex carbohydrates such as fruits, whole grains, nuts, and seeds."
    },
    {
      "title": "Eat or drink a protein-rich snack before and after your workout.",
      "content": "Eat or drink a protein-rich snack before and after your workout. Protein helps rebuild muscle and will help ensure a faster recovery. Try a protein shake, an apple with peanut butter, chicken, nuts, Greek yogurt or cottage cheese. [17] X Research source Ideally, you want to have your snack 30 to 45 minutes before you start your workout. Whole food typically works better for your pre-workout snack. A protein shake may work better post-workout, especially if you find it difficult to eat after an intense workout. Whey protein is one of the best sources of complete protein, because it includes all the essential amino acids you need to rebuild your muscles. You can buy whey protein in powder form and blend it into shakes yourself, or you can buy pre-made protein shakes at grocery or health food stores."
    },
    {
      "title": "Eat ancient grains.",
      "content": "Eat ancient grains. Quinoa, spelt, oat bran, amaranth, and other ancient grains are high in protein and minerals, which may help to promote muscle growth by supplying your body with the necessary nutrition. [18] X Research source Many of these grains can be mixed into salads or sides, or included in a breakfast bowl. You also can find bread made from these grains at organic or natural grocery stores."
    },
    {
      "title": "Drink more water before, during and after a workout.",
      "content": "Drink more water before, during and after a workout. Dehydration decreases your performance and can put you at risk for injury, as well as make recovery more difficult. While strength training, you shouldn't lose more than 2 percent of your body weight in fluid. [19] X Research source To get an idea of how much fluid you lose during your workout, weigh yourself before and immediately after your training session. The difference between the 2 weights is the amount of fluid you've lost. For each pound of fluid you lose, you must drink between 20 to 24 fluid ounces (590 to 710 mL) of water to replace it. Replacement of lost water is sufficient to keep you hydrated provided you were hydrated to begin with. To determine this for certain, check your urine. If it's clear, you're well hydrated."
    }
  ]
}