{
  "url": "https://www.wikihow.com/Draw-an-Elephant",
  "title": "How to Draw an Elephant",
  "steps": [
    {
      "title": "Draw a circle and a large oblong attached to it.",
      "content": "Draw a circle and a large oblong attached to it. The oblong should slightly overlap the circle."
    },
    {
      "title": "Draw the elephant’s trunk using curved lines and the ears using a wide inverted C shape.",
      "content": "Draw the elephant’s trunk using curved lines and the ears using a wide inverted C shape."
    },
    {
      "title": "Draw the limbs using a set of parallel lines.",
      "content": "Draw the limbs using a set of parallel lines."
    },
    {
      "title": "Add the eyes using a small circle and the eyebrows using small strokes.",
      "content": "Add the eyes using a small circle and the eyebrows using small strokes. Add a large protruding tooth using a curved line and sketch a few strokes on the upper part of the elephant’s trunk."
    },
    {
      "title": "Draw the whole head and ears using your outline.",
      "content": "Draw the whole head and ears using your outline."
    },
    {
      "title": "Sketch the body and limbs from the outline you have drawn earlier.",
      "content": "Sketch the body and limbs from the outline you have drawn earlier."
    },
    {
      "title": "Add the tail using two curved lines and a few hairs at the ends of the tail.",
      "content": "Add the tail using two curved lines and a few hairs at the ends of the tail. Draw the elephant’s nails using curved lines."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color your drawing.",
      "content": "Color your drawing."
    },
    {
      "title": "Draw three circles interconnected with the other.",
      "content": "Draw three circles interconnected with the other. Connect it with a membrane-like shape."
    },
    {
      "title": "Draw the elephant’s trunk on the first circle and a fan-like shape for the ears.",
      "content": "Draw the elephant’s trunk on the first circle and a fan-like shape for the ears."
    },
    {
      "title": "Draw slanted lines that make up the limbs.",
      "content": "Draw slanted lines that make up the limbs."
    },
    {
      "title": "Draw the eyes using curved strokes.",
      "content": "Draw the eyes using curved strokes. Sketch a protruding tooth just beneath the tusk."
    },
    {
      "title": "Refine the details of the ears and tusk.",
      "content": "Refine the details of the ears and tusk."
    },
    {
      "title": "Draw the whole body based on the outline you have drawn and add the tail.",
      "content": "Draw the whole body based on the outline you have drawn and add the tail. Don’t forget to draw curved lines on each limb for the nails."
    },
    {
      "title": "Sketch short random strokes on the elephant’s body, especially to areas usually covered in shadow.",
      "content": "Sketch short random strokes on the elephant’s body, especially to areas usually covered in shadow."
    },
    {
      "title": "Erase unnecessary lines.",
      "content": "Erase unnecessary lines."
    },
    {
      "title": "Color your drawing.",
      "content": "Color your drawing."
    },
    {
      "title": "Draw a medium-sized circle and add a big oval shape for the head.",
      "content": "Draw a medium-sized circle and add a big oval shape for the head."
    },
    {
      "title": "Draw 2 arcs from the intersect of the circle and oval down and a wavy line at the bottom of the circle for the truck.",
      "content": "Draw 2 arcs from the intersect of the circle and oval down and a wavy line at the bottom of the circle for the truck."
    },
    {
      "title": "Draw the elephant’s trunk and tusks.",
      "content": "Draw the elephant’s trunk and tusks."
    },
    {
      "title": "Draw the ears of the elephant from the upper intersect of the oval and circle.",
      "content": "Draw the ears of the elephant from the upper intersect of the oval and circle."
    },
    {
      "title": "Add the details of the elephant’s face.",
      "content": "Add the details of the elephant’s face."
    },
    {
      "title": "Color your elephant.",
      "content": "Color your elephant."
    },
    {
      "title": "Draw a medium-sized circle and add a big oval shape for the body.",
      "content": "Draw a medium-sized circle and add a big oval shape for the body."
    },
    {
      "title": "Draw 2 pear-shaped ovals from the middle portion of the circle to the oval's mid-portion.",
      "content": "Draw 2 pear-shaped ovals from the middle portion of the circle to the oval's mid-portion. This will be the ears of your elephant. This is ideal for baby elephants."
    },
    {
      "title": "Draw the eye of the elephant in the middle of the circle.",
      "content": "Draw the eye of the elephant in the middle of the circle."
    },
    {
      "title": "Draw the elephant’s trunk and eyebrows.",
      "content": "Draw the elephant’s trunk and eyebrows."
    },
    {
      "title": "Draw the half of the legs using “U” shaped lines to provide a framework.",
      "content": "Draw the half of the legs using “U” shaped lines to provide a framework. The other half of the legs are more of a rounded square."
    },
    {
      "title": "Add details for the legs and draw the legs on the other side using the front leg as a guide.",
      "content": "Add details for the legs and draw the legs on the other side using the front leg as a guide. Add the tail."
    },
    {
      "title": "Trace with a pen and erase unnecessary lines and add small details to your liking.",
      "content": "Trace with a pen and erase unnecessary lines and add small details to your liking."
    },
    {
      "title": "Cartoon elephants can be any color.",
      "content": "Cartoon elephants can be any color. Try out your favorite!"
    }
  ]
}