{
  "url": "https://www.wikihow.com/Cut-a-Sheet-Cake",
  "title": "How to Cut a Sheet Cake",
  "steps": [
    {
      "title": "Determine the size of your cake.",
      "content": "Determine the size of your cake. A true sheet cake is 16 × 24 × 2 in (40.6 × 61.0 × 5.1 cm), but sheet cakes and sheet cake pans can also come in half and quarter sizes. Look on the packaging of your sheet cake or sheet cake pan to determine the cake size. This will let you know how many servings you can get. [1] X Research source"
    },
    {
      "title": "Select your serving size based on the amount of people in attendance.",
      "content": "Select your serving size based on the amount of people in attendance. Sheet cakes easily slice into a few different sizes. Typically, a sheet cake slice is either 1 in × 2 in (2.5 cm × 5.1 cm), 2 in × 2 in (5.1 cm × 5.1 cm), or 2 in × 3 in (5.1 cm × 7.6 cm). Consider the number of guests you want to serve with your cake, and cut it accordingly. Keep in mind that the larger the slices, the fewer servings you will get. [2] X Research source A quarter sheet cake will yield 54, 24, or 18 servings. A half sheet cake will yield 108, 54, or 36 servings. A full sheet cake will yield 192, 96, or 64 servings."
    },
    {
      "title": "Move your cake to a no-slip surface.",
      "content": "Move your cake to a no-slip surface. Move your cake onto a surface with good traction so that it won’t slip when you cut it. Avoid putting your cake directly on smooth tables or counter tops. Instead, lay down a cutting board mat or long dish towel to keep your cake stable. [3] X Research source If your cake came with or was decorated on a cake board, do not remove the board. Instead, move the cake and the board together. If your cake did not come with a cake board, move it to a larger cutting board or cake stand before serving. Do not set your cake directly on your mat or towel. A non-slip mat is a great option to create a surface for cake cutting."
    },
    {
      "title": "Score your cake to create guides before cutting.",
      "content": "Score your cake to create guides before cutting. Before you cut your cake, use a flat spatula or butter knife to score your cake along the top. Lay a ruler along the long side of your cake, and gently press the dull side of your knife or spatula into the top of cake every 2 in (5.1 cm). Then, move your ruler to the width side of your cake, and make marks in 1 in (2.5 cm), 2 in (5.1 cm), or 3 in (7.6 cm) intervals, depending upon the serving size you chose. [4] X Research source Scoring isn’t necessary. It is just a helpful tool to ensure that you get even slices before you cut. If you choose not to score, you will have to eyeball and approximate measurements, and you may not get an even cut. Do not press down too hard. You just want to make a slight indent in the top of your cake or your frosting to give you a guide when you cut. Scoring can be done in advance of your event so that you don’t spend extra time in the kitchen prepping your cake."
    },
    {
      "title": "Choose a long, thin knife.",
      "content": "Choose a long, thin knife. The shape of a sheet cake means that you will need a longer knife to get all the way through. Choose a knife with a long, thin blade. Avoid knives with serrated edges, as these could cause the frosting to become messy. [5] X Research source"
    },
    {
      "title": "Wipe your knife down in between every cut.",
      "content": "Wipe your knife down in between every cut. Between each cut, wipe your knife down with a dish towel or paper towel. This keeps your cuts crisp, and is especially helpful if your cake has frosting. [6] X Research source"
    },
    {
      "title": "Slice vertically along your scoring line.",
      "content": "Slice vertically along your scoring line. Line your blade up along one of your two outermost scoring lines. Press the knife down until it hits the cake board or cutting board. Then, slowly drag your knife down the entire length of your cake. Do not bring your knife back up until you have dragged it all the way out of the cake. Repeat this process along the rest of your vertical scores. [7] X Research source If your knife is long enough to reach across the entire cake, lay the entire blade down along the length of the cake and press the whole blade down into the cake before dragging it out. If your knife is not as long as your cake, starting at the top edge of the cake, press your blade down in at a 45 degree angle until the tip hits the board. Then, gently drag your knife down the length of the cake."
    },
    {
      "title": "Cut individual slices from the horizontal scores.",
      "content": "Cut individual slices from the horizontal scores. After making your first vertical cut, use your horizontal scores to cut individual cake slices. Working from the outer edge of your cake, press your knife down at a 45 degree angle until the tip hits the board. Then, pull your knife toward you until it comes out of the cake. [8] X Research source"
    },
    {
      "title": "Serve your cake.",
      "content": "Serve your cake. Slide the flat of your blade under the bottom of your cake slice and pull the slice away from the rest of the cake. Then, simply slide your slice onto a plate and serve it. Use a fork to help move the cake onto the plate if your slice is particularly stubborn. [9] X Research source"
    },
    {
      "title": "Use flavorless dental floss.",
      "content": "Use flavorless dental floss. Flavored floss could impart an aftertaste on your cake slices. Look for an unflavored variety of dental floss. If you don’t have floss, fishing wire also works wonderfully. [10] X Research source"
    },
    {
      "title": "Cut a length of floss about 4 in (10 cm) longer than your cake.",
      "content": "Cut a length of floss about 4 in (10 cm) longer than your cake. You want your floss to be a little bit longer than your cake so that you have enough to wrap it around your fingers. Cut a length of floss about 4 in (10 cm) longer than your cake. This will leave about 2 in (5.1 cm) on either side to wrap the floss around your fingers."
    },
    {
      "title": "Wrap the floss around your index fingers.",
      "content": "Wrap the floss around your index fingers. Wrap the ends of your floss around your index fingers. Twist the floss over each finger finger two or three times and pull it straight. [11] X Research source"
    },
    {
      "title": "Press the floss down evenly over the length of your cake.",
      "content": "Press the floss down evenly over the length of your cake. Line your floss up with your first vertical scoring line and press your floss down evenly until it reaches the board. Then, unwrap your floss from one finger. Pull the still wrapped finger back away from the cake until the floss is completely free. [12] X Research source Repeat this process for each of your scoring lines."
    },
    {
      "title": "Change your floss between each cut.",
      "content": "Change your floss between each cut. Cut a new length of floss for each scoring line and change it out between every cut. This keeps your cake cuts nice and clean."
    }
  ]
}