{
  "url": "https://www.wikihow.com/Get-Over-Someone-You-Love",
  "title": "How to Get Over Someone You Love: 20 Ways to Move On",
  "steps": [
    {
      "title": "Feel your feelings to start working through your emotions.",
      "content": "Feel your feelings to start working through your emotions. Let your emotions out if you need to. Cry. Bawl your eyes out. Scream into a pillow. Shout obscenities at the wall. During the initial stages of getting over a relationship , you may feel miserable. Accept these feelings in order to truly release them and move on with your life. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Research shows that heartache can present in the brain like actual pain. Studies show heartbroken respondents' brains resemble that of a person on cocaine withdrawal. However, the best route to overcome heartbreak is to ride the emotions out. [2] X Research source Ignoring your feelings only increases the risk of having them explode later on. If you are the sort of person who needs physical release, consider heading to a gym and taking your grief out on a punching bag or human dummy. Reader Poll: We asked 290 wikiHow readers how they manage their feelings after saying goodbye to someone they have romantic feelings for, and 55% of them said that they let themselves express their emotions and cry. [Take Poll]"
    },
    {
      "title": "Uncover your true feelings underneath anger to start healing.",
      "content": "Uncover your true feelings underneath anger to start healing. Part of you might genuinely feel angry. That's fine, but avoid twisting or masking your pain with anger. Anger might make you feel less vulnerable, and it probably makes you feel in control and gives you something to direct your energy towards. However, the only way to work past your grief and accept the current situation is to let yourself feel the other emotions lurking beneath the anger. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Anger is a secondary emotion. The emotions lurking beneath the surface of your anger might be feeling ignored, disappointed, used, unlovable, and rejected. All of these feelings make you feel vulnerable, so you use anger as a method of psychological self-soothing. [4] X Research source To find out what's beneath your anger, listen to your self-talk. If you find yourself thinking, \"No one will ever love me,\" it may symbolize feelings of rejection or being unlovable. Take notice of your thoughts for a day to pinpoint what other emotions you are experiencing. Additionally, anger tends to be obsessive. If you badmouth your ex or crush to your friends or fixate on every little thing that person did to “wrong” you, your thoughts are still constantly filled with that person. In other words, anger will bind you in place instead of letting you move on."
    },
    {
      "title": "Acknowledge this big part of your life to start moving on.",
      "content": "Acknowledge this big part of your life to start moving on. It can be difficult to leave someone you love, especially if they were a part of your life for a long time. Instead of pushing down those feelings, acknowledge to yourself just how much they meant to you and how much they changed your life. If you do this right away, you can start processing your emotions much faster instead of pushing them down and letting them fester. [5] X Research source For instance, maybe you’re going through a breakup, and you and your ex were together for years. While you know it was the right thing to split up, you can still acknowledge how much they changed your life and how different things will be without them."
    },
    {
      "title": "Take care of yourself as you go through this painful process.",
      "content": "Take care of yourself as you go through this painful process. Buy yourself a box of chocolates or snack on ice cream straight from the tub. Purchase that designer handbag or new gadget you've had your eye on for months. Visit the spa or take yourself to lunch at the new bistro everyone's been raving about. Since you are going through a tough time, you may need to spoil yourself a little to lift your spirits, and that's okay. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source People frequently crave comfort foods when they are not feeling so great. Research shows that mindful indulgences are usually harmless as long as you are not overindulging or neglecting your health. [7] X Research source That said, set limits for yourself. Indulge yourself, but stick to your means and avoid unhealthy behaviors that are destructive rather than nurturing."
    },
    {
      "title": "Relieve stress and painful memories with your favorite songs.",
      "content": "Relieve stress and painful memories with your favorite songs. You may get the urge to listen to break-up music. Contrary to popular belief, listening to sad music will not make you feel worse. Such music can actually help you to feel like someone somewhere shares your pain, and that you're not alone in what you're feeling. Plus, if you cry and sing along, you will have expressed your emotions in a healthy way. When you're done you'll find yourself feeling better for it. [8] X Research source Listening to music is scientifically known to have therapeutic effects. It can lower your heart rate and relieve stress. [9] X Research source"
    },
    {
      "title": "Embrace any numbness that happens to give yourself a rest.",
      "content": "Embrace any numbness that happens to give yourself a rest. Eventually, after you cry yourself out, you might feel a little numb or “dead inside.” Don’t be alarmed. This is a perfectly natural response for many people. [10] X Research source Oftentimes, this feeling of numbness results from pure exhaustion. Crying and other forms of high-energy emotion can be mentally and physically draining. As a result, after you finish these cycles of emotion, you might feel too tired to feel anything else."
    },
    {
      "title": "Ask your loved ones to support you while you go through a tough time.",
      "content": "Ask your loved ones to support you while you go through a tough time. The caring shoulder of a close friend or family member is a valuable tool to rely on. Sometimes talking about your feelings is a good way to air them out and move on. A friend can help you recognize that what you're feeling is normal. Plus, getting your frustrations out into the open might help you better understand and resolve them. Reach out to friends and family members for advice or simply just to vent. [11] X Research source Any friend willing to listen can help a little. Venting your emotions can be just as important as fixing the matter at hand."
    },
    {
      "title": "Put your thoughts onto paper for a safe space to think things through.",
      "content": "Put your thoughts onto paper for a safe space to think things through. If you want to give your friends a break or do not have any you feel comfortable enough to talk to, write your feelings down instead. This practice can also help you release and vent your bottled-up feelings. The mental health benefits of journaling are many. It helps you to clarify your thoughts and feelings, understand yourself better, minimize stress, problem-solve, and resolve disagreements (by writing about them from another's point-of-view). [12] X Research source Use your journal to confess to feelings or events you do not feel brave enough to confess to other people."
    },
    {
      "title": "Give yourself a timeline to help you move past it.",
      "content": "Give yourself a timeline to help you move past it. While you must let yourself be sad, you also need to understand that there is a certain point at which it is in your best interest to force yourself to move on. It’s not healthy to allow broken relationships to deter you from growing and thriving in other areas of life. Take time for yourself, but don't hesitate to get back out there and live your life abundantly. [13] X Research source Set a date or general time frame beforehand. Give yourself about half the amount of time you spent in a relationship with your ex or pining after your crush. During this time, mope as much as you need. Afterward, push yourself forward, even if you still feel like moping."
    },
    {
      "title": "Go no-contact",
      "content": "Go no-contact to give yourself space to heal. This means no calling, no emailing, and no “accidentally” bumping into the person in question while they happen to be on a daily morning run. If you want to get over someone, you need to put enough distance between the two of you to give yourself a chance to heal. [14] X Research source Of course, this can be difficult if you work with or have a class with the other person. In this case, the best thing to do is limit your interactions to those only absolutely essential to your daily life. Don’t go out of your way to avoid the person you want to get over, but don’t purposefully seek that person out either."
    },
    {
      "title": "Do a digital detox so you aren’t tempted to snoop.",
      "content": "Do a digital detox so you aren’t tempted to snoop. Stop checking their Facebook, Twitter, blog, Pinterest, or any other social media account associated with that person. Fixating on how the other person is doing at the moment will only make it harder for you to move on with your life. [15] X Research source If you can’t resist the temptation to stalk your obsession's social media accounts while still remaining friends or followers, unfriend or unfollow the person in question. If that person once gave you access to their passwords, ask that person to change passwords in order to remove the temptation from you to snoop or stalk."
    },
    {
      "title": "Get rid of mementos so you can focus on the future.",
      "content": "Get rid of mementos so you can focus on the future. Even if you cut ties and avoid communicating directly with the person you want to get over, you might still have a hard time forgetting someone and moving on if your room is filled with reminders of that person. Gather up photos, notes, and mementos, and put them into storage where you don’t have to see them all the time. [16] X Research source Usually, the best thing to do is to pack up any reminders and put them away until you have had enough chance to move on. Or, return certain belongings to the other person—CDs, movies, etc.—instead of ditching them. Avoid throwing things out or dramatically setting fire to these painful reminders in an effort to free yourself, no matter how desperate you are to get over someone. Once something is gone, it's gone for good. If you regret the decision to throw out that expensive watch or burn up a poster autographed by a favorite singer you saw in concert with your ex, you might regret it later."
    },
    {
      "title": "Get out of the house so you don’t go stir-crazy.",
      "content": "Get out of the house so you don’t go stir-crazy. Take a walk. Go on a trip. Venture out into the great unknown, or even venture into the slightly less impressive known. The point is that you will need to get out of bed and physically move on with your life, no matter how much you wish you could spend another day lying around and watching sad movies. [17] X Research source Get active. Physical activity is one of the best things you can become engaged in while making an effort to get over someone. In contrast, lazing around on the couch day after day can make you feel resentful of yourself."
    },
    {
      "title": "Let your friends distract you when you’re feeling down.",
      "content": "Let your friends distract you when you’re feeling down. Friends can be a great help in getting over someone, even if you have a hard time crying on their shoulders. When you need to feel appreciated and distracted, a night on the town with some close friends can be the perfect prescription. [18] X Research source Your friends might appreciate this, too, especially if you spent a lot of time neglecting them while in your relationship or chasing after your crush. Avoid letting your friends push you into new romances before you feel ready, though."
    },
    {
      "title": "Focus on making new connections to fill your social life.",
      "content": "Focus on making new connections to fill your social life. This can seem tremendously difficult, but it can also have a huge impact on how thoroughly you recover. By meeting new people, you allow yourself to see that there are others who may come to appreciate and love you. Similarly, you might also realize that there really are other fish in the sea. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Join a club or hobby group, chat with people while you’re out and about, or approach coworkers and ask them to hang out to meet new people . New friends work just as well as new love interests. If anything, sometimes, new friends can be even better since it relieves the pressure of romantic tension and allows you to avoid the dreaded rebound."
    },
    {
      "title": "Practice self-love to improve your self-esteem.",
      "content": "Practice self-love to improve your self-esteem. Above all else, realize that you are worthy of being loved, no matter what anybody else may think or feel. Create a list of things you love about yourself: your smile, your witty comments, your passion for books, etc. Make sure you are nurturing the parts of yourself you love the most whenever you decide to enter a new relationship. [20] X Research source Take time to do things you enjoy, especially if you did fewer of these things while you were with your ex or trying to impress your crush. Avoid shouldering all the blame. Understand that things just were not meant to be. It doesn't mean that it was your fault or that you are somehow unworthy of being loved."
    },
    {
      "title": "Give yourself time to heal so you don’t rush into a bad relationship.",
      "content": "Give yourself time to heal so you don’t rush into a bad relationship. Never force yourself back out on the dating scene. Simply put, when you're ready, you're ready. Take it one day at a time and trust yourself to know when you feel ready to love someone in that way again. [21] X Research source Pushing yourself into a rebound relationship or one-night stand may only make you feel worse, especially when you realize that you gave away that sort of intimacy to someone you really were not all that fond of. There’s no set timeline for moving on , and everyone is different. You’ll know when you’re ready."
    },
    {
      "title": "Approach them again once you’ve moved on.",
      "content": "Approach them again once you’ve moved on. Contrary to what you might think, being friends with someone you once had feelings for is possible. If friendship proves impossible, then at the very least, you might be able to reestablish enough mutual respect so that the two of you can be in the same room together without shooting daggers from your eyes. [22] X Research source Don’t push yourself to reconcile. If you can’t get over the hurt and reconciling makes things too difficult, you do not need to go through with it. Only begin the process after you have already accepted the way things are and no longer have any romantic attachment to the person in question. Relationship experts suggest that you allow the grieving process to commence and take time away from one another. Then, sit down and have a candid conversation about how your friendship will work. Limit your efforts. Extend the hand of friendship once. If it gets slapped away, accept that reconciliation is out of the question, and move on."
    },
    {
      "title": "Avoid being intimate with this person to protect your feelings.",
      "content": "Avoid being intimate with this person to protect your feelings. This refers to both physical and emotional intimacy. Being with this person makes you comfortable, and may even be convenient. However, continuing to become emotionally intertwined with an ex is not a good idea, because you will have to go through the grieving process all over again after the intimacy is done. [23] X Research source Do not sleep with an ex “for old times' sake” or fall into the trap of becoming “friends with benefits” with a crush. Literally \"getting over\" someone you want to get over is a bad idea for both sexes, but it can be especially awful for women. Physical intimacy causes women to produce oxytocin, a hormone that triggers feelings of connection and affection. As a result, you will not be able to “get it out of your system.” If anything, you will only feel more bonded to the other person than before. Emotional intimacy can be just as risky, even if the two of you were emotionally intimate before. This sort of connection runs on a deeper level, making it even harder to separate yourself from the person in question."
    },
    {
      "title": "A therapist will help you work through your emotions.",
      "content": "A therapist will help you work through your emotions. Sometimes, handling a breakup or a lost love is too much to go through on your own. If you’re struggling (or even if you just want someone to talk to), make an appointment with a mental health professional. They will give you coping mechanisms and help you work through your emotions at your own pace. [24] X Research source Don’t have time for in-person therapy? Consider an online counseling service like BetterHelp ."
    }
  ]
}