{
  "url": "https://www.wikihow.com/Correctly-Capitalize-the-Word-wikiHow",
  "title": "How to Correctly Capitalize the Word wikiHow",
  "steps": [
    {
      "title": "Know how to spell the word wikiHow.",
      "content": "Know how to spell the word wikiHow . Before you add any capitalized letters, you need to know how to spell the word. Without capitalization, the word is spelled as w-i-k-i-h-o-w (wi-kee-how) Note that the word begins with a w rather than two of the letter v ."
    },
    {
      "title": "Note that wikiHow is a proper noun.",
      "content": "Note that wikiHow is a proper noun. At least one letter of those proper nouns should be capitalized. Most proper nouns would require the first letter of the word be capitalized. Some proper nouns require more than one capital letter, like the word McDonald . A few very rare proper nouns do not capitalize the first letter of the word. That includes the word wikiHow ."
    },
    {
      "title": "Capitalize the h in the word, but not w.",
      "content": "Capitalize the h in the word, but not w . Whenever you write the word, capitalize the h . However, do not capitalize the w in any circumstances. Even when the word starts the sentence, the w remains a lowercase letter."
    },
    {
      "title": "Do not capitalize the first letter of the word wikiHow if it begins a sentence.",
      "content": "Do not capitalize the first letter of the word wikiHow if it begins a sentence. This word is a bit of an odd one. It cannot have the w capitalized, even it starts a sentence. However, the h gets capitalized."
    },
    {
      "title": "Do not capitalize the first letter if the word starts a direct quotation.",
      "content": "Do not capitalize the first letter if the word starts a direct quotation. You cannot capitalize the first letter of it when the word wikiHow starts a direct quotation. That is just like when you cannot capitalize it when it starts a sentence. The h gets capitalized all the time, though. In other words, you cannot capitalize the w but must capitalize the h in any time."
    }
  ]
}