{
  "url": "https://www.wikihow.com/Filter-Water",
  "title": "How to Filter Water",
  "steps": [
    {
      "title": "Find out which contaminants are in your water.",
      "content": "Find out which contaminants are in your water. If you live in or near a large U.S. city, look it up on the Environmental Working Group database. Otherwise, you may need to contact your water utility and ask for a water quality report, or ask a local environmental group focused on water issues."
    },
    {
      "title": "Choose a type of filter.",
      "content": "Choose a type of filter. Once you know the specific chemicals you are trying to filter out, you can read the packaging or online descriptions of water filter products to see whether they are removed. Alternatively, narrow down your options using these tips: Charcoal (or \"carbon\") filters are cheap and widely available. They will filter out most organic contaminants, including lead, mercury, and asbestos. Reverse osmosis filters remove inorganic contaminants such as arsenic and nitrates. They are extremely water-inefficient, so use only if you know the water is contaminated with a chemical carbon does not filter out. De-ionizing filters (or ion exchange filters) remove minerals, turning hard water into soft water. They do not remove contaminants."
    },
    {
      "title": "Select an installation type.",
      "content": "Select an installation type. There are many types of water filters on the market, designed to accommodate a variety of needs. Here are the most common options for home use: A pitcher water filter. These are convenient for households with low water use, as you can fill the pitcher once or twice a day and keep it cool in the refrigerator. A faucet-mounted filter is convenient if you want to filter all your tap water, but can slow down flow rate. On-counter or under-sink water filters required plumbing modifications, but generally use longer-lasting filters, and thus require less maintenance. Install a whole-house water filter if your water is severely contaminated and unsafe even for bathing."
    },
    {
      "title": "Set up the filter according to the manufacturer's instructions.",
      "content": "Set up the filter according to the manufacturer's instructions. Each filter should come with a set of instructions showing you how to set it up so that it works correctly. In most cases assembly is quite simple, but if you have trouble putting it together, call the manufacturer for help."
    },
    {
      "title": "Run water through the filter.",
      "content": "Run water through the filter. Take cold water and pass it through the filter. In most cases the water is poured into the top of the filter; it then makes its way down through the filter mechanism, where impurities are removed. The clean water streams into the bottom of the bottle or pitcher, or out of the bottom of the faucet, depending on what type of filter you have. Do not submerge the filter while running water through it. Water that backs up into the filter may not be purified. Some filters are damaged by hot water; check the manufacturer's instructions."
    },
    {
      "title": "Change the filter cartridge as recommended.",
      "content": "Change the filter cartridge as recommended. After a few months of use, a carbon water filter becomes clogged and stops working as well to purify water. Buy a new filter cartridge from the same manufacturer that made the water filter. Remove the old cartridge and discard it, then replace it with the new one. Some water filters last longer than others. Check the instructions that came with your product for a more detailed time frame, or contact the manufacturer."
    },
    {
      "title": "Gather supplies.",
      "content": "Gather supplies. Homemade ceramic filters work by filtering water through a layer of porous ceramic. The holes are small enough to filter out contaminants, but large enough to let water pass through into a container. To make a ceramic water filter, you'll need the following equipment: A ceramic filter element. You can buy a candle filter or a pot filter for this purpose. The filters are available online or at hardware stores. Be sure to choose one that meets or exceeds National Safety Foundation standards, which specify what percentage of impurities must be filtered out of the water in order for it to be drinkable. Two food-grade buckets. One bucket is used as a receptacle for the impure water, and the second bucket is for the purified water. Food-grade buckets are available from restaurant supply stores, or you may be able to obtain used buckets from a restaurant in your area. A spigot. This is attached to the bottom bucket to access the purified water."
    },
    {
      "title": "Drill holes in the buckets.",
      "content": "Drill holes in the buckets. In total, you'll need to drill 3 holes: one in the bottom of the top bucket, one in the lid of the bottom bucket, and a third hole in the side of the bottom bucket (for the spigot). Start by drilling a 1/2-inch hole in center of the bottom of the top bucket. Drill a second 1/2-inch hole in the center of the lid of the bottom bucket. This hole should align exactly with the hole in the first bucket. The water will pass from the first bucket through the filter and drip into the second bucket. Drill a 3/4-inch hole in the side of the bottom bucket. This is where the spigot will be attached, so it should be just an inch or two from the bottom of the bucket."
    },
    {
      "title": "Install the spigot.",
      "content": "Install the spigot. Following the installation instructions that came with your spigot, place the back of the spigot into the hole you drilled in the bottom bucket. Tighten it from the inside and make sure it's firmly in place."
    },
    {
      "title": "Set up the filter.",
      "content": "Set up the filter. Install the filter element in the hole in the top bucket, so that it sits in the bottom of the bucket with its \"nipple\" poking through the hole. Set the top bucket on the bottom bucket, making sure that the nipple pokes through the hole in the top of the bottom bucket, too. The filter is now installed."
    },
    {
      "title": "Filter water.",
      "content": "Filter water. Pour impure water into the top bucket. It should begin draining through the filter and come out the nipple into the bottom bucket. The filtration process may take a few hours, depending on how much water you're filtering. When a good amount of water has collected in the bottom bucket, use the spigot to transfer some water to a cup. The water is now clean and ready to drink."
    },
    {
      "title": "Clean the water filter.",
      "content": "Clean the water filter. The impurities in the water will collect at the bottom of the top bucket, so this should be cleaned out from time to time. Take the filter apart and use bleach or vinegar to thoroughly clean it every few months, or more often if you use the filter frequently."
    },
    {
      "title": "Consider a physical filter.",
      "content": "Consider a physical filter. \"Pump filters\" may be your cheapest option in this category, but can be slow and tedious. For long trips, look into \"gravity filters,\" which are typically a pair of bags connected by a hose. The bag with the filter is filled with water, then hung up to let the water drain through the filter into the clean bag. This is a fast, convenient option that doesn't require you to carry around a supply of disposable filters. [1] X Research source These filters do not protect against viruses, but they are effective against bacteria. Not all wilderness areas require protection against viruses, however, especially in the US. Check your regional disease control center or a tourist information center for more information on the risks in your region."
    },
    {
      "title": "Learn about chemical disinfection.",
      "content": "Learn about chemical disinfection. Tablets are slow but cheap, and are effective against most bacteria and viruses. Tablets come in two common types: Iodine tablets should be left in the water for at least 30 minutes. They are sometimes sold with a companion tablet for hiding the iodine taste. [2] X Research source Pregnant women and people with thyroid conditions should not use this method, and no one should use it as their main source of water for more than a few weeks. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Chlorine dioxide tablets normally have a 30 minute wait time. Unlike iodine, they are effective in areas contaminated by the bacterium Cryptosporidium – but only if you wait 4 hours before drinking. [4] X Research source"
    },
    {
      "title": "Try UV light treatment.",
      "content": "Try UV light treatment. Ultraviolet light lamps can kill bacteria and viruses, but only if the water is clear and the light is applied for long enough. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Different UV lamps or light pens have different intensities, so follow the manufacturer's instructions."
    },
    {
      "title": "Boil water.",
      "content": "Boil water. This is an extremely effective method of killing pathogens, as long as you let the water boil for at least one minute. It may not be convenient to boil water several times a day, but be aware that you won't need additional filtration if you're already boiling water for your evening meal or morning coffee. At high elevations, boil the water for at least three minutes, since the water will boil at a lower temperature in the thin air. [6] X Research source The high temperature, not the boiling action itself, is responsible for killing bacteria and viruses."
    },
    {
      "title": "Use stainless steel water bottles.",
      "content": "Use stainless steel water bottles. Plastic bottles are only designed to be filled an used once, since the plastic can break down over time, adding potentially harmful chemicals to the water and even harboring bacteria. Even aluminum bottles often have an inner plastic coating, and are not dishwasher safe, making them difficult to clean."
    },
    {
      "title": "Drink straight from the spring source.",
      "content": "Drink straight from the spring source. If you're lucky enough to find a mountain spring bubbling from the rocks, it's usually safe to drink directly from it – but this does not apply even a couple feet (0.6 m) away. [7] X Research source This is not a foolproof rule, and may be dangerous in agricultural regions, areas with historic mining, or lower-elevation areas near population centers."
    },
    {
      "title": "Use a quick filter in an emergency.",
      "content": "Use a quick filter in an emergency. Strain water through a bandana, shirt, or coffee filters to remove visible debris. Let the water sit for at least a few minutes, so the remaining particles settle on the bottom, then pour into another container. If at all possible, boil this water to kill pathogens before drinking. The steps below will teach you to make a more effective filter, but unless you brought along your own charcoal, the process can take several hours."
    },
    {
      "title": "Make charcoal",
      "content": "Make charcoal . Charcoal makes an excellent water filter, and is in fact the material used to filter water in many manufactured filters. You can make your own charcoal in the wild if you are able to build a fire. Built a hot wood fire and let it burn out completely. Cover it with dirt and ashes, and wait at least a few hours before digging it up again. Once it has completely cooled, break up the charred wood into tiny pieces, or even into dust. You've now created your own charcoal. While not as effective as store-bought \"activated charcoal,\" which is not feasible to produce in the wilderness, homemade charcoal should be plenty effective in a filter."
    },
    {
      "title": "Prepare two containers.",
      "content": "Prepare two containers. You'll need a \"top container,\" with a small hole in the bottom for filtering, and a \"bottom container\" to catch the filtered water. Here are a few options: If you have access to a plastic bottle, you can cut it in half and use each half as a container. Poke a hole in the cap to use as a filtration hole. Alternatively, use two buckets will also work, one with a hole cut into the bottom. In a survival situation with little equipment, search for a hollow plant such as bamboo or a fallen log."
    },
    {
      "title": "Use cloth to cover the top container's filtration hole.",
      "content": "Use cloth to cover the top container's filtration hole. Stretch the fabric over the base of the top container. Use enough cloth to completely cover the base, or the charcoal could be washed through."
    },
    {
      "title": "Tightly pack the charcoal over the cloth.",
      "content": "Tightly pack the charcoal over the cloth. Pack the charcoal dust and pieces as tightly as possible over the cloth. For the filter to be effective, all water must drip slowly through the charcoal. If the water runs easily through your filter, you'll need to try again and tightly pack more charcoal into it. You should end up with a thick, tightly packed layer – up to half the container's depth, if you are using a water bottle as your filter."
    },
    {
      "title": "Cover the charcoal with pebbles, sand, and more cloth.",
      "content": "Cover the charcoal with pebbles, sand, and more cloth. If you can spare a second layer of cloth, cover the charcoal tightly to prevent is being stirred up when you pour water into the container. Whether or not you add the cloth, of small pebbles and/or sand are recommended to catch larger debris and keep the charcoal in place. Grass and leaves can also be used, as long as you know they are not poisonous species."
    },
    {
      "title": "Filter water.",
      "content": "Filter water. Place the top container on top of the bottom container, with the pebbles on top and the charcoal on the bottom. Pour water into the top container and watch it drip slowly through the filter, into the bottom container."
    },
    {
      "title": "Repeat until clear.",
      "content": "Repeat until clear. You'll often need to filter water two or three times before all the particles are removed."
    },
    {
      "title": "Boil the water if possible.",
      "content": "Boil the water if possible. The filtering will remove many toxins and odors, but bacteria often bypass the filtering process. Boil the water if possible for additional safety."
    },
    {
      "title": "Change the top materials from time to time.",
      "content": "Change the top materials from time to time. The top layer of sand will contain microbes and other contaminants that are unsafe to drink. After using the water filter a few times, remove the top layer of sand and replace it with clean sand."
    }
  ]
}