{
  "url": "https://www.wikihow.com/Digitally-Scan-35mm-Slides",
  "title": "How to Digitize 35mm Slides",
  "steps": [
    {
      "title": "Let your fingers do the walking.",
      "content": "Let your fingers do the walking. Go to Google.com, and search for \"digitize slides.\" There are a number business that will be happy to do the work for you. If you have a lot of slides, the beauty of a professional slide digitizing house is that they can process them much quicker and generally better than you will be able to on your own. Here are some key points to consider: Price. This can vary dramatically, from $50 for 400 slides, to nearly $100 for 250 slides. Considering the cost of home alternatives—and considering how often you'll be shooting slides in the future—these prices are very reasonable. Delivery. How fast can they turn the job around? Some places will take a couple weeks, others just a couple days, and that may come at a premium. If you want better quality, you can make less of a dent in your wallet if you can afford to wait. Quality. Slide-scanning services can deliver very high quality scans of your slides that will look good even when printed on 8x10 paper. Make sure they have the technology to reduce or remove dust spots, which is very important with these old slides."
    },
    {
      "title": "Do it yourself.",
      "content": "Do it yourself. While scanning companies can generally deliver better quality and make what might be a tedious task go much quicker, there is a certain satisfaction in doing it yourself, as well as other reasons: It could be an opportunity to discard slides that should never have been taken, like that accidental shot of your tennis shoes or that \"artistic\" image of a dog and a fire hydrant. There may be pictures in your slide collection that you simply don't want to share with total strangers."
    },
    {
      "title": "Purchase a slide scanner.",
      "content": "Purchase a slide scanner. In the consumer category, these can range from under $50 to over $200, and generally, more money gets you better quality and easier workflow. Look for these features: Speed. Some slide scanners require you to scan to your computer, one at a time. If it takes 30-60 seconds per slide, plus naming and filing time, it can take a considerable amount of time to process a box of 400 slides. Be prepared to give up a weekend for that. Some of the better slide scanners will scan a slide in just a few seconds, and save it to an SD card. When all your slides are scanned, simply open that card on your desktop, and drag your photos over. Quality. Check out the megapixel number of the scanner you're interested in. They can range from 5 to 9 megapixels. Bigger is better, as they say: the greater the number of pixels, the larger print you can make from your slide. Compatibility. Make sure that the slide scanner either doesn't require any specific software, or if it does, that it runs on your computer configuration. You don't want to sit down at your Mac this weekend for a massive scanning session only to realize that your shiny new scanner will only work on Windows. It will likely mean that you get to do yard work instead. And that, as they say, just doesn't scan."
    },
    {
      "title": "Use what you have.",
      "content": "Use what you have. \"OK,\" you say, \"I have a scanner. Can't I just plop my slide onto the scanner bed, and do it that way? Of course, you can: but the problem is that the slides are very small. You can check to see if there is an adapter available as an accessory to allow you to mount your slides into a mount holder and scan using your flatbed. This should provide you an opportunity to preview and save very easily, if not very quickly. If an adapter is not available you can make one using some household materials (e.g. paper, tape, etc.) see www.abstractconcreteworks.com/essays/scanning/backlighter.html. Scanning on a flatbed has inherent limitations in lighting and resolution, and will not generally give you a similar quality image to a digital photograph nor a professionally scanned slide."
    },
    {
      "title": "Shoot it again, Sam.",
      "content": "Shoot it again, Sam. Set up your projector, screen, and tripod and digitally photograph your image as it is displayed on the screen. If there is a manual focus on your camera, use it to adjust for the distance to ensure the image is as sharp as possible. If your camera permits, try bracketing your image exposure with slower and faster shutter times and a fixed f-stop, and then compositing the picture with image software such as Photoshop. The resolution will still be compromised, but you may have better dynamic range."
    },
    {
      "title": "Using a slide viewer.",
      "content": "Using a slide viewer. Either zoom in or use the macro function of your digital camera to take a picture of the back-lit slide. The peripheral light present around the slide itself may need to be blocked/blacked out. Use some cardstock or paper and place it so that only the slide's image has any visible light behind it. This process typically requires a tripod to make a sharp image."
    },
    {
      "title": "Use a stand.",
      "content": "Use a stand. If your lens permits you to focus within an inch of the lens, use a stand to take a close-up image of the slide. Capture is quick with a click of the camera's shutter. You can test your camera for slide, negative copying at www.shotcopy.com/compatibility.htm and build your own copy stand if you choose."
    }
  ]
}