{
  "url": "https://www.wikihow.com/Find-Unread-Emails-in-Gmail",
  "title": "How to Find & Display Unread Emails in Gmail",
  "steps": [
    {
      "title": "Open Gmail.",
      "content": "Open Gmail. This app icon looks like a red and white envelope that you can find on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this three-line menu icon in the top left corner of your screen."
    },
    {
      "title": "Tap the search bar.",
      "content": "Tap the search bar. Your keyboard will slide up from the bottom of your screen and suggestions will appear below the bar. Tap a suggestion if you want to use it."
    },
    {
      "title": "Type \"is:unread\" and press the ↵ Enter key.",
      "content": "Type \"is:unread\" and press the ↵ Enter key. This will prompt your Gmail to show you every email that is unread. If you want to refine the search, you can enter the label (label:EXAMPLE)."
    },
    {
      "title": "Go to https://gmail.com in a web browser.",
      "content": "Go to https://gmail.com in a web browser. You can use any web browser to set up your Gmail inbox to display unread messages first."
    },
    {
      "title": "Click .",
      "content": "Click . You'll see this gear icon in the upper right corner of the page."
    },
    {
      "title": "Click to select Unread first.",
      "content": "Click to select Unread first . This is nestled under the \"Inbox Type\" header. Your change will automatically save."
    },
    {
      "title": "Click X.",
      "content": "Click X . This icon is in the upper right corner of the Quick settings menu."
    },
    {
      "title": "Go to https://gmail.com in a web browser.",
      "content": "Go to https://gmail.com in a web browser. You can use any web browser to search for unread emails."
    },
    {
      "title": "Click a label on the left.",
      "content": "Click a label on the left. You'll see all your labels next to icons of tags. You can also click All Mail to look at all of your mail."
    },
    {
      "title": "Click inside the search bar.",
      "content": "Click inside the search bar. This is at the top of the page and might contain the label you're inside in \"label:EXAMPLE\" format."
    },
    {
      "title": "Add \"is:unread\" to the search bar.",
      "content": "Add \"is:unread\" to the search bar. After the label, if there is one, you should type \"is:unread\" to find only the emails in that label that are unread. Your search bar might look like this: \"label:EXAMPLE is:unread.\" If you're searching \"All Mail,\" you won't see \"label:EXAMPLE.\" Press Enter or Return when you're ready to see the search results."
    },
    {
      "title": "Open Gmail.",
      "content": "Open Gmail. This app icon looks like a red and white envelope that you can find on one of your Home screens, in the app drawer, or by searching."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this three-line menu icon in the top left corner of your screen."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . This is next to a gear icon that you'll find at the bottom of the menu."
    },
    {
      "title": "Tap to select the Gmail account.",
      "content": "Tap to select the Gmail account. If you have more than one Gmail account that you want to display differently than the default setting, you'll need to repeat this process for each account."
    },
    {
      "title": "Tap Inbox Type.",
      "content": "Tap Inbox Type . You'll see this under the header \"Inbox.\""
    },
    {
      "title": "Tap Unread first.",
      "content": "Tap Unread first . This is usually the third menu option down from the top of the list. Your changes are automatically saved; tap the back arrow to navigate back to your inbox."
    }
  ]
}