{
  "url": "https://www.wikihow.com/Eat-a-Lemon",
  "title": "How to Eat a Lemon",
  "steps": [
    {
      "title": "Peel the lemon.",
      "content": "Peel the lemon. Lemon zest is great as an addition to many dishes, but you don’t want to eat the entire lemon rind raw. To start, take a sharp knife and cut off the top and tail of the lemon. Stand the lemon up on one of those cut sides. With your knife, peel off strips from the lemon until all the skin has been removed. When you're peeling, try to remove as much of the white pith as possible, as this is very bitter. Once you’ve peeled the lemon, go around and remove any leftover pith by peeling it away with your fingers or cutting it off. When possible, eat only Meyer lemons raw. They are sweeter and less acidic than other lemon varieties, and are much more pleasant to eat like this. [1] X Research source"
    },
    {
      "title": "Cut wedges from the lemon.",
      "content": "Cut wedges from the lemon. Insert the tip of your knife in between two wedges of the lemon, cutting to the inside of the membrane that encases the wedge. Cut the full length of the wedge, then move to the other side to separate the second side from the lemon. Remove the wedge of lemon and place it into a bowl. [2] X Research source Always cut to the inside of the membrane, so that the lemon wedge doesn’t have the membrane attached. This part of the lemon is sour and bitter. Repeat until you have removed all the individual wedges from the lemon."
    },
    {
      "title": "Cut the wedges into bites.",
      "content": "Cut the wedges into bites. Cut each lemon wedge in half so you get two bite-sized halves from each wedge. Return the cut wedges to the bowl. You can leave the lemon wedges whole, if you prefer."
    },
    {
      "title": "Serve and enjoy.",
      "content": "Serve and enjoy. You can sprinkle the lemon with some sugar if you want to take away some of the sourness and add some sweetness. Sprinkle one to two teaspoons (5 to 10 g) of sugar over the lemon bites and stir to coat them. You can either eat the lemons plain, with sugar, or you can add them to a salad, a fruit cocktail, or another dish."
    },
    {
      "title": "Make a simple syrup.",
      "content": "Make a simple syrup. Simple syrup is made by dissolving sugar in equal amounts of water. It’s ideal for cold recipes because the sugar stays liquid after it dissolves. To make it, combine the sugar and 1 cup (237 ml) of the water in a small saucepan. Heat over medium heat and bring the mixture to a low simmer. [3] X Research source Once the sugar is fully dissolved, remove the pan from the heat and set it aside to cool. Simple syrup will keep in the fridge for several weeks. To make extra for later, add double the water and sugar and divide when cool."
    },
    {
      "title": "Get your lemon juice.",
      "content": "Get your lemon juice. While the simple syrup is cooling, squeeze the juice from between five and eight lemons, until you have a full cup (237 ml) of juice. [4] X Research source You can either peel the lemons and run them through a juicer, or cut them in half and use a manual juicer to push out the juice. You can also substitute in lime juice for any or all of the lemon juice if you want to make limeade or lemon-limeade instead. You can use bottled lemon juice if you don’t want to go through the trouble of squeezing your own, but the results won’t be quite the same because bottled lemon juice doesn’t taste the same as fresh lemon juice."
    },
    {
      "title": "Combine all the ingredients.",
      "content": "Combine all the ingredients. In a large pitcher or juice jug, stir together the syrup, the lemon juice, and the last 4 cups (948 ml) of water. Once fully combined, the lemonade is ready. You can also garnish it with: [5] X Research source Sprigs of fresh herbs and flowers, such as thyme, basil, rosemary, and lavender Fresh lemon, lime, orange, or grapefruit slices Pineapple wedges"
    },
    {
      "title": "Refrigerate and serve over ice.",
      "content": "Refrigerate and serve over ice. Transfer the pitcher of lemonade to the fridge and let it chill for about half an hour. [6] X Research source To serve, fill a highball glass with ice and pour the lemonade over the ice. Refrigerate any leftovers for up to a few days. To turn the lemonade into a lemon soda, mix equal parts lemonade and sparkling water and serve with an extra shot of lemon juice."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Preserved lemons are made by adding salt to lemons and letting them sit in the salt for several weeks. Preserved lemons are ideal for making salads, dressings, soups, sauces, for cooking with vegetables, and for other dishes. To make them, you will need: Your ingredients Some fresh lemon juice Knife A one-quart (946-ml) canning jar with lid"
    },
    {
      "title": "Sterilize the canning jar.",
      "content": "Sterilize the canning jar. Run your canning jar through the dishwasher, and leave it in there until you're ready to pack the lemons. Wash the lid and ring by hand in hot, soapy water. If you don’t have a dishwasher, wash the jar by hand in hot, soapy water. Then place it on a baking sheet and into a 225 F (107 C) oven until you're ready to use it. [7] X Research source"
    },
    {
      "title": "Clean and trim the lemons.",
      "content": "Clean and trim the lemons. Wash and scrub the lemons with a vegetable brush to clean the rinds. Pat the fruit dry. Cut off the stems and tops (where the stems were) from each of the lemons, but leave the bottom nub intact.br> When you cut the lemons, you won’t quarter them the entire way, which is why you leave the bottom nub uncut. [8] X Research source"
    },
    {
      "title": "Cut the lemons.",
      "content": "Cut the lemons. Cut each lemon in half, starting at the top. Stop cutting about a half inch (1.3 cm) from the bottom, so that the two halves are still joined at the bottom of the lemon. Then cut each lemon in half again to quarter it, leaving the bottom half-inch of the quarters joined as well. [9] X Research source Keeping the lemon quarters attached will help to keep the salt packed inside evenly, and this will ensure they preserve properly."
    },
    {
      "title": "Salt the lemons.",
      "content": "Salt the lemons. Reserve 4 tablespoons (72 g) of the salt. Peel open the lemon quarters and sprinkle the remaining salt over the juicy flesh. When all the lemons have been salted, press the quarters back together. Salt works as a preservative because it doesn’t allow microbes and bacteria to survive, and these are what would cause the fruit to rot. [10] X Research source"
    },
    {
      "title": "Prepare your canning jar.",
      "content": "Prepare your canning jar. Remove your canning jar from the dishwasher or oven. If there's any leftover water, dry it with a freshly cleaned towel. Sprinkle about 2 tablespoons (36 g) of salt into the bottom of the jar, enough to create a generous layer. [11] X Research source"
    },
    {
      "title": "Pack the lemons.",
      "content": "Pack the lemons. Place two or three salted lemons into the canning jar. Press them down firmly so they release their juices. Continue adding more lemons, packing them down as you go to make room, and to juice the lemons. When you’ve added all your preserved lemons, make sure that the lemons are covered with juice. Add the cup of freshly squeezed lemon juice to the jar if you need more juice to cover the lemons. [12] X Research source Sprinkle the tops of the lemons with the remaining salt and put on the lid."
    },
    {
      "title": "Set the lemons aside to pickle.",
      "content": "Set the lemons aside to pickle. Transfer the jar of lemons to a warm place, such as a countertop, and let them ripen for 30 days. Turn the jar upside down once or twice every few days to shake up the salt and juices, and prevent everything from settling on the bottom. After 30 days, the preserved lemons are ready to use. [13] X Research source"
    },
    {
      "title": "Use in your favorite dishes.",
      "content": "Use in your favorite dishes. When the lemons are ready, you can remove individual wedges or whole lemons and use them for cooking. Remove a wedge or lemon and rinse off the salt. Remove and discard the seeds and pulp, and use the rind and juices in salads and other recipes. Preserved lemons will keep for up to a year, unrefrigerated. [14] X Research source"
    },
    {
      "title": "Try lemon curd.",
      "content": "Try lemon curd . Lemon curd is a tart and tangy dessert that can be used as a spread, a topping, or eaten on its own. It goes great with other fruit, can be used as a pie filling, and is an incredible way to enjoy a taste of summer any time of year as long as you store it properly."
    },
    {
      "title": "Make some lemon sugar.",
      "content": "Make some lemon sugar . As the name suggest, lemon sugar is regular sugar that’s been infused with fresh lemon flavor. You can use lemon sugar anywhere you'd use a regular sweetener, but it’s particularly delicious as a topping for cookies and baked goods."
    },
    {
      "title": "Whip up some lemon icing.",
      "content": "Whip up some lemon icing . There are plenty of baked goods that pair well with lemon icing, such as poppy seed cakes, muffins, biscotti, and even fresh fruit or ice cream."
    },
    {
      "title": "Use fresh lemon juice.",
      "content": "Use fresh lemon juice. Lemon juice is packed with vitamins and is very healthy to consume. There are plenty of ways you can use fresh lemon juice in your everyday meals and drinks, including: Add it to smoothies Squeeze it on fresh fruit for extra flavor and to prevent browning Drink it with hot or cold water Sprinkle it on fish Add it to salad dressings and sauces Add lemon juice to baked goods"
    },
    {
      "title": "Bake a lemon cake.",
      "content": "Bake a lemon cake . Lemon poke cake is a delicious, fresh, and citrusy treat that’s great for celebrating occasions like Easter, birthdays, Mother’s or Father’s Day, or other holidays. A poke cake is particularly flavorful because you poke holes in the cake that get saturated with frosting, cream, or in the case of this cake, a lemon glaze."
    },
    {
      "title": "Try some lemon pepper seasoning.",
      "content": "Try some lemon pepper seasoning . This seasoning is quick and easy to make, it’s tasty, and it goes great on lots of dishes. You can use lemon pepper seasoning on meat, fish, vegetables, or in soups, salads, and other side dishes. To change up the flavor of the seasoning for other recipes, you can also use orange or lime zest in the mix."
    },
    {
      "title": "Infuse lemons and olive oil.",
      "content": "Infuse lemons and olive oil . Olive oil is a light and flavorful oil that works great as a drizzle or sauce for dishes like salads and pastas. And when you infuse olive oil with lemon, it creates a beautiful and fresh citrusy oil that brings dishes to life. Lemon olive oil is wonderful in the winter because it brings a taste of summer to your meals."
    }
  ]
}