{
  "url": "https://www.wikihow.com/Do-Yoga-Walking",
  "title": "How to Do Yoga Walking",
  "steps": [
    {
      "title": "Practice yoga walking every day for 30 minutes on weekdays and at least an hour on weekends.",
      "content": "Practice yoga walking every day for 30 minutes on weekdays and at least an hour on weekends. When the walk starts, move quickly (power walking), and by the end of the walk, graduate to moving slowly ( slow walking ). Be sure to undertake all the 10 key elements each time, as outlined in the following steps, to get the most benefit from yoga walking."
    },
    {
      "title": "Stomp your anger into the ground while you walk.",
      "content": "Stomp your anger into the ground while you walk. Let out all the pent-up anger . Think the mantra \"Anger, Anger, Anger\". What has annoyed you today? Don't let it vex you any longer; free yourself from it!"
    },
    {
      "title": "Feel your sadness.",
      "content": "Feel your sadness. Resolve the feelings by walking out your sadness. Feel your sadness inside. What makes you sad today? Think several times the mantra: \"I'm sad because ...\"."
    },
    {
      "title": "Rotate your shoulders.",
      "content": "Rotate your shoulders. Do this to remove any tension in your shoulders and your neck. Find the optimal way of moving your shoulders to achieve the best effect."
    },
    {
      "title": "Rotate your spine.",
      "content": "Rotate your spine. When walking, turn your spine to the right, and then to the left, several times. Do this gently, and turn your head with your body."
    },
    {
      "title": "Allow a healing color to trickle through your body from head to foot.",
      "content": "Allow a healing color to trickle through your body from head to foot. Think the name of the color as a mantra . What color do you need now? \"Orange, blue, gold, pink...\"."
    },
    {
      "title": "Concentrate as you walk connected to the ground.",
      "content": "Concentrate as you walk connected to the ground. Feel the earth beneath your feet. Think the mantra \"Earth\" and breathe for a minute into your feet."
    },
    {
      "title": "Move one hand and send someone a positive sentence.",
      "content": "Move one hand and send someone a positive sentence. What do you want to say to him or her today? Think of the phrase several times as a mantra. Send light to the world and think: \"May all beings be happy . May the world be happy.\""
    },
    {
      "title": "Imagine the numbers 1 to 20 in your head, chest, abdomen, legs, feet, and into the ground (beneath the feet).",
      "content": "Imagine the numbers 1 to 20 in your head, chest, abdomen, legs, feet, and into the ground (beneath the feet). Do this every day, and you will quickly and effectively relieve tension that has built up in all major areas of your body."
    },
    {
      "title": "Visualize",
      "content": "Visualize a beautiful sun in the sky and clothe yourself with a golden ray of sunshine. Fill yourself with light. Think the word \"Light\" as a mantra, many times over."
    },
    {
      "title": "Stop all thoughts.",
      "content": "Stop all thoughts. For five minutes while walking, move all the stress out of you, until your mind becomes calm. Rest a while. Let all thoughts come and go as they please."
    },
    {
      "title": "Walk freely.",
      "content": "Walk freely. Go whichever way you feel you want to. Enjoy it. Observe how your mind slowly becomes positive. You are now back from your pilgrimage into the light. After each yoga walking session, realize that you have done something wonderful and caring for your physical health and for your mental well-being. Keep your happiness . The light will accompany you through your whole day."
    }
  ]
}