{
  "url": "https://www.wikihow.com/Get-Out-of-a-Rut",
  "title": "How to Get Out of a Rut",
  "steps": [
    {
      "title": "First, remember that you are not the only person who has ever felt this way.",
      "content": "First, remember that you are not the only person who has ever felt this way. When you are down and demotivated, it can sometimes feel like everyone except you is progressing and doing great things while you wait on the sidelines. It is human nature to get demotivated sometimes; we are not robots. Some common ruts that people get into include: Feeling bored or stagnant at work. A lot of jobs, particularly if you've been working there for a while, can start to feel tedious. Losing the spark in a relationship. Long-term relationships, in particular, can be prone to falling into a routine that drains the relationship of excitement. This also applies to platonic friendships; sometimes your friends can keep you in a pattern of monotony. Developing poor eating habits. If you have a busy schedule or just love food, it's not difficult to make lousy choices at mealtime. Once you get into the habit of unhealthy eating, it can seem almost impossible to break! All of the above. Frequently, there are a number of factors that will keep you in a rut. All of these things seem to culminate at once, creating a stressful situation that you don't even know how to begin to fix."
    },
    {
      "title": "Devote a few days to figuring out what exactly is getting you down.",
      "content": "Devote a few days to figuring out what exactly is getting you down. Chances are, you already have an idea of what's bugging you. Be honest with yourself. Once you identify the source of your discontent, you are free to commit to changing it. If you can't seem to put your finger on what's making you unhappy, consider keeping a journal. It doesn't have to be very elaborate or time-consuming. At the end of each day, write down a few reflections about what happened and how you're feeling. After a while, it won't be difficult to identify the negative patterns. Keeping a journal has been proven to help people track their bad habits and quit them altogether. You can also try a tool like the Wheel of Life, which helps you brainstorm what is important to you, and assess both where you are and where you want to be in these areas. [1] X Research source"
    },
    {
      "title": "Understand that thinking about the past can really demotivate you.",
      "content": "Understand that thinking about the past can really demotivate you. Instead of beating yourself up about the way things are, grant yourself the power to make a positive change. It sounds cheesy, but imagining a positive future can really motivate you to make it happen! If you find that your past intrudes on your present such that you are not able to stop focusing on it or move past it, consider speaking with a therapist. They can help you develop techniques to move forward."
    },
    {
      "title": "Start small.",
      "content": "Start small. If you are in a rut, chances are you've been doing things the same way for quite a while. Trying to change every aspect of your life overnight is just unrealistic, not to mention incredibly daunting. You'll find that success comes much more easily if you set an achievable goal to begin with. If you have decided to make huge changes in your life, break them up into a series of goals. You are much more likely to succeed if you manage your expectations. [2] X Research source For instance, if you want to go back to college, make it your first goal to research schools that offer the program you want to do. This is an easily accomplished, yet vital step in your journey! Making small changes, such as taking a new route to work or working out in the morning instead of the afternoon, can help introduce new stimuli and change your perspective. Start by making small changes with how you do things and you may notice a big difference."
    },
    {
      "title": "Keep track of your progress.",
      "content": "Keep track of your progress. There are a number of ways you can do this, especially if you have a smartphone. Take a few minutes to download a helpful app, or stop by the office supply store for a calendar and some sparkly star stickers. Looking back at your progress can really give you a boost! It sounds counter-intuitive, but try not to brag about your big plans before you have actually achieved anything. According to research, talking about your intention to do something makes you less likely to really do it. [3] X Research source With that in mind, don't forget to congratulate yourself when you reach a milestone. If your main goal is to lose fifteen pounds, pat yourself on the back when you've lost five."
    },
    {
      "title": "Read articles or books about others who have done what you are trying to do.",
      "content": "Read articles or books about others who have done what you are trying to do. Whether you are trying to make huge changes or just need a little pick-me-up, somebody somewhere has probably been through it too. Learning about the experiences of others can really give you some perspective and motivation. Depending on your situation, it might be helpful to join some type of community with other people who are in the same boat as you. This could be a traditional \"support group,\" a group you set up with your family and friends, or even an online forum. Having a strong support system can be crucial to avoiding stress. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Don't give up.",
      "content": "Don't give up. Changing your routine, especially if you've been doing it for a while, is hard. Give yourself credit for trying in the first place. Remind yourself how far you've come, and don't let one little setback stop you."
    },
    {
      "title": "Don't be too hard on yourself.",
      "content": "Don't be too hard on yourself. It's pretty unlikely that you'll reach your goal immediately; focus on making progress. Most positive things just take time and feeling grief can cause you to move backward on everything you've accomplished. Look at what you have already finished and compliment yourself on it. After all, you are that many steps closer to completing your mission."
    },
    {
      "title": "Get right back into your new routine.",
      "content": "Get right back into your new routine. It is completely normal to fall back into old, comfortable habits, even if those habits make you unhappy. The important thing is to identify when you have fallen off track, and then immediately get back on! Don't let one imperfect day throw off your whole plan. Sometimes you might fall off track for a longer period of time. Maybe something unexpected happened or you just lost your motivation. Try to remember the first time you decided to make a change, and remind yourself that if you were able to do it once, you can do it an infinite number of times. Starting over is not a failure, but giving up is."
    },
    {
      "title": "Practice mindfulness, or living in the present.",
      "content": "Practice mindfulness, or living in the present. Sometimes we are more vulnerable to setbacks after we've already made quite a bit of progress. Don't let any progress you might have made be your excuse to go back to square one. Always be conscious of your goal and where you are on your road to achieving it. This is another scenario in which keeping a journal might come in handy. Keeping track of your thoughts is useful for maintaining awareness, especially if you feel like you are losing your motivation. Mindfulness is a great technique for reducing the stress you might feel due to a lot of changes happening in your life. [5] X Research source On the other side of the coin, be aware of situations that cause you to dwell on the past and focus your energy on moving forward. If you bomb a presentation at work, make a list of all the things you want to remember for next time. Remember that staying out of a rut is a continuous process. An actor who makes one bad film isn't necessarily a bad actor, just like a person who has one bad week doesn't necessarily have a bad life."
    }
  ]
}