{
  "url": "https://www.wikihow.com/Create-Your-Own-Pok%C3%A9mon",
  "title": "How to Make Your Own Pokémon",
  "steps": [
    {
      "title": "Pick a creature or object as the base of your design.",
      "content": "Pick a creature or object as the base of your design. Most Pokémon are based on an animal or object that already exists in the real world. [1] X Research source To start your design, pick an animal that you find fascinating or an object that you think would make a good start for your creation. Stick with simple choices for your first design to keep things simple, like a mouse, chicken, snake, tree, ice cube, or a feather. Use any animal or object you like! Animal designs from the game are all over the place. Sandshrew is based on an armadillo, Rattata is based on a rat. Geodude is a rock, and Magnemite is a screw with 2 magnets on it. As you’re going, write down your ideas in a list so that you remember all the traits when you go to draw it."
    },
    {
      "title": "Select a type to determine your Pokémon’s theme.",
      "content": "Select a type to determine your Pokémon’s theme. The type determines a Pokémon’s moves, strengths, weaknesses, and sometimes its color scheme. Pokémon can only have 1-2 types, and these types do not have to be related to the object or animal that the Pokémon is based on—although it can be fun if they are related. [2] X Research source For example, a Pokémon based on a chicken can be a fire type, even though chickens have nothing to do with fire. If you make a fox Pokémon a poison type, its fur could be purple and its eyes could be yellow. You could make a thumbtack Pokémon a flying and steel type and give it wings and a sleek silver color. Coloring your Pokémon based on its type helps other people know what kind it is (like how Pikachu is yellow, and so you know it’s electric), but feel free to break the rules—plenty of official Pokémon do!"
    },
    {
      "title": "Come up with a cute or angry face for your creature.",
      "content": "Come up with a cute or angry face for your creature. Many Pokémon have either a cute face with round eyes, or a sharp face with slanted eyes. This helps express their personality. Your Pokémon can be smiling, smirking, frowning, or have no mouth at all! Choose a face style to give your Pokémon the personality and attitude that you want it to have. For example, if you wanted to make a fox Pokémon look intimidating and scary, give it sharp eyes angled down towards its snout. If you wanted to make the thumbtack look whimsical or silly, you could draw 2 round eyes with small pupils and give it a goofy smile. Look at other Pokémon to see how the faces vary. Pikachu has wide set eyes and a simple, round smile. This makes it look funny and cute. Tangela only has 2 simple eyes with pupils in the center, making it look simple and mysterious."
    },
    {
      "title": "Add 1-2 cool features to your Pokémon to make it unique.",
      "content": "Add 1-2 cool features to your Pokémon to make it unique. To differentiate your Pokémon from a regular animal or object, give it 1-2 features that your animal or object wouldn’t normally have. These features could be wings, a halo, an extra set of arms, or some sort of pattern or symbol. For example, Pikachu is a rat, but it has a jagged, angular tail and 2 red dots on its cheek. Choose surprising traits, or stick with features that fit your vision for the Pokémon. [3] X Research source You could also have your Pokémon hold something. Cubone carries a little bone, while Farfetch’d walks around with a leek. For example, you could give the poison fox a red streak on the side of its fur and give it a second set of ears. Your thumbtack Pokémon could have a strange symbol in its forehead and have a set of tiny arms. The features often express the type of Pokémon that it is. Electric Pokémon often have lightning bolts or electricity coming off of them, while poison Pokémon are often surrounded by clouds or look slimy."
    },
    {
      "title": "Come up with a pun or clever name for your Pokémon.",
      "content": "Come up with a pun or clever name for your Pokémon. There are no requirements when it comes to naming a Pokémon, but most Pokémon names are punny versions of what they’re based on. For example, Rattata is a rat, Zubat is a bat, and Delphox is a fox. Play around with the spelling of your animal or object to come up with something cute or scary that expresses your Pokémon’s vibe. [4] X Research source Many Pokémon names are a combination of the animal or object’s name and some other attribute or characteristic. For example, Venomoth is a combination of “venom” and “moth.” Lickitung is a combination of “lick” and “tongue.” For example, a poison type fox Pokémon could be named “Chemifox” or “Furmynx,” while the flying thumbtack Pokémon might be named “Shanx” or “Pointer.” Some Pokémon are simply named after their attitude or central emotion. Farfetched is something that is ridiculous or outlandish. Farfetch’d, the Pokémon whose name is based on the word farfetched, walks around with a leek and hits people with it."
    },
    {
      "title": "Give your Pokémon some moves based on its type.",
      "content": "Give your Pokémon some moves based on its type. Every Pokémon knows at least 1 move, and every Pokémon can know up to 4 moves. Moves also have elements the same way that Pokémon do, and Pokémon get a 50% stat bonus for using a move that matches its type. Select 1-4 moves from a moves list for your Pokémon to learn and jot them down. [5] X Research source For example, Psychic Fangs is a psychic attack. That means that a Kadabra will get a bonus for using the move since Kadabra is a psychic Pokémon, but Pikachu wouldn’t because it’s an electric type. For your poison fox Pokémon, you might give it poison powder, poison sting, acid, and smog. Your thumbtack Pokémon that is a flying type may have mirror move, peck, drill, and sky attack."
    },
    {
      "title": "Select base stats for your Pokémon to finish rounding it out.",
      "content": "Select base stats for your Pokémon to finish rounding it out. Base stats are the numbers that your Pokémon uses to determine its health, damage, skill, and speed. While you can technically select any number between 1-255 for your Pokémon, try to keep them reasonable for your custom creation. It won’t be fun to compare your Pokémon to others or play with your custom card if your Pokémon is overpowered. [6] X Research source Your Pokémon’s base stats increase as it gains levels and evolves. Create a percentage or flat number to add to your base stats when it levels up or evolves."
    },
    {
      "title": "Create evolutions to fully flesh your Pokémon out.",
      "content": "Create evolutions to fully flesh your Pokémon out. When a Pokémon reaches a certain level, it evolves and becomes a stronger version of itself. Evolved versions are typically larger and slightly different than their original form. Make 2-3 evolutions for your Pokémon by repeating this entire process 2-3 times if you’re really trying to make an authentic Pokémon! [7] X Research source For example, Pikachu is the base Pokémon, but when it evolves, it turns into Raichu. It goes from being yellow to orange, and its thick tail turns into a thinner, pointier version. Evolved versions are always stronger than the original form of a Pokémon."
    },
    {
      "title": "Create drawings for your Pokémon to give them an appearance.",
      "content": "Create drawings for your Pokémon to give them an appearance. Use your notes to guide you as you draw . Since there are no rules for drawing Pokémon, feel free to use whatever medium you prefer. Keep in mind Pokémon are designed to be simple and easily recognizable. Use solid color schemes, simple shapes, and a solid black outline to mimic the Pokémon art style. [8] X Research source Create a single drawing, or draw dozens of different drafts or angles. It’s totally up to you! A simple way to start is to type “cartoon” and your animal or object into an online image search. Use a simple cartoon design as a template for your Pokémon and add on from there. As long as you’re happy with the way your Pokémon looks, you’re good! There is no right or wrong way to do it."
    },
    {
      "title": "Make a sprite for your Pokémon to give it that classic feel.",
      "content": "Make a sprite for your Pokémon to give it that classic feel. At the start, Pokémon were pixelated sprites in the classic videogames. To give your Pokémon a more retro vibe, open up a pixel art program like Piskel and draw your Pokémon with pixels to make it into a cute game sprite. Download the sprite and use it as your profile picture, send it to your friends, or even use it to make your own Pokémon games."
    },
    {
      "title": "Make a fake Pokémon card with a digital card maker.",
      "content": "Make a fake Pokémon card with a digital card maker. Take your drawing and scan it to a computer . Then, to make it into a card , look online for a Pokémon card creator . Upload your photo to the card art section by clicking the “Upload” button. Then, enter its name, stats, and moves to create a digital copy of your Pokémon’s card. [9] X Research source You can find a Pokémon card generator online at https://www.mypokecard.com/en/ or https://www.pokecard.net/ . After, print it out and laminate it to make it feel real and official."
    },
    {
      "title": "Use your custom card in a deck to play with it.",
      "content": "Use your custom card in a deck to play with it. Once you’ve created a custom card and glued it to a standard card, incorporate it in your favorite deck to play with it . Simply shuffle it into your standard deck to enjoy casual games with your Pokémon. You can even create an entire deck out of custom Pokémon cards. Keep in mind, you can only use your fake Pokémon card in casual games. [10] X Research source You cannot use a custom card at a games shop or in a tournament. If you aren’t playing with a friend, let your opponent know ahead of time that you have a custom card in your deck."
    }
  ]
}