{
  "url": "https://www.wikihow.com/Dispose-of-Burnt-Firewood-and-Ash-Safely",
  "title": "How to Dispose of Burnt Firewood and Ash Safely",
  "steps": [
    {
      "title": "Allow the wood and ashes to cool completely in the fireplace.",
      "content": "Allow the wood and ashes to cool completely in the fireplace. If indoors, let your embers cool down completely with the fire screen closed. Even if it appears the ashes and wood aren’t hot, they may remain warm and capable of starting a fire for some time. Allow several hours for the embers to cool. They will not radiate any heat when they are completely cold. Don’t allow a fire to keep burning overnight. If you need to go to sleep, put the embers out completely by covering them with sand. Pouring water on a fire inside can damage your fireplace. If sand is not available, you can smother a fire with salt or baking soda. NEVER use flour on a fire. Flour is combustible and potentially explosive. Even small amounts can cause a 'mist' and each grain can catch fire, like setting off fireworks, which can spread fire to humans, pets, and clothing / belongings."
    },
    {
      "title": "Let outdoor fires cool completely in the fire pit.",
      "content": "Let outdoor fires cool completely in the fire pit. Let your campsite embers cool completely in your firepit. Do not leave your camping area with any warm embers still radiating heat. If you need to put your embers out quickly, smother them with sand or dirt. Don’t start an outdoor fire if you don’t have time to let the embers cool properly. Avoid putting out your fire with water, which can wash away flammable accelerant."
    },
    {
      "title": "Transfer the remaining wood and ashes to a metal bucket with a shovel.",
      "content": "Transfer the remaining wood and ashes to a metal bucket with a shovel. Wearing safety gloves, use a metal shovel to move the ashes into a metal bucket. Move the bucket close to the site of the fire, so you are not transferring ashes over your wood floor indoors or longer distances outside. Act as though the material still has the potential to be warm, even if you think it’s cool. Never use buckets or shovels made of any combustible materials, such as wood."
    },
    {
      "title": "Wet the wood and ashes with water.",
      "content": "Wet the wood and ashes with water. Use a water bottle or watering can to wet down your ashes and any wood pieces in the bucket. Use enough water to saturate the materials in the bucket, so they are thoroughly wet. Do this whether you are inside or outside. If desired, you can put a plastic trash bag underneath your bucket inside to protect your floor. There’s no need to have standing water in the bucket, but it doesn’t hurt. As long as you’re okay with a little mess, you can use as much water as you like."
    },
    {
      "title": "Transfer the metal container outside until garbage day.",
      "content": "Transfer the metal container outside until garbage day. Place your metal bucket of fire waste outside your home. Choose a location away from any combustible materials, such as oil or paper. While it might be tempting, do not discard any additional trash or flammable materials in the bucket."
    },
    {
      "title": "Dispose the materials with your regular garbage.",
      "content": "Dispose the materials with your regular garbage. Pour off any extra water the morning of garbage collection, and empty the solid materials into your regular garbage can. Your used ashes and wood will be hauled away with the rest of your trash."
    },
    {
      "title": "Enrich your soil with ashes.",
      "content": "Enrich your soil with ashes. Wood ash provides nutrients such as phosphorous, calcium and boron that can help your plants flourish. [1] X Research source Wearing gloves, add ashes to your potting mix a handful at a time, measuring the PH as you go to get the perfect balance. You can retest and add more ash over the coming months, as desired. [2] X Research source Before adding ashes, measure the starting PH of your garden soil with a soil PH meter. These can be purchased inexpensively online. How much ash to add depends on the starting PH of your soil, but most plants thrive at a PH between 6-7.5. [3] X Research source Adding ash will neutralize acids in your soil, so only add it if your starting PH is higher than 7. You can do this with damp or dry ashes; it is up to you."
    },
    {
      "title": "Repel garden pests by sprinkling ashes around your garden.",
      "content": "Repel garden pests by sprinkling ashes around your garden. The alkalinity of ashes repels slugs and snails. If you have prized plants that are being nibbled by these creatures, sprinkle a handful of ash at the base of the plant. Avoid adding more than a handful, as this can change the PH of your soil and affect plant growth. Your garden will be pest free in no time. [4] X Research source"
    },
    {
      "title": "Use ashes to melt ice on walkways and driveways.",
      "content": "Use ashes to melt ice on walkways and driveways. Sprinkle some leftover ashes on stubborn ice in the winter. Its composition helps the ice melt faster, and it provides some much needed traction on slippery areas. Plus, it’s a natural alternative to many chemical ice melts that can be harmful to pets and children. [5] X Research source"
    },
    {
      "title": "Shine your silver with an ash paste.",
      "content": "Shine your silver with an ash paste. Mix 1 cup of ashes (144 grams) with a little bit of water until you have a thick paste. Using kitchen gloves, coat your silver using the paste. Let it sit for a minute to loosen grime, then buff your silver with a clean cloth. [6] X Research source"
    }
  ]
}