{
  "url": "https://www.wikihow.com/Fill-in-PDF-Forms",
  "title": "4 Easy Ways to Fill Out Downloadable and Fillable PDF Forms",
  "steps": [
    {
      "title": "Open the form in a web browser.",
      "content": "Open the form in a web browser. Google Chrome and Microsoft Edge are the best for easily and quickly filling in PDFs. If the form came from a link online, open that link in Chrome or Edge. If the form came as an attachment in an email, download the PDF. Specify to open in Chrome or Edge, or save the file. If the PDF is saved on your computer, navigate to it in your file explorer. Right-click (or Ctrl + click on Mac) the file, hover over Open with , and select Chrome or Edge. This method may not work for every PDF. If the PDF is incompatible or not created as a fillable form, then you can't use this method."
    },
    {
      "title": "Fill in the form.",
      "content": "Fill in the form. Click into the fields and type the information."
    },
    {
      "title": "Save the form.",
      "content": "Save the form. This works differently depending on the browser you are using. In Google Chrome, click the Download icon in the top right corner of the page, then select a location to save it to. In Edge, simply click the Save icon in the top right corner of the page after filling in the form."
    },
    {
      "title": "Open your document in Google Drive.",
      "content": "Open your document in Google Drive. This method allows you to fill in PDFs for free. You can use any web browser to use Google Drive , but Chrome is the best option. You can use this option to manually fill in files or if it is fillable."
    },
    {
      "title": "Click the \"Open With\" dropdown at the top of the document.",
      "content": "Click the \"Open With\" dropdown at the top of the document. This will show you a list of connected apps that you can use with your PDF."
    },
    {
      "title": "Select a PDF editor.",
      "content": "Select a PDF editor. If you don't have any connected apps, click one under the \"Suggested third-party apps\" that allows you to edit PDFs. DocHub is a good, free tool that allows you a limited amount of actions per month. You can, however, pay to upgrade to an unlimited account. Once you select a PDF editor, you have to give it permission to connect with your Google Drive account. Click Continue and Allow to proceed."
    },
    {
      "title": "Fill in the form.",
      "content": "Fill in the form. Use the tools in the toolbar to write text, stamp, and more. If the form is not fillable , you'll have to click into each section where you want to put your answer. [1] X Research source"
    },
    {
      "title": "Open the PDF in Preview.",
      "content": "Open the PDF in Preview. Preview is a built-in and free tool that Macs use to preview items, but it can also handle light photo edits and text editing. If you click the file, it should open by default in Preview. If not, press Ctrl and click the PDF and then select Open with > Preview ."
    },
    {
      "title": "Fill in your form.",
      "content": "Fill in your form. If the form is fillable, you can simply press Tab or Enter to move through the fields. If the PDF isn't fillable, you can create text boxes to insert your answers. Click the Show Form Filling Toolbar button and then click the \"A\" icon inside a dotted box. [2] X Research source"
    },
    {
      "title": "Open the form in Acrobat.",
      "content": "Open the form in Acrobat. If you don't already have the software, know that you need to pay for an Adobe Standard subscription to edit PDFs that weren't made fillable. However, you might be able to sign up for a free 7-day free trial. Go to Adobe's site to sign up and download the software. You can fill in fillable forms for free using Adobe Reader! You can also fill in fillable forms at https://www.adobe.com/acrobat/online/sign-pdf.html if you don't want to install the Adobe Reader software. If the form came from a link online or as an attachment in an email, download and save the PDF to your computer. Then, you can open it in Adobe. If the PDF is saved on your computer, navigate to it in your file explorer. Right-click (or press Ctrl and click on Mac) the file, hover over Open with , and select Adobe Acrobat Reader DC."
    },
    {
      "title": "Click Fill & Sign.",
      "content": "Click Fill & Sign . It's in the menu on the left side of your screen in purple text with an icon of a pencil. [3] X Research source"
    },
    {
      "title": "Fill in the form.",
      "content": "Fill in the form. If it is made fillable, you will be able to click into the fields and enter text or check boxes. [4] X Research source If the form is not fillable, you have to subscribe to Adobe Standard to be able to edit PDFs."
    },
    {
      "title": "Open the Play Store or App Store on your mobile device.",
      "content": "Open the Play Store or App Store on your mobile device. Look for the icon on the home screen, or search for the app in your app menu. Tap the app to open."
    },
    {
      "title": "Search for a PDF editing app.",
      "content": "Search for a PDF editing app. Try searching with the phrase “PDF editor”. Download an app that you like. Adobe Acrobat Reader is a free app that is highly compatible with PDFs."
    },
    {
      "title": "Open the PDF with the app.",
      "content": "Open the PDF with the app. Search for the PDF in your files or emails. [5] X Research source If the PDF is saved in your files, tap the down arrow next to it or navigate to options, tap Open with , and select your app. If the PDF is an attachment of an email, open the PDF by tapping on it. Tap the icon with the 3 vertical dots and select Download . Open the saved file from your downloads folder with the app."
    },
    {
      "title": "Fill in the form.",
      "content": "Fill in the form. Save when finished."
    }
  ]
}