{
  "url": "https://www.wikihow.com/Get-Over-Losing-a-Best-Friend",
  "title": "How to Get Over Losing a Best Friend",
  "steps": [
    {
      "title": "Grieve the loss.",
      "content": "Grieve the loss. Losing a best friend is painful. You’ll only make the whole process harder by denying your feelings. Acknowledge the disappointment and hurt you feel. Give yourself permission to grieve. [1] X Research source Regularly tune in to how you’re feeling and express those feelings . If you need to cry, go for it. If you feel angry, find constructive ways to release that anger."
    },
    {
      "title": "Get support",
      "content": "Get support . You won’t be able to get through this situation on your own. You’ll need to lean on people who care about you and understand the impact of the loss. Have a conversation with your parents, siblings, or another friend (unconnected to your bestie). [2] X Research source Try to open up about how you’re feeling and ask them for support. This may translate to having someone to listen to you or having someone who helps take your mind off things for a while. Reader Poll: We asked 1600 wikiHow readers who they go to when they need to talk through a personal issue, and 61% said that they reach out to their best friend for support. [Take Poll] When your best friend is the personal issue, it can be hard to know where to turn—but whoever you confide in now may just become your next bestie!"
    },
    {
      "title": "Perform a closure ritual.",
      "content": "Perform a closure ritual. Writing about the loss can also help you move past it. Try journaling about the situation. Or pen a letter to your best friend, but don’t send it off. Use this as a way to get things off your chest, especially if you find it difficult to open up to other people in your life. [3] X Research source When you are done, you might destroy the letter to symbolize it being in the past."
    },
    {
      "title": "Return or store mementos.",
      "content": "Return or store mementos. If you have a bunch of your ex-best friend’s things, pack them up and return them. Try boxing up any mementos or gifts, particularly if they bring up negative emotions. You might unpack them later, but for now, putting them away may help you move forward. If you’d like support, ask your mom, sibling, or an unbiased third party to help you get rid of or store mementos."
    },
    {
      "title": "Take the high road if you have to see them regularly.",
      "content": "Take the high road if you have to see them regularly. If you will continue to see your old pal regularly, try to be civil. Make a commitment to be the bigger person when the two of you make contact. Remind yourself that you once cared for this person a great deal (and probably still do). At least pay homage to that relationship by being cordial when you two interact. Having an ugly confrontation or badmouthing your ex-bestie won’t help you get over things. Even if there’s bad blood between you, stay cool and avoid trying to make your mutual friends pick a side. If your old pal tries to pull you into any drama, say, “I don’t want to fight with you” and walk away."
    },
    {
      "title": "Try to stay in touch if they moved away.",
      "content": "Try to stay in touch if they moved away. If you lost your best friend due to a move, you can still maintain the friendship from afar. Call them often, write letters, and commit to a standing weekly Skype call. Your friendship may be different now that you're apart, but you can still keep in touch. [4] X Research source Be realistic about maintaining a long-distance friendship. Your friend may not be available as often as you'd like. They are also likely to make new friends. If something went wrong between the two of you, think about whether you want to stay in touch. Remember to do what is best for you."
    },
    {
      "title": "Remember your deceased friend fondly.",
      "content": "Remember your deceased friend fondly. If your best friend passed away , you're likely crushed. Keeping busy with your daily routine can help you move forward without them. However, it can also help to reflect on all the wonderful memories you shared together. [5] X Research source When everyone's ready, talk to their parents and share funny stories about your friend. Look back at old photos and rewatch silly videos you made together. You might even write your friend a letter and read it aloud at the place of their memorial. Doing so may help you get some things off your chest so you can move forward with your life. Remember that this person will always be a part of you, no matter what. Cherish those memories. You can even keep a photo of them nearby if you're comfortable with that."
    },
    {
      "title": "Build a self-care routine.",
      "content": "Build a self-care routine. Make yourself a top priority after a friendship breakup. Don’t feel guilty about being a little selfish with your time and energy. Create a routine that lets you pour back into your own cup for a change. [6] X Research source Upgrade your self-care by getting enough sleep , exercising , getting a massage, and watching your favorite movies."
    },
    {
      "title": "Find a hobby.",
      "content": "Find a hobby . An ex-best friend can leave a giant hole in your everyday life. Use that newfound time to cultivate a passion. Think about things you once liked to do or always wanted to try and go do them. Hobbies can be virtually anything. Try writing, painting, dancing, or baking. You might also plan a camping trip with your family like you did when you were younger. Or get back involved with a community youth group."
    },
    {
      "title": "Redecorate",
      "content": "Redecorate your living space. Sometimes, change can feel good. Tangible changes in your home environment can help your transition into a new chapter in your life. Recharge your life by repositioning your bedroom furniture, hanging new curtains, or putting up new posters. [7] X Research source"
    },
    {
      "title": "Learn a new skill",
      "content": "Learn a new skill . Are you interested in a subject that you know nothing about? If so, sign up to take a class and learn something completely new to you. Trying something new on for size can be a great way to challenge yourself and preoccupy your thoughts. [8] X Research source Maybe you’ve always wanted to learn Spanish or Italian. Or perhaps you want to become a master gardener. Whatever it is, find a class or read a book about the subject to start learning."
    },
    {
      "title": "Volunteer",
      "content": "Volunteer . Community service can serve double-duty after a friendship breakup. It helps you use your time constructively, but it also presents an opportunity for you to meet new people. Consider what ways you would like to help out in your local community. By volunteering, you can connect with people who have the same interests as you. [9] X Research source Volunteer opportunities vary based on your location. Talk to a teacher or community leader to inquire about different ways you can help out."
    },
    {
      "title": "Put yourself out there.",
      "content": "Put yourself out there. When it comes to forming new friendships , you’ll have to stick your neck out. You can’t expect new friends to just fall into your lap; it’ll take effort. Join new clubs or organizations at your school. Choose a new place in your community where other people your age hang out. When you meet someone new, show your interest. Ask the person about themselves and try to find things the two of you have in common to build a connection. Don't focus on the subject of your estranged friend. Instead, just try to get to know the new person."
    },
    {
      "title": "Be selective.",
      "content": "Be selective. To ensure that future friendships are healthier, think about what kinds of people you want to be around. If you and your ex-best friend grew apart, consider what you would want in a friend today. Choose people who are positive influences and who share similar values. Make a list of positive traits you want in a friend. Don’t be rigid to this list, but use it to determine if potential new friends fit the bill."
    },
    {
      "title": "Be a better friend.",
      "content": "Be a better friend. In addition to choosing positive friends, you also want to be that friend to someone else. Reflect on some of the ways you could have been a better friend to your ex-bestie. As you form new friendships, try to develop better habits this time around. [10] X Research source Good friends are excellent listeners , able to let their friends be themselves, and are there when their friends need them. Find ways in which you can start being a better friend."
    },
    {
      "title": "Consider getting to know some of your current friends better.",
      "content": "Consider getting to know some of your current friends better. You may have never considered it, but there may be someone among your current friends who is best friend material. Spend more time with people you feel a connection with and see what unfolds. Maybe you have a regular study buddy that you don't know all that well. You might say to him after a study session, \"Hey, man, I was thinking of grabbing a bite to eat. Would you like to join me?\" Spending time with this person one-on-one outside your usual context may help you get to know them better."
    },
    {
      "title": "Don’t attempt to replace your former bestie.",
      "content": "Don’t attempt to replace your former bestie. You don’t have to rush off one week after the breakup and select a new best friend. The best friendships form over time, as mutual trust and respect develop. Don’t set out to replace your old friend. Instead, focus on forming good supportive relationships. [11] X Research source When a potential new “best” friend presents themselves, you’ll know. Don’t allow just anyone to hold that title."
    }
  ]
}