{
  "url": "https://www.wikihow.com/Get-Rid-of-and-Prevent-Flour-Mites",
  "title": "How to Get Rid of and Prevent Flour Mites",
  "steps": [
    {
      "title": "Look for brown \"mite dust\" on the surface of your food.",
      "content": "Look for brown \"mite dust\" on the surface of your food. [2] X Research source Flour mites have off-white bodies and are so small they are nearly invisible to the naked eye [3] X Expert Source Wilson Christner Pest Management Professional Expert Interview. 31 May 2023. . Because of this, it is very difficult to detect mites until you have a full-blown infestation. The mites have brownish legs, and the collection of living and dead mites and their waste will appear as a brown coating or tinge. [4] X Research source It may look a bit like sand."
    },
    {
      "title": "Rub the mite dust or some questionable flour between your fingers and check for a minty smell.",
      "content": "Rub the mite dust or some questionable flour between your fingers and check for a minty smell. When flour mites are crushed they give off a distinct minty odor. [5] X Research source [6] X Expert Source Wilson Christner Pest Management Professional Expert Interview. 31 May 2023. The food may also develop a sickly sweet smell or taste, even before you detect the mites. [7] X Research source"
    },
    {
      "title": "Spread some flour on a flat surface and inspect it after 15 minutes.",
      "content": "Spread some flour on a flat surface and inspect it after 15 minutes. Make the flour as smooth and level as you can before walking away. If the flour is infested with mites, the surface will be uneven due to the movement of the mites. [8] X Research source"
    },
    {
      "title": "Stick a piece of scotch tape on packages or on the pantry shelves and inspect for mites.",
      "content": "Stick a piece of scotch tape on packages or on the pantry shelves and inspect for mites. The mites will stick to the tape and you may be able to see them with a magnifying glass. [9] X Research source Also check the glue on box tops, the edges of sealed flour canisters. They might not be able to get inside, but they may be on the lip and get in once you open the container."
    },
    {
      "title": "Notice if you are inexplicably itchy after handling flour or other grains.",
      "content": "Notice if you are inexplicably itchy after handling flour or other grains. Though flour mites don't bite, some people may have an allergic reaction to the allergens on the mites or their waste products. [10] X Research source This is also known as \"grocer's itch.\""
    },
    {
      "title": "Put severely infested foods in plastic garbage bags and put them in the trash bins outside your house.",
      "content": "Put severely infested foods in plastic garbage bags and put them in the trash bins outside your house. The flour mites feed on the germ in flour as well as mold, and their presence could indicate the food has gone bad. They can also pass the mold spores to other foods if they travel to another container. [11] X Research source Don't worry if you think you may have consumed some of the mites--they are harmless to most people. In rare cases, people may have an allergic reaction to consuming flour contaminated by lice, called oral mite anaphylaxis, or pancake syndrome. A reaction usually occurs within minutes after eating the contaminated food and can cause hives, difficulty breathing, swelling of the throat, nausea, weakness, and/or collapse. Contact a doctor immediately if you experience any of these symptoms."
    },
    {
      "title": "Freeze any dried goods that may be infested to kill the flour mites.",
      "content": "Freeze any dried goods that may be infested to kill the flour mites. If you have foodstuffs that show no sign of infestation or are not completely overrun with mites, storing them at temperatures below 0°F (-18°C) for four to seven days will kill any stray mites, eggs, or larva. [12] X Research source Once the mites are dead, try sifting the dry goods or removing portions you know were infested and may contain dead mites. [13] X Research source"
    },
    {
      "title": "Remove and sanitize any bins, jars, or containers where contaminated foodstuffs were stored.",
      "content": "Remove and sanitize any bins, jars, or containers where contaminated foodstuffs were stored. You want to remove every last speck of food from these containers, depriving any surviving mites of their food. Wash the containers and lids in very hot water and make sure they are completely dry before you refill them. [14] X Research source"
    },
    {
      "title": "Thoroughly clean the pantry or cabinet where the infested goods were stored.",
      "content": "Thoroughly clean the pantry or cabinet where the infested goods were stored. Vacuum the shelves and walls, paying special attention to crevices. If you don't have a vacuum, try using a clean, dry brush to sweep out the area. [15] X Research source stoke.gov.uk/food Make sure you throw the vacuum bag in the trash bin outside immediately after cleaning. Wipe down all the surfaces, but avoid using chemical pesticides anywhere near your food or food storage. Try cleaning with a mixture of water and vinegar (1 part vinegar to 2 parts water) or natural insect repellents and safe pesticides like neem oil or orange oil (1 part oil to 10 parts water). [16] X Research source Use a hairdryer to dry the storage area. Flour mites like damp, humid places. [17] X Research source stoke.gov.uk/food"
    },
    {
      "title": "Keep food storage areas dry and cool.",
      "content": "Keep food storage areas dry and cool. Flour mites cannot thrive in a low-humidity environment (under 65%), and you should never see an infestation if your storage area is well-ventilated. Pay attention to the placement of kettles, cookers, dryers, and stoves and make sure they are not causing moist air to collect in food storage areas. Try keeping a fan in your pantry to cool the air and dry out any moisture."
    },
    {
      "title": "Store flour",
      "content": "Store flour , grains, cereal, and other susceptible foods in clean, airtight containers. This will keep your food fresh and dry and keep mites out. If there are any mites that survived your cleaning process, depriving them of their food source will cause them to starve and prevent them from laying eggs in your grains. Resealable plastic bags can work short-term, but mites can chew holes through them and get to your food [18] X Expert Source Wilson Christner Pest Management Professional Expert Interview. 31 May 2023. . Try glass or thick plastic containers instead. The lifecycle of flour mites is about one month, so if you can keep everything clean and sealed up tight, any remaining mites should die off. Try to avoid combining old and new foods in the containers. Wait until you've used up all the flour in the bin, give the bin a thorough cleaning and remove any old flour stuck to the bottom, and then refill with the new flour. [19] X Research source"
    },
    {
      "title": "Buy dry goods in small portions.",
      "content": "Buy dry goods in small portions. Though it may be a little more expensive than buying in large, bulk quantities, but if you buy smaller portions, you are less likely to have susceptible foodstuffs sitting around for long periods of time. If they sit in a humid environment for too long, they may become damp and start to mold and start another infestation of mites. [20] X Research source Make sure you inspect all packaging before bringing dry goods home. Make sure they are not damp or damaged and that they were not stored on a damp shelf. [21] X Research source"
    },
    {
      "title": "Tape bay leaves in your containers or in the cupboard where you store food.",
      "content": "Tape bay leaves in your containers or in the cupboard where you store food. Flour mites, cockroaches, moths, rats, weevils, and many other pests are said to hate the smell of bay leaves and will avoid your dry goods if they are present. You can put the leaves right into the container (the taste won't leech into your food) or tape them to the lid of the container or inside the pantry or cupboard. There are conflicting reports about whether to use dry or fresh bay leaves. People have reported success with both, so buy whatever is easiest for you and see how it works. [22] X Research source"
    },
    {
      "title": "Store pet food away from your other dry goods.",
      "content": "Store pet food away from your other dry goods. The regulations for pet foods aren't as strict as ours, and they may be more likely to harbor pests. However extruded pet foods ( those that are dry and formed into shapes) are processed at high temperatures and have low water activity. You will be very unlucky to have a problem with these. Store these in airtight containers away from your own foodstuffs. However do separate as indicated - your pets dont want your human food contamination contamination."
    }
  ]
}