{
  "url": "https://www.wikihow.com/Get-Rid-of-a-Botfly-in-a-Dog",
  "title": "How to Get Rid of a Botfly in a Dog",
  "steps": [
    {
      "title": "Look or feel for noticeable swelling beneath the skin.",
      "content": "Look or feel for noticeable swelling beneath the skin. When botflies burrow into your pup’s skin, they create visible lumps or bumps about 1 centimetre (0.39 in) wide. If your dog has long fur that hides the bump, you might feel it while you’re petting them. Lumps are most often found around the face or neck since botflies enter through orifices like the nose or mouth before they creep their way towards the skin. [1] X Research source A botfly wound probably won’t be obvious right away, but will get bigger as the larva grows inside your dog’s body. Other visual symptoms might include discharge, bleeding, or a skin abscess. Behavioral symptoms can include lethargy, loss of appetite, vomiting, or scratching and licking of the area."
    },
    {
      "title": "Check the center of the bumps for a small hole.",
      "content": "Check the center of the bumps for a small hole. This is the botfly larva’s breathing hole—it burrows through the surface of the skin so it can get fresh air. The hole will get bigger the longer the larva is inside (eventually, it will exit your dog through this hole if it’s left untreated). Sometimes, you’ll actually be able to see the larva peeking out. [2] X Research source"
    },
    {
      "title": "Inspect your dog’s skin for cysts.",
      "content": "Inspect your dog’s skin for cysts. It’s possible you won’t notice a botfly larva wound until after the parasite has left your dog. These empty cysts are usually more dangerous than an active larva—they can become infected or turn into an abscess in your dog’s skin if left untreated. Look for bumps that may be discolored or oozing. [3] X Research source Infected cysts usually itch or irritate your dog. Keep an eye out for excessive scratching, biting, or licking. By licking, your dog can introduce more bacteria into the area and worsen the issue. You can put an Elizabethan collar on the dog to block them from licking the area. The infection in a cyst can spread to other parts of your dog’s body or organs."
    },
    {
      "title": "Take your dog to the vet right away.",
      "content": "Take your dog to the vet right away. A veterinarian can accurately diagnose and treat a botfly infestation or wound fairly easily. They’ll take a look at the bump (and perform a CT scan if needed) to confirm it’s a botfly and rule out other parasites or infections. Botflies are officially diagnosed when the vet can see the larva inside the lump. [4] X Research source Botflies are usually more disgusting than they are dangerous and aren’t considered a medical emergency. However, the sooner they’re removed, the lower the chances of infections or complications are."
    },
    {
      "title": "The vet will give your dog anesthesia.",
      "content": "The vet will give your dog anesthesia. A local anesthetic around the infected area is common, but the vet may sedate your dog if they’re jumpy or uncooperative. This is to make sure your pup stays relaxed and pain-free during their procedure! They will also trim or shave the fur around the wound since it will be matted with discharge (and so they can access the wound easier). [5] X Research source Once the wound is numbed and cleared of fur, the vet will disinfect the area for larva removal."
    },
    {
      "title": "The vet will use mosquito forceps to manually remove the larva.",
      "content": "The vet will use mosquito forceps to manually remove the larva. Mosquito forceps are like tiny scissors that let the vet grip the botfly without squeezing it too hard. They’ll be careful to remove the bug in one piece—if it rips or falls apart, the wound could get further infected or your dog could experience an allergic reaction. [6] X Research source"
    },
    {
      "title": "The vet will perform surgery if the larva is too deep.",
      "content": "The vet will perform surgery if the larva is too deep. It happens rarely, but botfly larvae have been known to move into a dog’s eyes, brain, spinal cord, or respiratory system if left untreated for too long. When this happens, a more invasive and lengthy procedure is needed. Your dog will be fully sedated and the vet will surgically remove the larva. [7] X Research source Larvae that burrow too deep are more likely to cause permanent side effects, like blindness or nerve damage. The vet will be careful to remove them without causing further harm. Bring your dog to the vet as soon as you notice the botfly wound for the first time to prevent the infection from escalating to this stage."
    },
    {
      "title": "When the larva is gone, the vet will sanitize the wound.",
      "content": "When the larva is gone, the vet will sanitize the wound. They’ll flush it out with a sterile saline solution or an antiseptic to reduce the chance of post-procedure infection. If the skin around the wound is severely infected or damaged already, they may debride (surgically remove) the tissue. [8] X Research source Most wounds will heal naturally through granulation (letting new skin grow over the wound). Large or severe wounds may need bandages or stitches. Your vet will give you instructions on how to keep the wound clean while it heals. Follow their directions accurately to prevent re-infection!"
    },
    {
      "title": "Your vet might prescribe medication to prevent infection.",
      "content": "Your vet might prescribe medication to prevent infection. The vet will examine the wound after the larva is gone to determine whether an antibiotic or parasiticide is necessary to prevent a secondary infection (an infection that happens after treatment). It’s not always necessary—it just depends on how long the larva was in your dog’s skin and how much damage it caused. [9] X Research source Follow the prescription directions for the full recommended time to keep your dog healthy (and prevent another trip to the vet’s office)."
    },
    {
      "title": "Monitor the wound for signs of infection while it heals.",
      "content": "Monitor the wound for signs of infection while it heals. Your vet will tell you what complications to watch out for after your dog’s procedure. Look for symptoms like swelling, discharge, discoloration, or delayed healing. If you notice these symptoms, contact or visit your vet right away for further instructions or treatment. [10] X Research source Prognosis for your dog is excellent! Once the botfly larva is gone and the wound is disinfected, it will heal in about 2 weeks with proper care."
    },
    {
      "title": "No, don’t remove a botfly yourself because of the risk of infection.",
      "content": "No, don’t remove a botfly yourself because of the risk of infection. Home remedies often suggest sealing the larva’s air hole with petroleum jelly, bacon grease, or even duct tape to suffocate the parasite. These methods might kill the larva, but they do nothing to prevent or treat infection. Without anesthesia, you also risk causing your dog pain while you try to remove the larva (they usually have barbs to help them cling to their host’s skin). [11] X Research source If you squeeze the larva too hard during removal, parts of it can stay inside your dog. This leads to toxic substances in their bloodstream or infection of the wound. It’s best to let a vet with parasite removal experience do this. Some vets may use the petroleum jelly trick to lure the larva toward the surface before removing it. [12] X Research source"
    },
    {
      "title": "Keep your dog away from rodents for the most effective prevention.",
      "content": "Keep your dog away from rodents for the most effective prevention. Botflies like to breed and lay eggs near rodent dens and most frequently infect rabbits, squirrels, mice, and rats. Avoid areas where the animals are common and check for burrows and nests around your home or favorite dog parks and walking routes. [13] X Research source Keep your dog on a leash to keep them from sniffing around rodent dens. Avoid leaving food outside and keep your trash cans shut tightly so you don’t lure rats and other botfly-prone critters into your yard. [14] X Research source Use a dog whistle or a special command to get your dog’s attention and bring them to you if they start chasing after a rat or poking their head into a den."
    },
    {
      "title": "Inspect your dog for botfly bumps every day when the weather is warm.",
      "content": "Inspect your dog for botfly bumps every day when the weather is warm. Botflies lay their eggs in the summer and early fall months, so be extra vigilant during this time. Look for the telltale bumps under their skin or give your dog a thorough petting to feel for any lumps obscured by long fur. [15] X Research source Remember, the earlier a botfly is detected and removed, the lower the risk of infection or side effects."
    },
    {
      "title": "Use a dog-safe bug repellent or parasiticide.",
      "content": "Use a dog-safe bug repellent or parasiticide. A pup-friendly bug spray can help prevent botflies from coming near them, as well as mosquitoes, wasps, ticks, and a whole bunch of other creepy crawlies. Ask your vet for recommendations and read the instructions and warnings carefully on any store-bought product. [16] X Research source"
    }
  ]
}