{
  "url": "https://www.wikihow.com/Fix-Sticky-Drawers",
  "title": "How to Fix Sticky Drawers",
  "steps": [
    {
      "title": "Make sure that the drawer is sticking due to humidity.",
      "content": "Make sure that the drawer is sticking due to humidity. This article is aimed at those occasions when humidity is causing the drawer to swell and stick. Obviously, if the culprit of the sticking is a loose screw or splinter, this won't help and you'll need carpentry repairs instead. If it turns out to be something else, simply remove the obstruction or mend it. [1] X Research source Check for loose parts or missing screws. If there are none, check for objects blocking the drawer. If none of the first things seem to be causing the problem, look for swelling (bulging). There may even be moisture present. And consider the humidity levels of the room the drawer is in––anywhere near showers, baths, cooking areas, etc. are likely to have higher humidity than other parts of the house. Or, if you're in a humid climate or season, the entire house may be humid, which will affect your furniture."
    },
    {
      "title": "Soap up the wood.",
      "content": "Soap up the wood. Using very basic soap, (one without moisturizers or oils), soap the wood of the sticky drawers on the sides, slides and bottom side rails. This solution works very well most of the time. In the kitchen and bathrooms, however, where moisture is more common, the soap solution will only help for a very short period of time. This method is best for the doors and windows all across the house. [2] X Research source"
    },
    {
      "title": "Clean the drawers first.",
      "content": "Clean the drawers first. Wipe them down with a damp cloth, and try to remove all dust. (If you've been using the soap method, use a putty knife to remove the built-up soap). [3] X Research source"
    },
    {
      "title": "Spray the drawers with a silicone-based lubricant.",
      "content": "Spray the drawers with a silicone-based lubricant. Like the soap, this is not permanent. The lubricant will, however, last longer, and it won't build up as much as the soap will. [4] X Research source"
    },
    {
      "title": "Clean up!",
      "content": "Clean up! This is extremely important if you use the silicone-based lubricant. If you accidentally sprayed anything other than the drawers with the lubricant, clean it up as soon as possible! It will make the floors very slippery, and if you do not clean it up quickly, it will be nearly impossible to get out. (If you don't trust yourself with the spray, put newspaper down before you spray anything at all). [5] X Research source"
    }
  ]
}