{
  "url": "https://www.wikihow.com/Customise-the-Windows-11-Taskbar-to-Windows-10-Style",
  "title": "How to Customise the Windows 11 Taskbar to Windows 10 Style",
  "steps": [
    {
      "title": "Right-click on an empty space on the taskbar at the bottom of the screen.",
      "content": "Right-click on an empty space on the taskbar at the bottom of the screen. This should reveal a small menu."
    },
    {
      "title": "Click on Taskbar settings.",
      "content": "Click on Taskbar settings . This is the second option."
    },
    {
      "title": "Scroll down to find \"Taskbar behaviors\" and expand the dropdown.",
      "content": "Scroll down to find \"Taskbar behaviors\" and expand the dropdown. You can expand the dropdown by clicking on the \"v\" symbol on the right."
    },
    {
      "title": "Look for the option \"Select the far corner of the taskbar to show the desktop\" and check the box.",
      "content": "Look for the option \"Select the far corner of the taskbar to show the desktop\" and check the box. You can check it by clicking the empty box on the left of the text. The \"Show Desktop\" shortcut immediately shows your desktop and minimises every app window on your screen. If an app freezes, use this shortcut to exit it."
    },
    {
      "title": "Scroll down to find \"Taskbar behaviors\" and expand the dropdown.",
      "content": "Scroll down to find \"Taskbar behaviors\" and expand the dropdown. You can expand the dropdown by clicking the \"v\" symbol on the right. Ignore this step if you already have this menu open."
    },
    {
      "title": "Look for the option \"Taskbar alignment\" and open the selection menu on the right.",
      "content": "Look for the option \"Taskbar alignment\" and open the selection menu on the right. You can open the selection menu by clicking on the \"v\" symbol on the right, although it may already be expanded."
    },
    {
      "title": "Select Left from the menu.",
      "content": "Select Left from the menu. Notice your taskbar icons shift to the left on doing so."
    },
    {
      "title": "Find \"Taskbar items\" and expand the dropdown.",
      "content": "Find \"Taskbar items\" and expand the dropdown. You can expand the dropdown by clicking on the \"v\" symbol on the right, although it may already be expanded. Ignore this step if you already have this menu open."
    },
    {
      "title": "Look for the option \"Search\" and open the selection menu on the right.",
      "content": "Look for the option \"Search\" and open the selection menu on the right. You can open the selection menu by clicking on the \"v\" symbol on the right."
    },
    {
      "title": "Select \"Search box\" in the selection menu.",
      "content": "Select \"Search box\" in the selection menu. Notice your search icon become a large box in doing so."
    },
    {
      "title": "Find \"Taskbar items\" and expand the dropdown.",
      "content": "Find \"Taskbar items\" and expand the dropdown. You can expand the dropdown by clicking on the \"v\" symbol on the right, although it may already be expanded. Ignore this step if you already have this menu open."
    },
    {
      "title": "Turn the options for \"Copilot\", \"Task view\" and \"Widgets\" on or off as per your preferences.",
      "content": "Turn the options for \"Copilot\", \"Task view\" and \"Widgets\" on or off as per your preferences. Do this by clicking on the toggles on the right. \"Copilot\" was not in the Windows 10 taskbar, so you may want to disable it if you are aiming for the complete Windows 10 feel. Widgets pin certain apps or features to the taskbar for quick access. Task View is a Windows feature that allows you to manage open applications and virtual desktops, as well as a history of recently opened files. Copilot is a Microsoft generative AI feature. It allows you to search for information, generate bodies of text and create images from text prompts."
    }
  ]
}