{
  "url": "https://www.wikihow.com/Do-Leg-Extensions",
  "title": "How to Do Leg Extensions",
  "steps": [
    {
      "title": "Begin by sitting up straight in a chair.",
      "content": "Begin by sitting up straight in a chair. Sit with your upper body straight against the back of the chair. Keep your shoulders back and look forward with your head in a neutral position. Place your hands by your sides and rest them on the chair’s seat or arms for support. [2] X Research source Sit with your knees and ankles hip-width apart, bend your knees at 90-degree angles, and keep your feet flat on the floor. Be sure that your chair allows you to bend your knees at 90-degree angles. If they’re bent at a smaller angle and aren’t aligned straight above your ankle, you may be putting extra stress on your joints."
    },
    {
      "title": "Raise the lower half of your legs so they’re in line with your thighs.",
      "content": "Raise the lower half of your legs so they’re in line with your thighs. Inhale, then exhale as you straighten your knees and raise your legs. Bring your shins and toes toward the ceiling so that they’re parallel with your thighs and the floor. [3] X Research source Be sure to use steady, slow motions instead of swinging your knees or using momentum to jerk your lower legs upward."
    },
    {
      "title": "Hold up your legs for 1 second, then lower them to the starting position.",
      "content": "Hold up your legs for 1 second, then lower them to the starting position. After keeping your legs lifted for a second, inhale as you slowly bend your knees. Using steady motions, lower your feet so they’re once again flat on the floor. [4] X Research source From the starting position with your feet on the floor, exhale and repeat the steps to perform the next rep."
    },
    {
      "title": "Do 3 sets of 10 leg extensions.",
      "content": "Do 3 sets of 10 leg extensions. Rest for 30 to 60 seconds between each set. As a general guide, do 3 sets of 10 reps, but check with your doctor, physical therapist, or a fitness professional for specific instructions. [5] X Research source If you’re raising 1 leg at a time, finish your set on the first leg, then switch sides. Perform the next set with the first leg, then do a set of 10 reps with the other."
    },
    {
      "title": "Exercise with a resistance band for a little more difficulty.",
      "content": "Exercise with a resistance band for a little more difficulty. Hook one end of the band around the back right leg of your chair. Sit in the chair, loop the other end of the band around your right ankle, and grasp the seat of the chair for support. Then perform 1 set of 10 to 12 leg extensions with your right leg. [6] X Research source After the first set, loop the band's ends around the chair’s back left leg and your left ankle. Do a set of leg extensions with your left leg, then switch it up again and complete a second set on each side."
    },
    {
      "title": "Add ankle weights to focus on strength training.",
      "content": "Add ankle weights to focus on strength training. Strap weights around your ankles, sit in your chair, and perform leg extensions. Since you’re adding resistance, do 1 to 2 sets of 12 instead of 3 sets of 10. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try starting out with 5 pound (2.3 kg) weights. They should offer a challenge, but you should still be able to complete your reps with smooth, steady motions. Ankle weights wrap around your lower shins and stay in place with hook-and-loop fastener straps. You can find them online, at major retailers, and at sporting and gym equipment stores."
    },
    {
      "title": "Do leg extensions on a weight bench with leg rollers.",
      "content": "Do leg extensions on a weight bench with leg rollers. Many weight benches have an attachment at one end that has padded rollers that you can add weight to and use for leg extensions. Position your legs behind the attachment so the roller pads rest against your lower shins. [8] X Research source If your bench has an adjustable seat, raise it so you can sit up straight with your feet flat on the floor, your knees bent at 90-degree angles. Grasp the seat of the bench for support as you do 2 sets of 10 to 12 leg extensions. You can load free weights onto the leg attachment to increase the difficulty. Always start out with fewer weights to avoid hurting yourself. Add weight until your muscles are challenged but you’re still able to finish a full set while maintaining proper form."
    },
    {
      "title": "Use a leg extension machine at the gym for the toughest workout.",
      "content": "Use a leg extension machine at the gym for the toughest workout. A leg extension machine is a chair that has a padded bar that rests against your shins that you use to add weight resistance when you extend your legs. Find the knob that adjusts the machine’s leg pad, set the weight, sit in the machine, grasp the handles by your sides, and do 2 sets of 12 leg extensions. [9] X Research source Set your machine to a weight that’s challenging but still allows you to complete a full set with slow, steady motions. For example, start with a set of 12 repetitions at 50 pounds (23 kg) and add more weight to your next set if you need to. Adjust the pad so it sits just above your feet, and set the seat so you can sit in it with your knees bent at 90-degree angles. With the pad resting against your shins, straighten your legs and raise your feet toward the ceiling. Keep your legs lifted for 1 second, then inhale as you lower them to the starting position. Be sure that your knees are bent at 90-degree angles and aligned over your ankles. If the angle is smaller and your knees extend past your ankles, you’ll put too much stress on your knee joints. See a fitness professional at your gym for specific instructions and safety warnings."
    },
    {
      "title": "Check with your doctor if you’re not used to exercising.",
      "content": "Check with your doctor if you’re not used to exercising. Ask them for advice about becoming more active before you start a new exercise routine. It’s especially important to check with a medical professional if you have a history of medical issues or have recently suffered an injury. [10] X Research source Additionally, if you have an illness or injury, ask your doctor or physical therapist about exercises you should try and those you should avoid."
    },
    {
      "title": "Warm up",
      "content": "Warm up and cool down before and after your workouts. Before any workout, walk briskly or jog lightly for at least 5 minutes to warm up your muscles. Jumping jacks and jogging in place are also good warm-ups. After your workout, walk or jog for another 10 to 15 minutes to ease your muscles back into a resting state. [11] X Research source Working out or stretching muscles without warming up poses an injury risk. Cooling down after a workout can help prevent cramping."
    },
    {
      "title": "Do leg extensions no more than every other day.",
      "content": "Do leg extensions no more than every other day. Include leg extensions on your leg strength training days, then focus on a different group the next day. Your muscles need a rest day to recover after a tough workout. [12] X Research source For example, do 2 sets each of squats, lunges , leg presses, calf raises , hamstring curls , and leg extensions on Tuesday. Then, on Wednesday, give your legs a break and focus on your core or upper body."
    },
    {
      "title": "Stop exercising if you experience pain.",
      "content": "Stop exercising if you experience pain. Listen to your body and never try to push through pain. Additionally, don’t exceed your body’s natural range of motion. If you do experience pain, avoid exercising and try to rest your legs until you feel better. [13] X Research source See your doctor if you experience serious or persistent muscle or joint pain."
    }
  ]
}