{
  "url": "https://www.wikihow.com/Follow-the-BRAT-Diet",
  "title": "How to Stick to the BRAT Diet",
  "steps": [
    {
      "title": "Eat bananas.",
      "content": "Eat bananas. They are easy to digest and high in potassium, which is depleted by vomiting and diarrhea. They are also rich in amylase-resistant starch, which has been shown to end diarrhea more quickly. Some find ripe bananas to be easier on the stomach than the under-ripe bananas. Find what works for you."
    },
    {
      "title": "Prepare white rice.",
      "content": "Prepare white rice. Rice helps to improve the rate of rehydration and decrease the length of illness. You can prepare rice in several ways: Use a rice cooker. Bring 1 cup of rice and 2 cups of water to a boil, then cover and reduce heat to a simmer. Wait until all the water is absorbed, approximately 20 minutes. Cook rice in boiling water until soft enough to eat, then strain."
    },
    {
      "title": "Purchase or make applesauce.",
      "content": "Purchase or make applesauce. Apples are a low fiber food that helps to make your stool firmer. [2] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Raw fruits are difficult to digest, so applesauce is preferred to a whole apple or slices. To make your own applesauce: [3] X Research source Place 6 peeled, cored, and quartered apples in a large pot along with 1 cup of water and 1 tablespoon (14.8 ml) of lemon juice. Bring to a boil, then turn down the heat and simmer for 30 minutes. Use a potato masher if necessary to break up any chunks. Stir in 1 teaspoon of sugar. You can also add ¼ teaspoon of cinnamon, though this may upset your stomach. If purchasing apple sauce, make sure to buy unsweetened or 'no sugar added' applesauce varieties."
    },
    {
      "title": "Make toast.",
      "content": "Make toast. Toast is another easily digested, low fiber food that will help to firm up your stool. [4] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source For added nutrition, you should feel free to spread jam on your toast if you can stomach it. You will probably want to avoid butter and peanut butter, as they are high in fat, which is hard on your stomach. While whole grain toast is typically healthier than white toast, that is not as important here. The high fiber content in whole grain products can lead to gastric upset."
    },
    {
      "title": "Drink plenty of fluids.",
      "content": "Drink plenty of fluids. Don’t eat solid foods if actively vomiting. Instead, stick to liquids high in electrolytes, like pedialyte. [5] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source When vomiting has ended, you can introduce broth, watered down fruit juice, non-caffeinated sodas, or tea with honey. Take small sips, and drink most of your liquids between meals. [6] X Research source Some find that chewing on ice chips helps with dehydration when nauseated."
    },
    {
      "title": "Include simple carbohydrates like saltine crackers, pasta, boiled potatoes or cooked carrots in your diet.",
      "content": "Include simple carbohydrates like saltine crackers, pasta, boiled potatoes or cooked carrots in your diet. Be careful adding sauce to pasta unless you are sure you can stomach it. Be sure to remove the skins from the potatoes. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Eat chicken for protein.",
      "content": "Eat chicken for protein. Plain chicken, trimmed of fat is easy on the stomach and a good source of protein, which is important to aid in recovery. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Plain eggs or egg whites are also very gentle on the stomach and an excellent source of protein."
    },
    {
      "title": "Consume lots of yogurt.",
      "content": "Consume lots of yogurt. The probiotics (good bacteria) in yogurt have been shown to reduce the length and intensity of diarrhea. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The most helpful strains of bacteria include Lactobacillus rhamnosus , Lactobacillus reuteri , Saccharomyces boulardii , Lactobacillus acidophilus , and Bifidobacteria bifidum . [10] X Research source You can also get probiotics in pill or powdered form. The pills and powders usually contain a wide range of helpful strains of bacteria."
    },
    {
      "title": "Make a cup of cocoa or eat a little dark chocolate.",
      "content": "Make a cup of cocoa or eat a little dark chocolate. Research shows that ingredients in cocoa target and disable the protein that causes the intestine to secrete water. A little chocolate can therefore help solidify your stool. If making cocoa, add very little milk, as it is hard on upset stomachs."
    },
    {
      "title": "Try carob powder or psyllium seed.",
      "content": "Try carob powder or psyllium seed. A tablespoon of carob powder mixed with applesauce can help soothe your stomach. 9-30 grams of psyllium seed taken daily will thicken your stool, lessening the intensity of diarrhea."
    },
    {
      "title": "Make sure to avoid foods that will upset your stomach or dehydrate you.",
      "content": "Make sure to avoid foods that will upset your stomach or dehydrate you. While it is important to get back to a normal diet as quickly as possible, you should start with the simpler foods listed here and add others slowly. Be careful to avoid: [11] X Research source Fatty and greasy foods, especially fried food. Dairy products other than yogurt. [12] X Research source Raw or dried fruits and vegetables, and full-strength fruit juice. Caffeine and alcohol; they are diuretics (things that dehydrate you). Desserts and candy; sugary foods are hard to digest. Salty foods; too much salt and not enough water will worsen dehydration."
    }
  ]
}