{
  "url": "https://www.wikihow.com/Cope-when-Your-Abuser-Passes-Away",
  "title": "How to Cope when Your Abuser Passes Away",
  "steps": [
    {
      "title": "Accept your feelings.",
      "content": "Accept your feelings. Let yourself feel your emotions, whatever they might be, without judging yourself. Avoid feeling guilty or trying to shut your emotions down. Allowing your feelings to run their course is a necessary part of the grieving and recovery process. [1] X Research source Remind yourself there is no right way to grieve. All emotions are acceptable to have and need to be acknowledged in order to heal. It’s common to feel positive emotions, such as relief, along with negative ones when you learn of your abuser’s death. For example, you might feel relieved and free after the death. You might immediately feel more hopeful about your future free of abuse. This is natural, and you don’t need to feel bad about it. You may find that you’re experiencing a jumbled mess of conflicting emotions. To gain some control over them, try to sort through them and name them. Journaling can be a great way to do this."
    },
    {
      "title": "Avoid sweeping the abuse under the rug.",
      "content": "Avoid sweeping the abuse under the rug. People often say that it’s wrong to speak ill of the dead. However, after your abuser’s death, addressing the ways their abuse hurt you is a necessary part of healing. If talking about your experience helps you, don’t hold back from sharing your thoughts and feelings with supportive friends and family or your therapist. [2] X Research source Be selective about who you talk to. Some people may be less than supportive of you, especially if you’ve never come forth about the abuse before. The abuser’s family and friends may be unwilling or unable to believe that their loved one would be capable of hurting others."
    },
    {
      "title": "Find ways to channel your anger.",
      "content": "Find ways to channel your anger. After your abuser passes away, you might feel a fresh wave of anger about what they did to you, or you might feel angry that they never apologized or answered for their wrongdoings. Find healthy ways to let your anger out, instead of letting it corrode you. Go for a long run, tear up a piece of paper, or scream into a pillow. [3] X Research source If you’re having a hard time managing your anger or feel like you might hurt yourself, seek emergency counseling right away."
    },
    {
      "title": "Make a list of ways you can give yourself closure.",
      "content": "Make a list of ways you can give yourself closure. Think about what kind of unresolved feelings you still have about your abuser. Even though you can’t make things right with them, you may be able to find other ways to give yourself a sense of peace about what happened. [4] X Research source For example, you could write a letter to your abuser or create a collage that represents your feelings."
    },
    {
      "title": "Attend the memorial service, if you'd like.",
      "content": "Attend the memorial service, if you'd like. If you feel up to it, you might like to attend the funeral or memorial service for your abuser. Doing so may help you to get closure, and realize that the abuse is finally over. However, be warned that you might get upset at this service. Everyone will likely speak highly of the deceased, which may be a completely different picture of the person you knew. Bring someone along for emotional support to help you cope with the pain or resentment you might experience. [5] X Research source"
    },
    {
      "title": "Call a friend.",
      "content": "Call a friend. Whether you’ve just gotten the news of your abuser’s passing or you’re still struggling to process it after the fact, reach out for help sooner rather than later. Having a supportive friend by your side can help you cope with all the new emotions you’re flooded with, especially if the death occurred unexpectedly. [6] X Research source If your friend lives nearby, ask them if they can come and see you in person. Having someone by your side physically is often more comforting than just talking on the phone. Say, \"I just got a call that my father has died. I don't know what to think or how to feel. Can you come over?\""
    },
    {
      "title": "Spend time with people who lift you up.",
      "content": "Spend time with people who lift you up. As you recover from the emotional shock of your abuser’s death, surround yourself with friends and family who make you feel loved and respected. Social support is one of the biggest factors in how well people recover from grief and other strong emotions. [7] X Research source Avoid falling into the common trap of seeking out people who remind you, in some way, of the person who hurt you."
    },
    {
      "title": "Volunteer your time to help others.",
      "content": "Volunteer your time to help others. Once you have worked to process your emotions and associations with your abuse and grief, you may want to volunteer your time to help others. Making a positive difference in the world can help you feel fulfilled. Look for a volunteer position in your community that’s meaningful to you. For instance, you might find it therapeutic to help other survivors of abuse. However, you should not do this until you have processed your own abuse and taken steps to heal yourself. It can bring up your own issues, making you unavailable for the other person, and also further complicating their and your own issues."
    },
    {
      "title": "Seek spiritual support.",
      "content": "Seek spiritual support. If you are spiritual, turn to your faith and your spiritual community for support. Talk to a member of clergy or a spiritual guide. Devote some extra time to prayer. If you are not religious, meditating regularly or spending time in nature can give you a sense of peace and connection with the world."
    },
    {
      "title": "See a therapist.",
      "content": "See a therapist. If you’re having a hard time coming to terms with your abuser’s death, a mental health professional can help you work through your emotions. With a therapist’s help, you can learn to deal with painful memories, cope with unresolved feelings, and reach a state of acceptance. A therapist can also provide you with a safe environment to explore conflicting emotions about the abuse and loss. [8] X Research source"
    },
    {
      "title": "Relax your muscles.",
      "content": "Relax your muscles. Negative emotions like stress, anger, and grief often cause your muscles to tense up. To relax, do deep breathing exercises or meditate regularly. Letting go of the tension in your body will help you let go of your emotional tension, too. [9] X Research source One simple meditation exercise you can try is to sit quietly and focus on your breath. Breathe in for a count of four, hold it for a count of four, and then release. When your mind wanders, gently return your thoughts to the pattern of your breathing. Meditation also helps you establish the habit of mindfulness, which can help you deal with tough emotions."
    },
    {
      "title": "Find reasons to laugh.",
      "content": "Find reasons to laugh. Humor lowers your stress levels while making you feel more optimistic about life. Take your mind off your abuser’s passing by watching funny movies and comedy shows or spending time with friends who can make you laugh. [10] X Research source"
    },
    {
      "title": "Give your body the nutrients it needs.",
      "content": "Give your body the nutrients it needs. The additional stress can contribute to dehydration, so help yourself feel better by drinking plenty of water and eating a balanced diet. If you have a hard time eating, try nibbling on small, healthy snacks throughout the day instead of forcing yourself to eat a large meal. [11] X Research source Try snacking on some fresh fruit or veggies and hummus. You could also make a yogurt parfait or oatmeal for a healthy and hearty breakfast."
    },
    {
      "title": "Exercise.",
      "content": "Exercise. Working out gives you an outlet for your emotions and forces you to focus on your body instead of your thoughts. It also boosts levels of feel-good neurotransmitters in your brain, improving your mental well-being along with your physical health. [12] X Research source If you’re feeling unmotivated, start with a gentle workout. A daily 20-minute walk is much easier to commit to than an hour-long run, and it will still improve your health and mood."
    }
  ]
}