{
  "url": "https://www.wikihow.com/Drinking-Games-for-Couples",
  "title": "The 25 Best (and Spiciest) Drinking Games to Play as a Couple",
  "steps": [
    {
      "title": "Ask one another personal questions to see how well you know each other.",
      "content": "Ask one another personal questions to see how well you know each other. Write several trivia questions about yourself and the relationship (and have your partner do the same). Put them on paper slips in a bowl; they can be general, deep, or even naughty—it’s up to you! Then, take turns asking questions. If either of you answers incorrectly, you must then take a drink. [1] X Research source Questions could include: “What’s my birthday?” “Where did we first meet?” “What’s my favorite color?” “What was the first movie we watched together?” “What’s my biggest pet peeve?”"
    },
    {
      "title": "Compete with your partner to guess the outcome of a coin flip.",
      "content": "Compete with your partner to guess the outcome of a coin flip . All you need for this game is a quarter. Flip it, and have your partner guess whether it landed on “Heads” or “Tails.” If they’re wrong, they have to take a sip of their drink. Flip the coin again and let them try to guess it; this time, they must remove a piece of clothing if they’re wrong, and their turn is over. Take turns doing this for as long as you like! [2] X Research source"
    },
    {
      "title": "Find out how well you and your partner can catch the other’s lies.",
      "content": "Find out how well you and your partner can catch the other’s lies. Begin the game by telling your partner 3 things about yourself they don’t already know—2 true stories and 1 lie. From there, they must guess which statement is a lie; if they guess wrong, they have to take a drink. If they guess correctly, you take a drink. Keep taking turns and playing Two Truths and a Lie until you’re ready to call it a night. [3] X Research source For example, you could say, “I’ve watched every episode of SpongeBob ,” “I once broke my arm while riding my bike,” and “I’m allergic to shellfish.” If the lie is “I’m allergic to shellfish,” and your partner guesses the lie is, “I’ve watched every episode of SpongeBob ,” you’d have to take a drink. However, if your partner guessed that the lie was “I’m allergic to shellfish,” they’d be right, and they’d have to take a drink."
    },
    {
      "title": "Find creative ways to arouse your partner when you play Spin the Bottle.",
      "content": "Find creative ways to arouse your partner when you play Spin the Bottle . To play this version of the game, set up a number of sexy objects (like chocolate or a blindfold) in a circle and take turns spinning the bottle with your partner. When they spin the bottle, tell them to do something sexy (and inventive) with whatever object the bottle landed on. Then, every time you or your partner completes an act, take a drink for good measure! [4] X Research source For this game, you can use innocent (but easily repurposed) things like syrup or whipped cream for your circle of objects. Alternatively, you could use decidedly naughty objects like handcuffs or undergarments."
    },
    {
      "title": "See how well you and your partner can draw while drinking alcohol.",
      "content": "See how well you and your partner can draw while drinking alcohol. Start drawing something and let your partner guess what it is—but for every wrong answer, pour some alcohol into their glass. If you want to, you could also add a 20-second timeframe to the guessing; if they can’t guess what you’re drawing in time, pour out more alcohol. Take turns doing this, and take a drink after each round. [5] X Research source When you play Pictionary , try drawing something simple and possibly romantic (like a heart or a pair of lips) to begin with. Then, draw more complex things as the game goes on. To make the game more sensual , trace your drawing onto your partner’s skin with a fingertip instead of a pencil and paper!"
    },
    {
      "title": "Use Naughty Jenga as sexy foreplay between you and your partner.",
      "content": "Use Naughty Jenga as sexy foreplay between you and your partner. If you already have a Jenga game on hand, this is played similarly. Set up the Jenga blocks and take turns removing blocks from the tower; then, for each block you pull, dare your partner to do something naughty or kinky. They can either accept your dare or take a sip of their drink. [6] X Research source You could ask your partner for things like a lap dance , a strip tease, a shoulder massage , or even just a sensual kiss . Whatever you ask for, ensure you and your partner are comfortable doing it. It’s only a game as long as everything is consensual."
    },
    {
      "title": "Discover how well you and your partner can hold your laughter.",
      "content": "Discover how well you and your partner can hold your laughter. To play this game, simply take turns trying to make one another laugh! You could write down funny (or naughty) phrases, act out something goofy, or pull up a hilarious video on YouTube or TikTok. You must each try to keep a straight face no matter what, and if you can’t, you have to take a drink. [7] X Research source Remember not to let your partner see any funny phrases or videos you’re preparing beforehand, and don’t peek at any of theirs, either."
    },
    {
      "title": "Compare all the wild things you’ve done while playing Never Have I Ever.",
      "content": "Compare all the wild things you’ve done while playing Never Have I Ever . Make a statement beginning with “Never have I ever…” and say something you haven’t done. If your partner has done that thing, they must take a drink. Take turns doing this, and together, you can get tipsy and discover all the crazy things you and your partner have done. [8] X Research source “Never have I ever kissed a stranger.” “Never have I ever gotten stranded in another country.” “Never have I ever been to a tropical island.” “Never have I ever dated someone for more than a year.”"
    },
    {
      "title": "Guess a random card’s color in Red and Black and drink if you’re wrong.",
      "content": "Guess a random card’s color in Red and Black and drink if you’re wrong. Shuffle a deck of cards, pull one out face-down, and have your partner guess whether it’s red or black. If they’re wrong, they must take a sip of their drink. Take turns doing this—and on future turns, if you guess the color, then guess whether this card is higher or lower than the last. If either of you is incorrect on that count, remove a piece of clothing! [9] X Research source This is an especially popular game to play on Valentine’s day. This is because the color red is typically associated with romance (and therefore Valentine’s day)."
    },
    {
      "title": "Answer questions or take on wild challenges while playing Truth or Dare.",
      "content": "Answer questions or take on wild challenges while playing Truth or Dare. Take turns with your partner asking one another, “Truth or dare?” If you pick dare, you must do whatever you’re dared to do. If you pick truth, you have to answer a question truthfully. However, if you don’t want to complete the dare or answer the question, you can take a sip of your drink instead. [10] X Research source Since you’re playing this game as a couple, try asking naughty (or romantic) truth questions—and giving your partner equally naughty dares. Truths could include, “What part of my body turns you on most?” or “Do you like PDA?” Dares could include, “Dress up as your favorite singer and sing a romantic song,” or “Show me the most embarrassing photo on your camera roll.” It goes without saying that if you ever feel uncomfortable, you can quit the game without answering a question, completing a dare, or taking a drink. You should never feel pressured to do something you’d rather not do. You can play truth or dare without revealing too much by using the \"skip\" option. If a truth question is too personal or uncomfortable, you can always use the \"skip\" option and move on to the next question. Respect each other's comfort level. If your partner does not want to answer a truth question or do a dare, respect their boundaries and move on to something else. Remember that the goal is to have fun and strengthen your bond with your partner, so keep it light-hearted and enjoyable for both of you."
    },
    {
      "title": "See how well you can recall words from memory without any errors.",
      "content": "See how well you can recall words from memory without any errors. Start the game by saying, “I am going to the bar to get…” and finish the sentence with your drink of choice. Then, have your partner repeat the phrase and add their drink of choice as well. Continue taking turns and doing this until one of you makes a mistake. The loser must then take a drink! [11] X Research source For example, if you started the game by saying, “I am going to the bar to get a margarita,” your partner could follow up with, “I am going to the bar to get a margarita and a gimlet,” and so on."
    },
    {
      "title": "Get closer to your partner with a romantic game like Find the Spot.",
      "content": "Get closer to your partner with a romantic game like Find the Spot. To start, think of a spot on your body that you’d like your partner to kiss. They get 3 guesses to try and figure out what body part you’re thinking of; if they’re wrong, they have to take a sip of their drink and guess again, but if they guess correctly, both of you must take a drink (and, presumably, fulfill your kissing fantasy). You could even turn this into a strip game if you wanted to. Every time you or your partner guess incorrectly 3 times in a row, you have to remove a piece of clothing."
    },
    {
      "title": "Try to get matching answers with your partner in this fun quiz game.",
      "content": "Try to get matching answers with your partner in this fun quiz game. Prepare a bowl of paper slips with questions written on them beginning with “Who is most likely to…?” Take turns pulling a slip and reading it out loud; then, you and your partner must point to the person you feel is most likely to do whatever is on the paper. Any time you disagree, both of you have to take a drink. [12] X Research source Questions could include: “Who is most likely to cry during a sad movie?” “Who is most likely to keep a secret?” “Who is most likely to wake up late on a weekday?” “Who is most likely to say sorry first after an argument?”"
    },
    {
      "title": "Find out how well you and your partner can maintain eye contact.",
      "content": "Find out how well you and your partner can maintain eye contact. Sit down opposite your partner and stare deeply into each other’s eyes for as long as you can. The first person to blink or look away loses and has to take a sip of their drink. It’s that easy! This is a great way to build up some romantic tension between you and your partner while also playing a fun drinking game."
    },
    {
      "title": "Make this classic even sillier with romantic acting prompts and drinks.",
      "content": "Make this classic even sillier with romantic acting prompts and drinks. Prepare some cards or slips of paper with an object, person, place, or action on them and place them, folded, in a bowl. To play Charades , take turns with your partner drawing a slip and acting out whatever is on it without saying a word. Whoever isn’t acting must guess what the word is; if you guess wrong, you have to take a drink. [13] X Research source If you own a charades game, you could always use the prompts from that to fuel your drinking game! Otherwise, many online generators can give you charades prompts. Alternatively, you could try playing “naughty” charades with prompts like “licking a lollipop” or “ Sex and the City .”"
    },
    {
      "title": "Play this question-based game only if you and your partner are serious.",
      "content": "Play this question-based game only if you and your partner are serious. Take turns with your partner asking each other relationship questions. You can answer truthfully or take a sip of your if you’d rather not answer. Since the questions in this game can get pretty personal and deep, make sure you’re both comfortable with them! Questions could include: “What made you want to ask me on a second date?” “When did you realize that I was the one?” “What do you love most about me?” “What do you most look forward to in our future together?”"
    },
    {
      "title": "Turn this classic into a drinking game with a sensual twist.",
      "content": "Turn this classic into a drinking game with a sensual twist. Play Go Fish exactly as you would in a normal game, with a couple of added rules. When you ask your partner for a card, and they don’t have it, you have to take a drink. If they have the card you want, they have to drink. Then, anytime one of you makes a set of 4 cards, the other must take off a piece of clothing and finish off their drink. Sexy Go Fish is a great way to get intimate with your partner if you keep playing until one (or both) of you are mostly disrobed. Check in with your partner first to ensure both of you are comfortable with the prospect of removing clothes as you play."
    },
    {
      "title": "Create your own game board with naughty rules when you play Pizza Box.",
      "content": "Create your own game board with naughty rules when you play Pizza Box. Start by grabbing an empty pizza box (or, if you don't have one, a large piece of paper). Toss a coin on it, and draw a circle of any size around that spot. In the circle, write a rule or dare. Then have your partner toss a coin; if it lands in your circle, they have to follow the rule there. If not, they can draw a circle and write their own rule. [14] X Research source The rules you come up with can be naughty, but don’t have to be. It could be goofy, like “hop on one foot while singing a Britney Spears song” or spicy, with a dare like, “Kiss the part of my body you love most.” Include a drinking component to your made-up rules to turn this into a drinking game. For example, you could write that your partner has to finish their drink or mix new drinks for both of you. You can keep playing this game until there are no more spaces left on the pizza box."
    },
    {
      "title": "Turn Russian Roulette into an easy, fast-paced couples’ drinking game.",
      "content": "Turn Russian Roulette into an easy, fast-paced couples’ drinking game. Divide a set of shot glasses between you and your partner. Fill 2 glasses with clear alcohol and the rest with water (and have your partner do the same). Shuffle them around until you can’t tell which is which; then, take turns drinking the contents of a shot glass. The first person to taste alcohol has to do a dare set by the other player! [15] X Research source You could dare your partner to do something romantic, like sing you a love song, or ask them to do something more raunchy, like dancing suggestively to a song. On future rounds, start filling more of the shot glasses with alcohol to ramp up the stakes! As always, make sure your partner is comfortable with a dare before asking them to do it, and remember that you don’t have to do anything you aren’t comfortable with."
    },
    {
      "title": "Test your partner’s vocabulary with a sensual Guess the Word game.",
      "content": "Test your partner’s vocabulary with a sensual Guess the Word game. Think of a few romantic words before you start playing; then, on your turn, trace the word onto your partner’s back or the nape of their neck with your fingers. If they can guess the word correctly, you must take a drink. If they’re wrong, they must take a shot. Take turns doing this (and enjoying one another’s touch!) For example, you could trace the word “HEART” letter by letter across your partner’s skin. Trace an H first, then an E, an A, an R, and a T. Then, let them guess the word."
    },
    {
      "title": "Add consequences to every ladder and snake in this classic game.",
      "content": "Add consequences to every ladder and snake in this classic game. To begin, play Snakes and Ladders exactly as you normally would, rolling dice and moving across the board to try and be the first to reach the final square. Then, add the drinking component: your partner must drink every time you climb a ladder (and vice versa). Similarly, you or your partner must drink each time one of you slides down a snake! [16] X Research source"
    },
    {
      "title": "Compete with your partner to see who loses their clothes the fastest.",
      "content": "Compete with your partner to see who loses their clothes the fastest. To play, take turns rolling a 6-sided dice. If the die roll is even, you or your partner has to take a drink. If the number is odd, you must take off a piece of clothing. It’s as simple as that! You can end the game when one of you is mostly disrobed or wherever you’d like. [17] X Research source You could also assign additional activities to each dice number. For example, rolling a 1 might mean kissing your partner, rolling a 2 might mean giving them a massage, and so on."
    },
    {
      "title": "Play Queen Card and see who has the luck of the draw.",
      "content": "Play Queen Card and see who has the luck of the draw. Grab a complete deck of playing cards and remove 3 Queen cards from it, leaving 1 Queen card still in the deck. Then, shuffle the cards thoroughly and place them in the middle of the table. From there, take turns drawing a card one by one until you or your partner gets the Queen card, and whoever does must take a drink. If you want, you could add an additional consequence to losing a round—for example, the loser might have to sing a song or give the winner a strip dance."
    },
    {
      "title": "Find out how quickly you can shout out information about your partner.",
      "content": "Find out how quickly you can shout out information about your partner. To play Speed Facts, simply take turns quickly saying a fact that you know about the other person. If one of you can’t think of anything within 5 seconds or takes more than 5 seconds to make a statement, you lose the round and must take a drink. [18] X Research source You can end a game of Speed Facts whenever you like! It’s a cute way to see how much information about your partner you can spit out at the drop of a hat."
    },
    {
      "title": "Retell your favorite personal stories with a goofy twist in Forbidden Word.",
      "content": "Retell your favorite personal stories with a goofy twist in Forbidden Word. Think of a story you’d like to hear your partner retell—it can be funny, heartwarming, or anything in between. Then, think of a word they’d probably use to tell that story and declare this a “forbidden word.” Your partner must then tell the story without using that word, and if they slip up, they must take a drink. The same goes for you, too! For example, if you ask your partner to tell a story about their day at the beach, you could outlaw the word “sand.” Then, they’d have to recite the story without using that word at all."
    }
  ]
}