{
  "url": "https://www.wikihow.com/Create-Conversation-With-an-Untalkative-Boyfriend",
  "title": "How to Create Conversation With an Untalkative Boyfriend",
  "steps": [
    {
      "title": "Practice active listening.",
      "content": "Practice active listening. Make sure you’re being a good listener when he speaks. If he feels like you’re ignoring him or that you’re distracted, he may not want to open up. Give your full attention when he’s talking and don’t get distracted by the television, your phone, or other things. [1] X Research source Nod occasionally and appear engaged by leaning in and keeping an open posture. Maintain eye contact to show that you’re engaged. Encourage him to go on by saying, “Uh huh” or, “I see” to show that you’re listening."
    },
    {
      "title": "Remember key points.",
      "content": "Remember key points. When your boyfriend speaks, remember the important things he brings up. If he brings up the same topic a couple times, this likely means it’s something that’s important to him or that he cares about. If you’re looking for something to discuss, ask him for an update on something he brought up before. [2] X Research source For example, say, “You were working on a project in your garage, did you finish it?”"
    },
    {
      "title": "Do an activity he enjoys.",
      "content": "Do an activity he enjoys. Give him opportunities to open up that might appeal to him. Offer to do something that both of you like. This will put him in a relaxed and familiar state of mind, which may make him feel more open and willing to talk. This also allows you to have more things to talk about regarding the activity. Maybe you both enjoy playing video games, ice skating, or watching movies."
    },
    {
      "title": "Give positive reinforcement.",
      "content": "Give positive reinforcement. When your boyfriend opens up or talks, give him some positive feedback. Show your gratitude for his openness. This will show him that you appreciate when he opens up and want him to do more of it. [3] X Research source For example, say, “I always enjoy learning more about you” or, “I didn’t know that about you, thanks for sharing.”"
    },
    {
      "title": "Initiate the conversation.",
      "content": "Initiate the conversation. Don’t expect your shy boyfriend to start every conversation. He may not know what to talk about or how to begin. If he tends to be a quiet guy, take the lead in talking. Open conversations and don’t be afraid to be the first to talk. [4] X Research source Start with a simple, “How was your day?” or, “How are you doing?”"
    },
    {
      "title": "Start with something simple.",
      "content": "Start with something simple. Don’t go straight for the difficult topics or personal questions. Start by asking him simple things or topics you know he’s interested in. For example, if he likes working on cars, ask him about his most memorable experience. If he enjoys sports, ask him to tell you about what he plays and why he likes it. [5] X Research source Show an interest in what he enjoys and approach things you don’t know with curiosity."
    },
    {
      "title": "Ask engaging questions.",
      "content": "Ask engaging questions. Asking questions shows that you’re listening and interested in what your boyfriend is talking about. If he brings something up, make a point to ask at least one question about it before changing topics. Engage your natural curiosity and find ways to connect. [6] X Research source Ask open-ended questions. For example, instead of saying, “Was work good?” say, “How was work?” For example, if your boyfriend is telling you about his family, ask, “How many siblings do you have?” However, don’t bombard your boyfriend with lots of questions. This can feel overwhelming and make him shut down. Space out these questions over the conversation, and give him time to think over his answers."
    },
    {
      "title": "Open up to him.",
      "content": "Open up to him. If your boyfriend doesn't like to talk much and/or is shy, perhaps he likes to listen. Talk about what's happening in your life and ask for his advice on any issues you might be having. Make sure to try to include him while you're talking by asking for his opinion or feedback on things. [7] X Expert Source Kelli Miller, LCSW, MSW Relationship Counselor Expert Interview. 11 June 2020. Avoid whining or complaining. This isn’t the way to connect with your boyfriend."
    },
    {
      "title": "Avoid asking what’s wrong.",
      "content": "Avoid asking what’s wrong. If you think something’s up because your guy isn’t talking, don’t assume something is wrong. Jumping to thinking something is wrong might annoy him, especially if he feels just fine. Instead of thinking something is wrong, accept his silence as okay. If you want to know why your boyfriend is silent, say, “What’s going on?” instead of jumping to conclusions. Your boyfriend may not like being accused of feeling low or sad or mad just because he is quiet."
    },
    {
      "title": "Don’t make it personal.",
      "content": "Don’t make it personal. Especially if you know that your boyfriend tends to be quiet or untalkative in general, don’t think he’s ignoring you or withholding. He’s not mad, upset, sad, or annoyed. He’s probably just quiet and needs some time to warm up or feel engaged. [8] X Research source However, if he’s talkative with other people but just not you, there might be a problem. If you think he is mad and there’s reason to be, say something."
    },
    {
      "title": "Build his trust",
      "content": "Build his trust . Your boyfriend should feel comfortable and accepted by you. Use small moments to increase trust. Find some moments to connect and show that you’re attentive. [9] X Expert Source Kelli Miller, LCSW, MSW Relationship Counselor Expert Interview. 11 June 2020. Turn toward your boyfriend, not away from him. [10] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, if he looks sad, say, “You look sad. What’s going on?”"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Give him time to open up. He may be nervous or may not have much experience with relationships. If you notice yourself getting irritated with him or feeling like he’s not talking enough, take a few steps back. If you’re committed, then you need to find some peace with where he’s at, whether you like it or not. Notice when you’re feeling frustrated with him and put the focus on dealing with your own feelings, not taking them out on your boyfriend. [11] X Research source For example, if you’re feeling annoyed at failed attempts to connect, take a few deep breaths. Leave the room for a few minutes so you can return feeling better."
    }
  ]
}