{
  "url": "https://www.wikihow.com/Delete-Followers-on-Instagram",
  "title": "How to Remove Followers on Instagram",
  "steps": [
    {
      "title": "Open the Instagram app by tapping on its icon.",
      "content": "Open the Instagram app by tapping on its icon. Navigate to the Instagram app on your phone, and tap on its icon to open it. Then, if you aren’t already logged in, sign in to Instagram using your username and password. Or, if you’re on a computer, navigate to Instagram's website"
    },
    {
      "title": "Tap on the profile page button to access your profile.",
      "content": "Tap on the profile page button to access your profile. The profile button is usually located at the bottom right of your screen, and features your profile photo. Tap this button to navigate to your profile page. On a computer, this is on the navigation bar on the left of your screen."
    },
    {
      "title": "Tap on “Followers” to see a list of your followers.",
      "content": "Tap on “Followers” to see a list of your followers. The “Followers” button is located near the top of your profile page, next to your profile icon, and features a number that displays how many followers you currently have. [1] X Research source"
    },
    {
      "title": "Tap Remove next to a follower’s username to remove them.",
      "content": "Tap Remove next to a follower’s username to remove them. Scroll through your followers list, or search their name in the navigation bar on the screen, until you find the follower you’d like to remove. Then, tap the “Remove” button next to their name to stop them from following you, and tap “Remove” again to confirm. [2] X Research source Users aren’t notified when you remove them, but they may notice after a while that they’re no longer following you. Removing a follower still allows them to follow you again. Block other users to prevent them from following you."
    },
    {
      "title": "Tap the Instagram app to open Instagram.",
      "content": "Tap the Instagram app to open Instagram. If you're using a computer, navigate to Instagram's website . You'll have to log in with your Instagram account credentials if you aren't already logged in."
    },
    {
      "title": "Access your profile page .",
      "content": "Access your profile page . To do this, tap or click the person icon; for mobile users, this is in the bottom right corner of the screen. It usually displays your profile photo. On a computer, this is on the navigation bar on the left of your screen."
    },
    {
      "title": "Tap or click the “Followers” option.",
      "content": "Tap or click the “Followers” option. This is often to the right of your profile image, and displays your number of followers."
    },
    {
      "title": "Select a follower you want to delete.",
      "content": "Select a follower you want to delete. Browse your list of followers, or search for a specific follower in the search bar. Then, tap on their username. This will take you to their profile, from which you can block them."
    },
    {
      "title": "Tap the three-dot menu ••• on your follower’s profile page.",
      "content": "Tap the three-dot menu ••• on your follower’s profile page. This is in the top right corner of your screen (or to the right of their name on a computer). On Android, this menu is vertical rather than horizontal."
    },
    {
      "title": "Select the “Block User” option.",
      "content": "Select the “Block User” option. On Instagram's site, this option says \"Block this user\". After selecting this option, Instagram will prompt you for confirmation."
    },
    {
      "title": "Confirm that you want to block the user.",
      "content": "Confirm that you want to block the user. When prompted, confirm your choice. This will block your selected user; they will no longer be able to view your posts! Your blocked user will still be able to see your comments on other users' photos, and they will still be able to search for your account; however, they won't be able to access your account. View a list of your blocked users at any time by going into your settings menu and selecting the \"Blocked Users\" tab. Make your account private to avoid having to block other users in the future."
    },
    {
      "title": "Open the Instagram app on your smartphone.",
      "content": "Open the Instagram app on your smartphone. Switching your account from its standard status to \"Private\" means that anyone wishing to follow you will have to request to do so; you are the only person who can approve said request. This gives you greater control over who can access your Instagram. Changing your account to \"Private\" also restricts user access to your comments and likes, with the sole exception being for public posts (wherein your name will appear next to other \"likes\", but your account will still be protected)."
    },
    {
      "title": "Open your profile page by selecting .",
      "content": "Open your profile page by selecting . On mobile, this is on the bottom of your screen. On a computer, this is on the left navigation bar. On either platform, this button may display your profile photo."
    },
    {
      "title": "Select ☰ on mobile, or Edit profile on a computer.",
      "content": "Select ☰ on mobile, or Edit profile on a computer. Do this by tapping the gear icon (iOS) or the three dots (Android) in the top right corner of your screen."
    },
    {
      "title": "Select Account privacy.",
      "content": "Select Account privacy . This button has a lock icon next to it, and contains a series of tabs dedicated to account options; you'll find the \"Private Account\" option at the bottom of this group."
    },
    {
      "title": "Toggle the \"Private Account\" switch to on.",
      "content": "Toggle the \"Private Account\" switch to on. Tapping or clicking the switch will make it move to the right, indicating that your account has been made private, and you’ll be able to approve or deny new follow requests. If you want to disable this setting, simply swipe the switch back and tap \"OK\" on the pop-up window. Note that your current followers will not be affected by this switch. If you want to block some or all of them, you'll need to do so manually."
    },
    {
      "title": "Tap on the Instagram icon to open the app.",
      "content": "Tap on the Instagram icon to open the app. Find the Instagram app on your phone, and tap on its icon to open it. Then, sign in to Instagram using your username and password. Or, if you’re on a computer, navigate to Instagram's website"
    },
    {
      "title": "Tap on the profile page button .",
      "content": "Tap on the profile page button . The profile button is located at the bottom right of your screen on mobile, and usually shows your profile photo. Tap on this button to see your profile page. On a computer, this is on the navigation bar on the left of your screen."
    },
    {
      "title": "Tap on “Followers” to see who follows you.",
      "content": "Tap on “Followers” to see who follows you. The “Followers” button is near the top of your profile page, next to your profile icon, and shows a number that tells you how many followers you currently have. [3] X Research source"
    },
    {
      "title": "Select the “Potential Spam” followers group.",
      "content": "Select the “Potential Spam” followers group. If you have any followers that have been flagged as spam accounts, they’ll display in this special group near the top of your followers list. Tap on this group to view any spam accounts that follow you."
    },
    {
      "title": "Tap on Remove all spam followers, then Remove.",
      "content": "Tap on Remove all spam followers , then Remove . This button mass-deletes all spam accounts who follow you."
    }
  ]
}