{
  "url": "https://www.wikihow.com/Drive-an-Excavator",
  "title": "How to Drive an Excavator",
  "steps": [
    {
      "title": "Determine if the machine is in an ISO or SAE control pattern.",
      "content": "Determine if the machine is in an ISO or SAE control pattern. These are the two standard control patterns for excavators. The difference between the two is that in ISO, the left hand controls the swing and boom and the right hand controls the stick and bucket motions. SAE reverses this pattern, so if you’ve been trained on one, switching to the other is difficult. Most newer excavators have a display in the cab that tells you which control pattern the machine is in. Confirm the pattern before you start using the machine. [2] X Research source Change the control pattern if it isn’t in the setting you want. Some excavators have a button or switch in the cab that makes this change. Look on the display screen for a button to switch the control pattern. On other excavators, the control pattern lever is in the back near the engine. Open the back section and look for a blue or red lever. It should have a mark for each pattern setting. Slide the lever from one setting to the other to switch the pattern. Always consult your owner’s manual before changing the control pattern so you follow the right procedure. If you’re just learning how to drive an excavator, learn in ISO pattern. This is more common in excavators. [3] X Research source"
    },
    {
      "title": "Climb into the cab and adjust your seat position.",
      "content": "Climb into the cab and adjust your seat position. Excavator seats slide back and forth when you pull a lever under the seat to accommodate people of different heights. Check the seat position when you sit down. Make sure your feet can reach the pedals in the front and you can grab all of the handles comfortably. Pull the lever and adjust your seat if you have to. Then fasten your seatbelt for safety. [4] X Research source If you won’t be running the excavator with the door open, then also shut the door. Most excavators have a handle that locks the door, so secure this before starting the machine. Most operators run their machines with the door closed to keep debris out. Sometimes operators keep the door open to communicate with other workers."
    },
    {
      "title": "Turn the key and let the machine idle to warm up.",
      "content": "Turn the key and let the machine idle to warm up. Climb into the cab and look to your right. There is a key and a knob with different positions near the right armrest. Make sure that knob is set to “I” for Idle. Then turn the key to start up the engine. Let the machine run in idle for 5-10 minutes before operating it to warm up. If the weather is cold, run the hydraulic controls through a few cycles before doing any digging."
    },
    {
      "title": "Unlock your controls by raising the red lever on your left.",
      "content": "Unlock your controls by raising the red lever on your left. All excavators have a locking lever on the left side of the cab attached to the armrest. It's usually red. When the lever is down, the joystick controls are locked. Push the lever up until it clicks. This unlocks the controls so you can move the arm and cab. [5] X Research source Never unlock your controls before checking around you to make sure no people or objects are nearby. If someone approaches the cab or you get close to an object you don’t want to damage, flip the lever back down until your cab is clear again."
    },
    {
      "title": "Move the right joystick back and forth to raise and lower the boom.",
      "content": "Move the right joystick back and forth to raise and lower the boom. The boom is the section of the digging arm closest to the cab. In ISO control, the right joystick controls the boom height. Find this joystick in front of the right armrest. Pushing forward raises it and pulling backward lowers it. [6] X Research source Instructions are given in ISO because this is a more common excavator setting. For SAE, reverse the controls to the opposite side."
    },
    {
      "title": "Open and close the bucket by moving the right joystick right and left.",
      "content": "Open and close the bucket by moving the right joystick right and left. The bucket is at the end of the digging arm. The right joystick also controls the bucket position. Push the joystick right to open up the bucket. Push it left to close the bucket. [7] X Research source"
    },
    {
      "title": "Press the left joystick forward and back to move the stick forward and backward.",
      "content": "Press the left joystick forward and back to move the stick forward and backward. The left joystick is located in front of the left armrest and controls the stick and swing for the excavator. The stick is the bottom portion of the arm attached to the boom, and looks like it’s a shin attached to a knee. Press the left joystick forward to push the stick further from the cab. Pull the joystick backward to bring the stick closer to the cab. [8] X Research source Use smooth motions when operating the stick and boom. These use hydraulic systems, so the machines will move as fast as you pull the joysticks. Don’t suddenly let go of the joysticks or the machine will rock quickly."
    },
    {
      "title": "Rotate the cab around by moving the left joystick left and right.",
      "content": "Rotate the cab around by moving the left joystick left and right. Finally, you can rotate the cab with the excavator’s swing control. Pushing the left joystick swings the cab in the direction you're pressing. [9] X Research source The cab moves freely and can complete a 360-degree turn. If you hold the joystick in one direction, the cab will keep spinning."
    },
    {
      "title": "Decide if you want to drive the machine with your hands or feet.",
      "content": "Decide if you want to drive the machine with your hands or feet. Excavators have 2 pedals with handles attached to them in front of the cab. The handles extend up so they're straight in front of you. These pedals can be operated by either stepping on them with your feet or grabbing the handles with your hands. Both work the same way, so it’s a matter of preference for which you choose. [10] X Research source If you’re a beginner, driving with your hands may be easier. Most expert operators prefer using their feet to drive."
    },
    {
      "title": "Push both pedals up to move forward.",
      "content": "Push both pedals up to move forward. Excavator driving controls are simple. To move forward, press both pedals forward at the same time. You can do this with your hands or feet. The amount of pressure you apply determines how fast the excavator moves. [11] X Research source If you’re using your feet, rest them on the top of the pedals and push down there. Always make sure no one is around you before moving the excavator in any direction. An excavator’s stop speed is around 8 mph (13 km/h), so even if you press down as hard as you can, you won’t move very fast."
    },
    {
      "title": "Pull both pedals back to move backward.",
      "content": "Pull both pedals back to move backward. If you want to move backward, just do the opposite motion. Pull back on both handles at the same time to move in reverse. [12] X Research source If you’re using your feet, press on the bottom of the foot pedals to move backward. Shift your feet down with your heels on the floor of the cab. Then press down with your toes touching the bottom of the pedals. Always check behind you before reversing. Some newer excavators have cameras on the back to help while you reverse."
    },
    {
      "title": "Press 1 pedal at a time to turn the excavator.",
      "content": "Press 1 pedal at a time to turn the excavator. The pedals each control 1 of the excavator’s tracks. When you want to turn, press down the pedal on the opposite side that you want to turn. Pressing the left pedal turns the excavator right, and pressing the right pedal turns it left. [13] X Research source If you’re already moving, ease off one of the pedals rather than letting go with both and pressing one again. This results in smoother driving. The same rules apply whether you’re turning backward or forward. Press the left pedal back to move back and to the right. Press the same pedal forward to move forward and to the right."
    },
    {
      "title": "Adjust the cab so it’s perfectly square over the tracks.",
      "content": "Adjust the cab so it’s perfectly square over the tracks. This position is the most stable and balanced for an excavator. Use the left joystick and rotate the cab until it’s square with the tracks. [14] X Research source Most excavators will stay stable if you dig when they aren’t perfectly centered, but while you’re a beginner, always make sure the cab is square until you gain more experience. Once you’ve gotten to the desired position, remove your feet from the foot pedals so you don’t accidentally move while you’re digging. Don't try to drive and dig at the same time until you’re an experienced operator."
    },
    {
      "title": "Extend the stick all the way out in front of you.",
      "content": "Extend the stick all the way out in front of you. Press the left joystick forward until it stops rising. This is the general starting position to prepare for a dig. [15] X Research source Experienced operators can dig with the stick in different positions. While you’re still learning, however, extend the stick completely before digging."
    },
    {
      "title": "Adjust the bucket so the teeth line up with the stick.",
      "content": "Adjust the bucket so the teeth line up with the stick. If you’re digging into dirt, you need a happy medium between opening the bucket all the way and having it entirely closed. Imagine a line continuing out from the end of the stick. Adjust the bucket with the right joystick so the teeth rest on top of that imaginary line. [16] X Research source Don’t try to dig with the bucket fully extended. This drives dirt and debris into the joints and could damage the machine over time."
    },
    {
      "title": "Lower the boom until the bucket enters the dirt.",
      "content": "Lower the boom until the bucket enters the dirt. Press the right joystick backward to lower the boom. Continue lowering until the toothed-section of the bucket enters the dirt, then stop. [17] X Research source Only enter the dirt about halfway up the bucket. Any more and you won’t get an effective scoop."
    },
    {
      "title": "Curl and lift the bucket to scoop the dirt.",
      "content": "Curl and lift the bucket to scoop the dirt. Start by pushing the right joystick left to curl the bucket. When the bucket is almost closed, the ground will start bulging up and form a hill. At this point, stop curling the bucket and lift the boom. Push the right joystick up to raise the boom up and complete the scoop. [18] X Research source"
    },
    {
      "title": "Rotate the cab and open the bucket to drop the dirt.",
      "content": "Rotate the cab and open the bucket to drop the dirt. Once you’ve scooped the dirt, the last step is dumping it. Use the left joystick and rotate the cab either left or right, depending on where you want to dump the dirt. Hover the bucket over that position. Then push the right joystick to the right and open the bucket, dumping the dirt. [19] X Research source Leave the dirt nearby in case you need to backfill the hole. Repeat this process as many times as you need to finish the dig."
    },
    {
      "title": "Set the cab square with the tracks before shutting the machine down.",
      "content": "Set the cab square with the tracks before shutting the machine down. When you've completed the job, rotate the cab so it sits square with the tracks, facing forward. Disconnect your joystick controls by pushing the control lever back down. Then bring the throttle down to Idle by turning the knob by your right hand. Let the engine sit in idle for 1 minute so it cools down. Then turn the key and remove it to shut down the machine. [20] X Research source Watch your step when exiting the cab. Injuries from falls are common on construction sites."
    }
  ]
}