{
  "url": "https://www.wikihow.com/Cope-Being-Physically-Slow",
  "title": "How to Cope Being Physically Slow",
  "steps": [
    {
      "title": "Accept your slowness.",
      "content": "Accept your slowness. Avoid blaming or shaming yourself for being unable to go fast. Anger at yourself can make things even harder. Instead, work on making peace with your own limitations and differences. Accepting your reality will allow you to better handle challenges, and to be less afraid to ask for help. Remind yourself: [1] X Research source \"Everyone moves at different speeds.\" \"I'm allowed to take my time.\" \"I don't have to be fast in order to be hardworking, kind, capable, or an overall good human being.\" \"I'm doing my best, and that's what counts.\" \"If people get mad at me because I can't do more than my best, that is their problem, not mine. I'm not obligated to meet their unreasonable expectations.\""
    },
    {
      "title": "Explain to people that going fast is difficult for you.",
      "content": "Explain to people that going fast is difficult for you. Often people aren't aware of the whole picture until it is properly explained to them. Unless you have an obvious disability, they might assume that you are malingering or being purposefully slow. Explaining the situation to them can go a long way to increasing their understanding and acceptance. [2] X Research source \"I have dyspraxia, which means that motor skills are a challenge for me. As a result, I'm a slow mover. Please be patient with me, and remember I'm doing my best.\" \"I have a chronic illness. On my good days, I can walk normally, but on my bad days, I'm going to be slow. You can help by being patient and accommodating.\" \"I'm not very good at stairs. Please be willing to wait for me. If you're in a rush, tell me, and we'll take the elevator.\""
    },
    {
      "title": "Consider using mobility aids if needed.",
      "content": "Consider using mobility aids if needed. Canes, walkers, and wheelchairs are options for people who have difficulty walking. It's also commonplace for people to use these even if they are able to walk somewhat independently—for example, if walking causes pain or shortness of breath, or if you can only walk short distances, then a mobility aid might be useful. [3] X Research source Many wheelchair users are able to take a step or two. It's just that those steps may be painful or difficult, or that the person has a limited amount of steps they can take per day. If you use a wheelchair, but can technically walk sometimes, that doesn't make you a \"faker.\""
    },
    {
      "title": "Ask for help.",
      "content": "Ask for help. It's okay to ask other people to help you if you're struggling with a task. Try asking a friend, or even a stranger. (Many strangers are willing to help a disabled person if asked.) \"I'm disabled, and I'm really struggling with my coat buttons. Could you please help me take this off?\" \"I'm not sure I can carry this box up the stairs. Would you please help me figure something out?\" \"I'm not good at seatbelts. Could you buckle me in?\" \"I think I'm stuck. Would you give me a hand, please?\""
    },
    {
      "title": "Challenge the idea that faster is always better.",
      "content": "Challenge the idea that faster is always better. The world is a fast place, but that doesn't mean you have to always try to keep up. Take this as an opportunity to discuss with others the positives and negatives of always rushing here and there; put the question to them \"Why is it so important to go so quickly?\" and have the rushed people in your life reflect about this. [4] X Research source"
    },
    {
      "title": "Make realistic changes to your routine.",
      "content": "Make realistic changes to your routine. When you accept that you move slowly, you can make adjustments to help you live a more relaxed life. Find out which situations cause you stress or difficulty, and see if you can avoid or minimize them. Run errands during quieter times of the day. Avoid rush hour and crowded times. Find comfortable places that are accommodating, and have a slower pace. For example, a cafe that caters to slower dining might be more your speed, or an entertainment place that is doesn't expect you to move quickly may be more fun. Bring a loved one who understands you, and is able to explain your condition to other people if this can be hard for you. Always bring your cell phone, with the numbers of loved ones who you can call for reassurance if you're having a rough time."
    },
    {
      "title": "Get out and about at your own pace.",
      "content": "Get out and about at your own pace. There's no need to hide just because you aren't fast. You have the right to use public spaces, just like non-disabled people do. [5] X Research source It's good for non-disabled people to see disabled people out and about in public. It reminds them to be considerate and understanding of others' differences."
    },
    {
      "title": "Remember that other people's bad attitudes are not your problem.",
      "content": "Remember that other people's bad attitudes are not your problem. Sometimes, you might encounter someone who is agitated, pushy, bossy, or just plain rude. That is their fault, not yours. Do your best to stay assertive and polite, even when they are behaving inappropriately. Ask for help if you need it. [6] X Research source"
    },
    {
      "title": "Be patient with yourself.",
      "content": "Be patient with yourself. It may take time to figure out how to adapt as a slow-moving person in a fast-moving world. It may also take time to accept yourself and your speed, if you have difficulty with that. Let yourself keep learning and growing. You don't have to have it all figured out right away."
    }
  ]
}