{
  "url": "https://www.wikihow.com/Flirt-With-Body-Language",
  "title": "How to Flirt With Body Language",
  "steps": [
    {
      "title": "Make eye contact",
      "content": "Make eye contact with your crush for 2-3 seconds, then look away. Prolonged eye contact tells the person you might like them. Look at the person you’re crushing on and wait for them to look back at you. Meet their eyes, then quickly glance away. Try a sideways glance if they’re not directly in front of you. Turn your head to the side, look at your crush, then look away. Don’t stare at the person because it might weird them out. Only look at them for a few seconds at a time."
    },
    {
      "title": "Smile a toothy grin",
      "content": "Smile a toothy grin at your crush to show you’re interested. Flashing a sweet smile at your crush is a fun, easy way to flirt. [1] X Expert Source Sarah Schewitz, PsyD Licensed Psychologist Expert Interview. 15 April 2019. When your crush looks your way, smile at them and see if they smile back. If they do, you might continue flirting with them or might even break the ice by saying, “Hi.” [2] X Research source Go with a big smile so they'll take notice. If your smile is too subtle, the person might not realize you're flirting. If you go to school with your crush, try smiling at them while you’re passing in the hallway. If they don’t smile back, you can just act like you were smiling at someone else."
    },
    {
      "title": "Raise 1 or both eyebrows when you make eye contact.",
      "content": "Raise 1 or both eyebrows when you make eye contact. Cocking an eyebrow tells the other person you noticed them. It says, “I’m checking you out.” While you’re holding eye contact for a few seconds, slowly raise and lower your eyebrow. If the person smiles or does it back, they might be into you. [3] X Research source You can also use this trick when someone catches your eye at a social event. If they ask you why you raised your brows, say something like, “I think I know you from somewhere,” or “Oh, you look a lot like my friend.”"
    },
    {
      "title": "Wink",
      "content": "Wink at your crush if you’re feeling confident. A well-timed wink sends your crush a clear message that you like them. Look in your crush’s direction until they glance your way. Then, give them a slow wink. Be sure to smile so they know you’re flirting! [4] X Research source Winking is really explainable if the person doesn’t seem to be into you. Just pretend like you’ve got something in your eye or are having allergies."
    },
    {
      "title": "Toss, tousle, or flip your hair because it looks seductive.",
      "content": "Toss, tousle, or flip your hair because it looks seductive. You don’t need long, flowy hair to flirt! Playing with your hair is an easy way for anyone to flirt. Run your hands through shorter hair or gently tousle it with your fingertips. If you have mid-length or long hair, wrap it around your finger, push it over your shoulder, or shake it around. [5] X Research source If you’re bald or have a buzzed head, simply run your fingers along your bare (or nearly bare) head."
    },
    {
      "title": "Tilt your head to 1 side so your neck is exposed.",
      "content": "Tilt your head to 1 side so your neck is exposed. An exposed neck sends your crush the message, “I want your lips here.” Once you get their attention, casually shift your head to the side so your neck is visible. You might also move your hair aside and could play with the collar on your shirt or top to draw more attention to your neck. [6] X Research source Keep your movements small so you’re not being obvious. For instance, you might sigh and run your hand over your hair, pulling it the side. As you do this, lower your head slightly to the side so your neck becomes more visible. Wait a moment or 2, then shift to the other side."
    },
    {
      "title": "Bite or lick your lower lip to make your crush think about kissing.",
      "content": "Bite or lick your lower lip to make your crush think about kissing. Lips are super sexy! Make your crush think about your lips by drawing attention to them. Gently nibble your bottom lip for a couple of seconds to look super seductive. You might also slowly lick your lip. [7] X Research source Don’t bite down hard on your lip because you might hurt yourself. Only do this once or twice in a single interaction. If you do it too much, it might make you look nervous and could dry out your lips."
    },
    {
      "title": "Touch your exposed skin to signal you want intimacy.",
      "content": "Touch your exposed skin to signal you want intimacy. When you touch your skin, it might make your crush think about touching you. Gently trail your fingertips along the skin on your arms, neck, shoulders, and face. Do this for a few seconds at a time whenever you notice your crush looking at you. [8] X Research source For example, you might touch your cheek and then slide your fingers down your neck. Similarly, you might graze your fingers along your forearm or across your chest. You don’t need to constantly rub your skin. A little touching looks suggestive, but constantly rubbing your skin might make your crush think you’re itchy."
    },
    {
      "title": "Stroke your tie, collar, or necklace if you don’t have exposed skin.",
      "content": "Stroke your tie, collar, or necklace if you don’t have exposed skin. Playing with your accessories can be a great alternative to touching your skin. Pull your tie between your fingers, adjust your collar, or glide your fingers along your necklace chain. You could also try playing with your shirt sleeves or earrings, as well. [9] X Research source Do this slowly to hold your crush’s attention."
    },
    {
      "title": "Angle your body toward your crush to show you’re into them.",
      "content": "Angle your body toward your crush to show you’re into them . [10] X Expert Source Sarah Schewitz, PsyD Licensed Psychologist Expert Interview. 15 April 2019. Whether you’re next to them or across the room, shift your body so it’s facing your crush. This subtle move aligns you with them, which says “I’m interested.” Watch to see if they angle their body more toward you, as it could mean they’re into you, too. Let’s say you’re at a party with a group of friends. You might turn your body slightly away from your friends and more toward the person you’re crushing on. Similarly, you might be waiting for your coffee at a counter when someone catches your eye. Instead of facing the counter, slightly turn to the side so you’re facing the person you like."
    },
    {
      "title": "Move within 4 to 12 ft (1.2 to 3.7 m) of your crush to start a friendly interaction.",
      "content": "Move within 4 to 12 ft (1.2 to 3.7 m) of your crush to start a friendly interaction . You don’t want to invade someone’s personal space, but getting closer to them can start an interaction with them. Generally, a zone of about 4 to 12 ft (1.2 to 3.7 m) of space around a person is considered the “social” zone. Getting in this zone helps you get their attention so you can possibly talk to them . Any closer than 4 ft (1.2 m) is considered personal space. Once you’re chatting with your crush, they may be comfortable with you crossing into this space, but don’t force it. Always respect people’s personal space."
    },
    {
      "title": "Touch the person casually on their arm or shoulder.",
      "content": "Touch the person casually on their arm or shoulder. Intentional touches send a message that you might be into the person you're touching. Plus, a touch will get your crush’s attention immediately. Lightly touch the person on their arm, shoulder, or maybe their upper back. Quickly move your hand away so they don’t feel uncomfortable. [11] X Research source Once you touch them, you’ll need to say something. It could be a simple, “Hello” or “Excuse me.” You could also ask a question like, “Do you know what’s on the lunch menu for today?” or “How are you enjoying the party?” Watch how the person reacts. If they don’t seem to like it, say, “I’m sorry,” and give them some space. Reader Poll: We asked 1015 wikiHow readers about what body language they find irresistible, and only 6% said that they're attracted to people who touch their hair . [Take Poll] So while this may not be the best strategy, you can still flirt by touching someone in less intimate places like their arm or shoulder."
    },
    {
      "title": "Bump into your crush “accidentally” if you’re too afraid to touch them.",
      "content": "Bump into your crush “accidentally” if you’re too afraid to touch them. Touching someone is a pretty direct way to flirt with them, so you might be too shy for it. That’s totally okay! Instead, you might pretend to accidentally brush up against them or run into them. Quickly smile and apologize to start an interaction. [12] X Research source You might brush past them and say, “Oh, I’m sorry. Did you drop anything?” If you’re at a party, bar, or dance, you could bump into them and say something like, “Oops! So sorry! I think the music is getting to me.”"
    },
    {
      "title": "Lean towards the person when you’re talking to them.",
      "content": "Lean towards the person when you’re talking to them. When you lean in, it shows the person you really care about what they have to say. Keep your back straight, but hinge your hips forward so your upper body is closer to your crush. If they lean in toward you, too, they might like you back. Try not to slouch forward toward them, as this can be a sign you’re not interested in what they’re saying. Always maintain good posture."
    },
    {
      "title": "Mirror the person’s body language to create a connection.",
      "content": "Mirror the person’s body language to create a connection. When you mirror someone’s body language, it makes them see similarities between you and them. This can help your crush see you as a good romantic match. Do your best to imitate how they’re standing, what gestures they’re using, and how they’re expressing themself. For instance, you might tilt your head to the same side as they do or copy their hand gestures. You can also laugh or nod along with them."
    },
    {
      "title": "Use bigger gestures to hold their attention.",
      "content": "Use bigger gestures to hold their attention. Big gestures make you seem excited and more engaged, which signals to your crush that you like them. Move your hands and arms while you’re talking to help illustrate your points. This will keep their eyes on you the entire time. [13] X Research source For instance, you might use your fingers to number a list. If you’re telling a funny story , you could wave your arms back and forth to make yourself look animated. When telling a story about a mishap, you might use your arms to push away from your body. Practice gesturing in front of a mirror or on video so it comes naturally to you."
    },
    {
      "title": "Keep your arms open and at your sides when you’re not gesturing.",
      "content": "Keep your arms open and at your sides when you’re not gesturing. Open body language makes you seem approachable and engaged, while closed body language shuts people out. Don’t fold your arms across your chest while you’re chatting up your crush. Instead, place your arms down at your sides unless you’re gesturing. If you cross your arms, your crush may think you’re bored or don’t want to talk to them."
    },
    {
      "title": "Maintain good posture",
      "content": "Maintain good posture so you appear more confident. Good posture makes you look cool, calm, and collected, even if you’re super nervous. Keep your back straight and your shoulders rolled back. Additionally, tilt your chin up and look straight forward. [14] X Research source Make sure you don’t slump, even if it’s just leaning against something."
    }
  ]
}