{
  "url": "https://www.wikihow.com/Delete-Expired-Subscriptions-on-iPhone",
  "title": "How to Delete Expired Apple Subscriptions on iPhone",
  "steps": [
    {
      "title": "Expired subscriptions delete automatically in one year.",
      "content": "Expired subscriptions delete automatically in one year. There's no way to manually delete expired subscriptions from your subscription list, but fortunately, they won't stick around forever. Any subscriptions you've canceled or let lapse will automatically disappear one year after their expiration dates. While these old subscriptions may still clog up your list after expiration, you won't be billed for those services. While you wait for it to be removed, you can hide the app from your Apple ID. It's also a good idea to check your Apple subscriptions to make sure you're not still subscribed to services you no longer use. You can also view and cancel subscriptions on your Mac ."
    },
    {
      "title": "If you don't want to wait a year, create a new Apple ID.",
      "content": "If you don't want to wait a year, create a new Apple ID. This might sound like a dramatic solution, but it could be helpful if you don't want anyone else who has access to your iPhone to see your old subscriptions before it's removed. You can create a new Apple ID in the Settings app—just tap your name at the top, select Sign Out , and then tap Sign in to your iPhone to find the option to create your new ID. [1] X Research source Make sure you've backed up your data on your current Apple ID before creating a new one."
    },
    {
      "title": "Submit product feedback.",
      "content": "Submit product feedback. Apple welcomes feedback on all products, including iCloud and iTunes subscription policies. If you think Apple should allow you to delete expired subscriptions, submit feedback at https://www.apple.com/feedback on any device, including your Mac. [2] X Research source"
    },
    {
      "title": "Open the App Store.",
      "content": "Open the App Store. This looks like a white A with a blue background."
    },
    {
      "title": "Tap your Apple ID.",
      "content": "Tap your Apple ID. You can find this in the top-right corner."
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . This may also look like Purchased . If you have Family Sharing active, this will look like My Purchases ."
    },
    {
      "title": "Swipe left on the app you want to hide.",
      "content": "Swipe left on the app you want to hide. The apps will be listed from most recent to least recent."
    },
    {
      "title": "Tap Hide.",
      "content": "Tap Hide . This is the red button."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . The app will be hidden from your list of purchases. [3] X Research source"
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. It's the gray gear icon on your Home screen or in your App Library."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. You'll see it at the top of the menu. [4] X Research source"
    },
    {
      "title": "Tap Subscriptions.",
      "content": "Tap Subscriptions . It's the 4th option from the top."
    },
    {
      "title": "Find your expired subscriptions.",
      "content": "Find your expired subscriptions. You can find this under the \"INACTIVE\" header. The first section, ACTIVE , contains all subscriptions that are still in effect. Tap any of the subscriptions to see billing information, including your next billing date, the amount you'll be billed, alternatives to your current subscription, and the option to cancel. The second section, INACTIVE , displays subscriptions that you'll no longer be billed for. These subscriptions will be automatically removed 365 days after the expiration date listed below each subscription."
    },
    {
      "title": "Cancel any unneeded subscriptions.",
      "content": "Cancel any unneeded subscriptions. If you see a subscription in the ACTIVE section that you no longer want, do the following to cancel it: tap the subscription, select Cancel Subscription , and follow the on-screen instructions. If you don't see the option to cancel, you've already canceled the subscription and it hasn't yet expired."
    },
    {
      "title": "Request a refund for unauthorized subscriptions (if needed).",
      "content": "Request a refund for unauthorized subscriptions (if needed). If you're being billed for a subscription you did not sign up for, you can request a refund from Apple. [5] X Research source To do so: Go to https://reportaproblem.apple.com in your web browser. Sign into your Apple ID. Choose Request a refund . Select your reason and tap Next . Select the subscription and tap Next . Follow the on-screen instructions to complete your request. You can check the status of your request by returning to https://reportaproblem.apple.com and tapping Check Status of Claims ."
    }
  ]
}