{
  "url": "https://www.wikihow.com/Fun-Questions-to-Ask-Your-Partner",
  "title": "340+ Fun Questions to Ask Your Boyfriend or Girlfriend",
  "steps": [
    {
      "title": "Have a blast by exchanging these fun questions.",
      "content": "Have a blast by exchanging these fun questions. Asking one another fun get-to-know-you questions isn’t just a good way to pass the time, it’s also a good way to develop your bond and learn more about one another. Try some of these amusing and silly questions: If you could have dinner with any three people, dead or alive, who would they be? Who’s your “hear me out” ? What do you think that says about you ? What's your favorite movie of all time and why? If you could have any superpower, what would it be? What fictional character is most like you? What's a funny or embarrassing story from your childhood? Who was your first celebrity crush? If you won the lottery, what would you do first? What are most people surprised to learn about you? What's your favorite way to relax? What social norm would you get rid of if you could? What do you want to do when you retire? What should everyone know more about? What's a controversial theory that you believe in? What is your biggest regret? [1] X Research source What do you like to do when it's rainy? What book changed your life? If you won $100,000 in the lottery, what would you do with it? How did people treat you in high school? Who is your favorite artist? What's the most adventurous thing you've ever done? Who is the one person, past or present, you wish you could meet? Where is your favorite place in the world? Do you consider yourself competitive? Do you prefer the mountains or the sea? Have you ever joined a protest? What's the weirdest thing you've eaten? What's the best compliment you've ever gotten? Have you ever sought (and gotten) petty revenge on someone? If you could live in any historical period, which one would you choose? What’s the funniest thing that’s ever happened to you? What’s your favorite childhood memory? If you could instantly learn any skill, what would it be? What food could you eat every day? What’s your favorite game? If you could be any animal for a day, what would you be?"
    },
    {
      "title": "Take things down a notch with some serious, thought-provoking questions.",
      "content": "Take things down a notch with some serious, thought-provoking questions. Asking your partner deep questions about their past, their values, and more important subjects can help you get to know them better as well as develop your mutual trust. These deep, philosophical, and heavy questions are perfect for when you really want to get to know your partner: What is your biggest goal? [2] X Research source How do you think your parents have influenced your view of romantic relationships? What does success look like to you? Where do you see us in the future? What kind of relationship did your parents have? What is your biggest concern about our relationship? What are your thoughts on life after death? How do you define a successful relationship? What was the worst decision you ever made? When were you happiest? When is it ever okay to lie, if it ever is? How do you define commitment in a relationship? What's the best advice anyone ever gave you? What character quality have you lost along the way that you wish you still had? Who or what inspires you? What scares you more than anything else? What’s the most important lesson you’ve learned about yourself? How do you cope with stress or sadness? What's the greatest obstacle you've had to overcome? Would you sacrifice your life for someone else's? Do you believe in free will or fate? If you had one thing to do over, what would it be? Do you believe in giving people second chances? What are your core values? What gives your life meaning? How do you experience spirituality, if you do? How would you describe your philosophy on life? What do you think is the greatest challenge facing humankind? What would you give up to pursue your dreams? What makes you really angry? What life experience changed you the most? What is something that makes you feel awe? How would you like to be remembered? What makes you jealous? Would you rather people think of you as kind, smart or attractive? Do you think people can change?"
    },
    {
      "title": "These juicy icebreakers are hard to answer!",
      "content": "These juicy icebreakers are hard to answer! Challenge your sweetheart by asking them the tough questions. They’ll need to take a while to think about their answers for these babies—but we suspect their honesty will bring you even closer together: What’s something you’ve never told anyone else before? Which celebrity would leave you starstruck in real life? What was the last thing you searched on Google? What's your guilty pleasure? Do you believe that every person has one soul mate? Do you talk to yourself? Do you think an emotional connection or physical connection is more important? If you started a podcast, what topic would it be on? If you could go on any reality TV show, which would you pick? How many past partners have you had? Do you sing in the shower? Do you look at other men/women/people? Have you ever cheated on a partner? If not, have you considered it but changed your mind? If you could have three wishes from me, what would they be? Do you believe in love at first sight? How do you describe me to other people? How do you think I should describe you to other people? What is something you think is true about me but you've never asked to confirm? What's the first thing you noticed about me? What role does physical attraction play in whether you pursue a relationship? What type of scent do you like on a person? Would you say you have a \"type\"? Do I fit what you thought you were looking for? What's the last book you read for fun? What's the wildest dare you've ever accepted during Truth or Dare? Do you believe in ghosts? What’s a conspiracy theory you believe in? What's a hidden talent you have that you never get to show off? What's your most memorable experience from high school? Do you ever feel like you lived a past life? What's one fact no one else knows about you? What's your most memorable experience from college? If you could go back in time and live in any historical era, which would you pick? Do you think men and women can ever just be friends? If you could host a dinner party with any famous person, who would it be and what would you talk about? What are your relationship deal breakers? What's the weirdest thing you've ever gotten the \"ick\" from? Is there anything you wish you could change about me? Is there anything you wish you could change about yourself? If you could change your name, would you? (If yes, to what?) What do you think your best attribute as a partner is?"
    },
    {
      "title": "Show your significant other you care with some romantic questions.",
      "content": "Show your significant other you care with some romantic questions. Ask your partner questions about your relationship, their love language, their ideal date night, and more with these romantic questions: How do you feel about the current state of our relationship? What can we do together to strengthen our bond? What is your perfect date? [3] X Research source What's the most romantic movie you've ever watched? What's your favorite line from a romantic movie? What love song gives you butterflies? What is your love language? Have you been in love before? Who are your role models for a healthy relationship? What's the most memorable lesson you've learned about romance? What do you think is the secret to keeping romance alive? Candlelit dinner or movie night on the couch? What's your favorite thing to do outdoors? Do you believe in love at first sight? What real-life couple do you most admire? What do you think our life will be like in 20 years? What is your favorite thing about our relationship? What is one thing you'd change about our relationship? If you could live inside one romantic movie, what would it be? What's your favorite nickname? Tell me what makes you laugh when you're in a bad mood. What's the most romantic book you've read and why? Describe our relationship in three words. What's your favorite flower? What's the most spontaneous thing you've done in a relationship? What's your favorite tradition? What makes you feel loved? What's an idea for a romantic vacation destination? Do you like receiving love letters? What's your biggest goal for our relationship? What is your favorite TV or movie wedding? If you could go on a date anywhere in the world, where would it be? How important is romance to you in a relationship? What's your ideal way to spend Valentine's Day? What's the most romantic thing you've done for someone else? How loved and appreciated do I make you feel? What are your expectations of me? What is your love language? How do you prefer to handle conflicts or disagreements? How can we support each other better? What do you love most about our relationship? What activities do you enjoy doing with me? Realistically, how do you see our future together? What are your dreams and goals for us as a couple? What does emotional intimacy mean to you? What makes you feel secure in our relationship? What’s your favorite way for us to celebrate special occasions? What would you like us to do more often together? What do you think is our biggest strength as a couple? Is there anything you’d change about our relationship? How can we improve our communication?"
    },
    {
      "title": "Get your flirt on with some of these blushworthy icebreakers.",
      "content": "Get your flirt on with some of these blushworthy icebreakers. Whether you’ve been together for 10 years or a few days, flirting is a great way to kick up the heat and maintain some electricity between you two. Be sure to pair your questions with some nonverbal ways of flirting, according to dating coach John Keegan, like “eye contact, playful comments, light touching at the end of a joke.” Here are our favorite flirtatious questions, including a few suggestions from Keegan: If you could travel anywhere, where would it be? If you could go on a romantic destination with someone special, where would it be? What were you like, as a kid? Were you good or bad? Do you believe in astrology? Do you believe in twin flames? What's your favorite love song? What's your love language? What does falling in love feel like to you? What's your ideal date night? What makes you feel sexy? Are there any hobbies you'd like for us to try together? What's your vision for our future? When did you decide you wanted to be with me? Do you remember what I wore on our first date? Do you think love can last a lifetime? What makes our relationship work so well? How do you feel about PDA? What is your best memory of us? When was the last time someone made you blush? What gives you butterflies? What is your favorite flower? Have you ever used a pick-up line and if so what was it? Did you fantasize about a dream wedding when you were a little girl? How do you like to celebrate Valentine’s Day? What feels romantic to you? How do you like to be kissed? Do you believe in love at first sight? What's your favorite make-out music? Have you ever gone skinny dipping? Do you ever go commando? Do you believe love really can conquer all? What's your favorite romantic movie? What's your perfect Sunday morning? Who was your first crush and was it requited? What's one of your turn-ons? What makes you think of me? How would you describe me to your friends? What was your first impression of me? What do you like best about me now?"
    },
    {
      "title": "These saucy questions can spice up your love life.",
      "content": "These saucy questions can spice up your love life. Not only are these questions fun, they can improve your sex life, according to Licensed Clinical Psychologist & Professional Life Coach Dr. Susan Pazak: “Sex in a long-term relationship can be more enjoyable by talking about what would make it more enjoyable…. Say what you need, want, and fantasize about. Be direct, as this allows for the conversation, which will lead to more enjoyable sex.” Is our relationship physical enough for you? What would make it better in your eyes? [4] X Research source How and where do you like to be touched? Are there any places I don't know about? Would you like me to be more or less assertive in the bedroom? What’s your biggest turn-on? What’s your biggest turn-off? What’s a naughty thought you’ve had about me recently? Have you ever imagined us getting intimate in a public place? What’s the most adventurous place you’ve ever been intimate? Do you have a favorite sex position, and would you like to try any new ones? What’s your opinion on skinny dipping? What’s a turn-off for you that you think I should know about? Do you like cuddling or kissing more? If we played truth or dare right now, what would you dare me to do? How do you like me to initiate intimacy? Would you rather have a passionate kiss in the rain or a cozy cuddle by the fireplace? Do you like dirty talk? What’s a secret fantasy you’ve never shared? Do you have any fantasies you would like fulfilled? Is there anything we haven't tried that you'd like to? Ideally (and a bit realistically, too), how often would you like for us to be intimate? What are some things I can do outside of the bedroom to keep the feelings of intimacy going all day? What are your thoughts on toys? What kind of fantasies did you have before you met me? How can I make you feel seen and accepted when we're intimate together? What is something about your intimate history you've never told anyone before?"
    },
    {
      "title": "Get down to the nitty gritty with more pressing questions.",
      "content": "Get down to the nitty gritty with more pressing questions. Having a regular check-in to discuss your relationship is also a great way to make sure everything is going well, according to Community Psychologist & Licensed Clinical Therapist Jessica Swenson: “[These questions] are great ways to open up the door to vulnerability and deepen your relationship.” Try one of these serious questions—including a few from Swenson—to help lay the foundation for a more solid relationship: Do you feel like your needs are being met in this relationship? What project have you always wanted to start? What can I do to improve the quality of our relationship? What are your life goals? Is there anything I can do to show you that you're loved or cared or appreciated? What’s your dream job and why? What are your biggest fears and how do you cope with them? If you could start any business, what would it be? Are there things that have hurt you in the past that we haven't talked about yet? How do you express your emotions? What values do you appreciate in others? Where do you see yourself in 10 years? What are your thoughts on vulnerability in a relationship? How do you plan to achieve your dreams? Why did your last relationship end? What's a goal you're working toward? How do you like to be comforted? If you could start a non-profit, what would it benefit? What do you value most about yourself? What's your biggest red flag in a relationship? What do you judge yourself most harshly about? Is there anything you wish you could change about me? What are the signs I should look for when you're feeling down? What do I do that triggers you? What do you value most in a relationship? How would you characterize yourself politically? Have you ever cried in public? What values are most important to you? How do you feel when we spend time apart? How much quality time together feels right to you, and why? How do you handle feelings of jealousy or insecurity? How do you feel about sharing your thoughts and feelings? What makes you feel most connected to me? What would you do if you had unlimited resources? Who inspires you to follow your dreams? What’s the most daring thing you’ve ever done? What dream have you held since childhood? What’s one thing you hope to accomplish in the next year? What goal are you currently working toward? Where have you always dreamed of visiting? What’s your biggest career ambition?"
    },
    {
      "title": "Shake things up with these unexpected icebreakers.",
      "content": "Shake things up with these unexpected icebreakers. What’s their six-word memoir? What Jeopardy! category would they excel at? Do they talk to pets in a baby voice? Throw your partner off guard—and get them laughing!—with a few random and out-there get-to-know-you questions. What isn't an Olympic sport but should be? What's your walk-up song? If you had a personal assistant, what would you ask them to do? How many pairs of underwear do you pack for a five-day vacation? Who is your favorite superhero? Do you talk to pets in a baby voice? What's the best dessert you've ever eaten? What's the most random fact you know? What's your guiltiest pleasure? Who are your weirdest friends? What Jeopardy! category would you crush? What was your imaginary friend's name? Do you laugh when you're alone? What villain do you secretly admire? Who would play you in a movie about your life? If you could jump in a time machine, what historical period would you visit? If you came with a warning label, what would it say? What's your go-to karaoke song? What's your most embarrassing story? What's the weirdest food you like? What's your six-word memoir? Which celebrity would make you totally starstruck if you met them? Would you rather be able to fly or breathe underwater? How would you do in a zombie apocalypse? Who's the last person you would want to be stuck in an elevator with? How would we do if we were stranded on a desert island together? Do you sleep with a fan on all year? If you had to smell one scent forever, which one would you pick? What story does your family tell about you to tease you? What is one thing you'll never do again? What’s the worst date you've been on? Do you believe in conspiracy theories? What's your most-hated trendy phrase or term? Could you land a plane if the pilots passed out and you had to? What's the strangest fact about you I don't know? What celebrity couple do we remind you of? What's a question you've wanted to ask me but haven't?"
    },
    {
      "title": "These icebreakers will bring you even closer together than you already are.",
      "content": "These icebreakers will bring you even closer together than you already are. Whether you’ve been together for years or just started dating, there’s always more to learn about your significant other. Ask these questions to dive in deep and learn more about one another’s likes and dislikes, values, history, and more. What’s a defining moment in your life? What challenges from your past have made you stronger? What’s your favorite sport or physical activity? What’s your favorite type of weather? What’s your favorite way to spend a day off? What’s your favorite type of movie or TV show? What’s your favorite color and why? What’s your favorite way to spend time with your family? Who are the most influential people in your life? What are your biggest goals for the next five years? How did your parents influence your views on relationships? What’s your favorite song or music genre? What’s your favorite season and why? What’s your favorite holiday, and how do you like to celebrate it? What’s your favorite book and why? What’s your favorite thing to do on a rainy day? How have you handled change and uncertainty? How have your past relationships influenced your views on love and commitment? What are your favorite family memories? What are your personal hopes and dreams for the future? What did you love to do most as a child? What’s your favorite place to relax? What was your favorite childhood toy or game? What’s your ideal way to spend a weekend? What one habit do you have that you’d like to change? What’s your favorite type of cuisine? What’s your favorite quote or saying? How do you handle stress and challenges? What are your favorite hobbies or activities? What have you always wanted to try, but haven't yet? What skill would you like to master? What motivates you? What’s the best advice you’ve ever received? Who’s been the most important mentor in your career? How do you define success? What are your personal boundaries and how do you maintain them? How do you think your childhood has shaped who you are today? What’s your earliest memory? Who was your role model growing up, and why? What are the most important lessons you've learned in life? How do you want to be remembered?"
    },
    {
      "title": "Asking your partner questions can bring you closer together.",
      "content": "Asking your partner questions can bring you closer together. Asking questions—from the silly and random to the serious and deep—is the perfect way to learn more about your partner while spending quality time together (an essential ingredient in any healthy relationship). Even if you think you know everything about them, there’s always more to learn! Asking questions will also help you see how the relationship is progressing, Swenson asserts. Sometimes, issues go unspoken, but asking questions to check in can help you both address any unresolved concerns and make sure you’re both getting your needs met. If your partner ever feels uncomfortable answering a question, though, respect their boundaries. Some questions may be a little heavy or personal—and the point of exchanging questions is to have fun and get closer together, without pressure."
    }
  ]
}