{
  "url": "https://www.wikihow.com/Fix-Dimmed-Screen",
  "title": "How to Fix a Dimmed Screen on Your Computer or Laptop",
  "steps": [
    {
      "title": "There are many reasons a screen can go dim.",
      "content": "There are many reasons a screen can go dim. Some of the most common causes of a dimmed screen: Incorrect brightness settings Adaptive Brightness is enabled Power-saving settings have turned down the brightness Loose cables Software glitches Outdated graphics drivers Faulty cords Monitor backlight issues"
    },
    {
      "title": "Check your brightness settings.",
      "content": "Check your brightness settings. The first step in troubleshooting is pressing the button on your keyboard that increases the screen brightness; a sunburst icon and an up arrow will mark it. You might have to press FN at the same time to use the brightness keys. You can also find settings for brightness in Settings > Display . You can also find this menu ( Settings > Display ) if you're on a TV. If you're using an external monitor, press the physical buttons on your monitor to find Menu/Settings > Display > Brightness ."
    },
    {
      "title": "Check if you have Adaptive Brightness enabled.",
      "content": "Check if you have Adaptive Brightness enabled. This setting allows the software (like that in a tablet or laptop) to increase or decrease the screen's brightness depending on the environmental lighting. For example, the screen will appear brighter when there is a lot of light and darker if there is little light. Windows: Go to Settings > Display > Brightness & Color and look for anything called \"Adaptive Brightness\" or \"Change brightness automatically when lighting changes.\" [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Mac: Go to System Settings > Displays and turn off \"Automatically adjust brightness.\" [2] X Research source Be aware that turning off this setting on Mac or Windows might negatively impact your battery life."
    },
    {
      "title": "Check your power-saving features.",
      "content": "Check your power-saving features. In many cases, the screen will dim when you're not using it to reserve power. There are many ways to check this feature: Windows PC & Laptops: Right-click the battery-power icon in the taskbar and select \"Power and sleep settings.\" Check the \"Screen and sleep\" section for options to dim your screen to conserve power. Uncheck \"Lower screen brightness when using battery saver\" and close the window. Samsung TV: Go to Settings > General > Power and Energy Saving and turn off \"Brightness Reduction.\" [3] X Research source Sony TV: Go to \"Settings > System > Power and Energy and choose \"Off\" or \"Low\". MacBook: Go to System Settings > Battery and check if this is dimming your screen. [4] X Research source"
    },
    {
      "title": "Reconnect cables or make sure they are snug.",
      "content": "Reconnect cables or make sure they are snug. If you're using an external monitor, this step is important! You can skip this step if you're using an internal monitor like those with a laptop, a tablet, or a TV. Loose cables can produce dim images."
    },
    {
      "title": "Restart the screen.",
      "content": "Restart the screen. A temporary glitch in your TV, tablet, phone, or laptop can cause the dim images, so simply restarting it can fix the issue."
    },
    {
      "title": "Update graphics drivers.",
      "content": "Update graphics drivers. If the screen requires updated drivers to work, like a computer or laptop screen, you want to keep the graphics card updated to see images clearly. Performing a system update on Windows and Mac will automatically download and install newer drivers if they are available."
    },
    {
      "title": "Use different cables or change your power source.",
      "content": "Use different cables or change your power source. Damaged cables or faulty power outlets can cause faint images to appear on your screen. If you're plugged into an external monitor that isn't working, try a different cable. You should also plug your dim screen into another power outlet to rule out the small chance that something is wrong with it."
    },
    {
      "title": "Schedule a repair.",
      "content": "Schedule a repair. If none of these troubleshooting steps solves your dim screen issue on your tablet, phone, desktop computer, laptop, or TV, you might be experiencing hardware issues, like the backlights for your device are dead. This is most likely the case if you see the Power button on or illuminated but your screen is very dim. Go to the \"Contact Us\" site for your device's manufacturer to get more help and schedule a repair."
    }
  ]
}