{
  "url": "https://www.wikihow.com/Dress-Semi%E2%80%90Formal-As-a-Teen",
  "title": "How to Dress Semi‐Formal As a Teen",
  "steps": [
    {
      "title": "Consider what kind of event you’re going to.",
      "content": "Consider what kind of event you’re going to. The type of event will likely determine how to dress, such as weddings, parties, school dances, and the like. [1] X Expert Source Hannah Park Professional Stylist Expert Interview. 21 February 2019. Oftentimes different events will call for “semi-formal dress” but the actual expectations may differ depending on the type of event, time of day, and so on. If the event is in the daytime, you should expect to dress slightly less formally and in lighter colors than for evening events. If you want to dress feminine, you can wear skirts and a dress shirt for day events while masculine people can wear a light suit jacket paired with suit pants, khakis, or cotton twill pants. If the event takes place in the evening, “semi-formal” generally means more formal. One helpful rule to stick by is “the later the event, the darker and dressier.” Therefore, masculine looks should incorporate darker colors, such as a dark suit and tie. Feminine looks could include a cocktail dress, slacks and a dressy blouse, or a little black dress. [2] X Research source If in doubt, ask the organizers of the event."
    },
    {
      "title": "Consider where the event will be held.",
      "content": "Consider where the event will be held. The location of an event can help you dress appropriately since, again, the definition of “semi-formal” actually changes quite a bit depending on these variables. If you’ve been invited to a garden party in the middle of the afternoon, you don’t want to sweat through your clothes, so you can likely wear lighter fabrics and slightly more revealing clothing (such as knee high skirts or dresses for a feminine look). However, if you’ll be indoors for a more conservative event, such as a bar mitzvah in a synagogue, you’ll want to cover up more and also perhaps have a couple layers to adjust to the temperature as needed. Another possible consideration is where the event will be held in terms of region or even country. The concept of semi-formal is different not only for each event but also for different groups of people. For example, a semi-formal event at a beach in Southern California will likely include sundresses and flipflops while expectations may be different at an event on the East Coast. If you are going to an event in a different country or a foreign cultural event, be sure to ask ahead of time for more guidance on what to wear."
    },
    {
      "title": "Understand what separates semi-formal from casual and formal dress.",
      "content": "Understand what separates semi-formal from casual and formal dress. There are some key ways to avoid the mistake of drastically under- or overdressing. Knowing some of the basic ways in which these three categories differ from each other will help you dress appropriately for every occasion. Semi-formal dress tends to be more comfortable and flexible than formal dress. However, many people think that means anything goes when there are some key rules. For example, for people planning to wear a dress, a golden rule of wearing a semi-formal dress is that it can go to the knee or lower but it should not touch the ground. A floor length dress would be considered formal and you would probably be considered overdressed for the occasion. Of course, you don’t want to wear simply any dress based on length so go for dresses that are made of fancier fabrics, such as silk, satin, or velvet. [3] X Research source For a masculine look the expectation of semi-formal dress is a bit more straightforward: wear clothes that are just slightly less formal than a tuxedo. Dress slacks, jackets, blazers, and suits are all good starting points. The colors, thickness of fabric, and level of accessorizing is up to individual taste as well as the event details (location, time, etc)."
    },
    {
      "title": "Go to your closet.",
      "content": "Go to your closet. Many people feel as if they need to go shopping but you most likely already have clothes that can work as semi-formal. Because these articles of clothing likely won’t be what you wear on a day to day basis, be sure to dig in the back of your closet or even go through boxes of old clothes, if you have them. What you find may surprise you! If you are planning a traditionally feminine outfit, the phrase “semi-formal” is more flexible so you can include nice button down shirts and skirts as possible options (particularly for a daytime event). For those dressing masculine, look for long sleeve button downs, nice pants, and suits."
    },
    {
      "title": "Pick out your base outfit.",
      "content": "Pick out your base outfit. Once you have looked through your clothes, pick one main piece to base your outfit around. For masculine clothing this will be relatively simple as all you need are some conservative clothes in good condition. For feminine clothing, the main piece will generally be a dress or a fancy shirt and skirt. For masculine looks, a potential danger in dressing semi-formal is going overboard and looking too formal for the occasion. Avoid tuxedos and go for a matching suit instead."
    },
    {
      "title": "Choose the right accessories.",
      "content": "Choose the right accessories. This includes jewelry, hair pieces, and undergarments like stockings. For people wearing skirts or dresses, go for tasteful jewelry that isn’t too formal or expensive. Opt for small earrings or a simple chain necklace that complements rather than competes with your outfit. Remember that clothing doesn't have a gender, and mixing traditionally feminine and traditionally masculine items can look great if done well."
    },
    {
      "title": "Wear the right shoes.",
      "content": "Wear the right shoes. Shoes are crucial in bringing an outfit together so don’t forget to put some thought into which shoes you’ll wear for your semi-formal event. This is not the time for sneakers or sandals. Instead, all genders should wear closed toed shoes that are in good condition. Masculine shoes include a nice pair of loafers or boat shoes. [4] X Expert Source Hannah Park Professional Stylist Expert Interview. 21 February 2019. If you don’t have any dress shoes, you can compensate with a pair of nondescript dark canvas shoes. Feminine shoes might be kitten heels or ballet flats. High heels are not only bad for your body [5] X Research source but are often considered a bit too formal, especially for teens. Usually, red clothing, accessories, and shoes look good on everyone. [6] X Expert Source Hannah Park Professional Stylist Expert Interview. 21 February 2019."
    },
    {
      "title": "Decide on hair and makeup.",
      "content": "Decide on hair and makeup. Regardless of gender, everybody should brush their hair and keep good hygiene. Keeping it simple is key here, nothing too time consuming or dramatic is necessary. Makeup is not a requirement, especially if you don’t already wear makeup. However, if you do choose to do your makeup, less is more in this situation. A little mascara and lip gloss can go a long way. Avoid copious amounts of eye makeup and bright lipsticks as these can be seen as a bit too formal. In terms of hairstyles for long hair, go for a simple but elegant look. Pinning back a few strands with some nice hair clips or sweeping your hair into a classic bun are both great options. You could also put it into a braid or slick it all back."
    },
    {
      "title": "Check yourself out in the mirror.",
      "content": "Check yourself out in the mirror. After you have completed your look, ask yourself a few questions to see if the outfit is appropriate. A semi-formal look should be tasteful and classy. Semi-formal outfits should be less dressy than what you would wear to prom, but more formal than what you would wear to school. Some questions you could ask yourself are, “Would a parent approve?” and “Would you wear this to church?” If the answer is no, you may be wearing something too casual or revealing and may want to go back and try on another outfit."
    },
    {
      "title": "Figure out what you’re missing.",
      "content": "Figure out what you’re missing. As a teen, you will likely start going to more semi-formal and formal events so it’s best to start figuring out some key articles of clothing that will help round out that part of your wardrobe. Most children are allowed to wear just about anything, but as you get older, having more than just casual clothing will be necessary for jobs, parties, and other important functions. If you dress mostly in suits, start looking into some clothing articles that you may not already have, such as ties, leather shoes, and nice belts. Ask an older masculine relative or friend for guidance. Your parents may also be willing to buy you some of these items. If you prefer wearing dresses, consider whether you have some of these basics: sensible, low heeled shoes, blazers, or cocktail dresses. A little black dress is also a great option that’s appropriate for many semi-formal events."
    },
    {
      "title": "Go to the mall.",
      "content": "Go to the mall. There are many stores that sell semi-formal attire for relatively cheap, such as Gap and Forever21. Feel free to ask the store employees for help and some stores may even have specific sections for semi-formal attire. Knowing what you’re missing from your wardrobe ahead of time will help you while you’re shopping as you’ll have a specific goal instead of wandering around aimlessly. Always browse the sale section as you never know what you’ll find."
    },
    {
      "title": "Check out vintage or secondhand stores.",
      "content": "Check out vintage or secondhand stores. These stores are often cheaper than malls and you can often find great, unique pieces at a low cost. Sometimes you can even find interesting items such as slacks and suspenders which are now worn less often but can really add a fashionable edge to your semi-formal wardrobe. Just be sure to buy clothes that are still in good condition and aren’t worn out or misshapen."
    }
  ]
}