{
  "url": "https://www.wikihow.com/Get-Rid-of-Hangnails",
  "title": "How to Get Rid of Hangnails",
  "steps": [
    {
      "title": "Soak your fingers.",
      "content": "Soak your fingers. Soak your fingers in warm water for about 10 minutes. The warm water will help soften your skin and nails, which will make it easier to cut away the hangnail. You can add in some drops of vitamin E oil or olive oil for extra moisture during your soak."
    },
    {
      "title": "Clip your hangnail.",
      "content": "Clip your hangnail. Use clean and sharp cuticle nippers to cut off the hangnail. Try cutting as close to the base of the hangnail as possible. The closer you cut to the base of the hangnail, the less likely your hangnail will get caught on things like clothing. Do not pull and pluck at your hangnail. This will cause an uneven break from your skin, further irritating the area of the hangnail. Pulling at your hangnail could also cause bleeding. Do not cut off more skin or nail than what is necessary. This can create a deep cut that can easily get infected."
    },
    {
      "title": "Apply an antibacterial ointment.",
      "content": "Apply an antibacterial ointment. The antibacterial ointment will help kill, and keep away bacteria from the hangnail area while supporting healing. You only need a small amount to cover the entire affected area. If your hangnail was deep, you can put a bandage on the hangnail to help prevent it from getting infected."
    },
    {
      "title": "Moisturize the hangnail area.",
      "content": "Moisturize the hangnail area. For small hangnails that aren’t that deep, lather vitamin E oil onto the hangnail area. Vitamin E is easily absorbed into the skin and is extremely moisturizing. Besides vitamin E oil, applying any kind of moisturizer to your hands will prevent your cuticles from getting dry and brittle – conditions that promote the likelihood of hangnails. Apply an oil or moisturizer multiple times a day, especially after handling hot water and washing your hands. You can use other moisturizers like petroleum jelly, honey, olive oil, and coconut oil to combat hangnails, and keep your hands soft and hydrated."
    },
    {
      "title": "Try to keep your nail beds moisturized.",
      "content": "Try to keep your nail beds moisturized. Dryness is the primary source of hangnails, so to prevent them, it’s very important to keep your hands moistened by applying deep penetrating lotions and oils to your hands. Use cuticle oil to moisturize the skin around your nails regularly, as it's more likely to shred if it's dry. [1] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020. Dry your hands thoroughly any time you get them wet. Water actually acts as an irritant and can cause more pain. Drink enough water throughout the day to stay moisturized and hydrated. Consider wearing rubber gloves when working with detergents or water. This added precaution will protect your hands from drying out from the soap and water."
    },
    {
      "title": "Remove hangnails while they’re short.",
      "content": "Remove hangnails while they’re short. Instead of picking at your cuticles and only irritating your skin more, cut hangnails off as soon as you feel them. A sharp pair or cuticle nippers or nail scissors can trim the skin efficiently. This keeps the hangnails from getting caught on clothes and ripping deeper. Use your nipper and clip the hangnail straight, then pull it upward. Don't pull downward, as that could tear the skin. [2] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020. If the hangnail area becomes red and swollen, you’ve probably developed an infection. In the event of an infection, start treating it by soaking your hangnail in hot water about 3 times a day. If you don’t see or feel any improvement within a few days, contact your doctor. You might need to start a round of antibiotics. [3] X Research source"
    },
    {
      "title": "Avoid biting and picking at your nails.",
      "content": "Avoid biting and picking at your nails. Biting your nails damages your nails and the skin surrounding your nails, which in turn increases your chances of developing a hangnail. [4] X Research source Having your fingers in and around your mouth increases the chances of a hangnail getting infected because of the different bacteria in your mouth. Don't pick at your cuticles, either. You'll likely leave your cuticle raw or bleeding, which can be grounds for a nail or skin infection. [5] X Expert Source Mia Rubie Nail Artist Expert Interview. 23 April 2020. Try keeping your nails painted if you find yourself biting them often. The taste will discourage you from chewing them."
    },
    {
      "title": "Trim your nails frequently.",
      "content": "Trim your nails frequently. Use a pair of nail clippers to trim nails and keep them from growing too long. This can help prevent hangnail development. You can also use an orange stick to softly push cuticles back and keep them from growing onto your nail. Repeat the process once or twice a month. An orange stick is a thin, manicuring stick with one angled edge used to push back cuticles, and one pointed edge used to clean underneath the nails. Consider trimming your nails when they have been softened with some warm water. This will make cutting through the nail a lot easier. A regular manicure can help maintain healthy nails, and keep nail growth under control."
    },
    {
      "title": "Avoid acetone nail polish remover.",
      "content": "Avoid acetone nail polish remover. Acetone nail polish is a very effective nail polish remover, but it can also significantly dry out your hands and nails. Since hangnails develop when skin and nails are dry, steer clear from drying products. [6] X Research source Consider using less severe polish strippers like ethyl acetate, isopropyl alcohol, or propylene carbonate. You could also use polish removers that have added conditioners like glycerin and soy."
    },
    {
      "title": "Maintain a healthy, balanced diet.",
      "content": "Maintain a healthy, balanced diet. Eat foods high in iron, calcium, and B-vitamins to strengthen your nails and prevent hangnails in the future. Try to drink at least 8 glasses of water per day to stay hydrated as well. [7] X Research source Consider taking a vitamin supplement if you don’t get enough through your diet. Biotin is a supplement that helps strengthen your nails. Ask your doctor if a supplement is right for you. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}