{
  "url": "https://www.wikihow.com/Evolve-Porygon",
  "title": "The Ultimate Guide to Evolve Porygon into Porygon2 & Porygon-Z",
  "steps": [
    {
      "title": "Porygon",
      "content": "Porygon Unfortunately, there’s no way to catch Porygon in the wild unless you’ve purchased The Hidden Treasure of Area Zero DLC. If you’ve caught Porygon in a different Pokémon Switch game (like Sword/Shield, Arceus, Let’s Go Pikachu/Eevee), however, you can use Pokémon HOME to transfer Pokémon between games ($2 per month, $5 per 90 days, $12 per year). [1] X Research source If you own the DLC: Find Porygon in the Polar Biome or Cavern Biome, as well as the Chargestone Cavern. Porygon can also be caught in certain 3-Star Tera Raid Battles. If you have friends who purchased the DLC, ask if they can catch and trade a Porygon with you."
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Equip your Porygon with the Upgrade item, which you receive after filling the Blueberry Pokédex with 100 Pokémon. [2] X Research source Invite a friend to trade with you—upon being traded, your Porygon will evolve into a Porygon2. [3] X Research source If you own the DLC, Porygon2 can be acquired via 5-Star or 6-Star Tera Raid Battles. [4] X Research source Enter 0137-0137 as a trade code if you don’t have a friend who plays Scarlet/Violet. Chances are, you’ll be paired up with someone who’s also looking to trade and evolve their Porygon. [5] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Equip your Porygon2 with a Dubious Disc, which you receive after getting 110 unique entries in the Blueberry Pokédex. [6] X Research source Like before, trade your Porygon2 with a friend, which allows it to evolve into Porygon-Z. If you own the DLC, you can potentially get Porygon-Z from a 5-Star or 6-Star Raid Battle. [7] X Research source Input 0233-0233 as a trade code if you don’t have a friend available to trade with you. [8] X Research source"
    },
    {
      "title": "Enter space-time distortions to catch Porygon, Porygon2, and Porygon-Z.",
      "content": "Enter space-time distortions to catch Porygon, Porygon2, and Porygon-Z. Visit the Crimson Mirelands and play up to 40 minutes without taking time to rest in-game. The longer you move, the higher the chance you have of encountering a distortion (until the 40-minute mark, when you have a 100% chance). Enter the distortion for a chance to catch Porygon, Porygon2, and/or Porygon-Z. [9] X Research source Keep in mind that members of the Porygon evolutionary line are considered “rare spawns” and may not pop up right away in your first few encounters."
    },
    {
      "title": "Porygon",
      "content": "Porygon Visit the Pokémon Mansion off Route 212 once your Pokédex gets the National upgrade. In the Trophy Garden behind the Mansion, all sorts of Pokémon not native to the Sinnoh region can be caught, including Porygon. [10] X Research source Porygon only has a 5% spawn rate, so be patient!"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Give your Porygon the Upgrade item, which you receive at Ramanas Park after meeting with Professor Oak (when he upgrades your Pokédex). Then, trade your Porygon with another player to evolve it into Porygon2. [11] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Give your Porygon2 a Dubious Disc, which can be recovered on Route 225 (by Surfing across the lake that’s above the house). [12] X Research source Then, trade your Porygon2 with another player so it evolves into Poryon-Z. [13] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Purchase The Isle of Armor DLC and finish the playable storyline. At the end, fight and beat Master Mustard to receive Porygon. [14] X Research source If you don’t have the DLC, try your luck with trading (or transfer it from another game using Pokémon HOME)."
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Grab the Upgrade item from the Training Lowlands and give it to your Porygon. Then, trade your Porygon with another player so Porygon can evolve into Porygon2. [15] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Head to a small island on Workout Sea to pick up a Dubious Disc. Equip this item with your Porygon2, and trade it with another player so Porygon2 can transform into Porygon-Z. [16] X Research source"
    },
    {
      "title": "Only Porygon is available in the Let’s Go titles.",
      "content": "Only Porygon is available in the Let’s Go titles. Let’s Go, Pikachu! and Let’s Go, Eevee! only have 1st-generation Pokémon, so Porygon2 (Gen 2) and Porygon-Z (Gen 4) aren’t available yet. [17] X Research source Porygon can be found on Route 7, and you can also receive one from an NPC in Saffron City’s Pokémon Center after you’ve completed the Silph Co. battles against Team Rocket. [18] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon In regular Pokémon Sun and Moon, get Porygon by visiting the Aether House on Route 15 once you’ve successfully defeated the Pokémon League and become the Pokémon Champion. [19] X Research source In Ultra Sun and Ultra Moon, receive Porygon after finishing the Episode RR mission (that comes after the Alola League). [20] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Get the Upgrade from the Aether House in both Sun/Moon and Ultra Sun/Ultra Moon. [21] X Research source Give it your Porygon2, and trade it with a friend to complete the evolution. [22] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Find the Dubious Disc in Aether Paradise, which is situated between the four main islands. [23] X Research source Equip this item on your Porygon2, and then trade the Pokémon with another player so it can evolve into Porygon-Z. [24] X Research source"
    },
    {
      "title": "Porygon, Porygon2, and Porygon-Z aren’t available organically.",
      "content": "Porygon, Porygon2, and Porygon-Z aren’t available organically. Given how outdated the game currently is, your best shot at getting any Pokémon in the Porygon evolutionary line is by using the Global Trading System (GTS) built into the game. [25] X Research source Keep in mind, though, that not very many people play X and Y anymore, so it might be hard to find someone willing to trade. If you’re able to get your hands on a Porygon, evolve it into Porygon2 by equipping it with an Upgrade and trading it. To get Porygon-Z, equip the Porygon2 with Dubious Disc and trade it. These items can both be purchased at the Battle Maison for 32 Battle Points. [26] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Find Porygon on the Mirage Island, which can be found above Route 125. It’s also possible to catch Porygon on Mirage Mountain, which is southeast of Route 129. [27] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Purchase an Upgrade from the Battle Maison for 32 Battle Points. Then, give this item to your Porygon and trade it with another player. [28] X Research source This allows Porygon to evolve into Porygon2. [29] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Buy a Dubious Disc from the Battle Maison for 32 Points and equip it on your Porygon2. [30] X Research source Invite a friend to trade with you so your Porygon2 can then evolve into a Porygon-Z. [31] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Unfortunately, Porygon can only be found organically in Pokémon White by searching the White Forest (especially when Leo is a current resident). Porygon could be obtained in Pokémon White 2 and Black 2 with the help of the Dream Radar 3DS app, but the 3DS is now closed, so it’s no longer possible to get them. [32] X Research source It’s potentially possible to get a Porygon via infrared or local wireless trading on Pokémon Black if you have a friend nearby who’s willing to trade. [33] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Find the Upgrade item on Route 15 if you’re playing Black or White, or in Striaton City or Pinwheel Forest if you’re playing Black 2 or White 2. [34] X Research source Give the Upgrade to your Porygon and trade it with a friend to evolve it. [35] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Visit the P2 Laboratory in both Black/White and Black 2/White 2 to find the Dubious Disc. Give the item to your Porygon2, and then initiate a trade so your Pokémon can evolve. [36] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Just like in Brilliant Diamond and Shining Pearl, Porygon can be caught in the Trophy Garden behind the Pokémon Mansion on Route 212. [37] X Research source In Pokémon Platinum, visit the house northeast of the Veilstone City Pokémon Center to find one. [38] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 In Diamond and Pearl, find an Upgrade in Eterna City by speaking with Professor Oak in Pal Park at the end of the game. [39] X Research source In Platinum, obtain an Upgrade from Route 224 or the Team Galactic Eterna Building. [40] X Research source To evolve Porygon, simply equip it with the Upgrade and trade it with another player. [41] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z In Diamond and Pearl, find the Dubious Disc on Route 225; in Platinum, locate one at the Team Galactic HQ in Veilstone City. [42] X Research source Give this item to your Porygon2 and initiate a trade so it evolves into Porygon-Z. [43] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Visit the Celadon Game Corner and earn enough coins to buy the Porygon for 9,999 coins (in the right window). [44] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Locate an Upgrade item at Silph Co. and give it to your Porygon to hold. [45] X Research source Then, trade the Porygon with a friend using the Union Room feature in all Pokémon Centers. [46] X Research source"
    },
    {
      "title": "Porygon-Z",
      "content": "Porygon-Z Find the Dubious Disc on Route 42 and give it to your Porygon2. [47] X Research source Using the Union Room feature in the Pokémon Centers, trade your Porygon2 and wait for it to evolve into Porygon-Z. [48] X Research source"
    },
    {
      "title": "Porygon",
      "content": "Porygon Visit the Rocket Game Corner and collect enough coins to purchase the Porygon from the middle window (9,999 Coins in FireRed, 6500 Coins in LeafGreen). [49] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Find the Upgrade item in the Rocket Warehouse in the Sevii Islands and equip it on your Porygon. Then, go to a Pokémon Center and visit the right-most counter to visit the Trade Center. Use a game link cable or wireless adapter to start the trade so your Porygon evolves to Porygon2. [50] X Research source These trading methods are very outdated, but they’re necessary for trading between GBA games. They’re also the only way to trade a Porygon to your Ruby, Sapphire, or Emerald game."
    },
    {
      "title": "Porygon",
      "content": "Porygon Head to the Celadon Game Center and earn 9,999 Coins to buy the Porygon from the right window. [51] X Research source"
    },
    {
      "title": "Porygon2",
      "content": "Porygon2 Find the Upgrade item at the Silph Co. and give it to your Porygon. [52] X Research source Then, use a Game Boy link cable to trade with another friend who has a physical Game Boy. After the trade, your Porygon will evolve. [53] X Research source"
    }
  ]
}