{
  "url": "https://www.wikihow.com/Develop-a-Character-for-a-Story",
  "title": "How to Create and Develop a Fictional Character",
  "steps": [
    {
      "title": "Choose a character archetype.",
      "content": "Choose a character archetype. Starting with a character archetype can help you narrow your focus and find a starting point for your character. Archetypes help guide a character’s emotions, behaviors, and decisions, as well as the development of their character and story arc. [1] X Research source The twelve commonly recognized archetypes in literature are the Innocent, Everyman, Hero, Outlaw, Explorer, Creator, Ruler, Magician, Lover, Caregiver, Jester, and Sage."
    },
    {
      "title": "Add personality traits and characteristics.",
      "content": "Add personality traits and characteristics. Dominant personality traits will define your character and guide their actions. Is your character adventurous or cautious? Are they a dreamer or a pragmatist? Are they empathetic or standoffish? Are they charismatic or socially awkward? [2] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source It may help to base the core qualities of your character’s personality type off of someone you know in real life. Include quirks or special skills your character may have: Are they obsessed with solving crosswords, or do they have a natural connection to animals? Do they always have their headphones in their ears, or is their skateboard attached to them at the hip? Include faults as well as strengths: Is your character chronically late or forgetful? Are they overly critical of others, or overly trusting? Do they have a quick temper or make decisions impulsively?"
    },
    {
      "title": "Choose your character’s name, age, and race.",
      "content": "Choose your character’s name, age, and race. Pick a name that suits your character’s personality, like “Bash” for a bold and destructive persona. Choose a racial and ethnic background for your character, as well as a nationality. Determine your character’s age and consider how their age will change the point of view of the story. [3] X Research source For example, your character may be twelve years old and just starting to experience puberty. You may then try to write from the perspective of a twelve-year old, using your own experiences at that age as inspiration. [4] X Research source Remember that you may need to age your character up if your story has a long time scale. If your story takes place in a certain region and time period, consider historical accuracy and cultural context when choosing a name and ethnicity. If you decide to create a character that is a race or nationality that is different than your own, be prepared to do research into that race or nationality to avoid falling into stereotypes or inaccurate portrayals."
    },
    {
      "title": "Create a visual image of your character.",
      "content": "Create a visual image of your character. Even for a written story without visuals, it’s important for readers to be able to visualize the character. Jot down notes about their physical appearance or draw a picture of them. You can even use Google Image search or Pinterest to put together visual references of what you imagine your character’s physical appearance to be like. [5] X Research source What is your character’s body type? Short, tall, skinny, muscular, stocky, curvy… What color are your character’s eyes? Blue, green, brown, grey, hazel… What color is your character’s hair? Blonde, red, pin, black with streaks of grey… What clothing does your character wear and what does it say about their personality? Designer clothes to show wealth, leather jackets to appear tough… Does your character have any distinguishing physical traits? Freckles, piercings, tattoos, scars, a limp when they walk…"
    },
    {
      "title": "Describe their likes and dislikes.",
      "content": "Describe their likes and dislikes. Determine what they do not like, such as food that makes them gag or pet peeves like people who don't clean up after themselves, untrained dogs, smokers etc. [6] X Research source You can then use their likes and dislikes as features in your story. For example, you may have a character who hates olives and loves tacos. Or, maybe your main character is obsessed with a television character and binge watches the same TV show on repeat."
    },
    {
      "title": "Choose a voice.",
      "content": "Choose a voice. Write in first person to allow your character to narrate the story themselves. You may be better able to convey your character’s internal emotions. Writing in third person , however, means that an outside and objective narrator is describing the story and revealing information about the character. [7] X Research source"
    },
    {
      "title": "Build a backstory by describing how the character grew up.",
      "content": "Build a backstory by describing how the character grew up. Provide insight into the character’s home life and early experiences. Note where in the world the character was born and raised. You can then use their home life to add details to their character, such as how they speak, how they express themselves, and how they view the world. [8] X Research source For example, maybe your character grew up in a deprived part of the American Deep South. They may then use certain vernacular and approach the world in a certain way."
    },
    {
      "title": "Describe the character’s family.",
      "content": "Describe the character’s family. Outline whether the character has both parents who still live at home, or parents who are divorced. Maybe the character’s mother is now married to another man, or the character’s father is a widow and their mother died in their childhood. [9] X Research source Consider any siblings they have. Maybe your character is an only child and is close to cousins or has a particular group of friends. Maybe the character has five siblings and grew up in a large family, but has a really close relationship with one sibling in particular, or is estranged from their eldest brother? Don't forget about other familial relationships your character has. They may be really close to their uncle or their grandmother, for example."
    },
    {
      "title": "Outline the character’s schooling if applicable.",
      "content": "Outline the character’s schooling if applicable. Decide if your character went to high school and university or dropped out of education altogether. Determine if your character is currently at school and what grade or level they are in. Outlining your character’s schooling will tell the reader about your character’s education level. [10] X Research source You may have a character who did not finish school or dropped out and instead worked odd jobs to gain life experience. This could play into their character as a whole and their approach to the world."
    },
    {
      "title": "Determine their relationship status.",
      "content": "Determine their relationship status. Is your character single? Married? Divorced? In an open relationship? Maybe your character is involved with one of your other characters in the story, or with a minor character that only appears once. Determining their relationship status will help to clarify their interactions with other characters. [11] X Research source For example, you may have a character who is romantically involved with the other main character in your story. Or, you may have a character who is recently divorced and trying to deal with the break-up of their marriage."
    },
    {
      "title": "Give the character a goal or motivation.",
      "content": "Give the character a goal or motivation. A developed character will have a clear desire that motivates them to take action in the story. Their desire can be something seemingly small, such as wanting to ask someone out on a date. Or their goal can be large, such as wanting to save the world from mass destruction. Giving your character a desire or goal will ensure they are active in your story. [12] X Research source For example, your character may have a desire to leave their small town and escape their abusive family life. Or, perhaps your character wants to learn how to throw a football correctly so they can join a local sports team."
    },
    {
      "title": "Create conflict for the character.",
      "content": "Create conflict for the character. Make your character’s life difficult so they can rise to the occasion and take action. Put obstacles in the way of your character’s desires or goals. The obstacles could be another character, a natural disaster, financial difficulties, or something else. This will create conflict and force your character to make decisions about what to do. [13] X Research source For example, your character may struggle to leave their lonesome, small town because they have to care for their elderly mother and have no money to go anywhere. Or your character may find it hard to throw a football because they suffered a shoulder injury earlier in life."
    },
    {
      "title": "Allow the character to be vulnerable and make mistakes.",
      "content": "Allow the character to be vulnerable and make mistakes. Do not write a perfect character who gets exactly what they want and has no problems. This character will be boring and unrelatable to your readers. Instead, show your reader how your character deals with their flaws and learns from their mistakes in the story. [14] X Research source For example, you may have a character who has addiction issues, causing them to lash out and hurt others around them. Or you may have a character who is too prideful to admit they are wrong, causing them to have poor relationships with their children. Your character could have a particular phobia that holds them back from their goals, like heights, water, blood, large crowds, or the dark. While your character should be flawed and relatable, they should still be admired and liked by the reader. You may want to give them classic heroic qualities like special abilities or an underdog background."
    },
    {
      "title": "Show how the character thinks.",
      "content": "Show how the character thinks. Emphasize the character’s internal thoughts and feelings as much as you do their surface-level actions. Write an internal monologue for the character so the reader gets a good sense of how the character perceives the world around them. Let your character have moments of introspection, where they muse or think through their ideas and thoughts. [15] X Research source For example, you may include moments of introspection like: Sadie thought about how angry her mother would be when she got home, five minutes past her curfew. Would she confiscate her mobile phone again or just throw something at her head? Would she go on about how worthless and irresponsible she is? Maybe she fell asleep on pain pills again, dead to the world. Sadie crossed her fingers as she stepped inside."
    },
    {
      "title": "Include dialogue that is specific to the character.",
      "content": "Include dialogue that is specific to the character. Give the reader a sense of how the character speaks, including any slang or lingo they may use. Make the character’s voice unique and specific to their experiences as well as where they grew up. Tell the reader more about your character through their dialogue. [16] X Research source For example, you may have a character who speaks in a combination of English and Spanish to reflect their background and family life. You can also have a character who has a catchphrase that they say when they feel nervous, such as “Holy mother!” or “Seriously, dude.”"
    },
    {
      "title": "Develop supporting characters.",
      "content": "Develop supporting characters. Create a group of characters in your story that contrast with one another. Supporting characters should not be too similar to the main character, otherwise your protagonist will have no reason to grow or evolve throughout the story. [17] X Research source A secondary character may serve to highlight the traits of a main character, cause conflict, or teach them a lesson that helps their character development. Consider Ron and Hermione as sidekicks to Harry Potter. They each have their own developed character traits and backstory, but they are different to Harry and balance out his strengths and weaknesses."
    },
    {
      "title": "Character development showcases a character’s growth.",
      "content": "Character development showcases a character’s growth. The character must face challenges and overcome them in order to develop as an individual. Character development is crucial for writers when creating a character. Even in a fictional story, writers want their characters to have the same depth and nuance as real human beings. [18] X Research source The essential elements of character development are backstory, flaws, goals, personality, and worldview. Similarly, a character arc is how the character’s emotional and personal journey travels from start to finish throughout the story."
    },
    {
      "title": "A notable example of character development is Ebenezer Scrooge.",
      "content": "A notable example of character development is Ebenezer Scrooge. In Charles Dickens’ A Christmas Carol, Scrooge’s character starts off as cold-hearted, greedy, and anti-Christmas. His character develops as he gains awareness about his bad behavior after being shown visions of his past. By the end of the story, he becomes a warm and generous character who appreciates the Christmas spirit. [19] X Research source Other famous examples of excellent character development are Jane Eyre in Jane Eyre, Janie Crawford in Their Eyes Were Watching God, Holden Caulfield in The Catcher in the Rye, and Walter White in Breaking Bad. [20] X Research source"
    }
  ]
}