{
  "url": "https://www.wikihow.com/Get-Things-Done-Fast",
  "title": "How to Get Things Done Fast",
  "steps": [
    {
      "title": "Focus on doing only one task at a time.",
      "content": "Focus on doing only one task at a time. When you’re trying to get things done fast, it might be tempting to multitask. However, doing multiple things at once will only slow you down. Pick one task and work on only that task until you’ve run out of time or finished it. Then, you can move on to the next thing that you need to do. [1] X Research source Even if you have multiple similar tasks to do, only do one thing at a time and don’t jump back and forth between them. For example, work on only sending emails or finishing a report. Don’t finish a page of the report and then send a few emails before working on the report again."
    },
    {
      "title": "Group tasks based on where or how you do them.",
      "content": "Group tasks based on where or how you do them. Try to accomplish multiple tasks in a row in the same spot, like by your computer or on your phone. Then, you can get all of the things done that you need to do in one place without wasting time by starting and stopping tasks to move from place to place. [2] X Research source For instance, if you have to look up the phone number for a few local businesses and buy something online, you can use your phone to look up the contact information, and then place the order through an app. Then, you can put your phone away and focus on completing other tasks. If you have a few phone calls to make, make them consecutively, and then take a break from using your phone while you finish other tasks."
    },
    {
      "title": "Do your most challenging tasks in the morning.",
      "content": "Do your most challenging tasks in the morning. Try to get your most difficult tasks out of the way in the morning when you have the most energy and motivation, which will help you work through them quickly. Aim to finish all of your difficult tasks before noon, leaving the second half of the day for less important tasks and planning for the next day. [3] X Research source For instance, if you have a term paper to finish and a few calls to make, you should plan to finish the paper in the morning, and make the phone calls in the afternoon. That way, the paper will be completed and you can knock out the smaller tasks quickly."
    },
    {
      "title": "Put on a pair of headphones to block out distracting noise.",
      "content": "Put on a pair of headphones to block out distracting noise. When you’re trying to work quickly, distractions can throw off your schedule. Wear a pair of headphones and listen to music, an audiobook, a newscast, or a podcast to block out distracting noise. [4] X Research source This is especially helpful if you’re working around other people who are talking or generally being loud."
    },
    {
      "title": "Reward yourself with frequent, short breaks to refresh your energy.",
      "content": "Reward yourself with frequent, short breaks to refresh your energy. Avoid burnout by giving your mind and body time to rest throughout the day. Some experts recommend 10 minutes of rest for every 50 minutes of work, but you can adjust this as needed. On your break, check your text messages, grab a cup of coffee, go for a walk, or have a snack. [5] X Research source Even if you don’t feel like you need a break, take a short one anyway. Stand up and stretch, or take some time to drink some water. Your body will thank you!"
    },
    {
      "title": "Make a cleaning bucket or “tool belt” for deep cleaning.",
      "content": "Make a cleaning bucket or “tool belt” for deep cleaning. Fill a bucket with all of the cleaning products that you need, or repurpose an old tool belt by filling it with brushes, towels, and cleaning supplies. Then, carry the bucket or wear the belt around the house while you clean to keep you from running back and forth to your cleaning supplies. [6] X Research source When you use an item, remember to put it back in the bucket or replace it with a new one for the next time you clean."
    },
    {
      "title": "Ask the rest of the people in your house to lend a hand.",
      "content": "Ask the rest of the people in your house to lend a hand. Have your kids or a roommate help with doing laundry, or create an assembly line for putting away the dishes. Delegating different jobs to different people means that one person won’t end up doing all of the work, and everyone will feel like they contributed. [7] X Research source If your house or apartment has multiple floors, consider having a bucket for each floor to avoid having to carry all of your products up and down the stairs."
    },
    {
      "title": "Focus on completing one room at a time.",
      "content": "Focus on completing one room at a time. Start working on a room and don’t stop until you’ve finished everything that needs to be done in that room. Avoid moving back and forth between rooms, and plan your cleaning so that you can work your way through the house in order. [8] X Research source For instance, in your bedrooms, focus on gathering dirty clothes, putting away clean clothes, making the bed, dusting, and vacuuming. Once you finish the bedroom, move to the bathroom to spray down the surfaces, clean the toilet, clean the mirror, scrub the sink and shower, wipe down the surfaces, and mop the floor. In the kitchen, do the dishes, load the dishwasher, clean the counters, wipe down appliances, and mop the floor. Save the living room for the last part, and remember to clean up clutter, dust the room, wipe down surfaces, and vacuum the entire room."
    },
    {
      "title": "Vacuum and mop from the farthest corner of the room to the doorway.",
      "content": "Vacuum and mop from the farthest corner of the room to the doorway. When you need to clean the floors, start in the farthest corner away from the door, and work in long, straight lines to cover as much area as possible. Try to avoid overlapping rows, and don’t be concerned about missing a small strip of floor in between rows. [9] X Research source Once you’re done mopping or vacuuming, you can pull the vacuum or mop out of the doorway and move on to the next room."
    },
    {
      "title": "Write down all of the tasks that you need to accomplish.",
      "content": "Write down all of the tasks that you need to accomplish. Planning ahead will help give you a realistic idea of how much you can do in one day. Think of all of the things that you need to do, and write them down in a to-do list , or keep an ongoing list on your phone. [10] X Research source For some people, having a written list is more helpful because they can cross of each task as they finish it. If you won’t get distracted by your phone, you can use a reminder or to-do list app to make a virtual list. Then, you can remove each task as you finish it, and you don’t have to worry about losing your list."
    },
    {
      "title": "Estimate how long it will take you to do each task.",
      "content": "Estimate how long it will take you to do each task. Give yourself enough time to finish the task, but don’t overestimate how long it will take. Try assign each task a 15, 30, or 60 minute block of time to accomplish that task. All of your estimates should correspond with the amount of work that goes into each task. [11] X Research source For example, vacuuming the house might take 15 minutes, depending on how many rooms you have to vacuum. Writing a business report might take longer, like 60 minutes, because it requires research and writing."
    },
    {
      "title": "Set a 5 or 10-minute time limit on smaller tasks.",
      "content": "Set a 5 or 10-minute time limit on smaller tasks. Things like making phone calls or sending emails can become very time-consuming. When you’re making your daily schedule, devote a short period of time to accomplishing as many small tasks as possible in that window of time. This will prevent them from taking up the majority of your day. [12] X Research source For example, if you have a lot of phone calls and emails to send, devote 10 minutes to making as many phone calls as possible, focusing on the most important calls first. If you have a lot of emails to reply to, set aside 10 minutes to respond to the most pressing emails, and then leave the rest for a day when you have more free time."
    },
    {
      "title": "Use a timer to ensure that you’re staying within your time limits.",
      "content": "Use a timer to ensure that you’re staying within your time limits. Set a timer on your phone or use a stopwatch to remind you how long you’re taking on a task. If you allotted 30 minutes for a task, set the timer for 30 minutes and check your progress when the timer goes off. If you’re close to finishing, use an extra 5 or 10 minutes to get the task done. [13] X Research source If you’re less than 3/4 of the way finished with the task, consult your schedule to see which tasks can be put off so that you can finish. Alternatively, you can stop working on the task if it doesn’t need to be completed that day."
    },
    {
      "title": "Get back on schedule after a distraction.",
      "content": "Get back on schedule after a distraction. If you do happen to get distracted during the day, don’t worry! Consult your schedule to see how much time you spent, and get rid of tasks that aren’t important. Give priority to tasks that need to be completed today, and put off anything that can wait. [14] X Research source If you need to ask for an extension on the deadline for an assignment, be sure to explain the situation. Don’t expect to be granted an extension, and don’t use the extension to procrastinate until the new deadline!"
    },
    {
      "title": "Pay close attention to your calendar and deadline.",
      "content": "Pay close attention to your calendar and deadline. Sometimes, having a deadline can make you work faster in order to “beat the clock.” This will also help you organize your work to get it done in a timely manner. [15] X Research source If your deadline is far away, you can split up your work over many days. However, if it’s closer, you may need to devote a few days just to working on completing the project."
    }
  ]
}