{
  "url": "https://www.wikihow.com/Get-Out-of-Federal-Jury-Duty",
  "title": "How to Get Out of Federal Jury Duty",
  "steps": [
    {
      "title": "Use the eJuror Program.",
      "content": "Use the eJuror Program. When you receive a jury summons in the mail, it will include instructions to respond to a jury qualification questionnaire. You can answer the questions online by logging into the national eJuror Program. Simply visit the website of the court that sent you the jury summons and look for a link to the eJuror program. [3] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source It will contain instructions for logging in and answering the qualification questionnaire."
    },
    {
      "title": "Check to see if you are legally qualified for jury service.",
      "content": "Check to see if you are legally qualified for jury service. To serve on a federal jury, you must meet a number of conditions. If you do not meet any of the following conditions, indicate which ones on your questionnaire. To serve, you must be: A citizen of the United States; At least 18 years old; A resident of your judicial district for at least one year; Adequately proficient in English to complete the juror qualification questionnaire; Free from a disqualifying mental or physical condition; Not currently charged with a felony that might result in imprisonment for more than a year; and Free from an prior felony convictions, unless your civil rights have been legally restored. [4] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source"
    },
    {
      "title": "Determine if you are part of an exempt group.",
      "content": "Determine if you are part of an exempt group. There are three groups that are exempt from federal jury service. If you belong to one of these groups, indicate it on your questionnaire. You are exempt if you are: In the armed forces on active duty; Employed by a fire or police department; or A local, state, or federal public officer who works in that position full-time. [5] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source"
    },
    {
      "title": "Write a letter explaining why you shouldn't need to serve.",
      "content": "Write a letter explaining why you shouldn't need to serve. The Jury Act gives courts discretion to excuse jurors for “undue hardship or extreme inconvenience.” If you believe that you should not be required to serve, write a letter to the court clerk explaining your particular circumstances. [6] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source If the court rejects your request, you can still ask to be excused when you attend court. Examples of undue hardship and extreme inconvenience include living a great distance or long travel time from the court or a grave illness or emergency in your family that outweighs the importance of jury service. You can also ask the court to consider other hardships that are similarly significant. [7] X Research source"
    },
    {
      "title": "Attend your jury service date.",
      "content": "Attend your jury service date. In order to ask to be excused, you must attend your service date and make your request to the judge. Dress professionally, and follow any appearance guidelines mentioned in your jury summons. By dressing professionally, you show the judge that you respect the process of jury selection, even though you will be asking to be excused."
    },
    {
      "title": "Wait for the judge to ask.",
      "content": "Wait for the judge to ask. The judge will explain the procedures and the importance of jury selection before asking if anyone on the jury is unable to serve. At this time, you will have an opportunity to explain why you believe you should be excused from serving."
    },
    {
      "title": "Give a hardship excuse.",
      "content": "Give a hardship excuse. You may be able to persuade the judge to excuse you if serving on a jury would be an unreasonable hardship for you or your family. For example, if you if your advanced age makes it difficult for you to attend the trial. [8] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source You may also be excused if you are needed at home to care for a child or sick relative (or are a primary caregiver for someone young or old [9] X Research source ), or if you are having financial difficulties and cannot afford to miss work. You will probably be excused if you are a teacher or student and would have to miss classes to serve, or if you do not have a reliable mode of transportation. [10] X Research source [11] X Research source Each court has its own procedures and policies for excusing jurors from serving. [12] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source Federal jurors are paid $40 per day. Federal employees are paid their regular salary instead of the $40 fee. The fee increases to $50 after 10 days for trial jurors and after 45 days for grand jurors. [13] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source Your employer is not required to pay you for days that you miss while serving on a jury, but your employer cannot fire, intimidate, or punish you for serving on a jury. [14] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source If your service would be an undue hardship on your employer because your presence at work is critical to the business, you can ask your employer to write a letter to the court explaining the circumstances and requesting your excusal. [15] X Research source"
    },
    {
      "title": "Provide a scheduling excuse.",
      "content": "Provide a scheduling excuse. You may be excused if you have a scheduling conflict, such as an important work function, non-refundable tickets or a long-planned vacation. However, the court will reschedule your service date to another time that is more convenient. You will often be given more than one chance to defer your service date. [16] X Research source However, although you can try to put off your service date repeatedly, you should consider serving sooner rather than later to avoid running out of postponements when serving would truly be inconvenient for you."
    },
    {
      "title": "Understand how lawyers pick juries.",
      "content": "Understand how lawyers pick juries. Jury selection, also known as voir dire , is the process by which the attorneys pick which members of the jury pool will serve on the jury and which will ultimately be dismissed. The prosecution and defense attorneys will take turns asking questions to the jury. Based on the answers the jurors give, the attorneys will then conference with the judge and take turns excusing the jurors they don’t want. [17] X Research source"
    },
    {
      "title": "Show your bias.",
      "content": "Show your bias. The prosecution wants to weed out jurors who may be biased in favor of the defendant. The defense wants to excuse jurors who may be biased against the defendant. Ideally, only impartial jurors will remain. If you suggest, or flat-out state that you are biased in favor of one side, the other side is very likely to excuse you from jury service. For example, attorneys commonly ask whether anyone has a family member or close friend in law enforcement. Defense attorneys are concerned that people with connections to law enforcement will be pro-prosecution and biased against the defendant. Some people hold political or religious beliefs incompatible with impartial jury service. They may not believe in the authority of the government or the fairness of the law under which the defendant has been charged. If you feel similarly, voice your opinion during jury selection. Similarly, if your religious beliefs prohibit you from sitting on a jury, judging others, or administering punishment, you should mention to the court or attorneys that you are a religious objector. [18] X Research source"
    },
    {
      "title": "Don’t lie.",
      "content": "Don’t lie. Judges and attorneys usually have a lot of experience in the jury selection process, and they have probably heard every possible excuse and insincerely-held bias. [19] X Research source If you make it obvious that you are trying to get out of serving on the jury, the attorneys will not be inclined to waste one of their limited dismissals (known as peremptory challenges) on you. If you lie about a hardship to get out of serving and the judge catches you in your lie, you can be punished. You could be charged with perjury, which is a felony. It is more likely that the judge would find you in contempt of court, in which case you might be fined or put in jail for several days. [20] X Research source"
    }
  ]
}